{
    "original": {
        "text": "The above everyday events had occurred, and a few weeks had passed, when on one fine morning, Parliament being over, the summer advanced, and all the good company in London about to quit that city for their annual tour in search of pleasure or health, the Batavier steamboat left the Tower-stairs laden with a goodly company of English fugitives. The quarter-deck awnings were up, and the benches and gangways crowded with scores of rosy children, bustling nursemaids; ladies in the prettiest pink bonnets and summer dresses; gentlemen in travelling caps and linen-jackets, whose mustachios had just begun to sprout for the ensuing tour; and stout trim old veterans with starched neckcloths and neat-brushed hats, such as have invaded Europe any time since the conclusion of the war, and carry the national Goddem into every city of the Continent. The congregation of hat-boxes, and Bramah desks, and dressing-cases was prodigious. There were jaunty young Cambridge-men travelling with their tutor, and going for a reading excursion to Nonnenwerth or Konigswinter; there were Irish gentlemen, with the most dashing whiskers and jewellery, talking about horses incessantly, and prodigiously polite to the young ladies on board, whom, on the contrary, the Cambridge lads and their pale-faced tutor avoided with maiden coyness; there were old Pall Mall loungers bound for Ems and Wiesbaden and a course of waters to clear off the dinners of the season, and a little roulette and trente-et-quarante to keep the excitement going; there was old Methuselah, who had married his young wife, with Captain Papillon of the Guards holding her parasol and guide-books; there was young May who was carrying off his bride on a pleasure tour (Mrs. Winter that was, and who had been at school with May's grandmother); there was Sir John and my Lady with a dozen children, and corresponding nursemaids; and the great grandee Bareacres family that sat by themselves near the wheel, stared at everybody, and spoke to no one. Their carriages, emblazoned with coronets and heaped with shining imperials, were on the foredeck, locked in with a dozen more such vehicles: it was difficult to pass in and out amongst them; and the poor inmates of the fore-cabin had scarcely any space for locomotion. These consisted of a few magnificently attired gentlemen from Houndsditch, who brought their own provisions, and could have bought half the gay people in the grand saloon; a few honest fellows with mustachios and portfolios, who set to sketching before they had been half an hour on board; one or two French femmes de chambre who began to be dreadfully ill by the time the boat had passed Greenwich; a groom or two who lounged in the neighbourhood of the horse-boxes under their charge, or leaned over the side by the paddle-wheels, and talked about who was good for the Leger, and what they stood to win or lose for the Goodwood cup.\nAll the couriers, when they had done plunging about the ship and had settled their various masters in the cabins or on the deck, congregated together and began to chatter and smoke; the Hebrew gentlemen joining them and looking at the carriages. There was Sir John's great carriage that would hold thirteen people; my Lord Methuselah's carriage, my Lord Bareacres' chariot, britzska, and fourgon, that anybody might pay for who liked. It was a wonder how my Lord got the ready money to pay for the expenses of the journey. The Hebrew gentlemen knew how he got it. They knew what money his Lordship had in his pocket at that instant, and what interest he paid for it, and who gave it him. Finally there was a very neat, handsome travelling carriage, about which the gentlemen speculated.\n\"A qui cette voiture la?\" said one gentleman-courier with a large morocco money-bag and ear-rings to another with ear-rings and a large morocco money-bag.\n\"C'est a Kirsch je bense--je l'ai vu toute a l'heure--qui brenoit des sangviches dans la voiture,\" said the courier in a fine German French.\nKirsch emerging presently from the neighbourhood of the hold, where he had been bellowing instructions intermingled with polyglot oaths to the ship's men engaged in secreting the passengers' luggage, came to give an account of himself to his brother interpreters. He informed them that the carriage belonged to a Nabob from Calcutta and Jamaica enormously rich, and with whom he was engaged to travel; and at this moment a young gentleman who had been warned off the bridge between the paddle-boxes, and who had dropped thence on to the roof of Lord Methuselah's carriage, from which he made his way over other carriages and imperials until he had clambered on to his own, descended thence and through the window into the body of the carriage, to the applause of the couriers looking on.\n\"Nous allons avoir une belle traversee, Monsieur George,\" said the courier with a grin, as he lifted his gold-laced cap.\n\"D---- your French,\" said the young gentleman, \"where's the biscuits, ay?\" Whereupon Kirsch answered him in the English language or in such an imitation of it as he could command--for though he was familiar with all languages, Mr. Kirsch was not acquainted with a single one, and spoke all with indifferent volubility and incorrectness.\nThe imperious young gentleman who gobbled the biscuits (and indeed it was time to refresh himself, for he had breakfasted at Richmond full three hours before) was our young friend George Osborne. Uncle Jos and his mamma were on the quarter-deck with a gentleman of whom they used to see a good deal, and the four were about to make a summer tour.\nJos was seated at that moment on deck under the awning, and pretty nearly opposite to the Earl of Bareacres and his family, whose proceedings absorbed the Bengalee almost entirely. Both the noble couple looked rather younger than in the eventful year '15, when Jos remembered to have seen them at Brussels (indeed, he always gave out in India that he was intimately acquainted with them). Lady Bareacres' hair, which was then dark, was now a beautiful golden auburn, whereas Lord Bareacres' whiskers, formerly red, were at present of a rich black with purple and green reflections in the light. But changed as they were, the movements of the noble pair occupied Jos's mind entirely. The presence of a Lord fascinated him, and he could look at nothing else.\n\"Those people seem to interest you a good deal,\" said Dobbin, laughing and watching him. Amelia too laughed. She was in a straw bonnet with black ribbons, and otherwise dressed in mourning, but the little bustle and holiday of the journey pleased and excited her, and she looked particularly happy.\n\"What a heavenly day!\" Emmy said and added, with great originality, \"I hope we shall have a calm passage.\"\nJos waved his hand, scornfully glancing at the same time under his eyelids at the great folks opposite. \"If you had made the voyages we have,\" he said, \"you wouldn't much care about the weather.\" But nevertheless, traveller as he was, he passed the night direfully sick in his carriage, where his courier tended him with brandy-and-water and every luxury.\nIn due time this happy party landed at the quays of Rotterdam, whence they were transported by another steamer to the city of Cologne. Here the carriage and the family took to the shore, and Jos was not a little gratified to see his arrival announced in the Cologne newspapers as \"Herr Graf Lord von Sedley nebst Begleitung aus London.\" He had his court dress with him; he had insisted that Dobbin should bring his regimental paraphernalia; he announced that it was his intention to be presented at some foreign courts, and pay his respects to the Sovereigns of the countries which he honoured with a visit.\nWherever the party stopped, and an opportunity was offered, Mr. Jos left his own card and the Major's upon \"Our Minister.\" It was with great difficulty that he could be restrained from putting on his cocked hat and tights to wait upon the English consul at the Free City of Judenstadt, when that hospitable functionary asked our travellers to dinner. He kept a journal of his voyage and noted elaborately the defects or excellences of the various inns at which he put up, and of the wines and dishes of which he partook.\nAs for Emmy, she was very happy and pleased. Dobbin used to carry about for her her stool and sketch-book, and admired the drawings of the good-natured little artist as they never had been admired before. She sat upon steamers' decks and drew crags and castles, or she mounted upon donkeys and ascended to ancient robber-towers, attended by her two aides-de-camp, Georgy and Dobbin. She laughed, and the Major did too, at his droll figure on donkey-back, with his long legs touching the ground. He was the interpreter for the party; having a good military knowledge of the German language, and he and the delighted George fought the campaigns of the Rhine and the Palatinate. In the course of a few weeks, and by assiduously conversing with Herr Kirsch on the box of the carriage, Georgy made prodigious advance in the knowledge of High Dutch, and could talk to hotel waiters and postilions in a way that charmed his mother and amused his guardian.\nMr. Jos did not much engage in the afternoon excursions of his fellow-travellers. He slept a good deal after dinner, or basked in the arbours of the pleasant inn-gardens. Pleasant Rhine gardens! Fair scenes of peace and sunshine--noble purple mountains, whose crests are reflected in the magnificent stream--who has ever seen you that has not a grateful memory of those scenes of friendly repose and beauty? To lay down the pen and even to think of that beautiful Rhineland makes one happy. At this time of summer evening, the cows are trooping down from the hills, lowing and with their bells tinkling, to the old town, with its old moats, and gates, and spires, and chestnut-trees, with long blue shadows stretching over the grass; the sky and the river below flame in crimson and gold; and the moon is already out, looking pale towards the sunset. The sun sinks behind the great castle-crested mountains, the night falls suddenly, the river grows darker and darker, lights quiver in it from the windows in the old ramparts, and twinkle peacefully in the villages under the hills on the opposite shore.\nSo Jos used to go to sleep a good deal with his bandanna over his face and be very comfortable, and read all the English news, and every word of Galignani's admirable newspaper (may the blessings of all Englishmen who have ever been abroad rest on the founders and proprietors of that piratical print! ) and whether he woke or slept, his friends did not very much miss him. Yes, they were very happy. They went to the opera often of evenings--to those snug, unassuming, dear old operas in the German towns, where the noblesse sits and cries, and knits stockings on the one side, over against the bourgeoisie on the other; and His Transparency the Duke and his Transparent family, all very fat and good-natured, come and occupy the great box in the middle; and the pit is full of the most elegant slim-waisted officers with straw-coloured mustachios, and twopence a day on full pay. Here it was that Emmy found her delight, and was introduced for the first time to the wonders of Mozart and Cimarosa. The Major's musical taste has been before alluded to, and his performances on the flute commended. But perhaps the chief pleasure he had in these operas was in watching Emmy's rapture while listening to them. A new world of love and beauty broke upon her when she was introduced to those divine compositions; this lady had the keenest and finest sensibility, and how could she be indifferent when she heard Mozart? The tender parts of \"Don Juan\" awakened in her raptures so exquisite that she would ask herself when she went to say her prayers of a night whether it was not wicked to feel so much delight as that with which \"Vedrai Carino\" and \"Batti Batti\" filled her gentle little bosom? But the Major, whom she consulted upon this head, as her theological adviser (and who himself had a pious and reverent soul), said that for his part, every beauty of art or nature made him thankful as well as happy, and that the pleasure to be had in listening to fine music, as in looking at the stars in the sky, or at a beautiful landscape or picture, was a benefit for which we might thank Heaven as sincerely as for any other worldly blessing. And in reply to some faint objections of Mrs. Amelia's (taken from certain theological works like the Washerwoman of Finchley Common and others of that school, with which Mrs. Osborne had been furnished during her life at Brompton) he told her an Eastern fable of the Owl who thought that the sunshine was unbearable for the eyes and that the Nightingale was a most overrated bird. \"It is one's nature to sing and the other's to hoot,\" he said, laughing, \"and with such a sweet voice as you have yourself, you must belong to the Bulbul faction.\"\nI like to dwell upon this period of her life and to think that she was cheerful and happy. You see, she has not had too much of that sort of existence as yet, and has not fallen in the way of means to educate her tastes or her intelligence. She has been domineered over hitherto by vulgar intellects. It is the lot of many a woman. And as every one of the dear sex is the rival of the rest of her kind, timidity passes for folly in their charitable judgments; and gentleness for dulness; and silence--which is but timid denial of the unwelcome assertion of ruling folks, and tacit protestantism--above all, finds no mercy at the hands of the female Inquisition. Thus, my dear and civilized reader, if you and I were to find ourselves this evening in a society of greengrocers, let us say, it is probable that our conversation would not be brilliant; if, on the other hand, a greengrocer should find himself at your refined and polite tea-table, where everybody was saying witty things, and everybody of fashion and repute tearing her friends to pieces in the most delightful manner, it is possible that the stranger would not be very talkative and by no means interesting or interested.\nAnd it must be remembered that this poor lady had never met a gentleman in her life until this present moment. Perhaps these are rarer personages than some of us think for. Which of us can point out many such in his circle--men whose aims are generous, whose truth is constant, and not only constant in its kind but elevated in its degree; whose want of meanness makes them simple; who can look the world honestly in the face with an equal manly sympathy for the great and the small? We all know a hundred whose coats are very well made, and a score who have excellent manners, and one or two happy beings who are what they call in the inner circles, and have shot into the very centre and bull's-eye of the fashion; but of gentlemen how many? Let us take a little scrap of paper and each make out his list.\nMy friend the Major I write, without any doubt, in mine. He had very long legs, a yellow face, and a slight lisp, which at first was rather ridiculous. But his thoughts were just, his brains were fairly good, his life was honest and pure, and his heart warm and humble. He certainly had very large hands and feet, which the two George Osbornes used to caricature and laugh at; and their jeers and laughter perhaps led poor little Emmy astray as to his worth. But have we not all been misled about our heroes and changed our opinions a hundred times? Emmy, in this happy time, found that hers underwent a very great change in respect of the merits of the Major.\nPerhaps it was the happiest time of both their lives, indeed, if they did but know it--and who does? Which of us can point out and say that was the culmination--that was the summit of human joy? But at all events, this couple were very decently contented, and enjoyed as pleasant a summer tour as any pair that left England that year. Georgy was always present at the play, but it was the Major who put Emmy's shawl on after the entertainment; and in the walks and excursions the young lad would be on ahead, and up a tower-stair or a tree, whilst the soberer couple were below, the Major smoking his cigar with great placidity and constancy, whilst Emmy sketched the site or the ruin. It was on this very tour that I, the present writer of a history of which every word is true, had the pleasure to see them first and to make their acquaintance.\nIt was at the little comfortable Ducal town of Pumpernickel (that very place where Sir Pitt Crawley had been so distinguished as an attache; but that was in early early days, and before the news of the Battle of Austerlitz sent all the English diplomatists in Germany to the right about) that I first saw Colonel Dobbin and his party. They had arrived with the carriage and courier at the Erbprinz Hotel, the best of the town, and the whole party dined at the table d'hote. Everybody remarked the majesty of Jos and the knowing way in which he sipped, or rather sucked, the Johannisberger, which he ordered for dinner. The little boy, too, we observed, had a famous appetite, and consumed schinken, and braten, and kartoffeln, and cranberry jam, and salad, and pudding, and roast fowls, and sweetmeats, with a gallantry that did honour to his nation. After about fifteen dishes, he concluded the repast with dessert, some of which he even carried out of doors, for some young gentlemen at table, amused with his coolness and gallant free-and-easy manner, induced him to pocket a handful of macaroons, which he discussed on his way to the theatre, whither everybody went in the cheery social little German place. The lady in black, the boy's mamma, laughed and blushed, and looked exceedingly pleased and shy as the dinner went on, and at the various feats and instances of espieglerie on the part of her son. The Colonel--for so he became very soon afterwards--I remember joked the boy with a great deal of grave fun, pointing out dishes which he hadn't tried, and entreating him not to baulk his appetite, but to have a second supply of this or that.\nIt was what they call a gast-rolle night at the Royal Grand Ducal Pumpernickelisch Hof--or Court theatre--and Madame Schroeder Devrient, then in the bloom of her beauty and genius, performed the part of the heroine in the wonderful opera of Fidelio. From our places in the stalls we could see our four friends of the table d'hote in the loge which Schwendler of the Erbprinz kept for his best guests, and I could not help remarking the effect which the magnificent actress and music produced upon Mrs. Osborne, for so we heard the stout gentleman in the mustachios call her. During the astonishing Chorus of the Prisoners, over which the delightful voice of the actress rose and soared in the most ravishing harmony, the English lady's face wore such an expression of wonder and delight that it struck even little Fipps, the blase attache, who drawled out, as he fixed his glass upon her, \"Gayd, it really does one good to see a woman caypable of that stayt of excaytement.\" And in the Prison Scene, where Fidelio, rushing to her husband, cries, \"Nichts, nichts, mein Florestan,\" she fairly lost herself and covered her face with her handkerchief. Every woman in the house was snivelling at the time, but I suppose it was because it was predestined that I was to write this particular lady's memoirs that I remarked her.\nThe next day they gave another piece of Beethoven, Die Schlacht bei Vittoria. Malbrook is introduced at the beginning of the performance, as indicative of the brisk advance of the French army. Then come drums, trumpets, thunders of artillery, and groans of the dying, and at last, in a grand triumphal swell, \"God Save the King\" is performed.\nThere may have been a score of Englishmen in the house, but at the burst of that beloved and well-known music, every one of them, we young fellows in the stalls, Sir John and Lady Bullminster (who had taken a house at Pumpernickel for the education of their nine children), the fat gentleman with the mustachios, the long Major in white duck trousers, and the lady with the little boy upon whom he was so sweet, even Kirsch, the courier in the gallery, stood bolt upright in their places and proclaimed themselves to be members of the dear old British nation. As for Tapeworm, the Charge d'Affaires, he rose up in his box and bowed and simpered, as if he would represent the whole empire. Tapeworm was nephew and heir of old Marshal Tiptoff, who has been introduced in this story as General Tiptoff, just before Waterloo, who was Colonel of the --th regiment in which Major Dobbin served, and who died in this year full of honours, and of an aspic of plovers' eggs; when the regiment was graciously given by his Majesty to Colonel Sir Michael O'Dowd, K.C.B. who had commanded it in many glorious fields.\nTapeworm must have met with Colonel Dobbin at the house of the Colonel's Colonel, the Marshal, for he recognized him on this night at the theatre, and with the utmost condescension, his Majesty's minister came over from his own box and publicly shook hands with his new-found friend.\n\"Look at that infernal sly-boots of a Tapeworm,\" Fipps whispered, examining his chief from the stalls. \"Wherever there's a pretty woman he always twists himself in.\" And I wonder what were diplomatists made for but for that?\n\"Have I the honour of addressing myself to Mrs. Dobbin?\" asked the Secretary with a most insinuating grin.\nGeorgy burst out laughing and said, \"By Jove, that was a good 'un.\" Emmy and the Major blushed: we saw them from the stalls.\n\"This lady is Mrs. George Osborne,\" said the Major, \"and this is her brother, Mr. Sedley, a distinguished officer of the Bengal Civil Service: permit me to introduce him to your lordship.\"\nMy lord nearly sent Jos off his legs with the most fascinating smile. \"Are you going to stop in Pumpernickel?\" he said. \"It is a dull place, but we want some nice people, and we would try and make it SO agreeable to you. Mr.--Ahum--Mrs.--Oho. I shall do myself the honour of calling upon you to-morrow at your inn.\" And he went away with a Parthian grin and glance which he thought must finish Mrs. Osborne completely.\nThe performance over, the young fellows lounged about the lobbies, and we saw the society take its departure. The Duchess Dowager went off in her jingling old coach, attended by two faithful and withered old maids of honour, and a little snuffy spindle-shanked gentleman in waiting, in a brown jasey and a green coat covered with orders--of which the star and the grand yellow cordon of the order of St. Michael of Pumpernickel were most conspicuous. The drums rolled, the guards saluted, and the old carriage drove away.\nThen came his Transparency the Duke and Transparent family, with his great officers of state and household. He bowed serenely to everybody. And amid the saluting of the guards and the flaring of the torches of the running footmen, clad in scarlet, the Transparent carriages drove away to the old Ducal schloss, with its towers and pinacles standing on the schlossberg. Everybody in Pumpernickel knew everybody. No sooner was a foreigner seen there than the Minister of Foreign Affairs, or some other great or small officer of state, went round to the Erbprinz and found out the name of the new arrival.\nWe watched them, too, out of the theatre. Tapeworm had just walked off, enveloped in his cloak, with which his gigantic chasseur was always in attendance, and looking as much as possible like Don Juan. The Prime Minister's lady had just squeezed herself into her sedan, and her daughter, the charming Ida, had put on her calash and clogs; when the English party came out, the boy yawning drearily, the Major taking great pains in keeping the shawl over Mrs. Osborne's head, and Mr. Sedley looking grand, with a crush opera-hat on one side of his head and his hand in the stomach of a voluminous white waistcoat. We took off our hats to our acquaintances of the table d'hote, and the lady, in return, presented us with a little smile and a curtsey, for which everybody might be thankful.\nThe carriage from the inn, under the superintendence of the bustling Mr. Kirsch, was in waiting to convey the party; but the fat man said he would walk and smoke his cigar on his way homewards, so the other three, with nods and smiles to us, went without Mr. Sedley, Kirsch, with the cigar case, following in his master's wake.\nWe all walked together and talked to the stout gentleman about the agremens of the place. It was very agreeable for the English. There were shooting-parties and battues; there was a plenty of balls and entertainments at the hospitable Court; the society was generally good; the theatre excellent; and the living cheap.\n\"And our Minister seems a most delightful and affable person,\" our new friend said. \"With such a representative, and--and a good medical man, I can fancy the place to be most eligible. Good-night, gentlemen.\" And Jos creaked up the stairs to bedward, followed by Kirsch with a flambeau. We rather hoped that nice-looking woman would be induced to stay some time in the town.",
        "paragraph_chars": [
            [
                0,
                2910
            ],
            [
                2910,
                3697
            ],
            [
                3697,
                3852
            ],
            [
                3852,
                3993
            ],
            [
                3993,
                4781
            ],
            [
                4781,
                4902
            ],
            [
                4902,
                5239
            ],
            [
                5239,
                5586
            ],
            [
                5586,
                6343
            ],
            [
                6343,
                6642
            ],
            [
                6642,
                6749
            ],
            [
                6749,
                7105
            ],
            [
                7105,
                7713
            ],
            [
                7713,
                8234
            ],
            [
                8234,
                9183
            ],
            [
                9183,
                10288
            ],
            [
                10288,
                12973
            ],
            [
                12973,
                14160
            ],
            [
                14160,
                14968
            ],
            [
                14968,
                15629
            ],
            [
                15629,
                16476
            ],
            [
                16476,
                18128
            ],
            [
                18128,
                19449
            ],
            [
                19449,
                19792
            ],
            [
                19792,
                20896
            ],
            [
                20896,
                21180
            ],
            [
                21180,
                21405
            ],
            [
                21405,
                21512
            ],
            [
                21512,
                21637
            ],
            [
                21637,
                21826
            ],
            [
                21826,
                22245
            ],
            [
                22245,
                22767
            ],
            [
                22767,
                23370
            ],
            [
                23370,
                24157
            ],
            [
                24157,
                24485
            ],
            [
                24485,
                24804
            ],
            [
                24804,
                25178
            ]
        ],
        "segment_chars": [
            [
                0,
                347
            ],
            [
                347,
                848
            ],
            [
                848,
                932
            ],
            [
                932,
                2005
            ],
            [
                2005,
                2275
            ],
            [
                2275,
                2910
            ],
            [
                2910,
                3156
            ],
            [
                3156,
                3345
            ],
            [
                3345,
                3433
            ],
            [
                3433,
                3474
            ],
            [
                3474,
                3598
            ],
            [
                3598,
                3697
            ],
            [
                3697,
                3723
            ],
            [
                3723,
                3852
            ],
            [
                3852,
                3993
            ],
            [
                3993,
                4257
            ],
            [
                4257,
                4781
            ],
            [
                4781,
                4902
            ],
            [
                4902,
                4977
            ],
            [
                4977,
                5239
            ],
            [
                5239,
                5435
            ],
            [
                5435,
                5586
            ],
            [
                5586,
                5767
            ],
            [
                5767,
                5975
            ],
            [
                5975,
                6181
            ],
            [
                6181,
                6269
            ],
            [
                6269,
                6343
            ],
            [
                6343,
                6432
            ],
            [
                6432,
                6452
            ],
            [
                6452,
                6642
            ],
            [
                6642,
                6665
            ],
            [
                6665,
                6749
            ],
            [
                6749,
                6853
            ],
            [
                6853,
                6945
            ],
            [
                6945,
                7105
            ],
            [
                7105,
                7240
            ],
            [
                7240,
                7442
            ],
            [
                7442,
                7713
            ],
            [
                7713,
                7836
            ],
            [
                7836,
                8064
            ],
            [
                8064,
                8234
            ],
            [
                8234,
                8279
            ],
            [
                8279,
                8439
            ],
            [
                8439,
                8617
            ],
            [
                8617,
                8729
            ],
            [
                8729,
                8910
            ],
            [
                8910,
                9183
            ],
            [
                9183,
                9265
            ],
            [
                9265,
                9354
            ],
            [
                9354,
                9378
            ],
            [
                9378,
                9591
            ],
            [
                9591,
                9674
            ],
            [
                9674,
                10034
            ],
            [
                10034,
                10288
            ],
            [
                10288,
                10592
            ],
            [
                10592,
                10662
            ],
            [
                10662,
                10689
            ],
            [
                10689,
                11170
            ],
            [
                11170,
                11288
            ],
            [
                11288,
                11387
            ],
            [
                11387,
                11497
            ],
            [
                11497,
                11703
            ],
            [
                11703,
                11978
            ],
            [
                11978,
                12427
            ],
            [
                12427,
                12809
            ],
            [
                12809,
                12973
            ],
            [
                12973,
                13064
            ],
            [
                13064,
                13214
            ],
            [
                13214,
                13274
            ],
            [
                13274,
                13305
            ],
            [
                13305,
                13635
            ],
            [
                13635,
                14160
            ],
            [
                14160,
                14271
            ],
            [
                14271,
                14333
            ],
            [
                14333,
                14644
            ],
            [
                14644,
                14904
            ],
            [
                14904,
                14968
            ],
            [
                14968,
                15025
            ],
            [
                15025,
                15120
            ],
            [
                15120,
                15238
            ],
            [
                15238,
                15427
            ],
            [
                15427,
                15518
            ],
            [
                15518,
                15629
            ],
            [
                15629,
                15730
            ],
            [
                15730,
                15824
            ],
            [
                15824,
                15964
            ],
            [
                15964,
                16315
            ],
            [
                16315,
                16476
            ],
            [
                16476,
                16811
            ],
            [
                16811,
                16950
            ],
            [
                16950,
                17095
            ],
            [
                17095,
                17327
            ],
            [
                17327,
                17688
            ],
            [
                17688,
                17885
            ],
            [
                17885,
                18128
            ],
            [
                18128,
                18378
            ],
            [
                18378,
                18703
            ],
            [
                18703,
                19103
            ],
            [
                19103,
                19276
            ],
            [
                19276,
                19449
            ],
            [
                19449,
                19527
            ],
            [
                19527,
                19642
            ],
            [
                19642,
                19792
            ],
            [
                19792,
                20352
            ],
            [
                20352,
                20481
            ],
            [
                20481,
                20850
            ],
            [
                20850,
                20896
            ],
            [
                20896,
                21180
            ],
            [
                21180,
                21283
            ],
            [
                21283,
                21346
            ],
            [
                21346,
                21405
            ],
            [
                21405,
                21462
            ],
            [
                21462,
                21512
            ],
            [
                21512,
                21580
            ],
            [
                21580,
                21637
            ],
            [
                21637,
                21826
            ],
            [
                21826,
                21896
            ],
            [
                21896,
                21937
            ],
            [
                21937,
                21946
            ],
            [
                21946,
                22047
            ],
            [
                22047,
                22069
            ],
            [
                22069,
                22142
            ],
            [
                22142,
                22245
            ],
            [
                22245,
                22355
            ],
            [
                22355,
                22696
            ],
            [
                22696,
                22767
            ],
            [
                22767,
                22875
            ],
            [
                22875,
                22907
            ],
            [
                22907,
                23136
            ],
            [
                23136,
                23178
            ],
            [
                23178,
                23370
            ],
            [
                23370,
                23412
            ],
            [
                23412,
                23572
            ],
            [
                23572,
                23982
            ],
            [
                23982,
                24157
            ],
            [
                24157,
                24485
            ],
            [
                24485,
                24575
            ],
            [
                24575,
                24614
            ],
            [
                24614,
                24804
            ],
            [
                24804,
                24888
            ],
            [
                24888,
                24989
            ],
            [
                24989,
                25013
            ],
            [
                25013,
                25091
            ],
            [
                25091,
                25178
            ]
        ],
        "overlap_chars": [
            [
                76,
                92
            ],
            [
                44,
                55
            ],
            [
                250,
                289
            ],
            [
                229,
                231
            ],
            [
                166,
                172
            ],
            [
                297,
                307
            ],
            [
                328,
                347
            ],
            [
                385,
                409
            ],
            [
                372,
                376
            ],
            [
                410,
                422
            ],
            [
                433,
                446
            ],
            [
                381,
                384
            ],
            [
                448,
                492
            ],
            [
                498,
                538
            ],
            [
                559,
                572
            ],
            [
                636,
                647
            ],
            [
                379,
                380
            ],
            [
                648,
                665
            ],
            [
                846,
                848
            ],
            [
                932,
                965
            ],
            [
                970,
                997
            ],
            [
                1063,
                1091
            ],
            [
                1093,
                1123
            ],
            [
                1137,
                1225
            ],
            [
                1523,
                1549
            ],
            [
                1567,
                1570
            ],
            [
                1571,
                1675
            ],
            [
                1684,
                1706
            ],
            [
                1753,
                1780
            ],
            [
                1787,
                1798
            ],
            [
                1730,
                1731
            ],
            [
                1801,
                1810
            ],
            [
                1889,
                1898
            ],
            [
                1907,
                1946
            ],
            [
                1961,
                1999
            ],
            [
                965,
                966
            ],
            [
                2000,
                2005
            ],
            [
                2005,
                2046
            ],
            [
                2080,
                2131
            ],
            [
                2137,
                2145
            ],
            [
                2147,
                2258
            ],
            [
                2273,
                2275
            ],
            [
                2275,
                2313
            ],
            [
                2322,
                2348
            ],
            [
                2445,
                2446
            ],
            [
                2453,
                2472
            ],
            [
                2488,
                2503
            ],
            [
                2605,
                2610
            ],
            [
                2511,
                2520
            ],
            [
                2542,
                2554
            ],
            [
                2563,
                2564
            ],
            [
                2384,
                2387
            ],
            [
                2576,
                2582
            ],
            [
                2350,
                2353
            ],
            [
                2628,
                2631
            ],
            [
                2521,
                2527
            ],
            [
                2644,
                2673
            ],
            [
                2675,
                2689
            ],
            [
                2694,
                2701
            ],
            [
                2726,
                2741
            ],
            [
                2808,
                2824
            ],
            [
                2411,
                2414
            ],
            [
                2908,
                2910
            ],
            [
                3612,
                3657
            ],
            [
                3695,
                3697
            ],
            [
                3697,
                3698
            ],
            [
                3720,
                3723
            ],
            [
                3728,
                3741
            ],
            [
                4353,
                4358
            ],
            [
                4372,
                4375
            ],
            [
                4274,
                4278
            ],
            [
                4292,
                4325
            ],
            [
                4053,
                4054
            ],
            [
                4497,
                4500
            ],
            [
                4338,
                4353
            ],
            [
                3991,
                3992
            ],
            [
                4399,
                4431
            ],
            [
                4191,
                4192
            ],
            [
                4432,
                4466
            ],
            [
                4491,
                4492
            ],
            [
                4505,
                4512
            ],
            [
                4019,
                4023
            ],
            [
                4523,
                4537
            ],
            [
                3755,
                3756
            ],
            [
                4556,
                4565
            ],
            [
                4641,
                4650
            ],
            [
                4593,
                4597
            ],
            [
                3956,
                3959
            ],
            [
                4598,
                4603
            ],
            [
                4628,
                4636
            ],
            [
                4727,
                4736
            ],
            [
                3781,
                3784
            ],
            [
                4666,
                4675
            ],
            [
                4687,
                4710
            ],
            [
                3850,
                3852
            ],
            [
                5239,
                5242
            ],
            [
                5253,
                5268
            ],
            [
                5398,
                5405
            ],
            [
                5412,
                5435
            ],
            [
                5435,
                5488
            ],
            [
                5537,
                5542
            ],
            [
                5509,
                5513
            ],
            [
                5552,
                5586
            ],
            [
                5586,
                5623
            ],
            [
                5640,
                5641
            ],
            [
                5653,
                5668
            ],
            [
                5672,
                5736
            ],
            [
                5765,
                5767
            ],
            [
                5767,
                5836
            ],
            [
                5838,
                5861
            ],
            [
                5875,
                5891
            ],
            [
                5975,
                6037
            ],
            [
                6045,
                6105
            ],
            [
                6120,
                6181
            ],
            [
                6269,
                6302
            ],
            [
                6306,
                6343
            ],
            [
                6343,
                6413
            ],
            [
                6430,
                6432
            ],
            [
                6432,
                6438
            ],
            [
                6443,
                6450
            ],
            [
                6439,
                6442
            ],
            [
                6450,
                6452
            ],
            [
                6452,
                6459
            ],
            [
                6512,
                6554
            ],
            [
                6567,
                6581
            ],
            [
                6594,
                6642
            ],
            [
                6642,
                6665
            ],
            [
                6670,
                6749
            ],
            [
                6749,
                6767
            ],
            [
                6851,
                6853
            ],
            [
                6853,
                6914
            ],
            [
                6920,
                6945
            ],
            [
                6945,
                6961
            ],
            [
                6982,
                7045
            ],
            [
                7054,
                7086
            ],
            [
                7103,
                7105
            ],
            [
                7105,
                7143
            ],
            [
                7157,
                7167
            ],
            [
                7180,
                7199
            ],
            [
                7208,
                7218
            ],
            [
                7231,
                7240
            ],
            [
                7240,
                7244
            ],
            [
                7296,
                7303
            ],
            [
                7317,
                7381
            ],
            [
                7442,
                7530
            ],
            [
                7549,
                7563
            ],
            [
                7546,
                7548
            ],
            [
                7585,
                7713
            ],
            [
                7713,
                7739
            ],
            [
                7771,
                7814
            ],
            [
                7948,
                7966
            ],
            [
                7836,
                7937
            ],
            [
                8062,
                8064
            ],
            [
                8064,
                8212
            ],
            [
                8232,
                8234
            ],
            [
                8234,
                8279
            ],
            [
                8279,
                8305
            ],
            [
                8314,
                8352
            ],
            [
                8310,
                8313
            ],
            [
                8357,
                8365
            ],
            [
                8400,
                8407
            ],
            [
                8414,
                8417
            ],
            [
                8408,
                8413
            ],
            [
                8418,
                8439
            ],
            [
                8439,
                8562
            ],
            [
                8598,
                8617
            ],
            [
                8617,
                8729
            ],
            [
                8729,
                8739
            ],
            [
                8760,
                8765
            ],
            [
                8740,
                8751
            ],
            [
                8822,
                8823
            ],
            [
                8767,
                8822
            ],
            [
                8908,
                8910
            ],
            [
                8927,
                8938
            ],
            [
                9013,
                9037
            ],
            [
                8910,
                8912
            ],
            [
                9076,
                9095
            ],
            [
                9102,
                9109
            ],
            [
                9125,
                9183
            ],
            [
                9183,
                9198
            ],
            [
                9211,
                9213
            ],
            [
                9218,
                9238
            ],
            [
                9263,
                9265
            ],
            [
                9265,
                9316
            ],
            [
                9341,
                9354
            ],
            [
                9354,
                9378
            ],
            [
                9378,
                9411
            ],
            [
                9419,
                9436
            ],
            [
                9454,
                9489
            ],
            [
                9491,
                9494
            ],
            [
                9513,
                9517
            ],
            [
                9495,
                9512
            ],
            [
                9522,
                9525
            ],
            [
                9526,
                9546
            ],
            [
                9583,
                9591
            ],
            [
                9591,
                9614
            ],
            [
                9623,
                9631
            ],
            [
                9647,
                9674
            ],
            [
                9690,
                9748
            ],
            [
                9765,
                9812
            ],
            [
                9817,
                9823
            ],
            [
                9839,
                9865
            ],
            [
                9872,
                9889
            ],
            [
                9901,
                9915
            ],
            [
                9833,
                9838
            ],
            [
                9917,
                9938
            ],
            [
                9945,
                9970
            ],
            [
                10032,
                10034
            ],
            [
                10034,
                10089
            ],
            [
                10117,
                10150
            ],
            [
                10152,
                10165
            ],
            [
                10172,
                10264
            ],
            [
                10286,
                10288
            ],
            [
                10288,
                10299
            ],
            [
                10306,
                10358
            ],
            [
                10382,
                10418
            ],
            [
                10622,
                10641
            ],
            [
                10647,
                10662
            ],
            [
                10662,
                10689
            ],
            [
                10689,
                10717
            ],
            [
                10989,
                10990
            ],
            [
                10731,
                10739
            ],
            [
                10746,
                10793
            ],
            [
                11168,
                11170
            ],
            [
                11170,
                11174
            ],
            [
                11187,
                11191
            ],
            [
                11215,
                11273
            ],
            [
                11286,
                11288
            ],
            [
                11288,
                11297
            ],
            [
                11300,
                11307
            ],
            [
                11340,
                11341
            ],
            [
                11387,
                11390
            ],
            [
                11346,
                11349
            ],
            [
                11403,
                11417
            ],
            [
                11425,
                11471
            ],
            [
                11495,
                11497
            ],
            [
                11497,
                11542
            ],
            [
                11595,
                11596
            ],
            [
                11651,
                11702
            ],
            [
                11777,
                11780
            ],
            [
                11799,
                11807
            ],
            [
                11843,
                11892
            ],
            [
                11976,
                11978
            ],
            [
                11982,
                12011
            ],
            [
                12026,
                12027
            ],
            [
                12104,
                12166
            ],
            [
                12192,
                12228
            ],
            [
                12242,
                12252
            ],
            [
                12293,
                12295
            ],
            [
                12299,
                12336
            ],
            [
                12347,
                12378
            ],
            [
                12425,
                12426
            ],
            [
                12973,
                13008
            ],
            [
                13013,
                13064
            ],
            [
                13064,
                13123
            ],
            [
                13127,
                13131
            ],
            [
                13136,
                13139
            ],
            [
                13154,
                13157
            ],
            [
                13171,
                13214
            ],
            [
                13214,
                13242
            ],
            [
                13252,
                13274
            ],
            [
                13274,
                13304
            ],
            [
                14160,
                14271
            ],
            [
                14271,
                14294
            ],
            [
                14306,
                14310
            ],
            [
                14322,
                14327
            ],
            [
                14331,
                14333
            ],
            [
                14333,
                14368
            ],
            [
                14384,
                14387
            ],
            [
                14399,
                14411
            ],
            [
                14438,
                14441
            ],
            [
                14428,
                14436
            ],
            [
                14498,
                14505
            ],
            [
                14511,
                14545
            ],
            [
                14591,
                14593
            ],
            [
                14600,
                14618
            ],
            [
                14623,
                14632
            ],
            [
                14637,
                14642
            ],
            [
                14642,
                14644
            ],
            [
                14644,
                14773
            ],
            [
                14789,
                14810
            ],
            [
                14830,
                14838
            ],
            [
                14850,
                14863
            ],
            [
                14868,
                14880
            ],
            [
                14894,
                14902
            ],
            [
                14884,
                14893
            ],
            [
                14902,
                14903
            ],
            [
                14978,
                14987
            ],
            [
                14995,
                15014
            ],
            [
                15023,
                15025
            ],
            [
                15025,
                15080
            ],
            [
                15118,
                15120
            ],
            [
                15120,
                15146
            ],
            [
                15175,
                15238
            ],
            [
                15238,
                15319
            ],
            [
                15335,
                15360
            ],
            [
                15374,
                15427
            ],
            [
                15427,
                15500
            ],
            [
                15516,
                15518
            ],
            [
                15518,
                15589
            ],
            [
                15604,
                15629
            ],
            [
                15629,
                15714
            ],
            [
                15828,
                15883
            ],
            [
                15962,
                15964
            ],
            [
                15964,
                15989
            ],
            [
                16071,
                16072
            ],
            [
                16077,
                16079
            ],
            [
                16084,
                16089
            ],
            [
                16119,
                16235
            ],
            [
                16270,
                16292
            ],
            [
                16313,
                16315
            ],
            [
                16315,
                16346
            ],
            [
                16409,
                16425
            ],
            [
                16448,
                16476
            ],
            [
                16476,
                16496
            ],
            [
                16515,
                16535
            ],
            [
                16764,
                16811
            ],
            [
                16811,
                16827
            ],
            [
                16858,
                16889
            ],
            [
                16897,
                16906
            ],
            [
                16948,
                16950
            ],
            [
                16950,
                17019
            ],
            [
                17087,
                17095
            ],
            [
                17095,
                17115
            ],
            [
                17129,
                17134
            ],
            [
                17142,
                17164
            ],
            [
                17237,
                17245
            ],
            [
                17250,
                17327
            ],
            [
                17688,
                17783
            ],
            [
                17883,
                17885
            ],
            [
                17885,
                17888
            ],
            [
                18119,
                18121
            ],
            [
                17889,
                17896
            ],
            [
                18035,
                18036
            ],
            [
                17905,
                17935
            ],
            [
                17948,
                17953
            ],
            [
                17983,
                17988
            ],
            [
                17962,
                17966
            ],
            [
                17954,
                17961
            ],
            [
                17992,
                18035
            ],
            [
                18126,
                18128
            ],
            [
                18140,
                18144
            ],
            [
                18172,
                18175
            ],
            [
                18182,
                18187
            ],
            [
                18225,
                18232
            ],
            [
                18238,
                18244
            ],
            [
                18255,
                18308
            ],
            [
                18343,
                18378
            ],
            [
                18378,
                18437
            ],
            [
                18441,
                18444
            ],
            [
                18527,
                18549
            ],
            [
                18560,
                18592
            ],
            [
                18637,
                18638
            ],
            [
                18605,
                18637
            ],
            [
                18698,
                18701
            ],
            [
                18864,
                18873
            ],
            [
                18879,
                18914
            ],
            [
                18701,
                18702
            ],
            [
                19449,
                19461
            ],
            [
                19472,
                19479
            ],
            [
                19486,
                19527
            ],
            [
                19652,
                19716
            ],
            [
                19721,
                19757
            ],
            [
                19758,
                19776
            ],
            [
                19852,
                19908
            ],
            [
                19823,
                19830
            ],
            [
                19834,
                19846
            ],
            [
                19922,
                19953
            ],
            [
                20066,
                20083
            ],
            [
                19963,
                19966
            ],
            [
                20105,
                20119
            ],
            [
                20142,
                20176
            ],
            [
                20243,
                20263
            ],
            [
                20350,
                20352
            ],
            [
                20352,
                20358
            ],
            [
                20359,
                20446
            ],
            [
                20463,
                20481
            ],
            [
                20481,
                20500
            ],
            [
                20510,
                20522
            ],
            [
                20525,
                20537
            ],
            [
                20542,
                20546
            ],
            [
                20622,
                20636
            ],
            [
                20642,
                20679
            ],
            [
                20844,
                20845
            ],
            [
                20896,
                20918
            ],
            [
                20932,
                20945
            ],
            [
                20982,
                20987
            ],
            [
                20966,
                20968
            ],
            [
                20946,
                20951
            ],
            [
                20989,
                20997
            ],
            [
                21063,
                21070
            ],
            [
                21106,
                21157
            ],
            [
                21009,
                21012
            ],
            [
                21178,
                21180
            ],
            [
                21405,
                21462
            ],
            [
                21482,
                21486
            ],
            [
                21494,
                21512
            ],
            [
                21512,
                21537
            ],
            [
                21580,
                21606
            ],
            [
                21635,
                21637
            ],
            [
                21637,
                21778
            ],
            [
                21823,
                21826
            ],
            [
                21826,
                21833
            ],
            [
                21846,
                21849
            ],
            [
                21868,
                21896
            ],
            [
                21896,
                21937
            ],
            [
                21937,
                21946
            ],
            [
                21946,
                21973
            ],
            [
                22004,
                22025
            ],
            [
                22029,
                22047
            ],
            [
                22069,
                22117
            ],
            [
                22128,
                22142
            ],
            [
                22142,
                22165
            ],
            [
                22184,
                22245
            ],
            [
                22245,
                22260
            ],
            [
                22265,
                22315
            ],
            [
                22319,
                22334
            ],
            [
                22353,
                22355
            ],
            [
                23412,
                23420
            ],
            [
                23430,
                23440
            ],
            [
                23442,
                23465
            ],
            [
                23529,
                23572
            ],
            [
                23572,
                23639
            ],
            [
                23709,
                23725
            ],
            [
                23732,
                23757
            ],
            [
                23766,
                23777
            ],
            [
                23800,
                23872
            ],
            [
                23980,
                23982
            ],
            [
                23982,
                24005
            ],
            [
                24043,
                24057
            ],
            [
                24080,
                24082
            ],
            [
                24088,
                24116
            ],
            [
                24155,
                24157
            ],
            [
                24157,
                24182
            ],
            [
                24238,
                24241
            ],
            [
                24245,
                24252
            ],
            [
                24272,
                24339
            ],
            [
                24349,
                24369
            ],
            [
                24399,
                24411
            ],
            [
                24483,
                24485
            ],
            [
                24485,
                24487
            ],
            [
                24492,
                24498
            ],
            [
                24522,
                24541
            ],
            [
                24508,
                24518
            ],
            [
                24542,
                24551
            ],
            [
                24561,
                24575
            ],
            [
                24575,
                24596
            ],
            [
                24653,
                24654
            ],
            [
                24614,
                24641
            ],
            [
                24677,
                24701
            ],
            [
                24725,
                24742
            ],
            [
                24753,
                24804
            ],
            [
                24804,
                24834
            ],
            [
                24850,
                24888
            ],
            [
                24888,
                24893
            ],
            [
                24926,
                24989
            ],
            [
                24989,
                25013
            ],
            [
                25013,
                25042
            ],
            [
                25089,
                25091
            ],
            [
                25091,
                25178
            ]
        ],
        "row_chars": [
            [
                0,
                347
            ],
            [
                347,
                848
            ],
            [
                848,
                932
            ],
            [
                932,
                2005
            ],
            [
                2005,
                2275
            ],
            [
                2275,
                2910
            ],
            [
                2910,
                3156
            ],
            [
                3156,
                3345
            ],
            [
                3345,
                3433
            ],
            [
                3433,
                3474
            ],
            [
                3474,
                3598
            ],
            [
                3598,
                3697
            ],
            [
                3697,
                3723
            ],
            [
                3723,
                4781
            ],
            [
                4781,
                4902
            ],
            [
                4902,
                4977
            ],
            [
                4977,
                5239
            ],
            [
                5239,
                5435
            ],
            [
                5435,
                5586
            ],
            [
                5586,
                5767
            ],
            [
                5767,
                5975
            ],
            [
                5975,
                6181
            ],
            [
                6181,
                6269
            ],
            [
                6269,
                6343
            ],
            [
                6343,
                6432
            ],
            [
                6432,
                6452
            ],
            [
                6452,
                6642
            ],
            [
                6642,
                6665
            ],
            [
                6665,
                6749
            ],
            [
                6749,
                6853
            ],
            [
                6853,
                6945
            ],
            [
                6945,
                7105
            ],
            [
                7105,
                7240
            ],
            [
                7240,
                7442
            ],
            [
                7442,
                7713
            ],
            [
                7713,
                8064
            ],
            [
                8064,
                8234
            ],
            [
                8234,
                8279
            ],
            [
                8279,
                8439
            ],
            [
                8439,
                8617
            ],
            [
                8617,
                8729
            ],
            [
                8729,
                8910
            ],
            [
                8910,
                9183
            ],
            [
                9183,
                9265
            ],
            [
                9265,
                9354
            ],
            [
                9354,
                9378
            ],
            [
                9378,
                9591
            ],
            [
                9591,
                9674
            ],
            [
                9674,
                10034
            ],
            [
                10034,
                10288
            ],
            [
                10288,
                10662
            ],
            [
                10662,
                10689
            ],
            [
                10689,
                11170
            ],
            [
                11170,
                11288
            ],
            [
                11288,
                11497
            ],
            [
                11497,
                11703
            ],
            [
                11703,
                11978
            ],
            [
                11978,
                12427
            ],
            [
                12427,
                12809
            ],
            [
                12809,
                12973
            ],
            [
                12973,
                13064
            ],
            [
                13064,
                13214
            ],
            [
                13214,
                13274
            ],
            [
                13274,
                13305
            ],
            [
                13305,
                13635
            ],
            [
                13635,
                14160
            ],
            [
                14160,
                14271
            ],
            [
                14271,
                14333
            ],
            [
                14333,
                14644
            ],
            [
                14644,
                14904
            ],
            [
                14904,
                14968
            ],
            [
                14968,
                15025
            ],
            [
                15025,
                15120
            ],
            [
                15120,
                15238
            ],
            [
                15238,
                15427
            ],
            [
                15427,
                15518
            ],
            [
                15518,
                15629
            ],
            [
                15629,
                15730
            ],
            [
                15730,
                15824
            ],
            [
                15824,
                15964
            ],
            [
                15964,
                16315
            ],
            [
                16315,
                16476
            ],
            [
                16476,
                16811
            ],
            [
                16811,
                16950
            ],
            [
                16950,
                17095
            ],
            [
                17095,
                17327
            ],
            [
                17327,
                17688
            ],
            [
                17688,
                17885
            ],
            [
                17885,
                18128
            ],
            [
                18128,
                18378
            ],
            [
                18378,
                19103
            ],
            [
                19103,
                19276
            ],
            [
                19276,
                19449
            ],
            [
                19449,
                19527
            ],
            [
                19527,
                19642
            ],
            [
                19642,
                19792
            ],
            [
                19792,
                20352
            ],
            [
                20352,
                20481
            ],
            [
                20481,
                20850
            ],
            [
                20850,
                20896
            ],
            [
                20896,
                21180
            ],
            [
                21180,
                21283
            ],
            [
                21283,
                21346
            ],
            [
                21346,
                21405
            ],
            [
                21405,
                21462
            ],
            [
                21462,
                21512
            ],
            [
                21512,
                21580
            ],
            [
                21580,
                21637
            ],
            [
                21637,
                21826
            ],
            [
                21826,
                21896
            ],
            [
                21896,
                21937
            ],
            [
                21937,
                21946
            ],
            [
                21946,
                22047
            ],
            [
                22047,
                22069
            ],
            [
                22069,
                22142
            ],
            [
                22142,
                22245
            ],
            [
                22245,
                22355
            ],
            [
                22355,
                22696
            ],
            [
                22696,
                22767
            ],
            [
                22767,
                22875
            ],
            [
                22875,
                22907
            ],
            [
                22907,
                23136
            ],
            [
                23136,
                23178
            ],
            [
                23178,
                23370
            ],
            [
                23370,
                23412
            ],
            [
                23412,
                23572
            ],
            [
                23572,
                23982
            ],
            [
                23982,
                24157
            ],
            [
                24157,
                24485
            ],
            [
                24485,
                24575
            ],
            [
                24575,
                24804
            ],
            [
                24804,
                24888
            ],
            [
                24888,
                24989
            ],
            [
                24989,
                25013
            ],
            [
                25013,
                25091
            ],
            [
                25091,
                25178
            ]
        ]
    },
    "abridged": {
        "text": "One fine morning a few weeks later, the Batavier steamboat left the Tower of London laden with English fugitives. The benches and gangways were crowded with rosy children and bustling nursemaids; ladies in the prettiest bonnets and summer dresses; gentlemen in linen-jackets; and stout, trim old veterans. There were jaunty young Cambridge students travelling with their tutor; there were Irish gentlemen with the most dashing whiskers, talking about horses incessantly, and prodigiously polite to the young ladies on board; there was old Methuselah beside his new young wife, with Captain Papillon of the Guards holding her parasol and guide-books; there was young May carrying off his bride who had been at school with his grandmother.\nThere was the great Bareacres family that sat by themselves, stared at everybody, and spoke to no-one. Their carriages, emblazoned with coronets, were on the foredeck, locked in with a dozen more vehicles. It was difficult to pass in and out amongst them; and the poor inmates of the fore-cabin had scarcely any space to move. These consisted of a few magnificently dressed gentlemen from Houndsditch; several honest fellows with portfolios, who began sketching within half an hour; and some French maids who were ill before the boat had passed Greenwich. A groom or two lounged around the horse-boxes and talked about the races.\nAmongst these vehicles was a very neat, handsome travelling carriage.\n\"Whose is that?\" asked one gentleman, and was told that it belonged to a Nabob from Calcutta, who was enormously rich. At this moment a young gentleman, who had been warned off the bridge, dropped from there to the roof of a carriage, clambered over the other roofs until he reached this travelling carriage, and descended through the window into it.\nThe young gentleman was our friend George Osborne. Uncle Jos and his mamma were on the quarter-deck with Dobbin, and they were about to make a summer tour.\nJos was seated at that moment on deck, nearly opposite the Earl of Bareacres and his family, whose proceedings absorbed him. Both the noble couple looked rather younger than in the eventful year 1815, when Jos remembered seeing them at Brussels. Lady Bareacres' hair, which was then dark, was now a beautiful auburn, whereas Lord Bareacres' whiskers, formerly red, were a rich black with purple and green reflections in the light. The presence of a Lord fascinated Jos, and he could look at nothing else.\n\"Those people seem to interest you a good deal,\" said Dobbin, laughing. Amelia laughed too. She was dressed in mourning, but the little bustle of the journey excited her, and she looked particularly happy.\n\"What a heavenly day!\" she said and added, with great originality, \"I hope we shall have a calm passage.\"\nJos waved his hand. \"If you had made the voyages we have,\" he said, \"you wouldn't care about the weather.\" But nevertheless, he passed the night direfully sick in his carriage, where his servant tended him with brandy-and-water.\nIn due time this happy party landed at Rotterdam, and were transported by steamer to Cologne. Here Jos was gratified to see his arrival announced in the Cologne newspapers. He had his court dress with him; he had insisted that Dobbin should bring his regimental uniform, and announced that he intended to be presented at some foreign courts, and pay his respects to the Sovereigns of the countries which he honoured with a visit.\nWherever the party stopped, Mr. Jos left his own card and the Major's with the English consul; it was with great difficulty that he could be restrained from putting on his cocked hat and tights to do so. He kept a journal of his voyage and noted elaborately the defects or excellences of the various inns at which he put up, and of the wines and dishes there.\nAs for Emmy, she was very happy and pleased. Dobbin used to carry about her stool and sketch-book, and admired her drawings as they had never been admired before. She sat upon steamers' decks and drew crags and castles, or she mounted upon donkeys and ascended to ancient robber-towers, with Georgy and Dobbin. She laughed, and the Major did too, at his droll figure on donkey-back, with his long legs touching the ground. He was the party's interpreter, having a good military knowledge of the German language. Over a few weeks, Georgy made prodigious advances in German, and could talk to waiters in a way that charmed his mother and amused his guardian.\nMr. Jos did not join in their afternoon excursions. He slept a good deal after dinner, or basked in the inn-gardens. Pleasant Rhine gardens! Fair scenes of peace and sunshine - noble purple mountains, reflected in the magnificent stream - who that has ever seen you, does not have a grateful memory of your beauty? To lay down the pen and think of Rhineland makes one happy. On a summer evening, the cows are trooping down from the hills, their bells tinkling, to the old town, with its moats, spires, and chestnut-trees. Long blue shadows stretch over the grass, and the sky and the river flame in crimson and gold. The sun sinks behind the great castle-crested mountains; the river grows darker and darker. Lights quiver from the windows in the old ramparts, and twinkle peacefully in the villages under the hills.\nSo Jos used to sleep a good deal with his bandanna over his face, and read all the English news, and his friends did not much miss him. Yes, they were very happy. They went to the opera often - to those unassuming, dear old operas in the German towns. Here Emmy was introduced for the first time to the wonders of Mozart. The Major was musical, but his chief pleasure in these operas was in watching Emmy's rapture. A new world of love and beauty broke upon her; how could she be indifferent when she heard Mozart?\nShe wondered when she prayed whether it was not wicked to feel so much delight at music? The Major, whom she consulted, said that for his part, every beauty of art or nature made him grateful, and that the pleasure to be had in fine music or a beautiful landscape or picture, was something for which we might thank Heaven.\nI like to dwell upon this period of Amelia's life and to think that she was cheerful and happy. You see, she has not had too much of that sort of existence yet, nor has she had the chance to educate her tastes or her intelligence. She has been domineered over by vulgar intellects. It is the lot of many a woman.\nAnd it must be remembered that this poor lady had never met a gentleman in her life until this present moment. Perhaps these are rarer people than we think. Which of us can point out many such - men who are generous and constant; whose lack of meanness makes them simple; who have an honest manly sympathy for great and small alike? We all know a hundred whose coats are very well made, and a score who have excellent manners, and one or two happy beings who are in the inner circles, the very bull's-eye of fashion; but how many are gentlemen?\nThe Major was one, without any doubt. He had very long legs, a yellow face, and a slight lisp. But his thoughts were just, his life was honest and pure, and his heart warm and humble. He certainly had very large hands and feet, which the two George Osbornes used to laugh at; and their jeers perhaps led poor little Emmy astray as to his worth. But have we not all been misled about our heroes and changed our opinions? Emmy, in this happy time, found that hers underwent a very great change about the merits of the Major.\nPerhaps it was the happiest time of both their lives, indeed, if they did but know it. At all events, this couple were very decently contented. Georgy was always present; in their walks he would be on ahead, and up a tower-stair or a tree, whilst the soberer couple were below, the Major smoking his cigar, whilst Emmy sketched. It was on this very tour that I had the pleasure to make their acquaintance.\nIt was at the little town of Pumpernickel that I first saw Colonel Dobbin and his party. They had arrived at the Erbprinz Hotel, the best in town, and were dining there. Everybody remarked the majesty of Jos and the knowing way in which he ate his dinner. The little boy, too, had a great appetite, and consumed pudding, roast fowls, and sweetmeats, with a gallantry that did honour to his nation. The lady in black, the boy's mamma, laughed and blushed, and looked exceedingly pleased and shy. The Major - or Colonel, as he became very soon afterwards - joked gravely with the boy, pointing out dishes which he hadn't tried.\nThey went on to the Grand Theatre, where Madame Devrient, then in the bloom of her beauty and genius, sang in the wonderful opera of Fidelio. From our places in the stalls we could see our four friends from the hotel, and I could not help noticing the effect which the magnificent, soaring music produced upon Mrs. Osborne; her face wore an expression of wonder and delight.\nThe next day there was another performance of Beethoven, Die Schlacht bei Vittoria. After drums, trumpets, thunders of artillery, and groans of the dying, at last, in a grand triumphal swell, comes \"God Save the King.\"\nAt the burst of that beloved and well-known music, every English person in the house - we young fellows in the stalls, the fat gentleman and the long Major, and the lady with the little boy, stood bolt upright. As for Lord Tapeworm, the Charge d'Affaires, he rose up in his box and bowed and simpered, as if he represented the whole empire. Tapeworm was nephew of old Marshall Tiptoff, who had once been Colonel of the regiment in which Major Dobbin served.\nTapeworm must have met Dobbin at the Marshall's house, for he condescended to come over from his own box and publicly shook hands with him.\n\"Have I the honour of addressing myself to Mrs. Dobbin?\" he asked with an insinuating grin.\nGeorgy burst out laughing. Emmy and the Major blushed.\n\"This lady is Mrs. George Osborne,\" said the Major, \"and this is her brother, Mr. Sedley, a distinguished officer of the Bengal Civil Service.\"\nMy lord gave Jos the most fascinating smile. \"Are you going to stop in Pumpernickel?\" he said. \"It is a dull place, but we would try and make it agreeable to you. I shall do myself the honour of calling upon you tomorrow at your inn.\" And he went away with a glance which he thought must finish Mrs. Osborne completely.\nAfter the performance, the young fellows lounged about the lobbies, and saw the society leave. Tapeworm walked off enveloped in his cloak, looking as much as possible like Don Juan. The Prime Minister's lady had just squeezed herself into her sedan, when the English group came out, the boy yawning, the Major carefully keeping the shawl over Mrs. Osborne's head, and Mr. Sedley looking grand. We took off our hats to them, and the lady gave us a little smile and a curtsey.\nThe carriage from the inn was waiting for them; but the fat man said he would walk and smoke his cigar on his way home, so the other three went without him.\nWe walked with the stout gentleman and talked about the advantages of the place. It was very agreeable; there were shooting-parties, balls and entertainments; the society was good; the theatre excellent; and the living cheap.\n\"And our Minister seems a most affable person,\" our new friend said. \"With a good medical man, I can fancy the place to be most eligible. Good-night, gentlemen.\" And Jos creaked up the stairs. We rather hoped that nice-looking woman would be induced to stay some time in the town.",
        "paragraph_chars": [
            [
                0,
                738
            ],
            [
                738,
                1368
            ],
            [
                1368,
                1438
            ],
            [
                1438,
                1789
            ],
            [
                1789,
                1945
            ],
            [
                1945,
                2450
            ],
            [
                2450,
                2656
            ],
            [
                2656,
                2762
            ],
            [
                2762,
                2991
            ],
            [
                2991,
                3421
            ],
            [
                3421,
                3781
            ],
            [
                3781,
                4438
            ],
            [
                4438,
                5255
            ],
            [
                5255,
                5770
            ],
            [
                5770,
                6093
            ],
            [
                6093,
                6406
            ],
            [
                6406,
                6951
            ],
            [
                6951,
                7474
            ],
            [
                7474,
                7880
            ],
            [
                7880,
                8506
            ],
            [
                8506,
                8881
            ],
            [
                8881,
                9100
            ],
            [
                9100,
                9558
            ],
            [
                9558,
                9698
            ],
            [
                9698,
                9790
            ],
            [
                9790,
                9845
            ],
            [
                9845,
                9989
            ],
            [
                9989,
                10309
            ],
            [
                10309,
                10784
            ],
            [
                10784,
                10941
            ],
            [
                10941,
                11167
            ],
            [
                11167,
                11447
            ]
        ],
        "segment_chars": [
            [
                0,
                114
            ],
            [
                114,
                306
            ],
            [
                306,
                738
            ],
            [
                738,
                841
            ],
            [
                841,
                944
            ],
            [
                944,
                1065
            ],
            [
                1065,
                1294
            ],
            [
                1294,
                1368
            ],
            [
                1368,
                1438
            ],
            [
                1438,
                1455
            ],
            [
                1455,
                1557
            ],
            [
                1557,
                1789
            ],
            [
                1789,
                1840
            ],
            [
                1840,
                1945
            ],
            [
                1945,
                2070
            ],
            [
                2070,
                2191
            ],
            [
                2191,
                2376
            ],
            [
                2376,
                2450
            ],
            [
                2450,
                2522
            ],
            [
                2522,
                2542
            ],
            [
                2542,
                2656
            ],
            [
                2656,
                2679
            ],
            [
                2679,
                2762
            ],
            [
                2762,
                2782
            ],
            [
                2782,
                2869
            ],
            [
                2869,
                2991
            ],
            [
                2991,
                3085
            ],
            [
                3085,
                3164
            ],
            [
                3164,
                3421
            ],
            [
                3421,
                3625
            ],
            [
                3625,
                3781
            ],
            [
                3781,
                3826
            ],
            [
                3826,
                3944
            ],
            [
                3944,
                4092
            ],
            [
                4092,
                4204
            ],
            [
                4204,
                4293
            ],
            [
                4293,
                4438
            ],
            [
                4438,
                4490
            ],
            [
                4490,
                4555
            ],
            [
                4555,
                4579
            ],
            [
                4579,
                4753
            ],
            [
                4753,
                4813
            ],
            [
                4813,
                4960
            ],
            [
                4960,
                5055
            ],
            [
                5055,
                5147
            ],
            [
                5147,
                5255
            ],
            [
                5255,
                5391
            ],
            [
                5391,
                5418
            ],
            [
                5418,
                5507
            ],
            [
                5507,
                5577
            ],
            [
                5577,
                5671
            ],
            [
                5671,
                5770
            ],
            [
                5770,
                5859
            ],
            [
                5859,
                6093
            ],
            [
                6093,
                6189
            ],
            [
                6189,
                6324
            ],
            [
                6324,
                6375
            ],
            [
                6375,
                6406
            ],
            [
                6406,
                6517
            ],
            [
                6517,
                6563
            ],
            [
                6563,
                6739
            ],
            [
                6739,
                6951
            ],
            [
                6951,
                6989
            ],
            [
                6989,
                7046
            ],
            [
                7046,
                7135
            ],
            [
                7135,
                7296
            ],
            [
                7296,
                7371
            ],
            [
                7371,
                7474
            ],
            [
                7474,
                7561
            ],
            [
                7561,
                7618
            ],
            [
                7618,
                7803
            ],
            [
                7803,
                7880
            ],
            [
                7880,
                7969
            ],
            [
                7969,
                8050
            ],
            [
                8050,
                8136
            ],
            [
                8136,
                8278
            ],
            [
                8278,
                8375
            ],
            [
                8375,
                8506
            ],
            [
                8506,
                8648
            ],
            [
                8648,
                8881
            ],
            [
                8881,
                8965
            ],
            [
                8965,
                9100
            ],
            [
                9100,
                9311
            ],
            [
                9311,
                9441
            ],
            [
                9441,
                9558
            ],
            [
                9558,
                9698
            ],
            [
                9698,
                9755
            ],
            [
                9755,
                9790
            ],
            [
                9790,
                9817
            ],
            [
                9817,
                9845
            ],
            [
                9845,
                9989
            ],
            [
                9989,
                10034
            ],
            [
                10034,
                10075
            ],
            [
                10075,
                10084
            ],
            [
                10084,
                10152
            ],
            [
                10152,
                10224
            ],
            [
                10224,
                10309
            ],
            [
                10309,
                10404
            ],
            [
                10404,
                10491
            ],
            [
                10491,
                10703
            ],
            [
                10703,
                10784
            ],
            [
                10784,
                10941
            ],
            [
                10941,
                11022
            ],
            [
                11022,
                11167
            ],
            [
                11167,
                11236
            ],
            [
                11236,
                11305
            ],
            [
                11305,
                11329
            ],
            [
                11329,
                11360
            ],
            [
                11360,
                11447
            ]
        ],
        "overlap_chars": [
            [
                0,
                16
            ],
            [
                17,
                28
            ],
            [
                34,
                73
            ],
            [
                74,
                76
            ],
            [
                77,
                83
            ],
            [
                84,
                94
            ],
            [
                95,
                114
            ],
            [
                114,
                138
            ],
            [
                139,
                143
            ],
            [
                144,
                156
            ],
            [
                157,
                170
            ],
            [
                171,
                174
            ],
            [
                175,
                219
            ],
            [
                220,
                260
            ],
            [
                261,
                274
            ],
            [
                274,
                285
            ],
            [
                285,
                286
            ],
            [
                287,
                304
            ],
            [
                304,
                306
            ],
            [
                306,
                339
            ],
            [
                349,
                376
            ],
            [
                376,
                404
            ],
            [
                405,
                435
            ],
            [
                435,
                523
            ],
            [
                523,
                549
            ],
            [
                557,
                560
            ],
            [
                565,
                669
            ],
            [
                670,
                692
            ],
            [
                693,
                720
            ],
            [
                725,
                736
            ],
            [
                736,
                737
            ],
            [
                738,
                747
            ],
            [
                748,
                757
            ],
            [
                758,
                797
            ],
            [
                797,
                835
            ],
            [
                835,
                836
            ],
            [
                836,
                841
            ],
            [
                841,
                882
            ],
            [
                882,
                933
            ],
            [
                934,
                942
            ],
            [
                944,
                1055
            ],
            [
                1063,
                1065
            ],
            [
                1065,
                1103
            ],
            [
                1112,
                1138
            ],
            [
                1138,
                1139
            ],
            [
                1148,
                1167
            ],
            [
                1168,
                1183
            ],
            [
                1184,
                1189
            ],
            [
                1190,
                1199
            ],
            [
                1207,
                1219
            ],
            [
                1219,
                1220
            ],
            [
                1221,
                1224
            ],
            [
                1230,
                1236
            ],
            [
                1243,
                1246
            ],
            [
                1252,
                1255
            ],
            [
                1256,
                1262
            ],
            [
                1263,
                1292
            ],
            [
                1294,
                1308
            ],
            [
                1309,
                1316
            ],
            [
                1324,
                1339
            ],
            [
                1340,
                1356
            ],
            [
                1357,
                1360
            ],
            [
                1366,
                1368
            ],
            [
                1391,
                1436
            ],
            [
                1436,
                1438
            ],
            [
                1438,
                1439
            ],
            [
                1452,
                1455
            ],
            [
                1461,
                1474
            ],
            [
                1474,
                1479
            ],
            [
                1480,
                1483
            ],
            [
                1489,
                1493
            ],
            [
                1497,
                1530
            ],
            [
                1530,
                1531
            ],
            [
                1532,
                1535
            ],
            [
                1540,
                1555
            ],
            [
                1555,
                1556
            ],
            [
                1557,
                1589
            ],
            [
                1589,
                1590
            ],
            [
                1591,
                1625
            ],
            [
                1625,
                1626
            ],
            [
                1627,
                1634
            ],
            [
                1635,
                1639
            ],
            [
                1646,
                1660
            ],
            [
                1661,
                1662
            ],
            [
                1663,
                1672
            ],
            [
                1673,
                1682
            ],
            [
                1683,
                1687
            ],
            [
                1688,
                1691
            ],
            [
                1692,
                1697
            ],
            [
                1704,
                1712
            ],
            [
                1737,
                1746
            ],
            [
                1747,
                1750
            ],
            [
                1751,
                1760
            ],
            [
                1761,
                1784
            ],
            [
                1787,
                1789
            ],
            [
                1789,
                1792
            ],
            [
                1793,
                1808
            ],
            [
                1809,
                1816
            ],
            [
                1817,
                1840
            ],
            [
                1840,
                1893
            ],
            [
                1900,
                1905
            ],
            [
                1906,
                1910
            ],
            [
                1911,
                1945
            ],
            [
                1945,
                1982
            ],
            [
                1982,
                1983
            ],
            [
                1984,
                1999
            ],
            [
                2000,
                2064
            ],
            [
                2068,
                2070
            ],
            [
                2070,
                2139
            ],
            [
                2142,
                2165
            ],
            [
                2173,
                2189
            ],
            [
                2191,
                2253
            ],
            [
                2254,
                2314
            ],
            [
                2315,
                2376
            ],
            [
                2376,
                2409
            ],
            [
                2413,
                2450
            ],
            [
                2450,
                2520
            ],
            [
                2520,
                2522
            ],
            [
                2522,
                2528
            ],
            [
                2529,
                2536
            ],
            [
                2537,
                2540
            ],
            [
                2540,
                2542
            ],
            [
                2542,
                2549
            ],
            [
                2550,
                2592
            ],
            [
                2593,
                2607
            ],
            [
                2608,
                2656
            ],
            [
                2656,
                2679
            ],
            [
                2683,
                2762
            ],
            [
                2762,
                2780
            ],
            [
                2780,
                2782
            ],
            [
                2782,
                2843
            ],
            [
                2844,
                2869
            ],
            [
                2869,
                2885
            ],
            [
                2885,
                2948
            ],
            [
                2957,
                2989
            ],
            [
                2989,
                2991
            ],
            [
                2991,
                3029
            ],
            [
                3030,
                3040
            ],
            [
                3045,
                3064
            ],
            [
                3065,
                3075
            ],
            [
                3076,
                3085
            ],
            [
                3085,
                3089
            ],
            [
                3090,
                3097
            ],
            [
                3098,
                3162
            ],
            [
                3164,
                3252
            ],
            [
                3266,
                3280
            ],
            [
                3281,
                3283
            ],
            [
                3293,
                3421
            ],
            [
                3421,
                3447
            ],
            [
                3447,
                3490
            ],
            [
                3496,
                3514
            ],
            [
                3516,
                3617
            ],
            [
                3623,
                3625
            ],
            [
                3625,
                3773
            ],
            [
                3779,
                3781
            ],
            [
                3781,
                3826
            ],
            [
                3826,
                3852
            ],
            [
                3853,
                3891
            ],
            [
                3892,
                3895
            ],
            [
                3896,
                3904
            ],
            [
                3905,
                3912
            ],
            [
                3913,
                3916
            ],
            [
                3917,
                3922
            ],
            [
                3923,
                3944
            ],
            [
                3944,
                4067
            ],
            [
                4073,
                4092
            ],
            [
                4092,
                4204
            ],
            [
                4204,
                4214
            ],
            [
                4215,
                4220
            ],
            [
                4223,
                4234
            ],
            [
                4234,
                4235
            ],
            [
                4236,
                4291
            ],
            [
                4291,
                4293
            ],
            [
                4298,
                4309
            ],
            [
                4309,
                4333
            ],
            [
                4343,
                4345
            ],
            [
                4352,
                4371
            ],
            [
                4372,
                4379
            ],
            [
                4380,
                4438
            ],
            [
                4438,
                4453
            ],
            [
                4459,
                4461
            ],
            [
                4468,
                4488
            ],
            [
                4488,
                4490
            ],
            [
                4490,
                4541
            ],
            [
                4542,
                4555
            ],
            [
                4555,
                4579
            ],
            [
                4579,
                4612
            ],
            [
                4621,
                4638
            ],
            [
                4639,
                4674
            ],
            [
                4677,
                4680
            ],
            [
                4681,
                4685
            ],
            [
                4686,
                4703
            ],
            [
                4710,
                4713
            ],
            [
                4719,
                4739
            ],
            [
                4745,
                4753
            ],
            [
                4753,
                4776
            ],
            [
                4777,
                4785
            ],
            [
                4786,
                4813
            ],
            [
                4818,
                4876
            ],
            [
                4877,
                4924
            ],
            [
                4925,
                4931
            ],
            [
                4932,
                4958
            ],
            [
                4960,
                4977
            ],
            [
                4986,
                5000
            ],
            [
                5000,
                5005
            ],
            [
                5006,
                5027
            ],
            [
                5028,
                5053
            ],
            [
                5053,
                5055
            ],
            [
                5055,
                5110
            ],
            [
                5112,
                5145
            ],
            [
                5147,
                5160
            ],
            [
                5161,
                5253
            ],
            [
                5253,
                5255
            ],
            [
                5255,
                5266
            ],
            [
                5267,
                5319
            ],
            [
                5319,
                5355
            ],
            [
                5356,
                5375
            ],
            [
                5376,
                5391
            ],
            [
                5391,
                5418
            ],
            [
                5418,
                5446
            ],
            [
                5447,
                5448
            ],
            [
                5449,
                5457
            ],
            [
                5458,
                5505
            ],
            [
                5505,
                5507
            ],
            [
                5507,
                5511
            ],
            [
                5512,
                5516
            ],
            [
                5517,
                5575
            ],
            [
                5575,
                5577
            ],
            [
                5577,
                5586
            ],
            [
                5591,
                5598
            ],
            [
                5598,
                5599
            ],
            [
                5600,
                5603
            ],
            [
                5604,
                5607
            ],
            [
                5608,
                5622
            ],
            [
                5623,
                5669
            ],
            [
                5669,
                5671
            ],
            [
                5671,
                5716
            ],
            [
                5716,
                5717
            ],
            [
                5718,
                5769
            ],
            [
                5770,
                5773
            ],
            [
                5783,
                5791
            ],
            [
                5799,
                5848
            ],
            [
                5857,
                5859
            ],
            [
                5859,
                5888
            ],
            [
                5888,
                5889
            ],
            [
                5890,
                5952
            ],
            [
                5961,
                5997
            ],
            [
                5998,
                6008
            ],
            [
                6009,
                6011
            ],
            [
                6012,
                6049
            ],
            [
                6060,
                6091
            ],
            [
                6091,
                6092
            ],
            [
                6093,
                6128
            ],
            [
                6138,
                6189
            ],
            [
                6189,
                6248
            ],
            [
                6249,
                6253
            ],
            [
                6258,
                6261
            ],
            [
                6270,
                6273
            ],
            [
                6281,
                6324
            ],
            [
                6324,
                6352
            ],
            [
                6353,
                6375
            ],
            [
                6375,
                6405
            ],
            [
                6406,
                6517
            ],
            [
                6517,
                6540
            ],
            [
                6548,
                6552
            ],
            [
                6556,
                6561
            ],
            [
                6561,
                6563
            ],
            [
                6563,
                6598
            ],
            [
                6601,
                6604
            ],
            [
                6609,
                6621
            ],
            [
                6622,
                6625
            ],
            [
                6626,
                6634
            ],
            [
                6634,
                6641
            ],
            [
                6647,
                6681
            ],
            [
                6687,
                6689
            ],
            [
                6697,
                6715
            ],
            [
                6716,
                6725
            ],
            [
                6726,
                6731
            ],
            [
                6737,
                6739
            ],
            [
                6739,
                6868
            ],
            [
                6869,
                6890
            ],
            [
                6891,
                6899
            ],
            [
                6900,
                6913
            ],
            [
                6914,
                6926
            ],
            [
                6927,
                6935
            ],
            [
                6940,
                6949
            ],
            [
                6949,
                6950
            ],
            [
                6951,
                6960
            ],
            [
                6968,
                6987
            ],
            [
                6987,
                6989
            ],
            [
                6989,
                7044
            ],
            [
                7044,
                7046
            ],
            [
                7046,
                7072
            ],
            [
                7072,
                7135
            ],
            [
                7135,
                7216
            ],
            [
                7217,
                7242
            ],
            [
                7243,
                7296
            ],
            [
                7296,
                7369
            ],
            [
                7369,
                7371
            ],
            [
                7371,
                7442
            ],
            [
                7449,
                7474
            ],
            [
                7474,
                7559
            ],
            [
                7561,
                7616
            ],
            [
                7616,
                7618
            ],
            [
                7618,
                7643
            ],
            [
                7643,
                7644
            ],
            [
                7645,
                7647
            ],
            [
                7654,
                7659
            ],
            [
                7663,
                7779
            ],
            [
                7779,
                7801
            ],
            [
                7801,
                7803
            ],
            [
                7803,
                7834
            ],
            [
                7835,
                7851
            ],
            [
                7852,
                7880
            ],
            [
                7880,
                7900
            ],
            [
                7901,
                7921
            ],
            [
                7922,
                7969
            ],
            [
                7969,
                7985
            ],
            [
                7986,
                8017
            ],
            [
                8021,
                8030
            ],
            [
                8048,
                8050
            ],
            [
                8050,
                8119
            ],
            [
                8128,
                8136
            ],
            [
                8136,
                8156
            ],
            [
                8157,
                8162
            ],
            [
                8169,
                8191
            ],
            [
                8192,
                8200
            ],
            [
                8201,
                8278
            ],
            [
                8278,
                8373
            ],
            [
                8373,
                8375
            ],
            [
                8375,
                8378
            ],
            [
                8387,
                8389
            ],
            [
                8390,
                8397
            ],
            [
                8397,
                8398
            ],
            [
                8402,
                8432
            ],
            [
                8435,
                8440
            ],
            [
                8441,
                8446
            ],
            [
                8449,
                8453
            ],
            [
                8454,
                8461
            ],
            [
                8461,
                8504
            ],
            [
                8504,
                8506
            ],
            [
                8506,
                8510
            ],
            [
                8522,
                8525
            ],
            [
                8526,
                8531
            ],
            [
                8532,
                8539
            ],
            [
                8547,
                8553
            ],
            [
                8554,
                8607
            ],
            [
                8613,
                8648
            ],
            [
                8648,
                8707
            ],
            [
                8713,
                8716
            ],
            [
                8722,
                8744
            ],
            [
                8754,
                8786
            ],
            [
                8786,
                8787
            ],
            [
                8796,
                8828
            ],
            [
                8830,
                8833
            ],
            [
                8834,
                8843
            ],
            [
                8844,
                8879
            ],
            [
                8879,
                8880
            ],
            [
                8881,
                8893
            ],
            [
                8904,
                8911
            ],
            [
                8924,
                8965
            ],
            [
                8971,
                9035
            ],
            [
                9036,
                9072
            ],
            [
                9079,
                9097
            ],
            [
                9100,
                9156
            ],
            [
                9157,
                9164
            ],
            [
                9172,
                9184
            ],
            [
                9187,
                9218
            ],
            [
                9219,
                9236
            ],
            [
                9237,
                9240
            ],
            [
                9241,
                9255
            ],
            [
                9255,
                9289
            ],
            [
                9289,
                9309
            ],
            [
                9309,
                9311
            ],
            [
                9311,
                9317
            ],
            [
                9323,
                9410
            ],
            [
                9423,
                9441
            ],
            [
                9441,
                9460
            ],
            [
                9461,
                9473
            ],
            [
                9477,
                9489
            ],
            [
                9499,
                9503
            ],
            [
                9504,
                9518
            ],
            [
                9519,
                9556
            ],
            [
                9556,
                9557
            ],
            [
                9558,
                9580
            ],
            [
                9581,
                9594
            ],
            [
                9595,
                9600
            ],
            [
                9603,
                9605
            ],
            [
                9606,
                9611
            ],
            [
                9611,
                9619
            ],
            [
                9620,
                9627
            ],
            [
                9641,
                9692
            ],
            [
                9693,
                9696
            ],
            [
                9696,
                9698
            ],
            [
                9698,
                9755
            ],
            [
                9764,
                9768
            ],
            [
                9772,
                9790
            ],
            [
                9790,
                9815
            ],
            [
                9817,
                9843
            ],
            [
                9843,
                9845
            ],
            [
                9845,
                9986
            ],
            [
                9986,
                9989
            ],
            [
                9989,
                9996
            ],
            [
                10002,
                10005
            ],
            [
                10006,
                10034
            ],
            [
                10034,
                10075
            ],
            [
                10075,
                10084
            ],
            [
                10084,
                10111
            ],
            [
                10112,
                10133
            ],
            [
                10134,
                10152
            ],
            [
                10152,
                10200
            ],
            [
                10210,
                10224
            ],
            [
                10224,
                10247
            ],
            [
                10248,
                10309
            ],
            [
                10315,
                10330
            ],
            [
                10330,
                10380
            ],
            [
                10381,
                10396
            ],
            [
                10402,
                10404
            ],
            [
                10404,
                10412
            ],
            [
                10413,
                10423
            ],
            [
                10424,
                10447
            ],
            [
                10448,
                10491
            ],
            [
                10491,
                10558
            ],
            [
                10559,
                10575
            ],
            [
                10582,
                10607
            ],
            [
                10607,
                10618
            ],
            [
                10629,
                10701
            ],
            [
                10701,
                10703
            ],
            [
                10703,
                10726
            ],
            [
                10731,
                10745
            ],
            [
                10751,
                10753
            ],
            [
                10754,
                10782
            ],
            [
                10782,
                10784
            ],
            [
                10784,
                10809
            ],
            [
                10810,
                10813
            ],
            [
                10814,
                10821
            ],
            [
                10830,
                10897
            ],
            [
                10902,
                10922
            ],
            [
                10923,
                10935
            ],
            [
                10939,
                10941
            ],
            [
                10941,
                10943
            ],
            [
                10944,
                10950
            ],
            [
                10956,
                10975
            ],
            [
                10976,
                10986
            ],
            [
                10987,
                10996
            ],
            [
                11008,
                11022
            ],
            [
                11022,
                11043
            ],
            [
                11043,
                11044
            ],
            [
                11045,
                11072
            ],
            [
                11074,
                11098
            ],
            [
                11098,
                11115
            ],
            [
                11116,
                11167
            ],
            [
                11167,
                11197
            ],
            [
                11198,
                11236
            ],
            [
                11236,
                11241
            ],
            [
                11242,
                11305
            ],
            [
                11305,
                11329
            ],
            [
                11329,
                11358
            ],
            [
                11358,
                11360
            ],
            [
                11360,
                11447
            ]
        ],
        "row_chars": [
            [
                0,
                114
            ],
            [
                114,
                306
            ],
            [
                306,
                306
            ],
            [
                306,
                841
            ],
            [
                841,
                1065
            ],
            [
                1065,
                1368
            ],
            [
                1368,
                1368
            ],
            [
                1368,
                1368
            ],
            [
                1368,
                1368
            ],
            [
                1368,
                1368
            ],
            [
                1368,
                1368
            ],
            [
                1368,
                1438
            ],
            [
                1438,
                1455
            ],
            [
                1455,
                1789
            ],
            [
                1789,
                1789
            ],
            [
                1789,
                1789
            ],
            [
                1789,
                1789
            ],
            [
                1789,
                1840
            ],
            [
                1840,
                1945
            ],
            [
                1945,
                2070
            ],
            [
                2070,
                2191
            ],
            [
                2191,
                2376
            ],
            [
                2376,
                2376
            ],
            [
                2376,
                2450
            ],
            [
                2450,
                2522
            ],
            [
                2522,
                2542
            ],
            [
                2542,
                2656
            ],
            [
                2656,
                2679
            ],
            [
                2679,
                2762
            ],
            [
                2762,
                2782
            ],
            [
                2782,
                2869
            ],
            [
                2869,
                2991
            ],
            [
                2991,
                3085
            ],
            [
                3085,
                3164
            ],
            [
                3164,
                3421
            ],
            [
                3421,
                3625
            ],
            [
                3625,
                3781
            ],
            [
                3781,
                3826
            ],
            [
                3826,
                3944
            ],
            [
                3944,
                4092
            ],
            [
                4092,
                4204
            ],
            [
                4204,
                4293
            ],
            [
                4293,
                4438
            ],
            [
                4438,
                4490
            ],
            [
                4490,
                4555
            ],
            [
                4555,
                4579
            ],
            [
                4579,
                4753
            ],
            [
                4753,
                4813
            ],
            [
                4813,
                5055
            ],
            [
                5055,
                5255
            ],
            [
                5255,
                5391
            ],
            [
                5391,
                5418
            ],
            [
                5418,
                5507
            ],
            [
                5507,
                5577
            ],
            [
                5577,
                5671
            ],
            [
                5671,
                5770
            ],
            [
                5770,
                5859
            ],
            [
                5859,
                6093
            ],
            [
                6093,
                6093
            ],
            [
                6093,
                6093
            ],
            [
                6093,
                6189
            ],
            [
                6189,
                6324
            ],
            [
                6324,
                6375
            ],
            [
                6375,
                6406
            ],
            [
                6406,
                6406
            ],
            [
                6406,
                6406
            ],
            [
                6406,
                6517
            ],
            [
                6517,
                6563
            ],
            [
                6563,
                6739
            ],
            [
                6739,
                6951
            ],
            [
                6951,
                6951
            ],
            [
                6951,
                6989
            ],
            [
                6989,
                7046
            ],
            [
                7046,
                7135
            ],
            [
                7135,
                7296
            ],
            [
                7296,
                7371
            ],
            [
                7371,
                7474
            ],
            [
                7474,
                7561
            ],
            [
                7561,
                7561
            ],
            [
                7561,
                7618
            ],
            [
                7618,
                7803
            ],
            [
                7803,
                7880
            ],
            [
                7880,
                7969
            ],
            [
                7969,
                8050
            ],
            [
                8050,
                8136
            ],
            [
                8136,
                8278
            ],
            [
                8278,
                8278
            ],
            [
                8278,
                8375
            ],
            [
                8375,
                8506
            ],
            [
                8506,
                8648
            ],
            [
                8648,
                8881
            ],
            [
                8881,
                8881
            ],
            [
                8881,
                8881
            ],
            [
                8881,
                8965
            ],
            [
                8965,
                8965
            ],
            [
                8965,
                9100
            ],
            [
                9100,
                9311
            ],
            [
                9311,
                9441
            ],
            [
                9441,
                9558
            ],
            [
                9558,
                9558
            ],
            [
                9558,
                9698
            ],
            [
                9698,
                9698
            ],
            [
                9698,
                9698
            ],
            [
                9698,
                9698
            ],
            [
                9698,
                9755
            ],
            [
                9755,
                9790
            ],
            [
                9790,
                9817
            ],
            [
                9817,
                9845
            ],
            [
                9845,
                9989
            ],
            [
                9989,
                10034
            ],
            [
                10034,
                10075
            ],
            [
                10075,
                10084
            ],
            [
                10084,
                10152
            ],
            [
                10152,
                10152
            ],
            [
                10152,
                10224
            ],
            [
                10224,
                10309
            ],
            [
                10309,
                10404
            ],
            [
                10404,
                10404
            ],
            [
                10404,
                10404
            ],
            [
                10404,
                10404
            ],
            [
                10404,
                10404
            ],
            [
                10404,
                10404
            ],
            [
                10404,
                10404
            ],
            [
                10404,
                10404
            ],
            [
                10404,
                10404
            ],
            [
                10404,
                10491
            ],
            [
                10491,
                10703
            ],
            [
                10703,
                10784
            ],
            [
                10784,
                10941
            ],
            [
                10941,
                11022
            ],
            [
                11022,
                11167
            ],
            [
                11167,
                11236
            ],
            [
                11236,
                11305
            ],
            [
                11305,
                11329
            ],
            [
                11329,
                11360
            ],
            [
                11360,
                11447
            ]
        ]
    }
}