{
    "original": {
        "text": "We must pass over a part of Mrs. Rebecca Crawley's biography with that lightness and delicacy which the world demands--the moral world, that has, perhaps, no particular objection to vice, but an insuperable repugnance to hearing vice called by its proper name. There are things we do and know perfectly well in Vanity Fair, though we never speak of them: as the Ahrimanians worship the devil, but don't mention him: and a polite public will no more bear to read an authentic description of vice than a truly refined English or American female will permit the word breeches to be pronounced in her chaste hearing. And yet, madam, both are walking the world before our faces every day, without much shocking us. If you were to blush every time they went by, what complexions you would have! It is only when their naughty names are called out that your modesty has any occasion to show alarm or sense of outrage, and it has been the wish of the present writer, all through this story, deferentially to submit to the fashion at present prevailing, and only to hint at the existence of wickedness in a light, easy, and agreeable manner, so that nobody's fine feelings may be offended. I defy any one to say that our Becky, who has certainly some vices, has not been presented to the public in a perfectly genteel and inoffensive manner. In describing this Siren, singing and smiling, coaxing and cajoling, the author, with modest pride, asks his readers all round, has he once forgotten the laws of politeness, and showed the monster's hideous tail above water? No! Those who like may peep down under waves that are pretty transparent and see it writhing and twirling, diabolically hideous and slimy, flapping amongst bones, or curling round corpses; but above the waterline, I ask, has not everything been proper, agreeable, and decorous, and has any the most squeamish immoralist in Vanity Fair a right to cry fie? When, however, the Siren disappears and dives below, down among the dead men, the water of course grows turbid over her, and it is labour lost to look into it ever so curiously. They look pretty enough when they sit upon a rock, twanging their harps and combing their hair, and sing, and beckon to you to come and hold the looking-glass; but when they sink into their native element, depend on it, those mermaids are about no good, and we had best not examine the fiendish marine cannibals, revelling and feasting on their wretched pickled victims. And so, when Becky is out of the way, be sure that she is not particularly well employed, and that the less that is said about her doings is in fact the better.\nIf we were to give a full account of her proceedings during a couple of years that followed after the Curzon Street catastrophe, there might be some reason for people to say this book was improper. The actions of very vain, heartless, pleasure-seeking people are very often improper (as are many of yours, my friend with the grave face and spotless reputation--but that is merely by the way); and what are those of a woman without faith--or love--or character? And I am inclined to think that there was a period in Mrs Becky's life when she was seized, not by remorse, but by a kind of despair, and absolutely neglected her person and did not even care for her reputation.\nThis abattement and degradation did not take place all at once; it was brought about by degrees, after her calamity, and after many struggles to keep up--as a man who goes overboard hangs on to a spar whilst any hope is left, and then flings it away and goes down, when he finds that struggling is in vain.\nShe lingered about London whilst her husband was making preparations for his departure to his seat of government, and it is believed made more than one attempt to see her brother-in-law, Sir Pitt Crawley, and to work upon his feelings, which she had almost enlisted in her favour. As Sir Pitt and Mr. Wenham were walking down to the House of Commons, the latter spied Mrs. Rawdon in a black veil, and lurking near the palace of the legislature. She sneaked away when her eyes met those of Wenham, and indeed never succeeded in her designs upon the Baronet.\nProbably Lady Jane interposed. I have heard that she quite astonished her husband by the spirit which she exhibited in this quarrel, and her determination to disown Mrs. Becky. Of her own movement, she invited Rawdon to come and stop in Gaunt Street until his departure for Coventry Island, knowing that with him for a guard Mrs. Becky would not try to force her door; and she looked curiously at the superscriptions of all the letters which arrived for Sir Pitt, lest he and his sister-in-law should be corresponding. Not but that Rebecca could have written had she a mind, but she did not try to see or to write to Pitt at his own house, and after one or two attempts consented to his demand that the correspondence regarding her conjugal differences should be carried on by lawyers only.\nThe fact was that Pitt's mind had been poisoned against her. A short time after Lord Steyne's accident Wenham had been with the Baronet and given him such a biography of Mrs. Becky as had astonished the member for Queen's Crawley. He knew everything regarding her: who her father was; in what year her mother danced at the opera; what had been her previous history; and what her conduct during her married life--as I have no doubt that the greater part of the story was false and dictated by interested malevolence, it shall not be repeated here. But Becky was left with a sad sad reputation in the esteem of a country gentleman and relative who had been once rather partial to her.\nThe revenues of the Governor of Coventry Island are not large. A part of them were set aside by his Excellency for the payment of certain outstanding debts and liabilities, the charges incident on his high situation required considerable expense; finally, it was found that he could not spare to his wife more than three hundred pounds a year, which he proposed to pay to her on an undertaking that she would never trouble him. Otherwise, scandal, separation, Doctors' Commons would ensue. But it was Mr. Wenham's business, Lord Steyne's business, Rawdon's, everybody's--to get her out of the country, and hush up a most disagreeable affair.\nShe was probably so much occupied in arranging these affairs of business with her husband's lawyers that she forgot to take any step whatever about her son, the little Rawdon, and did not even once propose to go and see him. That young gentleman was consigned to the entire guardianship of his aunt and uncle, the former of whom had always possessed a great share of the child's affection. His mamma wrote him a neat letter from Boulogne, when she quitted England, in which she requested him to mind his book, and said she was going to take a Continental tour, during which she would have the pleasure of writing to him again. But she never did for a year afterwards, and not, indeed, until Sir Pitt's only boy, always sickly, died of hooping-cough and measles--then Rawdon's mamma wrote the most affectionate composition to her darling son, who was made heir of Queen's Crawley by this accident, and drawn more closely than ever to the kind lady, whose tender heart had already adopted him. Rawdon Crawley, then grown a tall, fine lad, blushed when he got the letter. \"Oh, Aunt Jane, you are my mother!\" he said; \"and not--and not that one.\" But he wrote back a kind and respectful letter to Mrs. Rebecca, then living at a boarding-house at Florence. But we are advancing matters.\nOur darling Becky's first flight was not very far. She perched upon the French coast at Boulogne, that refuge of so much exiled English innocence, and there lived in rather a genteel, widowed manner, with a femme de chambre and a couple of rooms, at an hotel. She dined at the table d'hote, where people thought her very pleasant, and where she entertained her neighbours by stories of her brother, Sir Pitt, and her great London acquaintance, talking that easy, fashionable slip-slop which has so much effect upon certain folks of small breeding. She passed with many of them for a person of importance; she gave little tea-parties in her private room and shared in the innocent amusements of the place in sea-bathing, and in jaunts in open carriages, in strolls on the sands, and in visits to the play. Mrs. Burjoice, the printer's lady, who was boarding with her family at the hotel for the summer, and to whom her Burjoice came of a Saturday and Sunday, voted her charming, until that little rogue of a Burjoice began to pay her too much attention. But there was nothing in the story, only that Becky was always affable, easy, and good-natured--and with men especially.\nNumbers of people were going abroad as usual at the end of the season, and Becky had plenty of opportunities of finding out by the behaviour of her acquaintances of the great London world the opinion of \"society\" as regarded her conduct. One day it was Lady Partlet and her daughters whom Becky confronted as she was walking modestly on Boulogne pier, the cliffs of Albion shining in the distance across the deep blue sea. Lady Partlet marshalled all her daughters round her with a sweep of her parasol and retreated from the pier, darting savage glances at poor little Becky who stood alone there.\nOn another day the packet came in. It had been blowing fresh, and it always suited Becky's humour to see the droll woe-begone faces of the people as they emerged from the boat. Lady Slingstone happened to be on board this day. Her ladyship had been exceedingly ill in her carriage, and was greatly exhausted and scarcely fit to walk up the plank from the ship to the pier. But all her energies rallied the instant she saw Becky smiling roguishly under a pink bonnet, and giving her a glance of scorn such as would have shrivelled up most women, she walked into the Custom House quite unsupported. Becky only laughed: but I don't think she liked it. She felt she was alone, quite alone, and the far-off shining cliffs of England were impassable to her.\nThe behaviour of the men had undergone too I don't know what change. Grinstone showed his teeth and laughed in her face with a familiarity that was not pleasant. Little Bob Suckling, who was cap in hand to her three months before, and would walk a mile in the rain to see for her carriage in the line at Gaunt House, was talking to Fitzoof of the Guards (Lord Heehaw's son) one day upon the jetty, as Becky took her walk there. Little Bobby nodded to her over his shoulder, without moving his hat, and continued his conversation with the heir of Heehaw. Tom Raikes tried to walk into her sitting-room at the inn with a cigar in his mouth, but she closed the door upon him, and would have locked it, only that his fingers were inside. She began to feel that she was very lonely indeed. \"If HE'D been here,\" she said, \"those cowards would never have dared to insult me.\" She thought about \"him\" with great sadness and perhaps longing--about his honest, stupid, constant kindness and fidelity; his never-ceasing obedience; his good humour; his bravery and courage. Very likely she cried, for she was particularly lively, and had put on a little extra rouge, when she came down to dinner.\nShe rouged regularly now; and--and her maid got Cognac for her besides that which was charged in the hotel bill.\nPerhaps the insults of the men were not, however, so intolerable to her as the sympathy of certain women. Mrs. Crackenbury and Mrs. Washington White passed through Boulogne on their way to Switzerland. The party were protected by Colonel Horner, young Beaumoris, and of course old Crackenbury, and Mrs. White's little girl. THEY did not avoid her. They giggled, cackled, tattled, condoled, consoled, and patronized her until they drove her almost wild with rage. To be patronized by THEM! she thought, as they went away simpering after kissing her. And she heard Beaumoris's laugh ringing on the stair and knew quite well how to interpret his hilarity.\nIt was after this visit that Becky, who had paid her weekly bills, Becky who had made herself agreeable to everybody in the house, who smiled at the landlady, called the waiters \"monsieur,\" and paid the chambermaids in politeness and apologies, what far more than compensated for a little niggardliness in point of money (of which Becky never was free), that Becky, we say, received a notice to quit from the landlord, who had been told by some one that she was quite an unfit person to have at his hotel, where English ladies would not sit down with her. And she was forced to fly into lodgings of which the dulness and solitude were most wearisome to her.\nStill she held up, in spite of these rebuffs, and tried to make a character for herself and conquer scandal. She went to church very regularly and sang louder than anybody there. She took up the cause of the widows of the shipwrecked fishermen, and gave work and drawings for the Quashyboo Mission; she subscribed to the Assembly and WOULDN'T waltz. In a word, she did everything that was respectable, and that is why we dwell upon this part of her career with more fondness than upon subsequent parts of her history, which are not so pleasant. She saw people avoiding her, and still laboriously smiled upon them; you never could suppose from her countenance what pangs of humiliation she might be enduring inwardly.\nHer history was after all a mystery. Parties were divided about her. Some people who took the trouble to busy themselves in the matter said that she was the criminal, whilst others vowed that she was as innocent as a lamb and that her odious husband was in fault. She won over a good many by bursting into tears about her boy and exhibiting the most frantic grief when his name was mentioned, or she saw anybody like him. She gained good Mrs. Alderney's heart in that way, who was rather the Queen of British Boulogne and gave the most dinners and balls of all the residents there, by weeping when Master Alderney came from Dr. Swishtail's academy to pass his holidays with his mother. \"He and her Rawdon were of the same age, and so like,\" Becky said in a voice choking with agony; whereas there was five years' difference between the boys' ages, and no more likeness between them than between my respected reader and his humble servant. Wenham, when he was going abroad, on his way to Kissingen to join Lord Steyne, enlightened Mrs. Alderney on this point and told her how he was much more able to describe little Rawdon than his mamma, who notoriously hated him and never saw him; how he was thirteen years old, while little Alderney was but nine, fair, while the other darling was dark--in a word, caused the lady in question to repent of her good humour.\nWhenever Becky made a little circle for herself with incredible toils and labour, somebody came and swept it down rudely, and she had all her work to begin over again. It was very hard; very hard; lonely and disheartening.\nThere was Mrs. Newbright, who took her up for some time, attracted by the sweetness of her singing at church and by her proper views upon serious subjects, concerning which in former days, at Queen's Crawley, Mrs. Becky had had a good deal of instruction. Well, she not only took tracts, but she read them. She worked flannel petticoats for the Quashyboos--cotton night-caps for the Cocoanut Indians--painted handscreens for the conversion of the Pope and the Jews--sat under Mr. Rowls on Wednesdays, Mr. Huggleton on Thursdays, attended two Sunday services at church, besides Mr. Bawler, the Darbyite, in the evening, and all in vain. Mrs. Newbright had occasion to correspond with the Countess of Southdown about the Warmingpan Fund for the Fiji Islanders (for the management of which admirable charity both these ladies formed part of a female committee), and having mentioned her \"sweet friend,\" Mrs. Rawdon Crawley, the Dowager Countess wrote back such a letter regarding Becky, with such particulars, hints, facts, falsehoods, and general comminations, that intimacy between Mrs. Newbright and Mrs. Crawley ceased forthwith, and all the serious world of Tours, where this misfortune took place, immediately parted company with the reprobate. Those who know the English Colonies abroad know that we carry with us us our pride, pills, prejudices, Harvey-sauces, cayenne-peppers, and other Lares, making a little Britain wherever we settle down.\nFrom one colony to another Becky fled uneasily. From Boulogne to Dieppe, from Dieppe to Caen, from Caen to Tours--trying with all her might to be respectable, and alas! always found out some day or other and pecked out of the cage by the real daws.\nMrs. Hook Eagles took her up at one of these places--a woman without a blemish in her character and a house in Portman Square. She was staying at the hotel at Dieppe, whither Becky fled, and they made each other's acquaintance first at sea, where they were swimming together, and subsequently at the table d'hote of the hotel. Mrs Eagles had heard--who indeed had not?--some of the scandal of the Steyne affair; but after a conversation with Becky, she pronounced that Mrs. Crawley was an angel, her husband a ruffian, Lord Steyne an unprincipled wretch, as everybody knew, and the whole case against Mrs. Crawley an infamous and wicked conspiracy of that rascal Wenham. \"If you were a man of any spirit, Mr. Eagles, you would box the wretch's ears the next time you see him at the Club,\" she said to her husband. But Eagles was only a quiet old gentleman, husband to Mrs. Eagles, with a taste for geology, and not tall enough to reach anybody's ears.\nThe Eagles then patronized Mrs. Rawdon, took her to live with her at her own house at Paris, quarrelled with the ambassador's wife because she would not receive her protegee, and did all that lay in woman's power to keep Becky straight in the paths of virtue and good repute.\nBecky was very respectable and orderly at first, but the life of humdrum virtue grew utterly tedious to her before long. It was the same routine every day, the same dulness and comfort, the same drive over the same stupid Bois de Boulogne, the same company of an evening, the same Blair's Sermon of a Sunday night--the same opera always being acted over and over again; Becky was dying of weariness, when, luckily for her, young Mr. Eagles came from Cambridge, and his mother, seeing the impression which her little friend made upon him, straightway gave Becky warning.\nThen she tried keeping house with a female friend; then the double menage began to quarrel and get into debt. Then she determined upon a boarding-house existence and lived for some time at that famous mansion kept by Madame de Saint Amour, in the Rue Royale, at Paris, where she began exercising her graces and fascinations upon the shabby dandies and fly-blown beauties who frequented her landlady's salons. Becky loved society and, indeed, could no more exist without it than an opium-eater without his dram, and she was happy enough at the period of her boarding-house life. \"The women here are as amusing as those in May Fair,\" she told an old London friend who met her, \"only, their dresses are not quite so fresh. The men wear cleaned gloves, and are sad rogues, certainly, but they are not worse than Jack This and Tom That. The mistress of the house is a little vulgar, but I don't think she is so vulgar as Lady ------\" and here she named the name of a great leader of fashion that I would die rather than reveal. In fact, when you saw Madame de Saint Amour's rooms lighted up of a night, men with plaques and cordons at the ecarte tables, and the women at a little distance, you might fancy yourself for a while in good society, and that Madame was a real Countess. Many people did so fancy, and Becky was for a while one of the most dashing ladies of the Countess's salons.\nBut it is probable that her old creditors of 1815 found her out and caused her to leave Paris, for the poor little woman was forced to fly from the city rather suddenly, and went thence to Brussels.\nHow well she remembered the place! She grinned as she looked up at the little entresol which she had occupied, and thought of the Bareacres family, bawling for horses and flight, as their carriage stood in the porte-cochere of the hotel. She went to Waterloo and to Laeken, where George Osborne's monument much struck her. She made a little sketch of it. \"That poor Cupid!\" she said; \"how dreadfully he was in love with me, and what a fool he was! I wonder whether little Emmy is alive. It was a good little creature; and that fat brother of hers. I have his funny fat picture still among my papers. They were kind simple people.\"\nAt Brussels Becky arrived, recommended by Madame de Saint Amour to her friend, Madame la Comtesse de Borodino, widow of Napoleon's General, the famous Count de Borodino, who was left with no resource by the deceased hero but that of a table d'hote and an ecarte table. Second-rate dandies and roues, widow-ladies who always have a lawsuit, and very simple English folks, who fancy they see \"Continental society\" at these houses, put down their money, or ate their meals, at Madame de Borodino's tables. The gallant young fellows treated the company round to champagne at the table d'hote, rode out with the women, or hired horses on country excursions, clubbed money to take boxes at the play or the opera, betted over the fair shoulders of the ladies at the ecarte tables, and wrote home to their parents in Devonshire about their felicitous introduction to foreign society.\nHere, as at Paris, Becky was a boarding-house queen, and ruled in select pensions. She never refused the champagne, or the bouquets, or the drives into the country, or the private boxes; but what she preferred was the ecarte at night,--and she played audaciously. First she played only for a little, then for five-franc pieces, then for Napoleons, then for notes: then she would not be able to pay her month's pension: then she borrowed from the young gentlemen: then she got into cash again and bullied Madame de Borodino, whom she had coaxed and wheedled before: then she was playing for ten sous at a time, and in a dire state of poverty: then her quarter's allowance would come in, and she would pay off Madame de Borodino's score and would once more take the cards against Monsieur de Rossignol, or the Chevalier de Raff.\nWhen Becky left Brussels, the sad truth is that she owed three months' pension to Madame de Borodino, of which fact, and of the gambling, and of the drinking, and of the going down on her knees to the Reverend Mr. Muff, Ministre Anglican, and borrowing money of him, and of her coaxing and flirting with Milor Noodle, son of Sir Noodle, pupil of the Rev. Mr. Muff, whom she used to take into her private room, and of whom she won large sums at ecarte--of which fact, I say, and of a hundred of her other knaveries, the Countess de Borodino informs every English person who stops at her establishment, and announces that Madame Rawdon was no better than a vipere.\nSo our little wanderer went about setting up her tent in various cities of Europe, as restless as Ulysses or Bampfylde Moore Carew. Her taste for disrespectability grew more and more remarkable. She became a perfect Bohemian ere long, herding with people whom it would make your hair stand on end to meet.\nThere is no town of any mark in Europe but it has its little colony of English raffs--men whose names Mr. Hemp the officer reads out periodically at the Sheriffs' Court--young gentlemen of very good family often, only that the latter disowns them; frequenters of billiard-rooms and estaminets, patrons of foreign races and gaming-tables. They people the debtors' prisons--they drink and swagger--they fight and brawl--they run away without paying--they have duels with French and German officers--they cheat Mr. Spooney at ecarte--they get the money and drive off to Baden in magnificent britzkas--they try their infallible martingale and lurk about the tables with empty pockets, shabby bullies, penniless bucks, until they can swindle a Jew banker with a sham bill of exchange, or find another Mr. Spooney to rob. The alternations of splendour and misery which these people undergo are very queer to view. Their life must be one of great excitement. Becky--must it be owned?--took to this life, and took to it not unkindly. She went about from town to town among these Bohemians. The lucky Mrs. Rawdon was known at every play-table in Germany. She and Madame de Cruchecassee kept house at Florence together. It is said she was ordered out of Munich, and my friend Mr. Frederick Pigeon avers that it was at her house at Lausanne that he was hocussed at supper and lost eight hundred pounds to Major Loder and the Honourable Mr. Deuceace. We are bound, you see, to give some account of Becky's biography, but of this part, the less, perhaps, that is said the better.\nThey say that, when Mrs. Crawley was particularly down on her luck, she gave concerts and lessons in music here and there. There was a Madame de Raudon, who certainly had a matinee musicale at Wildbad, accompanied by Herr Spoff, premier pianist to the Hospodar of Wallachia, and my little friend Mr. Eaves, who knew everybody and had travelled everywhere, always used to declare that he was at Strasburg in the year 1830, when a certain Madame Rebecque made her appearance in the opera of the Dame Blanche, giving occasion to a furious row in the theatre there. She was hissed off the stage by the audience, partly from her own incompetency, but chiefly from the ill-advised sympathy of some persons in the parquet, (where the officers of the garrison had their admissions); and Eaves was certain that the unfortunate debutante in question was no other than Mrs. Rawdon Crawley.\nShe was, in fact, no better than a vagabond upon this earth. When she got her money she gambled; when she had gambled it she was put to shifts to live; who knows how or by what means she succeeded? It is said that she was once seen at St. Petersburg, but was summarily dismissed from that capital by the police, so that there cannot be any possibility of truth in the report that she was a Russian spy at Toplitz and Vienna afterwards. I have even been informed that at Paris she discovered a relation of her own, no less a person than her maternal grandmother, who was not by any means a Montmorenci, but a hideous old box-opener at a theatre on the Boulevards. The meeting between them, of which other persons, as it is hinted elsewhere, seem to have been acquainted, must have been a very affecting interview. The present historian can give no certain details regarding the event.\nIt happened at Rome once that Mrs. de Rawdon's half-year's salary had just been paid into the principal banker's there, and, as everybody who had a balance of above five hundred scudi was invited to the balls which this prince of merchants gave during the winter, Becky had the honour of a card, and appeared at one of the Prince and Princess Polonia's splendid evening entertainments. The Princess was of the family of Pompili, lineally descended from the second king of Rome, and Egeria of the house of Olympus, while the Prince's grandfather, Alessandro Polonia, sold wash-balls, essences, tobacco, and pocket-handkerchiefs, ran errands for gentlemen, and lent money in a small way. All the great company in Rome thronged to his saloons--Princes, Dukes, Ambassadors, artists, fiddlers, monsignori, young bears with their leaders--every rank and condition of man. His halls blazed with light and magnificence; were resplendent with gilt frames (containing pictures), and dubious antiques; and the enormous gilt crown and arms of the princely owner, a gold mushroom on a crimson field (the colour of the pocket-handkerchiefs which he sold), and the silver fountain of the Pompili family shone all over the roof, doors, and panels of the house, and over the grand velvet baldaquins prepared to receive Popes and Emperors.\nSo Becky, who had arrived in the diligence from Florence, and was lodged at an inn in a very modest way, got a card for Prince Polonia's entertainment, and her maid dressed her with unusual care, and she went to this fine ball leaning on the arm of Major Loder, with whom she happened to be travelling at the time--(the same man who shot Prince Ravoli at Naples the next year, and was caned by Sir John Buckskin for carrying four kings in his hat besides those which he used in playing at ecarte )--and this pair went into the rooms together, and Becky saw a number of old faces which she remembered in happier days, when she was not innocent, but not found out. Major Loder knew a great number of foreigners, keen-looking whiskered men with dirty striped ribbons in their buttonholes, and a very small display of linen; but his own countrymen, it might be remarked, eschewed the Major. Becky, too, knew some ladies here and there--French widows, dubious Italian countesses, whose husbands had treated them ill--faugh--what shall we say, we who have moved among some of the finest company of Vanity Fair, of this refuse and sediment of rascals? If we play, let it be with clean cards, and not with this dirty pack. But every man who has formed one of the innumerable army of travellers has seen these marauding irregulars hanging on, like Nym and Pistol, to the main force, wearing the king's colours and boasting of his commission, but pillaging for themselves, and occasionally gibbeted by the roadside.\nWell, she was hanging on the arm of Major Loder, and they went through the rooms together, and drank a great quantity of champagne at the buffet, where the people, and especially the Major's irregular corps, struggled furiously for refreshments, of which when the pair had had enough, they pushed on until they reached the Duchess's own pink velvet saloon, at the end of the suite of apartments (where the statue of the Venus is, and the great Venice looking-glasses, framed in silver), and where the princely family were entertaining their most distinguished guests at a round table at supper. It was just such a little select banquet as that of which Becky recollected that she had partaken at Lord Steyne's--and there he sat at Polonia's table, and she saw him. The scar cut by the diamond on his white, bald, shining forehead made a burning red mark; his red whiskers were dyed of a purple hue, which made his pale face look still paler. He wore his collar and orders, his blue ribbon and garter. He was a greater Prince than any there, though there was a reigning Duke and a Royal Highness, with their princesses, and near his Lordship was seated the beautiful Countess of Belladonna, nee de Glandier, whose husband (the Count Paolo della Belladonna), so well known for his brilliant entomological collections, had been long absent on a mission to the Emperor of Morocco.\nWhen Becky beheld that familiar and illustrious face, how vulgar all of a sudden did Major Loder appear to her, and how that odious Captain Rook did smell of tobacco! In one instant she reassumed her fine-ladyship and tried to look and feel as if she were in May Fair once more. \"That woman looks stupid and ill-humoured,\" she thought; \"I am sure she can't amuse him. No, he must be bored by her--he never was by me.\" A hundred such touching hopes, fears, and memories palpitated in her little heart, as she looked with her brightest eyes (the rouge which she wore up to her eyelids made them twinkle) towards the great nobleman. Of a Star and Garter night Lord Steyne used also to put on his grandest manner and to look and speak like a great prince, as he was. Becky admired him smiling sumptuously, easy, lofty, and stately. Ah, bon Dieu, what a pleasant companion he was, what a brilliant wit, what a rich fund of talk, what a grand manner!--and she had exchanged this for Major Loder, reeking of cigars and brandy-and-water, and Captain Rook with his horsejockey jokes and prize-ring slang, and their like. \"I wonder whether he will know me,\" she thought. Lord Steyne was talking and laughing with a great and illustrious lady at his side, when he looked up and saw Becky.\nShe was all over in a flutter as their eyes met, and she put on the very best smile she could muster, and dropped him a little, timid, imploring curtsey. He stared aghast at her for a minute, as Macbeth might on beholding Banquo's sudden appearance at his ball-supper, and remained looking at her with open mouth, when that horrid Major Loder pulled her away.\n\"Come away into the supper-room, Mrs. R.,\" was that gentleman's remark: \"seeing these nobs grubbing away has made me peckish too. Let's go and try the old governor's champagne.\" Becky thought the Major had had a great deal too much already.\nThe day after she went to walk on the Pincian Hill--the Hyde Park of the Roman idlers--possibly in hopes to have another sight of Lord Steyne. But she met another acquaintance there: it was Mr. Fiche, his lordship's confidential man, who came up nodding to her rather familiarly and putting a finger to his hat. \"I knew that Madame was here,\" he said; \"I followed her from her hotel. I have some advice to give Madame.\"\n\"From the Marquis of Steyne?\" Becky asked, resuming as much of her dignity as she could muster, and not a little agitated by hope and expectation.\n\"No,\" said the valet; \"it is from me. Rome is very unwholesome.\"\n\"Not at this season, Monsieur Fiche--not till after Easter.\"\n\"I tell Madame it is unwholesome now. There is always malaria for some people. That cursed marsh wind kills many at all seasons. Look, Madame Crawley, you were always bon enfant, and I have an interest in you, parole d'honneur. Be warned. Go away from Rome, I tell you--or you will be ill and die.\"\nBecky laughed, though in rage and fury. \"What! assassinate poor little me?\" she said. \"How romantic! Does my lord carry bravos for couriers, and stilettos in the fourgons? Bah! I will stay, if but to plague him. I have those who will defend me whilst I am here.\"\nIt was Monsieur Fiche's turn to laugh now. \"Defend you,\" he said, \"and who? The Major, the Captain, any one of those gambling men whom Madame sees would take her life for a hundred louis. We know things about Major Loder (he is no more a Major than I am my Lord the Marquis) which would send him to the galleys or worse. We know everything and have friends everywhere. We know whom you saw at Paris, and what relations you found there. Yes, Madame may stare, but we do. How was it that no minister on the Continent would receive Madame? She has offended somebody: who never forgives--whose rage redoubled when he saw you. He was like a madman last night when he came home. Madame de Belladonna made him a scene about you and fired off in one of her furies.\"\n\"Oh, it was Madame de Belladonna, was it?\" Becky said, relieved a little, for the information she had just got had scared her.\n\"No--she does not matter--she is always jealous. I tell you it was Monseigneur. You did wrong to show yourself to him. And if you stay here you will repent it. Mark my words. Go. Here is my lord's carriage\"--and seizing Becky's arm, he rushed down an alley of the garden as Lord Steyne's barouche, blazing with heraldic devices, came whirling along the avenue, borne by the almost priceless horses, and bearing Madame de Belladonna lolling on the cushions, dark, sulky, and blooming, a King Charles in her lap, a white parasol swaying over her head, and old Steyne stretched at her side with a livid face and ghastly eyes. Hate, or anger, or desire caused them to brighten now and then still, but ordinarily, they gave no light, and seemed tired of looking out on a world of which almost all the pleasure and all the best beauty had palled upon the worn-out wicked old man.\n\"Monseigneur has never recovered the shock of that night, never,\" Monsieur Fiche whispered to Mrs. Crawley as the carriage flashed by, and she peeped out at it from behind the shrubs that hid her. \"That was a consolation at any rate,\" Becky thought.\nWhether my lord really had murderous intentions towards Mrs. Becky as Monsieur Fiche said (since Monseigneur's death he has returned to his native country, where he lives much respected, and has purchased from his Prince the title of Baron Ficci), and the factotum objected to have to do with assassination; or whether he simply had a commission to frighten Mrs. Crawley out of a city where his Lordship proposed to pass the winter, and the sight of her would be eminently disagreeable to the great nobleman, is a point which has never been ascertained: but the threat had its effect upon the little woman, and she sought no more to intrude herself upon the presence of her old patron.\nEverybody knows the melancholy end of that nobleman, which befell at Naples two months after the French Revolution of 1830; when the Most Honourable George Gustavus, Marquis of Steyne, Earl of Gaunt and of Gaunt Castle, in the Peerage of Ireland, Viscount Hellborough, Baron Pitchley and Grillsby, a Knight of the Most Noble Order of the Garter, of the Golden Fleece of Spain, of the Russian Order of Saint Nicholas of the First Class, of the Turkish Order of the Crescent, First Lord of the Powder Closet and Groom of the Back Stairs, Colonel of the Gaunt or Regent's Own Regiment of Militia, a Trustee of the British Museum, an Elder Brother of the Trinity House, a Governor of the White Friars, and D.C.L.--died after a series of fits brought on, as the papers said, by the shock occasioned to his lordship's sensibilities by the downfall of the ancient French monarchy.\nAn eloquent catalogue appeared in a weekly print, describing his virtues, his magnificence, his talents, and his good actions. His sensibility, his attachment to the illustrious House of Bourbon, with which he claimed an alliance, were such that he could not survive the misfortunes of his august kinsmen. His body was buried at Naples, and his heart--that heart which always beat with every generous and noble emotion was brought back to Castle Gaunt in a silver urn. \"In him,\" Mr. Wagg said, \"the poor and the Fine Arts have lost a beneficent patron, society one of its most brilliant ornaments, and England one of her loftiest patriots and statesmen,\" &c., &c.\nHis will was a good deal disputed, and an attempt was made to force from Madame de Belladonna the celebrated jewel called the \"Jew's-eye\" diamond, which his lordship always wore on his forefinger, and which it was said that she removed from it after his lamented demise. But his confidential friend and attendant, Monsieur Fiche proved that the ring had been presented to the said Madame de Belladonna two days before the Marquis's death, as were the bank-notes, jewels, Neapolitan and French bonds, &c., found in his lordship's secretaire and claimed by his heirs from that injured woman.",
        "paragraph_chars": [
            [
                0,
                2622
            ],
            [
                2622,
                3295
            ],
            [
                3295,
                3602
            ],
            [
                3602,
                4159
            ],
            [
                4159,
                4950
            ],
            [
                4950,
                5633
            ],
            [
                5633,
                6275
            ],
            [
                6275,
                7557
            ],
            [
                7557,
                8731
            ],
            [
                8731,
                9330
            ],
            [
                9330,
                10082
            ],
            [
                10082,
                11267
            ],
            [
                11267,
                11380
            ],
            [
                11380,
                12033
            ],
            [
                12033,
                12691
            ],
            [
                12691,
                13408
            ],
            [
                13408,
                14768
            ],
            [
                14768,
                14991
            ],
            [
                14991,
                16440
            ],
            [
                16440,
                16689
            ],
            [
                16689,
                17641
            ],
            [
                17641,
                17917
            ],
            [
                17917,
                18487
            ],
            [
                18487,
                19872
            ],
            [
                19872,
                20071
            ],
            [
                20071,
                20702
            ],
            [
                20702,
                21578
            ],
            [
                21578,
                22405
            ],
            [
                22405,
                23068
            ],
            [
                23068,
                23374
            ],
            [
                23374,
                24941
            ],
            [
                24941,
                25820
            ],
            [
                25820,
                26704
            ],
            [
                26704,
                28026
            ],
            [
                28026,
                29532
            ],
            [
                29532,
                30909
            ],
            [
                30909,
                32187
            ],
            [
                32187,
                32547
            ],
            [
                32547,
                32788
            ],
            [
                32788,
                33208
            ],
            [
                33208,
                33355
            ],
            [
                33355,
                33420
            ],
            [
                33420,
                33481
            ],
            [
                33481,
                33780
            ],
            [
                33780,
                34043
            ],
            [
                34043,
                34801
            ],
            [
                34801,
                34928
            ],
            [
                34928,
                35802
            ],
            [
                35802,
                36052
            ],
            [
                36052,
                36738
            ],
            [
                36738,
                37612
            ],
            [
                37612,
                38276
            ],
            [
                38276,
                38865
            ]
        ],
        "segment_chars": [
            [
                0,
                261
            ],
            [
                261,
                613
            ],
            [
                613,
                710
            ],
            [
                710,
                789
            ],
            [
                789,
                1180
            ],
            [
                1180,
                1332
            ],
            [
                1332,
                1557
            ],
            [
                1557,
                1561
            ],
            [
                1561,
                1912
            ],
            [
                1912,
                2090
            ],
            [
                2090,
                2461
            ],
            [
                2461,
                2622
            ],
            [
                2622,
                2820
            ],
            [
                2820,
                3083
            ],
            [
                3083,
                3295
            ],
            [
                3295,
                3602
            ],
            [
                3602,
                3883
            ],
            [
                3883,
                4047
            ],
            [
                4047,
                4159
            ],
            [
                4159,
                4190
            ],
            [
                4190,
                4336
            ],
            [
                4336,
                4678
            ],
            [
                4678,
                4950
            ],
            [
                4950,
                5011
            ],
            [
                5011,
                5181
            ],
            [
                5181,
                5497
            ],
            [
                5497,
                5633
            ],
            [
                5633,
                5696
            ],
            [
                5696,
                6061
            ],
            [
                6061,
                6123
            ],
            [
                6123,
                6275
            ],
            [
                6275,
                6500
            ],
            [
                6500,
                6665
            ],
            [
                6665,
                6902
            ],
            [
                6902,
                7267
            ],
            [
                7267,
                7344
            ],
            [
                7344,
                7380
            ],
            [
                7380,
                7418
            ],
            [
                7418,
                7527
            ],
            [
                7527,
                7557
            ],
            [
                7557,
                7608
            ],
            [
                7608,
                7817
            ],
            [
                7817,
                8105
            ],
            [
                8105,
                8362
            ],
            [
                8362,
                8610
            ],
            [
                8610,
                8731
            ],
            [
                8731,
                8969
            ],
            [
                8969,
                9154
            ],
            [
                9154,
                9330
            ],
            [
                9330,
                9365
            ],
            [
                9365,
                9507
            ],
            [
                9507,
                9557
            ],
            [
                9557,
                9703
            ],
            [
                9703,
                9927
            ],
            [
                9927,
                9979
            ],
            [
                9979,
                10082
            ],
            [
                10082,
                10151
            ],
            [
                10151,
                10244
            ],
            [
                10244,
                10510
            ],
            [
                10510,
                10636
            ],
            [
                10636,
                10816
            ],
            [
                10816,
                10867
            ],
            [
                10867,
                10951
            ],
            [
                10951,
                11144
            ],
            [
                11144,
                11267
            ],
            [
                11267,
                11380
            ],
            [
                11380,
                11486
            ],
            [
                11486,
                11582
            ],
            [
                11582,
                11704
            ],
            [
                11704,
                11728
            ],
            [
                11728,
                11843
            ],
            [
                11843,
                11869
            ],
            [
                11869,
                11929
            ],
            [
                11929,
                12033
            ],
            [
                12033,
                12589
            ],
            [
                12589,
                12691
            ],
            [
                12691,
                12800
            ],
            [
                12800,
                12870
            ],
            [
                12870,
                13041
            ],
            [
                13041,
                13236
            ],
            [
                13236,
                13408
            ],
            [
                13408,
                13445
            ],
            [
                13445,
                13477
            ],
            [
                13477,
                13672
            ],
            [
                13672,
                13830
            ],
            [
                13830,
                14094
            ],
            [
                14094,
                14347
            ],
            [
                14347,
                14768
            ],
            [
                14768,
                14936
            ],
            [
                14936,
                14991
            ],
            [
                14991,
                15247
            ],
            [
                15247,
                15298
            ],
            [
                15298,
                15627
            ],
            [
                15627,
                16239
            ],
            [
                16239,
                16440
            ],
            [
                16440,
                16488
            ],
            [
                16488,
                16609
            ],
            [
                16609,
                16689
            ],
            [
                16689,
                16816
            ],
            [
                16816,
                17016
            ],
            [
                17016,
                17360
            ],
            [
                17360,
                17503
            ],
            [
                17503,
                17641
            ],
            [
                17641,
                17917
            ],
            [
                17917,
                18038
            ],
            [
                18038,
                18487
            ],
            [
                18487,
                18597
            ],
            [
                18597,
                18896
            ],
            [
                18896,
                19065
            ],
            [
                19065,
                19207
            ],
            [
                19207,
                19319
            ],
            [
                19319,
                19510
            ],
            [
                19510,
                19763
            ],
            [
                19763,
                19872
            ],
            [
                19872,
                20071
            ],
            [
                20071,
                20106
            ],
            [
                20106,
                20309
            ],
            [
                20309,
                20394
            ],
            [
                20394,
                20426
            ],
            [
                20426,
                20445
            ],
            [
                20445,
                20519
            ],
            [
                20519,
                20558
            ],
            [
                20558,
                20619
            ],
            [
                20619,
                20671
            ],
            [
                20671,
                20702
            ],
            [
                20702,
                20971
            ],
            [
                20971,
                21205
            ],
            [
                21205,
                21578
            ],
            [
                21578,
                21661
            ],
            [
                21661,
                21842
            ],
            [
                21842,
                22405
            ],
            [
                22405,
                23068
            ],
            [
                23068,
                23200
            ],
            [
                23200,
                23263
            ],
            [
                23263,
                23374
            ],
            [
                23374,
                23712
            ],
            [
                23712,
                24190
            ],
            [
                24190,
                24282
            ],
            [
                24282,
                24326
            ],
            [
                24326,
                24400
            ],
            [
                24400,
                24456
            ],
            [
                24456,
                24520
            ],
            [
                24520,
                24584
            ],
            [
                24584,
                24813
            ],
            [
                24813,
                24941
            ],
            [
                24941,
                25064
            ],
            [
                25064,
                25503
            ],
            [
                25503,
                25820
            ],
            [
                25820,
                25881
            ],
            [
                25881,
                26018
            ],
            [
                26018,
                26256
            ],
            [
                26256,
                26483
            ],
            [
                26483,
                26633
            ],
            [
                26633,
                26704
            ],
            [
                26704,
                27090
            ],
            [
                27090,
                27390
            ],
            [
                27390,
                27570
            ],
            [
                27570,
                28026
            ],
            [
                28026,
                28689
            ],
            [
                28689,
                28913
            ],
            [
                28913,
                29171
            ],
            [
                29171,
                29241
            ],
            [
                29241,
                29532
            ],
            [
                29532,
                30127
            ],
            [
                30127,
                30297
            ],
            [
                30297,
                30474
            ],
            [
                30474,
                30533
            ],
            [
                30533,
                30909
            ],
            [
                30909,
                31076
            ],
            [
                31076,
                31188
            ],
            [
                31188,
                31277
            ],
            [
                31277,
                31327
            ],
            [
                31327,
                31539
            ],
            [
                31539,
                31672
            ],
            [
                31672,
                31737
            ],
            [
                31737,
                32021
            ],
            [
                32021,
                32070
            ],
            [
                32070,
                32187
            ],
            [
                32187,
                32341
            ],
            [
                32341,
                32547
            ],
            [
                32547,
                32677
            ],
            [
                32677,
                32725
            ],
            [
                32725,
                32788
            ],
            [
                32788,
                32931
            ],
            [
                32931,
                33100
            ],
            [
                33100,
                33172
            ],
            [
                33172,
                33208
            ],
            [
                33208,
                33238
            ],
            [
                33238,
                33355
            ],
            [
                33355,
                33393
            ],
            [
                33393,
                33420
            ],
            [
                33420,
                33481
            ],
            [
                33481,
                33519
            ],
            [
                33519,
                33560
            ],
            [
                33560,
                33610
            ],
            [
                33610,
                33709
            ],
            [
                33709,
                33720
            ],
            [
                33720,
                33780
            ],
            [
                33780,
                33820
            ],
            [
                33820,
                33827
            ],
            [
                33827,
                33856
            ],
            [
                33856,
                33866
            ],
            [
                33866,
                33881
            ],
            [
                33881,
                33952
            ],
            [
                33952,
                33957
            ],
            [
                33957,
                33992
            ],
            [
                33992,
                34043
            ],
            [
                34043,
                34086
            ],
            [
                34086,
                34119
            ],
            [
                34119,
                34231
            ],
            [
                34231,
                34364
            ],
            [
                34364,
                34412
            ],
            [
                34412,
                34479
            ],
            [
                34479,
                34513
            ],
            [
                34513,
                34580
            ],
            [
                34580,
                34665
            ],
            [
                34665,
                34716
            ],
            [
                34716,
                34801
            ],
            [
                34801,
                34844
            ],
            [
                34844,
                34928
            ],
            [
                34928,
                34977
            ],
            [
                34977,
                35008
            ],
            [
                35008,
                35047
            ],
            [
                35047,
                35088
            ],
            [
                35088,
                35103
            ],
            [
                35103,
                35107
            ],
            [
                35107,
                35551
            ],
            [
                35551,
                35802
            ],
            [
                35802,
                35999
            ],
            [
                35999,
                36052
            ],
            [
                36052,
                36738
            ],
            [
                36738,
                37612
            ],
            [
                37612,
                37739
            ],
            [
                37739,
                37918
            ],
            [
                37918,
                38081
            ],
            [
                38081,
                38276
            ],
            [
                38276,
                38547
            ],
            [
                38547,
                38865
            ]
        ],
        "overlap_chars": [
            [
                0,
                70
            ],
            [
                85,
                117
            ],
            [
                119,
                144
            ],
            [
                155,
                191
            ],
            [
                221,
                228
            ],
            [
                259,
                261
            ],
            [
                261,
                280
            ],
            [
                288,
                354
            ],
            [
                416,
                448
            ],
            [
                457,
                523
            ],
            [
                536,
                578
            ],
            [
                590,
                596
            ],
            [
                604,
                613
            ],
            [
                613,
                682
            ],
            [
                708,
                710
            ],
            [
                710,
                789
            ],
            [
                789,
                844
            ],
            [
                878,
                882
            ],
            [
                862,
                865
            ],
            [
                901,
                908
            ],
            [
                875,
                877
            ],
            [
                1013,
                1020
            ],
            [
                958,
                981
            ],
            [
                1048,
                1052
            ],
            [
                1056,
                1060
            ],
            [
                1061,
                1180
            ],
            [
                1180,
                1186
            ],
            [
                1195,
                1216
            ],
            [
                1248,
                1270
            ],
            [
                1285,
                1323
            ],
            [
                1330,
                1332
            ],
            [
                1332,
                1400
            ],
            [
                1418,
                1424
            ],
            [
                1467,
                1557
            ],
            [
                1557,
                1561
            ],
            [
                1561,
                1570
            ],
            [
                1576,
                1595
            ],
            [
                1847,
                1850
            ],
            [
                1596,
                1601
            ],
            [
                1630,
                1694
            ],
            [
                1744,
                1770
            ],
            [
                1786,
                1796
            ],
            [
                1778,
                1781
            ],
            [
                1797,
                1801
            ],
            [
                1825,
                1833
            ],
            [
                1912,
                1932
            ],
            [
                1948,
                1951
            ],
            [
                1958,
                1999
            ],
            [
                2010,
                2015
            ],
            [
                2031,
                2042
            ],
            [
                2055,
                2057
            ],
            [
                2063,
                2070
            ],
            [
                2088,
                2090
            ],
            [
                2090,
                2127
            ],
            [
                2204,
                2206
            ],
            [
                2133,
                2184
            ],
            [
                2248,
                2273
            ],
            [
                2231,
                2234
            ],
            [
                2294,
                2328
            ],
            [
                2207,
                2209
            ],
            [
                2335,
                2371
            ],
            [
                2417,
                2461
            ],
            [
                2461,
                2511
            ],
            [
                2560,
                2598
            ],
            [
                2610,
                2622
            ],
            [
                2622,
                2662
            ],
            [
                2714,
                2777
            ],
            [
                2789,
                2820
            ],
            [
                2820,
                2855
            ],
            [
                2874,
                2884
            ],
            [
                2890,
                2904
            ],
            [
                3015,
                3058
            ],
            [
                2865,
                2866
            ],
            [
                3060,
                3067
            ],
            [
                3069,
                3083
            ],
            [
                3083,
                3140
            ],
            [
                3141,
                3216
            ],
            [
                3232,
                3295
            ],
            [
                3295,
                3299
            ],
            [
                3315,
                3357
            ],
            [
                3359,
                3390
            ],
            [
                3410,
                3447
            ],
            [
                3449,
                3519
            ],
            [
                3600,
                3602
            ],
            [
                3602,
                3691
            ],
            [
                3714,
                3734
            ],
            [
                3844,
                3847
            ],
            [
                3762,
                3836
            ],
            [
                3881,
                3882
            ],
            [
                4159,
                4190
            ],
            [
                4190,
                4243
            ],
            [
                4248,
                4254
            ],
            [
                4292,
                4336
            ],
            [
                4357,
                4378
            ],
            [
                4393,
                4511
            ],
            [
                4379,
                4383
            ],
            [
                4526,
                4542
            ],
            [
                4553,
                4555
            ],
            [
                4579,
                4678
            ],
            [
                4803,
                4828
            ],
            [
                4691,
                4698
            ],
            [
                4829,
                4841
            ],
            [
                4776,
                4780
            ],
            [
                4846,
                4857
            ],
            [
                4862,
                4876
            ],
            [
                4912,
                4935
            ],
            [
                4936,
                4943
            ],
            [
                4948,
                4950
            ],
            [
                4954,
                4958
            ],
            [
                4968,
                5011
            ],
            [
                5056,
                5063
            ],
            [
                5096,
                5148
            ],
            [
                5213,
                5279
            ],
            [
                5294,
                5314
            ],
            [
                5464,
                5465
            ],
            [
                5086,
                5089
            ],
            [
                5325,
                5360
            ],
            [
                5495,
                5497
            ],
            [
                5507,
                5544
            ],
            [
                5549,
                5555
            ],
            [
                5631,
                5633
            ],
            [
                5633,
                5636
            ],
            [
                5646,
                5680
            ],
            [
                5685,
                5696
            ],
            [
                5892,
                5895
            ],
            [
                5716,
                5728
            ],
            [
                5744,
                5762
            ],
            [
                5783,
                5788
            ],
            [
                5804,
                5805
            ],
            [
                5789,
                5792
            ],
            [
                5907,
                5925
            ],
            [
                5929,
                6011
            ],
            [
                6027,
                6061
            ],
            [
                6127,
                6133
            ],
            [
                6144,
                6146
            ],
            [
                6204,
                6275
            ],
            [
                6275,
                6321
            ],
            [
                6339,
                6431
            ],
            [
                6436,
                6462
            ],
            [
                6468,
                6500
            ],
            [
                6500,
                6541
            ],
            [
                6549,
                6583
            ],
            [
                6604,
                6614
            ],
            [
                6596,
                6598
            ],
            [
                6663,
                6665
            ],
            [
                6665,
                6713
            ],
            [
                6740,
                6752
            ],
            [
                6763,
                6778
            ],
            [
                6783,
                6835
            ],
            [
                6853,
                6858
            ],
            [
                6888,
                6901
            ],
            [
                6902,
                6930
            ],
            [
                6941,
                7009
            ],
            [
                7012,
                7035
            ],
            [
                7265,
                7266
            ],
            [
                7037,
                7084
            ],
            [
                7097,
                7170
            ],
            [
                7267,
                7344
            ],
            [
                7344,
                7380
            ],
            [
                7380,
                7397
            ],
            [
                7403,
                7418
            ],
            [
                7422,
                7513
            ],
            [
                7517,
                7527
            ],
            [
                7527,
                7557
            ],
            [
                7557,
                7608
            ],
            [
                7608,
                7653
            ],
            [
                7702,
                7763
            ],
            [
                7781,
                7802
            ],
            [
                7804,
                7817
            ],
            [
                7898,
                7928
            ],
            [
                7932,
                8047
            ],
            [
                8052,
                8054
            ],
            [
                8072,
                8105
            ],
            [
                8105,
                8120
            ],
            [
                8129,
                8189
            ],
            [
                8210,
                8250
            ],
            [
                8264,
                8276
            ],
            [
                8284,
                8309
            ],
            [
                8313,
                8338
            ],
            [
                8342,
                8362
            ],
            [
                8662,
                8704
            ],
            [
                8710,
                8731
            ],
            [
                8742,
                8748
            ],
            [
                8760,
                8766
            ],
            [
                8776,
                8793
            ],
            [
                8906,
                8912
            ],
            [
                8794,
                8801
            ],
            [
                8806,
                8811
            ],
            [
                8919,
                8933
            ],
            [
                8956,
                8969
            ],
            [
                8969,
                8976
            ],
            [
                8984,
                9014
            ],
            [
                9037,
                9055
            ],
            [
                9065,
                9081
            ],
            [
                9152,
                9154
            ],
            [
                9154,
                9247
            ],
            [
                9261,
                9306
            ],
            [
                9328,
                9330
            ],
            [
                9330,
                9355
            ],
            [
                9356,
                9365
            ],
            [
                9365,
                9405
            ],
            [
                9413,
                9418
            ],
            [
                9428,
                9438
            ],
            [
                9445,
                9475
            ],
            [
                9492,
                9507
            ],
            [
                9507,
                9557
            ],
            [
                9570,
                9594
            ],
            [
                9610,
                9615
            ],
            [
                9642,
                9650
            ],
            [
                9658,
                9703
            ],
            [
                9703,
                9795
            ],
            [
                9801,
                9823
            ],
            [
                9849,
                9855
            ],
            [
                9824,
                9829
            ],
            [
                9873,
                9927
            ],
            [
                9927,
                9932
            ],
            [
                9938,
                9979
            ],
            [
                9979,
                9995
            ],
            [
                10003,
                10082
            ],
            [
                10082,
                10120
            ],
            [
                10143,
                10149
            ],
            [
                10121,
                10124
            ],
            [
                10149,
                10151
            ],
            [
                10151,
                10160
            ],
            [
                10182,
                10244
            ],
            [
                10244,
                10268
            ],
            [
                10292,
                10311
            ],
            [
                10317,
                10353
            ],
            [
                10288,
                10291
            ],
            [
                10397,
                10413
            ],
            [
                10456,
                10497
            ],
            [
                10503,
                10510
            ],
            [
                10628,
                10630
            ],
            [
                10523,
                10536
            ],
            [
                10556,
                10563
            ],
            [
                10571,
                10610
            ],
            [
                10634,
                10636
            ],
            [
                10636,
                10753
            ],
            [
                10814,
                10816
            ],
            [
                10816,
                10866
            ],
            [
                10867,
                10951
            ],
            [
                10951,
                11013
            ],
            [
                11015,
                11130
            ],
            [
                11142,
                11144
            ],
            [
                11144,
                11166
            ],
            [
                11200,
                11203
            ],
            [
                11208,
                11267
            ],
            [
                11267,
                11292
            ],
            [
                11298,
                11329
            ],
            [
                11378,
                11380
            ],
            [
                11380,
                11444
            ],
            [
                11452,
                11486
            ],
            [
                11486,
                11552
            ],
            [
                11586,
                11591
            ],
            [
                11553,
                11581
            ],
            [
                11704,
                11728
            ],
            [
                11728,
                11750
            ],
            [
                11760,
                11778
            ],
            [
                11780,
                11843
            ],
            [
                11843,
                11869
            ],
            [
                11869,
                11909
            ],
            [
                11927,
                11928
            ],
            [
                12033,
                12099
            ],
            [
                12106,
                12190
            ],
            [
                12223,
                12226
            ],
            [
                12192,
                12222
            ],
            [
                12190,
                12191
            ],
            [
                12387,
                12450
            ],
            [
                12456,
                12472
            ],
            [
                12482,
                12494
            ],
            [
                12501,
                12538
            ],
            [
                12263,
                12266
            ],
            [
                12545,
                12589
            ],
            [
                12593,
                12631
            ],
            [
                12673,
                12682
            ],
            [
                12645,
                12662
            ],
            [
                12689,
                12691
            ],
            [
                12691,
                12708
            ],
            [
                12735,
                12800
            ],
            [
                12800,
                12870
            ],
            [
                12870,
                12908
            ],
            [
                12913,
                12944
            ],
            [
                12954,
                12993
            ],
            [
                13056,
                13091
            ],
            [
                13234,
                13236
            ],
            [
                13236,
                13337
            ],
            [
                13350,
                13408
            ],
            [
                13453,
                13477
            ],
            [
                13477,
                13481
            ],
            [
                13543,
                13573
            ],
            [
                13529,
                13542
            ],
            [
                13573,
                13574
            ],
            [
                13582,
                13607
            ],
            [
                13611,
                13619
            ],
            [
                13630,
                13672
            ],
            [
                13672,
                13799
            ],
            [
                13828,
                13829
            ],
            [
                13830,
                13880
            ],
            [
                13990,
                14031
            ],
            [
                14056,
                14093
            ],
            [
                14094,
                14117
            ],
            [
                14121,
                14141
            ],
            [
                14146,
                14208
            ],
            [
                14214,
                14302
            ],
            [
                14323,
                14326
            ],
            [
                14345,
                14347
            ],
            [
                14347,
                14354
            ],
            [
                14547,
                14550
            ],
            [
                14363,
                14366
            ],
            [
                14381,
                14451
            ],
            [
                14379,
                14380
            ],
            [
                14466,
                14482
            ],
            [
                14524,
                14530
            ],
            [
                14540,
                14545
            ],
            [
                14551,
                14611
            ],
            [
                14693,
                14697
            ],
            [
                14621,
                14648
            ],
            [
                14653,
                14658
            ],
            [
                14659,
                14663
            ],
            [
                14699,
                14725
            ],
            [
                14738,
                14768
            ],
            [
                14768,
                14837
            ],
            [
                14848,
                14936
            ],
            [
                14936,
                14942
            ],
            [
                14954,
                14991
            ],
            [
                14991,
                15145
            ],
            [
                15245,
                15247
            ],
            [
                15266,
                15278
            ],
            [
                15287,
                15298
            ],
            [
                15298,
                15346
            ],
            [
                15355,
                15390
            ],
            [
                15392,
                15455
            ],
            [
                15520,
                15559
            ],
            [
                15610,
                15627
            ],
            [
                15627,
                15641
            ],
            [
                15655,
                15657
            ],
            [
                15674,
                15705
            ],
            [
                15829,
                15830
            ],
            [
                15721,
                15748
            ],
            [
                16120,
                16125
            ],
            [
                15861,
                15888
            ],
            [
                15891,
                15910
            ],
            [
                16094,
                16095
            ],
            [
                15706,
                15709
            ],
            [
                15924,
                15943
            ],
            [
                15949,
                15957
            ],
            [
                15769,
                15771
            ],
            [
                15998,
                16027
            ],
            [
                16048,
                16054
            ],
            [
                16072,
                16086
            ],
            [
                15669,
                15673
            ],
            [
                15968,
                15973
            ],
            [
                16104,
                16120
            ],
            [
                16237,
                16238
            ],
            [
                16440,
                16488
            ],
            [
                16488,
                16552
            ],
            [
                16561,
                16609
            ],
            [
                16609,
                16625
            ],
            [
                16644,
                16670
            ],
            [
                16687,
                16689
            ],
            [
                16689,
                16740
            ],
            [
                16742,
                16784
            ],
            [
                16785,
                16816
            ],
            [
                16816,
                16854
            ],
            [
                16930,
                16935
            ],
            [
                16864,
                16921
            ],
            [
                16936,
                16968
            ],
            [
                16982,
                16988
            ],
            [
                17009,
                17014
            ],
            [
                16989,
                16994
            ],
            [
                17014,
                17016
            ],
            [
                17016,
                17036
            ],
            [
                17059,
                17141
            ],
            [
                17153,
                17302
            ],
            [
                17319,
                17359
            ],
            [
                17645,
                17733
            ],
            [
                17816,
                17827
            ],
            [
                17780,
                17783
            ],
            [
                17854,
                17867
            ],
            [
                17877,
                17917
            ],
            [
                17917,
                18038
            ],
            [
                18038,
                18071
            ],
            [
                18101,
                18197
            ],
            [
                18206,
                18230
            ],
            [
                18287,
                18315
            ],
            [
                18317,
                18321
            ],
            [
                18340,
                18487
            ],
            [
                18487,
                18536
            ],
            [
                18561,
                18597
            ],
            [
                18597,
                18605
            ],
            [
                18653,
                18687
            ],
            [
                18624,
                18638
            ],
            [
                18696,
                18744
            ],
            [
                18746,
                18771
            ],
            [
                18783,
                18786
            ],
            [
                18798,
                18896
            ],
            [
                18896,
                18919
            ],
            [
                18921,
                18996
            ],
            [
                18998,
                19025
            ],
            [
                19037,
                19043
            ],
            [
                19059,
                19064
            ],
            [
                19065,
                19148
            ],
            [
                19160,
                19167
            ],
            [
                19169,
                19207
            ],
            [
                19207,
                19214
            ],
            [
                19240,
                19270
            ],
            [
                19284,
                19294
            ],
            [
                19317,
                19319
            ],
            [
                19319,
                19407
            ],
            [
                19414,
                19434
            ],
            [
                19447,
                19472
            ],
            [
                19508,
                19509
            ],
            [
                19510,
                19561
            ],
            [
                19570,
                19572
            ],
            [
                19614,
                19616
            ],
            [
                19578,
                19583
            ],
            [
                19634,
                19696
            ],
            [
                19709,
                19763
            ],
            [
                19763,
                19848
            ],
            [
                19864,
                19872
            ],
            [
                19872,
                19875
            ],
            [
                19896,
                19965
            ],
            [
                19971,
                20010
            ],
            [
                20025,
                20050
            ],
            [
                20058,
                20071
            ],
            [
                20071,
                20106
            ],
            [
                20106,
                20148
            ],
            [
                20164,
                20237
            ],
            [
                20248,
                20273
            ],
            [
                20298,
                20309
            ],
            [
                20309,
                20312
            ],
            [
                20321,
                20333
            ],
            [
                20337,
                20394
            ],
            [
                20394,
                20425
            ],
            [
                20426,
                20445
            ],
            [
                20445,
                20519
            ],
            [
                20519,
                20558
            ],
            [
                20558,
                20619
            ],
            [
                20619,
                20635
            ],
            [
                20640,
                20653
            ],
            [
                20669,
                20671
            ],
            [
                20671,
                20702
            ],
            [
                20702,
                20719
            ],
            [
                20729,
                20875
            ],
            [
                20905,
                20908
            ],
            [
                20876,
                20889
            ],
            [
                20923,
                20926
            ],
            [
                20935,
                20936
            ],
            [
                20950,
                20953
            ],
            [
                20969,
                20971
            ],
            [
                20971,
                20994
            ],
            [
                21000,
                21014
            ],
            [
                21031,
                21071
            ],
            [
                21131,
                21151
            ],
            [
                21173,
                21205
            ],
            [
                21205,
                21250
            ],
            [
                21257,
                21269
            ],
            [
                21289,
                21353
            ],
            [
                21355,
                21362
            ],
            [
                21369,
                21460
            ],
            [
                21468,
                21533
            ],
            [
                21545,
                21578
            ],
            [
                21578,
                21629
            ],
            [
                21659,
                21661
            ],
            [
                21661,
                21795
            ],
            [
                21803,
                21811
            ],
            [
                21814,
                21842
            ],
            [
                21842,
                21975
            ],
            [
                21976,
                21987
            ],
            [
                22377,
                22378
            ],
            [
                22122,
                22125
            ],
            [
                22006,
                22053
            ],
            [
                22059,
                22114
            ],
            [
                22126,
                22281
            ],
            [
                22286,
                22306
            ],
            [
                22313,
                22316
            ],
            [
                22323,
                22355
            ],
            [
                22382,
                22405
            ],
            [
                22405,
                22430
            ],
            [
                22453,
                22505
            ],
            [
                22644,
                22647
            ],
            [
                22520,
                22525
            ],
            [
                22529,
                22546
            ],
            [
                22550,
                22567
            ],
            [
                22431,
                22434
            ],
            [
                22507,
                22509
            ],
            [
                22658,
                22663
            ],
            [
                22602,
                22624
            ],
            [
                22672,
                22675
            ],
            [
                22571,
                22574
            ],
            [
                22695,
                22708
            ],
            [
                22709,
                22721
            ],
            [
                22768,
                22818
            ],
            [
                22822,
                22848
            ],
            [
                22526,
                22528
            ],
            [
                22691,
                22694
            ],
            [
                22886,
                22895
            ],
            [
                22903,
                22944
            ],
            [
                22953,
                22977
            ],
            [
                22984,
                22990
            ],
            [
                23066,
                23068
            ],
            [
                23068,
                23173
            ],
            [
                23198,
                23200
            ],
            [
                23263,
                23266
            ],
            [
                23267,
                23292
            ],
            [
                23301,
                23374
            ],
            [
                23386,
                23393
            ],
            [
                23403,
                23412
            ],
            [
                23420,
                23444
            ],
            [
                23453,
                23457
            ],
            [
                23544,
                23549
            ],
            [
                23445,
                23452
            ],
            [
                23460,
                23463
            ],
            [
                23580,
                23585
            ],
            [
                23560,
                23579
            ],
            [
                23585,
                23591
            ],
            [
                23608,
                23611
            ],
            [
                23616,
                23655
            ],
            [
                23697,
                23712
            ],
            [
                23746,
                23768
            ],
            [
                23770,
                23790
            ],
            [
                23792,
                23820
            ],
            [
                23905,
                23946
            ],
            [
                23712,
                23716
            ],
            [
                24013,
                24053
            ],
            [
                24086,
                24152
            ],
            [
                24188,
                24190
            ],
            [
                24282,
                24324
            ],
            [
                24210,
                24230
            ],
            [
                24280,
                24281
            ],
            [
                24326,
                24331
            ],
            [
                24375,
                24379
            ],
            [
                24357,
                24374
            ],
            [
                24404,
                24456
            ],
            [
                24478,
                24520
            ],
            [
                24584,
                24625
            ],
            [
                24879,
                24895
            ],
            [
                24857,
                24859
            ],
            [
                24682,
                24685
            ],
            [
                24895,
                24941
            ],
            [
                24956,
                25064
            ],
            [
                25064,
                25097
            ],
            [
                25108,
                25142
            ],
            [
                25216,
                25219
            ],
            [
                25332,
                25347
            ],
            [
                25357,
                25362
            ],
            [
                25368,
                25447
            ],
            [
                25467,
                25503
            ],
            [
                25503,
                25632
            ],
            [
                25668,
                25676
            ],
            [
                25818,
                25820
            ],
            [
                25820,
                25863
            ],
            [
                25879,
                25881
            ],
            [
                25881,
                25893
            ],
            [
                25898,
                25940
            ],
            [
                25941,
                25944
            ],
            [
                25963,
                25985
            ],
            [
                26003,
                26018
            ],
            [
                26018,
                26078
            ],
            [
                26089,
                26103
            ],
            [
                26117,
                26134
            ],
            [
                26140,
                26159
            ],
            [
                26175,
                26224
            ],
            [
                26237,
                26255
            ],
            [
                26716,
                26728
            ],
            [
                26734,
                26797
            ],
            [
                26808,
                26816
            ],
            [
                26822,
                26906
            ],
            [
                26907,
                26912
            ],
            [
                26966,
                27090
            ],
            [
                27090,
                27106
            ],
            [
                27142,
                27180
            ],
            [
                27216,
                27274
            ],
            [
                27297,
                27304
            ],
            [
                27306,
                27330
            ],
            [
                27357,
                27390
            ],
            [
                27390,
                27443
            ],
            [
                27452,
                27491
            ],
            [
                27568,
                27570
            ],
            [
                27570,
                27614
            ],
            [
                27753,
                27754
            ],
            [
                27621,
                27649
            ],
            [
                27673,
                27693
            ],
            [
                28024,
                28026
            ],
            [
                28026,
                28039
            ],
            [
                28088,
                28130
            ],
            [
                28191,
                28198
            ],
            [
                28203,
                28225
            ],
            [
                28230,
                28339
            ],
            [
                28341,
                28358
            ],
            [
                28407,
                28472
            ],
            [
                28504,
                28514
            ],
            [
                28529,
                28625
            ],
            [
                28069,
                28073
            ],
            [
                28629,
                28641
            ],
            [
                28687,
                28689
            ],
            [
                28689,
                28723
            ],
            [
                28736,
                28810
            ],
            [
                28845,
                28869
            ],
            [
                28911,
                28912
            ],
            [
                29532,
                29537
            ],
            [
                29792,
                29800
            ],
            [
                29627,
                29677
            ],
            [
                29581,
                29584
            ],
            [
                29822,
                29864
            ],
            [
                29869,
                29926
            ],
            [
                30023,
                30101
            ],
            [
                30119,
                30127
            ],
            [
                30243,
                30252
            ],
            [
                30260,
                30266
            ],
            [
                30270,
                30278
            ],
            [
                30256,
                30259
            ],
            [
                30228,
                30239
            ],
            [
                30295,
                30296
            ],
            [
                30297,
                30337
            ],
            [
                30353,
                30390
            ],
            [
                30395,
                30413
            ],
            [
                30417,
                30474
            ],
            [
                30533,
                30572
            ],
            [
                30651,
                30659
            ],
            [
                30673,
                30721
            ],
            [
                30739,
                30752
            ],
            [
                30626,
                30627
            ],
            [
                30789,
                30820
            ],
            [
                30835,
                30846
            ],
            [
                30846,
                30909
            ],
            [
                30909,
                30919
            ],
            [
                30927,
                30973
            ],
            [
                30990,
                31012
            ],
            [
                31074,
                31076
            ],
            [
                31091,
                31094
            ],
            [
                31127,
                31187
            ],
            [
                31188,
                31277
            ],
            [
                31281,
                31304
            ],
            [
                31306,
                31327
            ],
            [
                31327,
                31336
            ],
            [
                31342,
                31416
            ],
            [
                31424,
                31447
            ],
            [
                31519,
                31539
            ],
            [
                31711,
                31737
            ],
            [
                31737,
                31739
            ],
            [
                31749,
                31805
            ],
            [
                31807,
                31852
            ],
            [
                31927,
                31928
            ],
            [
                31855,
                31927
            ],
            [
                32019,
                32020
            ],
            [
                32021,
                32070
            ],
            [
                32070,
                32106
            ],
            [
                32152,
                32187
            ],
            [
                32187,
                32198
            ],
            [
                32204,
                32254
            ],
            [
                32260,
                32320
            ],
            [
                32332,
                32341
            ],
            [
                32341,
                32417
            ],
            [
                32454,
                32459
            ],
            [
                32469,
                32547
            ],
            [
                32547,
                32552
            ],
            [
                32558,
                32578
            ],
            [
                32617,
                32671
            ],
            [
                32675,
                32677
            ],
            [
                32677,
                32725
            ],
            [
                32725,
                32788
            ],
            [
                32788,
                32791
            ],
            [
                32792,
                32795
            ],
            [
                32802,
                32838
            ],
            [
                32840,
                32856
            ],
            [
                32861,
                32873
            ],
            [
                32893,
                32931
            ],
            [
                32931,
                32934
            ],
            [
                32971,
                33033
            ],
            [
                33042,
                33048
            ],
            [
                33034,
                33041
            ],
            [
                33049,
                33066
            ],
            [
                33098,
                33099
            ],
            [
                33140,
                33151
            ],
            [
                33113,
                33119
            ],
            [
                33156,
                33170
            ],
            [
                33128,
                33138
            ],
            [
                33170,
                33172
            ],
            [
                33172,
                33208
            ],
            [
                33208,
                33238
            ],
            [
                33238,
                33250
            ],
            [
                33260,
                33267
            ],
            [
                33275,
                33303
            ],
            [
                33321,
                33355
            ],
            [
                33355,
                33393
            ],
            [
                33393,
                33420
            ],
            [
                33420,
                33449
            ],
            [
                33457,
                33481
            ],
            [
                33481,
                33519
            ],
            [
                33519,
                33560
            ],
            [
                33560,
                33593
            ],
            [
                33608,
                33610
            ],
            [
                33610,
                33631
            ],
            [
                33664,
                33689
            ],
            [
                33707,
                33709
            ],
            [
                33709,
                33720
            ],
            [
                33720,
                33749
            ],
            [
                33751,
                33780
            ],
            [
                33780,
                33793
            ],
            [
                33802,
                33809
            ],
            [
                33818,
                33820
            ],
            [
                33820,
                33827
            ],
            [
                33827,
                33856
            ],
            [
                33856,
                33866
            ],
            [
                33866,
                33881
            ],
            [
                33952,
                33957
            ],
            [
                33957,
                33972
            ],
            [
                33977,
                33986
            ],
            [
                33990,
                33992
            ],
            [
                33992,
                33998
            ],
            [
                34014,
                34023
            ],
            [
                34040,
                34043
            ],
            [
                34043,
                34080
            ],
            [
                34084,
                34086
            ],
            [
                34086,
                34110
            ],
            [
                34114,
                34119
            ],
            [
                34143,
                34172
            ],
            [
                34190,
                34200
            ],
            [
                34205,
                34231
            ],
            [
                34231,
                34265
            ],
            [
                34265,
                34296
            ],
            [
                34309,
                34364
            ],
            [
                34364,
                34412
            ],
            [
                34584,
                34605
            ],
            [
                34607,
                34625
            ],
            [
                34627,
                34665
            ],
            [
                34665,
                34716
            ],
            [
                35008,
                35047
            ],
            [
                35047,
                35088
            ],
            [
                35088,
                35103
            ],
            [
                35103,
                35107
            ],
            [
                35107,
                35133
            ],
            [
                35148,
                35170
            ],
            [
                35430,
                35433
            ],
            [
                35171,
                35184
            ],
            [
                35199,
                35224
            ],
            [
                35257,
                35288
            ],
            [
                35295,
                35297
            ],
            [
                35309,
                35411
            ],
            [
                35234,
                35238
            ],
            [
                35482,
                35532
            ],
            [
                35549,
                35550
            ],
            [
                35537,
                35549
            ],
            [
                35661,
                35736
            ],
            [
                35750,
                35767
            ],
            [
                35800,
                35802
            ],
            [
                35802,
                35834
            ],
            [
                35835,
                35858
            ],
            [
                35865,
                35955
            ],
            [
                35962,
                35984
            ],
            [
                35997,
                35998
            ],
            [
                35999,
                36004
            ],
            [
                36009,
                36052
            ],
            [
                36052,
                36118
            ],
            [
                36206,
                36207
            ],
            [
                36360,
                36370
            ],
            [
                36122,
                36136
            ],
            [
                36374,
                36384
            ],
            [
                36398,
                36409
            ],
            [
                36502,
                36505
            ],
            [
                36423,
                36429
            ],
            [
                36273,
                36276
            ],
            [
                36432,
                36436
            ],
            [
                36237,
                36238
            ],
            [
                36578,
                36635
            ],
            [
                36413,
                36414
            ],
            [
                36663,
                36684
            ],
            [
                36722,
                36738
            ],
            [
                36738,
                36790
            ],
            [
                36804,
                36813
            ],
            [
                36958,
                36960
            ],
            [
                36856,
                36886
            ],
            [
                36904,
                36936
            ],
            [
                36902,
                36903
            ],
            [
                37453,
                37520
            ],
            [
                37564,
                37570
            ],
            [
                36835,
                36852
            ],
            [
                37610,
                37612
            ],
            [
                37673,
                37684
            ],
            [
                37702,
                37739
            ],
            [
                37918,
                37962
            ],
            [
                37964,
                38030
            ],
            [
                38031,
                38050
            ],
            [
                38058,
                38063
            ],
            [
                38051,
                38057
            ],
            [
                38064,
                38080
            ],
            [
                38276,
                38288
            ],
            [
                38301,
                38384
            ],
            [
                38414,
                38421
            ],
            [
                38423,
                38453
            ],
            [
                38471,
                38494
            ],
            [
                38500,
                38511
            ],
            [
                38520,
                38529
            ],
            [
                38545,
                38547
            ],
            [
                38547,
                38574
            ],
            [
                38588,
                38604
            ],
            [
                38605,
                38647
            ],
            [
                38657,
                38705
            ],
            [
                38713,
                38717
            ],
            [
                38723,
                38746
            ],
            [
                38769,
                38775
            ],
            [
                38781,
                38804
            ],
            [
                38816,
                38845
            ],
            [
                38648,
                38651
            ],
            [
                38851,
                38865
            ]
        ],
        "row_chars": [
            [
                0,
                261
            ],
            [
                261,
                613
            ],
            [
                613,
                710
            ],
            [
                710,
                789
            ],
            [
                789,
                1180
            ],
            [
                1180,
                1332
            ],
            [
                1332,
                1557
            ],
            [
                1557,
                1561
            ],
            [
                1561,
                1912
            ],
            [
                1912,
                2090
            ],
            [
                2090,
                2461
            ],
            [
                2461,
                2622
            ],
            [
                2622,
                2820
            ],
            [
                2820,
                3083
            ],
            [
                3083,
                3295
            ],
            [
                3295,
                3602
            ],
            [
                3602,
                3883
            ],
            [
                3883,
                4047
            ],
            [
                4047,
                4159
            ],
            [
                4159,
                4190
            ],
            [
                4190,
                4336
            ],
            [
                4336,
                4678
            ],
            [
                4678,
                4950
            ],
            [
                4950,
                5011
            ],
            [
                5011,
                5497
            ],
            [
                5497,
                5633
            ],
            [
                5633,
                5696
            ],
            [
                5696,
                6061
            ],
            [
                6061,
                6123
            ],
            [
                6123,
                6275
            ],
            [
                6275,
                6500
            ],
            [
                6500,
                6665
            ],
            [
                6665,
                6902
            ],
            [
                6902,
                7267
            ],
            [
                7267,
                7344
            ],
            [
                7344,
                7380
            ],
            [
                7380,
                7418
            ],
            [
                7418,
                7527
            ],
            [
                7527,
                7557
            ],
            [
                7557,
                7608
            ],
            [
                7608,
                7817
            ],
            [
                7817,
                8105
            ],
            [
                8105,
                8362
            ],
            [
                8362,
                8610
            ],
            [
                8610,
                8731
            ],
            [
                8731,
                8969
            ],
            [
                8969,
                9154
            ],
            [
                9154,
                9330
            ],
            [
                9330,
                9365
            ],
            [
                9365,
                9507
            ],
            [
                9507,
                9557
            ],
            [
                9557,
                9703
            ],
            [
                9703,
                9927
            ],
            [
                9927,
                9979
            ],
            [
                9979,
                10082
            ],
            [
                10082,
                10151
            ],
            [
                10151,
                10244
            ],
            [
                10244,
                10510
            ],
            [
                10510,
                10636
            ],
            [
                10636,
                10816
            ],
            [
                10816,
                10867
            ],
            [
                10867,
                10951
            ],
            [
                10951,
                11144
            ],
            [
                11144,
                11267
            ],
            [
                11267,
                11380
            ],
            [
                11380,
                11486
            ],
            [
                11486,
                11704
            ],
            [
                11704,
                11728
            ],
            [
                11728,
                11843
            ],
            [
                11843,
                11869
            ],
            [
                11869,
                11929
            ],
            [
                11929,
                12033
            ],
            [
                12033,
                12589
            ],
            [
                12589,
                12691
            ],
            [
                12691,
                12800
            ],
            [
                12800,
                12870
            ],
            [
                12870,
                13236
            ],
            [
                13236,
                13408
            ],
            [
                13408,
                13445
            ],
            [
                13445,
                13477
            ],
            [
                13477,
                13672
            ],
            [
                13672,
                13830
            ],
            [
                13830,
                14094
            ],
            [
                14094,
                14347
            ],
            [
                14347,
                14768
            ],
            [
                14768,
                14936
            ],
            [
                14936,
                14991
            ],
            [
                14991,
                15247
            ],
            [
                15247,
                15298
            ],
            [
                15298,
                15627
            ],
            [
                15627,
                16239
            ],
            [
                16239,
                16440
            ],
            [
                16440,
                16488
            ],
            [
                16488,
                16609
            ],
            [
                16609,
                16689
            ],
            [
                16689,
                16816
            ],
            [
                16816,
                17016
            ],
            [
                17016,
                17360
            ],
            [
                17360,
                17503
            ],
            [
                17503,
                17641
            ],
            [
                17641,
                17917
            ],
            [
                17917,
                18038
            ],
            [
                18038,
                18487
            ],
            [
                18487,
                18597
            ],
            [
                18597,
                18896
            ],
            [
                18896,
                19065
            ],
            [
                19065,
                19207
            ],
            [
                19207,
                19319
            ],
            [
                19319,
                19510
            ],
            [
                19510,
                19763
            ],
            [
                19763,
                19872
            ],
            [
                19872,
                20071
            ],
            [
                20071,
                20106
            ],
            [
                20106,
                20309
            ],
            [
                20309,
                20394
            ],
            [
                20394,
                20426
            ],
            [
                20426,
                20445
            ],
            [
                20445,
                20519
            ],
            [
                20519,
                20558
            ],
            [
                20558,
                20619
            ],
            [
                20619,
                20671
            ],
            [
                20671,
                20702
            ],
            [
                20702,
                20971
            ],
            [
                20971,
                21205
            ],
            [
                21205,
                21578
            ],
            [
                21578,
                21661
            ],
            [
                21661,
                21842
            ],
            [
                21842,
                22405
            ],
            [
                22405,
                23068
            ],
            [
                23068,
                23200
            ],
            [
                23200,
                23263
            ],
            [
                23263,
                23374
            ],
            [
                23374,
                23712
            ],
            [
                23712,
                24190
            ],
            [
                24190,
                24326
            ],
            [
                24326,
                24456
            ],
            [
                24456,
                24520
            ],
            [
                24520,
                24584
            ],
            [
                24584,
                24941
            ],
            [
                24941,
                25064
            ],
            [
                25064,
                25503
            ],
            [
                25503,
                25820
            ],
            [
                25820,
                25881
            ],
            [
                25881,
                26018
            ],
            [
                26018,
                26256
            ],
            [
                26256,
                26483
            ],
            [
                26483,
                26633
            ],
            [
                26633,
                26704
            ],
            [
                26704,
                27090
            ],
            [
                27090,
                27390
            ],
            [
                27390,
                27570
            ],
            [
                27570,
                28026
            ],
            [
                28026,
                28689
            ],
            [
                28689,
                28913
            ],
            [
                28913,
                29171
            ],
            [
                29171,
                29241
            ],
            [
                29241,
                29532
            ],
            [
                29532,
                30127
            ],
            [
                30127,
                30297
            ],
            [
                30297,
                30474
            ],
            [
                30474,
                30533
            ],
            [
                30533,
                30909
            ],
            [
                30909,
                31076
            ],
            [
                31076,
                31188
            ],
            [
                31188,
                31277
            ],
            [
                31277,
                31327
            ],
            [
                31327,
                31539
            ],
            [
                31539,
                31672
            ],
            [
                31672,
                31737
            ],
            [
                31737,
                32021
            ],
            [
                32021,
                32070
            ],
            [
                32070,
                32187
            ],
            [
                32187,
                32341
            ],
            [
                32341,
                32547
            ],
            [
                32547,
                32677
            ],
            [
                32677,
                32725
            ],
            [
                32725,
                32788
            ],
            [
                32788,
                32931
            ],
            [
                32931,
                33100
            ],
            [
                33100,
                33172
            ],
            [
                33172,
                33208
            ],
            [
                33208,
                33238
            ],
            [
                33238,
                33355
            ],
            [
                33355,
                33393
            ],
            [
                33393,
                33420
            ],
            [
                33420,
                33481
            ],
            [
                33481,
                33519
            ],
            [
                33519,
                33560
            ],
            [
                33560,
                33610
            ],
            [
                33610,
                33709
            ],
            [
                33709,
                33720
            ],
            [
                33720,
                33780
            ],
            [
                33780,
                33820
            ],
            [
                33820,
                33827
            ],
            [
                33827,
                33856
            ],
            [
                33856,
                33866
            ],
            [
                33866,
                33881
            ],
            [
                33881,
                33952
            ],
            [
                33952,
                33957
            ],
            [
                33957,
                33992
            ],
            [
                33992,
                34043
            ],
            [
                34043,
                34086
            ],
            [
                34086,
                34119
            ],
            [
                34119,
                34231
            ],
            [
                34231,
                34364
            ],
            [
                34364,
                34412
            ],
            [
                34412,
                34479
            ],
            [
                34479,
                34513
            ],
            [
                34513,
                34580
            ],
            [
                34580,
                34665
            ],
            [
                34665,
                34716
            ],
            [
                34716,
                34801
            ],
            [
                34801,
                34844
            ],
            [
                34844,
                34928
            ],
            [
                34928,
                34977
            ],
            [
                34977,
                35008
            ],
            [
                35008,
                35047
            ],
            [
                35047,
                35088
            ],
            [
                35088,
                35103
            ],
            [
                35103,
                35107
            ],
            [
                35107,
                35802
            ],
            [
                35802,
                35999
            ],
            [
                35999,
                36052
            ],
            [
                36052,
                36738
            ],
            [
                36738,
                37612
            ],
            [
                37612,
                37739
            ],
            [
                37739,
                37918
            ],
            [
                37918,
                38081
            ],
            [
                38081,
                38276
            ],
            [
                38276,
                38547
            ],
            [
                38547,
                38865
            ]
        ]
    },
    "abridged": {
        "text": "We must pass over a part of Mrs. Rebecca Crawley's biography with that delicacy which the world demands - the moral world, that has no particular objection to vice, but hates hearing it named. There are things we know perfectly well in Vanity Fair, though we never speak of them: and a polite public will no more read an authentic description of vice than a truly refined English female will permit the word breeches to be said in her hearing. And yet, madam, both are walking the world before our faces every day. If you were to blush every time they went by, what complexions you would have! It is only when their naughty names are called out that you show any outrage.\nI have submitted to this fashion all through this story, only hinting at the existence of wickedness in a light, easy, and agreeable manner, so that nobody's fine feelings may be offended. I defy anyone to say that our Becky has not been presented in a perfectly genteel and inoffensive way. In describing this Siren, singing and smiling, coaxing and cajoling, I modestly ask - have I once forgotten the laws of politeness, and showed the monster's hideous tail above water? No! Those who wish may peep down under the waves and see it writhing and twirling, diabolically hideous and slimy; but above the waterline, everything has been decorous.\nWhen, however, the Sirens disappear and dive below, down among the dead men, the water grows cloudy, and it is pointless to peer into it. They look pretty enough when they sit on a rock, twanging their harps and combing their hair; but when they sink into the sea, depend on it, those mermaids are up to no good, and we had best not examine them feasting on their wretched pickled victims. And so, when Becky is out of the way, be sure that the less that is said about her doings the better.\nIf we were to give a full account of her life after the Curzon Street catastrophe, there might be some reason to say this book was improper. The actions of very vain, heartless people are often improper; and what are those of a woman without faith - or love - or character? And I am inclined to think that there was a period in Mrs. Becky's life when she was seized, not by remorse, but by a kind of despair, neglected her person and did not even care for her reputation.\nThis degradation did not take place all at once. It was brought about by degrees, and after many struggles to keep up - as a man who goes overboard hangs on to a spar whilst any hope is left.\nShe lingered about London whilst her husband was making preparations for his departure to Coventry Island, and it is believed she tried to see her brother-in-law, Sir Pitt Crawley, and to work upon his feelings.\nProbably Lady Jane interposed. I have heard that she quite astonished her husband by her spirit and her determination to disown Mrs. Becky. She invited Rawdon to stay in Gaunt Street until his departure for Coventry Island, knowing that with him for a guard Mrs. Becky would not try to come; and she looked at all the letters which arrived for Sir Pitt, lest he and his sister-in-law should be corresponding. So after one or two attempts Rebecca consented to Pitt's demand that any correspondence should be carried on by their lawyers.\nIn fact, Pitt's mind had been poisoned against her. Wenham had told him such a biography of Mrs. Becky as had astonished him: who her father was; in what year her mother danced at the opera; her previous history, and her conduct during her married life. Becky was left with a sad sad reputation in his esteem.\nThe income of the Governor of Coventry Island is not large. Some was set aside by Rawdon for the payment of debts, and he could not spare his wife more than three hundred pounds a year, which he proposed to pay to her on condition that she would never trouble him. It was in everyone's interest to get her out of the country, and hush up a most disagreeable affair.\nShe was probably so much occupied in arranging this business with her husband's lawyers that she forgot to take any step whatever about her son, little Rawdon, and did not once propose to go and see him. That young gentleman was consigned to the guardianship of his aunt and uncle; he had always been very fond of his aunt Jane. His mamma wrote him a neat letter from Boulogne, in which she told him to mind his books, and said she was going to take a Continental tour, and would write to him again.\nBut she never did for a year, and not, indeed, until Sir Pitt's only boy, always sickly, died of whooping-cough and measles. Then Rawdon's mamma wrote the most affectionate letter to her darling son, who was made heir of Queen's Crawley by this accident.\nRawdon Crawley, then grown a tall, fine lad, blushed when he got the letter. \"Oh, Aunt Jane, you are my mother!\" he said; \"and not - not that one.\" However, he wrote back a kind and respectful letter to Mrs. Rebecca, then living at a boarding-house in Florence. But we are advancing matters.\nOur darling Becky's first flight was not very far. She perched upon the French coast at Boulogne, and there lived in rather a genteel, widowed manner, with a maid and a couple of rooms at an hotel. She entertained her neighbours with stories of her brother, Sir Pitt, and her great London acquaintance, talking that easy, fashionable slip-slop which so impresses certain folks of small breeding. She passed with them for a person of importance; she gave little tea-parties, and shared in the innocent amusements of sea-bathing, jaunts in open carriages, strolls on the sands, and visits to the play. She was always affable, easy, and good-natured - with men especially.\nFrom people coming abroad at the end of the London season, Becky learnt the opinion of London society about her conduct. One day she met Lady Partlet and her daughters as she was walking on Boulogne pier. Lady Partlet marshalled all her daughters round her with a sweep of her parasol and retreated, darting savage glances at poor little Becky.\nOn another day the packet ship came in. It had been blowing fresh, and it always amused Becky to see the woe-begone faces of the people emerging from the boat. Lady Slingstone happened to be on board this day. She had been exceedingly ill, and could scarcely walk up the plank from the ship to the pier. But all her energies rallied the instant she saw Becky smiling roguishly under a pink bonnet. Giving her a glance of shrivelling scorn, she walked into the Custom House quite unsupported. Becky laughed: but I don't think she liked it. She felt she was quite alone, and the far-off shining cliffs of England were impassable to her.\nThe behaviour of the men had undergone a change too. Grinstone laughed in her face with a familiarity that was not pleasant. Little Bob Suckling, who three months before would walk a mile in the rain to see her, was talking to a friend one day upon the jetty, as Becky took her stroll there. He nodded to her without raising his hat, and continued his conversation. Tom Raikes tried to walk into her sitting-room at the inn with a cigar in his mouth, but she closed the door upon him. She began to feel that she was very lonely indeed.\n\"If he'd been here,\" she said, \"those cowards would never have dared to insult me.\" She thought about \"him\" with great sadness and perhaps longing - about his honest, stupid, constant kindness and fidelity; his never-ceasing obedience; his good humour; his bravery. Very likely she cried, and put on a little extra rouge, when she came down to dinner.\nShe rouged regularly now;- and her maid got Cognac for her.\nPerhaps the insults of the men were not, however, so intolerable as the sympathy of certain women. Mrs. Crackenbury and Mrs. Washington White passed through Boulogne in a party on their way to Switzerland. They did not avoid her. They giggled, cackled, condoled, consoled and patronized her until they drove her almost wild with rage. To be patronized by them! she thought, as they went away simpering.\nIt was after this visit that Becky, who had paid her weekly bills, who had made herself agreeable to everybody in the house, who smiled at the landlady and called the waiters \"monsieur,\", that Becky, we say, received a notice to quit from the landlord. He had been told by someone that she was an unfit person to have at his hotel, and that other English ladies would not sit down with her. She was forced to fly into lodgings of wearisome dullness and solitude.\nStill she held up, and tried to make a character for herself and conquer scandal. She went to church very regularly and sang louder than anybody there. She took up the cause of the widows of shipwrecked fishermen, and gave drawings for the Quashyboo Mission; she did everything that was respectable. She saw people avoiding her, and still laboriously smiled upon them; you never could suppose from her face what pangs of humiliation she might be enduring inwardly.\nPeople were divided about her. Some said that she was the criminal in the matter, while others vowed that she was innocent and that her odious husband was in fault. She won over a good many by bursting into tears about her boy and exhibiting the most frantic grief when his name was mentioned.\nShe gained good Mrs. Alderney's heart in that way, by weeping when Master Alderney came from school to pass his holidays with his mother.\n\"He and her Rawdon were the same age, and so alike,\" Becky said in a voice choking with agony; whereas there was four years' difference between the boys' ages, and no more likeness between them than between you and me. Wenham, who was on his way to Kissingen to join Lord Steyne, enlightened Mrs. Alderney, and told her how young Rawdon's mamma notoriously hated him and never saw him; how he was thirteen and dark, while little Alderney was only nine, and fair - and in a word, caused the lady to repent of her good humour.\nWhenever Becky made a little circle for herself with incredible toils, somebody came and swept it down rudely, and she had all her work to begin over again. It was very hard; lonely and disheartening.\nThere was Mrs. Newbright, who took her up for some time, attracted by the sweetness of her singing at church and by her proper views upon serious subjects. Becky took tracts, and even read them. She worked flannel petticoats for the Quashyboos - night-caps for the Cocoanut Indians - painted handscreens for the conversion of the Pope and the Jews - attended two Sunday services at church, and all in vain. Mrs. Newbright happened to write to the Countess of Southdown about a Fund for the Fiji Islanders, and mentioned her \"sweet friend\" Mrs. Rawdon Crawley. The Countess wrote back a letter so full of hints, facts, falsehoods, and condemnations, that Mrs. Newbright's friendship with Becky ceased forthwith.\nFrom one colony to another Becky fled uneasily. From Boulogne to Dieppe, from Dieppe to Caen, from Caen to Tours - trying with all her might to be respectable, and alas! always found out and pecked out of the cage.\nMrs. Hook Eagles took her up at one of these places - a woman without a blemish in her character, and a house in Portman Square. She was staying at the hotel at Dieppe where Becky fled, and they made each other's acquaintance first when they were swimming together, and then at the hotel table. Mrs Eagles had heard some of the scandal of the Steyne affair; but after a conversation with Becky, she announced that Mrs. Crawley was an angel, her husband a ruffian, Lord Steyne an unprincipled wretch, as everybody knew, and the whole case against Mrs. Crawley a wicked conspiracy of that rascal Wenham.\nMrs. Eagles then patronized Mrs. Rawdon, took her to live with her at her own house at Paris, and did all she could to keep Becky in the paths of virtue and good repute.\nBecky was very respectable and orderly at first, but the life of humdrum virtue grew utterly tedious to her before long. It was the same routine every day, the same drive over the same stupid Bois de Boulogne, the same company of an evening, the same sermon of a Sunday night. Becky was dying of weariness when young Mr. Eagles came from Cambridge, and his mother, seeing the impression which her little friend made upon him, straightway gave Becky warning.\nThen she tried keeping house with a female friend, until they began to quarrel and get into debt. Then she lived for some time at that famous boarding-house kept by Madame de Saint Amour, in the Rue Royale at Paris, where she began using her fascinations upon the shabby dandies and fly-blown beauties who frequented her landlady's salons. Becky loved society and indeed, could no more exist without it than an opium-eater without his dram; and she was happy enough at this time of her life.\n\"The women here are as amusing as those in May Fair,\" she told an old London friend, \"only their dresses are not quite so fresh. The men are sad rogues, certainly, but no worse than many. The mistress of the house is a little vulgar, but I don't think she is so vulgar as Lady ____\" and here she named a great leader of fashion.\nIn fact, when you saw Madame de Saint Amour's rooms lit up at night, and the women at a little distance, you might fancy yourself in good society, and that Madame was a real Countess. Many people did so fancy, and Becky was for a while one of the most dashing ladies of her salons.\nBut her old creditors of 1815 found her out and caused her to leave Paris. The poor little woman was forced to fly rather suddenly, and went to Brussels.\nHow well she remembered the place! She grinned as she looked up at the little home she had occupied, and thought of the Bareacres family, bawling for horses, as their carriage stood before the hotel. She visited Waterloo and Laeken, where George Osborne's monument much struck her. She made a little sketch of it.\n\"That poor Cupid!\" she said; \"how dreadfully he was in love with me, and what a fool he was! I wonder whether little Emmy is alive. It was a good little creature; and that fat brother of hers. I have his funny picture still. They were kind simple people.\"\nAt Brussels Becky was recommended by Madame de Saint Amour to her friend, Madame la Comtesse de Borodino, widow of Napoleon's General, the famous Count de Borodino, who after the war was left with nothing but a hotel and cart tables. Second-rate dandies and rous, widow-ladies with a lawsuit, and very simple English folks put down their money at Madame de Borodino's tables. The gallant young fellows treated the company to champagne, rode out with the women, or hired horses on country excursions. They clubbed together to take boxes at the play or the opera, betted over the fair shoulders of the ladies at the tables, and wrote home to their parents in Devonshire about their happy introduction to foreign society.\nHere, as at Paris, Becky was a boarding-house queen. She never refused the champagne, or the bouquets, or the drives into the country, or the private boxes; but what she preferred was the cart at night - and she played audaciously. First she played only for a little, then for five-franc pieces, then for Napoleons, then for notes: then she would not be able to pay for her month's board, and borrowed from the young gentlemen: then she got cash again and bullied Madame de Borodino, whom she had wheedled before: then she was playing for ten sous at a time, and in a dire state of poverty: then her quarter's allowance would come in, and she would pay Madame de Borodino's bill and once more take the cards against the Chevalier de Raff.\nWhen Becky left Brussels, she owed three months' pension to Madame de Borodino - and this, and the gambling, and the drinking, and the begging of money from the Reverend Mr. Muff, and the flirting with young Milor Noodle, whom she used to take into her private room, and from whom she won large sums at cart - of these and a hundred other knaveries, the Countess de Borodino informed every English person who stayed at her house.\nSo our little wanderer went about setting up her tent in various cities of Europe, as restless as Ulysses. She soon became a perfect Bohemian, herding with people whom it would make your hair stand on end to meet.\nEvery town of note in Europe has its little colony of raffish young Englishmen - often of very good family, only disowned by them; frequenters of billiard-rooms and gaming-tables. They drink and swagger - they fight and brawl - they run away without paying - they get the money and drive off to Baden - they lurk about the tables with empty pockets, until they can swindle a Jew banker with a sham bill of exchange. Their life must be one of great excitement, alternating between splendour and misery.\nBecky took to this life, and went about from town to town among these Bohemians. She was known at every play-table in Germany. It is said she was ordered out of Munich, but of this part of her story, the less, perhaps, that is said the better.\nWhen Mrs. Crawley was particularly down on her luck, she gave concerts and lessons in music here and there. There was a Madame de Raudon, who had a matinee musicale at Wildbad, and at Strasburg in 1830, a certain Madame Rebecque made her appearance in the opera of the Dame Blanche, causing a furious row in the theatre there. She was hissed off the stage by the audience, partly from her own incompetency, but chiefly from the ill-advised sympathy of some officers who were present.\nShe was, in fact, no better than a vagabond. When she got money she gambled; when she had gambled it away she had trouble to live; who knows how she succeeded? It is said that she was once seen at St. Petersburg, but was dismissed from there by the police, so there cannot be any truth in the report that she was a Russian spy at Vienna afterwards.\nAt Rome once, when Mrs. de Rawdon's half-year's salary had just been paid into the banker's, and, as everybody who had a balance of above five hundred scudi was invited to the banker's balls, Becky had the honour of a card, and appeared at one of the Prince and Princess Polonia's splendid evening entertainments. The Princess was descended from the second king of Rome, while the Prince's grandfather, Alessandro Polonia, sold tobacco and pocket-handkerchiefs, and lent money in a small way. All the great company in Rome thronged to his saloons - Princes, Dukes, Ambassadors, artists, fiddlers. His halls blazed with light and magnificence, resplendent with gilt frames and dubious antiques.\nSo Becky, who was lodged at an inn in a very modest way, dressed with unusual care, and went to this fine ball leaning on the arm of Major Loder, with whom she happened to be travelling at the time (the same man who was caned by Sir John Buckskin for carrying four kings in his hat while playing at cart.) This pair went into the rooms together, and Becky saw a number of old faces which she remembered from happier days. Major Loder knew a great number of keen-looking whiskered men with dirty striped ribbons in their buttonholes; but his own countrymen avoided him.\nWell, the pair drank a great quantity of champagne at the buffet, and then pushed on until they reached the Duchess's pink velvet saloon, at the end of the suite of apartments where the princely family were entertaining their most distinguished guests at supper. And there at Poloni's table sat Lord Steyne.\nThe scar cut by the diamond on his white forehead made a burning red mark; his whiskers were dyed a purple hue, which made his pale face look still paler. He was a greater Prince than any there, and near him was seated the beautiful Countess of Belladonna, whose husband, so well known for his brilliant collections of insects, had been long absent on a mission to the Emperor of Morocco.\nWhen Becky saw that familiar and illustrious face, how vulgar did Major Loder appear! She tried to look and feel as if she were in May Fair once more.\n\"That woman looks stupid and ill-humoured,\" she thought; \"I am sure she can't amuse him. He must be bored by her - he never was by me.\" A hundred touching hopes, fears, and memories palpitated in her little heart, as she gazed with her brightest eyes at the great nobleman. He looked easy, lofty, and stately. Ah, what a pleasant companion he was, what a brilliant wit; what a rich fund of talk, what a grand manner! - and she had exchanged this for Major Loder, reeking of cigars and brandy.\n\"I wonder whether he will know me,\" she thought. Lord Steyne was talking and laughing, when he looked up and saw Becky.\nShe was all in a flutter as their eyes met, and she put on the best smile she could muster, and dropped him a little, timid curtsey. He stared aghast at her for a minute, as Macbeth might on beholding Banquo's ghost, and was looking at her with open mouth, when that horrid Major Loder pulled her away.\n\"Come into the supper-room,\" he said: \"seeing these nobs grubbing away has made me peckish. Let's go and try the old governor's champagne.\" Becky thought the Major had had a great deal too much already.\nThe next day she went to walk on the Pincian Hill - the Hyde Park of Roman idlers - hoping to have another sight of Lord Steyne. But it was Mr. Fiche, his lordship's confidential man, who came up to her, nodding rather familiarly.\n\"I followed Madame from her hotel,\" he said. \"I have some advice to give Madame.\"\n\"From the Marquis of Steyne?\" Becky asked, with as much dignity as she could muster, agitated by hope and expectation.\n\"No,\" said the valet; \"it is from me. Rome is very unwholesome.\"\n\"Not at this season, Monsieur - not till after Easter.\"\n\"I tell Madame it is unwholesome now. There is always malaria for some people. That cursed marsh wind kills many. Look, Madame Crawley, I have an interest in you. Be warned. Go away from Rome, I tell you - or you will be ill and die.\"\nBecky laughed in rage. \"What! assassinate poor little me?\" she said. \"How romantic! Bah! I will stay, if only to plague my Lord. I have people to defend me.\"\nIt was Monsieur Fiche's turn to laugh. \"Defend you,\" he said, \"who? Any one of those gambling men would take your life for a hundred louis. We know things about Major Loder (and he is no more a Major than I am a Marquis) which would send him to the galleys or worse. We know everything and have friends everywhere. Madame has offended somebody who never forgives - whose rage redoubled when he saw you. He was like a madman last night when he came home. You did wrong to show yourself to him. And if you stay here you will repent it. Mark my words. Go. Here is my lord's carriage.\"\nSeizing Becky's arm, he rushed her down an alley as Lord Steyne's barouche came whirling along the avenue, drawn by priceless horses, and bearing Madame de Belladonna lolling on the cushions, dark, sulky, and blooming, with old Steyne stretched at her side with a livid face. His ghastly eyes seemed tired of looking out on a world of which almost all the pleasure and beauty had palled.\n\"Monseigneur has never recovered from the shock of that night,\" Monsieur Fiche whispered to Mrs. Crawley as the carriage flashed by, and she peeped out from behind the shrubs.\n\"That is a consolation at any rate,\" Becky thought.\nWhether my lord really had murderous intentions towards Mrs. Becky, or whether Monsieur Fiche simply had orders to frighten her out of the city, has never been ascertained: but the threat had its effect. She sought no more to meet her old patron.\nEverybody knows the melancholy end of that nobleman, at Naples in 1830; when the Most Honourable Marquis of Steyne, Earl of Gaunt, died after a series of fits brought on, as the papers said, by the shock caused by the second French revolution.\nThe newspapers described his virtues, his talents, and his good actions. His body was buried at Naples, and his heart - that heart which always beat with every generous and noble emotion - was brought back to Gaunt Castle in a silver urn.\nHis will was disputed, and an attempt was made to force from Madame de Belladonna the celebrated diamond ring which his lordship always wore, and which it was said she removed after his death. But his confidential friend, Monsieur Fiche, proved that the ring had been presented to Madame de Belladonna two days before the Marquis died, as had the bank-notes, jewels, bonds, etc, found in his lordship's desk, and claimed by his heirs from the injured woman.",
        "paragraph_chars": [
            [
                0,
                672
            ],
            [
                672,
                1317
            ],
            [
                1317,
                1809
            ],
            [
                1809,
                2281
            ],
            [
                2281,
                2473
            ],
            [
                2473,
                2685
            ],
            [
                2685,
                3221
            ],
            [
                3221,
                3531
            ],
            [
                3531,
                3897
            ],
            [
                3897,
                4397
            ],
            [
                4397,
                4652
            ],
            [
                4652,
                4944
            ],
            [
                4944,
                5614
            ],
            [
                5614,
                5959
            ],
            [
                5959,
                6594
            ],
            [
                6594,
                7130
            ],
            [
                7130,
                7482
            ],
            [
                7482,
                7542
            ],
            [
                7542,
                7945
            ],
            [
                7945,
                8408
            ],
            [
                8408,
                8873
            ],
            [
                8873,
                9167
            ],
            [
                9167,
                9305
            ],
            [
                9305,
                9830
            ],
            [
                9830,
                10031
            ],
            [
                10031,
                10742
            ],
            [
                10742,
                10957
            ],
            [
                10957,
                11559
            ],
            [
                11559,
                11729
            ],
            [
                11729,
                12187
            ],
            [
                12187,
                12679
            ],
            [
                12679,
                13008
            ],
            [
                13008,
                13290
            ],
            [
                13290,
                13444
            ],
            [
                13444,
                13758
            ],
            [
                13758,
                14014
            ],
            [
                14014,
                14733
            ],
            [
                14733,
                15472
            ],
            [
                15472,
                15902
            ],
            [
                15902,
                16116
            ],
            [
                16116,
                16618
            ],
            [
                16618,
                16862
            ],
            [
                16862,
                17346
            ],
            [
                17346,
                17695
            ],
            [
                17695,
                18389
            ],
            [
                18389,
                18958
            ],
            [
                18958,
                19266
            ],
            [
                19266,
                19655
            ],
            [
                19655,
                19806
            ],
            [
                19806,
                20299
            ],
            [
                20299,
                20419
            ],
            [
                20419,
                20722
            ],
            [
                20722,
                20925
            ],
            [
                20925,
                21156
            ],
            [
                21156,
                21238
            ],
            [
                21238,
                21357
            ],
            [
                21357,
                21422
            ],
            [
                21422,
                21478
            ],
            [
                21478,
                21713
            ],
            [
                21713,
                21871
            ],
            [
                21871,
                22453
            ],
            [
                22453,
                22841
            ],
            [
                22841,
                23017
            ],
            [
                23017,
                23069
            ],
            [
                23069,
                23316
            ],
            [
                23316,
                23560
            ],
            [
                23560,
                23799
            ],
            [
                23799,
                24256
            ]
        ],
        "segment_chars": [
            [
                0,
                193
            ],
            [
                193,
                444
            ],
            [
                444,
                515
            ],
            [
                515,
                594
            ],
            [
                594,
                672
            ],
            [
                672,
                861
            ],
            [
                861,
                964
            ],
            [
                964,
                1147
            ],
            [
                1147,
                1151
            ],
            [
                1151,
                1317
            ],
            [
                1317,
                1455
            ],
            [
                1455,
                1707
            ],
            [
                1707,
                1809
            ],
            [
                1809,
                1950
            ],
            [
                1950,
                2083
            ],
            [
                2083,
                2281
            ],
            [
                2281,
                2330
            ],
            [
                2330,
                2473
            ],
            [
                2473,
                2685
            ],
            [
                2685,
                2716
            ],
            [
                2716,
                2825
            ],
            [
                2825,
                3094
            ],
            [
                3094,
                3221
            ],
            [
                3221,
                3273
            ],
            [
                3273,
                3475
            ],
            [
                3475,
                3531
            ],
            [
                3531,
                3591
            ],
            [
                3591,
                3796
            ],
            [
                3796,
                3897
            ],
            [
                3897,
                4101
            ],
            [
                4101,
                4226
            ],
            [
                4226,
                4397
            ],
            [
                4397,
                4522
            ],
            [
                4522,
                4652
            ],
            [
                4652,
                4729
            ],
            [
                4729,
                4765
            ],
            [
                4765,
                4800
            ],
            [
                4800,
                4914
            ],
            [
                4914,
                4944
            ],
            [
                4944,
                4995
            ],
            [
                4995,
                5142
            ],
            [
                5142,
                5340
            ],
            [
                5340,
                5544
            ],
            [
                5544,
                5614
            ],
            [
                5614,
                5735
            ],
            [
                5735,
                5819
            ],
            [
                5819,
                5959
            ],
            [
                5959,
                5999
            ],
            [
                5999,
                6119
            ],
            [
                6119,
                6169
            ],
            [
                6169,
                6263
            ],
            [
                6263,
                6357
            ],
            [
                6357,
                6451
            ],
            [
                6451,
                6498
            ],
            [
                6498,
                6594
            ],
            [
                6594,
                6647
            ],
            [
                6647,
                6719
            ],
            [
                6719,
                6886
            ],
            [
                6886,
                6960
            ],
            [
                6960,
                7079
            ],
            [
                7079,
                7130
            ],
            [
                7130,
                7214
            ],
            [
                7214,
                7396
            ],
            [
                7396,
                7482
            ],
            [
                7482,
                7542
            ],
            [
                7542,
                7641
            ],
            [
                7641,
                7748
            ],
            [
                7748,
                7772
            ],
            [
                7772,
                7877
            ],
            [
                7877,
                7903
            ],
            [
                7903,
                7945
            ],
            [
                7945,
                8198
            ],
            [
                8198,
                8336
            ],
            [
                8336,
                8408
            ],
            [
                8408,
                8490
            ],
            [
                8490,
                8560
            ],
            [
                8560,
                8708
            ],
            [
                8708,
                8873
            ],
            [
                8873,
                8904
            ],
            [
                8904,
                9038
            ],
            [
                9038,
                9167
            ],
            [
                9167,
                9305
            ],
            [
                9305,
                9524
            ],
            [
                9524,
                9830
            ],
            [
                9830,
                9987
            ],
            [
                9987,
                10031
            ],
            [
                10031,
                10187
            ],
            [
                10187,
                10226
            ],
            [
                10226,
                10438
            ],
            [
                10438,
                10591
            ],
            [
                10591,
                10742
            ],
            [
                10742,
                10790
            ],
            [
                10790,
                10912
            ],
            [
                10912,
                10957
            ],
            [
                10957,
                11086
            ],
            [
                11086,
                11252
            ],
            [
                11252,
                11559
            ],
            [
                11559,
                11729
            ],
            [
                11729,
                11850
            ],
            [
                11850,
                12006
            ],
            [
                12006,
                12187
            ],
            [
                12187,
                12285
            ],
            [
                12285,
                12527
            ],
            [
                12527,
                12679
            ],
            [
                12679,
                12808
            ],
            [
                12808,
                12867
            ],
            [
                12867,
                13008
            ],
            [
                13008,
                13192
            ],
            [
                13192,
                13290
            ],
            [
                13290,
                13365
            ],
            [
                13365,
                13444
            ],
            [
                13444,
                13479
            ],
            [
                13479,
                13644
            ],
            [
                13644,
                13726
            ],
            [
                13726,
                13758
            ],
            [
                13758,
                13777
            ],
            [
                13777,
                13851
            ],
            [
                13851,
                13890
            ],
            [
                13890,
                13951
            ],
            [
                13951,
                13983
            ],
            [
                13983,
                14014
            ],
            [
                14014,
                14248
            ],
            [
                14248,
                14390
            ],
            [
                14390,
                14514
            ],
            [
                14514,
                14733
            ],
            [
                14733,
                14786
            ],
            [
                14786,
                14965
            ],
            [
                14965,
                15472
            ],
            [
                15472,
                15902
            ],
            [
                15902,
                16009
            ],
            [
                16009,
                16116
            ],
            [
                16116,
                16296
            ],
            [
                16296,
                16532
            ],
            [
                16532,
                16618
            ],
            [
                16618,
                16699
            ],
            [
                16699,
                16745
            ],
            [
                16745,
                16862
            ],
            [
                16862,
                16970
            ],
            [
                16970,
                17189
            ],
            [
                17189,
                17346
            ],
            [
                17346,
                17391
            ],
            [
                17391,
                17506
            ],
            [
                17506,
                17695
            ],
            [
                17695,
                18009
            ],
            [
                18009,
                18188
            ],
            [
                18188,
                18292
            ],
            [
                18292,
                18389
            ],
            [
                18389,
                18695
            ],
            [
                18695,
                18811
            ],
            [
                18811,
                18958
            ],
            [
                18958,
                19221
            ],
            [
                19221,
                19266
            ],
            [
                19266,
                19421
            ],
            [
                19421,
                19655
            ],
            [
                19655,
                19741
            ],
            [
                19741,
                19806
            ],
            [
                19806,
                19895
            ],
            [
                19895,
                19942
            ],
            [
                19942,
                20080
            ],
            [
                20080,
                20116
            ],
            [
                20116,
                20223
            ],
            [
                20223,
                20299
            ],
            [
                20299,
                20348
            ],
            [
                20348,
                20419
            ],
            [
                20419,
                20552
            ],
            [
                20552,
                20722
            ],
            [
                20722,
                20814
            ],
            [
                20814,
                20862
            ],
            [
                20862,
                20925
            ],
            [
                20925,
                21054
            ],
            [
                21054,
                21156
            ],
            [
                21156,
                21201
            ],
            [
                21201,
                21238
            ],
            [
                21238,
                21268
            ],
            [
                21268,
                21357
            ],
            [
                21357,
                21395
            ],
            [
                21395,
                21422
            ],
            [
                21422,
                21478
            ],
            [
                21478,
                21516
            ],
            [
                21516,
                21557
            ],
            [
                21557,
                21592
            ],
            [
                21592,
                21641
            ],
            [
                21641,
                21652
            ],
            [
                21652,
                21713
            ],
            [
                21713,
                21736
            ],
            [
                21736,
                21743
            ],
            [
                21743,
                21772
            ],
            [
                21772,
                21782
            ],
            [
                21782,
                21797
            ],
            [
                21797,
                21802
            ],
            [
                21802,
                21842
            ],
            [
                21842,
                21871
            ],
            [
                21871,
                21910
            ],
            [
                21910,
                21939
            ],
            [
                21939,
                22011
            ],
            [
                22011,
                22138
            ],
            [
                22138,
                22186
            ],
            [
                22186,
                22274
            ],
            [
                22274,
                22325
            ],
            [
                22325,
                22364
            ],
            [
                22364,
                22405
            ],
            [
                22405,
                22420
            ],
            [
                22420,
                22424
            ],
            [
                22424,
                22453
            ],
            [
                22453,
                22729
            ],
            [
                22729,
                22841
            ],
            [
                22841,
                23017
            ],
            [
                23017,
                23069
            ],
            [
                23069,
                23273
            ],
            [
                23273,
                23316
            ],
            [
                23316,
                23560
            ],
            [
                23560,
                23633
            ],
            [
                23633,
                23799
            ],
            [
                23799,
                23992
            ],
            [
                23992,
                24256
            ]
        ],
        "overlap_chars": [
            [
                0,
                70
            ],
            [
                71,
                103
            ],
            [
                106,
                131
            ],
            [
                132,
                168
            ],
            [
                175,
                182
            ],
            [
                191,
                193
            ],
            [
                193,
                212
            ],
            [
                213,
                279
            ],
            [
                280,
                312
            ],
            [
                313,
                379
            ],
            [
                380,
                422
            ],
            [
                428,
                434
            ],
            [
                435,
                444
            ],
            [
                444,
                513
            ],
            [
                513,
                515
            ],
            [
                515,
                594
            ],
            [
                594,
                649
            ],
            [
                654,
                658
            ],
            [
                659,
                662
            ],
            [
                663,
                670
            ],
            [
                689,
                691
            ],
            [
                697,
                704
            ],
            [
                705,
                728
            ],
            [
                729,
                733
            ],
            [
                734,
                738
            ],
            [
                742,
                861
            ],
            [
                861,
                867
            ],
            [
                875,
                896
            ],
            [
                897,
                919
            ],
            [
                920,
                958
            ],
            [
                962,
                964
            ],
            [
                964,
                1032
            ],
            [
                1035,
                1041
            ],
            [
                1057,
                1147
            ],
            [
                1147,
                1151
            ],
            [
                1151,
                1160
            ],
            [
                1166,
                1185
            ],
            [
                1186,
                1189
            ],
            [
                1190,
                1195
            ],
            [
                1196,
                1260
            ],
            [
                1260,
                1286
            ],
            [
                1287,
                1297
            ],
            [
                1298,
                1301
            ],
            [
                1302,
                1306
            ],
            [
                1307,
                1315
            ],
            [
                1317,
                1337
            ],
            [
                1353,
                1356
            ],
            [
                1362,
                1403
            ],
            [
                1404,
                1409
            ],
            [
                1416,
                1427
            ],
            [
                1438,
                1440
            ],
            [
                1446,
                1453
            ],
            [
                1453,
                1455
            ],
            [
                1455,
                1492
            ],
            [
                1493,
                1495
            ],
            [
                1496,
                1547
            ],
            [
                1547,
                1572
            ],
            [
                1573,
                1576
            ],
            [
                1580,
                1614
            ],
            [
                1618,
                1620
            ],
            [
                1621,
                1657
            ],
            [
                1663,
                1707
            ],
            [
                1707,
                1757
            ],
            [
                1758,
                1796
            ],
            [
                1797,
                1809
            ],
            [
                1809,
                1849
            ],
            [
                1855,
                1918
            ],
            [
                1919,
                1950
            ],
            [
                1950,
                1985
            ],
            [
                1986,
                1996
            ],
            [
                1997,
                2011
            ],
            [
                2013,
                2056
            ],
            [
                2057,
                2058
            ],
            [
                2059,
                2066
            ],
            [
                2069,
                2083
            ],
            [
                2083,
                2140
            ],
            [
                2142,
                2217
            ],
            [
                2218,
                2281
            ],
            [
                2281,
                2285
            ],
            [
                2286,
                2328
            ],
            [
                2330,
                2361
            ],
            [
                2361,
                2398
            ],
            [
                2401,
                2471
            ],
            [
                2471,
                2473
            ],
            [
                2473,
                2562
            ],
            [
                2578,
                2598
            ],
            [
                2599,
                2602
            ],
            [
                2609,
                2683
            ],
            [
                2683,
                2684
            ],
            [
                2685,
                2716
            ],
            [
                2716,
                2769
            ],
            [
                2774,
                2780
            ],
            [
                2781,
                2825
            ],
            [
                2825,
                2846
            ],
            [
                2852,
                2970
            ],
            [
                2971,
                2975
            ],
            [
                2975,
                2991
            ],
            [
                2992,
                2994
            ],
            [
                2995,
                3094
            ],
            [
                3097,
                3122
            ],
            [
                3123,
                3130
            ],
            [
                3131,
                3143
            ],
            [
                3144,
                3148
            ],
            [
                3151,
                3162
            ],
            [
                3167,
                3181
            ],
            [
                3182,
                3205
            ],
            [
                3212,
                3219
            ],
            [
                3219,
                3221
            ],
            [
                3224,
                3228
            ],
            [
                3230,
                3273
            ],
            [
                3276,
                3283
            ],
            [
                3289,
                3341
            ],
            [
                3345,
                3411
            ],
            [
                3412,
                3432
            ],
            [
                3432,
                3433
            ],
            [
                3434,
                3437
            ],
            [
                3438,
                3473
            ],
            [
                3473,
                3475
            ],
            [
                3481,
                3518
            ],
            [
                3523,
                3529
            ],
            [
                3529,
                3531
            ],
            [
                3531,
                3534
            ],
            [
                3542,
                3576
            ],
            [
                3580,
                3591
            ],
            [
                3596,
                3599
            ],
            [
                3600,
                3612
            ],
            [
                3620,
                3638
            ],
            [
                3639,
                3644
            ],
            [
                3644,
                3645
            ],
            [
                3646,
                3649
            ],
            [
                3650,
                3668
            ],
            [
                3669,
                3751
            ],
            [
                3762,
                3796
            ],
            [
                3796,
                3802
            ],
            [
                3814,
                3816
            ],
            [
                3826,
                3897
            ],
            [
                3897,
                3943
            ],
            [
                3949,
                4041
            ],
            [
                4042,
                4068
            ],
            [
                4069,
                4101
            ],
            [
                4101,
                4142
            ],
            [
                4143,
                4177
            ],
            [
                4182,
                4192
            ],
            [
                4208,
                4210
            ],
            [
                4224,
                4226
            ],
            [
                4226,
                4274
            ],
            [
                4275,
                4287
            ],
            [
                4293,
                4308
            ],
            [
                4314,
                4366
            ],
            [
                4371,
                4376
            ],
            [
                4383,
                4396
            ],
            [
                4397,
                4425
            ],
            [
                4425,
                4493
            ],
            [
                4497,
                4520
            ],
            [
                4520,
                4521
            ],
            [
                4522,
                4569
            ],
            [
                4577,
                4650
            ],
            [
                4652,
                4729
            ],
            [
                4729,
                4765
            ],
            [
                4765,
                4782
            ],
            [
                4785,
                4800
            ],
            [
                4809,
                4900
            ],
            [
                4904,
                4914
            ],
            [
                4914,
                4944
            ],
            [
                4944,
                4995
            ],
            [
                4995,
                5040
            ],
            [
                5040,
                5101
            ],
            [
                5107,
                5128
            ],
            [
                5129,
                5142
            ],
            [
                5142,
                5172
            ],
            [
                5178,
                5293
            ],
            [
                5294,
                5296
            ],
            [
                5307,
                5340
            ],
            [
                5340,
                5355
            ],
            [
                5356,
                5416
            ],
            [
                5418,
                5458
            ],
            [
                5459,
                5471
            ],
            [
                5472,
                5497
            ],
            [
                5498,
                5523
            ],
            [
                5524,
                5544
            ],
            [
                5548,
                5590
            ],
            [
                5593,
                5614
            ],
            [
                5619,
                5625
            ],
            [
                5633,
                5639
            ],
            [
                5640,
                5657
            ],
            [
                5658,
                5664
            ],
            [
                5665,
                5672
            ],
            [
                5673,
                5678
            ],
            [
                5686,
                5700
            ],
            [
                5722,
                5735
            ],
            [
                5735,
                5742
            ],
            [
                5751,
                5781
            ],
            [
                5782,
                5800
            ],
            [
                5801,
                5817
            ],
            [
                5817,
                5819
            ],
            [
                5819,
                5912
            ],
            [
                5912,
                5957
            ],
            [
                5957,
                5959
            ],
            [
                5959,
                5984
            ],
            [
                5990,
                5999
            ],
            [
                5999,
                6039
            ],
            [
                6047,
                6052
            ],
            [
                6053,
                6063
            ],
            [
                6064,
                6094
            ],
            [
                6104,
                6119
            ],
            [
                6119,
                6169
            ],
            [
                6173,
                6197
            ],
            [
                6197,
                6202
            ],
            [
                6209,
                6217
            ],
            [
                6218,
                6263
            ],
            [
                6263,
                6355
            ],
            [
                6357,
                6379
            ],
            [
                6380,
                6386
            ],
            [
                6392,
                6397
            ],
            [
                6397,
                6451
            ],
            [
                6451,
                6456
            ],
            [
                6457,
                6498
            ],
            [
                6498,
                6514
            ],
            [
                6515,
                6594
            ],
            [
                6594,
                6632
            ],
            [
                6635,
                6641
            ],
            [
                6642,
                6645
            ],
            [
                6645,
                6647
            ],
            [
                6647,
                6656
            ],
            [
                6657,
                6719
            ],
            [
                6719,
                6743
            ],
            [
                6744,
                6763
            ],
            [
                6764,
                6800
            ],
            [
                6801,
                6804
            ],
            [
                6804,
                6820
            ],
            [
                6830,
                6871
            ],
            [
                6879,
                6886
            ],
            [
                6886,
                6888
            ],
            [
                6889,
                6902
            ],
            [
                6903,
                6910
            ],
            [
                6919,
                6958
            ],
            [
                6958,
                6960
            ],
            [
                6960,
                7077
            ],
            [
                7077,
                7079
            ],
            [
                7079,
                7129
            ],
            [
                7130,
                7214
            ],
            [
                7214,
                7276
            ],
            [
                7279,
                7394
            ],
            [
                7394,
                7396
            ],
            [
                7396,
                7418
            ],
            [
                7419,
                7422
            ],
            [
                7423,
                7482
            ],
            [
                7482,
                7507
            ],
            [
                7509,
                7540
            ],
            [
                7540,
                7542
            ],
            [
                7542,
                7606
            ],
            [
                7607,
                7641
            ],
            [
                7641,
                7707
            ],
            [
                7713,
                7718
            ],
            [
                7719,
                7747
            ],
            [
                7748,
                7772
            ],
            [
                7772,
                7794
            ],
            [
                7795,
                7813
            ],
            [
                7814,
                7877
            ],
            [
                7877,
                7903
            ],
            [
                7903,
                7943
            ],
            [
                7943,
                7944
            ],
            [
                7945,
                8011
            ],
            [
                8012,
                8096
            ],
            [
                8097,
                8100
            ],
            [
                8101,
                8131
            ],
            [
                8131,
                8132
            ],
            [
                8133,
                8196
            ],
            [
                8201,
                8217
            ],
            [
                8226,
                8238
            ],
            [
                8239,
                8276
            ],
            [
                8277,
                8280
            ],
            [
                8292,
                8336
            ],
            [
                8336,
                8374
            ],
            [
                8375,
                8384
            ],
            [
                8389,
                8406
            ],
            [
                8406,
                8408
            ],
            [
                8408,
                8425
            ],
            [
                8425,
                8490
            ],
            [
                8490,
                8560
            ],
            [
                8560,
                8598
            ],
            [
                8599,
                8630
            ],
            [
                8631,
                8670
            ],
            [
                8671,
                8706
            ],
            [
                8706,
                8708
            ],
            [
                8708,
                8809
            ],
            [
                8815,
                8873
            ],
            [
                8880,
                8904
            ],
            [
                8904,
                8908
            ],
            [
                8909,
                8939
            ],
            [
                8940,
                8953
            ],
            [
                8953,
                8954
            ],
            [
                8961,
                8986
            ],
            [
                8987,
                8995
            ],
            [
                8996,
                9038
            ],
            [
                9038,
                9165
            ],
            [
                9165,
                9166
            ],
            [
                9167,
                9217
            ],
            [
                9218,
                9259
            ],
            [
                9267,
                9304
            ],
            [
                9305,
                9328
            ],
            [
                9329,
                9349
            ],
            [
                9355,
                9417
            ],
            [
                9423,
                9511
            ],
            [
                9516,
                9519
            ],
            [
                9522,
                9524
            ],
            [
                9524,
                9531
            ],
            [
                9532,
                9535
            ],
            [
                9536,
                9539
            ],
            [
                9540,
                9610
            ],
            [
                9610,
                9611
            ],
            [
                9612,
                9628
            ],
            [
                9635,
                9641
            ],
            [
                9644,
                9649
            ],
            [
                9650,
                9710
            ],
            [
                9715,
                9719
            ],
            [
                9719,
                9746
            ],
            [
                9752,
                9757
            ],
            [
                9762,
                9766
            ],
            [
                9773,
                9799
            ],
            [
                9800,
                9830
            ],
            [
                9830,
                9899
            ],
            [
                9899,
                9987
            ],
            [
                9987,
                9993
            ],
            [
                9994,
                10031
            ],
            [
                10031,
                10185
            ],
            [
                10185,
                10187
            ],
            [
                10193,
                10205
            ],
            [
                10215,
                10226
            ],
            [
                10226,
                10274
            ],
            [
                10277,
                10312
            ],
            [
                10315,
                10378
            ],
            [
                10381,
                10420
            ],
            [
                10421,
                10438
            ],
            [
                10438,
                10452
            ],
            [
                10462,
                10464
            ],
            [
                10474,
                10505
            ],
            [
                10506,
                10507
            ],
            [
                10508,
                10535
            ],
            [
                10535,
                10540
            ],
            [
                10541,
                10568
            ],
            [
                10570,
                10589
            ],
            [
                10589,
                10590
            ],
            [
                10591,
                10594
            ],
            [
                10595,
                10614
            ],
            [
                10615,
                10623
            ],
            [
                10632,
                10634
            ],
            [
                10635,
                10664
            ],
            [
                10678,
                10684
            ],
            [
                10685,
                10699
            ],
            [
                10713,
                10717
            ],
            [
                10718,
                10723
            ],
            [
                10724,
                10740
            ],
            [
                10740,
                10741
            ],
            [
                10742,
                10790
            ],
            [
                10790,
                10854
            ],
            [
                10864,
                10912
            ],
            [
                10912,
                10928
            ],
            [
                10929,
                10955
            ],
            [
                10955,
                10957
            ],
            [
                10957,
                11008
            ],
            [
                11011,
                11053
            ],
            [
                11055,
                11086
            ],
            [
                11086,
                11124
            ],
            [
                11125,
                11130
            ],
            [
                11131,
                11188
            ],
            [
                11194,
                11226
            ],
            [
                11232,
                11238
            ],
            [
                11239,
                11244
            ],
            [
                11245,
                11250
            ],
            [
                11250,
                11252
            ],
            [
                11252,
                11272
            ],
            [
                11273,
                11355
            ],
            [
                11366,
                11515
            ],
            [
                11518,
                11558
            ],
            [
                11564,
                11652
            ],
            [
                11653,
                11664
            ],
            [
                11665,
                11668
            ],
            [
                11675,
                11688
            ],
            [
                11689,
                11729
            ],
            [
                11729,
                11850
            ],
            [
                11850,
                11883
            ],
            [
                11883,
                11979
            ],
            [
                11980,
                12004
            ],
            [
                12006,
                12034
            ],
            [
                12035,
                12039
            ],
            [
                12040,
                12187
            ],
            [
                12187,
                12236
            ],
            [
                12249,
                12285
            ],
            [
                12285,
                12293
            ],
            [
                12294,
                12328
            ],
            [
                12329,
                12343
            ],
            [
                12344,
                12392
            ],
            [
                12393,
                12418
            ],
            [
                12425,
                12428
            ],
            [
                12429,
                12527
            ],
            [
                12527,
                12550
            ],
            [
                12551,
                12626
            ],
            [
                12628,
                12655
            ],
            [
                12666,
                12672
            ],
            [
                12673,
                12678
            ],
            [
                12679,
                12762
            ],
            [
                12762,
                12769
            ],
            [
                12770,
                12808
            ],
            [
                12808,
                12815
            ],
            [
                12816,
                12846
            ],
            [
                12850,
                12860
            ],
            [
                12865,
                12867
            ],
            [
                12867,
                12955
            ],
            [
                12960,
                12980
            ],
            [
                12981,
                13006
            ],
            [
                13006,
                13007
            ],
            [
                13008,
                13059
            ],
            [
                13064,
                13066
            ],
            [
                13067,
                13069
            ],
            [
                13070,
                13075
            ],
            [
                13075,
                13137
            ],
            [
                13138,
                13192
            ],
            [
                13192,
                13277
            ],
            [
                13282,
                13290
            ],
            [
                13290,
                13293
            ],
            [
                13294,
                13363
            ],
            [
                13365,
                13404
            ],
            [
                13405,
                13430
            ],
            [
                13431,
                13444
            ],
            [
                13444,
                13479
            ],
            [
                13479,
                13521
            ],
            [
                13527,
                13600
            ],
            [
                13600,
                13625
            ],
            [
                13633,
                13644
            ],
            [
                13644,
                13647
            ],
            [
                13656,
                13668
            ],
            [
                13669,
                13726
            ],
            [
                13726,
                13757
            ],
            [
                13758,
                13777
            ],
            [
                13777,
                13851
            ],
            [
                13851,
                13890
            ],
            [
                13890,
                13951
            ],
            [
                13951,
                13967
            ],
            [
                13968,
                13981
            ],
            [
                13981,
                13983
            ],
            [
                13983,
                14014
            ],
            [
                14014,
                14031
            ],
            [
                14036,
                14182
            ],
            [
                14189,
                14192
            ],
            [
                14197,
                14210
            ],
            [
                14219,
                14222
            ],
            [
                14223,
                14224
            ],
            [
                14231,
                14234
            ],
            [
                14246,
                14248
            ],
            [
                14248,
                14271
            ],
            [
                14276,
                14290
            ],
            [
                14296,
                14336
            ],
            [
                14337,
                14357
            ],
            [
                14358,
                14390
            ],
            [
                14390,
                14435
            ],
            [
                14436,
                14448
            ],
            [
                14448,
                14512
            ],
            [
                14519,
                14526
            ],
            [
                14536,
                14627
            ],
            [
                14628,
                14693
            ],
            [
                14700,
                14733
            ],
            [
                14733,
                14784
            ],
            [
                14784,
                14786
            ],
            [
                14786,
                14920
            ],
            [
                14926,
                14934
            ],
            [
                14937,
                14965
            ],
            [
                14965,
                15098
            ],
            [
                15103,
                15114
            ],
            [
                15120,
                15121
            ],
            [
                15122,
                15125
            ],
            [
                15126,
                15173
            ],
            [
                15174,
                15229
            ],
            [
                15230,
                15385
            ],
            [
                15386,
                15406
            ],
            [
                15412,
                15415
            ],
            [
                15416,
                15448
            ],
            [
                15449,
                15472
            ],
            [
                15472,
                15497
            ],
            [
                15498,
                15550
            ],
            [
                15553,
                15556
            ],
            [
                15561,
                15566
            ],
            [
                15567,
                15584
            ],
            [
                15585,
                15602
            ],
            [
                15603,
                15606
            ],
            [
                15615,
                15617
            ],
            [
                15618,
                15623
            ],
            [
                15629,
                15651
            ],
            [
                15652,
                15655
            ],
            [
                15656,
                15659
            ],
            [
                15660,
                15673
            ],
            [
                15680,
                15692
            ],
            [
                15692,
                15742
            ],
            [
                15748,
                15774
            ],
            [
                15782,
                15784
            ],
            [
                15791,
                15794
            ],
            [
                15795,
                15804
            ],
            [
                15805,
                15846
            ],
            [
                15856,
                15880
            ],
            [
                15888,
                15894
            ],
            [
                15900,
                15902
            ],
            [
                15902,
                16007
            ],
            [
                16007,
                16009
            ],
            [
                16009,
                16012
            ],
            [
                16018,
                16043
            ],
            [
                16043,
                16116
            ],
            [
                16122,
                16129
            ],
            [
                16135,
                16144
            ],
            [
                16145,
                16169
            ],
            [
                16170,
                16174
            ],
            [
                16178,
                16183
            ],
            [
                16184,
                16191
            ],
            [
                16191,
                16194
            ],
            [
                16197,
                16202
            ],
            [
                16203,
                16222
            ],
            [
                16222,
                16228
            ],
            [
                16229,
                16232
            ],
            [
                16241,
                16280
            ],
            [
                16281,
                16296
            ],
            [
                16296,
                16318
            ],
            [
                16321,
                16341
            ],
            [
                16344,
                16372
            ],
            [
                16375,
                16416
            ],
            [
                16419,
                16423
            ],
            [
                16424,
                16464
            ],
            [
                16464,
                16530
            ],
            [
                16530,
                16532
            ],
            [
                16532,
                16574
            ],
            [
                16596,
                16616
            ],
            [
                16616,
                16617
            ],
            [
                16618,
                16623
            ],
            [
                16624,
                16628
            ],
            [
                16629,
                16646
            ],
            [
                16647,
                16699
            ],
            [
                16703,
                16745
            ],
            [
                16745,
                16786
            ],
            [
                16787,
                16803
            ],
            [
                16804,
                16806
            ],
            [
                16807,
                16810
            ],
            [
                16816,
                16862
            ],
            [
                16862,
                16970
            ],
            [
                16970,
                17003
            ],
            [
                17004,
                17038
            ],
            [
                17039,
                17042
            ],
            [
                17043,
                17058
            ],
            [
                17059,
                17064
            ],
            [
                17065,
                17144
            ],
            [
                17153,
                17189
            ],
            [
                17189,
                17318
            ],
            [
                17319,
                17327
            ],
            [
                17344,
                17346
            ],
            [
                17346,
                17389
            ],
            [
                17389,
                17391
            ],
            [
                17391,
                17403
            ],
            [
                17404,
                17446
            ],
            [
                17452,
                17455
            ],
            [
                17468,
                17490
            ],
            [
                17491,
                17506
            ],
            [
                17506,
                17566
            ],
            [
                17567,
                17581
            ],
            [
                17588,
                17605
            ],
            [
                17606,
                17625
            ],
            [
                17626,
                17675
            ],
            [
                17676,
                17694
            ],
            [
                17695,
                17707
            ],
            [
                17714,
                17777
            ],
            [
                17778,
                17786
            ],
            [
                17786,
                17870
            ],
            [
                17880,
                17885
            ],
            [
                17885,
                18009
            ],
            [
                18009,
                18025
            ],
            [
                18026,
                18064
            ],
            [
                18064,
                18122
            ],
            [
                18123,
                18130
            ],
            [
                18131,
                18155
            ],
            [
                18155,
                18188
            ],
            [
                18188,
                18241
            ],
            [
                18251,
                18290
            ],
            [
                18290,
                18292
            ],
            [
                18292,
                18336
            ],
            [
                18336,
                18337
            ],
            [
                18338,
                18366
            ],
            [
                18367,
                18387
            ],
            [
                18387,
                18389
            ],
            [
                18389,
                18402
            ],
            [
                18403,
                18445
            ],
            [
                18446,
                18453
            ],
            [
                18454,
                18476
            ],
            [
                18477,
                18586
            ],
            [
                18587,
                18604
            ],
            [
                18605,
                18670
            ],
            [
                18677,
                18687
            ],
            [
                18695,
                18791
            ],
            [
                18792,
                18796
            ],
            [
                18797,
                18809
            ],
            [
                18809,
                18811
            ],
            [
                18811,
                18845
            ],
            [
                18846,
                18920
            ],
            [
                18920,
                18944
            ],
            [
                18956,
                18957
            ],
            [
                18958,
                18963
            ],
            [
                18964,
                18972
            ],
            [
                18973,
                19023
            ],
            [
                19024,
                19027
            ],
            [
                19033,
                19075
            ],
            [
                19076,
                19133
            ],
            [
                19134,
                19212
            ],
            [
                19213,
                19221
            ],
            [
                19221,
                19230
            ],
            [
                19231,
                19237
            ],
            [
                19240,
                19248
            ],
            [
                19249,
                19252
            ],
            [
                19253,
                19264
            ],
            [
                19264,
                19265
            ],
            [
                19266,
                19306
            ],
            [
                19307,
                19344
            ],
            [
                19345,
                19363
            ],
            [
                19364,
                19421
            ],
            [
                19421,
                19460
            ],
            [
                19461,
                19469
            ],
            [
                19474,
                19522
            ],
            [
                19523,
                19536
            ],
            [
                19536,
                19537
            ],
            [
                19538,
                19569
            ],
            [
                19570,
                19581
            ],
            [
                19592,
                19655
            ],
            [
                19655,
                19665
            ],
            [
                19670,
                19716
            ],
            [
                19717,
                19739
            ],
            [
                19739,
                19741
            ],
            [
                19741,
                19744
            ],
            [
                19745,
                19805
            ],
            [
                19806,
                19895
            ],
            [
                19895,
                19918
            ],
            [
                19921,
                19942
            ],
            [
                19942,
                19951
            ],
            [
                19952,
                20026
            ],
            [
                20033,
                20056
            ],
            [
                20060,
                20080
            ],
            [
                20090,
                20116
            ],
            [
                20116,
                20118
            ],
            [
                20118,
                20174
            ],
            [
                20176,
                20221
            ],
            [
                20223,
                20224
            ],
            [
                20225,
                20297
            ],
            [
                20297,
                20298
            ],
            [
                20299,
                20348
            ],
            [
                20348,
                20384
            ],
            [
                20384,
                20419
            ],
            [
                20419,
                20430
            ],
            [
                20431,
                20481
            ],
            [
                20482,
                20542
            ],
            [
                20543,
                20552
            ],
            [
                20552,
                20628
            ],
            [
                20634,
                20639
            ],
            [
                20644,
                20722
            ],
            [
                20722,
                20727
            ],
            [
                20728,
                20748
            ],
            [
                20758,
                20812
            ],
            [
                20812,
                20814
            ],
            [
                20814,
                20862
            ],
            [
                20862,
                20925
            ],
            [
                20925,
                20928
            ],
            [
                20934,
                20937
            ],
            [
                20938,
                20974
            ],
            [
                20977,
                20993
            ],
            [
                20994,
                21006
            ],
            [
                21016,
                21054
            ],
            [
                21054,
                21057
            ],
            [
                21058,
                21120
            ],
            [
                21121,
                21127
            ],
            [
                21129,
                21136
            ],
            [
                21137,
                21154
            ],
            [
                21154,
                21155
            ],
            [
                21156,
                21167
            ],
            [
                21168,
                21174
            ],
            [
                21175,
                21189
            ],
            [
                21189,
                21199
            ],
            [
                21199,
                21201
            ],
            [
                21202,
                21238
            ],
            [
                21238,
                21268
            ],
            [
                21268,
                21280
            ],
            [
                21286,
                21293
            ],
            [
                21294,
                21322
            ],
            [
                21323,
                21357
            ],
            [
                21357,
                21395
            ],
            [
                21395,
                21422
            ],
            [
                21422,
                21451
            ],
            [
                21454,
                21478
            ],
            [
                21478,
                21516
            ],
            [
                21516,
                21557
            ],
            [
                21557,
                21590
            ],
            [
                21590,
                21592
            ],
            [
                21592,
                21613
            ],
            [
                21614,
                21639
            ],
            [
                21639,
                21641
            ],
            [
                21641,
                21652
            ],
            [
                21652,
                21681
            ],
            [
                21684,
                21713
            ],
            [
                21713,
                21726
            ],
            [
                21727,
                21734
            ],
            [
                21734,
                21736
            ],
            [
                21736,
                21743
            ],
            [
                21743,
                21772
            ],
            [
                21772,
                21782
            ],
            [
                21782,
                21797
            ],
            [
                21797,
                21802
            ],
            [
                21802,
                21817
            ],
            [
                21823,
                21832
            ],
            [
                21840,
                21842
            ],
            [
                21842,
                21848
            ],
            [
                21859,
                21868
            ],
            [
                21868,
                21871
            ],
            [
                21871,
                21908
            ],
            [
                21908,
                21910
            ],
            [
                21910,
                21934
            ],
            [
                21934,
                21939
            ],
            [
                21939,
                21968
            ],
            [
                21969,
                21979
            ],
            [
                21985,
                22011
            ],
            [
                22011,
                22045
            ],
            [
                22049,
                22080
            ],
            [
                22083,
                22138
            ],
            [
                22138,
                22186
            ],
            [
                22193,
                22214
            ],
            [
                22215,
                22233
            ],
            [
                22236,
                22274
            ],
            [
                22274,
                22325
            ],
            [
                22325,
                22364
            ],
            [
                22364,
                22405
            ],
            [
                22405,
                22420
            ],
            [
                22420,
                22424
            ],
            [
                22424,
                22450
            ],
            [
                22461,
                22483
            ],
            [
                22484,
                22487
            ],
            [
                22488,
                22501
            ],
            [
                22502,
                22527
            ],
            [
                22528,
                22559
            ],
            [
                22566,
                22568
            ],
            [
                22569,
                22671
            ],
            [
                22672,
                22676
            ],
            [
                22677,
                22727
            ],
            [
                22727,
                22728
            ],
            [
                22733,
                22745
            ],
            [
                22746,
                22821
            ],
            [
                22822,
                22839
            ],
            [
                22839,
                22841
            ],
            [
                22841,
                22873
            ],
            [
                22879,
                22902
            ],
            [
                22902,
                22992
            ],
            [
                22993,
                23015
            ],
            [
                23015,
                23016
            ],
            [
                23017,
                23022
            ],
            [
                23026,
                23069
            ],
            [
                23069,
                23135
            ],
            [
                23135,
                23136
            ],
            [
                23137,
                23147
            ],
            [
                23148,
                23162
            ],
            [
                23163,
                23173
            ],
            [
                23181,
                23192
            ],
            [
                23193,
                23196
            ],
            [
                23197,
                23203
            ],
            [
                23204,
                23207
            ],
            [
                23208,
                23212
            ],
            [
                23212,
                23213
            ],
            [
                23214,
                23271
            ],
            [
                23271,
                23272
            ],
            [
                23273,
                23294
            ],
            [
                23300,
                23316
            ],
            [
                23316,
                23368
            ],
            [
                23369,
                23378
            ],
            [
                23379,
                23381
            ],
            [
                23382,
                23412
            ],
            [
                23413,
                23445
            ],
            [
                23445,
                23446
            ],
            [
                23452,
                23519
            ],
            [
                23527,
                23533
            ],
            [
                23541,
                23558
            ],
            [
                23558,
                23560
            ],
            [
                23585,
                23596
            ],
            [
                23596,
                23633
            ],
            [
                23633,
                23677
            ],
            [
                23680,
                23746
            ],
            [
                23749,
                23768
            ],
            [
                23769,
                23774
            ],
            [
                23775,
                23781
            ],
            [
                23782,
                23798
            ],
            [
                23799,
                23811
            ],
            [
                23812,
                23895
            ],
            [
                23896,
                23903
            ],
            [
                23909,
                23939
            ],
            [
                23939,
                23962
            ],
            [
                23963,
                23974
            ],
            [
                23975,
                23984
            ],
            [
                23990,
                23992
            ],
            [
                23992,
                24019
            ],
            [
                24019,
                24035
            ],
            [
                24037,
                24079
            ],
            [
                24080,
                24128
            ],
            [
                24133,
                24137
            ],
            [
                24142,
                24165
            ],
            [
                24166,
                24172
            ],
            [
                24178,
                24201
            ],
            [
                24208,
                24237
            ],
            [
                24238,
                24241
            ],
            [
                24242,
                24256
            ]
        ],
        "row_chars": [
            [
                0,
                193
            ],
            [
                193,
                444
            ],
            [
                444,
                515
            ],
            [
                515,
                594
            ],
            [
                594,
                861
            ],
            [
                861,
                964
            ],
            [
                964,
                1147
            ],
            [
                1147,
                1151
            ],
            [
                1151,
                1317
            ],
            [
                1317,
                1455
            ],
            [
                1455,
                1707
            ],
            [
                1707,
                1809
            ],
            [
                1809,
                1950
            ],
            [
                1950,
                2083
            ],
            [
                2083,
                2281
            ],
            [
                2281,
                2473
            ],
            [
                2473,
                2685
            ],
            [
                2685,
                2685
            ],
            [
                2685,
                2685
            ],
            [
                2685,
                2716
            ],
            [
                2716,
                2825
            ],
            [
                2825,
                3094
            ],
            [
                3094,
                3221
            ],
            [
                3221,
                3273
            ],
            [
                3273,
                3475
            ],
            [
                3475,
                3531
            ],
            [
                3531,
                3591
            ],
            [
                3591,
                3796
            ],
            [
                3796,
                3796
            ],
            [
                3796,
                3897
            ],
            [
                3897,
                4101
            ],
            [
                4101,
                4226
            ],
            [
                4226,
                4397
            ],
            [
                4397,
                4652
            ],
            [
                4652,
                4729
            ],
            [
                4729,
                4765
            ],
            [
                4765,
                4800
            ],
            [
                4800,
                4914
            ],
            [
                4914,
                4944
            ],
            [
                4944,
                4995
            ],
            [
                4995,
                5142
            ],
            [
                5142,
                5340
            ],
            [
                5340,
                5544
            ],
            [
                5544,
                5544
            ],
            [
                5544,
                5614
            ],
            [
                5614,
                5735
            ],
            [
                5735,
                5819
            ],
            [
                5819,
                5959
            ],
            [
                5959,
                5999
            ],
            [
                5999,
                6119
            ],
            [
                6119,
                6169
            ],
            [
                6169,
                6263
            ],
            [
                6263,
                6451
            ],
            [
                6451,
                6498
            ],
            [
                6498,
                6594
            ],
            [
                6594,
                6647
            ],
            [
                6647,
                6719
            ],
            [
                6719,
                6886
            ],
            [
                6886,
                6960
            ],
            [
                6960,
                7079
            ],
            [
                7079,
                7130
            ],
            [
                7130,
                7214
            ],
            [
                7214,
                7396
            ],
            [
                7396,
                7482
            ],
            [
                7482,
                7542
            ],
            [
                7542,
                7641
            ],
            [
                7641,
                7748
            ],
            [
                7748,
                7772
            ],
            [
                7772,
                7877
            ],
            [
                7877,
                7903
            ],
            [
                7903,
                7945
            ],
            [
                7945,
                7945
            ],
            [
                7945,
                8336
            ],
            [
                8336,
                8408
            ],
            [
                8408,
                8490
            ],
            [
                8490,
                8560
            ],
            [
                8560,
                8708
            ],
            [
                8708,
                8873
            ],
            [
                8873,
                8873
            ],
            [
                8873,
                8904
            ],
            [
                8904,
                9038
            ],
            [
                9038,
                9167
            ],
            [
                9167,
                9305
            ],
            [
                9305,
                9524
            ],
            [
                9524,
                9830
            ],
            [
                9830,
                9987
            ],
            [
                9987,
                10031
            ],
            [
                10031,
                10187
            ],
            [
                10187,
                10226
            ],
            [
                10226,
                10438
            ],
            [
                10438,
                10742
            ],
            [
                10742,
                10742
            ],
            [
                10742,
                10790
            ],
            [
                10790,
                10912
            ],
            [
                10912,
                10957
            ],
            [
                10957,
                11086
            ],
            [
                11086,
                11252
            ],
            [
                11252,
                11559
            ],
            [
                11559,
                11559
            ],
            [
                11559,
                11559
            ],
            [
                11559,
                11729
            ],
            [
                11729,
                11850
            ],
            [
                11850,
                12187
            ],
            [
                12187,
                12285
            ],
            [
                12285,
                12527
            ],
            [
                12527,
                12679
            ],
            [
                12679,
                12808
            ],
            [
                12808,
                12867
            ],
            [
                12867,
                13008
            ],
            [
                13008,
                13192
            ],
            [
                13192,
                13290
            ],
            [
                13290,
                13444
            ],
            [
                13444,
                13479
            ],
            [
                13479,
                13644
            ],
            [
                13644,
                13726
            ],
            [
                13726,
                13758
            ],
            [
                13758,
                13777
            ],
            [
                13777,
                13851
            ],
            [
                13851,
                13890
            ],
            [
                13890,
                13951
            ],
            [
                13951,
                13983
            ],
            [
                13983,
                14014
            ],
            [
                14014,
                14248
            ],
            [
                14248,
                14390
            ],
            [
                14390,
                14733
            ],
            [
                14733,
                14786
            ],
            [
                14786,
                14965
            ],
            [
                14965,
                15472
            ],
            [
                15472,
                15902
            ],
            [
                15902,
                16009
            ],
            [
                16009,
                16009
            ],
            [
                16009,
                16116
            ],
            [
                16116,
                16296
            ],
            [
                16296,
                16532
            ],
            [
                16532,
                16618
            ],
            [
                16618,
                16699
            ],
            [
                16699,
                16745
            ],
            [
                16745,
                16745
            ],
            [
                16745,
                16862
            ],
            [
                16862,
                16970
            ],
            [
                16970,
                17189
            ],
            [
                17189,
                17346
            ],
            [
                17346,
                17391
            ],
            [
                17391,
                17506
            ],
            [
                17506,
                17695
            ],
            [
                17695,
                17695
            ],
            [
                17695,
                17695
            ],
            [
                17695,
                17695
            ],
            [
                17695,
                18009
            ],
            [
                18009,
                18188
            ],
            [
                18188,
                18292
            ],
            [
                18292,
                18389
            ],
            [
                18389,
                18811
            ],
            [
                18811,
                18958
            ],
            [
                18958,
                18958
            ],
            [
                18958,
                18958
            ],
            [
                18958,
                18958
            ],
            [
                18958,
                19221
            ],
            [
                19221,
                19266
            ],
            [
                19266,
                19421
            ],
            [
                19421,
                19421
            ],
            [
                19421,
                19655
            ],
            [
                19655,
                19741
            ],
            [
                19741,
                19806
            ],
            [
                19806,
                19895
            ],
            [
                19895,
                19942
            ],
            [
                19942,
                20080
            ],
            [
                20080,
                20080
            ],
            [
                20080,
                20116
            ],
            [
                20116,
                20299
            ],
            [
                20299,
                20348
            ],
            [
                20348,
                20419
            ],
            [
                20419,
                20552
            ],
            [
                20552,
                20722
            ],
            [
                20722,
                20814
            ],
            [
                20814,
                20862
            ],
            [
                20862,
                20925
            ],
            [
                20925,
                21054
            ],
            [
                21054,
                21156
            ],
            [
                21156,
                21201
            ],
            [
                21201,
                21238
            ],
            [
                21238,
                21268
            ],
            [
                21268,
                21357
            ],
            [
                21357,
                21395
            ],
            [
                21395,
                21422
            ],
            [
                21422,
                21478
            ],
            [
                21478,
                21516
            ],
            [
                21516,
                21557
            ],
            [
                21557,
                21592
            ],
            [
                21592,
                21641
            ],
            [
                21641,
                21652
            ],
            [
                21652,
                21713
            ],
            [
                21713,
                21736
            ],
            [
                21736,
                21743
            ],
            [
                21743,
                21772
            ],
            [
                21772,
                21782
            ],
            [
                21782,
                21797
            ],
            [
                21797,
                21797
            ],
            [
                21797,
                21802
            ],
            [
                21802,
                21842
            ],
            [
                21842,
                21871
            ],
            [
                21871,
                21910
            ],
            [
                21910,
                21939
            ],
            [
                21939,
                22011
            ],
            [
                22011,
                22138
            ],
            [
                22138,
                22186
            ],
            [
                22186,
                22186
            ],
            [
                22186,
                22186
            ],
            [
                22186,
                22186
            ],
            [
                22186,
                22274
            ],
            [
                22274,
                22325
            ],
            [
                22325,
                22325
            ],
            [
                22325,
                22325
            ],
            [
                22325,
                22325
            ],
            [
                22325,
                22325
            ],
            [
                22325,
                22325
            ],
            [
                22325,
                22364
            ],
            [
                22364,
                22405
            ],
            [
                22405,
                22420
            ],
            [
                22420,
                22424
            ],
            [
                22424,
                22841
            ],
            [
                22841,
                23017
            ],
            [
                23017,
                23069
            ],
            [
                23069,
                23316
            ],
            [
                23316,
                23560
            ],
            [
                23560,
                23633
            ],
            [
                23633,
                23633
            ],
            [
                23633,
                23799
            ],
            [
                23799,
                23799
            ],
            [
                23799,
                23992
            ],
            [
                23992,
                24256
            ]
        ]
    }
}