{
    "original": {
        "text": "The day after the meeting at the play-table, Jos had himself arrayed with unusual care and splendour, and without thinking it necessary to say a word to any member of his family regarding the occurrences of the previous night, or asking for their company in his walk, he sallied forth at an early hour, and was presently seen making inquiries at the door of the Elephant Hotel. In consequence of the fetes the house was full of company, the tables in the street were already surrounded by persons smoking and drinking the national small-beer, the public rooms were in a cloud of smoke, and Mr. Jos having, in his pompous way, and with his clumsy German, made inquiries for the person of whom he was in search, was directed to the very top of the house, above the first-floor rooms where some travelling pedlars had lived, and were exhibiting their jewellery and brocades; above the second-floor apartments occupied by the etat major of the gambling firm; above the third-floor rooms, tenanted by the band of renowned Bohemian vaulters and tumblers; and so on to the little cabins of the roof, where, among students, bagmen, small tradesmen, and country-folks come in for the festival, Becky had found a little nest--as dirty a little refuge as ever beauty lay hid in.\nBecky liked the life. She was at home with everybody in the place, pedlars, punters, tumblers, students and all. She was of a wild, roving nature, inherited from father and mother, who were both Bohemians, by taste and circumstance; if a lord was not by, she would talk to his courier with the greatest pleasure; the din, the stir, the drink, the smoke, the tattle of the Hebrew pedlars, the solemn, braggart ways of the poor tumblers, the sournois talk of the gambling-table officials, the songs and swagger of the students, and the general buzz and hum of the place had pleased and tickled the little woman, even when her luck was down and she had not wherewithal to pay her bill. How pleasant was all the bustle to her now that her purse was full of the money which little Georgy had won for her the night before!\nAs Jos came creaking and puffing up the final stairs, and was speechless when he got to the landing, and began to wipe his face and then to look for No. 92, the room where he was directed to seek for the person he wanted, the door of the opposite chamber, No. 90, was open, and a student, in jack-boots and a dirty schlafrock, was lying on the bed smoking a long pipe; whilst another student in long yellow hair and a braided coat, exceeding smart and dirty too, was actually on his knees at No. 92, bawling through the keyhole supplications to the person within.\n\"Go away,\" said a well-known voice, which made Jos thrill, \"I expect somebody; I expect my grandpapa. He mustn't see you there.\"\n\"Angel Englanderinn!\" bellowed the kneeling student with the whity-brown ringlets and the large finger-ring, \"do take compassion upon us. Make an appointment. Dine with me and Fritz at the inn in the park. We will have roast pheasants and porter, plum-pudding and French wine. We shall die if you don't.\"\n\"That we will,\" said the young nobleman on the bed; and this colloquy Jos overheard, though he did not comprehend it, for the reason that he had never studied the language in which it was carried on.\n\"Newmero kattervang dooze, si vous plait,\" Jos said in his grandest manner, when he was able to speak.\n\"Quater fang tooce!\" said the student, starting up, and he bounced into his own room, where he locked the door, and where Jos heard him laughing with his comrade on the bed.\nThe gentleman from Bengal was standing, disconcerted by this incident, when the door of the 92 opened of itself and Becky's little head peeped out full of archness and mischief. She lighted on Jos. \"It's you,\" she said, coming out. \"How I have been waiting for you! Stop! not yet--in one minute you shall come in.\" In that instant she put a rouge-pot, a brandy bottle, and a plate of broken meat into the bed, gave one smooth to her hair, and finally let in her visitor.\nShe had, by way of morning robe, a pink domino, a trifle faded and soiled, and marked here and there with pomaturn; but her arms shone out from the loose sleeves of the dress very white and fair, and it was tied round her little waist so as not ill to set off the trim little figure of the wearer. She led Jos by the hand into her garret. \"Come in,\" she said. \"Come and talk to me. Sit yonder on the chair\"; and she gave the civilian's hand a little squeeze and laughingly placed him upon it. As for herself, she placed herself on the bed--not on the bottle and plate, you may be sure--on which Jos might have reposed, had he chosen that seat; and so there she sat and talked with her old admirer. \"How little years have changed you,\" she said with a look of tender interest. \"I should have known you anywhere. What a comfort it is amongst strangers to see once more the frank honest face of an old friend!\"\nThe frank honest face, to tell the truth, at this moment bore any expression but one of openness and honesty: it was, on the contrary, much perturbed and puzzled in look. Jos was surveying the queer little apartment in which he found his old flame. One of her gowns hung over the bed, another depending from a hook of the door; her bonnet obscured half the looking-glass, on which, too, lay the prettiest little pair of bronze boots; a French novel was on the table by the bedside, with a candle, not of wax. Becky thought of popping that into the bed too, but she only put in the little paper night-cap with which she had put the candle out on going to sleep.\n\"I should have known you anywhere,\" she continued; \"a woman never forgets some things. And you were the first man I ever--I ever saw.\"\n\"Was I really?\" said Jos. \"God bless my soul, you--you don't say so.\"\n\"When I came with your sister from Chiswick, I was scarcely more than a child,\" Becky said. \"How is that, dear love? Oh, her husband was a sad wicked man, and of course it was of me that the poor dear was jealous. As if I cared about him, heigho! when there was somebody--but no--don't let us talk of old times\"; and she passed her handkerchief with the tattered lace across her eyelids.\n\"Is not this a strange place,\" she continued, \"for a woman, who has lived in a very different world too, to be found in? I have had so many griefs and wrongs, Joseph Sedley; I have been made to suffer so cruelly that I am almost made mad sometimes. I can't stay still in any place, but wander about always restless and unhappy. All my friends have been false to me--all. There is no such thing as an honest man in the world. I was the truest wife that ever lived, though I married my husband out of pique, because somebody else--but never mind that. I was true, and he trampled upon me and deserted me. I was the fondest mother. I had but one child, one darling, one hope, one joy, which I held to my heart with a mother's affection, which was my life, my prayer, my--my blessing; and they--they tore it from me--tore it from me\"; and she put her hand to her heart with a passionate gesture of despair, burying her face for a moment on the bed.\nThe brandy-bottle inside clinked up against the plate which held the cold sausage. Both were moved, no doubt, by the exhibition of so much grief. Max and Fritz were at the door, listening with wonder to Mrs. Becky's sobs and cries. Jos, too, was a good deal frightened and affected at seeing his old flame in this condition. And she began, forthwith, to tell her story--a tale so neat, simple, and artless that it was quite evident from hearing her that if ever there was a white-robed angel escaped from heaven to be subject to the infernal machinations and villainy of fiends here below, that spotless being--that miserable unsullied martyr, was present on the bed before Jos--on the bed, sitting on the brandy-bottle.\nThey had a very long, amicable, and confidential talk there, in the course of which Jos Sedley was somehow made aware (but in a manner that did not in the least scare or offend him) that Becky's heart had first learned to beat at his enchanting presence; that George Osborne had certainly paid an unjustifiable court to HER, which might account for Amelia's jealousy and their little rupture; but that Becky never gave the least encouragement to the unfortunate officer, and that she had never ceased to think about Jos from the very first day she had seen him, though, of course, her duties as a married woman were paramount--duties which she had always preserved, and would, to her dying day, or until the proverbially bad climate in which Colonel Crawley was living should release her from a yoke which his cruelty had rendered odious to her.\nJos went away, convinced that she was the most virtuous, as she was one of the most fascinating of women, and revolving in his mind all sorts of benevolent schemes for her welfare. Her persecutions ought to be ended: she ought to return to the society of which she was an ornament. He would see what ought to be done. She must quit that place and take a quiet lodging. Amelia must come and see her and befriend her. He would go and settle about it, and consult with the Major. She wept tears of heart-felt gratitude as she parted from him, and pressed his hand as the gallant stout gentleman stooped down to kiss hers.\nSo Becky bowed Jos out of her little garret with as much grace as if it was a palace of which she did the honours; and that heavy gentleman having disappeared down the stairs, Max and Fritz came out of their hole, pipe in mouth, and she amused herself by mimicking Jos to them as she munched her cold bread and sausage and took draughts of her favourite brandy-and-water.\nJos walked over to Dobbin's lodgings with great solemnity and there imparted to him the affecting history with which he had just been made acquainted, without, however, mentioning the play business of the night before. And the two gentlemen were laying their heads together and consulting as to the best means of being useful to Mrs. Becky, while she was finishing her interrupted dejeuner a la fourchette.\nHow was it that she had come to that little town? How was it that she had no friends and was wandering about alone? Little boys at school are taught in their earliest Latin book that the path of Avernus is very easy of descent. Let us skip over the interval in the history of her downward progress. She was not worse now than she had been in the days of her prosperity--only a little down on her luck.\nAs for Mrs. Amelia, she was a woman of such a soft and foolish disposition that when she heard of anybody unhappy, her heart straightway melted towards the sufferer; and as she had never thought or done anything mortally guilty herself, she had not that abhorrence for wickedness which distinguishes moralists much more knowing. If she spoiled everybody who came near her with kindness and compliments--if she begged pardon of all her servants for troubling them to answer the bell--if she apologized to a shopboy who showed her a piece of silk, or made a curtsey to a street-sweeper with a complimentary remark upon the elegant state of his crossing--and she was almost capable of every one of these follies--the notion that an old acquaintance was miserable was sure to soften her heart; nor would she hear of anybody's being deservedly unhappy. A world under such legislation as hers would not be a very orderly place of abode; but there are not many women, at least not of the rulers, who are of her sort. This lady, I believe, would have abolished all gaols, punishments, handcuffs, whippings, poverty, sickness, hunger, in the world, and was such a mean-spirited creature that--we are obliged to confess it--she could even forget a mortal injury.\nWhen the Major heard from Jos of the sentimental adventure which had just befallen the latter, he was not, it must be owned, nearly as much interested as the gentleman from Bengal. On the contrary, his excitement was quite the reverse from a pleasurable one; he made use of a brief but improper expression regarding a poor woman in distress, saying, in fact, \"The little minx, has she come to light again?\" He never had had the slightest liking for her, but had heartily mistrusted her from the very first moment when her green eyes had looked at, and turned away from, his own.\n\"That little devil brings mischief wherever she goes,\" the Major said disrespectfully. \"Who knows what sort of life she has been leading? And what business has she here abroad and alone? Don't tell me about persecutors and enemies; an honest woman always has friends and never is separated from her family. Why has she left her husband? He may have been disreputable and wicked, as you say. He always was. I remember the confounded blackleg and the way in which he used to cheat and hoodwink poor George. Wasn't there a scandal about their separation? I think I heard something,\" cried out Major Dobbin, who did not care much about gossip, and whom Jos tried in vain to convince that Mrs. Becky was in all respects a most injured and virtuous female.\n\"Well, well; let's ask Mrs. George,\" said that arch-diplomatist of a Major. \"Only let us go and consult her. I suppose you will allow that she is a good judge at any rate, and knows what is right in such matters.\"\n\"Hm! Emmy is very well,\" said Jos, who did not happen to be in love with his sister.\n\"Very well? By Gad, sir, she's the finest lady I ever met in my life,\" bounced out the Major. \"I say at once, let us go and ask her if this woman ought to be visited or not--I will be content with her verdict.\" Now this odious, artful rogue of a Major was thinking in his own mind that he was sure of his case. Emmy, he remembered, was at one time cruelly and deservedly jealous of Rebecca, never mentioned her name but with a shrinking and terror--a jealous woman never forgives, thought Dobbin: and so the pair went across the street to Mrs. George's house, where she was contentedly warbling at a music lesson with Madame Strumpff.\nWhen that lady took her leave, Jos opened the business with his usual pomp of words. \"Amelia, my dear,\" said he, \"I have just had the most extraordinary--yes--God bless my soul! the most extraordinary adventure--an old friend--yes, a most interesting old friend of yours, and I may say in old times, has just arrived here, and I should like you to see her.\"\n\"Her!\" said Amelia, \"who is it? Major Dobbin, if you please not to break my scissors.\" The Major was twirling them round by the little chain from which they sometimes hung to their lady's waist, and was thereby endangering his own eye.\n\"It is a woman whom I dislike very much,\" said the Major, doggedly, \"and whom you have no cause to love.\"\n\"It is Rebecca, I'm sure it is Rebecca,\" Amelia said, blushing and being very much agitated.\n\"You are right; you always are,\" Dobbin answered. Brussels, Waterloo, old, old times, griefs, pangs, remembrances, rushed back into Amelia's gentle heart and caused a cruel agitation there.\n\"Don't let me see her,\" Emmy continued. \"I couldn't see her.\"\n\"I told you so,\" Dobbin said to Jos.\n\"She is very unhappy, and--and that sort of thing,\" Jos urged. \"She is very poor and unprotected, and has been ill--exceedingly ill--and that scoundrel of a husband has deserted her.\"\n\"Ah!\" said Amelia.\n\"She hasn't a friend in the world,\" Jos went on, not undexterously, \"and she said she thought she might trust in you. She's so miserable, Emmy. She has been almost mad with grief. Her story quite affected me--'pon my word and honour, it did--never was such a cruel persecution borne so angelically, I may say. Her family has been most cruel to her.\"\n\"Poor creature!\" Amelia said.\n\"And if she can get no friend, she says she thinks she'll die,\" Jos proceeded in a low tremulous voice. \"God bless my soul! do you know that she tried to kill herself? She carries laudanum with her--I saw the bottle in her room--such a miserable little room--at a third-rate house, the Elephant, up in the roof at the top of all. I went there.\"\nThis did not seem to affect Emmy. She even smiled a little. Perhaps she figured Jos to herself panting up the stair.\n\"She's beside herself with grief,\" he resumed. \"The agonies that woman has endured are quite frightful to hear of. She had a little boy, of the same age as Georgy.\"\n\"Yes, yes, I think I remember,\" Emmy remarked. \"Well?\"\n\"The most beautiful child ever seen,\" Jos said, who was very fat, and easily moved, and had been touched by the story Becky told; \"a perfect angel, who adored his mother. The ruffians tore him shrieking out of her arms, and have never allowed him to see her.\"\n\"Dear Joseph,\" Emmy cried out, starting up at once, \"let us go and see her this minute.\" And she ran into her adjoining bedchamber, tied on her bonnet in a flutter, came out with her shawl on her arm, and ordered Dobbin to follow.\nHe went and put her shawl--it was a white cashmere, consigned to her by the Major himself from India--over her shoulders. He saw there was nothing for it but to obey, and she put her hand into his arm, and they went away.\n\"It is number 92, up four pair of stairs,\" Jos said, perhaps not very willing to ascend the steps again; but he placed himself in the window of his drawing-room, which commands the place on which the Elephant stands, and saw the pair marching through the market.\nIt was as well that Becky saw them too from her garret, for she and the two students were chattering and laughing there; they had been joking about the appearance of Becky's grandpapa--whose arrival and departure they had witnessed--but she had time to dismiss them, and have her little room clear before the landlord of the Elephant, who knew that Mrs. Osborne was a great favourite at the Serene Court, and respected her accordingly, led the way up the stairs to the roof story, encouraging Miladi and the Herr Major as they achieved the ascent.\n\"Gracious lady, gracious lady!\" said the landlord, knocking at Becky's door; he had called her Madame the day before, and was by no means courteous to her.\n\"Who is it?\" Becky said, putting out her head, and she gave a little scream. There stood Emmy in a tremble, and Dobbin, the tall Major, with his cane.\nHe stood still watching, and very much interested at the scene; but Emmy sprang forward with open arms towards Rebecca, and forgave her at that moment, and embraced her and kissed her with all her heart. Ah, poor wretch, when was your lip pressed before by such pure kisses?",
        "paragraph_chars": [
            [
                0,
                1268
            ],
            [
                1268,
                2085
            ],
            [
                2085,
                2649
            ],
            [
                2649,
                2778
            ],
            [
                2778,
                3083
            ],
            [
                3083,
                3283
            ],
            [
                3283,
                3386
            ],
            [
                3386,
                3560
            ],
            [
                3560,
                4031
            ],
            [
                4031,
                4939
            ],
            [
                4939,
                5600
            ],
            [
                5600,
                5735
            ],
            [
                5735,
                5805
            ],
            [
                5805,
                6193
            ],
            [
                6193,
                7138
            ],
            [
                7138,
                7859
            ],
            [
                7859,
                8705
            ],
            [
                8705,
                9324
            ],
            [
                9324,
                9696
            ],
            [
                9696,
                10103
            ],
            [
                10103,
                10505
            ],
            [
                10505,
                11758
            ],
            [
                11758,
                12337
            ],
            [
                12337,
                13088
            ],
            [
                13088,
                13302
            ],
            [
                13302,
                13387
            ],
            [
                13387,
                14022
            ],
            [
                14022,
                14380
            ],
            [
                14380,
                14616
            ],
            [
                14616,
                14722
            ],
            [
                14722,
                14815
            ],
            [
                14815,
                15005
            ],
            [
                15005,
                15067
            ],
            [
                15067,
                15104
            ],
            [
                15104,
                15288
            ],
            [
                15288,
                15307
            ],
            [
                15307,
                15657
            ],
            [
                15657,
                15687
            ],
            [
                15687,
                16032
            ],
            [
                16032,
                16149
            ],
            [
                16149,
                16314
            ],
            [
                16314,
                16369
            ],
            [
                16369,
                16629
            ],
            [
                16629,
                16860
            ],
            [
                16860,
                17082
            ],
            [
                17082,
                17345
            ],
            [
                17345,
                17893
            ],
            [
                17893,
                18049
            ],
            [
                18049,
                18200
            ],
            [
                18200,
                18474
            ]
        ],
        "segment_chars": [
            [
                0,
                378
            ],
            [
                378,
                1268
            ],
            [
                1268,
                1290
            ],
            [
                1290,
                1381
            ],
            [
                1381,
                1951
            ],
            [
                1951,
                2085
            ],
            [
                2085,
                2238
            ],
            [
                2238,
                2345
            ],
            [
                2345,
                2581
            ],
            [
                2581,
                2649
            ],
            [
                2649,
                2751
            ],
            [
                2751,
                2778
            ],
            [
                2778,
                2800
            ],
            [
                2800,
                2916
            ],
            [
                2916,
                2937
            ],
            [
                2937,
                2984
            ],
            [
                2984,
                3055
            ],
            [
                3055,
                3083
            ],
            [
                3083,
                3283
            ],
            [
                3283,
                3386
            ],
            [
                3386,
                3407
            ],
            [
                3407,
                3560
            ],
            [
                3560,
                3738
            ],
            [
                3738,
                3758
            ],
            [
                3758,
                3792
            ],
            [
                3792,
                3826
            ],
            [
                3826,
                3832
            ],
            [
                3832,
                3875
            ],
            [
                3875,
                4031
            ],
            [
                4031,
                4329
            ],
            [
                4329,
                4370
            ],
            [
                4370,
                4391
            ],
            [
                4391,
                4413
            ],
            [
                4413,
                4524
            ],
            [
                4524,
                4729
            ],
            [
                4729,
                4807
            ],
            [
                4807,
                4842
            ],
            [
                4842,
                4939
            ],
            [
                4939,
                5110
            ],
            [
                5110,
                5188
            ],
            [
                5188,
                5448
            ],
            [
                5448,
                5600
            ],
            [
                5600,
                5687
            ],
            [
                5687,
                5735
            ],
            [
                5735,
                5751
            ],
            [
                5751,
                5761
            ],
            [
                5761,
                5805
            ],
            [
                5805,
                5897
            ],
            [
                5897,
                5922
            ],
            [
                5922,
                6019
            ],
            [
                6019,
                6052
            ],
            [
                6052,
                6193
            ],
            [
                6193,
                6314
            ],
            [
                6314,
                6442
            ],
            [
                6442,
                6521
            ],
            [
                6521,
                6564
            ],
            [
                6564,
                6618
            ],
            [
                6618,
                6743
            ],
            [
                6743,
                6796
            ],
            [
                6796,
                6822
            ],
            [
                6822,
                7138
            ],
            [
                7138,
                7221
            ],
            [
                7221,
                7284
            ],
            [
                7284,
                7370
            ],
            [
                7370,
                7463
            ],
            [
                7463,
                7859
            ],
            [
                7859,
                8705
            ],
            [
                8705,
                8886
            ],
            [
                8886,
                8987
            ],
            [
                8987,
                9023
            ],
            [
                9023,
                9074
            ],
            [
                9074,
                9121
            ],
            [
                9121,
                9182
            ],
            [
                9182,
                9324
            ],
            [
                9324,
                9696
            ],
            [
                9696,
                9915
            ],
            [
                9915,
                10103
            ],
            [
                10103,
                10153
            ],
            [
                10153,
                10219
            ],
            [
                10219,
                10331
            ],
            [
                10331,
                10402
            ],
            [
                10402,
                10505
            ],
            [
                10505,
                10834
            ],
            [
                10834,
                11353
            ],
            [
                11353,
                11515
            ],
            [
                11515,
                11758
            ],
            [
                11758,
                11939
            ],
            [
                11939,
                12165
            ],
            [
                12165,
                12337
            ],
            [
                12337,
                12424
            ],
            [
                12424,
                12475
            ],
            [
                12475,
                12524
            ],
            [
                12524,
                12644
            ],
            [
                12644,
                12674
            ],
            [
                12674,
                12728
            ],
            [
                12728,
                12743
            ],
            [
                12743,
                12842
            ],
            [
                12842,
                12889
            ],
            [
                12889,
                13088
            ],
            [
                13088,
                13164
            ],
            [
                13164,
                13197
            ],
            [
                13197,
                13302
            ],
            [
                13302,
                13307
            ],
            [
                13307,
                13387
            ],
            [
                13387,
                13399
            ],
            [
                13399,
                13481
            ],
            [
                13481,
                13598
            ],
            [
                13598,
                13698
            ],
            [
                13698,
                14022
            ],
            [
                14022,
                14107
            ],
            [
                14107,
                14200
            ],
            [
                14200,
                14380
            ],
            [
                14380,
                14387
            ],
            [
                14387,
                14412
            ],
            [
                14412,
                14467
            ],
            [
                14467,
                14616
            ],
            [
                14616,
                14722
            ],
            [
                14722,
                14815
            ],
            [
                14815,
                14865
            ],
            [
                14865,
                15005
            ],
            [
                15005,
                15045
            ],
            [
                15045,
                15067
            ],
            [
                15067,
                15104
            ],
            [
                15104,
                15167
            ],
            [
                15167,
                15288
            ],
            [
                15288,
                15294
            ],
            [
                15294,
                15307
            ],
            [
                15307,
                15425
            ],
            [
                15425,
                15451
            ],
            [
                15451,
                15487
            ],
            [
                15487,
                15617
            ],
            [
                15617,
                15657
            ],
            [
                15657,
                15674
            ],
            [
                15674,
                15687
            ],
            [
                15687,
                15791
            ],
            [
                15791,
                15811
            ],
            [
                15811,
                15855
            ],
            [
                15855,
                16017
            ],
            [
                16017,
                16032
            ],
            [
                16032,
                16066
            ],
            [
                16066,
                16092
            ],
            [
                16092,
                16149
            ],
            [
                16149,
                16196
            ],
            [
                16196,
                16264
            ],
            [
                16264,
                16314
            ],
            [
                16314,
                16361
            ],
            [
                16361,
                16369
            ],
            [
                16369,
                16540
            ],
            [
                16540,
                16629
            ],
            [
                16629,
                16718
            ],
            [
                16718,
                16860
            ],
            [
                16860,
                16982
            ],
            [
                16982,
                17082
            ],
            [
                17082,
                17345
            ],
            [
                17345,
                17893
            ],
            [
                17893,
                17925
            ],
            [
                17925,
                18049
            ],
            [
                18049,
                18062
            ],
            [
                18062,
                18126
            ],
            [
                18126,
                18200
            ],
            [
                18200,
                18404
            ],
            [
                18404,
                18474
            ]
        ],
        "overlap_chars": [
            [
                0,
                48
            ],
            [
                61,
                68
            ],
            [
                53,
                60
            ],
            [
                69,
                100
            ],
            [
                106,
                113
            ],
            [
                143,
                156
            ],
            [
                164,
                177
            ],
            [
                188,
                191
            ],
            [
                204,
                226
            ],
            [
                268,
                270
            ],
            [
                291,
                296
            ],
            [
                100,
                105
            ],
            [
                237,
                240
            ],
            [
                358,
                378
            ],
            [
                393,
                399
            ],
            [
                435,
                440
            ],
            [
                416,
                424
            ],
            [
                590,
                597
            ],
            [
                654,
                668
            ],
            [
                378,
                380
            ],
            [
                639,
                653
            ],
            [
                505,
                508
            ],
            [
                710,
                752
            ],
            [
                406,
                409
            ],
            [
                775,
                786
            ],
            [
                792,
                810
            ],
            [
                541,
                542
            ],
            [
                1039,
                1047
            ],
            [
                1114,
                1123
            ],
            [
                1106,
                1114
            ],
            [
                586,
                589
            ],
            [
                1124,
                1139
            ],
            [
                815,
                820
            ],
            [
                1185,
                1194
            ],
            [
                1201,
                1214
            ],
            [
                536,
                537
            ],
            [
                1216,
                1268
            ],
            [
                1268,
                1290
            ],
            [
                1290,
                1310
            ],
            [
                1335,
                1342
            ],
            [
                1351,
                1381
            ],
            [
                1381,
                1384
            ],
            [
                1836,
                1839
            ],
            [
                1415,
                1424
            ],
            [
                1392,
                1413
            ],
            [
                1581,
                1620
            ],
            [
                1753,
                1835
            ],
            [
                1840,
                1847
            ],
            [
                1860,
                1913
            ],
            [
                1515,
                1518
            ],
            [
                1937,
                1951
            ],
            [
                1951,
                1967
            ],
            [
                1972,
                2085
            ],
            [
                2085,
                2142
            ],
            [
                2190,
                2216
            ],
            [
                2225,
                2238
            ],
            [
                2238,
                2240
            ],
            [
                2305,
                2345
            ],
            [
                2345,
                2357
            ],
            [
                2363,
                2372
            ],
            [
                2412,
                2515
            ],
            [
                2548,
                2581
            ],
            [
                2581,
                2612
            ],
            [
                2647,
                2649
            ],
            [
                2649,
                2683
            ],
            [
                2683,
                2706
            ],
            [
                2708,
                2710
            ],
            [
                2718,
                2727
            ],
            [
                2737,
                2751
            ],
            [
                2751,
                2778
            ],
            [
                2778,
                2800
            ],
            [
                2800,
                2829
            ],
            [
                2885,
                2890
            ],
            [
                2937,
                2946
            ],
            [
                2912,
                2914
            ],
            [
                2960,
                2984
            ],
            [
                2984,
                3023
            ],
            [
                3053,
                3055
            ],
            [
                3055,
                3083
            ],
            [
                3083,
                3133
            ],
            [
                3153,
                3166
            ],
            [
                3139,
                3143
            ],
            [
                3166,
                3185
            ],
            [
                3205,
                3208
            ],
            [
                3281,
                3283
            ],
            [
                3442,
                3444
            ],
            [
                3423,
                3424
            ],
            [
                3412,
                3423
            ],
            [
                3434,
                3441
            ],
            [
                3445,
                3471
            ],
            [
                3502,
                3547
            ],
            [
                3558,
                3560
            ],
            [
                3586,
                3598
            ],
            [
                3600,
                3612
            ],
            [
                3631,
                3647
            ],
            [
                3652,
                3661
            ],
            [
                3672,
                3737
            ],
            [
                3758,
                3792
            ],
            [
                3792,
                3826
            ],
            [
                3826,
                3832
            ],
            [
                3832,
                3839
            ],
            [
                3841,
                3875
            ],
            [
                3875,
                3969
            ],
            [
                3989,
                4031
            ],
            [
                4031,
                4034
            ],
            [
                4064,
                4104
            ],
            [
                4145,
                4192
            ],
            [
                4206,
                4252
            ],
            [
                4260,
                4271
            ],
            [
                4280,
                4290
            ],
            [
                4295,
                4313
            ],
            [
                4327,
                4329
            ],
            [
                4329,
                4369
            ],
            [
                4370,
                4391
            ],
            [
                4391,
                4413
            ],
            [
                4413,
                4436
            ],
            [
                4439,
                4451
            ],
            [
                4467,
                4488
            ],
            [
                4522,
                4524
            ],
            [
                4540,
                4569
            ],
            [
                4571,
                4615
            ],
            [
                4675,
                4678
            ],
            [
                4682,
                4728
            ],
            [
                4729,
                4740
            ],
            [
                4741,
                4807
            ],
            [
                4807,
                4842
            ],
            [
                4842,
                4939
            ],
            [
                4939,
                5088
            ],
            [
                5108,
                5110
            ],
            [
                5110,
                5188
            ],
            [
                5188,
                5223
            ],
            [
                5421,
                5425
            ],
            [
                5224,
                5231
            ],
            [
                5408,
                5411
            ],
            [
                5249,
                5319
            ],
            [
                5326,
                5398
            ],
            [
                5412,
                5419
            ],
            [
                5399,
                5404
            ],
            [
                5446,
                5447
            ],
            [
                5600,
                5687
            ],
            [
                5687,
                5720
            ],
            [
                5722,
                5735
            ],
            [
                5735,
                5751
            ],
            [
                5751,
                5761
            ],
            [
                5761,
                5784
            ],
            [
                5790,
                5805
            ],
            [
                5805,
                5897
            ],
            [
                5897,
                5909
            ],
            [
                5911,
                5915
            ],
            [
                5920,
                5922
            ],
            [
                5922,
                5963
            ],
            [
                5992,
                6017
            ],
            [
                5981,
                5986
            ],
            [
                6017,
                6019
            ],
            [
                6019,
                6042
            ],
            [
                6050,
                6052
            ],
            [
                6052,
                6075
            ],
            [
                6077,
                6083
            ],
            [
                6085,
                6115
            ],
            [
                6122,
                6149
            ],
            [
                6159,
                6193
            ],
            [
                6193,
                6251
            ],
            [
                6253,
                6292
            ],
            [
                6312,
                6314
            ],
            [
                6314,
                6411
            ],
            [
                6444,
                6491
            ],
            [
                6499,
                6521
            ],
            [
                6521,
                6557
            ],
            [
                6559,
                6564
            ],
            [
                6564,
                6618
            ],
            [
                6618,
                6720
            ],
            [
                6722,
                6743
            ],
            [
                6743,
                6753
            ],
            [
                6753,
                6796
            ],
            [
                6796,
                6820
            ],
            [
                6888,
                6893
            ],
            [
                6847,
                6854
            ],
            [
                6836,
                6842
            ],
            [
                6937,
                6939
            ],
            [
                6860,
                6864
            ],
            [
                7024,
                7027
            ],
            [
                6870,
                6873
            ],
            [
                6972,
                6982
            ],
            [
                6984,
                7004
            ],
            [
                7028,
                7138
            ],
            [
                7138,
                7191
            ],
            [
                7219,
                7221
            ],
            [
                7221,
                7250
            ],
            [
                7277,
                7284
            ],
            [
                7370,
                7373
            ],
            [
                7380,
                7429
            ],
            [
                7444,
                7463
            ],
            [
                7467,
                7476
            ],
            [
                7489,
                7506
            ],
            [
                7508,
                7569
            ],
            [
                7587,
                7591
            ],
            [
                7610,
                7649
            ],
            [
                7606,
                7609
            ],
            [
                7805,
                7815
            ],
            [
                7817,
                7859
            ],
            [
                7859,
                7889
            ],
            [
                7891,
                7912
            ],
            [
                7889,
                7890
            ],
            [
                7937,
                7976
            ],
            [
                8041,
                8152
            ],
            [
                8170,
                8178
            ],
            [
                8261,
                8266
            ],
            [
                7918,
                7919
            ],
            [
                8252,
                8260
            ],
            [
                8267,
                8277
            ],
            [
                8036,
                8039
            ],
            [
                8278,
                8301
            ],
            [
                8328,
                8484
            ],
            [
                8493,
                8502
            ],
            [
                8529,
                8534
            ],
            [
                8536,
                8566
            ],
            [
                8580,
                8653
            ],
            [
                7994,
                7998
            ],
            [
                8665,
                8680
            ],
            [
                8690,
                8696
            ],
            [
                8703,
                8705
            ],
            [
                8705,
                8718
            ],
            [
                8720,
                8760
            ],
            [
                8789,
                8814
            ],
            [
                8837,
                8886
            ],
            [
                8922,
                8944
            ],
            [
                8949,
                8956
            ],
            [
                8985,
                8987
            ],
            [
                9023,
                9074
            ],
            [
                9074,
                9094
            ],
            [
                9107,
                9121
            ],
            [
                9121,
                9136
            ],
            [
                9150,
                9182
            ],
            [
                9182,
                9248
            ],
            [
                9269,
                9304
            ],
            [
                9310,
                9317
            ],
            [
                9261,
                9265
            ],
            [
                9322,
                9324
            ],
            [
                9324,
                9408
            ],
            [
                9437,
                9442
            ],
            [
                9471,
                9499
            ],
            [
                9426,
                9429
            ],
            [
                9514,
                9536
            ],
            [
                9551,
                9646
            ],
            [
                9664,
                9696
            ],
            [
                9696,
                9732
            ],
            [
                9754,
                9763
            ],
            [
                9744,
                9750
            ],
            [
                9776,
                9779
            ],
            [
                9784,
                9801
            ],
            [
                9845,
                9879
            ],
            [
                9885,
                9915
            ],
            [
                9915,
                9936
            ],
            [
                9949,
                9973
            ],
            [
                9988,
                9990
            ],
            [
                10015,
                10035
            ],
            [
                10101,
                10103
            ],
            [
                10505,
                10648
            ],
            [
                10832,
                10834
            ],
            [
                10908,
                10986
            ],
            [
                11080,
                11081
            ],
            [
                10891,
                10894
            ],
            [
                10995,
                11049
            ],
            [
                11122,
                11125
            ],
            [
                11226,
                11293
            ],
            [
                11351,
                11352
            ],
            [
                11758,
                11790
            ],
            [
                11795,
                11816
            ],
            [
                11851,
                11875
            ],
            [
                11881,
                11897
            ],
            [
                11898,
                11911
            ],
            [
                11937,
                11939
            ],
            [
                11939,
                11955
            ],
            [
                12017,
                12019
            ],
            [
                12115,
                12165
            ],
            [
                12165,
                12167
            ],
            [
                12174,
                12177
            ],
            [
                12168,
                12173
            ],
            [
                12210,
                12219
            ],
            [
                12229,
                12337
            ],
            [
                12337,
                12424
            ],
            [
                12424,
                12475
            ],
            [
                12475,
                12505
            ],
            [
                12517,
                12524
            ],
            [
                12524,
                12543
            ],
            [
                12560,
                12603
            ],
            [
                12642,
                12644
            ],
            [
                12644,
                12674
            ],
            [
                12743,
                12753
            ],
            [
                12782,
                12798
            ],
            [
                12754,
                12777
            ],
            [
                12802,
                12815
            ],
            [
                12829,
                12842
            ],
            [
                12842,
                12889
            ],
            [
                12889,
                12914
            ],
            [
                12986,
                13015
            ],
            [
                13016,
                13020
            ],
            [
                13026,
                13035
            ],
            [
                13059,
                13088
            ],
            [
                13088,
                13129
            ],
            [
                13157,
                13164
            ],
            [
                13164,
                13165
            ],
            [
                13170,
                13197
            ],
            [
                13227,
                13230
            ],
            [
                13264,
                13302
            ],
            [
                13302,
                13307
            ],
            [
                13307,
                13314
            ],
            [
                13315,
                13387
            ],
            [
                13387,
                13399
            ],
            [
                13399,
                13481
            ],
            [
                13481,
                13482
            ],
            [
                13497,
                13503
            ],
            [
                13511,
                13559
            ],
            [
                13561,
                13598
            ],
            [
                13891,
                13894
            ],
            [
                13615,
                13621
            ],
            [
                13633,
                13651
            ],
            [
                13668,
                13672
            ],
            [
                13698,
                13702
            ],
            [
                13747,
                13783
            ],
            [
                13794,
                13811
            ],
            [
                13814,
                13834
            ],
            [
                13696,
                13697
            ],
            [
                13743,
                13746
            ],
            [
                13836,
                13883
            ],
            [
                13888,
                13890
            ],
            [
                13900,
                13904
            ],
            [
                13923,
                13925
            ],
            [
                14020,
                14022
            ],
            [
                14107,
                14130
            ],
            [
                14133,
                14142
            ],
            [
                14148,
                14174
            ],
            [
                14223,
                14232
            ],
            [
                14254,
                14292
            ],
            [
                14322,
                14380
            ],
            [
                14400,
                14410
            ],
            [
                14387,
                14398
            ],
            [
                14616,
                14672
            ],
            [
                14674,
                14722
            ],
            [
                14722,
                14784
            ],
            [
                14813,
                14815
            ],
            [
                14815,
                14829
            ],
            [
                14845,
                14865
            ],
            [
                14865,
                14888
            ],
            [
                14901,
                14907
            ],
            [
                14969,
                14972
            ],
            [
                14930,
                14968
            ],
            [
                15003,
                15005
            ],
            [
                15005,
                15028
            ],
            [
                15043,
                15045
            ],
            [
                15045,
                15067
            ],
            [
                15067,
                15104
            ],
            [
                15104,
                15129
            ],
            [
                15131,
                15167
            ],
            [
                15167,
                15174
            ],
            [
                15180,
                15218
            ],
            [
                15237,
                15288
            ],
            [
                15288,
                15294
            ],
            [
                15294,
                15307
            ],
            [
                15307,
                15355
            ],
            [
                15375,
                15425
            ],
            [
                15425,
                15451
            ],
            [
                15451,
                15487
            ],
            [
                15487,
                15514
            ],
            [
                15539,
                15540
            ],
            [
                15521,
                15523
            ],
            [
                15533,
                15539
            ],
            [
                15617,
                15657
            ],
            [
                15657,
                15674
            ],
            [
                15674,
                15687
            ],
            [
                15687,
                15698
            ],
            [
                15707,
                15717
            ],
            [
                15727,
                15791
            ],
            [
                15791,
                15811
            ],
            [
                15811,
                15855
            ],
            [
                15886,
                15891
            ],
            [
                15896,
                15902
            ],
            [
                16009,
                16011
            ],
            [
                15867,
                15875
            ],
            [
                15903,
                15914
            ],
            [
                15916,
                15944
            ],
            [
                15946,
                15997
            ],
            [
                16032,
                16065
            ],
            [
                16149,
                16183
            ],
            [
                16112,
                16115
            ],
            [
                16187,
                16196
            ],
            [
                16196,
                16197
            ],
            [
                16201,
                16208
            ],
            [
                16232,
                16251
            ],
            [
                16262,
                16264
            ],
            [
                16264,
                16285
            ],
            [
                16289,
                16314
            ],
            [
                16314,
                16319
            ],
            [
                16333,
                16361
            ],
            [
                16361,
                16369
            ],
            [
                16369,
                16415
            ],
            [
                16497,
                16540
            ],
            [
                16540,
                16629
            ],
            [
                16629,
                16718
            ],
            [
                16718,
                16738
            ],
            [
                16759,
                16760
            ],
            [
                16769,
                16779
            ],
            [
                16812,
                16817
            ],
            [
                16828,
                16859
            ],
            [
                16982,
                17025
            ],
            [
                17080,
                17082
            ],
            [
                17082,
                17107
            ],
            [
                17113,
                17134
            ],
            [
                17143,
                17193
            ],
            [
                17209,
                17211
            ],
            [
                17226,
                17243
            ],
            [
                17299,
                17302
            ],
            [
                17307,
                17345
            ],
            [
                17345,
                17400
            ],
            [
                17405,
                17416
            ],
            [
                17421,
                17458
            ],
            [
                17487,
                17510
            ],
            [
                17621,
                17624
            ],
            [
                17519,
                17528
            ],
            [
                17697,
                17698
            ],
            [
                17582,
                17610
            ],
            [
                17643,
                17678
            ],
            [
                17781,
                17784
            ],
            [
                17793,
                17809
            ],
            [
                17764,
                17767
            ],
            [
                17632,
                17636
            ],
            [
                17891,
                17893
            ],
            [
                17893,
                17907
            ],
            [
                17922,
                17925
            ],
            [
                17925,
                17976
            ],
            [
                18031,
                18040
            ],
            [
                17995,
                18009
            ],
            [
                18047,
                18049
            ],
            [
                18049,
                18062
            ],
            [
                18062,
                18126
            ],
            [
                18126,
                18167
            ],
            [
                18185,
                18200
            ],
            [
                18200,
                18208
            ],
            [
                18215,
                18249
            ],
            [
                18262,
                18302
            ],
            [
                18318,
                18331
            ],
            [
                18311,
                18318
            ],
            [
                18336,
                18368
            ],
            [
                18384,
                18404
            ],
            [
                18404,
                18438
            ],
            [
                18439,
                18446
            ],
            [
                18454,
                18474
            ]
        ],
        "row_chars": [
            [
                0,
                378
            ],
            [
                378,
                1268
            ],
            [
                1268,
                1290
            ],
            [
                1290,
                1381
            ],
            [
                1381,
                1951
            ],
            [
                1951,
                2085
            ],
            [
                2085,
                2238
            ],
            [
                2238,
                2345
            ],
            [
                2345,
                2581
            ],
            [
                2581,
                2649
            ],
            [
                2649,
                2751
            ],
            [
                2751,
                2778
            ],
            [
                2778,
                2800
            ],
            [
                2800,
                2984
            ],
            [
                2984,
                3055
            ],
            [
                3055,
                3083
            ],
            [
                3083,
                3283
            ],
            [
                3283,
                3386
            ],
            [
                3386,
                3407
            ],
            [
                3407,
                3560
            ],
            [
                3560,
                3738
            ],
            [
                3738,
                3758
            ],
            [
                3758,
                3792
            ],
            [
                3792,
                3826
            ],
            [
                3826,
                3832
            ],
            [
                3832,
                3875
            ],
            [
                3875,
                4031
            ],
            [
                4031,
                4329
            ],
            [
                4329,
                4370
            ],
            [
                4370,
                4391
            ],
            [
                4391,
                4413
            ],
            [
                4413,
                4524
            ],
            [
                4524,
                4729
            ],
            [
                4729,
                4807
            ],
            [
                4807,
                4842
            ],
            [
                4842,
                4939
            ],
            [
                4939,
                5110
            ],
            [
                5110,
                5188
            ],
            [
                5188,
                5448
            ],
            [
                5448,
                5600
            ],
            [
                5600,
                5687
            ],
            [
                5687,
                5735
            ],
            [
                5735,
                5751
            ],
            [
                5751,
                5761
            ],
            [
                5761,
                5805
            ],
            [
                5805,
                5897
            ],
            [
                5897,
                5922
            ],
            [
                5922,
                6019
            ],
            [
                6019,
                6052
            ],
            [
                6052,
                6193
            ],
            [
                6193,
                6314
            ],
            [
                6314,
                6521
            ],
            [
                6521,
                6564
            ],
            [
                6564,
                6618
            ],
            [
                6618,
                6743
            ],
            [
                6743,
                6796
            ],
            [
                6796,
                7138
            ],
            [
                7138,
                7221
            ],
            [
                7221,
                7284
            ],
            [
                7284,
                7370
            ],
            [
                7370,
                7463
            ],
            [
                7463,
                7859
            ],
            [
                7859,
                8705
            ],
            [
                8705,
                8886
            ],
            [
                8886,
                8987
            ],
            [
                8987,
                9023
            ],
            [
                9023,
                9074
            ],
            [
                9074,
                9121
            ],
            [
                9121,
                9182
            ],
            [
                9182,
                9324
            ],
            [
                9324,
                9696
            ],
            [
                9696,
                9915
            ],
            [
                9915,
                10103
            ],
            [
                10103,
                10153
            ],
            [
                10153,
                10219
            ],
            [
                10219,
                10331
            ],
            [
                10331,
                10402
            ],
            [
                10402,
                10505
            ],
            [
                10505,
                10834
            ],
            [
                10834,
                11353
            ],
            [
                11353,
                11515
            ],
            [
                11515,
                11758
            ],
            [
                11758,
                11939
            ],
            [
                11939,
                12165
            ],
            [
                12165,
                12337
            ],
            [
                12337,
                12424
            ],
            [
                12424,
                12475
            ],
            [
                12475,
                12524
            ],
            [
                12524,
                12644
            ],
            [
                12644,
                12674
            ],
            [
                12674,
                12728
            ],
            [
                12728,
                12743
            ],
            [
                12743,
                12842
            ],
            [
                12842,
                12889
            ],
            [
                12889,
                13088
            ],
            [
                13088,
                13164
            ],
            [
                13164,
                13197
            ],
            [
                13197,
                13302
            ],
            [
                13302,
                13307
            ],
            [
                13307,
                13387
            ],
            [
                13387,
                13399
            ],
            [
                13399,
                13481
            ],
            [
                13481,
                13598
            ],
            [
                13598,
                14022
            ],
            [
                14022,
                14107
            ],
            [
                14107,
                14380
            ],
            [
                14380,
                14387
            ],
            [
                14387,
                14412
            ],
            [
                14412,
                14467
            ],
            [
                14467,
                14616
            ],
            [
                14616,
                14722
            ],
            [
                14722,
                14815
            ],
            [
                14815,
                14865
            ],
            [
                14865,
                15005
            ],
            [
                15005,
                15045
            ],
            [
                15045,
                15067
            ],
            [
                15067,
                15104
            ],
            [
                15104,
                15167
            ],
            [
                15167,
                15288
            ],
            [
                15288,
                15294
            ],
            [
                15294,
                15307
            ],
            [
                15307,
                15425
            ],
            [
                15425,
                15451
            ],
            [
                15451,
                15487
            ],
            [
                15487,
                15657
            ],
            [
                15657,
                15674
            ],
            [
                15674,
                15687
            ],
            [
                15687,
                15791
            ],
            [
                15791,
                15811
            ],
            [
                15811,
                15855
            ],
            [
                15855,
                16017
            ],
            [
                16017,
                16032
            ],
            [
                16032,
                16066
            ],
            [
                16066,
                16092
            ],
            [
                16092,
                16196
            ],
            [
                16196,
                16264
            ],
            [
                16264,
                16314
            ],
            [
                16314,
                16361
            ],
            [
                16361,
                16369
            ],
            [
                16369,
                16540
            ],
            [
                16540,
                16629
            ],
            [
                16629,
                16718
            ],
            [
                16718,
                16860
            ],
            [
                16860,
                16982
            ],
            [
                16982,
                17082
            ],
            [
                17082,
                17345
            ],
            [
                17345,
                17893
            ],
            [
                17893,
                17925
            ],
            [
                17925,
                18049
            ],
            [
                18049,
                18062
            ],
            [
                18062,
                18126
            ],
            [
                18126,
                18200
            ],
            [
                18200,
                18404
            ],
            [
                18404,
                18474
            ]
        ]
    },
    "abridged": {
        "text": "The day after the meeting at the play-table, Jos arrayed himself with unusual care and splendour. Without saying a word to any of his family about the events of the previous night, he went out early, and made for the Elephant Hotel. Because of the festivities, the hotel was full. Mr. Jos made inquiries in clumsy German, and was directed to the very top of the house, past the rooms where travelling pedlars, tumblers, bagmen, students and small tradesmen lived. Here Becky had a little nest - as dirty a little refuge as ever beauty lay hid in.\nBecky liked the life. She was at home with pedlars, tumblers, students and all. She had inherited a wild, roving nature: the din, the stir, the drink, the smoke, the songs and swagger of the students, and the general buzz and hum of the place pleased the little woman, even when her luck was down and she could not pay her bill. How pleasant was the bustle to her now that her purse was full of the money which little Georgy had won for her the night before!\nAs Jos came creaking and puffing up the final stairs, and began to wipe his face and look for No. 92, the door of the opposite chamber, No. 90, was open. A student was lying on the bed smoking a long pipe; whilst another student in long yellow hair and a braided coat was actually on his knees at No. 92, bawling through the keyhole.\n\"Go away,\" said a well-known voice from within, which made Jos thrill. \"I am expecting somebody; my grandpapa. He mustn't see you there.\"\n\"Angel Englanderinn!\" bellowed the kneeling student, \"do dine with us at the inn in the park. We will have roast pheasants and porter. We shall die if you don't.\"\n\"That we will,\" said the young nobleman on the bed. Jos overheard all this, though he did not understand the German they spoke.\nAs he approached, the student started up, and bounced into his own room, where Jos heard him laughing with his comrade.\nJos was standing disconcerted when the door of 92 opened and Becky's little head peeped out full of archness and mischief.\n\"It's you,\" she said, coming out. \"How I have been waiting for you! Stop! not yet - in one minute you shall come in.\" In that instant she put a rouge-pot, a brandy bottle, and a plate of broken meat into the bed, smoothed her hair, and finally let in her visitor.\nShe wore a pink domino, a trifle faded and soiled; but her arms shone out from the loose sleeves very white and fair, and it was tied round her waist so as to set off her trim little figure. She led Jos by the hand into her garret.\n\"Come in,\" she said. \"Come and talk to me. Sit yonder on the chair;\" and she gave his hand a little squeeze. She placed herself on the bed - not on the bottle and plate, you may be sure - and there she sat and talked with her old admirer.\n\"How little the years have changed you,\" she said with a look of tender interest. \"I should have known you anywhere. What a comfort it is amongst strangers to see once more the frank honest face of an old friend!\"\nThe frank honest face, to tell the truth, at this moment bore any expression but one of openness and honesty: it was, on the contrary, much perturbed. Jos was surveying the queer little apartment in which he found his old flame. One of her gowns hung over the bed, with another on the hook of the door; her bonnet obscured half the looking-glass, on which lay the prettiest little pair of bronze boots; a French novel was on the bedside table.\n\"I should have known you anywhere,\" she continued; \"a woman never forgets some things. And you were the first man I ever - I ever saw.\"\n\"Was I really?\" said Jos. \"God bless my soul, you don't say so.\"\n\"When I came with your sister from Chiswick, I was scarcely more than a child,\" Becky said. \"How is that dear girl? Oh, her husband was a sad wicked man, and the poor dear was jealous of me. As if I cared about him! when there was somebody - but no - don't let us talk of old times.\" She passed her handkerchief of tattered lace across her eyelids.\n\"Is not this a strange place,\" she continued, \"for a woman who has lived in a very different world? I have had so many griefs and wrongs, Joseph Sedley; I have been made to suffer so cruelly that I can't stay still in any place, but wander about restless and unhappy. All my friends have been false to me - all. There is no such thing as an honest man in the world. I was the truest wife that ever lived, though I married my husband out of pique, because somebody else - but never mind that. I was true to my husband, and he trampled upon me and deserted me. I was the fondest mother to my darling child, my hope and joy; and they - they tore it from me.\" She put her hand to her heart with a passionate gesture of despair, burying her face for a moment on the bed.\nThe brandy-bottle inside clinked up against the plate. Both were moved, no doubt, by her grief. Jos was a good deal frightened and affected at seeing her in this condition. She began to tell her story - a tale so neat, simple, and artless that it was quite evident that a white-robed angel escaped from heaven was before Jos - on the bed, sitting on the brandy-bottle.\nThey had a very long, amicable and confidential talk, during which Jos Sedley was somehow made aware that Becky's heart had first learned to beat at his enchanting presence; that George Osborne had certainly paid court to Becky, but that she never gave him the least encouragement, and that she had never ceased to think about Jos from the very first day she had seen him, though, of course, her duties as a married woman were paramount - duties which she would preserve to her dying day, or until the bad climate in which Colonel Crawley was living should release her from a marriage that his cruelty had made odious.\nJos went away convinced that she was the most virtuous and fascinating of women, and considering all sorts of benevolent schemes for her welfare. She ought to return to society. She must quit that place and take a quiet lodging. Amelia must come and befriend her. He would go and see to it, and consult with the Major. She wept tears of heart-felt gratitude as she parted from him, and the gallant stout gentleman stooped to kiss her hand.\nSo Becky bowed Jos out of her little garret with as much grace as if it was a palace; and when he had disappeared down the stairs, the students came out of their hole, and she amused herself by mimicking Jos to them as she munched her cold bread and sausage and drank her favourite brandy-and-water.\nJos walked over to Dobbin's lodgings and there solemnly told him Becky's affecting history, without, however, mentioning the business of the night before. And the two gentlemen laid their heads together and consulted about how to be useful to Mrs. Becky.\nAs for Mrs. Amelia, she was a woman of such a soft and foolish disposition that when she heard of anybody unhappy, her heart straightway melted. If she begged pardon of all her servants for troubling them to answer the bell - and apologized to a shopboy who showed her a piece of silk - the idea that an old acquaintance was miserable was sure to soften her heart.\nWhen the Major heard from Jos of his sentimental adventure, he was not, it must be confessed, nearly as much pleased and interested as Joseph was. On the contrary, he said, \"The little minx, has she come to light again?\" He had never liked Becky, but had mistrusted her from the very first moment when her green eyes had looked at, and turned away from, his own.\n\"That little devil brings mischief wherever she goes,\" the Major said disrespectfully. \"Who knows what sort of life she has been leading? And what business has she here alone? Don't tell me about enemies; an honest woman always has friends. Why has she left her husband? I remember the way in which the confounded blackleg used to cheat poor George. Wasn't there a scandal about their separation? I think I heard something.\" Jos tried in vain to convince him that Becky was an injured and virtuous female.\n\"Well, well; let's ask Mrs. George,\" said the Major. \"Let us go and consult her. She knows what is right in such matters.\"\n\"Hm! Emmy is all very well,\" said Jos, who did not happen to be in love with his sister.\n\"Very well? By Gad, sir, she's the finest lady I ever met in my life,\" bounced out the Major. \"Let us ask her if this woman ought to be visited or not - I will be content with her verdict.\" The artful Major was thinking that Emmy had been deservedly jealous of Rebecca, never mentioning her name but with shrinking and terror. And a jealous woman never forgives, thought Dobbin: so they went to ask her.\n\"Amelia, my dear,\" said Jos, \"I have had the most extraordinary adventure - a most interesting old friend of yours has just arrived here, and I should like you to see her.\"\n\"Who is it?\" said Amelia.\n\"It is a woman whom I dislike very much,\" said the Major doggedly, \"and whom you have no cause to love.\"\n\"It is Rebecca, I'm sure it is Rebecca,\" Amelia said, blushing.\n\"You are right,\" Dobbin answered. Brussels, Waterloo, old griefs and memories rushed back into Amelia's gentle heart.\n\"Don't let me see her,\" she said. \"I couldn't see her.\"\n\"I told you so,\" Dobbin said to Jos.\n\"She is very unhappy, and - and that sort of thing,\" Jos urged. \"She is poor and unprotected, and has been ill - and that scoundrel of a husband has deserted her.\"\n\"Ah!\" said Amelia.\n\"She hasn't a friend in the world,\" Jos went on, \"and she said she thought she might trust in you. She's so miserable, Emmy. She has been almost mad with grief. Her story quite affected me, upon my honour - her family has been most cruel to her.\"\n\"Poor creature!\" Amelia said.\n\"And if she has no friend, she thinks she'll die,\" Jos proceeded in a low tremulous voice. \"God bless my soul! do you know that she tried to kill herself? I saw a bottle of laudanum in her room - such a miserable little room - at a third-rate house, the Elephant, up in the roof.\"\nThis did not seem to affect Emmy.\n\"She's beside herself with grief,\" Jos resumed. \"Her agonies are quite frightful. She had a little boy, the same age as Georgy.\"\n\"Yes, I remember,\" Emmy remarked. \"Well?\"\n\"The most beautiful child ever seen,\" Jos said; \"a perfect angel, who adored his mother. The ruffians tore him shrieking out of her arms, and have never allowed him to see her.\"\n\"Dear Joseph,\" Emmy cried out, starting up at once, \"let us go and see her this minute.\" And she ran into her room, fetched her bonnet and shawl, and ordered Dobbin to follow. He saw there was nothing for it but to obey.\n\"It is number 92, up four flights of stairs,\" Jos said, not very willing to ascend the steps again; but he stood in his drawing-room, and watched the pair marching through the market.\nIt was as well that Becky saw them too from her garret, where she and the students were chattering and laughing about the appearance of her grandpapa. She had time to dismiss them before the landlord of the Elephant led Amelia up the stairs to her room.\n\"Gracious lady!\" said the landlord, knocking at Becky's door; he had not been so courteous the day before.\n\"Who is it?\" Becky said, putting out her head, and she gave a little scream. There stood Emmy in a tremble, and Dobbin with his cane.\nHe stood watching, and very much interested; but Emmy sprang forward with open arms, and forgave Rebecca at that moment, and embraced her with all her heart. Ah, poor wretch, when was your lip ever pressed by such pure kisses?",
        "paragraph_chars": [
            [
                0,
                547
            ],
            [
                547,
                1006
            ],
            [
                1006,
                1340
            ],
            [
                1340,
                1478
            ],
            [
                1478,
                1641
            ],
            [
                1641,
                1769
            ],
            [
                1769,
                1889
            ],
            [
                1889,
                2012
            ],
            [
                2012,
                2276
            ],
            [
                2276,
                2508
            ],
            [
                2508,
                2747
            ],
            [
                2747,
                2961
            ],
            [
                2961,
                3405
            ],
            [
                3405,
                3541
            ],
            [
                3541,
                3606
            ],
            [
                3606,
                3955
            ],
            [
                3955,
                4721
            ],
            [
                4721,
                5090
            ],
            [
                5090,
                5709
            ],
            [
                5709,
                6149
            ],
            [
                6149,
                6449
            ],
            [
                6449,
                6704
            ],
            [
                6704,
                7069
            ],
            [
                7069,
                7432
            ],
            [
                7432,
                7938
            ],
            [
                7938,
                8061
            ],
            [
                8061,
                8150
            ],
            [
                8150,
                8554
            ],
            [
                8554,
                8727
            ],
            [
                8727,
                8753
            ],
            [
                8753,
                8858
            ],
            [
                8858,
                8922
            ],
            [
                8922,
                9040
            ],
            [
                9040,
                9096
            ],
            [
                9096,
                9133
            ],
            [
                9133,
                9297
            ],
            [
                9297,
                9316
            ],
            [
                9316,
                9563
            ],
            [
                9563,
                9593
            ],
            [
                9593,
                9874
            ],
            [
                9874,
                9908
            ],
            [
                9908,
                10037
            ],
            [
                10037,
                10079
            ],
            [
                10079,
                10257
            ],
            [
                10257,
                10478
            ],
            [
                10478,
                10662
            ],
            [
                10662,
                10916
            ],
            [
                10916,
                11023
            ],
            [
                11023,
                11157
            ],
            [
                11157,
                11383
            ]
        ],
        "segment_chars": [
            [
                0,
                98
            ],
            [
                98,
                233
            ],
            [
                233,
                281
            ],
            [
                281,
                464
            ],
            [
                464,
                547
            ],
            [
                547,
                569
            ],
            [
                569,
                627
            ],
            [
                627,
                876
            ],
            [
                876,
                1006
            ],
            [
                1006,
                1104
            ],
            [
                1104,
                1146
            ],
            [
                1146,
                1160
            ],
            [
                1160,
                1307
            ],
            [
                1307,
                1340
            ],
            [
                1340,
                1411
            ],
            [
                1411,
                1451
            ],
            [
                1451,
                1478
            ],
            [
                1478,
                1500
            ],
            [
                1500,
                1572
            ],
            [
                1572,
                1613
            ],
            [
                1613,
                1641
            ],
            [
                1641,
                1693
            ],
            [
                1693,
                1769
            ],
            [
                1769,
                1889
            ],
            [
                1889,
                2012
            ],
            [
                2012,
                2046
            ],
            [
                2046,
                2080
            ],
            [
                2080,
                2086
            ],
            [
                2086,
                2130
            ],
            [
                2130,
                2276
            ],
            [
                2276,
                2467
            ],
            [
                2467,
                2508
            ],
            [
                2508,
                2529
            ],
            [
                2529,
                2551
            ],
            [
                2551,
                2617
            ],
            [
                2617,
                2747
            ],
            [
                2747,
                2829
            ],
            [
                2829,
                2864
            ],
            [
                2864,
                2961
            ],
            [
                2961,
                3112
            ],
            [
                3112,
                3190
            ],
            [
                3190,
                3405
            ],
            [
                3405,
                3492
            ],
            [
                3492,
                3541
            ],
            [
                3541,
                3557
            ],
            [
                3557,
                3567
            ],
            [
                3567,
                3606
            ],
            [
                3606,
                3698
            ],
            [
                3698,
                3722
            ],
            [
                3722,
                3797
            ],
            [
                3797,
                3822
            ],
            [
                3822,
                3890
            ],
            [
                3890,
                3955
            ],
            [
                3955,
                4055
            ],
            [
                4055,
                4223
            ],
            [
                4223,
                4267
            ],
            [
                4267,
                4321
            ],
            [
                4321,
                4447
            ],
            [
                4447,
                4514
            ],
            [
                4514,
                4611
            ],
            [
                4611,
                4721
            ],
            [
                4721,
                4776
            ],
            [
                4776,
                4817
            ],
            [
                4817,
                4894
            ],
            [
                4894,
                5090
            ],
            [
                5090,
                5709
            ],
            [
                5709,
                5855
            ],
            [
                5855,
                5887
            ],
            [
                5887,
                5938
            ],
            [
                5938,
                5973
            ],
            [
                5973,
                6028
            ],
            [
                6028,
                6149
            ],
            [
                6149,
                6449
            ],
            [
                6449,
                6604
            ],
            [
                6604,
                6704
            ],
            [
                6704,
                6849
            ],
            [
                6849,
                7069
            ],
            [
                7069,
                7216
            ],
            [
                7216,
                7290
            ],
            [
                7290,
                7432
            ],
            [
                7432,
                7519
            ],
            [
                7519,
                7570
            ],
            [
                7570,
                7608
            ],
            [
                7608,
                7673
            ],
            [
                7673,
                7703
            ],
            [
                7703,
                7782
            ],
            [
                7782,
                7829
            ],
            [
                7829,
                7857
            ],
            [
                7857,
                7938
            ],
            [
                7938,
                7991
            ],
            [
                7991,
                8019
            ],
            [
                8019,
                8061
            ],
            [
                8061,
                8066
            ],
            [
                8066,
                8150
            ],
            [
                8150,
                8162
            ],
            [
                8162,
                8244
            ],
            [
                8244,
                8340
            ],
            [
                8340,
                8477
            ],
            [
                8477,
                8554
            ],
            [
                8554,
                8727
            ],
            [
                8727,
                8740
            ],
            [
                8740,
                8753
            ],
            [
                8753,
                8858
            ],
            [
                8858,
                8922
            ],
            [
                8922,
                8956
            ],
            [
                8956,
                9040
            ],
            [
                9040,
                9074
            ],
            [
                9074,
                9096
            ],
            [
                9096,
                9133
            ],
            [
                9133,
                9197
            ],
            [
                9197,
                9297
            ],
            [
                9297,
                9303
            ],
            [
                9303,
                9316
            ],
            [
                9316,
                9415
            ],
            [
                9415,
                9441
            ],
            [
                9441,
                9477
            ],
            [
                9477,
                9563
            ],
            [
                9563,
                9580
            ],
            [
                9580,
                9593
            ],
            [
                9593,
                9684
            ],
            [
                9684,
                9704
            ],
            [
                9704,
                9748
            ],
            [
                9748,
                9874
            ],
            [
                9874,
                9908
            ],
            [
                9908,
                9956
            ],
            [
                9956,
                9990
            ],
            [
                9990,
                10037
            ],
            [
                10037,
                10071
            ],
            [
                10071,
                10079
            ],
            [
                10079,
                10168
            ],
            [
                10168,
                10257
            ],
            [
                10257,
                10346
            ],
            [
                10346,
                10433
            ],
            [
                10433,
                10478
            ],
            [
                10478,
                10662
            ],
            [
                10662,
                10813
            ],
            [
                10813,
                10916
            ],
            [
                10916,
                10933
            ],
            [
                10933,
                11023
            ],
            [
                11023,
                11036
            ],
            [
                11036,
                11100
            ],
            [
                11100,
                11157
            ],
            [
                11157,
                11315
            ],
            [
                11315,
                11383
            ]
        ],
        "overlap_chars": [
            [
                0,
                48
            ],
            [
                49,
                56
            ],
            [
                57,
                64
            ],
            [
                65,
                96
            ],
            [
                98,
                105
            ],
            [
                113,
                126
            ],
            [
                127,
                140
            ],
            [
                147,
                150
            ],
            [
                158,
                180
            ],
            [
                181,
                183
            ],
            [
                193,
                198
            ],
            [
                198,
                203
            ],
            [
                209,
                212
            ],
            [
                213,
                233
            ],
            [
                241,
                247
            ],
            [
                259,
                264
            ],
            [
                271,
                279
            ],
            [
                281,
                288
            ],
            [
                289,
                303
            ],
            [
                304,
                306
            ],
            [
                307,
                321
            ],
            [
                322,
                325
            ],
            [
                326,
                368
            ],
            [
                374,
                377
            ],
            [
                378,
                389
            ],
            [
                390,
                408
            ],
            [
                408,
                409
            ],
            [
                410,
                418
            ],
            [
                418,
                427
            ],
            [
                428,
                436
            ],
            [
                437,
                440
            ],
            [
                441,
                456
            ],
            [
                457,
                462
            ],
            [
                469,
                478
            ],
            [
                479,
                492
            ],
            [
                493,
                494
            ],
            [
                495,
                547
            ],
            [
                547,
                569
            ],
            [
                569,
                589
            ],
            [
                590,
                597
            ],
            [
                597,
                627
            ],
            [
                627,
                630
            ],
            [
                631,
                634
            ],
            [
                635,
                644
            ],
            [
                645,
                666
            ],
            [
                668,
                707
            ],
            [
                707,
                789
            ],
            [
                790,
                797
            ],
            [
                798,
                851
            ],
            [
                858,
                861
            ],
            [
                862,
                876
            ],
            [
                876,
                892
            ],
            [
                893,
                1006
            ],
            [
                1006,
                1063
            ],
            [
                1064,
                1090
            ],
            [
                1091,
                1104
            ],
            [
                1104,
                1106
            ],
            [
                1106,
                1146
            ],
            [
                1146,
                1158
            ],
            [
                1160,
                1169
            ],
            [
                1170,
                1273
            ],
            [
                1274,
                1307
            ],
            [
                1307,
                1338
            ],
            [
                1338,
                1340
            ],
            [
                1340,
                1374
            ],
            [
                1386,
                1409
            ],
            [
                1411,
                1413
            ],
            [
                1427,
                1436
            ],
            [
                1437,
                1451
            ],
            [
                1451,
                1478
            ],
            [
                1478,
                1500
            ],
            [
                1500,
                1529
            ],
            [
                1529,
                1534
            ],
            [
                1535,
                1544
            ],
            [
                1545,
                1547
            ],
            [
                1548,
                1572
            ],
            [
                1572,
                1611
            ],
            [
                1611,
                1613
            ],
            [
                1613,
                1641
            ],
            [
                1641,
                1691
            ],
            [
                1693,
                1706
            ],
            [
                1711,
                1715
            ],
            [
                1715,
                1734
            ],
            [
                1746,
                1749
            ],
            [
                1767,
                1769
            ],
            [
                1772,
                1774
            ],
            [
                1785,
                1786
            ],
            [
                1787,
                1798
            ],
            [
                1807,
                1814
            ],
            [
                1815,
                1841
            ],
            [
                1842,
                1887
            ],
            [
                1887,
                1889
            ],
            [
                1893,
                1905
            ],
            [
                1906,
                1918
            ],
            [
                1919,
                1935
            ],
            [
                1936,
                1945
            ],
            [
                1946,
                2011
            ],
            [
                2012,
                2046
            ],
            [
                2046,
                2080
            ],
            [
                2080,
                2086
            ],
            [
                2086,
                2093
            ],
            [
                2096,
                2130
            ],
            [
                2130,
                2224
            ],
            [
                2234,
                2276
            ],
            [
                2276,
                2279
            ],
            [
                2285,
                2325
            ],
            [
                2325,
                2372
            ],
            [
                2373,
                2419
            ],
            [
                2420,
                2431
            ],
            [
                2432,
                2442
            ],
            [
                2447,
                2465
            ],
            [
                2465,
                2467
            ],
            [
                2467,
                2507
            ],
            [
                2508,
                2529
            ],
            [
                2529,
                2551
            ],
            [
                2551,
                2574
            ],
            [
                2577,
                2589
            ],
            [
                2594,
                2615
            ],
            [
                2615,
                2617
            ],
            [
                2617,
                2646
            ],
            [
                2649,
                2693
            ],
            [
                2696,
                2699
            ],
            [
                2700,
                2746
            ],
            [
                2747,
                2758
            ],
            [
                2763,
                2829
            ],
            [
                2829,
                2864
            ],
            [
                2864,
                2961
            ],
            [
                2961,
                3110
            ],
            [
                3110,
                3112
            ],
            [
                3112,
                3190
            ],
            [
                3190,
                3225
            ],
            [
                3226,
                3230
            ],
            [
                3231,
                3238
            ],
            [
                3242,
                3245
            ],
            [
                3246,
                3316
            ],
            [
                3317,
                3389
            ],
            [
                3390,
                3397
            ],
            [
                3398,
                3403
            ],
            [
                3403,
                3404
            ],
            [
                3405,
                3492
            ],
            [
                3492,
                3525
            ],
            [
                3528,
                3541
            ],
            [
                3541,
                3557
            ],
            [
                3557,
                3567
            ],
            [
                3567,
                3590
            ],
            [
                3591,
                3606
            ],
            [
                3606,
                3698
            ],
            [
                3698,
                3710
            ],
            [
                3711,
                3715
            ],
            [
                3720,
                3722
            ],
            [
                3722,
                3763
            ],
            [
                3764,
                3789
            ],
            [
                3790,
                3795
            ],
            [
                3795,
                3797
            ],
            [
                3797,
                3820
            ],
            [
                3820,
                3822
            ],
            [
                3822,
                3845
            ],
            [
                3848,
                3854
            ],
            [
                3857,
                3887
            ],
            [
                3890,
                3917
            ],
            [
                3921,
                3955
            ],
            [
                3955,
                4013
            ],
            [
                4014,
                4053
            ],
            [
                4053,
                4055
            ],
            [
                4055,
                4152
            ],
            [
                4153,
                4200
            ],
            [
                4201,
                4223
            ],
            [
                4223,
                4259
            ],
            [
                4262,
                4267
            ],
            [
                4267,
                4321
            ],
            [
                4321,
                4423
            ],
            [
                4426,
                4447
            ],
            [
                4447,
                4457
            ],
            [
                4471,
                4514
            ],
            [
                4514,
                4538
            ],
            [
                4539,
                4544
            ],
            [
                4545,
                4552
            ],
            [
                4553,
                4559
            ],
            [
                4560,
                4562
            ],
            [
                4563,
                4567
            ],
            [
                4568,
                4571
            ],
            [
                4572,
                4575
            ],
            [
                4575,
                4585
            ],
            [
                4588,
                4608
            ],
            [
                4611,
                4721
            ],
            [
                4721,
                4774
            ],
            [
                4774,
                4776
            ],
            [
                4776,
                4805
            ],
            [
                4810,
                4817
            ],
            [
                4817,
                4820
            ],
            [
                4821,
                4870
            ],
            [
                4875,
                4894
            ],
            [
                4894,
                4903
            ],
            [
                4904,
                4921
            ],
            [
                4924,
                4985
            ],
            [
                4986,
                4990
            ],
            [
                4991,
                5030
            ],
            [
                5031,
                5034
            ],
            [
                5035,
                5045
            ],
            [
                5048,
                5090
            ],
            [
                5090,
                5120
            ],
            [
                5121,
                5142
            ],
            [
                5142,
                5143
            ],
            [
                5151,
                5190
            ],
            [
                5191,
                5302
            ],
            [
                5303,
                5311
            ],
            [
                5312,
                5317
            ],
            [
                5317,
                5318
            ],
            [
                5319,
                5327
            ],
            [
                5332,
                5342
            ],
            [
                5343,
                5346
            ],
            [
                5347,
                5370
            ],
            [
                5370,
                5526
            ],
            [
                5536,
                5545
            ],
            [
                5546,
                5551
            ],
            [
                5561,
                5591
            ],
            [
                5592,
                5665
            ],
            [
                5675,
                5679
            ],
            [
                5680,
                5695
            ],
            [
                5701,
                5707
            ],
            [
                5707,
                5709
            ],
            [
                5709,
                5722
            ],
            [
                5723,
                5763
            ],
            [
                5768,
                5793
            ],
            [
                5806,
                5855
            ],
            [
                5855,
                5877
            ],
            [
                5878,
                5885
            ],
            [
                5885,
                5887
            ],
            [
                5887,
                5938
            ],
            [
                5938,
                5958
            ],
            [
                5959,
                5973
            ],
            [
                5973,
                5988
            ],
            [
                5996,
                6028
            ],
            [
                6028,
                6094
            ],
            [
                6095,
                6130
            ],
            [
                6131,
                6138
            ],
            [
                6143,
                6147
            ],
            [
                6147,
                6149
            ],
            [
                6149,
                6233
            ],
            [
                6233,
                6238
            ],
            [
                6251,
                6279
            ],
            [
                6280,
                6283
            ],
            [
                6293,
                6315
            ],
            [
                6315,
                6410
            ],
            [
                6417,
                6449
            ],
            [
                6449,
                6485
            ],
            [
                6486,
                6495
            ],
            [
                6496,
                6502
            ],
            [
                6510,
                6513
            ],
            [
                6522,
                6539
            ],
            [
                6539,
                6573
            ],
            [
                6574,
                6604
            ],
            [
                6604,
                6625
            ],
            [
                6631,
                6655
            ],
            [
                6676,
                6678
            ],
            [
                6682,
                6702
            ],
            [
                6702,
                6704
            ],
            [
                6704,
                6847
            ],
            [
                6847,
                6849
            ],
            [
                6849,
                6927
            ],
            [
                6928,
                6929
            ],
            [
                6930,
                6933
            ],
            [
                6934,
                6988
            ],
            [
                6991,
                6994
            ],
            [
                7000,
                7067
            ],
            [
                7067,
                7068
            ],
            [
                7069,
                7101
            ],
            [
                7106,
                7127
            ],
            [
                7127,
                7151
            ],
            [
                7161,
                7177
            ],
            [
                7190,
                7203
            ],
            [
                7214,
                7216
            ],
            [
                7216,
                7232
            ],
            [
                7233,
                7235
            ],
            [
                7240,
                7290
            ],
            [
                7290,
                7292
            ],
            [
                7293,
                7296
            ],
            [
                7297,
                7302
            ],
            [
                7314,
                7323
            ],
            [
                7324,
                7432
            ],
            [
                7432,
                7519
            ],
            [
                7519,
                7570
            ],
            [
                7570,
                7600
            ],
            [
                7601,
                7608
            ],
            [
                7608,
                7627
            ],
            [
                7628,
                7671
            ],
            [
                7671,
                7673
            ],
            [
                7673,
                7703
            ],
            [
                7703,
                7713
            ],
            [
                7714,
                7730
            ],
            [
                7731,
                7754
            ],
            [
                7755,
                7768
            ],
            [
                7769,
                7782
            ],
            [
                7782,
                7829
            ],
            [
                7829,
                7854
            ],
            [
                7857,
                7886
            ],
            [
                7891,
                7895
            ],
            [
                7896,
                7905
            ],
            [
                7909,
                7938
            ],
            [
                7938,
                7979
            ],
            [
                7984,
                7991
            ],
            [
                7991,
                7992
            ],
            [
                7992,
                8019
            ],
            [
                8019,
                8022
            ],
            [
                8023,
                8061
            ],
            [
                8061,
                8066
            ],
            [
                8066,
                8073
            ],
            [
                8078,
                8150
            ],
            [
                8150,
                8162
            ],
            [
                8162,
                8244
            ],
            [
                8244,
                8245
            ],
            [
                8245,
                8251
            ],
            [
                8252,
                8300
            ],
            [
                8303,
                8340
            ],
            [
                8340,
                8343
            ],
            [
                8344,
                8350
            ],
            [
                8351,
                8369
            ],
            [
                8370,
                8374
            ],
            [
                8375,
                8379
            ],
            [
                8389,
                8425
            ],
            [
                8437,
                8454
            ],
            [
                8455,
                8475
            ],
            [
                8475,
                8476
            ],
            [
                8477,
                8480
            ],
            [
                8481,
                8528
            ],
            [
                8529,
                8531
            ],
            [
                8537,
                8541
            ],
            [
                8542,
                8544
            ],
            [
                8552,
                8554
            ],
            [
                8554,
                8577
            ],
            [
                8581,
                8590
            ],
            [
                8591,
                8617
            ],
            [
                8618,
                8627
            ],
            [
                8630,
                8668
            ],
            [
                8669,
                8727
            ],
            [
                8727,
                8737
            ],
            [
                8740,
                8751
            ],
            [
                8753,
                8809
            ],
            [
                8810,
                8858
            ],
            [
                8858,
                8920
            ],
            [
                8920,
                8922
            ],
            [
                8922,
                8936
            ],
            [
                8936,
                8956
            ],
            [
                8956,
                8979
            ],
            [
                8980,
                8986
            ],
            [
                8987,
                8990
            ],
            [
                9000,
                9038
            ],
            [
                9038,
                9040
            ],
            [
                9040,
                9063
            ],
            [
                9072,
                9074
            ],
            [
                9074,
                9096
            ],
            [
                9096,
                9133
            ],
            [
                9133,
                9158
            ],
            [
                9161,
                9197
            ],
            [
                9197,
                9204
            ],
            [
                9205,
                9243
            ],
            [
                9246,
                9297
            ],
            [
                9297,
                9303
            ],
            [
                9303,
                9316
            ],
            [
                9316,
                9364
            ],
            [
                9365,
                9415
            ],
            [
                9415,
                9441
            ],
            [
                9441,
                9477
            ],
            [
                9477,
                9504
            ],
            [
                9504,
                9505
            ],
            [
                9511,
                9513
            ],
            [
                9514,
                9520
            ],
            [
                9523,
                9563
            ],
            [
                9563,
                9580
            ],
            [
                9580,
                9593
            ],
            [
                9593,
                9604
            ],
            [
                9609,
                9619
            ],
            [
                9620,
                9684
            ],
            [
                9684,
                9704
            ],
            [
                9704,
                9748
            ],
            [
                9748,
                9753
            ],
            [
                9756,
                9762
            ],
            [
                9763,
                9765
            ],
            [
                9766,
                9774
            ],
            [
                9775,
                9786
            ],
            [
                9789,
                9817
            ],
            [
                9820,
                9871
            ],
            [
                9874,
                9907
            ],
            [
                9908,
                9942
            ],
            [
                9943,
                9946
            ],
            [
                9947,
                9956
            ],
            [
                9956,
                9957
            ],
            [
                9961,
                9968
            ],
            [
                9969,
                9988
            ],
            [
                9988,
                9990
            ],
            [
                9990,
                10011
            ],
            [
                10012,
                10037
            ],
            [
                10037,
                10042
            ],
            [
                10043,
                10071
            ],
            [
                10071,
                10079
            ],
            [
                10079,
                10125
            ],
            [
                10125,
                10168
            ],
            [
                10168,
                10257
            ],
            [
                10257,
                10346
            ],
            [
                10346,
                10366
            ],
            [
                10371,
                10372
            ],
            [
                10381,
                10391
            ],
            [
                10396,
                10401
            ],
            [
                10401,
                10432
            ],
            [
                10433,
                10476
            ],
            [
                10476,
                10478
            ],
            [
                10478,
                10503
            ],
            [
                10512,
                10533
            ],
            [
                10534,
                10584
            ],
            [
                10591,
                10593
            ],
            [
                10594,
                10611
            ],
            [
                10612,
                10615
            ],
            [
                10624,
                10662
            ],
            [
                10662,
                10717
            ],
            [
                10724,
                10735
            ],
            [
                10736,
                10773
            ],
            [
                10774,
                10797
            ],
            [
                10798,
                10801
            ],
            [
                10802,
                10811
            ],
            [
                10811,
                10812
            ],
            [
                10813,
                10841
            ],
            [
                10842,
                10877
            ],
            [
                10878,
                10881
            ],
            [
                10889,
                10905
            ],
            [
                10906,
                10909
            ],
            [
                10910,
                10914
            ],
            [
                10914,
                10916
            ],
            [
                10916,
                10930
            ],
            [
                10930,
                10933
            ],
            [
                10933,
                10984
            ],
            [
                10997,
                11006
            ],
            [
                11007,
                11021
            ],
            [
                11021,
                11023
            ],
            [
                11023,
                11036
            ],
            [
                11036,
                11100
            ],
            [
                11100,
                11141
            ],
            [
                11142,
                11157
            ],
            [
                11157,
                11165
            ],
            [
                11166,
                11200
            ],
            [
                11200,
                11240
            ],
            [
                11240,
                11253
            ],
            [
                11254,
                11261
            ],
            [
                11262,
                11294
            ],
            [
                11295,
                11315
            ],
            [
                11315,
                11349
            ],
            [
                11355,
                11362
            ],
            [
                11363,
                11383
            ]
        ],
        "row_chars": [
            [
                0,
                233
            ],
            [
                233,
                547
            ],
            [
                547,
                569
            ],
            [
                569,
                627
            ],
            [
                627,
                876
            ],
            [
                876,
                1006
            ],
            [
                1006,
                1104
            ],
            [
                1104,
                1146
            ],
            [
                1146,
                1307
            ],
            [
                1307,
                1340
            ],
            [
                1340,
                1451
            ],
            [
                1451,
                1478
            ],
            [
                1478,
                1500
            ],
            [
                1500,
                1572
            ],
            [
                1572,
                1613
            ],
            [
                1613,
                1641
            ],
            [
                1641,
                1769
            ],
            [
                1769,
                1769
            ],
            [
                1769,
                1769
            ],
            [
                1769,
                1889
            ],
            [
                1889,
                2012
            ],
            [
                2012,
                2012
            ],
            [
                2012,
                2046
            ],
            [
                2046,
                2080
            ],
            [
                2080,
                2086
            ],
            [
                2086,
                2130
            ],
            [
                2130,
                2276
            ],
            [
                2276,
                2467
            ],
            [
                2467,
                2508
            ],
            [
                2508,
                2529
            ],
            [
                2529,
                2551
            ],
            [
                2551,
                2617
            ],
            [
                2617,
                2747
            ],
            [
                2747,
                2829
            ],
            [
                2829,
                2864
            ],
            [
                2864,
                2961
            ],
            [
                2961,
                3112
            ],
            [
                3112,
                3190
            ],
            [
                3190,
                3405
            ],
            [
                3405,
                3405
            ],
            [
                3405,
                3492
            ],
            [
                3492,
                3541
            ],
            [
                3541,
                3557
            ],
            [
                3557,
                3567
            ],
            [
                3567,
                3606
            ],
            [
                3606,
                3698
            ],
            [
                3698,
                3722
            ],
            [
                3722,
                3797
            ],
            [
                3797,
                3822
            ],
            [
                3822,
                3955
            ],
            [
                3955,
                4055
            ],
            [
                4055,
                4223
            ],
            [
                4223,
                4267
            ],
            [
                4267,
                4321
            ],
            [
                4321,
                4447
            ],
            [
                4447,
                4514
            ],
            [
                4514,
                4721
            ],
            [
                4721,
                4776
            ],
            [
                4776,
                4817
            ],
            [
                4817,
                4817
            ],
            [
                4817,
                4894
            ],
            [
                4894,
                5090
            ],
            [
                5090,
                5709
            ],
            [
                5709,
                5855
            ],
            [
                5855,
                5887
            ],
            [
                5887,
                5887
            ],
            [
                5887,
                5938
            ],
            [
                5938,
                5973
            ],
            [
                5973,
                6028
            ],
            [
                6028,
                6149
            ],
            [
                6149,
                6449
            ],
            [
                6449,
                6604
            ],
            [
                6604,
                6704
            ],
            [
                6704,
                6704
            ],
            [
                6704,
                6704
            ],
            [
                6704,
                6704
            ],
            [
                6704,
                6704
            ],
            [
                6704,
                6704
            ],
            [
                6704,
                6849
            ],
            [
                6849,
                7069
            ],
            [
                7069,
                7069
            ],
            [
                7069,
                7069
            ],
            [
                7069,
                7216
            ],
            [
                7216,
                7290
            ],
            [
                7290,
                7432
            ],
            [
                7432,
                7519
            ],
            [
                7519,
                7570
            ],
            [
                7570,
                7608
            ],
            [
                7608,
                7673
            ],
            [
                7673,
                7703
            ],
            [
                7703,
                7703
            ],
            [
                7703,
                7703
            ],
            [
                7703,
                7782
            ],
            [
                7782,
                7829
            ],
            [
                7829,
                7938
            ],
            [
                7938,
                7991
            ],
            [
                7991,
                8019
            ],
            [
                8019,
                8061
            ],
            [
                8061,
                8066
            ],
            [
                8066,
                8150
            ],
            [
                8150,
                8162
            ],
            [
                8162,
                8244
            ],
            [
                8244,
                8340
            ],
            [
                8340,
                8554
            ],
            [
                8554,
                8554
            ],
            [
                8554,
                8727
            ],
            [
                8727,
                8727
            ],
            [
                8727,
                8753
            ],
            [
                8753,
                8753
            ],
            [
                8753,
                8753
            ],
            [
                8753,
                8858
            ],
            [
                8858,
                8922
            ],
            [
                8922,
                8956
            ],
            [
                8956,
                9040
            ],
            [
                9040,
                9074
            ],
            [
                9074,
                9096
            ],
            [
                9096,
                9133
            ],
            [
                9133,
                9197
            ],
            [
                9197,
                9297
            ],
            [
                9297,
                9303
            ],
            [
                9303,
                9316
            ],
            [
                9316,
                9415
            ],
            [
                9415,
                9441
            ],
            [
                9441,
                9477
            ],
            [
                9477,
                9563
            ],
            [
                9563,
                9580
            ],
            [
                9580,
                9593
            ],
            [
                9593,
                9684
            ],
            [
                9684,
                9704
            ],
            [
                9704,
                9748
            ],
            [
                9748,
                9874
            ],
            [
                9874,
                9874
            ],
            [
                9874,
                9908
            ],
            [
                9908,
                9908
            ],
            [
                9908,
                9956
            ],
            [
                9956,
                9990
            ],
            [
                9990,
                10037
            ],
            [
                10037,
                10071
            ],
            [
                10071,
                10079
            ],
            [
                10079,
                10168
            ],
            [
                10168,
                10257
            ],
            [
                10257,
                10346
            ],
            [
                10346,
                10433
            ],
            [
                10433,
                10433
            ],
            [
                10433,
                10478
            ],
            [
                10478,
                10662
            ],
            [
                10662,
                10916
            ],
            [
                10916,
                10933
            ],
            [
                10933,
                11023
            ],
            [
                11023,
                11036
            ],
            [
                11036,
                11100
            ],
            [
                11100,
                11157
            ],
            [
                11157,
                11315
            ],
            [
                11315,
                11383
            ]
        ]
    }
}