{
    "original": {
        "text": "Frankness and kindness like Amelia's were likely to touch even such a hardened little reprobate as Becky. She returned Emmy's caresses and kind speeches with something very like gratitude, and an emotion which, if it was not lasting, for a moment was almost genuine. That was a lucky stroke of hers about the child \"torn from her arms shrieking.\" It was by that harrowing misfortune that Becky had won her friend back, and it was one of the very first points, we may be certain, upon which our poor simple little Emmy began to talk to her new-found acquaintance.\n\"And so they took your darling child from you?\" our simpleton cried out. \"Oh, Rebecca, my poor dear suffering friend, I know what it is to lose a boy, and to feel for those who have lost one. But please Heaven yours will be restored to you, as a merciful merciful Providence has brought me back mine.\"\n\"The child, my child? Oh, yes, my agonies were frightful,\" Becky owned, not perhaps without a twinge of conscience. It jarred upon her to be obliged to commence instantly to tell lies in reply to so much confidence and simplicity. But that is the misfortune of beginning with this kind of forgery. When one fib becomes due as it were, you must forge another to take up the old acceptance; and so the stock of your lies in circulation inevitably multiplies, and the danger of detection increases every day.\n\"My agonies,\" Becky continued, \"were terrible (I hope she won't sit down on the bottle) when they took him away from me; I thought I should die; but I fortunately had a brain fever, during which my doctor gave me up, and--and I recovered, and--and here I am, poor and friendless.\"\n\"How old is he?\" Emmy asked.\n\"Eleven,\" said Becky.\n\"Eleven!\" cried the other. \"Why, he was born the same year with Georgy, who is--\"\n\"I know, I know,\" Becky cried out, who had in fact quite forgotten all about little Rawdon's age. \"Grief has made me forget so many things, dearest Amelia. I am very much changed: half-wild sometimes. He was eleven when they took him away from me. Bless his sweet face; I have never seen it again.\"\n\"Was he fair or dark?\" went on that absurd little Emmy. \"Show me his hair.\"\nBecky almost laughed at her simplicity. \"Not to-day, love--some other time, when my trunks arrive from Leipzig, whence I came to this place--and a little drawing of him, which I made in happy days.\"\n\"Poor Becky, poor Becky!\" said Emmy. \"How thankful, how thankful I ought to be\"; (though I doubt whether that practice of piety inculcated upon us by our womankind in early youth, namely, to be thankful because we are better off than somebody else, be a very rational religious exercise) and then she began to think, as usual, how her son was the handsomest, the best, and the cleverest boy in the whole world.\n\"You will see my Georgy,\" was the best thing Emmy could think of to console Becky. If anything could make her comfortable that would.\nAnd so the two women continued talking for an hour or more, during which Becky had the opportunity of giving her new friend a full and complete version of her private history. She showed how her marriage with Rawdon Crawley had always been viewed by the family with feelings of the utmost hostility; how her sister-in-law (an artful woman) had poisoned her husband's mind against her; how he had formed odious connections, which had estranged his affections from her: how she had borne everything--poverty, neglect, coldness from the being whom she most loved--and all for the sake of her child; how, finally, and by the most flagrant outrage, she had been driven into demanding a separation from her husband, when the wretch did not scruple to ask that she should sacrifice her own fair fame so that he might procure advancement through the means of a very great and powerful but unprincipled man--the Marquis of Steyne, indeed. The atrocious monster!\nThis part of her eventful history Becky gave with the utmost feminine delicacy and the most indignant virtue. Forced to fly her husband's roof by this insult, the coward had pursued his revenge by taking her child from her. And thus Becky said she was a wanderer, poor, unprotected, friendless, and wretched.\nEmmy received this story, which was told at some length, as those persons who are acquainted with her character may imagine that she would. She quivered with indignation at the account of the conduct of the miserable Rawdon and the unprincipled Steyne. Her eyes made notes of admiration for every one of the sentences in which Becky described the persecutions of her aristocratic relatives and the falling away of her husband. (Becky did not abuse him. She spoke rather in sorrow than in anger. She had loved him only too fondly: and was he not the father of her boy?) And as for the separation scene from the child, while Becky was reciting it, Emmy retired altogether behind her pocket-handkerchief, so that the consummate little tragedian must have been charmed to see the effect which her performance produced on her audience.\nWhilst the ladies were carrying on their conversation, Amelia's constant escort, the Major (who, of course, did not wish to interrupt their conference, and found himself rather tired of creaking about the narrow stair passage of which the roof brushed the nap from his hat) descended to the ground-floor of the house and into the great room common to all the frequenters of the Elephant, out of which the stair led. This apartment is always in a fume of smoke and liberally sprinkled with beer. On a dirty table stand scores of corresponding brass candlesticks with tallow candles for the lodgers, whose keys hang up in rows over the candles. Emmy had passed blushing through the room anon, where all sorts of people were collected; Tyrolese glove-sellers and Danubian linen-merchants, with their packs; students recruiting themselves with butterbrods and meat; idlers, playing cards or dominoes on the sloppy, beery tables; tumblers refreshing during the cessation of their performances--in a word, all the fumum and strepitus of a German inn in fair time. The waiter brought the Major a mug of beer, as a matter of course, and he took out a cigar and amused himself with that pernicious vegetable and a newspaper until his charge should come down to claim him.\nMax and Fritz came presently downstairs, their caps on one side, their spurs jingling, their pipes splendid with coats of arms and full-blown tassels, and they hung up the key of No. 90 on the board and called for the ration of butterbrod and beer. The pair sat down by the Major and fell into a conversation of which he could not help hearing somewhat. It was mainly about \"Fuchs\" and \"Philister,\" and duels and drinking-bouts at the neighbouring University of Schoppenhausen, from which renowned seat of learning they had just come in the Eilwagen, with Becky, as it appeared, by their side, and in order to be present at the bridal fetes at Pumpernickel.\n\"The title Englanderinn seems to be en bays de gonnoisance,\" said Max, who knew the French language, to Fritz, his comrade. \"After the fat grandfather went away, there came a pretty little compatriot. I heard them chattering and whimpering together in the little woman's chamber.\"\n\"We must take the tickets for her concert,\" Fritz said. \"Hast thou any money, Max?\"\n\"Bah,\" said the other, \"the concert is a concert in nubibus. Hans said that she advertised one at Leipzig, and the Burschen took many tickets. But she went off without singing. She said in the coach yesterday that her pianist had fallen ill at Dresden. She cannot sing, it is my belief: her voice is as cracked as thine, O thou beer-soaking Renowner!\"\n\"It is cracked; I hear her trying out of her window a schrecklich English ballad, called 'De Rose upon de Balgony.'\"\n\"Saufen and singen go not together,\" observed Fritz with the red nose, who evidently preferred the former amusement. \"No, thou shalt take none of her tickets. She won money at the trente and quarante last night. I saw her: she made a little English boy play for her. We will spend thy money there or at the theatre, or we will treat her to French wine or Cognac in the Aurelius Garden, but the tickets we will not buy. What sayest thou? Yet, another mug of beer?\" and one and another successively having buried their blond whiskers in the mawkish draught, curled them and swaggered off into the fair.\nThe Major, who had seen the key of No. 90 put up on its hook and had heard the conversation of the two young University bloods, was not at a loss to understand that their talk related to Becky. \"The little devil is at her old tricks,\" he thought, and he smiled as he recalled old days, when he had witnessed the desperate flirtation with Jos and the ludicrous end of that adventure. He and George had often laughed over it subsequently, and until a few weeks after George's marriage, when he also was caught in the little Circe's toils, and had an understanding with her which his comrade certainly suspected, but preferred to ignore. William was too much hurt or ashamed to ask to fathom that disgraceful mystery, although once, and evidently with remorse on his mind, George had alluded to it. It was on the morning of Waterloo, as the young men stood together in front of their line, surveying the black masses of Frenchmen who crowned the opposite heights, and as the rain was coming down, \"I have been mixing in a foolish intrigue with a woman,\" George said. \"I am glad we were marched away. If I drop, I hope Emmy will never know of that business. I wish to God it had never been begun!\" And William was pleased to think, and had more than once soothed poor George's widow with the narrative, that Osborne, after quitting his wife, and after the action of Quatre Bras, on the first day, spoke gravely and affectionately to his comrade of his father and his wife. On these facts, too, William had insisted very strongly in his conversations with the elder Osborne, and had thus been the means of reconciling the old gentleman to his son's memory, just at the close of the elder man's life.\n\"And so this devil is still going on with her intrigues,\" thought William. \"I wish she were a hundred miles from here. She brings mischief wherever she goes.\" And he was pursuing these forebodings and this uncomfortable train of thought, with his head between his hands, and the Pumpernickel Gazette of last week unread under his nose, when somebody tapped his shoulder with a parasol, and he looked up and saw Mrs. Amelia.\nThis woman had a way of tyrannizing over Major Dobbin (for the weakest of all people will domineer over somebody), and she ordered him about, and patted him, and made him fetch and carry just as if he was a great Newfoundland dog. He liked, so to speak, to jump into the water if she said \"High, Dobbin!\" and to trot behind her with her reticule in his mouth. This history has been written to very little purpose if the reader has not perceived that the Major was a spooney.\n\"Why did you not wait for me, sir, to escort me downstairs?\" she said, giving a little toss of her head and a most sarcastic curtsey.\n\"I couldn't stand up in the passage,\" he answered with a comical deprecatory look; and, delighted to give her his arm and to take her out of the horrid smoky place, he would have walked off without even so much as remembering the waiter, had not the young fellow run after him and stopped him on the threshold of the Elephant to make him pay for the beer which he had not consumed. Emmy laughed: she called him a naughty man, who wanted to run away in debt, and, in fact, made some jokes suitable to the occasion and the small-beer. She was in high spirits and good humour, and tripped across the market-place very briskly. She wanted to see Jos that instant. The Major laughed at the impetuous affection Mrs. Amelia exhibited; for, in truth, it was not very often that she wanted her brother \"that instant.\" They found the civilian in his saloon on the first-floor; he had been pacing the room, and biting his nails, and looking over the market-place towards the Elephant a hundred times at least during the past hour whilst Emmy was closeted with her friend in the garret and the Major was beating the tattoo on the sloppy tables of the public room below, and he was, on his side too, very anxious to see Mrs. Osborne.\n\"Well?\" said he.\n\"The poor dear creature, how she has suffered!\" Emmy said.\n\"God bless my soul, yes,\" Jos said, wagging his head, so that his cheeks quivered like jellies.\n\"She may have Payne's room, who can go upstairs,\" Emmy continued. Payne was a staid English maid and personal attendant upon Mrs. Osborne, to whom the courier, as in duty bound, paid court, and whom Georgy used to \"lark\" dreadfully with accounts of German robbers and ghosts. She passed her time chiefly in grumbling, in ordering about her mistress, and in stating her intention to return the next morning to her native village of Clapham. \"She may have Payne's room,\" Emmy said.\n\"Why, you don't mean to say you are going to have that woman into the house?\" bounced out the Major, jumping up.\n\"Of course we are,\" said Amelia in the most innocent way in the world. \"Don't be angry and break the furniture, Major Dobbin. Of course we are going to have her here.\"\n\"Of course, my dear,\" Jos said.\n\"The poor creature, after all her sufferings,\" Emmy continued; \"her horrid banker broken and run away; her husband--wicked wretch--having deserted her and taken her child away from her\" (here she doubled her two little fists and held them in a most menacing attitude before her, so that the Major was charmed to see such a dauntless virago) \"the poor dear thing! quite alone and absolutely forced to give lessons in singing to get her bread--and not have her here!\"\n\"Take lessons, my dear Mrs. George,\" cried the Major, \"but don't have her in the house. I implore you don't.\"\n\"Pooh,\" said Jos.\n\"You who are always good and kind--always used to be at any rate--I'm astonished at you, Major William,\" Amelia cried. \"Why, what is the moment to help her but when she is so miserable? Now is the time to be of service to her. The oldest friend I ever had, and not--\"\n\"She was not always your friend, Amelia,\" the Major said, for he was quite angry. This allusion was too much for Emmy, who, looking the Major almost fiercely in the face, said, \"For shame, Major Dobbin!\" and after having fired this shot, she walked out of the room with a most majestic air and shut her own door briskly on herself and her outraged dignity.\n\"To allude to THAT!\" she said, when the door was closed. \"Oh, it was cruel of him to remind me of it,\" and she looked up at George's picture, which hung there as usual, with the portrait of the boy underneath. \"It was cruel of him. If I had forgiven it, ought he to have spoken? No. And it is from his own lips that I know how wicked and groundless my jealousy was; and that you were pure--oh, yes, you were pure, my saint in heaven!\"\nShe paced the room, trembling and indignant. She went and leaned on the chest of drawers over which the picture hung, and gazed and gazed at it. Its eyes seemed to look down on her with a reproach that deepened as she looked. The early dear, dear memories of that brief prime of love rushed back upon her. The wound which years had scarcely cicatrized bled afresh, and oh, how bitterly! She could not bear the reproaches of the husband there before her. It couldn't be. Never, never.\nPoor Dobbin; poor old William! That unlucky word had undone the work of many a year--the long laborious edifice of a life of love and constancy--raised too upon what secret and hidden foundations, wherein lay buried passions, uncounted struggles, unknown sacrifices--a little word was spoken, and down fell the fair palace of hope--one word, and away flew the bird which he had been trying all his life to lure!\nWilliam, though he saw by Amelia's looks that a great crisis had come, nevertheless continued to implore Sedley, in the most energetic terms, to beware of Rebecca; and he eagerly, almost frantically, adjured Jos not to receive her. He besought Mr. Sedley to inquire at least regarding her; told him how he had heard that she was in the company of gamblers and people of ill repute; pointed out what evil she had done in former days, how she and Crawley had misled poor George into ruin, how she was now parted from her husband, by her own confession, and, perhaps, for good reason. What a dangerous companion she would be for his sister, who knew nothing of the affairs of the world! William implored Jos, with all the eloquence which he could bring to bear, and a great deal more energy than this quiet gentleman was ordinarily in the habit of showing, to keep Rebecca out of his household.\nHad he been less violent, or more dexterous, he might have succeeded in his supplications to Jos; but the civilian was not a little jealous of the airs of superiority which the Major constantly exhibited towards him, as he fancied (indeed, he had imparted his opinions to Mr. Kirsch, the courier, whose bills Major Dobbin checked on this journey, and who sided with his master), and he began a blustering speech about his competency to defend his own honour, his desire not to have his affairs meddled with, his intention, in fine, to rebel against the Major, when the colloquy--rather a long and stormy one--was put an end to in the simplest way possible, namely, by the arrival of Mrs. Becky, with a porter from the Elephant Hotel in charge of her very meagre baggage.\nShe greeted her host with affectionate respect and made a shrinking, but amicable salutation to Major Dobbin, who, as her instinct assured her at once, was her enemy, and had been speaking against her; and the bustle and clatter consequent upon her arrival brought Amelia out of her room. Emmy went up and embraced her guest with the greatest warmth, and took no notice of the Major, except to fling him an angry look--the most unjust and scornful glance that had perhaps ever appeared in that poor little woman's face since she was born. But she had private reasons of her own, and was bent upon being angry with him. And Dobbin, indignant at the injustice, not at the defeat, went off, making her a bow quite as haughty as the killing curtsey with which the little woman chose to bid him farewell.\nHe being gone, Emmy was particularly lively and affectionate to Rebecca, and bustled about the apartments and installed her guest in her room with an eagerness and activity seldom exhibited by our placid little friend. But when an act of injustice is to be done, especially by weak people, it is best that it should be done quickly, and Emmy thought she was displaying a great deal of firmness and proper feeling and veneration for the late Captain Osborne in her present behaviour.\nGeorgy came in from the fetes for dinner-time and found four covers laid as usual; but one of the places was occupied by a lady, instead of by Major Dobbin. \"Hullo! where's Dob?\" the young gentleman asked with his usual simplicity of language. \"Major Dobbin is dining out, I suppose,\" his mother said, and, drawing the boy to her, kissed him a great deal, and put his hair off his forehead, and introduced him to Mrs. Crawley. \"This is my boy, Rebecca,\" Mrs. Osborne said--as much as to say--can the world produce anything like that? Becky looked at him with rapture and pressed his hand fondly. \"Dear boy!\" she said--\"he is just like my--\" Emotion choked her further utterance, but Amelia understood, as well as if she had spoken, that Becky was thinking of her own blessed child. However, the company of her friend consoled Mrs. Crawley, and she ate a very good dinner.\nDuring the repast, she had occasion to speak several times, when Georgy eyed her and listened to her. At the desert Emmy was gone out to superintend further domestic arrangements; Jos was in his great chair dozing over Galignani; Georgy and the new arrival sat close to each other--he had continued to look at her knowingly more than once, and at last he laid down the nutcrackers.\n\"I say,\" said Georgy.\n\"What do you say?\" Becky said, laughing.\n\"You're the lady I saw in the mask at the Rouge et Noir.\"\n\"Hush! you little sly creature,\" Becky said, taking up his hand and kissing it. \"Your uncle was there too, and Mamma mustn't know.\"\n\"Oh, no--not by no means,\" answered the little fellow.\n\"You see we are quite good friends already,\" Becky said to Emmy, who now re-entered; and it must be owned that Mrs. Osborne had introduced a most judicious and amiable companion into her house.\nWilliam, in a state of great indignation, though still unaware of all the treason that was in store for him, walked about the town wildly until he fell upon the Secretary of Legation, Tapeworm, who invited him to dinner. As they were discussing that meal, he took occasion to ask the Secretary whether he knew anything about a certain Mrs. Rawdon Crawley, who had, he believed, made some noise in London; and then Tapeworm, who of course knew all the London gossip, and was besides a relative of Lady Gaunt, poured out into the astonished Major's ears such a history about Becky and her husband as astonished the querist, and supplied all the points of this narrative, for it was at that very table years ago that the present writer had the pleasure of hearing the tale. Tufto, Steyne, the Crawleys, and their history--everything connected with Becky and her previous life passed under the record of the bitter diplomatist. He knew everything and a great deal besides, about all the world--in a word, he made the most astounding revelations to the simple-hearted Major. When Dobbin said that Mrs. Osborne and Mr. Sedley had taken her into their house, Tapeworm burst into a peal of laughter which shocked the Major, and asked if they had not better send into the prison and take in one or two of the gentlemen in shaved heads and yellow jackets who swept the streets of Pumpernickel, chained in pairs, to board and lodge, and act as tutor to that little scapegrace Georgy.\nThis information astonished and horrified the Major not a little. It had been agreed in the morning (before meeting with Rebecca) that Amelia should go to the Court ball that night. There would be the place where he should tell her. The Major went home, and dressed himself in his uniform, and repaired to Court, in hopes to see Mrs. Osborne. She never came. When he returned to his lodgings all the lights in the Sedley tenement were put out. He could not see her till the morning. I don't know what sort of a night's rest he had with this frightful secret in bed with him.\nAt the earliest convenient hour in the morning he sent his servant across the way with a note, saying that he wished very particularly to speak with her. A message came back to say that Mrs. Osborne was exceedingly unwell and was keeping her room.\nShe, too, had been awake all that night. She had been thinking of a thing which had agitated her mind a hundred times before. A hundred times on the point of yielding, she had shrunk back from a sacrifice which she felt was too much for her. She couldn't, in spite of his love and constancy and her own acknowledged regard, respect, and gratitude. What are benefits, what is constancy, or merit? One curl of a girl's ringlet, one hair of a whisker, will turn the scale against them all in a minute. They did not weigh with Emmy more than with other women. She had tried them; wanted to make them pass; could not; and the pitiless little woman had found a pretext, and determined to be free.\nWhen at length, in the afternoon, the Major gained admission to Amelia, instead of the cordial and affectionate greeting, to which he had been accustomed now for many a long day, he received the salutation of a curtsey, and of a little gloved hand, retracted the moment after it was accorded to him.\nRebecca, too, was in the room, and advanced to meet him with a smile and an extended hand. Dobbin drew back rather confusedly, \"I--I beg your pardon, m'am,\" he said; \"but I am bound to tell you that it is not as your friend that I am come here now.\"\n\"Pooh! damn; don't let us have this sort of thing!\" Jos cried out, alarmed, and anxious to get rid of a scene.\n\"I wonder what Major Dobbin has to say against Rebecca?\" Amelia said in a low, clear voice with a slight quiver in it, and a very determined look about the eyes.\n\"I will not have this sort of thing in my house,\" Jos again interposed. \"I say I will not have it; and Dobbin, I beg, sir, you'll stop it.\" And he looked round, trembling and turning very red, and gave a great puff, and made for his door.\n\"Dear friend!\" Rebecca said with angelic sweetness, \"do hear what Major Dobbin has to say against me.\"\n\"I will not hear it, I say,\" squeaked out Jos at the top of his voice, and, gathering up his dressing-gown, he was gone.\n\"We are only two women,\" Amelia said. \"You can speak now, sir.\"\n\"This manner towards me is one which scarcely becomes you, Amelia,\" the Major answered haughtily; \"nor I believe am I guilty of habitual harshness to women. It is not a pleasure to me to do the duty which I am come to do.\"\n\"Pray proceed with it quickly, if you please, Major Dobbin,\" said Amelia, who was more and more in a pet. The expression of Dobbin's face, as she spoke in this imperious manner, was not pleasant.\n\"I came to say--and as you stay, Mrs. Crawley, I must say it in your presence--that I think you--you ought not to form a member of the family of my friends. A lady who is separated from her husband, who travels not under her own name, who frequents public gaming-tables--\"\n\"It was to the ball I went,\" cried out Becky.\n\"--is not a fit companion for Mrs. Osborne and her son,\" Dobbin went on: \"and I may add that there are people here who know you, and who profess to know that regarding your conduct about which I don't even wish to speak before--before Mrs. Osborne.\"\n\"Yours is a very modest and convenient sort of calumny, Major Dobbin,\" Rebecca said. \"You leave me under the weight of an accusation which, after all, is unsaid. What is it? Is it unfaithfulness to my husband? I scorn it and defy anybody to prove it--I defy you, I say. My honour is as untouched as that of the bitterest enemy who ever maligned me. Is it of being poor, forsaken, wretched, that you accuse me? Yes, I am guilty of those faults, and punished for them every day. Let me go, Emmy. It is only to suppose that I have not met you, and I am no worse to-day than I was yesterday. It is only to suppose that the night is over and the poor wanderer is on her way. Don't you remember the song we used to sing in old, dear old days? I have been wandering ever since then--a poor castaway, scorned for being miserable, and insulted because I am alone. Let me go: my stay here interferes with the plans of this gentleman.\"\n\"Indeed it does, madam,\" said the Major. \"If I have any authority in this house--\"\n\"Authority, none!\" broke out Amelia \"Rebecca, you stay with me. I won't desert you because you have been persecuted, or insult you because--because Major Dobbin chooses to do so. Come away, dear.\" And the two women made towards the door.\nWilliam opened it. As they were going out, however, he took Amelia's hand and said--\"Will you stay a moment and speak to me?\"\n\"He wishes to speak to you away from me,\" said Becky, looking like a martyr. Amelia gripped her hand in reply.\n\"Upon my honour it is not about you that I am going to speak,\" Dobbin said. \"Come back, Amelia,\" and she came. Dobbin bowed to Mrs. Crawley, as he shut the door upon her. Amelia looked at him, leaning against the glass: her face and her lips were quite white.\n\"I was confused when I spoke just now,\" the Major said after a pause, \"and I misused the word authority.\"\n\"You did,\" said Amelia with her teeth chattering.\n\"At least I have claims to be heard,\" Dobbin continued.\n\"It is generous to remind me of our obligations to you,\" the woman answered.\n\"The claims I mean are those left me by George's father,\" William said.\n\"Yes, and you insulted his memory. You did yesterday. You know you did. And I will never forgive you. Never!\" said Amelia. She shot out each little sentence in a tremor of anger and emotion.\n\"You don't mean that, Amelia?\" William said sadly. \"You don't mean that these words, uttered in a hurried moment, are to weigh against a whole life's devotion? I think that George's memory has not been injured by the way in which I have dealt with it, and if we are come to bandying reproaches, I at least merit none from his widow and the mother of his son. Reflect, afterwards when--when you are at leisure, and your conscience will withdraw this accusation. It does even now.\" Amelia held down her head.\n\"It is not that speech of yesterday,\" he continued, \"which moves you. That is but the pretext, Amelia, or I have loved you and watched you for fifteen years in vain. Have I not learned in that time to read all your feelings and look into your thoughts? I know what your heart is capable of: it can cling faithfully to a recollection and cherish a fancy, but it can't feel such an attachment as mine deserves to mate with, and such as I would have won from a woman more generous than you. No, you are not worthy of the love which I have devoted to you. I knew all along that the prize I had set my life on was not worth the winning; that I was a fool, with fond fancies, too, bartering away my all of truth and ardour against your little feeble remnant of love. I will bargain no more: I withdraw. I find no fault with you. You are very good-natured, and have done your best, but you couldn't--you couldn't reach up to the height of the attachment which I bore you, and which a loftier soul than yours might have been proud to share. Good-bye, Amelia! I have watched your struggle. Let it end. We are both weary of it.\"\nAmelia stood scared and silent as William thus suddenly broke the chain by which she held him and declared his independence and superiority. He had placed himself at her feet so long that the poor little woman had been accustomed to trample upon him. She didn't wish to marry him, but she wished to keep him. She wished to give him nothing, but that he should give her all. It is a bargain not unfrequently levied in love.\nWilliam's sally had quite broken and cast her down. HER assault was long since over and beaten back.\n\"Am I to understand then, that you are going--away, William?\" she said.\nHe gave a sad laugh. \"I went once before,\" he said, \"and came back after twelve years. We were young then, Amelia. Good-bye. I have spent enough of my life at this play.\"\nWhilst they had been talking, the door into Mrs. Osborne's room had opened ever so little; indeed, Becky had kept a hold of the handle and had turned it on the instant when Dobbin quitted it, and she heard every word of the conversation that had passed between these two. \"What a noble heart that man has,\" she thought, \"and how shamefully that woman plays with it!\" She admired Dobbin; she bore him no rancour for the part he had taken against her. It was an open move in the game, and played fairly. \"Ah!\" she thought, \"if I could have had such a husband as that--a man with a heart and brains too! I would not have minded his large feet\"; and running into her room, she absolutely bethought herself of something, and wrote him a note, beseeching him to stop for a few days--not to think of going--and that she could serve him with A.\nThe parting was over. Once more poor William walked to the door and was gone; and the little widow, the author of all this work, had her will, and had won her victory, and was left to enjoy it as she best might. Let the ladies envy her triumph.\nAt the romantic hour of dinner, Mr. Georgy made his appearance and again remarked the absence of \"Old Dob.\" The meal was eaten in silence by the party. Jos's appetite not being diminished, but Emmy taking nothing at all.\nAfter the meal, Georgy was lolling in the cushions of the old window, a large window, with three sides of glass abutting from the gable, and commanding on one side the market-place, where the Elephant is, his mother being busy hard by, when he remarked symptoms of movement at the Major's house on the other side of the street.\n\"Hullo!\" said he, \"there's Dob's trap--they are bringing it out of the court-yard.\" The \"trap\" in question was a carriage which the Major had bought for six pounds sterling, and about which they used to rally him a good deal.\nEmmy gave a little start, but said nothing.\n\"Hullo!\" Georgy continued, \"there's Francis coming out with the portmanteaus, and Kunz, the one-eyed postilion, coming down the market with three schimmels. Look at his boots and yellow jacket--ain't he a rum one? Why--they're putting the horses to Dob's carriage. Is he going anywhere?\"\n\"Yes,\" said Emmy, \"he is going on a journey.\"\n\"Going on a journey; and when is he coming back?\"\n\"He is--not coming back,\" answered Emmy.\n\"Not coming back!\" cried out Georgy, jumping up. \"Stay here, sir,\" roared out Jos. \"Stay, Georgy,\" said his mother with a very sad face. The boy stopped, kicked about the room, jumped up and down from the window-seat with his knees, and showed every symptom of uneasiness and curiosity.\nThe horses were put to. The baggage was strapped on. Francis came out with his master's sword, cane, and umbrella tied up together, and laid them in the well, and his desk and old tin cocked-hat case, which he placed under the seat. Francis brought out the stained old blue cloak lined with red camlet, which had wrapped the owner up any time these fifteen years, and had manchen Sturm erlebt, as a favourite song of those days said. It had been new for the campaign of Waterloo and had covered George and William after the night of Quatre Bras.\nOld Burcke, the landlord of the lodgings, came out, then Francis, with more packages--final packages--then Major William--Burcke wanted to kiss him. The Major was adored by all people with whom he had to do. It was with difficulty he could escape from this demonstration of attachment.\n\"By Jove, I will go!\" screamed out George. \"Give him this,\" said Becky, quite interested, and put a paper into the boy's hand. He had rushed down the stairs and flung across the street in a minute--the yellow postilion was cracking his whip gently.\nWilliam had got into the carriage, released from the embraces of his landlord. George bounded in afterwards, and flung his arms round the Major's neck (as they saw from the window), and began asking him multiplied questions. Then he felt in his waistcoat pocket and gave him a note. William seized at it rather eagerly, he opened it trembling, but instantly his countenance changed, and he tore the paper in two and dropped it out of the carriage. He kissed Georgy on the head, and the boy got out, doubling his fists into his eyes, and with the aid of Francis. He lingered with his hand on the panel. Fort, Schwager! The yellow postilion cracked his whip prodigiously, up sprang Francis to the box, away went the schimmels, and Dobbin with his head on his breast. He never looked up as they passed under Amelia's window, and Georgy, left alone in the street, burst out crying in the face of all the crowd.\nEmmy's maid heard him howling again during the night and brought him some preserved apricots to console him. She mingled her lamentations with his. All the poor, all the humble, all honest folks, all good men who knew him, loved that kind-hearted and simple gentleman.\nAs for Emmy, had she not done her duty? She had her picture of George for a consolation.",
        "paragraph_chars": [
            [
                0,
                563
            ],
            [
                563,
                865
            ],
            [
                865,
                1371
            ],
            [
                1371,
                1652
            ],
            [
                1652,
                1681
            ],
            [
                1681,
                1703
            ],
            [
                1703,
                1785
            ],
            [
                1785,
                2084
            ],
            [
                2084,
                2160
            ],
            [
                2160,
                2359
            ],
            [
                2359,
                2770
            ],
            [
                2770,
                2904
            ],
            [
                2904,
                3857
            ],
            [
                3857,
                4166
            ],
            [
                4166,
                4997
            ],
            [
                4997,
                6260
            ],
            [
                6260,
                6918
            ],
            [
                6918,
                7199
            ],
            [
                7199,
                7283
            ],
            [
                7283,
                7635
            ],
            [
                7635,
                7752
            ],
            [
                7752,
                8353
            ],
            [
                8353,
                10048
            ],
            [
                10048,
                10472
            ],
            [
                10472,
                10947
            ],
            [
                10947,
                11081
            ],
            [
                11081,
                12302
            ],
            [
                12302,
                12319
            ],
            [
                12319,
                12378
            ],
            [
                12378,
                12474
            ],
            [
                12474,
                12954
            ],
            [
                12954,
                13067
            ],
            [
                13067,
                13235
            ],
            [
                13235,
                13267
            ],
            [
                13267,
                13733
            ],
            [
                13733,
                13843
            ],
            [
                13843,
                13861
            ],
            [
                13861,
                14129
            ],
            [
                14129,
                14486
            ],
            [
                14486,
                14921
            ],
            [
                14921,
                15405
            ],
            [
                15405,
                15817
            ],
            [
                15817,
                16709
            ],
            [
                16709,
                17480
            ],
            [
                17480,
                18280
            ],
            [
                18280,
                18763
            ],
            [
                18763,
                19635
            ],
            [
                19635,
                20017
            ],
            [
                20017,
                20039
            ],
            [
                20039,
                20080
            ],
            [
                20080,
                20138
            ],
            [
                20138,
                20270
            ],
            [
                20270,
                20325
            ],
            [
                20325,
                20519
            ],
            [
                20519,
                21992
            ],
            [
                21992,
                22567
            ],
            [
                22567,
                22815
            ],
            [
                22815,
                23506
            ],
            [
                23506,
                23806
            ],
            [
                23806,
                24056
            ],
            [
                24056,
                24167
            ],
            [
                24167,
                24329
            ],
            [
                24329,
                24568
            ],
            [
                24568,
                24671
            ],
            [
                24671,
                24792
            ],
            [
                24792,
                24856
            ],
            [
                24856,
                25079
            ],
            [
                25079,
                25275
            ],
            [
                25275,
                25548
            ],
            [
                25548,
                25594
            ],
            [
                25594,
                25844
            ],
            [
                25844,
                26769
            ],
            [
                26769,
                26852
            ],
            [
                26852,
                27090
            ],
            [
                27090,
                27216
            ],
            [
                27216,
                27327
            ],
            [
                27327,
                27587
            ],
            [
                27587,
                27693
            ],
            [
                27693,
                27743
            ],
            [
                27743,
                27799
            ],
            [
                27799,
                27876
            ],
            [
                27876,
                27948
            ],
            [
                27948,
                28139
            ],
            [
                28139,
                28646
            ],
            [
                28646,
                29765
            ],
            [
                29765,
                30188
            ],
            [
                30188,
                30289
            ],
            [
                30289,
                30361
            ],
            [
                30361,
                30532
            ],
            [
                30532,
                31369
            ],
            [
                31369,
                31614
            ],
            [
                31614,
                31835
            ],
            [
                31835,
                32163
            ],
            [
                32163,
                32389
            ],
            [
                32389,
                32433
            ],
            [
                32433,
                32721
            ],
            [
                32721,
                32767
            ],
            [
                32767,
                32817
            ],
            [
                32817,
                32858
            ],
            [
                32858,
                33145
            ],
            [
                33145,
                33691
            ],
            [
                33691,
                33977
            ],
            [
                33977,
                34226
            ],
            [
                34226,
                35133
            ],
            [
                35133,
                35402
            ],
            [
                35402,
                35490
            ]
        ],
        "segment_chars": [
            [
                0,
                106
            ],
            [
                106,
                267
            ],
            [
                267,
                347
            ],
            [
                347,
                563
            ],
            [
                563,
                611
            ],
            [
                611,
                636
            ],
            [
                636,
                755
            ],
            [
                755,
                865
            ],
            [
                865,
                887
            ],
            [
                887,
                981
            ],
            [
                981,
                1096
            ],
            [
                1096,
                1163
            ],
            [
                1163,
                1371
            ],
            [
                1371,
                1652
            ],
            [
                1652,
                1669
            ],
            [
                1669,
                1681
            ],
            [
                1681,
                1703
            ],
            [
                1703,
                1713
            ],
            [
                1713,
                1730
            ],
            [
                1730,
                1785
            ],
            [
                1785,
                1883
            ],
            [
                1883,
                1941
            ],
            [
                1941,
                1986
            ],
            [
                1986,
                2033
            ],
            [
                2033,
                2084
            ],
            [
                2084,
                2107
            ],
            [
                2107,
                2140
            ],
            [
                2140,
                2160
            ],
            [
                2160,
                2200
            ],
            [
                2200,
                2359
            ],
            [
                2359,
                2385
            ],
            [
                2385,
                2396
            ],
            [
                2396,
                2770
            ],
            [
                2770,
                2853
            ],
            [
                2853,
                2904
            ],
            [
                2904,
                3080
            ],
            [
                3080,
                3834
            ],
            [
                3834,
                3857
            ],
            [
                3857,
                3967
            ],
            [
                3967,
                4081
            ],
            [
                4081,
                4166
            ],
            [
                4166,
                4306
            ],
            [
                4306,
                4419
            ],
            [
                4419,
                4593
            ],
            [
                4593,
                4619
            ],
            [
                4619,
                4661
            ],
            [
                4661,
                4735
            ],
            [
                4735,
                4997
            ],
            [
                4997,
                5413
            ],
            [
                5413,
                5492
            ],
            [
                5492,
                5640
            ],
            [
                5640,
                6055
            ],
            [
                6055,
                6260
            ],
            [
                6260,
                6443
            ],
            [
                6443,
                6509
            ],
            [
                6509,
                6614
            ],
            [
                6614,
                6918
            ],
            [
                6918,
                7042
            ],
            [
                7042,
                7119
            ],
            [
                7119,
                7199
            ],
            [
                7199,
                7255
            ],
            [
                7255,
                7283
            ],
            [
                7283,
                7344
            ],
            [
                7344,
                7426
            ],
            [
                7426,
                7460
            ],
            [
                7460,
                7536
            ],
            [
                7536,
                7635
            ],
            [
                7635,
                7752
            ],
            [
                7752,
                7869
            ],
            [
                7869,
                7911
            ],
            [
                7911,
                7964
            ],
            [
                7964,
                8019
            ],
            [
                8019,
                8171
            ],
            [
                8171,
                8189
            ],
            [
                8189,
                8216
            ],
            [
                8216,
                8353
            ],
            [
                8353,
                8392
            ],
            [
                8392,
                8547
            ],
            [
                8547,
                8736
            ],
            [
                8736,
                8988
            ],
            [
                8988,
                9149
            ],
            [
                9149,
                9417
            ],
            [
                9417,
                9450
            ],
            [
                9450,
                9507
            ],
            [
                9507,
                9547
            ],
            [
                9547,
                9822
            ],
            [
                9822,
                10048
            ],
            [
                10048,
                10123
            ],
            [
                10123,
                10167
            ],
            [
                10167,
                10207
            ],
            [
                10207,
                10472
            ],
            [
                10472,
                10703
            ],
            [
                10703,
                10777
            ],
            [
                10777,
                10832
            ],
            [
                10832,
                10947
            ],
            [
                10947,
                11008
            ],
            [
                11008,
                11081
            ],
            [
                11081,
                11463
            ],
            [
                11463,
                11614
            ],
            [
                11614,
                11705
            ],
            [
                11705,
                11741
            ],
            [
                11741,
                11890
            ],
            [
                11890,
                12302
            ],
            [
                12302,
                12310
            ],
            [
                12310,
                12319
            ],
            [
                12319,
                12367
            ],
            [
                12367,
                12378
            ],
            [
                12378,
                12474
            ],
            [
                12474,
                12540
            ],
            [
                12540,
                12750
            ],
            [
                12750,
                12914
            ],
            [
                12914,
                12954
            ],
            [
                12954,
                13032
            ],
            [
                13032,
                13067
            ],
            [
                13067,
                13138
            ],
            [
                13138,
                13193
            ],
            [
                13193,
                13235
            ],
            [
                13235,
                13267
            ],
            [
                13267,
                13630
            ],
            [
                13630,
                13733
            ],
            [
                13733,
                13821
            ],
            [
                13821,
                13843
            ],
            [
                13843,
                13861
            ],
            [
                13861,
                13980
            ],
            [
                13980,
                14047
            ],
            [
                14047,
                14088
            ],
            [
                14088,
                14129
            ],
            [
                14129,
                14211
            ],
            [
                14211,
                14333
            ],
            [
                14333,
                14486
            ],
            [
                14486,
                14507
            ],
            [
                14507,
                14543
            ],
            [
                14543,
                14696
            ],
            [
                14696,
                14718
            ],
            [
                14718,
                14765
            ],
            [
                14765,
                14769
            ],
            [
                14769,
                14921
            ],
            [
                14921,
                14966
            ],
            [
                14966,
                15066
            ],
            [
                15066,
                15147
            ],
            [
                15147,
                15227
            ],
            [
                15227,
                15308
            ],
            [
                15308,
                15375
            ],
            [
                15375,
                15391
            ],
            [
                15391,
                15405
            ],
            [
                15405,
                15436
            ],
            [
                15436,
                15817
            ],
            [
                15817,
                16049
            ],
            [
                16049,
                16399
            ],
            [
                16399,
                16501
            ],
            [
                16501,
                16709
            ],
            [
                16709,
                17480
            ],
            [
                17480,
                17769
            ],
            [
                17769,
                18019
            ],
            [
                18019,
                18099
            ],
            [
                18099,
                18280
            ],
            [
                18280,
                18499
            ],
            [
                18499,
                18763
            ],
            [
                18763,
                18920
            ],
            [
                18920,
                18928
            ],
            [
                18928,
                18942
            ],
            [
                18942,
                19007
            ],
            [
                19007,
                19190
            ],
            [
                19190,
                19297
            ],
            [
                19297,
                19359
            ],
            [
                19359,
                19371
            ],
            [
                19371,
                19545
            ],
            [
                19545,
                19635
            ],
            [
                19635,
                19737
            ],
            [
                19737,
                20017
            ],
            [
                20017,
                20039
            ],
            [
                20039,
                20058
            ],
            [
                20058,
                20080
            ],
            [
                20080,
                20138
            ],
            [
                20138,
                20145
            ],
            [
                20145,
                20218
            ],
            [
                20218,
                20270
            ],
            [
                20270,
                20325
            ],
            [
                20325,
                20519
            ],
            [
                20519,
                20740
            ],
            [
                20740,
                21290
            ],
            [
                21290,
                21443
            ],
            [
                21443,
                21589
            ],
            [
                21589,
                21992
            ],
            [
                21992,
                22058
            ],
            [
                22058,
                22174
            ],
            [
                22174,
                22225
            ],
            [
                22225,
                22335
            ],
            [
                22335,
                22351
            ],
            [
                22351,
                22436
            ],
            [
                22436,
                22475
            ],
            [
                22475,
                22567
            ],
            [
                22567,
                22721
            ],
            [
                22721,
                22815
            ],
            [
                22815,
                22856
            ],
            [
                22856,
                22941
            ],
            [
                22941,
                23057
            ],
            [
                23057,
                23163
            ],
            [
                23163,
                23211
            ],
            [
                23211,
                23314
            ],
            [
                23314,
                23371
            ],
            [
                23371,
                23506
            ],
            [
                23506,
                23806
            ],
            [
                23806,
                23897
            ],
            [
                23897,
                24056
            ],
            [
                24056,
                24063
            ],
            [
                24063,
                24108
            ],
            [
                24108,
                24167
            ],
            [
                24167,
                24224
            ],
            [
                24224,
                24329
            ],
            [
                24329,
                24401
            ],
            [
                24401,
                24469
            ],
            [
                24469,
                24568
            ],
            [
                24568,
                24583
            ],
            [
                24583,
                24671
            ],
            [
                24671,
                24792
            ],
            [
                24792,
                24830
            ],
            [
                24830,
                24856
            ],
            [
                24856,
                25013
            ],
            [
                25013,
                25079
            ],
            [
                25079,
                25185
            ],
            [
                25185,
                25275
            ],
            [
                25275,
                25432
            ],
            [
                25432,
                25548
            ],
            [
                25548,
                25594
            ],
            [
                25594,
                25844
            ],
            [
                25844,
                25929
            ],
            [
                25929,
                26006
            ],
            [
                26006,
                26018
            ],
            [
                26018,
                26054
            ],
            [
                26054,
                26114
            ],
            [
                26114,
                26193
            ],
            [
                26193,
                26254
            ],
            [
                26254,
                26321
            ],
            [
                26321,
                26338
            ],
            [
                26338,
                26432
            ],
            [
                26432,
                26514
            ],
            [
                26514,
                26581
            ],
            [
                26581,
                26699
            ],
            [
                26699,
                26769
            ],
            [
                26769,
                26810
            ],
            [
                26810,
                26852
            ],
            [
                26852,
                26871
            ],
            [
                26871,
                26916
            ],
            [
                26916,
                27031
            ],
            [
                27031,
                27049
            ],
            [
                27049,
                27090
            ],
            [
                27090,
                27109
            ],
            [
                27109,
                27216
            ],
            [
                27216,
                27293
            ],
            [
                27293,
                27327
            ],
            [
                27327,
                27403
            ],
            [
                27403,
                27438
            ],
            [
                27438,
                27498
            ],
            [
                27498,
                27587
            ],
            [
                27587,
                27693
            ],
            [
                27693,
                27743
            ],
            [
                27743,
                27799
            ],
            [
                27799,
                27876
            ],
            [
                27876,
                27948
            ],
            [
                27948,
                27983
            ],
            [
                27983,
                28002
            ],
            [
                28002,
                28020
            ],
            [
                28020,
                28050
            ],
            [
                28050,
                28058
            ],
            [
                28058,
                28071
            ],
            [
                28071,
                28139
            ],
            [
                28139,
                28170
            ],
            [
                28170,
                28190
            ],
            [
                28190,
                28299
            ],
            [
                28299,
                28498
            ],
            [
                28498,
                28600
            ],
            [
                28600,
                28619
            ],
            [
                28619,
                28646
            ],
            [
                28646,
                28716
            ],
            [
                28716,
                28812
            ],
            [
                28812,
                28899
            ],
            [
                28899,
                29134
            ],
            [
                29134,
                29198
            ],
            [
                29198,
                29407
            ],
            [
                29407,
                29443
            ],
            [
                29443,
                29469
            ],
            [
                29469,
                29679
            ],
            [
                29679,
                29697
            ],
            [
                29697,
                29727
            ],
            [
                29727,
                29739
            ],
            [
                29739,
                29765
            ],
            [
                29765,
                29906
            ],
            [
                29906,
                30016
            ],
            [
                30016,
                30074
            ],
            [
                30074,
                30139
            ],
            [
                30139,
                30188
            ],
            [
                30188,
                30240
            ],
            [
                30240,
                30289
            ],
            [
                30289,
                30351
            ],
            [
                30351,
                30361
            ],
            [
                30361,
                30382
            ],
            [
                30382,
                30448
            ],
            [
                30448,
                30476
            ],
            [
                30476,
                30486
            ],
            [
                30486,
                30532
            ],
            [
                30532,
                30804
            ],
            [
                30804,
                30899
            ],
            [
                30899,
                30982
            ],
            [
                30982,
                31034
            ],
            [
                31034,
                31040
            ],
            [
                31040,
                31133
            ],
            [
                31133,
                31369
            ],
            [
                31369,
                31391
            ],
            [
                31391,
                31581
            ],
            [
                31581,
                31614
            ],
            [
                31614,
                31722
            ],
            [
                31722,
                31766
            ],
            [
                31766,
                31835
            ],
            [
                31835,
                32163
            ],
            [
                32163,
                32172
            ],
            [
                32172,
                32247
            ],
            [
                32247,
                32389
            ],
            [
                32389,
                32433
            ],
            [
                32433,
                32442
            ],
            [
                32442,
                32590
            ],
            [
                32590,
                32647
            ],
            [
                32647,
                32698
            ],
            [
                32698,
                32721
            ],
            [
                32721,
                32767
            ],
            [
                32767,
                32817
            ],
            [
                32817,
                32858
            ],
            [
                32858,
                32877
            ],
            [
                32877,
                32907
            ],
            [
                32907,
                32941
            ],
            [
                32941,
                32995
            ],
            [
                32995,
                33145
            ],
            [
                33145,
                33169
            ],
            [
                33169,
                33198
            ],
            [
                33198,
                33378
            ],
            [
                33378,
                33579
            ],
            [
                33579,
                33691
            ],
            [
                33691,
                33840
            ],
            [
                33840,
                33899
            ],
            [
                33899,
                33977
            ],
            [
                33977,
                33999
            ],
            [
                33999,
                34020
            ],
            [
                34020,
                34104
            ],
            [
                34104,
                34226
            ],
            [
                34226,
                34305
            ],
            [
                34305,
                34451
            ],
            [
                34451,
                34509
            ],
            [
                34509,
                34674
            ],
            [
                34674,
                34788
            ],
            [
                34788,
                34828
            ],
            [
                34828,
                34844
            ],
            [
                34844,
                34991
            ],
            [
                34991,
                35133
            ],
            [
                35133,
                35242
            ],
            [
                35242,
                35281
            ],
            [
                35281,
                35402
            ],
            [
                35402,
                35442
            ],
            [
                35442,
                35490
            ]
        ],
        "overlap_chars": [
            [
                34,
                36
            ],
            [
                14,
                22
            ],
            [
                58,
                106
            ],
            [
                106,
                267
            ],
            [
                267,
                347
            ],
            [
                347,
                353
            ],
            [
                357,
                361
            ],
            [
                394,
                451
            ],
            [
                490,
                505
            ],
            [
                513,
                531
            ],
            [
                561,
                563
            ],
            [
                563,
                611
            ],
            [
                625,
                630
            ],
            [
                634,
                636
            ],
            [
                636,
                662
            ],
            [
                673,
                712
            ],
            [
                753,
                755
            ],
            [
                755,
                802
            ],
            [
                862,
                865
            ],
            [
                865,
                875
            ],
            [
                885,
                887
            ],
            [
                887,
                981
            ],
            [
                981,
                1002
            ],
            [
                1036,
                1048
            ],
            [
                1026,
                1035
            ],
            [
                1049,
                1079
            ],
            [
                1094,
                1096
            ],
            [
                1096,
                1135
            ],
            [
                1141,
                1163
            ],
            [
                1168,
                1175
            ],
            [
                1223,
                1225
            ],
            [
                1215,
                1222
            ],
            [
                1252,
                1264
            ],
            [
                1271,
                1283
            ],
            [
                1310,
                1371
            ],
            [
                1371,
                1382
            ],
            [
                1403,
                1416
            ],
            [
                1382,
                1400
            ],
            [
                1490,
                1491
            ],
            [
                1402,
                1403
            ],
            [
                1492,
                1514
            ],
            [
                1418,
                1419
            ],
            [
                1534,
                1591
            ],
            [
                1593,
                1609
            ],
            [
                1615,
                1652
            ],
            [
                1652,
                1669
            ],
            [
                1669,
                1681
            ],
            [
                1681,
                1703
            ],
            [
                1703,
                1710
            ],
            [
                1731,
                1761
            ],
            [
                1767,
                1781
            ],
            [
                1785,
                1802
            ],
            [
                1809,
                1814
            ],
            [
                1803,
                1808
            ],
            [
                1818,
                1851
            ],
            [
                1869,
                1883
            ],
            [
                1883,
                1941
            ],
            [
                1941,
                1986
            ],
            [
                1986,
                2033
            ],
            [
                2033,
                2084
            ],
            [
                2084,
                2107
            ],
            [
                2107,
                2140
            ],
            [
                2140,
                2160
            ],
            [
                2160,
                2180
            ],
            [
                2198,
                2200
            ],
            [
                2200,
                2204
            ],
            [
                2211,
                2217
            ],
            [
                2207,
                2208
            ],
            [
                2219,
                2257
            ],
            [
                2356,
                2359
            ],
            [
                2359,
                2360
            ],
            [
                2372,
                2385
            ],
            [
                2385,
                2396
            ],
            [
                2396,
                2397
            ],
            [
                2411,
                2437
            ],
            [
                2656,
                2716
            ],
            [
                2647,
                2650
            ],
            [
                2736,
                2756
            ],
            [
                2763,
                2769
            ],
            [
                2770,
                2814
            ],
            [
                2820,
                2852
            ],
            [
                2904,
                2924
            ],
            [
                2943,
                2963
            ],
            [
                2977,
                2982
            ],
            [
                3006,
                3016
            ],
            [
                3021,
                3034
            ],
            [
                3048,
                3062
            ],
            [
                3071,
                3080
            ],
            [
                3080,
                3169
            ],
            [
                3193,
                3211
            ],
            [
                3230,
                3236
            ],
            [
                3212,
                3225
            ],
            [
                3244,
                3292
            ],
            [
                3376,
                3400
            ],
            [
                3409,
                3428
            ],
            [
                3473,
                3512
            ],
            [
                3546,
                3629
            ],
            [
                3296,
                3299
            ],
            [
                3367,
                3370
            ],
            [
                3646,
                3648
            ],
            [
                3669,
                3686
            ],
            [
                3697,
                3713
            ],
            [
                3722,
                3733
            ],
            [
                3362,
                3366
            ],
            [
                3653,
                3657
            ],
            [
                3772,
                3801
            ],
            [
                3325,
                3326
            ],
            [
                3803,
                3824
            ],
            [
                3832,
                3834
            ],
            [
                3834,
                3857
            ],
            [
                3857,
                3896
            ],
            [
                3902,
                3917
            ],
            [
                3927,
                3939
            ],
            [
                3949,
                3967
            ],
            [
                3967,
                3980
            ],
            [
                3981,
                3999
            ],
            [
                4014,
                4081
            ],
            [
                4081,
                4089
            ],
            [
                4101,
                4126
            ],
            [
                4140,
                4166
            ],
            [
                4310,
                4338
            ],
            [
                4354,
                4419
            ],
            [
                4735,
                4738
            ],
            [
                4783,
                4807
            ],
            [
                4746,
                4782
            ],
            [
                4812,
                4824
            ],
            [
                4836,
                4866
            ],
            [
                4995,
                4997
            ],
            [
                5076,
                5092
            ],
            [
                5105,
                5130
            ],
            [
                5147,
                5152
            ],
            [
                5167,
                5208
            ],
            [
                5269,
                5355
            ],
            [
                5050,
                5051
            ],
            [
                5441,
                5442
            ],
            [
                5448,
                5492
            ],
            [
                5694,
                5728
            ],
            [
                5728,
                5729
            ],
            [
                5739,
                5756
            ],
            [
                5766,
                5782
            ],
            [
                5801,
                5809
            ],
            [
                5849,
                5852
            ],
            [
                5859,
                5880
            ],
            [
                5893,
                5920
            ],
            [
                6053,
                6055
            ],
            [
                6055,
                6098
            ],
            [
                6122,
                6149
            ],
            [
                6200,
                6217
            ],
            [
                6229,
                6245
            ],
            [
                6258,
                6260
            ],
            [
                6428,
                6431
            ],
            [
                6443,
                6445
            ],
            [
                6274,
                6278
            ],
            [
                6299,
                6300
            ],
            [
                6459,
                6473
            ],
            [
                6488,
                6509
            ],
            [
                6509,
                6568
            ],
            [
                6572,
                6595
            ],
            [
                6612,
                6614
            ],
            [
                6614,
                6633
            ],
            [
                6663,
                6694
            ],
            [
                6708,
                6718
            ],
            [
                6736,
                6748
            ],
            [
                6775,
                6783
            ],
            [
                6789,
                6793
            ],
            [
                6811,
                6838
            ],
            [
                6858,
                6869
            ],
            [
                6884,
                6918
            ],
            [
                7042,
                7106
            ],
            [
                7117,
                7119
            ],
            [
                7119,
                7142
            ],
            [
                7158,
                7166
            ],
            [
                7196,
                7199
            ],
            [
                7199,
                7242
            ],
            [
                7249,
                7253
            ],
            [
                7253,
                7255
            ],
            [
                7255,
                7256
            ],
            [
                7266,
                7283
            ],
            [
                7283,
                7287
            ],
            [
                7359,
                7362
            ],
            [
                7412,
                7424
            ],
            [
                7388,
                7389
            ],
            [
                7426,
                7460
            ],
            [
                7460,
                7468
            ],
            [
                7482,
                7536
            ],
            [
                7536,
                7568
            ],
            [
                7632,
                7635
            ],
            [
                7635,
                7636
            ],
            [
                7639,
                7686
            ],
            [
                7701,
                7752
            ],
            [
                7869,
                7873
            ],
            [
                7885,
                7911
            ],
            [
                7911,
                7931
            ],
            [
                7952,
                7964
            ],
            [
                7964,
                8019
            ],
            [
                8194,
                8216
            ],
            [
                8216,
                8219
            ],
            [
                8249,
                8290
            ],
            [
                8306,
                8307
            ],
            [
                8324,
                8353
            ],
            [
                8353,
                8362
            ],
            [
                8513,
                8546
            ],
            [
                8547,
                8628
            ],
            [
                8665,
                8736
            ],
            [
                8736,
                8775
            ],
            [
                8788,
                8789
            ],
            [
                8794,
                8799
            ],
            [
                8818,
                8824
            ],
            [
                8850,
                8853
            ],
            [
                8845,
                8849
            ],
            [
                8854,
                8941
            ],
            [
                8952,
                8988
            ],
            [
                8988,
                9003
            ],
            [
                9017,
                9031
            ],
            [
                9042,
                9081
            ],
            [
                9123,
                9149
            ],
            [
                9149,
                9206
            ],
            [
                9240,
                9279
            ],
            [
                9296,
                9304
            ],
            [
                9228,
                9238
            ],
            [
                9347,
                9417
            ],
            [
                9450,
                9454
            ],
            [
                9459,
                9507
            ],
            [
                9507,
                9547
            ],
            [
                9547,
                9558
            ],
            [
                9585,
                9588
            ],
            [
                9604,
                9640
            ],
            [
                9652,
                9664
            ],
            [
                9726,
                9744
            ],
            [
                9712,
                9714
            ],
            [
                9744,
                9778
            ],
            [
                9794,
                9796
            ],
            [
                9812,
                9821
            ],
            [
                10048,
                10123
            ],
            [
                10123,
                10167
            ],
            [
                10167,
                10207
            ],
            [
                10211,
                10217
            ],
            [
                10249,
                10253
            ],
            [
                10384,
                10417
            ],
            [
                10432,
                10458
            ],
            [
                10464,
                10472
            ],
            [
                10472,
                10525
            ],
            [
                10591,
                10612
            ],
            [
                10628,
                10703
            ],
            [
                10703,
                10755
            ],
            [
                10766,
                10767
            ],
            [
                10777,
                10808
            ],
            [
                10818,
                10832
            ],
            [
                10832,
                10947
            ],
            [
                10947,
                10975
            ],
            [
                10975,
                10980
            ],
            [
                11005,
                11008
            ],
            [
                11008,
                11017
            ],
            [
                11025,
                11050
            ],
            [
                11079,
                11081
            ],
            [
                11081,
                11130
            ],
            [
                11162,
                11178
            ],
            [
                11203,
                11278
            ],
            [
                11307,
                11317
            ],
            [
                11319,
                11326
            ],
            [
                11362,
                11373
            ],
            [
                11461,
                11463
            ],
            [
                11463,
                11505
            ],
            [
                11612,
                11614
            ],
            [
                11614,
                11637
            ],
            [
                11653,
                11703
            ],
            [
                11716,
                11741
            ],
            [
                11890,
                11900
            ],
            [
                11914,
                11959
            ],
            [
                11960,
                11997
            ],
            [
                12079,
                12129
            ],
            [
                12300,
                12302
            ],
            [
                12302,
                12310
            ],
            [
                12310,
                12314
            ],
            [
                12317,
                12319
            ],
            [
                12319,
                12367
            ],
            [
                12367,
                12378
            ],
            [
                12378,
                12474
            ],
            [
                12474,
                12500
            ],
            [
                12521,
                12538
            ],
            [
                12500,
                12501
            ],
            [
                12510,
                12521
            ],
            [
                12540,
                12549
            ],
            [
                12810,
                12813
            ],
            [
                12558,
                12570
            ],
            [
                12611,
                12612
            ],
            [
                12754,
                12791
            ],
            [
                12824,
                12862
            ],
            [
                12880,
                12893
            ],
            [
                12905,
                12913
            ],
            [
                12954,
                13014
            ],
            [
                13020,
                13032
            ],
            [
                13044,
                13067
            ],
            [
                13067,
                13098
            ],
            [
                13136,
                13138
            ],
            [
                13138,
                13193
            ],
            [
                13193,
                13235
            ],
            [
                13235,
                13267
            ],
            [
                13267,
                13334
            ],
            [
                13374,
                13381
            ],
            [
                13398,
                13404
            ],
            [
                13422,
                13491
            ],
            [
                13506,
                13510
            ],
            [
                13549,
                13553
            ],
            [
                13568,
                13575
            ],
            [
                13554,
                13563
            ],
            [
                13608,
                13630
            ],
            [
                13630,
                13645
            ],
            [
                13657,
                13671
            ],
            [
                13683,
                13690
            ],
            [
                13672,
                13679
            ],
            [
                13730,
                13733
            ],
            [
                13733,
                13819
            ],
            [
                13843,
                13861
            ],
            [
                13861,
                13862
            ],
            [
                13927,
                13980
            ],
            [
                13980,
                13985
            ],
            [
                14047,
                14065
            ],
            [
                14008,
                14016
            ],
            [
                14021,
                14045
            ],
            [
                14086,
                14088
            ],
            [
                14088,
                14116
            ],
            [
                14129,
                14211
            ],
            [
                14242,
                14246
            ],
            [
                14251,
                14333
            ],
            [
                14333,
                14336
            ],
            [
                14371,
                14418
            ],
            [
                14484,
                14486
            ],
            [
                14486,
                14507
            ],
            [
                14507,
                14516
            ],
            [
                14541,
                14543
            ],
            [
                14543,
                14586
            ],
            [
                14593,
                14626
            ],
            [
                14694,
                14696
            ],
            [
                14718,
                14765
            ],
            [
                14765,
                14769
            ],
            [
                14769,
                14874
            ],
            [
                14876,
                14878
            ],
            [
                14883,
                14921
            ],
            [
                14921,
                14966
            ],
            [
                14986,
                15020
            ],
            [
                15025,
                15038
            ],
            [
                14966,
                14969
            ],
            [
                15053,
                15066
            ],
            [
                15066,
                15084
            ],
            [
                15109,
                15117
            ],
            [
                15098,
                15101
            ],
            [
                15145,
                15147
            ],
            [
                15147,
                15156
            ],
            [
                15163,
                15190
            ],
            [
                15197,
                15216
            ],
            [
                15225,
                15227
            ],
            [
                15227,
                15236
            ],
            [
                15273,
                15306
            ],
            [
                15375,
                15391
            ],
            [
                15391,
                15405
            ],
            [
                15405,
                15416
            ],
            [
                15434,
                15436
            ],
            [
                15436,
                15488
            ],
            [
                15490,
                15498
            ],
            [
                15527,
                15548
            ],
            [
                15520,
                15521
            ],
            [
                15681,
                15735
            ],
            [
                15751,
                15817
            ],
            [
                15817,
                15824
            ],
            [
                15888,
                15929
            ],
            [
                15937,
                15941
            ],
            [
                15957,
                15980
            ],
            [
                15833,
                15835
            ],
            [
                16025,
                16049
            ],
            [
                16049,
                16051
            ],
            [
                16072,
                16082
            ],
            [
                16102,
                16105
            ],
            [
                16083,
                16091
            ],
            [
                16105,
                16172
            ],
            [
                16197,
                16210
            ],
            [
                16250,
                16303
            ],
            [
                16173,
                16176
            ],
            [
                16304,
                16344
            ],
            [
                16373,
                16380
            ],
            [
                16382,
                16399
            ],
            [
                16399,
                16500
            ],
            [
                16709,
                16712
            ],
            [
                16716,
                16777
            ],
            [
                16805,
                16810
            ],
            [
                16802,
                16805
            ],
            [
                16824,
                16827
            ],
            [
                16841,
                16881
            ],
            [
                16929,
                16939
            ],
            [
                16882,
                16891
            ],
            [
                16913,
                16925
            ],
            [
                17088,
                17230
            ],
            [
                17241,
                17267
            ],
            [
                17269,
                17277
            ],
            [
                17306,
                17312
            ],
            [
                17318,
                17321
            ],
            [
                17374,
                17402
            ],
            [
                17070,
                17074
            ],
            [
                17455,
                17458
            ],
            [
                17464,
                17480
            ],
            [
                17480,
                17547
            ],
            [
                17562,
                17593
            ],
            [
                17598,
                17610
            ],
            [
                17619,
                17622
            ],
            [
                17632,
                17645
            ],
            [
                17686,
                17696
            ],
            [
                17725,
                17769
            ],
            [
                17769,
                17773
            ],
            [
                17786,
                17897
            ],
            [
                17899,
                17965
            ],
            [
                17969,
                17998
            ],
            [
                18017,
                18019
            ],
            [
                18106,
                18157
            ],
            [
                18175,
                18180
            ],
            [
                18194,
                18201
            ],
            [
                18181,
                18184
            ],
            [
                18099,
                18102
            ],
            [
                18278,
                18280
            ],
            [
                18295,
                18356
            ],
            [
                18390,
                18426
            ],
            [
                18430,
                18435
            ],
            [
                18444,
                18452
            ],
            [
                18497,
                18499
            ],
            [
                18763,
                18792
            ],
            [
                18797,
                18808
            ],
            [
                18884,
                18890
            ],
            [
                18857,
                18860
            ],
            [
                18892,
                18902
            ],
            [
                18906,
                18919
            ],
            [
                18920,
                18928
            ],
            [
                18928,
                18942
            ],
            [
                18962,
                18967
            ],
            [
                19005,
                19006
            ],
            [
                19007,
                19104
            ],
            [
                19152,
                19190
            ],
            [
                19190,
                19234
            ],
            [
                19236,
                19253
            ],
            [
                19255,
                19296
            ],
            [
                19297,
                19359
            ],
            [
                19359,
                19371
            ],
            [
                19371,
                19379
            ],
            [
                19543,
                19544
            ],
            [
                19381,
                19400
            ],
            [
                19404,
                19422
            ],
            [
                19440,
                19463
            ],
            [
                19545,
                19553
            ],
            [
                19589,
                19601
            ],
            [
                19611,
                19634
            ],
            [
                19635,
                19645
            ],
            [
                19652,
                19653
            ],
            [
                19700,
                19737
            ],
            [
                19737,
                19743
            ],
            [
                19751,
                19771
            ],
            [
                19813,
                19848
            ],
            [
                19863,
                19915
            ],
            [
                19973,
                20017
            ],
            [
                20017,
                20039
            ],
            [
                20039,
                20058
            ],
            [
                20058,
                20080
            ],
            [
                20080,
                20138
            ],
            [
                20138,
                20145
            ],
            [
                20145,
                20218
            ],
            [
                20218,
                20270
            ],
            [
                20270,
                20274
            ],
            [
                20283,
                20294
            ],
            [
                20325,
                20340
            ],
            [
                20347,
                20389
            ],
            [
                20398,
                20408
            ],
            [
                20517,
                20519
            ],
            [
                20519,
                20559
            ],
            [
                20626,
                20679
            ],
            [
                20701,
                20740
            ],
            [
                20775,
                20782
            ],
            [
                21128,
                21131
            ],
            [
                20792,
                20802
            ],
            [
                20813,
                20873
            ],
            [
                20922,
                20927
            ],
            [
                20933,
                20984
            ],
            [
                21027,
                21033
            ],
            [
                21038,
                21046
            ],
            [
                21058,
                21085
            ],
            [
                21114,
                21127
            ],
            [
                21288,
                21289
            ],
            [
                21446,
                21487
            ],
            [
                21523,
                21559
            ],
            [
                21587,
                21589
            ],
            [
                21589,
                21648
            ],
            [
                21653,
                21709
            ],
            [
                21733,
                21772
            ],
            [
                21921,
                21923
            ],
            [
                21778,
                21848
            ],
            [
                21990,
                21992
            ],
            [
                22144,
                22172
            ],
            [
                22080,
                22083
            ],
            [
                22215,
                22223
            ],
            [
                22174,
                22179
            ],
            [
                22223,
                22225
            ],
            [
                22235,
                22245
            ],
            [
                22250,
                22257
            ],
            [
                22266,
                22335
            ],
            [
                22335,
                22351
            ],
            [
                22351,
                22412
            ],
            [
                22422,
                22426
            ],
            [
                22431,
                22436
            ],
            [
                22475,
                22567
            ],
            [
                22599,
                22721
            ],
            [
                22721,
                22804
            ],
            [
                22805,
                22815
            ],
            [
                22815,
                22843
            ],
            [
                22849,
                22854
            ],
            [
                22869,
                22880
            ],
            [
                22889,
                22941
            ],
            [
                22941,
                23057
            ],
            [
                23057,
                23082
            ],
            [
                23087,
                23105
            ],
            [
                23137,
                23138
            ],
            [
                23106,
                23117
            ],
            [
                23139,
                23146
            ],
            [
                23148,
                23163
            ],
            [
                23182,
                23200
            ],
            [
                23163,
                23167
            ],
            [
                23204,
                23211
            ],
            [
                23211,
                23296
            ],
            [
                23301,
                23313
            ],
            [
                23506,
                23510
            ],
            [
                23520,
                23592
            ],
            [
                23593,
                23627
            ],
            [
                23685,
                23696
            ],
            [
                23715,
                23729
            ],
            [
                23733,
                23788
            ],
            [
                23804,
                23806
            ],
            [
                23806,
                23874
            ],
            [
                23895,
                23897
            ],
            [
                23897,
                23931
            ],
            [
                23933,
                23935
            ],
            [
                23937,
                24049
            ],
            [
                24053,
                24056
            ],
            [
                24056,
                24063
            ],
            [
                24069,
                24108
            ],
            [
                24108,
                24130
            ],
            [
                24132,
                24143
            ],
            [
                24165,
                24167
            ],
            [
                24167,
                24224
            ],
            [
                24224,
                24329
            ],
            [
                24329,
                24401
            ],
            [
                24401,
                24402
            ],
            [
                24435,
                24469
            ],
            [
                24469,
                24472
            ],
            [
                24490,
                24521
            ],
            [
                24473,
                24475
            ],
            [
                24526,
                24568
            ],
            [
                24568,
                24583
            ],
            [
                24583,
                24671
            ],
            [
                24671,
                24690
            ],
            [
                24697,
                24745
            ],
            [
                24779,
                24792
            ],
            [
                24792,
                24830
            ],
            [
                24830,
                24856
            ],
            [
                24856,
                24879
            ],
            [
                24893,
                24958
            ],
            [
                24959,
                24968
            ],
            [
                24969,
                25013
            ],
            [
                25013,
                25079
            ],
            [
                25079,
                25185
            ],
            [
                25185,
                25275
            ],
            [
                25275,
                25289
            ],
            [
                25291,
                25294
            ],
            [
                25322,
                25352
            ],
            [
                25306,
                25320
            ],
            [
                25354,
                25366
            ],
            [
                25372,
                25432
            ],
            [
                25432,
                25544
            ],
            [
                25548,
                25594
            ],
            [
                25597,
                25717
            ],
            [
                25747,
                25820
            ],
            [
                25829,
                25844
            ],
            [
                25844,
                25860
            ],
            [
                25872,
                25929
            ],
            [
                25929,
                26006
            ],
            [
                26006,
                26018
            ],
            [
                26018,
                26054
            ],
            [
                26054,
                26093
            ],
            [
                26112,
                26114
            ],
            [
                26114,
                26193
            ],
            [
                26193,
                26254
            ],
            [
                26254,
                26321
            ],
            [
                26321,
                26338
            ],
            [
                26389,
                26402
            ],
            [
                26410,
                26432
            ],
            [
                26481,
                26514
            ],
            [
                26514,
                26560
            ],
            [
                26566,
                26581
            ],
            [
                26581,
                26618
            ],
            [
                26620,
                26635
            ],
            [
                26697,
                26699
            ],
            [
                26699,
                26769
            ],
            [
                26769,
                26810
            ],
            [
                26810,
                26848
            ],
            [
                26852,
                26871
            ],
            [
                26871,
                26887
            ],
            [
                26888,
                26916
            ],
            [
                26916,
                26923
            ],
            [
                26972,
                26982
            ],
            [
                26992,
                27031
            ],
            [
                27031,
                27049
            ],
            [
                27049,
                27071
            ],
            [
                27080,
                27090
            ],
            [
                27090,
                27109
            ],
            [
                27109,
                27172
            ],
            [
                27174,
                27216
            ],
            [
                27216,
                27293
            ],
            [
                27293,
                27327
            ],
            [
                27327,
                27403
            ],
            [
                27403,
                27421
            ],
            [
                27428,
                27438
            ],
            [
                27438,
                27498
            ],
            [
                27498,
                27518
            ],
            [
                27545,
                27587
            ],
            [
                27587,
                27693
            ],
            [
                27693,
                27715
            ],
            [
                27741,
                27743
            ],
            [
                27743,
                27799
            ],
            [
                27799,
                27853
            ],
            [
                27876,
                27933
            ],
            [
                27942,
                27948
            ],
            [
                27948,
                27983
            ],
            [
                27983,
                28002
            ],
            [
                28002,
                28020
            ],
            [
                28020,
                28050
            ],
            [
                28050,
                28058
            ],
            [
                28058,
                28071
            ],
            [
                28071,
                28139
            ],
            [
                28139,
                28170
            ],
            [
                28170,
                28190
            ],
            [
                28190,
                28299
            ],
            [
                28299,
                28498
            ],
            [
                28498,
                28517
            ],
            [
                28524,
                28600
            ],
            [
                28600,
                28618
            ],
            [
                28619,
                28646
            ],
            [
                28646,
                28716
            ],
            [
                28716,
                28723
            ],
            [
                28728,
                28812
            ],
            [
                28812,
                28830
            ],
            [
                28844,
                28899
            ],
            [
                28899,
                29134
            ],
            [
                29134,
                29198
            ],
            [
                29198,
                29315
            ],
            [
                29321,
                29338
            ],
            [
                29346,
                29407
            ],
            [
                29407,
                29443
            ],
            [
                29443,
                29469
            ],
            [
                29469,
                29537
            ],
            [
                29539,
                29679
            ],
            [
                29679,
                29697
            ],
            [
                29697,
                29727
            ],
            [
                29727,
                29739
            ],
            [
                29739,
                29765
            ],
            [
                29765,
                29906
            ],
            [
                29906,
                30016
            ],
            [
                30016,
                30074
            ],
            [
                30074,
                30139
            ],
            [
                30208,
                30213
            ],
            [
                30225,
                30229
            ],
            [
                30234,
                30239
            ],
            [
                30289,
                30333
            ],
            [
                30335,
                30351
            ],
            [
                30351,
                30361
            ],
            [
                30361,
                30382
            ],
            [
                30382,
                30401
            ],
            [
                30411,
                30412
            ],
            [
                30414,
                30448
            ],
            [
                30448,
                30476
            ],
            [
                30476,
                30486
            ],
            [
                30486,
                30532
            ],
            [
                30532,
                30645
            ],
            [
                30648,
                30666
            ],
            [
                30722,
                30727
            ],
            [
                30732,
                30768
            ],
            [
                30802,
                30803
            ],
            [
                30804,
                30899
            ],
            [
                30899,
                30982
            ],
            [
                30982,
                31034
            ],
            [
                31034,
                31040
            ],
            [
                31040,
                31096
            ],
            [
                31098,
                31133
            ],
            [
                31133,
                31171
            ],
            [
                31178,
                31204
            ],
            [
                31252,
                31307
            ],
            [
                31309,
                31330
            ],
            [
                31336,
                31350
            ],
            [
                31357,
                31369
            ],
            [
                31369,
                31391
            ],
            [
                31391,
                31467
            ],
            [
                31498,
                31580
            ],
            [
                31614,
                31616
            ],
            [
                31638,
                31656
            ],
            [
                31681,
                31722
            ],
            [
                31722,
                31751
            ],
            [
                31764,
                31766
            ],
            [
                31766,
                31780
            ],
            [
                31781,
                31784
            ],
            [
                31791,
                31811
            ],
            [
                31819,
                31835
            ],
            [
                31835,
                31896
            ],
            [
                31897,
                31904
            ],
            [
                31987,
                31989
            ],
            [
                31999,
                32016
            ],
            [
                32071,
                32078
            ],
            [
                32100,
                32163
            ],
            [
                32163,
                32172
            ],
            [
                32172,
                32195
            ],
            [
                32202,
                32246
            ],
            [
                32389,
                32433
            ],
            [
                32433,
                32442
            ],
            [
                32442,
                32514
            ],
            [
                32521,
                32524
            ],
            [
                32534,
                32543
            ],
            [
                32588,
                32590
            ],
            [
                32647,
                32650
            ],
            [
                32652,
                32698
            ],
            [
                32698,
                32721
            ],
            [
                32721,
                32767
            ],
            [
                32767,
                32768
            ],
            [
                32788,
                32817
            ],
            [
                32817,
                32823
            ],
            [
                32825,
                32858
            ],
            [
                32858,
                32877
            ],
            [
                32877,
                32906
            ],
            [
                32907,
                32940
            ],
            [
                32941,
                32995
            ],
            [
                32995,
                33034
            ],
            [
                33091,
                33094
            ],
            [
                33035,
                33079
            ],
            [
                33119,
                33145
            ],
            [
                33145,
                33169
            ],
            [
                33169,
                33198
            ],
            [
                33198,
                33258
            ],
            [
                33275,
                33297
            ],
            [
                33302,
                33307
            ],
            [
                33355,
                33361
            ],
            [
                33308,
                33344
            ],
            [
                33362,
                33378
            ],
            [
                33383,
                33424
            ],
            [
                33448,
                33465
            ],
            [
                33470,
                33507
            ],
            [
                33577,
                33579
            ],
            [
                33579,
                33691
            ],
            [
                33691,
                33742
            ],
            [
                33793,
                33811
            ],
            [
                33813,
                33840
            ],
            [
                33840,
                33899
            ],
            [
                33899,
                33921
            ],
            [
                33922,
                33937
            ],
            [
                33975,
                33977
            ],
            [
                33977,
                33999
            ],
            [
                33999,
                34019
            ],
            [
                34020,
                34104
            ],
            [
                34104,
                34106
            ],
            [
                34111,
                34161
            ],
            [
                34224,
                34226
            ],
            [
                34226,
                34260
            ],
            [
                34305,
                34322
            ],
            [
                34333,
                34376
            ],
            [
                34418,
                34451
            ],
            [
                34451,
                34509
            ],
            [
                34509,
                34523
            ],
            [
                34527,
                34529
            ],
            [
                34537,
                34545
            ],
            [
                34609,
                34612
            ],
            [
                34549,
                34568
            ],
            [
                34570,
                34587
            ],
            [
                34600,
                34607
            ],
            [
                34613,
                34674
            ],
            [
                34674,
                34757
            ],
            [
                34786,
                34787
            ],
            [
                34844,
                34847
            ],
            [
                34855,
                34881
            ],
            [
                34894,
                34925
            ],
            [
                34951,
                34954
            ],
            [
                34926,
                34935
            ],
            [
                34955,
                34961
            ],
            [
                34989,
                34991
            ],
            [
                34991,
                35102
            ],
            [
                35131,
                35133
            ],
            [
                35133,
                35242
            ],
            [
                35242,
                35281
            ],
            [
                35281,
                35294
            ],
            [
                35315,
                35327
            ],
            [
                35356,
                35402
            ],
            [
                35402,
                35442
            ],
            [
                35442,
                35490
            ]
        ],
        "row_chars": [
            [
                0,
                106
            ],
            [
                106,
                267
            ],
            [
                267,
                347
            ],
            [
                347,
                563
            ],
            [
                563,
                611
            ],
            [
                611,
                636
            ],
            [
                636,
                755
            ],
            [
                755,
                865
            ],
            [
                865,
                887
            ],
            [
                887,
                981
            ],
            [
                981,
                1096
            ],
            [
                1096,
                1163
            ],
            [
                1163,
                1371
            ],
            [
                1371,
                1652
            ],
            [
                1652,
                1669
            ],
            [
                1669,
                1681
            ],
            [
                1681,
                1703
            ],
            [
                1703,
                1713
            ],
            [
                1713,
                1730
            ],
            [
                1730,
                1785
            ],
            [
                1785,
                1883
            ],
            [
                1883,
                1941
            ],
            [
                1941,
                1986
            ],
            [
                1986,
                2033
            ],
            [
                2033,
                2084
            ],
            [
                2084,
                2107
            ],
            [
                2107,
                2140
            ],
            [
                2140,
                2160
            ],
            [
                2160,
                2200
            ],
            [
                2200,
                2359
            ],
            [
                2359,
                2385
            ],
            [
                2385,
                2396
            ],
            [
                2396,
                2770
            ],
            [
                2770,
                2853
            ],
            [
                2853,
                2904
            ],
            [
                2904,
                3080
            ],
            [
                3080,
                3834
            ],
            [
                3834,
                3857
            ],
            [
                3857,
                3967
            ],
            [
                3967,
                4081
            ],
            [
                4081,
                4166
            ],
            [
                4166,
                4306
            ],
            [
                4306,
                4419
            ],
            [
                4419,
                4593
            ],
            [
                4593,
                4619
            ],
            [
                4619,
                4661
            ],
            [
                4661,
                4735
            ],
            [
                4735,
                4997
            ],
            [
                4997,
                5492
            ],
            [
                5492,
                5640
            ],
            [
                5640,
                6055
            ],
            [
                6055,
                6260
            ],
            [
                6260,
                6509
            ],
            [
                6509,
                6614
            ],
            [
                6614,
                6918
            ],
            [
                6918,
                7042
            ],
            [
                7042,
                7119
            ],
            [
                7119,
                7199
            ],
            [
                7199,
                7255
            ],
            [
                7255,
                7283
            ],
            [
                7283,
                7344
            ],
            [
                7344,
                7460
            ],
            [
                7460,
                7536
            ],
            [
                7536,
                7635
            ],
            [
                7635,
                7752
            ],
            [
                7752,
                7869
            ],
            [
                7869,
                7911
            ],
            [
                7911,
                7964
            ],
            [
                7964,
                8019
            ],
            [
                8019,
                8171
            ],
            [
                8171,
                8189
            ],
            [
                8189,
                8216
            ],
            [
                8216,
                8353
            ],
            [
                8353,
                8547
            ],
            [
                8547,
                8736
            ],
            [
                8736,
                8988
            ],
            [
                8988,
                9149
            ],
            [
                9149,
                9417
            ],
            [
                9417,
                9450
            ],
            [
                9450,
                9507
            ],
            [
                9507,
                9547
            ],
            [
                9547,
                9822
            ],
            [
                9822,
                10048
            ],
            [
                10048,
                10123
            ],
            [
                10123,
                10167
            ],
            [
                10167,
                10207
            ],
            [
                10207,
                10472
            ],
            [
                10472,
                10703
            ],
            [
                10703,
                10832
            ],
            [
                10832,
                10947
            ],
            [
                10947,
                11008
            ],
            [
                11008,
                11081
            ],
            [
                11081,
                11463
            ],
            [
                11463,
                11614
            ],
            [
                11614,
                11741
            ],
            [
                11741,
                11890
            ],
            [
                11890,
                12302
            ],
            [
                12302,
                12310
            ],
            [
                12310,
                12319
            ],
            [
                12319,
                12367
            ],
            [
                12367,
                12378
            ],
            [
                12378,
                12474
            ],
            [
                12474,
                12540
            ],
            [
                12540,
                12914
            ],
            [
                12914,
                12954
            ],
            [
                12954,
                13032
            ],
            [
                13032,
                13067
            ],
            [
                13067,
                13138
            ],
            [
                13138,
                13193
            ],
            [
                13193,
                13235
            ],
            [
                13235,
                13267
            ],
            [
                13267,
                13630
            ],
            [
                13630,
                13733
            ],
            [
                13733,
                13821
            ],
            [
                13821,
                13843
            ],
            [
                13843,
                13861
            ],
            [
                13861,
                13980
            ],
            [
                13980,
                14088
            ],
            [
                14088,
                14129
            ],
            [
                14129,
                14211
            ],
            [
                14211,
                14333
            ],
            [
                14333,
                14486
            ],
            [
                14486,
                14507
            ],
            [
                14507,
                14543
            ],
            [
                14543,
                14696
            ],
            [
                14696,
                14718
            ],
            [
                14718,
                14765
            ],
            [
                14765,
                14769
            ],
            [
                14769,
                14921
            ],
            [
                14921,
                14966
            ],
            [
                14966,
                15066
            ],
            [
                15066,
                15147
            ],
            [
                15147,
                15227
            ],
            [
                15227,
                15308
            ],
            [
                15308,
                15375
            ],
            [
                15375,
                15391
            ],
            [
                15391,
                15405
            ],
            [
                15405,
                15436
            ],
            [
                15436,
                15817
            ],
            [
                15817,
                16049
            ],
            [
                16049,
                16399
            ],
            [
                16399,
                16501
            ],
            [
                16501,
                16709
            ],
            [
                16709,
                17480
            ],
            [
                17480,
                17769
            ],
            [
                17769,
                18019
            ],
            [
                18019,
                18099
            ],
            [
                18099,
                18280
            ],
            [
                18280,
                18499
            ],
            [
                18499,
                18763
            ],
            [
                18763,
                18920
            ],
            [
                18920,
                18928
            ],
            [
                18928,
                18942
            ],
            [
                18942,
                19007
            ],
            [
                19007,
                19190
            ],
            [
                19190,
                19297
            ],
            [
                19297,
                19359
            ],
            [
                19359,
                19371
            ],
            [
                19371,
                19545
            ],
            [
                19545,
                19635
            ],
            [
                19635,
                19737
            ],
            [
                19737,
                20017
            ],
            [
                20017,
                20039
            ],
            [
                20039,
                20058
            ],
            [
                20058,
                20080
            ],
            [
                20080,
                20138
            ],
            [
                20138,
                20145
            ],
            [
                20145,
                20218
            ],
            [
                20218,
                20270
            ],
            [
                20270,
                20325
            ],
            [
                20325,
                20519
            ],
            [
                20519,
                20740
            ],
            [
                20740,
                21290
            ],
            [
                21290,
                21443
            ],
            [
                21443,
                21589
            ],
            [
                21589,
                21992
            ],
            [
                21992,
                22058
            ],
            [
                22058,
                22225
            ],
            [
                22225,
                22335
            ],
            [
                22335,
                22351
            ],
            [
                22351,
                22436
            ],
            [
                22436,
                22475
            ],
            [
                22475,
                22567
            ],
            [
                22567,
                22721
            ],
            [
                22721,
                22815
            ],
            [
                22815,
                22941
            ],
            [
                22941,
                23057
            ],
            [
                23057,
                23163
            ],
            [
                23163,
                23211
            ],
            [
                23211,
                23314
            ],
            [
                23314,
                23371
            ],
            [
                23371,
                23506
            ],
            [
                23506,
                23806
            ],
            [
                23806,
                23897
            ],
            [
                23897,
                24056
            ],
            [
                24056,
                24063
            ],
            [
                24063,
                24108
            ],
            [
                24108,
                24167
            ],
            [
                24167,
                24224
            ],
            [
                24224,
                24329
            ],
            [
                24329,
                24401
            ],
            [
                24401,
                24469
            ],
            [
                24469,
                24568
            ],
            [
                24568,
                24583
            ],
            [
                24583,
                24671
            ],
            [
                24671,
                24792
            ],
            [
                24792,
                24830
            ],
            [
                24830,
                24856
            ],
            [
                24856,
                25013
            ],
            [
                25013,
                25079
            ],
            [
                25079,
                25185
            ],
            [
                25185,
                25275
            ],
            [
                25275,
                25432
            ],
            [
                25432,
                25548
            ],
            [
                25548,
                25594
            ],
            [
                25594,
                25844
            ],
            [
                25844,
                25929
            ],
            [
                25929,
                26006
            ],
            [
                26006,
                26018
            ],
            [
                26018,
                26054
            ],
            [
                26054,
                26114
            ],
            [
                26114,
                26193
            ],
            [
                26193,
                26254
            ],
            [
                26254,
                26321
            ],
            [
                26321,
                26338
            ],
            [
                26338,
                26432
            ],
            [
                26432,
                26514
            ],
            [
                26514,
                26581
            ],
            [
                26581,
                26699
            ],
            [
                26699,
                26769
            ],
            [
                26769,
                26810
            ],
            [
                26810,
                26852
            ],
            [
                26852,
                26871
            ],
            [
                26871,
                26916
            ],
            [
                26916,
                27031
            ],
            [
                27031,
                27049
            ],
            [
                27049,
                27090
            ],
            [
                27090,
                27109
            ],
            [
                27109,
                27216
            ],
            [
                27216,
                27293
            ],
            [
                27293,
                27327
            ],
            [
                27327,
                27403
            ],
            [
                27403,
                27438
            ],
            [
                27438,
                27498
            ],
            [
                27498,
                27587
            ],
            [
                27587,
                27693
            ],
            [
                27693,
                27743
            ],
            [
                27743,
                27799
            ],
            [
                27799,
                27876
            ],
            [
                27876,
                27948
            ],
            [
                27948,
                27983
            ],
            [
                27983,
                28002
            ],
            [
                28002,
                28020
            ],
            [
                28020,
                28050
            ],
            [
                28050,
                28058
            ],
            [
                28058,
                28071
            ],
            [
                28071,
                28139
            ],
            [
                28139,
                28170
            ],
            [
                28170,
                28190
            ],
            [
                28190,
                28299
            ],
            [
                28299,
                28498
            ],
            [
                28498,
                28600
            ],
            [
                28600,
                28619
            ],
            [
                28619,
                28646
            ],
            [
                28646,
                28716
            ],
            [
                28716,
                28812
            ],
            [
                28812,
                28899
            ],
            [
                28899,
                29134
            ],
            [
                29134,
                29198
            ],
            [
                29198,
                29407
            ],
            [
                29407,
                29443
            ],
            [
                29443,
                29469
            ],
            [
                29469,
                29679
            ],
            [
                29679,
                29697
            ],
            [
                29697,
                29727
            ],
            [
                29727,
                29739
            ],
            [
                29739,
                29765
            ],
            [
                29765,
                29906
            ],
            [
                29906,
                30016
            ],
            [
                30016,
                30074
            ],
            [
                30074,
                30139
            ],
            [
                30139,
                30188
            ],
            [
                30188,
                30240
            ],
            [
                30240,
                30289
            ],
            [
                30289,
                30351
            ],
            [
                30351,
                30361
            ],
            [
                30361,
                30382
            ],
            [
                30382,
                30448
            ],
            [
                30448,
                30476
            ],
            [
                30476,
                30486
            ],
            [
                30486,
                30532
            ],
            [
                30532,
                30804
            ],
            [
                30804,
                30899
            ],
            [
                30899,
                30982
            ],
            [
                30982,
                31034
            ],
            [
                31034,
                31040
            ],
            [
                31040,
                31133
            ],
            [
                31133,
                31369
            ],
            [
                31369,
                31391
            ],
            [
                31391,
                31581
            ],
            [
                31581,
                31614
            ],
            [
                31614,
                31722
            ],
            [
                31722,
                31766
            ],
            [
                31766,
                31835
            ],
            [
                31835,
                32163
            ],
            [
                32163,
                32172
            ],
            [
                32172,
                32247
            ],
            [
                32247,
                32389
            ],
            [
                32389,
                32433
            ],
            [
                32433,
                32442
            ],
            [
                32442,
                32590
            ],
            [
                32590,
                32647
            ],
            [
                32647,
                32698
            ],
            [
                32698,
                32721
            ],
            [
                32721,
                32767
            ],
            [
                32767,
                32817
            ],
            [
                32817,
                32858
            ],
            [
                32858,
                32877
            ],
            [
                32877,
                32907
            ],
            [
                32907,
                32941
            ],
            [
                32941,
                32995
            ],
            [
                32995,
                33145
            ],
            [
                33145,
                33169
            ],
            [
                33169,
                33198
            ],
            [
                33198,
                33378
            ],
            [
                33378,
                33579
            ],
            [
                33579,
                33691
            ],
            [
                33691,
                33840
            ],
            [
                33840,
                33899
            ],
            [
                33899,
                33977
            ],
            [
                33977,
                33999
            ],
            [
                33999,
                34020
            ],
            [
                34020,
                34104
            ],
            [
                34104,
                34226
            ],
            [
                34226,
                34451
            ],
            [
                34451,
                34509
            ],
            [
                34509,
                34674
            ],
            [
                34674,
                34788
            ],
            [
                34788,
                34828
            ],
            [
                34828,
                34844
            ],
            [
                34844,
                34991
            ],
            [
                34991,
                35133
            ],
            [
                35133,
                35242
            ],
            [
                35242,
                35281
            ],
            [
                35281,
                35402
            ],
            [
                35402,
                35442
            ],
            [
                35442,
                35490
            ]
        ]
    },
    "abridged": {
        "text": "Amelia's kindness touched even such a hardened little reprobate as Becky. She returned Emmy's caresses and kind speeches with something very like gratitude, and an emotion which, if it was not lasting, for a moment was almost genuine. That was a lucky stroke of hers about the child \"torn from her arms shrieking.\" It was this that had won her friend back, and it was one of the very first things our poor simple Emmy began to talk about.\n\"And so they took your darling child from you?\" she cried. \"Oh, Rebecca, my poor dear friend, I know what it is to lose a boy. But please Heaven yours will be restored to you.\"\n\"The child? Oh, yes, my agonies were frightful,\" Becky owned, not perhaps without a twinge of conscience. It jarred upon her to have to tell lies instantly in reply to so much confidence. But that is the misfortune of beginning this kind of forgery. One fib leads to another; and so the number of your lies multiplies, and the danger of detection increases every day.\n\"My agonies were terrible,\" Becky continued; \"I thought I should die. I had a brain fever, during which my doctor gave me up, and - and I recovered, and here I am, poor and friendless.\"\n\"How old is he?\" Emmy asked.\n\"Eleven,\" said Becky.\n\"Eleven! Why, he was born the same year as Georgy, who is-\"\n\"I know, I know,\" cried Becky, who had in fact quite forgotten Rawdon's age. \"Grief has made me forget so many things, dearest Amelia. I am very much changed: half-wild sometimes. He was eleven when they took him away from me. Bless his sweet face; I have never seen it again.\"\n\"Was he fair or dark?\" went on that absurd little Emmy. \"Show me his hair.\"\nBecky almost laughed. \"Not today, love - some other time, when my trunks arrive.\"\n\"Poor Becky!\" said Emmy. \"How thankful I ought to be.\" She began to think, as usual, how her son was the handsomest and cleverest boy in the world. \"You will see my Georgy,\" was the best thing she could think of to console Becky.\nAnd so the two women talked for an hour or more, Becky giving her friend a full version of her history. She showed how her marriage with Rawdon Crawley had always been viewed by the family with hostility; how her artful sister-in-law had poisoned her husband's mind against her; how she had borne everything - poverty, neglect, coldness - for the sake of her child; how, finally, she had been driven into demanding a separation from her husband, when the wretch had asked her to sacrifice her own reputation so that he might get advancement from that powerful but unprincipled man, the Marquis of Steyne. The atrocious monster!\nThis part of her eventful history Becky told with the utmost delicacy and indignant virtue. When she was forced to fly from her husband's roof, she said, the coward had pursued his revenge by taking her child from her. And thus she was a wanderer, poor, friendless, and wretched.\nEmmy quivered with indignation at the conduct of the miserable Rawdon and the unprincipled Steyne. And while Becky was reciting the separation scene from the child, Emmy retired behind her pocket-handkerchief.\nMeanwhile, the Major (who did not wish to interrupt, and grew rather tired of creaking about the narrow stairs) descended to the ground-floor of the house and into the great room common to all the tenants, a room full of smoke and liberally sprinkled with beer. All sorts of people were collected here; glove-sellers and linen-merchants, students and idlers, playing cards on the sloppy, beery tables. The waiter brought the Major a mug of beer, and he took out a cigar and a newspaper until Amelia should come down.\nThe two students from room 90 came in, and called for butterbrod and beer. The pair sat down by the Major and fell into a conversation in German which he could not help overhearing. It was mainly about duels and drinking-bouts at the University, from which they had come with Becky, as it appeared, in order to attend the bridal fetes at Pumpernickel.\n\"After the fat grandfather went away, there came a pretty little Englishwoman,\" said one. \"I heard them chattering together.\"\n\"We must take the tickets for her concert,\" said the other. \"Have you any money, Max?\"\n\"Bah! Last time she sold many tickets, but she went off without singing. She said yesterday that her pianist had fallen ill at Dresden. She cannot sing, it is my belief!\"\n\"Her voice is cracked; I hear her trying out of her window an English ballad, called 'De Rose upon de Balgony.'\"\n\"No, we'll take none of her tickets. She won money at the gaming-table last night. I saw her: she made a little English boy play for her. Another mug of beer?\" and having buried their blond whiskers in the drink, they swaggered off into the fair.\nThe Major understood that their talk related to Becky.\n\"The little devil is at her old tricks,\" he thought, and he smiled as he recalled her desperate flirtation with Jos and the ludicrous end of that adventure. He and George had often laughed over it, until George was also caught in the little Circe's toils, and had an understanding with her which his comrade suspected, but preferred to ignore. William was too ashamed to ask about that disgraceful mystery, although once George had alluded to it. It was on the morning of Waterloo, as the young men stood surveying the black masses of Frenchmen opposite their line.\n\"I have been mixing in a foolish intrigue with a woman,\" George said. \"If I fall, I hope Emmy will never know of that business. I wish to God it had never been begun!\" And William had soothed poor George's widow with the fact that Osborne, on the first day of battle, spoke gravely and affectionately of his wife.\n\"And so this devil is still going on with her intrigues,\" thought William. \"I wish she were a hundred miles from here. She brings mischief wherever she goes.\" He was thinking this when somebody tapped his shoulder, and he looked up and saw Amelia.\nThis woman had a way of tyrannizing over Major Dobbin; she ordered him about, and made him fetch and carry just as if he was a great Newfoundland dog. He liked, so to speak, to jump into the water if she told him to, and to trot behind her with her bag in his mouth. This history has been written to very little purpose if the reader has not perceived that the Major was a spooney.\n\"Why did you not wait for me upstairs, sir?\" she said, with a little toss of her head.\n\"I couldn't stand up in the passage,\" he answered; and, delighted to take her out of the horrid smoky place, he would have walked off without paying if the waiter had not stopped him. Emmy laughed: she called him a naughty man. She was in high spirits, and tripped across the market-place very briskly, wanting to see Jos that instant. They found him in his saloon on the first-floor; he had been anxiously pacing the room, and biting his nails during the past hour whilst Emmy was closeted with Becky.\n\"Well?\" said Jos.\n\"The poor dear creature, how she has suffered!\" Emmy said.\n\"God bless my soul, yes,\" Jos said, wagging his head, so that his cheeks quivered like jellies.\n\"She may have Payne's room,\" Emmy continued, \"and Payne may go upstairs.\" Payne was her English maid, who passed her time chiefly in grumbling, and in stating her intention to return to her native Clapham.\n\"Why, you don't mean to say you are going to have that woman in the house?\" cried the Major, jumping up.\n\"Of course we are,\" said Amelia. \"Don't be angry and break the furniture, Major Dobbin. Of course we are going to have her here.\"\n\"Of course, my dear,\" Jos said.\n\"The poor creature, after all her sufferings,\" Emmy continued; \"her wicked husband having taken her child away from her\" (here she doubled her two little fists in a way that charmed the Major.) \"The poor dear thing! quite alone and forced to give singing lessons!\"\n\"Take lessons, my dear Mrs. George,\" cried the Major, \"but don't have her in the house.\"\n\"Pooh,\" said Jos.\n\"I'm astonished at you, Major William,\" Amelia cried. \"Why, now is the time to help her, when she is so miserable. The oldest friend I ever had-\"\n\"She was not always your friend, Amelia,\" the Major said, for he was quite angry. Emmy, looking the Major almost fiercely in the face, said, \"For shame, Major Dobbin!\" and walked out of the room with a most majestic air.\n\"To allude to that!\" she said, once shut in her own room. \"Oh, it was cruel of him to remind me of it.\" She looked up at George's picture. \"If I had forgiven it, ought he to have spoken? No. And it is from his own lips that I know how wicked and groundless my jealousy was; and that you were pure - oh, you were pure, my saint in heaven!\"\nShe paced the room, trembling and indignant. Leaning on the chest of drawers over which George's picture hung, she gazed at it. Its eyes seemed to reproach her. The early dear memories of that brief time of love rushed back. The wound bled afresh, and oh, how bitterly. It couldn't be. Never, never.\nPoor Dobbin! That unlucky word had undone the work of many a year - the long labour of love and constancy. A word was spoken, and down fell the fair palace of hope - away flew the bird which he had been trying all his life to lure!\nWilliam nevertheless continued to implore Sedley, most energetically, to beware of Rebecca; he urged Jos not to receive her. He asked him to inquire about her at least; told him how he had heard that she was in the company of gamblers; pointed out how she and Crawley had misled poor George into ruin, and how she was now parted from her husband, perhaps for good reason. What a dangerous companion she would be for his sister, who knew nothing of the affairs of the world!\nHad William been less violent, or more dexterous, he might have succeeded; but Jos was jealous of the airs of superiority which he fancied the Major showed towards him, and he began a blustering speech about his competency to defend his own honour, his desire not to have his affairs meddled with, his intention to rebel against the Major - when the stormy conversation was ended by the arrival of Mrs. Becky with her meagre baggage.\nShe greeted her host with affectionate respect and made a shrinking salutation to Major Dobbin, who her instinct told her was her enemy. The bustle of her arrival brought Amelia out of her room. Emmy embraced her guest with the greatest warmth, and took no notice of the Major, except to fling him an angry look - the most unjust and scornful glance that had perhaps ever appeared on that poor little woman's face. Dobbin, indignant at the injustice, not at the defeat, made her a haughty bow and left.\nEmmy was particularly lively and affectionate to Rebecca, and installed her guest in her room with eager activity. Georgy came in from the fetes at dinner-time to find a lady at the table instead of Major Dobbin.\n\"Hullo! where's Dob?\" he asked.\n\"Major Dobbin is dining out, I suppose,\" his mother said, and, drawing the boy to her, kissed him, and introduced him to Mrs. Crawley. \"This is my boy, Rebecca,\" Mrs. Osborne said - as much as to say, can the world produce anything like that?\nBecky looked at him with rapture and pressed his hand fondly. \"Dear boy!\" she said. \"He is just like my-\" Emotion choked her speech, but Amelia understood.\nHowever, Mrs. Crawley ate a very good dinner. During the meal, Georgy eyed her and listened to her. At the dessert Emmy was gone out to the kitchen; Jos was in his great chair dozing; Georgy and the new arrival sat close to each other, and at last he laid down the nutcrackers.\n\"I say,\" said Georgy.\n\"What do you say?\" Becky said, laughing.\n\"You're the lady I saw in the mask at the Rouge et Noir.\"\n\"Hush! you little sly creature,\" Becky said, taking up his hand and kissing it. \"Your uncle was there too, and Mamma mustn't know.\"\n\"Oh, by no means.\"\n\"You see we are good friends already,\" Becky said to Emmy, as she re-entered.\nMeanwhile William, in a state of great indignation, walked about the town wildly until he fell upon the Charge d'Affaires, Tapeworm, who invited him to dinner. He took the opportunity to ask the diplomat whether he knew anything about a certain Mrs. Rawdon Crawley; and Tapeworm, who of course knew all the London gossip, poured into the Major's ears such a history as astonished him.\nTapeworm knew everything and a great deal besides, and made the most astounding revelations. When Dobbin said that Mrs. Osborne and Mr. Sedley had taken Becky into their house, Tapeworm burst into a peal of laughter, and asked if they had not better send to the prison and take in one or two of the gentlemen in shaved heads and chains.\nAmelia was going to the Court ball that night, and the Major decided to tell her this news there. He went home, dressed in his uniform, and repaired to Court, in hopes to see Mrs. Osborne. She never came. When he returned to his lodgings all the lights in the Sedley house were out. I don't know what sort of a night's rest he had with this frightful secret in bed with him.\nEarly in the morning he sent his servant across the way with a note, saying that he wished very particularly to speak with her. A message came back to say that Mrs. Osborne was exceedingly unwell and was keeping to her room.\nShe, too, had been awake all night, thinking of something which had agitated her mind a hundred times before. A hundred times on the point of yielding, she had shrunk back from a sacrifice which she felt was too much for her. She couldn't, in spite of Dobbins's love and constancy, and her own respect and gratitude. What is constancy, what is merit? One curl of a girl's ringlet, one hair of a whisker, will turn the scale against them in a minute.\nWhen, in the afternoon, the Major gained admission to Amelia, instead of the usual cordial and affectionate greeting, he received a curtsey, and a little gloved hand, retracted the moment after it was offered.\nRebecca, too, was in the room, and advanced to meet him with a smile. Dobbin drew back rather confusedly.\n\"I - I beg your pardon, m'am,\" he said; \"but I am bound to tell you that it is not as your friend that I am come here.\"\n\"Pooh! don't let us have this sort of thing!\" Jos cried out, alarmed and anxious.\n\"I wonder what Major Dobbin has to say against Rebecca?\" Amelia said in a low, clear voice with a slight quiver in it, and a very determined look about the eyes.\n\"I will not have this sort of thing in my house,\" Jos again interposed. \"Dobbin, I beg, sir, you'll stop it.\" And trembling and turning very red, he gave a great puff, and made for his door.\n\"Dear friend!\" Rebecca said with angelic sweetness, \"do hear what Major Dobbin has to say against me.\"\n\"I will not hear it,\" squeaked out Jos at the top of his voice, and he was gone.\n\"We are only two women,\" Amelia said. \"You can speak now, sir.\"\n\"This manner towards me scarcely becomes you, Amelia,\" the Major answered haughtily; \"nor, I believe, am I guilty of habitual harshness to women. It is not a pleasure to me to do the duty which I am come to do.\"\n\"Pray proceed with it quickly, if you please, Major Dobbin,\" said Amelia, who was more and more in a pet. The expression of Dobbin's face, as she spoke in this imperious manner, was not pleasant.\n\"I came to say - and I must say it in your presence, Mrs. Crawley - that I think you ought not to form a member of the family of my friends. A lady who is separated from her husband, who travels not under her own name, who frequents public gaming-tables-\"\n\"It was to the ball I went,\" cried out Becky.\n\"-is not a fit companion for Mrs. Osborne and her son,\" Dobbin went on: \"and I may add that there are people here who know that regarding your conduct about which I don't even wish to speak before Mrs. Osborne.\"\n\"Yours is a very convenient sort of calumny, Major Dobbin,\" Rebecca said. \"You leave me under the weight of an accusation which, after all, is unsaid. What is it? Is it unfaithfulness to my husband? I scorn it and defy anybody to prove it. My honour is as untouched as that of the bitterest enemy who ever maligned me. Is it of being poor, forsaken, wretched, that you accuse me? Yes, I am guilty of those faults, and punished for them every day. Let me go, Emmy. I am no worse off today than I was yesterday. The poor wanderer is on her way. Don't you remember the song we used to sing in dear old days? I have been wandering ever since then - a poor castaway. Let me go: my stay here interferes with the plans of this gentleman.\"\n\"Indeed it does, madam,\" said the Major. \"If I have any authority in this house-\"\n\"Authority, none!\" broke out Amelia. \"Rebecca, you stay with me. I won't insult you because Major Dobbin chooses to do so. Come away, dear.\" And the two women made for the door.\nWilliam opened it. As they were going out, however, he took Amelia's hand and said, \"Will you stay a moment and speak to me?\"\n\"He wishes to speak to you away from me,\" said Becky, looking like a martyr. Amelia gripped her hand in reply.\n\"Upon my honour it is not about you that I am going to speak,\" Dobbin said. \"Come back, Amelia.\"\nShe came. Dobbin bowed to Mrs. Crawley, as he shut the door upon her. Amelia looked at him: her face and her lips were quite white.\n\"I was confused when I spoke just now,\" the Major said after a pause, \"and I misused the word authority.\"\n\"You did,\" said Amelia.\n\"At least I have claims to be heard,\" Dobbin continued.\n\"It is generous to remind me of our obligations to you.\"\n\"The claims I mean are those left me by George's father,\" he said.\n\"Yes, and you insulted his memory. You did yesterday. You know you did. And I will never forgive you. Never!\" said Amelia. She shot out each little sentence in a tremor of anger and emotion.\n\"You don't mean that, Amelia?\" William said sadly. \"You don't mean that these words, uttered in a hurried moment, are to weigh against a whole life's devotion? I think that George's memory has not been injured by the way in which I have dealt with it, and if we are come to bandying reproaches, I at least merit none from his widow and the mother of his son. Reflect, afterwards when you are at leisure, and your conscience will withdraw this accusation. It does even now.\"\nAmelia held down her head.\n\"It is not that speech of yesterday,\" he continued, \"which moves you. That is only the pretext, Amelia, or I have loved you and watched you for fifteen years in vain. Have I not learned to read all your feelings and look into your thoughts? I know what your heart is capable of: it can cling faithfully to a recollection and cherish a fancy, but it can't feel such an attachment as mine deserves to mate with, and such as I would have won from a woman more generous than you. No, you are not worthy of the love which I have devoted to you. I knew all along that the prize I had set my life on was not worth the winning; that I was a fool, with fond fancies, bartering away my truth and ardour against your little feeble remnant of love. I will bargain no more: I withdraw. I find no fault with you. You are very good-natured, and have done your best, but you couldn't - you couldn't reach up to the height of the attachment which I bore you, and which a loftier soul than yours might have been proud to share. Good-bye, Amelia! I have watched your struggle. Let it end. We are both weary of it.\"\nAmelia stood scared and silent as William thus suddenly broke the chain by which she held him and declared his independence and superiority. He had placed himself at her feet so long that the poor little woman had been accustomed to trample upon him. She didn't wish to marry him, but she wished to keep him. She wished to give him nothing, but that he should give her all. She was quite cast down.\n\"Am I to understand then, that you are going - away, William?\" she said.\nHe gave a sad laugh. \"I went once before, and came back after twelve years. We were young then, Amelia. Good-bye. I have spent enough of my life at this play.\"\nWhilst they had been talking, the door into Mrs. Osborne's room had opened ever so little; indeed, Becky had kept hold of the handle, and heard every word of the conversation.\n\"What a noble heart that man has,\" she thought, \"and how shamefully that woman plays with it!\" She admired Dobbin; she bore him no rancour for the part he had taken against her. It was an open move in the game, and played fairly. \"Ah!\" she thought, \"if I could have had such a husband as that - a man with a heart and brains too! I would not have minded his large feet.\"\nRunning into her room, she wrote him a note, beseeching him to stop for a few days - not to think of going - that she could help him with A.\nThe parting was over. Once more poor William walked to the door and was gone; and the little widow had her will, and had won her victory, and was left to enjoy it as she best might.\nAt dinner, Mr. Georgy again remarked the absence of \"Old Dob.\" The meal was eaten in silence. Jos's appetite was not diminished, but Emmy ate nothing at all.\nAfter the meal, Georgy was lolling in the cushions of the old bay-window, which looked out on the market-place, when he noticed movement at the Major's house on the other side of the street.\n\"Hullo!\" said he, \"there's Dob's carriage - they are bringing it out of the court-yard.\"\nEmmy gave a little start, but said nothing.\n\"Hullo!\" Georgy continued, \"there's Francis coming out with the portmanteaus, and the postilion. Why - they're putting the horses to Dob's carriage. Is he going anywhere?\"\n\"Yes,\" said Emmy, \"he is going on a journey.\"\n\"And when is he coming back?\"\n\"He is - not coming back,\" answered Emmy.\n\"Not coming back!\" cried out Georgy, jumping up.\n\"Stay here, sir,\" roared out Jos.\n\"Stay, Georgy,\" said his mother with a very sad face. The boy stopped, kicked about the room, and jumped up and down from the window-seat with uneasiness and curiosity.\nThe horses were put to. The baggage was strapped on. Francis came out with his master's sword, cane, and umbrella, and laid them in the carriage, and placed his desk and old tin cocked-hat case under the seat. Next Francis brought out the stained old blue cloak which had wrapped its owner up any time these fifteen years. It had been new for the campaign of Waterloo and had covered George and William after the night of Quatre Bras.\nOld Burcke, the landlord of the lodgings, came out, and then Major William - Burcke wanted to kiss him. The Major was adored by all people with whom he had to do. It was with difficulty that he could escape.\n\"By Jove, I will go!\" screamed out George.\n\"Give him this,\" said Becky, quite interested, and put a paper into the boy's hand. He rushed down the stairs and flung across the street.\nWilliam had got into the carriage, but George bounded in after, and flung his arms round the Major's neck, asking him multiplied questions. Then he felt in his waistcoat pocket and gave him a note. William seized it eagerly, and opened it trembling; but instantly his face changed. He tore the paper in two and dropped it out of the carriage. He kissed Georgy on the head, and the boy got out, doubling his fists into his eyes.\nThe postilion cracked his whip, up sprang Francis to the box, and away went Dobbin. He never looked up as they passed under Amelia's window, and Georgy, left alone in the street, burst out crying.\nEmmy's maid heard him howling again during the night and brought him some preserved apricots to console him. She mingled her lamentations with his. All the poor, honest folks loved that kind-hearted and simple gentleman.\nAs for Emmy, had she not done her duty? She had her picture of George for a consolation.",
        "paragraph_chars": [
            [
                0,
                439
            ],
            [
                439,
                616
            ],
            [
                616,
                984
            ],
            [
                984,
                1170
            ],
            [
                1170,
                1199
            ],
            [
                1199,
                1221
            ],
            [
                1221,
                1281
            ],
            [
                1281,
                1559
            ],
            [
                1559,
                1635
            ],
            [
                1635,
                1717
            ],
            [
                1717,
                1947
            ],
            [
                1947,
                2575
            ],
            [
                2575,
                2855
            ],
            [
                2855,
                3065
            ],
            [
                3065,
                3582
            ],
            [
                3582,
                3934
            ],
            [
                3934,
                4060
            ],
            [
                4060,
                4147
            ],
            [
                4147,
                4318
            ],
            [
                4318,
                4431
            ],
            [
                4431,
                4678
            ],
            [
                4678,
                4733
            ],
            [
                4733,
                5299
            ],
            [
                5299,
                5613
            ],
            [
                5613,
                5861
            ],
            [
                5861,
                6243
            ],
            [
                6243,
                6330
            ],
            [
                6330,
                6833
            ],
            [
                6833,
                6851
            ],
            [
                6851,
                6910
            ],
            [
                6910,
                7006
            ],
            [
                7006,
                7212
            ],
            [
                7212,
                7317
            ],
            [
                7317,
                7447
            ],
            [
                7447,
                7479
            ],
            [
                7479,
                7744
            ],
            [
                7744,
                7833
            ],
            [
                7833,
                7851
            ],
            [
                7851,
                7997
            ],
            [
                7997,
                8218
            ],
            [
                8218,
                8557
            ],
            [
                8557,
                8857
            ],
            [
                8857,
                9089
            ],
            [
                9089,
                9563
            ],
            [
                9563,
                9997
            ],
            [
                9997,
                10500
            ],
            [
                10500,
                10713
            ],
            [
                10713,
                10745
            ],
            [
                10745,
                10988
            ],
            [
                10988,
                11144
            ],
            [
                11144,
                11422
            ],
            [
                11422,
                11444
            ],
            [
                11444,
                11485
            ],
            [
                11485,
                11543
            ],
            [
                11543,
                11675
            ],
            [
                11675,
                11694
            ],
            [
                11694,
                11772
            ],
            [
                11772,
                12157
            ],
            [
                12157,
                12494
            ],
            [
                12494,
                12869
            ],
            [
                12869,
                13094
            ],
            [
                13094,
                13544
            ],
            [
                13544,
                13754
            ],
            [
                13754,
                13860
            ],
            [
                13860,
                13980
            ],
            [
                13980,
                14062
            ],
            [
                14062,
                14224
            ],
            [
                14224,
                14415
            ],
            [
                14415,
                14518
            ],
            [
                14518,
                14599
            ],
            [
                14599,
                14663
            ],
            [
                14663,
                14875
            ],
            [
                14875,
                15071
            ],
            [
                15071,
                15327
            ],
            [
                15327,
                15373
            ],
            [
                15373,
                15585
            ],
            [
                15585,
                16317
            ],
            [
                16317,
                16399
            ],
            [
                16399,
                16577
            ],
            [
                16577,
                16703
            ],
            [
                16703,
                16814
            ],
            [
                16814,
                16911
            ],
            [
                16911,
                17043
            ],
            [
                17043,
                17149
            ],
            [
                17149,
                17173
            ],
            [
                17173,
                17229
            ],
            [
                17229,
                17286
            ],
            [
                17286,
                17353
            ],
            [
                17353,
                17544
            ],
            [
                17544,
                18018
            ],
            [
                18018,
                18045
            ],
            [
                18045,
                19141
            ],
            [
                19141,
                19540
            ],
            [
                19540,
                19613
            ],
            [
                19613,
                19773
            ],
            [
                19773,
                19949
            ],
            [
                19949,
                20320
            ],
            [
                20320,
                20461
            ],
            [
                20461,
                20643
            ],
            [
                20643,
                20801
            ],
            [
                20801,
                20992
            ],
            [
                20992,
                21081
            ],
            [
                21081,
                21125
            ],
            [
                21125,
                21297
            ],
            [
                21297,
                21343
            ],
            [
                21343,
                21373
            ],
            [
                21373,
                21415
            ],
            [
                21415,
                21464
            ],
            [
                21464,
                21498
            ],
            [
                21498,
                21667
            ],
            [
                21667,
                22102
            ],
            [
                22102,
                22310
            ],
            [
                22310,
                22353
            ],
            [
                22353,
                22492
            ],
            [
                22492,
                22920
            ],
            [
                22920,
                23117
            ],
            [
                23117,
                23338
            ],
            [
                23338,
                23426
            ]
        ],
        "segment_chars": [
            [
                0,
                74
            ],
            [
                74,
                235
            ],
            [
                235,
                315
            ],
            [
                315,
                439
            ],
            [
                439,
                487
            ],
            [
                487,
                498
            ],
            [
                498,
                566
            ],
            [
                566,
                616
            ],
            [
                616,
                628
            ],
            [
                628,
                722
            ],
            [
                722,
                804
            ],
            [
                804,
                866
            ],
            [
                866,
                984
            ],
            [
                984,
                1054
            ],
            [
                1054,
                1170
            ],
            [
                1170,
                1187
            ],
            [
                1187,
                1199
            ],
            [
                1199,
                1221
            ],
            [
                1221,
                1230
            ],
            [
                1230,
                1281
            ],
            [
                1281,
                1358
            ],
            [
                1358,
                1416
            ],
            [
                1416,
                1461
            ],
            [
                1461,
                1508
            ],
            [
                1508,
                1559
            ],
            [
                1559,
                1582
            ],
            [
                1582,
                1615
            ],
            [
                1615,
                1635
            ],
            [
                1635,
                1657
            ],
            [
                1657,
                1717
            ],
            [
                1717,
                1731
            ],
            [
                1731,
                1742
            ],
            [
                1742,
                1772
            ],
            [
                1772,
                1865
            ],
            [
                1865,
                1947
            ],
            [
                1947,
                2051
            ],
            [
                2051,
                2552
            ],
            [
                2552,
                2575
            ],
            [
                2575,
                2667
            ],
            [
                2667,
                2794
            ],
            [
                2794,
                2855
            ],
            [
                2855,
                2954
            ],
            [
                2954,
                3065
            ],
            [
                3065,
                3327
            ],
            [
                3327,
                3467
            ],
            [
                3467,
                3582
            ],
            [
                3582,
                3657
            ],
            [
                3657,
                3764
            ],
            [
                3764,
                3934
            ],
            [
                3934,
                4024
            ],
            [
                4024,
                4060
            ],
            [
                4060,
                4120
            ],
            [
                4120,
                4147
            ],
            [
                4147,
                4153
            ],
            [
                4153,
                4220
            ],
            [
                4220,
                4283
            ],
            [
                4283,
                4318
            ],
            [
                4318,
                4431
            ],
            [
                4431,
                4468
            ],
            [
                4468,
                4514
            ],
            [
                4514,
                4569
            ],
            [
                4569,
                4591
            ],
            [
                4591,
                4678
            ],
            [
                4678,
                4733
            ],
            [
                4733,
                4890
            ],
            [
                4890,
                5077
            ],
            [
                5077,
                5180
            ],
            [
                5180,
                5299
            ],
            [
                5299,
                5369
            ],
            [
                5369,
                5427
            ],
            [
                5427,
                5467
            ],
            [
                5467,
                5613
            ],
            [
                5613,
                5688
            ],
            [
                5688,
                5732
            ],
            [
                5732,
                5772
            ],
            [
                5772,
                5861
            ],
            [
                5861,
                6012
            ],
            [
                6012,
                6128
            ],
            [
                6128,
                6243
            ],
            [
                6243,
                6288
            ],
            [
                6288,
                6330
            ],
            [
                6330,
                6514
            ],
            [
                6514,
                6558
            ],
            [
                6558,
                6666
            ],
            [
                6666,
                6833
            ],
            [
                6833,
                6841
            ],
            [
                6841,
                6851
            ],
            [
                6851,
                6899
            ],
            [
                6899,
                6910
            ],
            [
                6910,
                7006
            ],
            [
                7006,
                7080
            ],
            [
                7080,
                7212
            ],
            [
                7212,
                7288
            ],
            [
                7288,
                7317
            ],
            [
                7317,
                7350
            ],
            [
                7350,
                7405
            ],
            [
                7405,
                7447
            ],
            [
                7447,
                7479
            ],
            [
                7479,
                7673
            ],
            [
                7673,
                7695
            ],
            [
                7695,
                7744
            ],
            [
                7744,
                7833
            ],
            [
                7833,
                7851
            ],
            [
                7851,
                7905
            ],
            [
                7905,
                7966
            ],
            [
                7966,
                7997
            ],
            [
                7997,
                8079
            ],
            [
                8079,
                8165
            ],
            [
                8165,
                8218
            ],
            [
                8218,
                8239
            ],
            [
                8239,
                8276
            ],
            [
                8276,
                8322
            ],
            [
                8322,
                8357
            ],
            [
                8357,
                8405
            ],
            [
                8405,
                8409
            ],
            [
                8409,
                8557
            ],
            [
                8557,
                8602
            ],
            [
                8602,
                8685
            ],
            [
                8685,
                8718
            ],
            [
                8718,
                8782
            ],
            [
                8782,
                8827
            ],
            [
                8827,
                8843
            ],
            [
                8843,
                8857
            ],
            [
                8857,
                8870
            ],
            [
                8870,
                8964
            ],
            [
                8964,
                9089
            ],
            [
                9089,
                9214
            ],
            [
                9214,
                9461
            ],
            [
                9461,
                9563
            ],
            [
                9563,
                9997
            ],
            [
                9997,
                10134
            ],
            [
                10134,
                10192
            ],
            [
                10192,
                10412
            ],
            [
                10412,
                10500
            ],
            [
                10500,
                10615
            ],
            [
                10615,
                10713
            ],
            [
                10713,
                10721
            ],
            [
                10721,
                10735
            ],
            [
                10735,
                10745
            ],
            [
                10745,
                10880
            ],
            [
                10880,
                10988
            ],
            [
                10988,
                11050
            ],
            [
                11050,
                11062
            ],
            [
                11062,
                11072
            ],
            [
                11072,
                11144
            ],
            [
                11144,
                11190
            ],
            [
                11190,
                11244
            ],
            [
                11244,
                11422
            ],
            [
                11422,
                11444
            ],
            [
                11444,
                11463
            ],
            [
                11463,
                11485
            ],
            [
                11485,
                11543
            ],
            [
                11543,
                11550
            ],
            [
                11550,
                11623
            ],
            [
                11623,
                11675
            ],
            [
                11675,
                11694
            ],
            [
                11694,
                11772
            ],
            [
                11772,
                11932
            ],
            [
                11932,
                12157
            ],
            [
                12157,
                12250
            ],
            [
                12250,
                12494
            ],
            [
                12494,
                12592
            ],
            [
                12592,
                12683
            ],
            [
                12683,
                12699
            ],
            [
                12699,
                12777
            ],
            [
                12777,
                12869
            ],
            [
                12869,
                12997
            ],
            [
                12997,
                13094
            ],
            [
                13094,
                13204
            ],
            [
                13204,
                13320
            ],
            [
                13320,
                13411
            ],
            [
                13411,
                13445
            ],
            [
                13445,
                13544
            ],
            [
                13544,
                13754
            ],
            [
                13754,
                13824
            ],
            [
                13824,
                13860
            ],
            [
                13860,
                13980
            ],
            [
                13980,
                13987
            ],
            [
                13987,
                14026
            ],
            [
                14026,
                14062
            ],
            [
                14062,
                14119
            ],
            [
                14119,
                14224
            ],
            [
                14224,
                14296
            ],
            [
                14296,
                14334
            ],
            [
                14334,
                14415
            ],
            [
                14415,
                14430
            ],
            [
                14430,
                14518
            ],
            [
                14518,
                14599
            ],
            [
                14599,
                14637
            ],
            [
                14637,
                14663
            ],
            [
                14663,
                14809
            ],
            [
                14809,
                14875
            ],
            [
                14875,
                14981
            ],
            [
                14981,
                15071
            ],
            [
                15071,
                15212
            ],
            [
                15212,
                15327
            ],
            [
                15327,
                15373
            ],
            [
                15373,
                15585
            ],
            [
                15585,
                15659
            ],
            [
                15659,
                15736
            ],
            [
                15736,
                15748
            ],
            [
                15748,
                15784
            ],
            [
                15784,
                15825
            ],
            [
                15825,
                15904
            ],
            [
                15904,
                15965
            ],
            [
                15965,
                16032
            ],
            [
                16032,
                16049
            ],
            [
                16049,
                16095
            ],
            [
                16095,
                16128
            ],
            [
                16128,
                16190
            ],
            [
                16190,
                16247
            ],
            [
                16247,
                16317
            ],
            [
                16317,
                16358
            ],
            [
                16358,
                16399
            ],
            [
                16399,
                16418
            ],
            [
                16418,
                16436
            ],
            [
                16436,
                16464
            ],
            [
                16464,
                16522
            ],
            [
                16522,
                16540
            ],
            [
                16540,
                16577
            ],
            [
                16577,
                16596
            ],
            [
                16596,
                16703
            ],
            [
                16703,
                16780
            ],
            [
                16780,
                16814
            ],
            [
                16814,
                16890
            ],
            [
                16890,
                16911
            ],
            [
                16911,
                16921
            ],
            [
                16921,
                16981
            ],
            [
                16981,
                17043
            ],
            [
                17043,
                17149
            ],
            [
                17149,
                17173
            ],
            [
                17173,
                17229
            ],
            [
                17229,
                17286
            ],
            [
                17286,
                17353
            ],
            [
                17353,
                17388
            ],
            [
                17388,
                17407
            ],
            [
                17407,
                17425
            ],
            [
                17425,
                17455
            ],
            [
                17455,
                17463
            ],
            [
                17463,
                17476
            ],
            [
                17476,
                17544
            ],
            [
                17544,
                17575
            ],
            [
                17575,
                17595
            ],
            [
                17595,
                17704
            ],
            [
                17704,
                17903
            ],
            [
                17903,
                17999
            ],
            [
                17999,
                18018
            ],
            [
                18018,
                18045
            ],
            [
                18045,
                18115
            ],
            [
                18115,
                18212
            ],
            [
                18212,
                18286
            ],
            [
                18286,
                18521
            ],
            [
                18521,
                18585
            ],
            [
                18585,
                18782
            ],
            [
                18782,
                18818
            ],
            [
                18818,
                18844
            ],
            [
                18844,
                19055
            ],
            [
                19055,
                19073
            ],
            [
                19073,
                19103
            ],
            [
                19103,
                19115
            ],
            [
                19115,
                19141
            ],
            [
                19141,
                19282
            ],
            [
                19282,
                19392
            ],
            [
                19392,
                19450
            ],
            [
                19450,
                19515
            ],
            [
                19515,
                19540
            ],
            [
                19540,
                19603
            ],
            [
                19603,
                19613
            ],
            [
                19613,
                19634
            ],
            [
                19634,
                19689
            ],
            [
                19689,
                19717
            ],
            [
                19717,
                19727
            ],
            [
                19727,
                19773
            ],
            [
                19773,
                19949
            ],
            [
                19949,
                20044
            ],
            [
                20044,
                20127
            ],
            [
                20127,
                20179
            ],
            [
                20179,
                20185
            ],
            [
                20185,
                20279
            ],
            [
                20279,
                20320
            ],
            [
                20320,
                20461
            ],
            [
                20461,
                20483
            ],
            [
                20483,
                20643
            ],
            [
                20643,
                20706
            ],
            [
                20706,
                20737
            ],
            [
                20737,
                20801
            ],
            [
                20801,
                20992
            ],
            [
                20992,
                21001
            ],
            [
                21001,
                21081
            ],
            [
                21081,
                21125
            ],
            [
                21125,
                21134
            ],
            [
                21134,
                21222
            ],
            [
                21222,
                21274
            ],
            [
                21274,
                21297
            ],
            [
                21297,
                21343
            ],
            [
                21343,
                21373
            ],
            [
                21373,
                21415
            ],
            [
                21415,
                21434
            ],
            [
                21434,
                21464
            ],
            [
                21464,
                21498
            ],
            [
                21498,
                21552
            ],
            [
                21552,
                21667
            ],
            [
                21667,
                21691
            ],
            [
                21691,
                21720
            ],
            [
                21720,
                21877
            ],
            [
                21877,
                21990
            ],
            [
                21990,
                22102
            ],
            [
                22102,
                22206
            ],
            [
                22206,
                22265
            ],
            [
                22265,
                22310
            ],
            [
                22310,
                22332
            ],
            [
                22332,
                22353
            ],
            [
                22353,
                22437
            ],
            [
                22437,
                22492
            ],
            [
                22492,
                22632
            ],
            [
                22632,
                22690
            ],
            [
                22690,
                22774
            ],
            [
                22774,
                22835
            ],
            [
                22835,
                22920
            ],
            [
                22920,
                23004
            ],
            [
                23004,
                23117
            ],
            [
                23117,
                23226
            ],
            [
                23226,
                23265
            ],
            [
                23265,
                23338
            ],
            [
                23338,
                23378
            ],
            [
                23378,
                23426
            ]
        ],
        "overlap_chars": [
            [
                6,
                8
            ],
            [
                9,
                17
            ],
            [
                26,
                74
            ],
            [
                74,
                235
            ],
            [
                235,
                315
            ],
            [
                315,
                321
            ],
            [
                327,
                331
            ],
            [
                332,
                389
            ],
            [
                397,
                412
            ],
            [
                413,
                431
            ],
            [
                437,
                439
            ],
            [
                439,
                487
            ],
            [
                491,
                496
            ],
            [
                496,
                498
            ],
            [
                498,
                524
            ],
            [
                525,
                564
            ],
            [
                564,
                566
            ],
            [
                566,
                613
            ],
            [
                613,
                616
            ],
            [
                616,
                626
            ],
            [
                626,
                628
            ],
            [
                628,
                722
            ],
            [
                722,
                743
            ],
            [
                749,
                761
            ],
            [
                762,
                771
            ],
            [
                772,
                802
            ],
            [
                802,
                804
            ],
            [
                804,
                843
            ],
            [
                844,
                866
            ],
            [
                866,
                873
            ],
            [
                880,
                882
            ],
            [
                883,
                890
            ],
            [
                890,
                902
            ],
            [
                910,
                922
            ],
            [
                923,
                984
            ],
            [
                984,
                995
            ],
            [
                996,
                1009
            ],
            [
                1009,
                1027
            ],
            [
                1027,
                1028
            ],
            [
                1029,
                1030
            ],
            [
                1030,
                1052
            ],
            [
                1054,
                1055
            ],
            [
                1056,
                1113
            ],
            [
                1116,
                1132
            ],
            [
                1133,
                1170
            ],
            [
                1170,
                1187
            ],
            [
                1187,
                1199
            ],
            [
                1199,
                1221
            ],
            [
                1221,
                1228
            ],
            [
                1230,
                1260
            ],
            [
                1264,
                1278
            ],
            [
                1281,
                1298
            ],
            [
                1299,
                1304
            ],
            [
                1305,
                1310
            ],
            [
                1310,
                1343
            ],
            [
                1344,
                1358
            ],
            [
                1358,
                1416
            ],
            [
                1416,
                1461
            ],
            [
                1461,
                1508
            ],
            [
                1508,
                1559
            ],
            [
                1559,
                1582
            ],
            [
                1582,
                1615
            ],
            [
                1615,
                1635
            ],
            [
                1635,
                1655
            ],
            [
                1655,
                1657
            ],
            [
                1657,
                1661
            ],
            [
                1667,
                1673
            ],
            [
                1674,
                1675
            ],
            [
                1676,
                1714
            ],
            [
                1714,
                1717
            ],
            [
                1717,
                1718
            ],
            [
                1718,
                1731
            ],
            [
                1731,
                1742
            ],
            [
                1742,
                1743
            ],
            [
                1743,
                1769
            ],
            [
                1772,
                1832
            ],
            [
                1833,
                1836
            ],
            [
                1837,
                1857
            ],
            [
                1858,
                1864
            ],
            [
                1865,
                1909
            ],
            [
                1914,
                1946
            ],
            [
                1947,
                1967
            ],
            [
                1975,
                1995
            ],
            [
                1996,
                2001
            ],
            [
                2002,
                2012
            ],
            [
                2013,
                2026
            ],
            [
                2027,
                2041
            ],
            [
                2042,
                2051
            ],
            [
                2051,
                2140
            ],
            [
                2141,
                2159
            ],
            [
                2160,
                2166
            ],
            [
                2167,
                2180
            ],
            [
                2181,
                2229
            ],
            [
                2230,
                2254
            ],
            [
                2264,
                2283
            ],
            [
                2286,
                2325
            ],
            [
                2325,
                2408
            ],
            [
                2409,
                2412
            ],
            [
                2419,
                2422
            ],
            [
                2423,
                2425
            ],
            [
                2426,
                2443
            ],
            [
                2455,
                2471
            ],
            [
                2476,
                2487
            ],
            [
                2488,
                2492
            ],
            [
                2493,
                2497
            ],
            [
                2498,
                2527
            ],
            [
                2527,
                2528
            ],
            [
                2529,
                2550
            ],
            [
                2550,
                2552
            ],
            [
                2552,
                2575
            ],
            [
                2575,
                2614
            ],
            [
                2620,
                2635
            ],
            [
                2636,
                2648
            ],
            [
                2649,
                2667
            ],
            [
                2680,
                2693
            ],
            [
                2699,
                2717
            ],
            [
                2727,
                2794
            ],
            [
                2794,
                2802
            ],
            [
                2803,
                2828
            ],
            [
                2829,
                2855
            ],
            [
                2860,
                2888
            ],
            [
                2889,
                2954
            ],
            [
                2954,
                2957
            ],
            [
                2958,
                2982
            ],
            [
                2983,
                3019
            ],
            [
                3020,
                3032
            ],
            [
                3033,
                3063
            ],
            [
                3063,
                3065
            ],
            [
                3074,
                3090
            ],
            [
                3091,
                3116
            ],
            [
                3116,
                3121
            ],
            [
                3127,
                3168
            ],
            [
                3175,
                3261
            ],
            [
                3269,
                3270
            ],
            [
                3271,
                3272
            ],
            [
                3283,
                3327
            ],
            [
                3327,
                3361
            ],
            [
                3366,
                3367
            ],
            [
                3368,
                3385
            ],
            [
                3386,
                3402
            ],
            [
                3403,
                3411
            ],
            [
                3412,
                3415
            ],
            [
                3416,
                3437
            ],
            [
                3438,
                3465
            ],
            [
                3465,
                3467
            ],
            [
                3467,
                3510
            ],
            [
                3511,
                3538
            ],
            [
                3539,
                3556
            ],
            [
                3564,
                3580
            ],
            [
                3580,
                3582
            ],
            [
                3582,
                3585
            ],
            [
                3609,
                3611
            ],
            [
                3612,
                3616
            ],
            [
                3619,
                3620
            ],
            [
                3621,
                3635
            ],
            [
                3636,
                3657
            ],
            [
                3657,
                3716
            ],
            [
                3727,
                3750
            ],
            [
                3762,
                3764
            ],
            [
                3764,
                3783
            ],
            [
                3784,
                3815
            ],
            [
                3816,
                3826
            ],
            [
                3826,
                3838
            ],
            [
                3839,
                3847
            ],
            [
                3848,
                3852
            ],
            [
                3853,
                3880
            ],
            [
                3881,
                3892
            ],
            [
                3900,
                3934
            ],
            [
                3934,
                3998
            ],
            [
                4022,
                4024
            ],
            [
                4025,
                4048
            ],
            [
                4049,
                4057
            ],
            [
                4057,
                4060
            ],
            [
                4060,
                4103
            ],
            [
                4104,
                4108
            ],
            [
                4118,
                4120
            ],
            [
                4120,
                4121
            ],
            [
                4130,
                4147
            ],
            [
                4147,
                4151
            ],
            [
                4163,
                4166
            ],
            [
                4172,
                4184
            ],
            [
                4184,
                4185
            ],
            [
                4186,
                4220
            ],
            [
                4220,
                4228
            ],
            [
                4229,
                4283
            ],
            [
                4283,
                4315
            ],
            [
                4315,
                4318
            ],
            [
                4318,
                4319
            ],
            [
                4329,
                4376
            ],
            [
                4380,
                4431
            ],
            [
                4431,
                4435
            ],
            [
                4442,
                4468
            ],
            [
                4468,
                4488
            ],
            [
                4502,
                4514
            ],
            [
                4514,
                4569
            ],
            [
                4569,
                4591
            ],
            [
                4591,
                4594
            ],
            [
                4595,
                4636
            ],
            [
                4642,
                4643
            ],
            [
                4649,
                4678
            ],
            [
                4678,
                4687
            ],
            [
                4699,
                4732
            ],
            [
                4733,
                4814
            ],
            [
                4819,
                4890
            ],
            [
                4890,
                4929
            ],
            [
                4929,
                4930
            ],
            [
                4931,
                4936
            ],
            [
                4937,
                4943
            ],
            [
                4944,
                4947
            ],
            [
                4948,
                4952
            ],
            [
                4953,
                5040
            ],
            [
                5041,
                5077
            ],
            [
                5077,
                5092
            ],
            [
                5093,
                5107
            ],
            [
                5114,
                5153
            ],
            [
                5154,
                5180
            ],
            [
                5180,
                5237
            ],
            [
                5238,
                5277
            ],
            [
                5278,
                5286
            ],
            [
                5287,
                5297
            ],
            [
                5299,
                5369
            ],
            [
                5370,
                5374
            ],
            [
                5379,
                5427
            ],
            [
                5427,
                5467
            ],
            [
                5467,
                5478
            ],
            [
                5479,
                5482
            ],
            [
                5483,
                5519
            ],
            [
                5525,
                5537
            ],
            [
                5537,
                5555
            ],
            [
                5556,
                5558
            ],
            [
                5565,
                5599
            ],
            [
                5600,
                5602
            ],
            [
                5603,
                5612
            ],
            [
                5613,
                5688
            ],
            [
                5688,
                5732
            ],
            [
                5732,
                5772
            ],
            [
                5772,
                5778
            ],
            [
                5788,
                5792
            ],
            [
                5793,
                5826
            ],
            [
                5826,
                5852
            ],
            [
                5853,
                5861
            ],
            [
                5861,
                5914
            ],
            [
                5916,
                5937
            ],
            [
                5937,
                6012
            ],
            [
                6012,
                6064
            ],
            [
                6076,
                6077
            ],
            [
                6078,
                6109
            ],
            [
                6114,
                6128
            ],
            [
                6128,
                6243
            ],
            [
                6243,
                6271
            ],
            [
                6280,
                6285
            ],
            [
                6285,
                6288
            ],
            [
                6288,
                6297
            ],
            [
                6303,
                6328
            ],
            [
                6328,
                6330
            ],
            [
                6330,
                6379
            ],
            [
                6379,
                6395
            ],
            [
                6396,
                6471
            ],
            [
                6482,
                6492
            ],
            [
                6493,
                6500
            ],
            [
                6501,
                6512
            ],
            [
                6512,
                6514
            ],
            [
                6514,
                6556
            ],
            [
                6556,
                6558
            ],
            [
                6558,
                6581
            ],
            [
                6581,
                6631
            ],
            [
                6641,
                6666
            ],
            [
                6666,
                6676
            ],
            [
                6681,
                6726
            ],
            [
                6737,
                6774
            ],
            [
                6775,
                6825
            ],
            [
                6831,
                6833
            ],
            [
                6833,
                6841
            ],
            [
                6841,
                6845
            ],
            [
                6849,
                6851
            ],
            [
                6851,
                6899
            ],
            [
                6899,
                6910
            ],
            [
                6910,
                7006
            ],
            [
                7006,
                7032
            ],
            [
                7032,
                7049
            ],
            [
                7049,
                7050
            ],
            [
                7066,
                7077
            ],
            [
                7080,
                7089
            ],
            [
                7090,
                7093
            ],
            [
                7094,
                7106
            ],
            [
                7106,
                7107
            ],
            [
                7112,
                7149
            ],
            [
                7150,
                7188
            ],
            [
                7189,
                7202
            ],
            [
                7203,
                7211
            ],
            [
                7212,
                7272
            ],
            [
                7276,
                7288
            ],
            [
                7294,
                7317
            ],
            [
                7317,
                7348
            ],
            [
                7348,
                7350
            ],
            [
                7350,
                7405
            ],
            [
                7405,
                7447
            ],
            [
                7447,
                7479
            ],
            [
                7479,
                7546
            ],
            [
                7554,
                7561
            ],
            [
                7562,
                7568
            ],
            [
                7569,
                7638
            ],
            [
                7639,
                7643
            ],
            [
                7648,
                7652
            ],
            [
                7653,
                7660
            ],
            [
                7661,
                7670
            ],
            [
                7673,
                7695
            ],
            [
                7695,
                7710
            ],
            [
                7711,
                7725
            ],
            [
                7726,
                7733
            ],
            [
                7734,
                7741
            ],
            [
                7741,
                7744
            ],
            [
                7744,
                7830
            ],
            [
                7833,
                7851
            ],
            [
                7851,
                7852
            ],
            [
                7852,
                7905
            ],
            [
                7905,
                7910
            ],
            [
                7911,
                7929
            ],
            [
                7930,
                7938
            ],
            [
                7940,
                7964
            ],
            [
                7964,
                7966
            ],
            [
                7966,
                7994
            ],
            [
                7997,
                8079
            ],
            [
                8079,
                8083
            ],
            [
                8083,
                8165
            ],
            [
                8165,
                8168
            ],
            [
                8169,
                8216
            ],
            [
                8216,
                8218
            ],
            [
                8218,
                8239
            ],
            [
                8239,
                8248
            ],
            [
                8274,
                8276
            ],
            [
                8276,
                8319
            ],
            [
                8322,
                8355
            ],
            [
                8355,
                8357
            ],
            [
                8358,
                8405
            ],
            [
                8405,
                8409
            ],
            [
                8409,
                8514
            ],
            [
                8517,
                8519
            ],
            [
                8519,
                8557
            ],
            [
                8557,
                8602
            ],
            [
                8610,
                8644
            ],
            [
                8654,
                8667
            ],
            [
                8668,
                8671
            ],
            [
                8672,
                8685
            ],
            [
                8685,
                8703
            ],
            [
                8704,
                8712
            ],
            [
                8713,
                8716
            ],
            [
                8716,
                8718
            ],
            [
                8718,
                8727
            ],
            [
                8728,
                8755
            ],
            [
                8761,
                8780
            ],
            [
                8780,
                8782
            ],
            [
                8782,
                8791
            ],
            [
                8792,
                8825
            ],
            [
                8827,
                8843
            ],
            [
                8843,
                8857
            ],
            [
                8857,
                8868
            ],
            [
                8868,
                8870
            ],
            [
                8870,
                8922
            ],
            [
                8925,
                8933
            ],
            [
                8941,
                8962
            ],
            [
                8964,
                8965
            ],
            [
                8966,
                9020
            ],
            [
                9023,
                9089
            ],
            [
                9089,
                9096
            ],
            [
                9097,
                9138
            ],
            [
                9139,
                9143
            ],
            [
                9157,
                9180
            ],
            [
                9181,
                9183
            ],
            [
                9190,
                9214
            ],
            [
                9214,
                9216
            ],
            [
                9227,
                9237
            ],
            [
                9244,
                9247
            ],
            [
                9248,
                9256
            ],
            [
                9256,
                9323
            ],
            [
                9323,
                9336
            ],
            [
                9337,
                9390
            ],
            [
                9391,
                9394
            ],
            [
                9395,
                9435
            ],
            [
                9436,
                9443
            ],
            [
                9444,
                9461
            ],
            [
                9461,
                9562
            ],
            [
                9563,
                9566
            ],
            [
                9575,
                9636
            ],
            [
                9636,
                9641
            ],
            [
                9642,
                9645
            ],
            [
                9646,
                9649
            ],
            [
                9650,
                9690
            ],
            [
                9691,
                9701
            ],
            [
                9702,
                9711
            ],
            [
                9719,
                9731
            ],
            [
                9732,
                9874
            ],
            [
                9875,
                9901
            ],
            [
                9904,
                9912
            ],
            [
                9913,
                9919
            ],
            [
                9933,
                9936
            ],
            [
                9943,
                9971
            ],
            [
                9972,
                9976
            ],
            [
                9977,
                9980
            ],
            [
                9981,
                9997
            ],
            [
                9997,
                10064
            ],
            [
                10065,
                10096
            ],
            [
                10097,
                10109
            ],
            [
                10115,
                10118
            ],
            [
                10119,
                10132
            ],
            [
                10134,
                10144
            ],
            [
                10148,
                10192
            ],
            [
                10192,
                10196
            ],
            [
                10197,
                10308
            ],
            [
                10311,
                10377
            ],
            [
                10381,
                10410
            ],
            [
                10410,
                10412
            ],
            [
                10415,
                10466
            ],
            [
                10472,
                10477
            ],
            [
                10478,
                10485
            ],
            [
                10486,
                10489
            ],
            [
                10490,
                10493
            ],
            [
                10498,
                10500
            ],
            [
                10500,
                10561
            ],
            [
                10562,
                10598
            ],
            [
                10599,
                10604
            ],
            [
                10605,
                10613
            ],
            [
                10613,
                10615
            ],
            [
                10615,
                10644
            ],
            [
                10648,
                10659
            ],
            [
                10668,
                10674
            ],
            [
                10678,
                10681
            ],
            [
                10688,
                10698
            ],
            [
                10699,
                10712
            ],
            [
                10713,
                10721
            ],
            [
                10721,
                10735
            ],
            [
                10738,
                10743
            ],
            [
                10743,
                10744
            ],
            [
                10745,
                10842
            ],
            [
                10842,
                10880
            ],
            [
                10880,
                10924
            ],
            [
                10927,
                10944
            ],
            [
                10946,
                10987
            ],
            [
                10988,
                11050
            ],
            [
                11050,
                11062
            ],
            [
                11062,
                11070
            ],
            [
                11070,
                11071
            ],
            [
                11072,
                11091
            ],
            [
                11094,
                11112
            ],
            [
                11119,
                11142
            ],
            [
                11144,
                11152
            ],
            [
                11153,
                11165
            ],
            [
                11166,
                11189
            ],
            [
                11190,
                11200
            ],
            [
                11205,
                11206
            ],
            [
                11207,
                11244
            ],
            [
                11244,
                11250
            ],
            [
                11259,
                11279
            ],
            [
                11291,
                11326
            ],
            [
                11326,
                11378
            ],
            [
                11378,
                11422
            ],
            [
                11422,
                11444
            ],
            [
                11444,
                11463
            ],
            [
                11463,
                11485
            ],
            [
                11485,
                11543
            ],
            [
                11543,
                11550
            ],
            [
                11550,
                11623
            ],
            [
                11623,
                11675
            ],
            [
                11675,
                11679
            ],
            [
                11680,
                11691
            ],
            [
                11694,
                11709
            ],
            [
                11710,
                11752
            ],
            [
                11760,
                11770
            ],
            [
                11770,
                11772
            ],
            [
                11782,
                11822
            ],
            [
                11822,
                11875
            ],
            [
                11893,
                11932
            ],
            [
                11932,
                11939
            ],
            [
                11940,
                11943
            ],
            [
                11956,
                11966
            ],
            [
                11976,
                12036
            ],
            [
                12036,
                12041
            ],
            [
                12042,
                12093
            ],
            [
                12094,
                12100
            ],
            [
                12101,
                12109
            ],
            [
                12110,
                12137
            ],
            [
                12138,
                12151
            ],
            [
                12155,
                12156
            ],
            [
                12166,
                12207
            ],
            [
                12212,
                12248
            ],
            [
                12248,
                12250
            ],
            [
                12250,
                12309
            ],
            [
                12316,
                12372
            ],
            [
                12372,
                12411
            ],
            [
                12412,
                12414
            ],
            [
                12415,
                12485
            ],
            [
                12492,
                12494
            ],
            [
                12511,
                12539
            ],
            [
                12545,
                12548
            ],
            [
                12566,
                12574
            ],
            [
                12585,
                12590
            ],
            [
                12590,
                12592
            ],
            [
                12595,
                12605
            ],
            [
                12606,
                12613
            ],
            [
                12614,
                12683
            ],
            [
                12683,
                12699
            ],
            [
                12699,
                12760
            ],
            [
                12767,
                12771
            ],
            [
                12772,
                12777
            ],
            [
                12777,
                12869
            ],
            [
                12875,
                12997
            ],
            [
                12997,
                13080
            ],
            [
                13084,
                13094
            ],
            [
                13094,
                13122
            ],
            [
                13123,
                13128
            ],
            [
                13130,
                13141
            ],
            [
                13152,
                13204
            ],
            [
                13204,
                13320
            ],
            [
                13320,
                13345
            ],
            [
                13356,
                13374
            ],
            [
                13374,
                13375
            ],
            [
                13376,
                13387
            ],
            [
                13388,
                13395
            ],
            [
                13396,
                13411
            ],
            [
                13411,
                13429
            ],
            [
                13430,
                13434
            ],
            [
                13438,
                13445
            ],
            [
                13445,
                13530
            ],
            [
                13531,
                13543
            ],
            [
                13544,
                13548
            ],
            [
                13548,
                13620
            ],
            [
                13627,
                13661
            ],
            [
                13662,
                13673
            ],
            [
                13674,
                13688
            ],
            [
                13689,
                13744
            ],
            [
                13752,
                13754
            ],
            [
                13754,
                13822
            ],
            [
                13822,
                13824
            ],
            [
                13824,
                13858
            ],
            [
                13860,
                13862
            ],
            [
                13865,
                13977
            ],
            [
                13977,
                13980
            ],
            [
                13980,
                13987
            ],
            [
                13987,
                14026
            ],
            [
                14026,
                14048
            ],
            [
                14049,
                14060
            ],
            [
                14060,
                14062
            ],
            [
                14062,
                14119
            ],
            [
                14119,
                14224
            ],
            [
                14224,
                14296
            ],
            [
                14296,
                14297
            ],
            [
                14300,
                14334
            ],
            [
                14334,
                14337
            ],
            [
                14338,
                14369
            ],
            [
                14370,
                14372
            ],
            [
                14373,
                14415
            ],
            [
                14415,
                14430
            ],
            [
                14430,
                14518
            ],
            [
                14518,
                14537
            ],
            [
                14537,
                14585
            ],
            [
                14586,
                14599
            ],
            [
                14599,
                14637
            ],
            [
                14637,
                14663
            ],
            [
                14663,
                14686
            ],
            [
                14687,
                14752
            ],
            [
                14754,
                14763
            ],
            [
                14765,
                14809
            ],
            [
                14809,
                14875
            ],
            [
                14875,
                14981
            ],
            [
                14981,
                15071
            ],
            [
                15071,
                15085
            ],
            [
                15088,
                15091
            ],
            [
                15092,
                15122
            ],
            [
                15122,
                15136
            ],
            [
                15139,
                15151
            ],
            [
                15152,
                15212
            ],
            [
                15212,
                15324
            ],
            [
                15327,
                15373
            ],
            [
                15375,
                15495
            ],
            [
                15496,
                15569
            ],
            [
                15570,
                15585
            ],
            [
                15585,
                15601
            ],
            [
                15602,
                15659
            ],
            [
                15659,
                15736
            ],
            [
                15736,
                15748
            ],
            [
                15748,
                15784
            ],
            [
                15784,
                15823
            ],
            [
                15823,
                15825
            ],
            [
                15825,
                15904
            ],
            [
                15904,
                15965
            ],
            [
                15965,
                16032
            ],
            [
                16032,
                16049
            ],
            [
                16049,
                16062
            ],
            [
                16073,
                16095
            ],
            [
                16095,
                16128
            ],
            [
                16128,
                16174
            ],
            [
                16175,
                16190
            ],
            [
                16190,
                16227
            ],
            [
                16230,
                16245
            ],
            [
                16245,
                16247
            ],
            [
                16247,
                16317
            ],
            [
                16317,
                16358
            ],
            [
                16358,
                16396
            ],
            [
                16399,
                16418
            ],
            [
                16418,
                16434
            ],
            [
                16436,
                16464
            ],
            [
                16464,
                16471
            ],
            [
                16472,
                16482
            ],
            [
                16483,
                16522
            ],
            [
                16522,
                16540
            ],
            [
                16540,
                16562
            ],
            [
                16567,
                16577
            ],
            [
                16577,
                16596
            ],
            [
                16596,
                16659
            ],
            [
                16661,
                16703
            ],
            [
                16703,
                16780
            ],
            [
                16780,
                16814
            ],
            [
                16814,
                16890
            ],
            [
                16890,
                16908
            ],
            [
                16911,
                16921
            ],
            [
                16921,
                16981
            ],
            [
                16981,
                17001
            ],
            [
                17001,
                17043
            ],
            [
                17043,
                17149
            ],
            [
                17149,
                17171
            ],
            [
                17171,
                17173
            ],
            [
                17173,
                17229
            ],
            [
                17229,
                17283
            ],
            [
                17286,
                17343
            ],
            [
                17347,
                17353
            ],
            [
                17353,
                17388
            ],
            [
                17388,
                17407
            ],
            [
                17407,
                17425
            ],
            [
                17425,
                17455
            ],
            [
                17455,
                17463
            ],
            [
                17463,
                17476
            ],
            [
                17476,
                17544
            ],
            [
                17544,
                17575
            ],
            [
                17575,
                17595
            ],
            [
                17595,
                17704
            ],
            [
                17704,
                17903
            ],
            [
                17903,
                17922
            ],
            [
                17923,
                17999
            ],
            [
                17999,
                18017
            ],
            [
                18018,
                18045
            ],
            [
                18045,
                18115
            ],
            [
                18115,
                18122
            ],
            [
                18128,
                18212
            ],
            [
                18212,
                18230
            ],
            [
                18231,
                18286
            ],
            [
                18286,
                18521
            ],
            [
                18521,
                18585
            ],
            [
                18585,
                18702
            ],
            [
                18703,
                18720
            ],
            [
                18721,
                18782
            ],
            [
                18782,
                18818
            ],
            [
                18818,
                18844
            ],
            [
                18844,
                18912
            ],
            [
                18915,
                19055
            ],
            [
                19055,
                19073
            ],
            [
                19073,
                19103
            ],
            [
                19103,
                19115
            ],
            [
                19115,
                19141
            ],
            [
                19141,
                19282
            ],
            [
                19282,
                19392
            ],
            [
                19392,
                19450
            ],
            [
                19450,
                19515
            ],
            [
                19523,
                19528
            ],
            [
                19529,
                19533
            ],
            [
                19534,
                19539
            ],
            [
                19540,
                19584
            ],
            [
                19587,
                19603
            ],
            [
                19603,
                19613
            ],
            [
                19613,
                19634
            ],
            [
                19634,
                19653
            ],
            [
                19653,
                19654
            ],
            [
                19655,
                19689
            ],
            [
                19689,
                19717
            ],
            [
                19717,
                19727
            ],
            [
                19727,
                19773
            ],
            [
                19773,
                19886
            ],
            [
                19887,
                19905
            ],
            [
                19905,
                19910
            ],
            [
                19911,
                19947
            ],
            [
                19947,
                19948
            ],
            [
                19949,
                20044
            ],
            [
                20044,
                20127
            ],
            [
                20127,
                20179
            ],
            [
                20179,
                20185
            ],
            [
                20185,
                20241
            ],
            [
                20244,
                20279
            ],
            [
                20279,
                20317
            ],
            [
                20320,
                20346
            ],
            [
                20347,
                20402
            ],
            [
                20405,
                20426
            ],
            [
                20429,
                20443
            ],
            [
                20449,
                20461
            ],
            [
                20461,
                20483
            ],
            [
                20483,
                20559
            ],
            [
                20560,
                20642
            ],
            [
                20643,
                20645
            ],
            [
                20646,
                20664
            ],
            [
                20665,
                20706
            ],
            [
                20706,
                20735
            ],
            [
                20735,
                20737
            ],
            [
                20737,
                20751
            ],
            [
                20756,
                20759
            ],
            [
                20760,
                20780
            ],
            [
                20785,
                20801
            ],
            [
                20801,
                20862
            ],
            [
                20867,
                20874
            ],
            [
                20892,
                20894
            ],
            [
                20895,
                20912
            ],
            [
                20913,
                20920
            ],
            [
                20929,
                20992
            ],
            [
                20992,
                21001
            ],
            [
                21001,
                21024
            ],
            [
                21036,
                21080
            ],
            [
                21081,
                21125
            ],
            [
                21125,
                21134
            ],
            [
                21134,
                21206
            ],
            [
                21207,
                21210
            ],
            [
                21211,
                21220
            ],
            [
                21220,
                21222
            ],
            [
                21222,
                21225
            ],
            [
                21228,
                21274
            ],
            [
                21274,
                21297
            ],
            [
                21297,
                21343
            ],
            [
                21343,
                21344
            ],
            [
                21344,
                21373
            ],
            [
                21373,
                21379
            ],
            [
                21382,
                21415
            ],
            [
                21415,
                21434
            ],
            [
                21434,
                21463
            ],
            [
                21464,
                21497
            ],
            [
                21498,
                21552
            ],
            [
                21552,
                21591
            ],
            [
                21592,
                21595
            ],
            [
                21596,
                21640
            ],
            [
                21641,
                21667
            ],
            [
                21667,
                21691
            ],
            [
                21691,
                21720
            ],
            [
                21720,
                21780
            ],
            [
                21780,
                21802
            ],
            [
                21811,
                21816
            ],
            [
                21817,
                21823
            ],
            [
                21824,
                21860
            ],
            [
                21861,
                21877
            ],
            [
                21887,
                21928
            ],
            [
                21929,
                21946
            ],
            [
                21951,
                21988
            ],
            [
                21988,
                21990
            ],
            [
                21990,
                22102
            ],
            [
                22102,
                22153
            ],
            [
                22158,
                22176
            ],
            [
                22179,
                22206
            ],
            [
                22206,
                22265
            ],
            [
                22265,
                22287
            ],
            [
                22293,
                22308
            ],
            [
                22308,
                22310
            ],
            [
                22310,
                22332
            ],
            [
                22332,
                22352
            ],
            [
                22353,
                22437
            ],
            [
                22437,
                22439
            ],
            [
                22440,
                22490
            ],
            [
                22490,
                22492
            ],
            [
                22492,
                22526
            ],
            [
                22531,
                22548
            ],
            [
                22554,
                22597
            ],
            [
                22599,
                22632
            ],
            [
                22632,
                22690
            ],
            [
                22690,
                22704
            ],
            [
                22705,
                22707
            ],
            [
                22708,
                22716
            ],
            [
                22717,
                22720
            ],
            [
                22721,
                22740
            ],
            [
                22742,
                22759
            ],
            [
                22765,
                22772
            ],
            [
                22774,
                22835
            ],
            [
                22835,
                22918
            ],
            [
                22918,
                22919
            ],
            [
                22920,
                22923
            ],
            [
                22924,
                22950
            ],
            [
                22950,
                22981
            ],
            [
                22982,
                22985
            ],
            [
                22986,
                22995
            ],
            [
                22996,
                23002
            ],
            [
                23002,
                23004
            ],
            [
                23004,
                23115
            ],
            [
                23115,
                23117
            ],
            [
                23117,
                23226
            ],
            [
                23226,
                23265
            ],
            [
                23265,
                23278
            ],
            [
                23279,
                23291
            ],
            [
                23292,
                23338
            ],
            [
                23338,
                23378
            ],
            [
                23378,
                23426
            ]
        ],
        "row_chars": [
            [
                0,
                74
            ],
            [
                74,
                235
            ],
            [
                235,
                315
            ],
            [
                315,
                439
            ],
            [
                439,
                487
            ],
            [
                487,
                498
            ],
            [
                498,
                566
            ],
            [
                566,
                616
            ],
            [
                616,
                628
            ],
            [
                628,
                722
            ],
            [
                722,
                804
            ],
            [
                804,
                866
            ],
            [
                866,
                984
            ],
            [
                984,
                1170
            ],
            [
                1170,
                1187
            ],
            [
                1187,
                1199
            ],
            [
                1199,
                1221
            ],
            [
                1221,
                1230
            ],
            [
                1230,
                1230
            ],
            [
                1230,
                1281
            ],
            [
                1281,
                1358
            ],
            [
                1358,
                1416
            ],
            [
                1416,
                1461
            ],
            [
                1461,
                1508
            ],
            [
                1508,
                1559
            ],
            [
                1559,
                1582
            ],
            [
                1582,
                1615
            ],
            [
                1615,
                1635
            ],
            [
                1635,
                1657
            ],
            [
                1657,
                1717
            ],
            [
                1717,
                1731
            ],
            [
                1731,
                1742
            ],
            [
                1742,
                1865
            ],
            [
                1865,
                1947
            ],
            [
                1947,
                1947
            ],
            [
                1947,
                2051
            ],
            [
                2051,
                2552
            ],
            [
                2552,
                2575
            ],
            [
                2575,
                2667
            ],
            [
                2667,
                2794
            ],
            [
                2794,
                2855
            ],
            [
                2855,
                2855
            ],
            [
                2855,
                2954
            ],
            [
                2954,
                2954
            ],
            [
                2954,
                2954
            ],
            [
                2954,
                2954
            ],
            [
                2954,
                2954
            ],
            [
                2954,
                3065
            ],
            [
                3065,
                3327
            ],
            [
                3327,
                3327
            ],
            [
                3327,
                3467
            ],
            [
                3467,
                3582
            ],
            [
                3582,
                3657
            ],
            [
                3657,
                3764
            ],
            [
                3764,
                3934
            ],
            [
                3934,
                3934
            ],
            [
                3934,
                4024
            ],
            [
                4024,
                4060
            ],
            [
                4060,
                4120
            ],
            [
                4120,
                4147
            ],
            [
                4147,
                4153
            ],
            [
                4153,
                4220
            ],
            [
                4220,
                4283
            ],
            [
                4283,
                4318
            ],
            [
                4318,
                4431
            ],
            [
                4431,
                4431
            ],
            [
                4431,
                4468
            ],
            [
                4468,
                4514
            ],
            [
                4514,
                4569
            ],
            [
                4569,
                4569
            ],
            [
                4569,
                4569
            ],
            [
                4569,
                4591
            ],
            [
                4591,
                4678
            ],
            [
                4678,
                4733
            ],
            [
                4733,
                4890
            ],
            [
                4890,
                5077
            ],
            [
                5077,
                5180
            ],
            [
                5180,
                5369
            ],
            [
                5369,
                5369
            ],
            [
                5369,
                5427
            ],
            [
                5427,
                5467
            ],
            [
                5467,
                5613
            ],
            [
                5613,
                5613
            ],
            [
                5613,
                5688
            ],
            [
                5688,
                5732
            ],
            [
                5732,
                5772
            ],
            [
                5772,
                5861
            ],
            [
                5861,
                6012
            ],
            [
                6012,
                6128
            ],
            [
                6128,
                6243
            ],
            [
                6243,
                6288
            ],
            [
                6288,
                6330
            ],
            [
                6330,
                6514
            ],
            [
                6514,
                6558
            ],
            [
                6558,
                6666
            ],
            [
                6666,
                6666
            ],
            [
                6666,
                6833
            ],
            [
                6833,
                6841
            ],
            [
                6841,
                6851
            ],
            [
                6851,
                6899
            ],
            [
                6899,
                6910
            ],
            [
                6910,
                7006
            ],
            [
                7006,
                7080
            ],
            [
                7080,
                7212
            ],
            [
                7212,
                7212
            ],
            [
                7212,
                7288
            ],
            [
                7288,
                7317
            ],
            [
                7317,
                7350
            ],
            [
                7350,
                7405
            ],
            [
                7405,
                7447
            ],
            [
                7447,
                7479
            ],
            [
                7479,
                7695
            ],
            [
                7695,
                7744
            ],
            [
                7744,
                7833
            ],
            [
                7833,
                7833
            ],
            [
                7833,
                7851
            ],
            [
                7851,
                7905
            ],
            [
                7905,
                7966
            ],
            [
                7966,
                7997
            ],
            [
                7997,
                8079
            ],
            [
                8079,
                8165
            ],
            [
                8165,
                8218
            ],
            [
                8218,
                8239
            ],
            [
                8239,
                8276
            ],
            [
                8276,
                8357
            ],
            [
                8357,
                8357
            ],
            [
                8357,
                8405
            ],
            [
                8405,
                8409
            ],
            [
                8409,
                8557
            ],
            [
                8557,
                8602
            ],
            [
                8602,
                8685
            ],
            [
                8685,
                8718
            ],
            [
                8718,
                8782
            ],
            [
                8782,
                8827
            ],
            [
                8827,
                8827
            ],
            [
                8827,
                8843
            ],
            [
                8843,
                8857
            ],
            [
                8857,
                8870
            ],
            [
                8870,
                9089
            ],
            [
                9089,
                9214
            ],
            [
                9214,
                9461
            ],
            [
                9461,
                9563
            ],
            [
                9563,
                9563
            ],
            [
                9563,
                9997
            ],
            [
                9997,
                10192
            ],
            [
                10192,
                10412
            ],
            [
                10412,
                10412
            ],
            [
                10412,
                10500
            ],
            [
                10500,
                10615
            ],
            [
                10615,
                10615
            ],
            [
                10615,
                10713
            ],
            [
                10713,
                10721
            ],
            [
                10721,
                10735
            ],
            [
                10735,
                10745
            ],
            [
                10745,
                10880
            ],
            [
                10880,
                10988
            ],
            [
                10988,
                11050
            ],
            [
                11050,
                11062
            ],
            [
                11062,
                11144
            ],
            [
                11144,
                11190
            ],
            [
                11190,
                11244
            ],
            [
                11244,
                11422
            ],
            [
                11422,
                11444
            ],
            [
                11444,
                11463
            ],
            [
                11463,
                11485
            ],
            [
                11485,
                11543
            ],
            [
                11543,
                11550
            ],
            [
                11550,
                11623
            ],
            [
                11623,
                11675
            ],
            [
                11675,
                11694
            ],
            [
                11694,
                11772
            ],
            [
                11772,
                11932
            ],
            [
                11932,
                12157
            ],
            [
                12157,
                12157
            ],
            [
                12157,
                12250
            ],
            [
                12250,
                12494
            ],
            [
                12494,
                12494
            ],
            [
                12494,
                12592
            ],
            [
                12592,
                12683
            ],
            [
                12683,
                12699
            ],
            [
                12699,
                12777
            ],
            [
                12777,
                12777
            ],
            [
                12777,
                12869
            ],
            [
                12869,
                12997
            ],
            [
                12997,
                13094
            ],
            [
                13094,
                13204
            ],
            [
                13204,
                13320
            ],
            [
                13320,
                13411
            ],
            [
                13411,
                13445
            ],
            [
                13445,
                13544
            ],
            [
                13544,
                13544
            ],
            [
                13544,
                13544
            ],
            [
                13544,
                13754
            ],
            [
                13754,
                13824
            ],
            [
                13824,
                13980
            ],
            [
                13980,
                13987
            ],
            [
                13987,
                14026
            ],
            [
                14026,
                14062
            ],
            [
                14062,
                14119
            ],
            [
                14119,
                14224
            ],
            [
                14224,
                14296
            ],
            [
                14296,
                14334
            ],
            [
                14334,
                14415
            ],
            [
                14415,
                14430
            ],
            [
                14430,
                14518
            ],
            [
                14518,
                14599
            ],
            [
                14599,
                14637
            ],
            [
                14637,
                14663
            ],
            [
                14663,
                14809
            ],
            [
                14809,
                14875
            ],
            [
                14875,
                14981
            ],
            [
                14981,
                15071
            ],
            [
                15071,
                15212
            ],
            [
                15212,
                15327
            ],
            [
                15327,
                15373
            ],
            [
                15373,
                15585
            ],
            [
                15585,
                15659
            ],
            [
                15659,
                15736
            ],
            [
                15736,
                15748
            ],
            [
                15748,
                15784
            ],
            [
                15784,
                15825
            ],
            [
                15825,
                15904
            ],
            [
                15904,
                15965
            ],
            [
                15965,
                16032
            ],
            [
                16032,
                16049
            ],
            [
                16049,
                16095
            ],
            [
                16095,
                16128
            ],
            [
                16128,
                16190
            ],
            [
                16190,
                16247
            ],
            [
                16247,
                16317
            ],
            [
                16317,
                16358
            ],
            [
                16358,
                16399
            ],
            [
                16399,
                16418
            ],
            [
                16418,
                16464
            ],
            [
                16464,
                16522
            ],
            [
                16522,
                16540
            ],
            [
                16540,
                16577
            ],
            [
                16577,
                16596
            ],
            [
                16596,
                16703
            ],
            [
                16703,
                16780
            ],
            [
                16780,
                16814
            ],
            [
                16814,
                16890
            ],
            [
                16890,
                16921
            ],
            [
                16921,
                16981
            ],
            [
                16981,
                17043
            ],
            [
                17043,
                17149
            ],
            [
                17149,
                17173
            ],
            [
                17173,
                17229
            ],
            [
                17229,
                17286
            ],
            [
                17286,
                17353
            ],
            [
                17353,
                17388
            ],
            [
                17388,
                17407
            ],
            [
                17407,
                17425
            ],
            [
                17425,
                17455
            ],
            [
                17455,
                17463
            ],
            [
                17463,
                17476
            ],
            [
                17476,
                17544
            ],
            [
                17544,
                17575
            ],
            [
                17575,
                17595
            ],
            [
                17595,
                17704
            ],
            [
                17704,
                17903
            ],
            [
                17903,
                17999
            ],
            [
                17999,
                18018
            ],
            [
                18018,
                18045
            ],
            [
                18045,
                18115
            ],
            [
                18115,
                18212
            ],
            [
                18212,
                18286
            ],
            [
                18286,
                18521
            ],
            [
                18521,
                18585
            ],
            [
                18585,
                18782
            ],
            [
                18782,
                18818
            ],
            [
                18818,
                18844
            ],
            [
                18844,
                19055
            ],
            [
                19055,
                19073
            ],
            [
                19073,
                19103
            ],
            [
                19103,
                19115
            ],
            [
                19115,
                19141
            ],
            [
                19141,
                19282
            ],
            [
                19282,
                19392
            ],
            [
                19392,
                19450
            ],
            [
                19450,
                19515
            ],
            [
                19515,
                19515
            ],
            [
                19515,
                19540
            ],
            [
                19540,
                19540
            ],
            [
                19540,
                19603
            ],
            [
                19603,
                19613
            ],
            [
                19613,
                19634
            ],
            [
                19634,
                19689
            ],
            [
                19689,
                19717
            ],
            [
                19717,
                19727
            ],
            [
                19727,
                19773
            ],
            [
                19773,
                19949
            ],
            [
                19949,
                20044
            ],
            [
                20044,
                20127
            ],
            [
                20127,
                20179
            ],
            [
                20179,
                20185
            ],
            [
                20185,
                20279
            ],
            [
                20279,
                20461
            ],
            [
                20461,
                20483
            ],
            [
                20483,
                20643
            ],
            [
                20643,
                20643
            ],
            [
                20643,
                20706
            ],
            [
                20706,
                20737
            ],
            [
                20737,
                20801
            ],
            [
                20801,
                20992
            ],
            [
                20992,
                21001
            ],
            [
                21001,
                21081
            ],
            [
                21081,
                21081
            ],
            [
                21081,
                21125
            ],
            [
                21125,
                21134
            ],
            [
                21134,
                21222
            ],
            [
                21222,
                21222
            ],
            [
                21222,
                21274
            ],
            [
                21274,
                21297
            ],
            [
                21297,
                21343
            ],
            [
                21343,
                21373
            ],
            [
                21373,
                21415
            ],
            [
                21415,
                21434
            ],
            [
                21434,
                21464
            ],
            [
                21464,
                21498
            ],
            [
                21498,
                21552
            ],
            [
                21552,
                21667
            ],
            [
                21667,
                21691
            ],
            [
                21691,
                21720
            ],
            [
                21720,
                21877
            ],
            [
                21877,
                21990
            ],
            [
                21990,
                22102
            ],
            [
                22102,
                22206
            ],
            [
                22206,
                22265
            ],
            [
                22265,
                22310
            ],
            [
                22310,
                22332
            ],
            [
                22332,
                22353
            ],
            [
                22353,
                22437
            ],
            [
                22437,
                22492
            ],
            [
                22492,
                22632
            ],
            [
                22632,
                22690
            ],
            [
                22690,
                22835
            ],
            [
                22835,
                22920
            ],
            [
                22920,
                22920
            ],
            [
                22920,
                22920
            ],
            [
                22920,
                23004
            ],
            [
                23004,
                23117
            ],
            [
                23117,
                23226
            ],
            [
                23226,
                23265
            ],
            [
                23265,
                23338
            ],
            [
                23338,
                23378
            ],
            [
                23378,
                23426
            ]
        ]
    }
}