{
    "original": {
        "text": "Among the most respected of the names beginning in C which the Court-Guide contained, in the year 18--, was that of Crawley, Sir Pitt, Baronet, Great Gaunt Street, and Queen's Crawley, Hants. This honourable name had figured constantly also in the Parliamentary list for many years, in conjunction with that of a number of other worthy gentlemen who sat in turns for the borough.\nIt is related, with regard to the borough of Queen's Crawley, that Queen Elizabeth in one of her progresses, stopping at Crawley to breakfast, was so delighted with some remarkably fine Hampshire beer which was then presented to her by the Crawley of the day (a handsome gentleman with a trim beard and a good leg), that she forthwith erected Crawley into a borough to send two members to Parliament; and the place, from the day of that illustrious visit, took the name of Queen's Crawley, which it holds up to the present moment. And though, by the lapse of time, and those mutations which age produces in empires, cities, and boroughs, Queen's Crawley was no longer so populous a place as it had been in Queen Bess's time--nay, was come down to that condition of borough which used to be denominated rotten--yet, as Sir Pitt Crawley would say with perfect justice in his elegant way, \"Rotten! be hanged--it produces me a good fifteen hundred a year.\"\nSir Pitt Crawley (named after the great Commoner) was the son of Walpole Crawley, first Baronet, of the Tape and Sealing-Wax Office in the reign of George II., when he was impeached for peculation, as were a great number of other honest gentlemen of those days; and Walpole Crawley was, as need scarcely be said, son of John Churchill Crawley, named after the celebrated military commander of the reign of Queen Anne. The family tree (which hangs up at Queen's Crawley) furthermore mentions Charles Stuart, afterwards called Barebones Crawley, son of the Crawley of James the First's time; and finally, Queen Elizabeth's Crawley, who is represented as the foreground of the picture in his forked beard and armour. Out of his waistcoat, as usual, grows a tree, on the main branches of which the above illustrious names are inscribed. Close by the name of Sir Pitt Crawley, Baronet (the subject of the present memoir), are written that of his brother, the Reverend Bute Crawley (the great Commoner was in disgrace when the reverend gentleman was born), rector of Crawley-cum-Snailby, and of various other male and female members of the Crawley family.\nSir Pitt was first married to Grizzel, sixth daughter of Mungo Binkie, Lord Binkie, and cousin, in consequence, of Mr. Dundas. She brought him two sons: Pitt, named not so much after his father as after the heaven-born minister; and Rawdon Crawley, from the Prince of Wales's friend, whom his Majesty George IV forgot so completely. Many years after her ladyship's demise, Sir Pitt led to the altar Rosa, daughter of Mr. G. Dawson, of Mudbury, by whom he had two daughters, for whose benefit Miss Rebecca Sharp was now engaged as governess. It will be seen that the young lady was come into a family of very genteel connexions, and was about to move in a much more distinguished circle than that humble one which she had just quitted in Russell Square.\nShe had received her orders to join her pupils, in a note which was written upon an old envelope, and which contained the following words:\nSir Pitt Crawley begs Miss Sharp and baggidge may be hear on Tuesday, as I leaf for Queen's Crawley to-morrow morning ERLY.\nGreat Gaunt Street.\nRebecca had never seen a Baronet, as far as she knew, and as soon as she had taken leave of Amelia, and counted the guineas which good-natured Mr. Sedley had put into a purse for her, and as soon as she had done wiping her eyes with her handkerchief (which operation she concluded the very moment the carriage had turned the corner of the street), she began to depict in her own mind what a Baronet must be. \"I wonder, does he wear a star?\" thought she, \"or is it only lords that wear stars? But he will be very handsomely dressed in a court suit, with ruffles, and his hair a little powdered, like Mr. Wroughton at Covent Garden. I suppose he will be awfully proud, and that I shall be treated most contemptuously. Still I must bear my hard lot as well as I can--at least, I shall be amongst GENTLEFOLKS, and not with vulgar city people\": and she fell to thinking of her Russell Square friends with that very same philosophical bitterness with which, in a certain apologue, the fox is represented as speaking of the grapes.\nHaving passed through Gaunt Square into Great Gaunt Street, the carriage at length stopped at a tall gloomy house between two other tall gloomy houses, each with a hatchment over the middle drawing-room window; as is the custom of houses in Great Gaunt Street, in which gloomy locality death seems to reign perpetual. The shutters of the first-floor windows of Sir Pitt's mansion were closed--those of the dining-room were partially open, and the blinds neatly covered up in old newspapers.\nJohn, the groom, who had driven the carriage alone, did not care to descend to ring the bell; and so prayed a passing milk-boy to perform that office for him. When the bell was rung, a head appeared between the interstices of the dining-room shutters, and the door was opened by a man in drab breeches and gaiters, with a dirty old coat, a foul old neckcloth lashed round his bristly neck, a shining bald head, a leering red face, a pair of twinkling grey eyes, and a mouth perpetually on the grin.\n\"This Sir Pitt Crawley's?\" says John, from the box.\n\"Ees,\" says the man at the door, with a nod.\n\"Hand down these 'ere trunks then,\" said John.\n\"Hand 'n down yourself,\" said the porter.\n\"Don't you see I can't leave my hosses? Come, bear a hand, my fine feller, and Miss will give you some beer,\" said John, with a horse-laugh, for he was no longer respectful to Miss Sharp, as her connexion with the family was broken off, and as she had given nothing to the servants on coming away.\nThe bald-headed man, taking his hands out of his breeches pockets, advanced on this summons, and throwing Miss Sharp's trunk over his shoulder, carried it into the house.\n\"Take this basket and shawl, if you please, and open the door,\" said Miss Sharp, and descended from the carriage in much indignation. \"I shall write to Mr. Sedley and inform him of your conduct,\" said she to the groom.\n\"Don't,\" replied that functionary. \"I hope you've forgot nothink? Miss 'Melia's gownds--have you got them--as the lady's maid was to have 'ad? I hope they'll fit you. Shut the door, Jim, you'll get no good out of 'ER,\" continued John, pointing with his thumb towards Miss Sharp: \"a bad lot, I tell you, a bad lot,\" and so saying, Mr. Sedley's groom drove away. The truth is, he was attached to the lady's maid in question, and indignant that she should have been robbed of her perquisites.\nOn entering the dining-room, by the orders of the individual in gaiters, Rebecca found that apartment not more cheerful than such rooms usually are, when genteel families are out of town. The faithful chambers seem, as it were, to mourn the absence of their masters. The turkey carpet has rolled itself up, and retired sulkily under the sideboard: the pictures have hidden their faces behind old sheets of brown paper: the ceiling lamp is muffled up in a dismal sack of brown holland: the window-curtains have disappeared under all sorts of shabby envelopes: the marble bust of Sir Walpole Crawley is looking from its black corner at the bare boards and the oiled fire-irons, and the empty card-racks over the mantelpiece: the cellaret has lurked away behind the carpet: the chairs are turned up heads and tails along the walls: and in the dark corner opposite the statue, is an old-fashioned crabbed knife-box, locked and sitting on a dumb waiter.\nTwo kitchen chairs, and a round table, and an attenuated old poker and tongs were, however, gathered round the fire-place, as was a saucepan over a feeble sputtering fire. There was a bit of cheese and bread, and a tin candlestick on the table, and a little black porter in a pint-pot.\n\"Had your dinner, I suppose? It is not too warm for you? Like a drop of beer?\"\n\"Where is Sir Pitt Crawley?\" said Miss Sharp majestically.\n\"He, he! I'm Sir Pitt Crawley. Reklect you owe me a pint for bringing down your luggage. He, he! Ask Tinker if I aynt. Mrs. Tinker, Miss Sharp; Miss Governess, Mrs. Charwoman. Ho, ho!\"\nThe lady addressed as Mrs. Tinker at this moment made her appearance with a pipe and a paper of tobacco, for which she had been despatched a minute before Miss Sharp's arrival; and she handed the articles over to Sir Pitt, who had taken his seat by the fire.\n\"Where's the farden?\" said he. \"I gave you three halfpence. Where's the change, old Tinker?\"\n\"There!\" replied Mrs. Tinker, flinging down the coin; \"it's only baronets as cares about farthings.\"\n\"A farthing a day is seven shillings a year,\" answered the M.P.; \"seven shillings a year is the interest of seven guineas. Take care of your farthings, old Tinker, and your guineas will come quite nat'ral.\"\n\"You may be sure it's Sir Pitt Crawley, young woman,\" said Mrs. Tinker, surlily; \"because he looks to his farthings. You'll know him better afore long.\"\n\"And like me none the worse, Miss Sharp,\" said the old gentleman, with an air almost of politeness. \"I must be just before I'm generous.\"\n\"He never gave away a farthing in his life,\" growled Tinker.\n\"Never, and never will: it's against my principle. Go and get another chair from the kitchen, Tinker, if you want to sit down; and then we'll have a bit of supper.\"\nPresently the baronet plunged a fork into the saucepan on the fire, and withdrew from the pot a piece of tripe and an onion, which he divided into pretty equal portions, and of which he partook with Mrs. Tinker. \"You see, Miss Sharp, when I'm not here Tinker's on board wages: when I'm in town she dines with the family. Haw! haw! I'm glad Miss Sharp's not hungry, ain't you, Tink?\" And they fell to upon their frugal supper.\nAfter supper Sir Pitt Crawley began to smoke his pipe; and when it became quite dark, he lighted the rushlight in the tin candlestick, and producing from an interminable pocket a huge mass of papers, began reading them, and putting them in order.\n\"I'm here on law business, my dear, and that's how it happens that I shall have the pleasure of such a pretty travelling companion to-morrow.\"\n\"He's always at law business,\" said Mrs. Tinker, taking up the pot of porter.\n\"Drink and drink about,\" said the Baronet. \"Yes; my dear, Tinker is quite right: I've lost and won more lawsuits than any man in England. Look here at Crawley, Bart. v. Snaffle. I'll throw him over, or my name's not Pitt Crawley. Podder and another versus Crawley, Bart. Overseers of Snaily parish against Crawley, Bart. They can't prove it's common: I'll defy 'em; the land's mine. It no more belongs to the parish than it does to you or Tinker here. I'll beat 'em, if it cost me a thousand guineas. Look over the papers; you may if you like, my dear. Do you write a good hand? I'll make you useful when we're at Queen's Crawley, depend on it, Miss Sharp. Now the dowager's dead I want some one.\"\n\"She was as bad as he,\" said Tinker. \"She took the law of every one of her tradesmen; and turned away forty-eight footmen in four year.\"\n\"She was close--very close,\" said the Baronet, simply; \"but she was a valyble woman to me, and saved me a steward.\"--And in this confidential strain, and much to the amusement of the new-comer, the conversation continued for a considerable time. Whatever Sir Pitt Crawley's qualities might be, good or bad, he did not make the least disguise of them. He talked of himself incessantly, sometimes in the coarsest and vulgarest Hampshire accent; sometimes adopting the tone of a man of the world. And so, with injunctions to Miss Sharp to be ready at five in the morning, he bade her good night. \"You'll sleep with Tinker to-night,\" he said; \"it's a big bed, and there's room for two. Lady Crawley died in it. Good night.\"\nSir Pitt went off after this benediction, and the solemn Tinker, rushlight in hand, led the way up the great bleak stone stairs, past the great dreary drawing-room doors, with the handles muffled up in paper, into the great front bedroom, where Lady Crawley had slept her last. The bed and chamber were so funereal and gloomy, you might have fancied, not only that Lady Crawley died in the room, but that her ghost inhabited it. Rebecca sprang about the apartment, however, with the greatest liveliness, and had peeped into the huge wardrobes, and the closets, and the cupboards, and tried the drawers which were locked, and examined the dreary pictures and toilette appointments, while the old charwoman was saying her prayers. \"I shouldn't like to sleep in this yeer bed without a good conscience, Miss,\" said the old woman. \"There's room for us and a half-dozen of ghosts in it,\" says Rebecca. \"Tell me all about Lady Crawley and Sir Pitt Crawley, and everybody, my DEAR Mrs. Tinker.\"\nBut old Tinker was not to be pumped by this little cross-questioner; and signifying to her that bed was a place for sleeping, not conversation, set up in her corner of the bed such a snore as only the nose of innocence can produce. Rebecca lay awake for a long, long time, thinking of the morrow, and of the new world into which she was going, and of her chances of success there. The rushlight flickered in the basin. The mantelpiece cast up a great black shadow, over half of a mouldy old sampler, which her defunct ladyship had worked, no doubt, and over two little family pictures of young lads, one in a college gown, and the other in a red jacket like a soldier. When she went to sleep, Rebecca chose that one to dream about.\nAt four o'clock, on such a roseate summer's morning as even made Great Gaunt Street look cheerful, the faithful Tinker, having wakened her bedfellow, and bid her prepare for departure, unbarred and unbolted the great hall door (the clanging and clapping whereof startled the sleeping echoes in the street), and taking her way into Oxford Street, summoned a coach from a stand there. It is needless to particularize the number of the vehicle, or to state that the driver was stationed thus early in the neighbourhood of Swallow Street, in hopes that some young buck, reeling homeward from the tavern, might need the aid of his vehicle, and pay him with the generosity of intoxication.\nIt is likewise needless to say that the driver, if he had any such hopes as those above stated, was grossly disappointed; and that the worthy Baronet whom he drove to the City did not give him one single penny more than his fare. It was in vain that Jehu appealed and stormed; that he flung down Miss Sharp's bandboxes in the gutter at the 'Necks, and swore he would take the law of his fare.\n\"You'd better not,\" said one of the ostlers; \"it's Sir Pitt Crawley.\"\n\"So it is, Joe,\" cried the Baronet, approvingly; \"and I'd like to see the man can do me.\"\n\"So should oi,\" said Joe, grinning sulkily, and mounting the Baronet's baggage on the roof of the coach.\n\"Keep the box for me, Leader,\" exclaims the Member of Parliament to the coachman; who replied, \"Yes, Sir Pitt,\" with a touch of his hat, and rage in his soul (for he had promised the box to a young gentleman from Cambridge, who would have given a crown to a certainty), and Miss Sharp was accommodated with a back seat inside the carriage, which might be said to be carrying her into the wide world.\nHow the young man from Cambridge sulkily put his five great-coats in front; but was reconciled when little Miss Sharp was made to quit the carriage, and mount up beside him--when he covered her up in one of his Benjamins, and became perfectly good-humoured--how the asthmatic gentleman, the prim lady, who declared upon her sacred honour she had never travelled in a public carriage before (there is always such a lady in a coach--Alas! was; for the coaches, where are they?), and the fat widow with the brandy-bottle, took their places inside--how the porter asked them all for money, and got sixpence from the gentleman and five greasy halfpence from the fat widow--and how the carriage at length drove away--now threading the dark lanes of Aldersgate, anon clattering by the Blue Cupola of St. Paul's, jingling rapidly by the strangers' entry of Fleet-Market, which, with Exeter 'Change, has now departed to the world of shadows--how they passed the White Bear in Piccadilly, and saw the dew rising up from the market-gardens of Knightsbridge--how Turnhamgreen, Brentwood, Bagshot, were passed--need not be told here. But the writer of these pages, who has pursued in former days, and in the same bright weather, the same remarkable journey, cannot but think of it with a sweet and tender regret. Where is the road now, and its merry incidents of life? Is there no Chelsea or Greenwich for the old honest pimple-nosed coachmen? I wonder where are they, those good fellows? Is old Weller alive or dead? and the waiters, yea, and the inns at which they waited, and the cold rounds of beef inside, and the stunted ostler, with his blue nose and clinking pail, where is he, and where is his generation? To those great geniuses now in petticoats, who shall write novels for the beloved reader's children, these men and things will be as much legend and history as Nineveh, or Coeur de Lion, or Jack Sheppard. For them stage-coaches will have become romances--a team of four bays as fabulous as Bucephalus or Black Bess. Ah, how their coats shone, as the stable-men pulled their clothes off, and away they went--ah, how their tails shook, as with smoking sides at the stage's end they demurely walked away into the inn-yard. Alas! we shall never hear the horn sing at midnight, or see the pike-gates fly open any more. Whither, however, is the light four-inside Trafalgar coach carrying us? Let us be set down at Queen's Crawley without further divagation, and see how Miss Rebecca Sharp speeds there.",
        "paragraph_chars": [
            [
                0,
                380
            ],
            [
                380,
                1333
            ],
            [
                1333,
                2483
            ],
            [
                2483,
                3236
            ],
            [
                3236,
                3375
            ],
            [
                3375,
                3499
            ],
            [
                3499,
                3519
            ],
            [
                3519,
                4544
            ],
            [
                4544,
                5035
            ],
            [
                5035,
                5534
            ],
            [
                5534,
                5586
            ],
            [
                5586,
                5631
            ],
            [
                5631,
                5678
            ],
            [
                5678,
                5720
            ],
            [
                5720,
                6018
            ],
            [
                6018,
                6189
            ],
            [
                6189,
                6408
            ],
            [
                6408,
                6898
            ],
            [
                6898,
                7847
            ],
            [
                7847,
                8133
            ],
            [
                8133,
                8212
            ],
            [
                8212,
                8271
            ],
            [
                8271,
                8456
            ],
            [
                8456,
                8715
            ],
            [
                8715,
                8808
            ],
            [
                8808,
                8909
            ],
            [
                8909,
                9116
            ],
            [
                9116,
                9269
            ],
            [
                9269,
                9407
            ],
            [
                9407,
                9468
            ],
            [
                9468,
                9633
            ],
            [
                9633,
                10059
            ],
            [
                10059,
                10306
            ],
            [
                10306,
                10449
            ],
            [
                10449,
                10527
            ],
            [
                10527,
                11225
            ],
            [
                11225,
                11362
            ],
            [
                11362,
                12082
            ],
            [
                12082,
                13070
            ],
            [
                13070,
                13802
            ],
            [
                13802,
                14486
            ],
            [
                14486,
                14879
            ],
            [
                14879,
                14949
            ],
            [
                14949,
                15039
            ],
            [
                15039,
                15144
            ],
            [
                15144,
                15544
            ],
            [
                15544,
                18042
            ]
        ],
        "segment_chars": [
            [
                0,
                192
            ],
            [
                192,
                380
            ],
            [
                380,
                911
            ],
            [
                911,
                1275
            ],
            [
                1275,
                1333
            ],
            [
                1333,
                1751
            ],
            [
                1751,
                2047
            ],
            [
                2047,
                2166
            ],
            [
                2166,
                2483
            ],
            [
                2483,
                2610
            ],
            [
                2610,
                2816
            ],
            [
                2816,
                3024
            ],
            [
                3024,
                3236
            ],
            [
                3236,
                3375
            ],
            [
                3375,
                3499
            ],
            [
                3499,
                3519
            ],
            [
                3519,
                3927
            ],
            [
                3927,
                3960
            ],
            [
                3960,
                4011
            ],
            [
                4011,
                4150
            ],
            [
                4150,
                4235
            ],
            [
                4235,
                4544
            ],
            [
                4544,
                4862
            ],
            [
                4862,
                5035
            ],
            [
                5035,
                5194
            ],
            [
                5194,
                5534
            ],
            [
                5534,
                5561
            ],
            [
                5561,
                5586
            ],
            [
                5586,
                5631
            ],
            [
                5631,
                5678
            ],
            [
                5678,
                5720
            ],
            [
                5720,
                5760
            ],
            [
                5760,
                6018
            ],
            [
                6018,
                6189
            ],
            [
                6189,
                6323
            ],
            [
                6323,
                6408
            ],
            [
                6408,
                6443
            ],
            [
                6443,
                6474
            ],
            [
                6474,
                6551
            ],
            [
                6551,
                6575
            ],
            [
                6575,
                6769
            ],
            [
                6769,
                6898
            ],
            [
                6898,
                7086
            ],
            [
                7086,
                7165
            ],
            [
                7165,
                7847
            ],
            [
                7847,
                8019
            ],
            [
                8019,
                8133
            ],
            [
                8133,
                8162
            ],
            [
                8162,
                8190
            ],
            [
                8190,
                8212
            ],
            [
                8212,
                8241
            ],
            [
                8241,
                8271
            ],
            [
                8271,
                8280
            ],
            [
                8280,
                8302
            ],
            [
                8302,
                8360
            ],
            [
                8360,
                8368
            ],
            [
                8368,
                8390
            ],
            [
                8390,
                8447
            ],
            [
                8447,
                8456
            ],
            [
                8456,
                8715
            ],
            [
                8715,
                8737
            ],
            [
                8737,
                8746
            ],
            [
                8746,
                8775
            ],
            [
                8775,
                8808
            ],
            [
                8808,
                8817
            ],
            [
                8817,
                8909
            ],
            [
                8909,
                8972
            ],
            [
                8972,
                9032
            ],
            [
                9032,
                9116
            ],
            [
                9116,
                9233
            ],
            [
                9233,
                9269
            ],
            [
                9269,
                9369
            ],
            [
                9369,
                9407
            ],
            [
                9407,
                9468
            ],
            [
                9468,
                9519
            ],
            [
                9519,
                9633
            ],
            [
                9633,
                9845
            ],
            [
                9845,
                9954
            ],
            [
                9954,
                9959
            ],
            [
                9959,
                9964
            ],
            [
                9964,
                10016
            ],
            [
                10016,
                10059
            ],
            [
                10059,
                10306
            ],
            [
                10306,
                10449
            ],
            [
                10449,
                10527
            ],
            [
                10527,
                10570
            ],
            [
                10570,
                10665
            ],
            [
                10665,
                10693
            ],
            [
                10693,
                10705
            ],
            [
                10705,
                10757
            ],
            [
                10757,
                10798
            ],
            [
                10798,
                10848
            ],
            [
                10848,
                10910
            ],
            [
                10910,
                10979
            ],
            [
                10979,
                11028
            ],
            [
                11028,
                11080
            ],
            [
                11080,
                11106
            ],
            [
                11106,
                11184
            ],
            [
                11184,
                11225
            ],
            [
                11225,
                11262
            ],
            [
                11262,
                11362
            ],
            [
                11362,
                11477
            ],
            [
                11477,
                11608
            ],
            [
                11608,
                11713
            ],
            [
                11713,
                11856
            ],
            [
                11856,
                11955
            ],
            [
                11955,
                12044
            ],
            [
                12044,
                12069
            ],
            [
                12069,
                12082
            ],
            [
                12082,
                12360
            ],
            [
                12360,
                12511
            ],
            [
                12511,
                12811
            ],
            [
                12811,
                12909
            ],
            [
                12909,
                12979
            ],
            [
                12979,
                13070
            ],
            [
                13070,
                13302
            ],
            [
                13302,
                13451
            ],
            [
                13451,
                13489
            ],
            [
                13489,
                13739
            ],
            [
                13739,
                13802
            ],
            [
                13802,
                14185
            ],
            [
                14185,
                14486
            ],
            [
                14486,
                14716
            ],
            [
                14716,
                14879
            ],
            [
                14879,
                14949
            ],
            [
                14949,
                15039
            ],
            [
                15039,
                15144
            ],
            [
                15144,
                15544
            ],
            [
                15544,
                15981
            ],
            [
                15981,
                16018
            ],
            [
                16018,
                16665
            ],
            [
                16665,
                16844
            ],
            [
                16844,
                16900
            ],
            [
                16900,
                16975
            ],
            [
                16975,
                17020
            ],
            [
                17020,
                17049
            ],
            [
                17049,
                17246
            ],
            [
                17246,
                17451
            ],
            [
                17451,
                17562
            ],
            [
                17562,
                17766
            ],
            [
                17766,
                17772
            ],
            [
                17772,
                17860
            ],
            [
                17860,
                17932
            ],
            [
                17932,
                18042
            ]
        ],
        "overlap_chars": [
            [
                0,
                24
            ],
            [
                32,
                47
            ],
            [
                51,
                52
            ],
            [
                48,
                50
            ],
            [
                59,
                74
            ],
            [
                104,
                115
            ],
            [
                125,
                133
            ],
            [
                116,
                123
            ],
            [
                133,
                143
            ],
            [
                25,
                27
            ],
            [
                144,
                167
            ],
            [
                168,
                186
            ],
            [
                190,
                192
            ],
            [
                192,
                216
            ],
            [
                241,
                281
            ],
            [
                378,
                380
            ],
            [
                380,
                394
            ],
            [
                410,
                487
            ],
            [
                498,
                508
            ],
            [
                512,
                521
            ],
            [
                909,
                910
            ],
            [
                523,
                565
            ],
            [
                576,
                590
            ],
            [
                596,
                714
            ],
            [
                723,
                745
            ],
            [
                746,
                779
            ],
            [
                785,
                794
            ],
            [
                836,
                868
            ],
            [
                911,
                921
            ],
            [
                1034,
                1103
            ],
            [
                1105,
                1109
            ],
            [
                1127,
                1131
            ],
            [
                1167,
                1169
            ],
            [
                1182,
                1188
            ],
            [
                1008,
                1015
            ],
            [
                1190,
                1224
            ],
            [
                1246,
                1275
            ],
            [
                1275,
                1284
            ],
            [
                1286,
                1288
            ],
            [
                1298,
                1323
            ],
            [
                1324,
                1333
            ],
            [
                1333,
                1372
            ],
            [
                1381,
                1467
            ],
            [
                1481,
                1490
            ],
            [
                1472,
                1477
            ],
            [
                1618,
                1619
            ],
            [
                1501,
                1518
            ],
            [
                1637,
                1639
            ],
            [
                1529,
                1546
            ],
            [
                1557,
                1593
            ],
            [
                1749,
                1751
            ],
            [
                1751,
                1766
            ],
            [
                1815,
                1838
            ],
            [
                1858,
                1867
            ],
            [
                1868,
                1876
            ],
            [
                1896,
                1926
            ],
            [
                1936,
                1961
            ],
            [
                2045,
                2047
            ],
            [
                2166,
                2212
            ],
            [
                2413,
                2414
            ],
            [
                2254,
                2308
            ],
            [
                2384,
                2413
            ],
            [
                2481,
                2483
            ],
            [
                2483,
                2545
            ],
            [
                2552,
                2565
            ],
            [
                2608,
                2610
            ],
            [
                2610,
                2613
            ],
            [
                2622,
                2640
            ],
            [
                2640,
                2641
            ],
            [
                2712,
                2730
            ],
            [
                2814,
                2816
            ],
            [
                2816,
                2847
            ],
            [
                2854,
                2864
            ],
            [
                2882,
                2886
            ],
            [
                2907,
                2913
            ],
            [
                2915,
                2955
            ],
            [
                2902,
                2903
            ],
            [
                2957,
                2960
            ],
            [
                2967,
                3024
            ],
            [
                3024,
                3114
            ],
            [
                3136,
                3189
            ],
            [
                3196,
                3236
            ],
            [
                3236,
                3263
            ],
            [
                3284,
                3293
            ],
            [
                3304,
                3333
            ],
            [
                3294,
                3299
            ],
            [
                3373,
                3375
            ],
            [
                3375,
                3474
            ],
            [
                3485,
                3499
            ],
            [
                3519,
                3552
            ],
            [
                3573,
                3595
            ],
            [
                3611,
                3634
            ],
            [
                3643,
                3648
            ],
            [
                3662,
                3676
            ],
            [
                3698,
                3706
            ],
            [
                3722,
                3725
            ],
            [
                3731,
                3746
            ],
            [
                3769,
                3770
            ],
            [
                3553,
                3555
            ],
            [
                3816,
                3828
            ],
            [
                3833,
                3850
            ],
            [
                3864,
                3879
            ],
            [
                3903,
                3926
            ],
            [
                3927,
                3960
            ],
            [
                3960,
                3971
            ],
            [
                4015,
                4093
            ],
            [
                4103,
                4111
            ],
            [
                4148,
                4150
            ],
            [
                4150,
                4213
            ],
            [
                4219,
                4235
            ],
            [
                4235,
                4240
            ],
            [
                4291,
                4292
            ],
            [
                4283,
                4291
            ],
            [
                4293,
                4332
            ],
            [
                4338,
                4356
            ],
            [
                4604,
                4616
            ],
            [
                4584,
                4602
            ],
            [
                4627,
                4694
            ],
            [
                4860,
                4862
            ],
            [
                4905,
                4923
            ],
            [
                4862,
                4901
            ],
            [
                4924,
                4935
            ],
            [
                4937,
                5012
            ],
            [
                5016,
                5035
            ],
            [
                5035,
                5050
            ],
            [
                5052,
                5079
            ],
            [
                5050,
                5051
            ],
            [
                5143,
                5164
            ],
            [
                5114,
                5127
            ],
            [
                5185,
                5194
            ],
            [
                5291,
                5340
            ],
            [
                5355,
                5372
            ],
            [
                5350,
                5354
            ],
            [
                5373,
                5520
            ],
            [
                5532,
                5534
            ],
            [
                5534,
                5561
            ],
            [
                5566,
                5570
            ],
            [
                5584,
                5586
            ],
            [
                5586,
                5592
            ],
            [
                5598,
                5631
            ],
            [
                5631,
                5678
            ],
            [
                5678,
                5720
            ],
            [
                5720,
                5760
            ],
            [
                5760,
                5765
            ],
            [
                5771,
                5777
            ],
            [
                5793,
                5839
            ],
            [
                6016,
                6018
            ],
            [
                6018,
                6026
            ],
            [
                6034,
                6066
            ],
            [
                6076,
                6084
            ],
            [
                6124,
                6161
            ],
            [
                6111,
                6114
            ],
            [
                6162,
                6189
            ],
            [
                6189,
                6269
            ],
            [
                6284,
                6304
            ],
            [
                6310,
                6323
            ],
            [
                6323,
                6408
            ],
            [
                6408,
                6416
            ],
            [
                6417,
                6424
            ],
            [
                6441,
                6443
            ],
            [
                6443,
                6457
            ],
            [
                6505,
                6508
            ],
            [
                6474,
                6487
            ],
            [
                6493,
                6494
            ],
            [
                6515,
                6551
            ],
            [
                6575,
                6626
            ],
            [
                6627,
                6636
            ],
            [
                6641,
                6651
            ],
            [
                6657,
                6709
            ],
            [
                6727,
                6737
            ],
            [
                6757,
                6769
            ],
            [
                6769,
                6830
            ],
            [
                6866,
                6884
            ],
            [
                6896,
                6898
            ],
            [
                6971,
                6978
            ],
            [
                6910,
                6925
            ],
            [
                7084,
                7086
            ],
            [
                7657,
                7667
            ],
            [
                7187,
                7193
            ],
            [
                7201,
                7203
            ],
            [
                7225,
                7258
            ],
            [
                7264,
                7270
            ],
            [
                7283,
                7333
            ],
            [
                7337,
                7344
            ],
            [
                7348,
                7352
            ],
            [
                7360,
                7364
            ],
            [
                7457,
                7495
            ],
            [
                7499,
                7547
            ],
            [
                7667,
                7679
            ],
            [
                7684,
                7719
            ],
            [
                7845,
                7847
            ],
            [
                7847,
                7866
            ],
            [
                7871,
                7892
            ],
            [
                7904,
                8019
            ],
            [
                8019,
                8054
            ],
            [
                8056,
                8110
            ],
            [
                8118,
                8133
            ],
            [
                8133,
                8160
            ],
            [
                8190,
                8212
            ],
            [
                8212,
                8241
            ],
            [
                8241,
                8271
            ],
            [
                8271,
                8280
            ],
            [
                8280,
                8302
            ],
            [
                8302,
                8360
            ],
            [
                8360,
                8368
            ],
            [
                8368,
                8390
            ],
            [
                8390,
                8402
            ],
            [
                8403,
                8430
            ],
            [
                8431,
                8447
            ],
            [
                8447,
                8456
            ],
            [
                8456,
                8489
            ],
            [
                8525,
                8540
            ],
            [
                8552,
                8583
            ],
            [
                8595,
                8631
            ],
            [
                8637,
                8647
            ],
            [
                8661,
                8682
            ],
            [
                8693,
                8715
            ],
            [
                8715,
                8727
            ],
            [
                8734,
                8737
            ],
            [
                8737,
                8746
            ],
            [
                8746,
                8775
            ],
            [
                8775,
                8808
            ],
            [
                8808,
                8817
            ],
            [
                8817,
                8909
            ],
            [
                8909,
                8967
            ],
            [
                8974,
                9032
            ],
            [
                9032,
                9116
            ],
            [
                9116,
                9195
            ],
            [
                9197,
                9233
            ],
            [
                9233,
                9269
            ],
            [
                9269,
                9334
            ],
            [
                9347,
                9353
            ],
            [
                9367,
                9369
            ],
            [
                9526,
                9568
            ],
            [
                9593,
                9614
            ],
            [
                9624,
                9633
            ],
            [
                9643,
                9713
            ],
            [
                9727,
                9779
            ],
            [
                9787,
                9801
            ],
            [
                9835,
                9836
            ],
            [
                9845,
                9875
            ],
            [
                9919,
                9926
            ],
            [
                9885,
                9891
            ],
            [
                9931,
                9954
            ],
            [
                9954,
                9959
            ],
            [
                9959,
                9964
            ],
            [
                9964,
                10016
            ],
            [
                10016,
                10059
            ],
            [
                10059,
                10147
            ],
            [
                10156,
                10212
            ],
            [
                10229,
                10277
            ],
            [
                10304,
                10306
            ],
            [
                10306,
                10315
            ],
            [
                10316,
                10352
            ],
            [
                10373,
                10385
            ],
            [
                10402,
                10436
            ],
            [
                10446,
                10449
            ],
            [
                10449,
                10496
            ],
            [
                10525,
                10527
            ],
            [
                10527,
                10528
            ],
            [
                10549,
                10570
            ],
            [
                10570,
                10571
            ],
            [
                10608,
                10665
            ],
            [
                10665,
                10674
            ],
            [
                10678,
                10686
            ],
            [
                10693,
                10705
            ],
            [
                10705,
                10757
            ],
            [
                10798,
                10841
            ],
            [
                10846,
                10848
            ],
            [
                10848,
                10876
            ],
            [
                10876,
                10910
            ],
            [
                10979,
                10999
            ],
            [
                11005,
                11028
            ],
            [
                11028,
                11048
            ],
            [
                11058,
                11080
            ],
            [
                11080,
                11106
            ],
            [
                11106,
                11156
            ],
            [
                11182,
                11184
            ],
            [
                11184,
                11208
            ],
            [
                11222,
                11225
            ],
            [
                11225,
                11262
            ],
            [
                11262,
                11271
            ],
            [
                11283,
                11309
            ],
            [
                11309,
                11362
            ],
            [
                11362,
                11370
            ],
            [
                11378,
                11477
            ],
            [
                11479,
                11490
            ],
            [
                11504,
                11511
            ],
            [
                11521,
                11523
            ],
            [
                11528,
                11537
            ],
            [
                11554,
                11582
            ],
            [
                11606,
                11608
            ],
            [
                11716,
                11763
            ],
            [
                11777,
                11855
            ],
            [
                11931,
                11933
            ],
            [
                11884,
                11929
            ],
            [
                11953,
                11955
            ],
            [
                11955,
                11980
            ],
            [
                11989,
                12044
            ],
            [
                12044,
                12069
            ],
            [
                12069,
                12082
            ],
            [
                12082,
                12099
            ],
            [
                12122,
                12145
            ],
            [
                12166,
                12215
            ],
            [
                12220,
                12225
            ],
            [
                12233,
                12319
            ],
            [
                12358,
                12360
            ],
            [
                12385,
                12431
            ],
            [
                12442,
                12446
            ],
            [
                12433,
                12441
            ],
            [
                12447,
                12511
            ],
            [
                12511,
                12518
            ],
            [
                12594,
                12624
            ],
            [
                12586,
                12589
            ],
            [
                12651,
                12675
            ],
            [
                12695,
                12701
            ],
            [
                12676,
                12683
            ],
            [
                12761,
                12810
            ],
            [
                12811,
                12845
            ],
            [
                12851,
                12908
            ],
            [
                12909,
                12933
            ],
            [
                12936,
                12940
            ],
            [
                12934,
                12935
            ],
            [
                12941,
                12946
            ],
            [
                12950,
                12979
            ],
            [
                12979,
                13032
            ],
            [
                13048,
                13070
            ],
            [
                13070,
                13105
            ],
            [
                13194,
                13195
            ],
            [
                13139,
                13142
            ],
            [
                13214,
                13220
            ],
            [
                13174,
                13175
            ],
            [
                13253,
                13258
            ],
            [
                13300,
                13302
            ],
            [
                13302,
                13319
            ],
            [
                13341,
                13351
            ],
            [
                13371,
                13450
            ],
            [
                13451,
                13489
            ],
            [
                13489,
                13509
            ],
            [
                13513,
                13533
            ],
            [
                13623,
                13631
            ],
            [
                13639,
                13668
            ],
            [
                13668,
                13739
            ],
            [
                13739,
                13802
            ],
            [
                13802,
                13818
            ],
            [
                13914,
                13920
            ],
            [
                13929,
                13940
            ],
            [
                13950,
                13985
            ],
            [
                14183,
                14185
            ],
            [
                14217,
                14220
            ],
            [
                14449,
                14453
            ],
            [
                14242,
                14243
            ],
            [
                14200,
                14202
            ],
            [
                14247,
                14249
            ],
            [
                14231,
                14234
            ],
            [
                14297,
                14303
            ],
            [
                14484,
                14485
            ],
            [
                14522,
                14532
            ],
            [
                14582,
                14585
            ],
            [
                14666,
                14669
            ],
            [
                14532,
                14533
            ],
            [
                14580,
                14581
            ],
            [
                14510,
                14512
            ],
            [
                14675,
                14678
            ],
            [
                14714,
                14716
            ],
            [
                14768,
                14818
            ],
            [
                14832,
                14857
            ],
            [
                14862,
                14865
            ],
            [
                14877,
                14879
            ],
            [
                14879,
                14949
            ],
            [
                14949,
                14984
            ],
            [
                14999,
                15002
            ],
            [
                15019,
                15022
            ],
            [
                15651,
                15661
            ],
            [
                16081,
                16087
            ],
            [
                15671,
                15673
            ],
            [
                15956,
                15957
            ],
            [
                15552,
                15576
            ],
            [
                15618,
                15619
            ],
            [
                16414,
                16418
            ],
            [
                16299,
                16301
            ],
            [
                15810,
                15830
            ],
            [
                15966,
                15967
            ],
            [
                15835,
                15844
            ],
            [
                15846,
                15858
            ],
            [
                15882,
                15933
            ],
            [
                15691,
                15696
            ],
            [
                16029,
                16043
            ],
            [
                16048,
                16061
            ],
            [
                16663,
                16664
            ],
            [
                16216,
                16253
            ],
            [
                15603,
                15604
            ],
            [
                16259,
                16298
            ],
            [
                16304,
                16317
            ],
            [
                16337,
                16347
            ],
            [
                15766,
                15769
            ],
            [
                16493,
                16507
            ],
            [
                16511,
                16522
            ],
            [
                16013,
                16017
            ],
            [
                16527,
                16589
            ],
            [
                15791,
                15792
            ],
            [
                16642,
                16658
            ],
            [
                16665,
                16668
            ],
            [
                16789,
                16795
            ],
            [
                16800,
                16808
            ],
            [
                16780,
                16787
            ],
            [
                16829,
                16844
            ],
            [
                16844,
                16865
            ],
            [
                16898,
                16900
            ],
            [
                16941,
                16975
            ],
            [
                17049,
                17065
            ],
            [
                17071,
                17074
            ],
            [
                17079,
                17083
            ],
            [
                17104,
                17215
            ],
            [
                17244,
                17246
            ],
            [
                17246,
                17248
            ],
            [
                17345,
                17352
            ],
            [
                17361,
                17390
            ],
            [
                17403,
                17413
            ],
            [
                17460,
                17499
            ],
            [
                17501,
                17546
            ],
            [
                17560,
                17562
            ],
            [
                17766,
                17772
            ],
            [
                17772,
                17859
            ],
            [
                17878,
                17884
            ],
            [
                17913,
                17932
            ],
            [
                17932,
                17969
            ],
            [
                17996,
                18028
            ],
            [
                18036,
                18042
            ]
        ],
        "row_chars": [
            [
                0,
                192
            ],
            [
                192,
                380
            ],
            [
                380,
                911
            ],
            [
                911,
                1275
            ],
            [
                1275,
                1333
            ],
            [
                1333,
                1751
            ],
            [
                1751,
                2047
            ],
            [
                2047,
                2166
            ],
            [
                2166,
                2483
            ],
            [
                2483,
                2610
            ],
            [
                2610,
                2816
            ],
            [
                2816,
                3024
            ],
            [
                3024,
                3236
            ],
            [
                3236,
                3375
            ],
            [
                3375,
                3499
            ],
            [
                3499,
                3519
            ],
            [
                3519,
                3927
            ],
            [
                3927,
                3960
            ],
            [
                3960,
                4011
            ],
            [
                4011,
                4150
            ],
            [
                4150,
                4235
            ],
            [
                4235,
                4544
            ],
            [
                4544,
                4862
            ],
            [
                4862,
                5035
            ],
            [
                5035,
                5194
            ],
            [
                5194,
                5534
            ],
            [
                5534,
                5561
            ],
            [
                5561,
                5586
            ],
            [
                5586,
                5631
            ],
            [
                5631,
                5678
            ],
            [
                5678,
                5720
            ],
            [
                5720,
                5760
            ],
            [
                5760,
                6018
            ],
            [
                6018,
                6189
            ],
            [
                6189,
                6323
            ],
            [
                6323,
                6408
            ],
            [
                6408,
                6443
            ],
            [
                6443,
                6551
            ],
            [
                6551,
                6575
            ],
            [
                6575,
                6769
            ],
            [
                6769,
                6898
            ],
            [
                6898,
                7086
            ],
            [
                7086,
                7165
            ],
            [
                7165,
                7847
            ],
            [
                7847,
                8019
            ],
            [
                8019,
                8133
            ],
            [
                8133,
                8162
            ],
            [
                8162,
                8190
            ],
            [
                8190,
                8212
            ],
            [
                8212,
                8241
            ],
            [
                8241,
                8271
            ],
            [
                8271,
                8280
            ],
            [
                8280,
                8302
            ],
            [
                8302,
                8360
            ],
            [
                8360,
                8368
            ],
            [
                8368,
                8390
            ],
            [
                8390,
                8447
            ],
            [
                8447,
                8456
            ],
            [
                8456,
                8715
            ],
            [
                8715,
                8737
            ],
            [
                8737,
                8746
            ],
            [
                8746,
                8775
            ],
            [
                8775,
                8808
            ],
            [
                8808,
                8817
            ],
            [
                8817,
                8909
            ],
            [
                8909,
                9032
            ],
            [
                9032,
                9116
            ],
            [
                9116,
                9233
            ],
            [
                9233,
                9269
            ],
            [
                9269,
                9369
            ],
            [
                9369,
                9407
            ],
            [
                9407,
                9468
            ],
            [
                9468,
                9519
            ],
            [
                9519,
                9633
            ],
            [
                9633,
                9845
            ],
            [
                9845,
                9954
            ],
            [
                9954,
                9959
            ],
            [
                9959,
                9964
            ],
            [
                9964,
                10016
            ],
            [
                10016,
                10059
            ],
            [
                10059,
                10306
            ],
            [
                10306,
                10449
            ],
            [
                10449,
                10527
            ],
            [
                10527,
                10570
            ],
            [
                10570,
                10665
            ],
            [
                10665,
                10705
            ],
            [
                10705,
                10757
            ],
            [
                10757,
                10798
            ],
            [
                10798,
                10848
            ],
            [
                10848,
                10910
            ],
            [
                10910,
                10979
            ],
            [
                10979,
                11028
            ],
            [
                11028,
                11080
            ],
            [
                11080,
                11106
            ],
            [
                11106,
                11184
            ],
            [
                11184,
                11225
            ],
            [
                11225,
                11262
            ],
            [
                11262,
                11362
            ],
            [
                11362,
                11477
            ],
            [
                11477,
                11608
            ],
            [
                11608,
                11713
            ],
            [
                11713,
                11856
            ],
            [
                11856,
                11955
            ],
            [
                11955,
                12044
            ],
            [
                12044,
                12069
            ],
            [
                12069,
                12082
            ],
            [
                12082,
                12360
            ],
            [
                12360,
                12511
            ],
            [
                12511,
                12811
            ],
            [
                12811,
                12909
            ],
            [
                12909,
                12979
            ],
            [
                12979,
                13070
            ],
            [
                13070,
                13302
            ],
            [
                13302,
                13451
            ],
            [
                13451,
                13489
            ],
            [
                13489,
                13739
            ],
            [
                13739,
                13802
            ],
            [
                13802,
                14185
            ],
            [
                14185,
                14486
            ],
            [
                14486,
                14716
            ],
            [
                14716,
                14879
            ],
            [
                14879,
                14949
            ],
            [
                14949,
                15039
            ],
            [
                15039,
                15144
            ],
            [
                15144,
                15544
            ],
            [
                15544,
                16665
            ],
            [
                16665,
                16844
            ],
            [
                16844,
                16900
            ],
            [
                16900,
                16975
            ],
            [
                16975,
                17020
            ],
            [
                17020,
                17049
            ],
            [
                17049,
                17246
            ],
            [
                17246,
                17562
            ],
            [
                17562,
                17766
            ],
            [
                17766,
                17772
            ],
            [
                17772,
                17860
            ],
            [
                17860,
                17932
            ],
            [
                17932,
                18042
            ]
        ]
    },
    "abridged": {
        "text": "Among the most respected names beginning with C in the Court-Guide was that of Sir Pitt Crawley, Baronet, of Great Gaunt Street, and of Queen's Crawley, Hampshire. This honourable name had been in the Parliamentary list for many years.\nIt is related, regarding the borough of Queen's Crawley, that Queen Elizabeth in one of her progresses stopped at Crawley for breakfast. She was so delighted with some remarkably fine beer which was presented to her by the Crawley of the day (a handsome gentleman with a trim beard and a good leg), that she forthwith made Crawley into a borough eligible to send two members to Parliament. The place took the name of Queen's Crawley.\nAnd though it was no longer so populous a place as it had been in Queen Bess's time - nay, had so few voters that it might even be called a rotten borough - yet, as Sir Pitt Crawley would say in his elegant way, \"Rotten! be hanged - it gives me a good fifteen hundred pounds a year.\"\nSir Pitt Crawley (named after the great politician) was the son of Walpole Crawley, first Baronet, of the Tape and Sealing-Wax Office in George II's reign, who was impeached for embezzlement, as were a great many other honest gentlemen of those days. The family tree mentions Charles Stuart \"Barebones\" Crawley, of James the First's time; and Queen Elizabeth's Crawley. Close by the name of Sir Pitt Crawley, Baronet, is written that of his brother, the Reverend Bute Crawley, rector of Crawley-cum-Snailby.\nSir Pitt was first married to Grizzel, sixth daughter of Mungo, Lord Binkie. She bore him two sons: Pitt junior, and Rawdon Crawley. Many years after her ladyship's death, Sir Pitt married Rosa Dawson of Mudbury, by whom he had two daughters. For their benefit Miss Rebecca Sharp was now engaged as governess. It will be seen that the young lady was come into a family of very genteel connexions, and a much more distinguished circle than that humble one she had just quitted in Russell Square.\nShe had received her orders in a note written upon an old envelope, which said:\nSir Pitt Crawley begs Miss Sharp and baggidge may be hear on Tuesday, as I leaf for Queen's Crawley tomorrow morning ERLY.\nRebecca had never seen a Baronet, and as soon as she had said goodbye to Amelia, and counted the money which Mr. Sedley had given her, and had finished wiping her eyes (just as the carriage turned the corner), she began to imagine what a Baronet must be.\n\"I wonder, does he wear a star?\" thought she. \"He will be very handsomely dressed in a court suit, with ruffles, and his hair powdered. I suppose he will be awfully proud, and that I shall be treated contemptuously. Still, at least I shall be amongst gentlefolks, and not vulgar city people.\"\nThe carriage entered Great Gaunt Street and stopped at a tall gloomy house between two other tall gloomy houses. This was Sir Pitt's mansion. The shutters of the first-floor windows were closed; those of the dining-room were partially open, and the blinds neatly covered in old newspapers.\nJohn, the groom who had driven the carriage, asked a passing milk-boy to ring the bell for him. The door was opened by a man in drab breeches and a dirty old coat, with a foul old neckcloth lashed round his bristly neck, a shining bald head, a leering red face, a pair of twinkling grey eyes, and a mouth perpetually grinning.\n\"This Sir Pitt Crawley's?\" said John.\n\"Ees,\" said the man at the door, with a nod.\n\"Hand down these 'ere trunks then,\" said John.\n\"Hand 'n down yourself,\" said the porter.\n\"Don't you see I can't leave my hosses? Come, lend a hand, and Miss will give you some beer,\" said John.\nThe bald man, taking his hands out of his pockets, threw Miss Sharp's trunk over his shoulder, and carried it into the house.\n\"Take this basket and shawl, if you please, and open the door,\" said Miss Sharp, descending from the carriage in indignation. \"I shall write to Mr. Sedley and inform him of your conduct,\" said she to the groom.\n\"Don't,\" he replied. \"I hope you've got Miss 'Melia's gowns, as the lady's maid was to have 'ad? Shut the door, Jim, you'll get no good out of 'ER,\" he continued, pointing his thumb towards Miss Sharp: \"a bad lot, I tell you.\"\nSo saying, he drove away. The truth is, he was attached to the lady's maid in question, who had been robbed of her dresses.\nRebecca entered the dining-room. The carpet was rolled up under the sideboard: the pictures were hidden behind old sheets of brown paper: the ceiling lamp was muffled in a sack. The marble bust of Sir Walpole Crawley was looking from its black corner at the bare boards: the chairs were turned up heads and tails along the wall.\nTwo kitchen chairs, a round table, and an old poker and tongs were, however, gathered round the fire-place, as was a saucepan over a feeble sputtering fire. There was a bit of cheese and bread and a tin candlestick on the table, and a little black beer in a pint-pot.\n\"Had your dinner, I suppose?\" said the bald man. \"Like a drop of beer?\"\n\"Where is Sir Pitt Crawley?\" said Miss Sharp majestically.\n\"He, he! I'm Sir Pitt Crawley. Reklect you owe me a pint for bringing down your luggage. He, he! Ask Tinker if I aynt. Mrs. Tinker, meet Miss Sharp; Miss Governess, meet Mrs. Charwoman. Ho, ho!\"\nThe lady addressed as Mrs. Tinker now appeared with a pipe and tobacco, for which she had been sent a minute before Miss Sharp's arrival. She handed these over to Sir Pitt, who took his seat by the fire.\n\"Where's the farthing?\" said he. \"I gave you three halfpence. Where's the change, old Tinker?\"\n\"There!\" replied Mrs. Tinker, flinging down the coin; \"it's only baronets as cares about farthings.\"\n\"A farthing a day is seven shillings a year,\" answered the Member of Parliament; \"seven shillings a year is the interest of seven guineas. Take care of your farthings, old Tinker, and your guineas will come quite nat'ral.\"\n\"You may be sure it's Sir Pitt Crawley, young woman,\" said Mrs. Tinker, surlily, \"because he looks to his farthings. You'll know him better afore long.\"\n\"And like me none the worse, Miss Sharp,\" said the old gentleman, almost politely. \"Get another chair from the kitchen, Tinker; and then we'll have supper.\"\nThe baronet plunged a fork into the saucepan on the fire, and withdrew a piece of tripe and an onion, which he divided into equal portions.\n\"You see, Miss Sharp, when I'm in town Tinker dines with the family. Haw! haw! I'm glad Miss Sharp's not hungry, ain't you, Tink?\" And they fell to upon their frugal supper.\nAfter supper Sir Pitt Crawley began to smoke his pipe; and when it became quite dark, he lit the rushlight in the tin candlestick, and producing from his pocket a huge mass of papers, began reading them.\n\"I'm here in London on law business, my dear, and that's why I shall have such a pretty travelling companion tomorrow.\"\n\"He's always at law business,\" said Mrs. Tinker.\n\"Tinker is quite right,\" said the Baronet. \"I've lost and won more lawsuits than any man in England. Look here: Crawley, Baronet v. Snaffle. I'll throw him over, or my name's not Pitt Crawley. Overseers of Snaily parish against Crawley, Baronet. They can't prove it's common land: I'll defy 'em; the land's mine. I'll beat 'em, if it costs me a thousand guineas. Look over the papers if you like, my dear. Do you write a good hand? I'll make you useful when we're at Queen's Crawley. Now the dowager's dead I need someone.\"\n\"She was as bad as he,\" said Tinker. \"She took every one of her tradesmen to court; and turned away forty-eight footmen in four year.\"\n\"She was very close,\" said the Baronet, simply; \"but she was a valyble woman to me, and saved me a steward.\"\nAnd in this strain, to Rebecca's amusement, the conversation continued. Sir Pitt talked of himself incessantly, sometimes in the vulgarest Hampshire accent; sometimes adopting the tone of a man of the world.\nAt last he told Miss Sharp to be ready at five in the morning. \"You'll sleep with Tinker tonight,\" he said; \"it's a big bed, and there's room for two. Lady Crawley died in it. Good night.\"\nSir Pitt went off, and the solemn Tinker led the way up the great bleak stone stairs, past great drawing-room doors, with the handles muffled up in paper, into the great front bedroom. It was so funereal and gloomy, you might have fancied that not only had Lady Crawley died in the room, but that her ghost inhabited it. Rebecca peeped into the huge wardrobes and cupboards, and tried the locked drawers, while the old charwoman was saying her prayers.\n\"I shouldn't like to sleep in this bed without a good conscience, Miss,\" said the old woman.\n\"There's room for us and half a dozen ghosts in it,\" says Rebecca. \"Tell me all about Lady Crawley and Sir Pitt Crawley, my dear Mrs. Tinker.\"\nBut old Tinker was not to be pumped, and soon set up a loud snore. Rebecca lay awake, thinking of the new world into which she was going, and of her chances of success there.\nThe rushlight flickered in the basin. The mantelpiece cast a great black shadow over two family pictures of young lads that hung there, one in a college gown, and the other in a red jacket like a soldier. When she went to sleep, Rebecca chose that one to dream about.\nAt four o'clock, Tinker wakened her, and bid her prepare for departure. Unbolting the great hall door with a clang, she summoned a coach to take them to the public carriage in the City. The driver was not happy when, on arriving there, Sir Pitt refused to tip him. He flung down Miss Sharp's bandboxes in the gutter, and swore he would take him to law.\n\"You'd better not,\" said one of the ostlers; \"it's Sir Pitt Crawley.\"\n\"So it is, Joe,\" cried the Baronet, and he climbed up onto the box of the public carriage.\nMiss Sharp sat inside next to a young man from Cambridge; along with an asthmatic gentleman, a prim lady who declared she had never travelled in a public carriage before, and a fat widow with a brandy-bottle. How the carriage at length drove away - threading the dark lanes of Aldersgate, clattering by St. Paul's and the White Bear at Piccadilly, until they saw the dew rising up from the market-gardens of Knightsbridge - need not be told.\nBut I cannot think of this journey without tender regret. Where is the road now? and those old honest pimple-nosed coachmen? and the waiters, and their inns, and the cold rounds of beef inside, and the stunted ostler, with his blue nose and clinking pail, where is he? To future generations, these things will be as much legend as Nineveh - stage-coaches will have become romances - a team of four bays as fabulous as Bucephalus. Alas! we shall never hear the horn sing at midnight, or see the pike-gates fly open any more.\nWhere is the coach carrying us? Let us be set down at Queen's Crawley, and see how Miss Rebecca Sharp fares there.",
        "paragraph_chars": [
            [
                0,
                236
            ],
            [
                236,
                670
            ],
            [
                670,
                954
            ],
            [
                954,
                1462
            ],
            [
                1462,
                1957
            ],
            [
                1957,
                2037
            ],
            [
                2037,
                2160
            ],
            [
                2160,
                2415
            ],
            [
                2415,
                2708
            ],
            [
                2708,
                2998
            ],
            [
                2998,
                3325
            ],
            [
                3325,
                3363
            ],
            [
                3363,
                3408
            ],
            [
                3408,
                3455
            ],
            [
                3455,
                3497
            ],
            [
                3497,
                3602
            ],
            [
                3602,
                3728
            ],
            [
                3728,
                3939
            ],
            [
                3939,
                4166
            ],
            [
                4166,
                4290
            ],
            [
                4290,
                4619
            ],
            [
                4619,
                4887
            ],
            [
                4887,
                4959
            ],
            [
                4959,
                5018
            ],
            [
                5018,
                5213
            ],
            [
                5213,
                5417
            ],
            [
                5417,
                5512
            ],
            [
                5512,
                5613
            ],
            [
                5613,
                5836
            ],
            [
                5836,
                5989
            ],
            [
                5989,
                6146
            ],
            [
                6146,
                6286
            ],
            [
                6286,
                6460
            ],
            [
                6460,
                6664
            ],
            [
                6664,
                6784
            ],
            [
                6784,
                6833
            ],
            [
                6833,
                7357
            ],
            [
                7357,
                7492
            ],
            [
                7492,
                7601
            ],
            [
                7601,
                7809
            ],
            [
                7809,
                7998
            ],
            [
                7998,
                8451
            ],
            [
                8451,
                8544
            ],
            [
                8544,
                8687
            ],
            [
                8687,
                8862
            ],
            [
                8862,
                9130
            ],
            [
                9130,
                9483
            ],
            [
                9483,
                9553
            ],
            [
                9553,
                9644
            ],
            [
                9644,
                10086
            ],
            [
                10086,
                10610
            ],
            [
                10610,
                10724
            ]
        ],
        "segment_chars": [
            [
                0,
                164
            ],
            [
                164,
                236
            ],
            [
                236,
                373
            ],
            [
                373,
                626
            ],
            [
                626,
                670
            ],
            [
                670,
                891
            ],
            [
                891,
                954
            ],
            [
                954,
                1205
            ],
            [
                1205,
                1324
            ],
            [
                1324,
                1462
            ],
            [
                1462,
                1539
            ],
            [
                1539,
                1595
            ],
            [
                1595,
                1705
            ],
            [
                1705,
                1772
            ],
            [
                1772,
                1957
            ],
            [
                1957,
                2037
            ],
            [
                2037,
                2160
            ],
            [
                2160,
                2415
            ],
            [
                2415,
                2448
            ],
            [
                2448,
                2461
            ],
            [
                2461,
                2551
            ],
            [
                2551,
                2631
            ],
            [
                2631,
                2708
            ],
            [
                2708,
                2821
            ],
            [
                2821,
                2850
            ],
            [
                2850,
                2998
            ],
            [
                2998,
                3094
            ],
            [
                3094,
                3325
            ],
            [
                3325,
                3352
            ],
            [
                3352,
                3363
            ],
            [
                3363,
                3408
            ],
            [
                3408,
                3455
            ],
            [
                3455,
                3497
            ],
            [
                3497,
                3537
            ],
            [
                3537,
                3602
            ],
            [
                3602,
                3728
            ],
            [
                3728,
                3854
            ],
            [
                3854,
                3939
            ],
            [
                3939,
                3960
            ],
            [
                3960,
                4036
            ],
            [
                4036,
                4166
            ],
            [
                4166,
                4192
            ],
            [
                4192,
                4290
            ],
            [
                4290,
                4323
            ],
            [
                4323,
                4468
            ],
            [
                4468,
                4619
            ],
            [
                4619,
                4776
            ],
            [
                4776,
                4887
            ],
            [
                4887,
                4917
            ],
            [
                4917,
                4936
            ],
            [
                4936,
                4959
            ],
            [
                4959,
                4988
            ],
            [
                4988,
                5018
            ],
            [
                5018,
                5027
            ],
            [
                5027,
                5049
            ],
            [
                5049,
                5107
            ],
            [
                5107,
                5115
            ],
            [
                5115,
                5137
            ],
            [
                5137,
                5204
            ],
            [
                5204,
                5213
            ],
            [
                5213,
                5351
            ],
            [
                5351,
                5417
            ],
            [
                5417,
                5441
            ],
            [
                5441,
                5450
            ],
            [
                5450,
                5479
            ],
            [
                5479,
                5512
            ],
            [
                5512,
                5521
            ],
            [
                5521,
                5613
            ],
            [
                5613,
                5752
            ],
            [
                5752,
                5836
            ],
            [
                5836,
                5953
            ],
            [
                5953,
                5989
            ],
            [
                5989,
                6072
            ],
            [
                6072,
                6146
            ],
            [
                6146,
                6286
            ],
            [
                6286,
                6355
            ],
            [
                6355,
                6360
            ],
            [
                6360,
                6365
            ],
            [
                6365,
                6417
            ],
            [
                6417,
                6460
            ],
            [
                6460,
                6664
            ],
            [
                6664,
                6784
            ],
            [
                6784,
                6833
            ],
            [
                6833,
                6876
            ],
            [
                6876,
                6934
            ],
            [
                6934,
                6974
            ],
            [
                6974,
                7026
            ],
            [
                7026,
                7079
            ],
            [
                7079,
                7146
            ],
            [
                7146,
                7196
            ],
            [
                7196,
                7239
            ],
            [
                7239,
                7265
            ],
            [
                7265,
                7317
            ],
            [
                7317,
                7357
            ],
            [
                7357,
                7394
            ],
            [
                7394,
                7492
            ],
            [
                7492,
                7601
            ],
            [
                7601,
                7673
            ],
            [
                7673,
                7809
            ],
            [
                7809,
                7872
            ],
            [
                7872,
                7960
            ],
            [
                7960,
                7985
            ],
            [
                7985,
                7998
            ],
            [
                7998,
                8183
            ],
            [
                8183,
                8319
            ],
            [
                8319,
                8451
            ],
            [
                8451,
                8544
            ],
            [
                8544,
                8611
            ],
            [
                8611,
                8687
            ],
            [
                8687,
                8754
            ],
            [
                8754,
                8862
            ],
            [
                8862,
                8900
            ],
            [
                8900,
                9067
            ],
            [
                9067,
                9130
            ],
            [
                9130,
                9202
            ],
            [
                9202,
                9316
            ],
            [
                9316,
                9395
            ],
            [
                9395,
                9483
            ],
            [
                9483,
                9553
            ],
            [
                9553,
                9644
            ],
            [
                9644,
                9853
            ],
            [
                9853,
                10086
            ],
            [
                10086,
                10144
            ],
            [
                10144,
                10167
            ],
            [
                10167,
                10211
            ],
            [
                10211,
                10355
            ],
            [
                10355,
                10516
            ],
            [
                10516,
                10522
            ],
            [
                10522,
                10610
            ],
            [
                10610,
                10642
            ],
            [
                10642,
                10724
            ]
        ],
        "overlap_chars": [
            [
                0,
                24
            ],
            [
                25,
                40
            ],
            [
                46,
                47
            ],
            [
                48,
                50
            ],
            [
                51,
                66
            ],
            [
                67,
                78
            ],
            [
                79,
                87
            ],
            [
                88,
                95
            ],
            [
                95,
                105
            ],
            [
                106,
                108
            ],
            [
                109,
                132
            ],
            [
                136,
                154
            ],
            [
                162,
                164
            ],
            [
                164,
                188
            ],
            [
                194,
                234
            ],
            [
                234,
                236
            ],
            [
                236,
                250
            ],
            [
                261,
                338
            ],
            [
                347,
                357
            ],
            [
                362,
                371
            ],
            [
                371,
                372
            ],
            [
                377,
                419
            ],
            [
                420,
                434
            ],
            [
                435,
                553
            ],
            [
                559,
                581
            ],
            [
                591,
                624
            ],
            [
                626,
                635
            ],
            [
                636,
                668
            ],
            [
                670,
                680
            ],
            [
                684,
                753
            ],
            [
                756,
                760
            ],
            [
                779,
                783
            ],
            [
                798,
                800
            ],
            [
                810,
                816
            ],
            [
                817,
                824
            ],
            [
                827,
                861
            ],
            [
                862,
                891
            ],
            [
                891,
                900
            ],
            [
                903,
                905
            ],
            [
                912,
                937
            ],
            [
                945,
                954
            ],
            [
                954,
                993
            ],
            [
                1004,
                1090
            ],
            [
                1091,
                1100
            ],
            [
                1103,
                1108
            ],
            [
                1108,
                1109
            ],
            [
                1114,
                1131
            ],
            [
                1134,
                1136
            ],
            [
                1144,
                1161
            ],
            [
                1167,
                1203
            ],
            [
                1203,
                1205
            ],
            [
                1205,
                1220
            ],
            [
                1221,
                1244
            ],
            [
                1246,
                1255
            ],
            [
                1257,
                1265
            ],
            [
                1266,
                1296
            ],
            [
                1297,
                1322
            ],
            [
                1322,
                1324
            ],
            [
                1324,
                1370
            ],
            [
                1370,
                1371
            ],
            [
                1375,
                1429
            ],
            [
                1431,
                1460
            ],
            [
                1460,
                1462
            ],
            [
                1462,
                1524
            ],
            [
                1524,
                1537
            ],
            [
                1537,
                1539
            ],
            [
                1539,
                1542
            ],
            [
                1548,
                1566
            ],
            [
                1573,
                1574
            ],
            [
                1575,
                1593
            ],
            [
                1593,
                1595
            ],
            [
                1595,
                1626
            ],
            [
                1632,
                1642
            ],
            [
                1651,
                1655
            ],
            [
                1656,
                1662
            ],
            [
                1663,
                1703
            ],
            [
                1703,
                1704
            ],
            [
                1705,
                1708
            ],
            [
                1715,
                1772
            ],
            [
                1772,
                1862
            ],
            [
                1863,
                1916
            ],
            [
                1917,
                1957
            ],
            [
                1957,
                1984
            ],
            [
                1985,
                1994
            ],
            [
                1995,
                2024
            ],
            [
                2025,
                2030
            ],
            [
                2035,
                2037
            ],
            [
                2037,
                2136
            ],
            [
                2146,
                2160
            ],
            [
                2160,
                2193
            ],
            [
                2194,
                2216
            ],
            [
                2233,
                2256
            ],
            [
                2263,
                2268
            ],
            [
                2269,
                2283
            ],
            [
                2290,
                2298
            ],
            [
                2299,
                2302
            ],
            [
                2312,
                2327
            ],
            [
                2328,
                2329
            ],
            [
                2334,
                2336
            ],
            [
                2337,
                2349
            ],
            [
                2350,
                2367
            ],
            [
                2367,
                2382
            ],
            [
                2391,
                2414
            ],
            [
                2415,
                2448
            ],
            [
                2448,
                2459
            ],
            [
                2462,
                2540
            ],
            [
                2541,
                2549
            ],
            [
                2549,
                2551
            ],
            [
                2551,
                2614
            ],
            [
                2615,
                2631
            ],
            [
                2631,
                2636
            ],
            [
                2636,
                2637
            ],
            [
                2638,
                2646
            ],
            [
                2647,
                2686
            ],
            [
                2687,
                2705
            ],
            [
                2708,
                2720
            ],
            [
                2729,
                2747
            ],
            [
                2752,
                2819
            ],
            [
                2819,
                2821
            ],
            [
                2830,
                2848
            ],
            [
                2850,
                2889
            ],
            [
                2890,
                2901
            ],
            [
                2903,
                2978
            ],
            [
                2979,
                2998
            ],
            [
                2998,
                3013
            ],
            [
                3014,
                3041
            ],
            [
                3041,
                3042
            ],
            [
                3049,
                3070
            ],
            [
                3071,
                3084
            ],
            [
                3085,
                3094
            ],
            [
                3094,
                3143
            ],
            [
                3144,
                3161
            ],
            [
                3162,
                3166
            ],
            [
                3167,
                3314
            ],
            [
                3323,
                3325
            ],
            [
                3325,
                3352
            ],
            [
                3357,
                3361
            ],
            [
                3361,
                3363
            ],
            [
                3363,
                3369
            ],
            [
                3375,
                3408
            ],
            [
                3408,
                3455
            ],
            [
                3455,
                3497
            ],
            [
                3497,
                3537
            ],
            [
                3537,
                3542
            ],
            [
                3548,
                3554
            ],
            [
                3554,
                3600
            ],
            [
                3600,
                3602
            ],
            [
                3602,
                3610
            ],
            [
                3611,
                3643
            ],
            [
                3644,
                3652
            ],
            [
                3659,
                3696
            ],
            [
                3697,
                3700
            ],
            [
                3701,
                3728
            ],
            [
                3728,
                3808
            ],
            [
                3820,
                3840
            ],
            [
                3841,
                3854
            ],
            [
                3854,
                3939
            ],
            [
                3939,
                3947
            ],
            [
                3951,
                3958
            ],
            [
                3958,
                3960
            ],
            [
                3960,
                3974
            ],
            [
                3975,
                3978
            ],
            [
                3979,
                3992
            ],
            [
                3997,
                3998
            ],
            [
                4000,
                4036
            ],
            [
                4036,
                4087
            ],
            [
                4091,
                4100
            ],
            [
                4100,
                4110
            ],
            [
                4111,
                4163
            ],
            [
                4166,
                4176
            ],
            [
                4180,
                4192
            ],
            [
                4192,
                4253
            ],
            [
                4262,
                4280
            ],
            [
                4288,
                4290
            ],
            [
                4290,
                4297
            ],
            [
                4306,
                4321
            ],
            [
                4321,
                4323
            ],
            [
                4323,
                4333
            ],
            [
                4338,
                4344
            ],
            [
                4345,
                4347
            ],
            [
                4348,
                4381
            ],
            [
                4387,
                4393
            ],
            [
                4394,
                4444
            ],
            [
                4449,
                4456
            ],
            [
                4457,
                4461
            ],
            [
                4462,
                4466
            ],
            [
                4468,
                4506
            ],
            [
                4511,
                4559
            ],
            [
                4559,
                4571
            ],
            [
                4577,
                4612
            ],
            [
                4617,
                4619
            ],
            [
                4619,
                4638
            ],
            [
                4639,
                4660
            ],
            [
                4661,
                4776
            ],
            [
                4776,
                4811
            ],
            [
                4812,
                4866
            ],
            [
                4872,
                4887
            ],
            [
                4887,
                4914
            ],
            [
                4937,
                4959
            ],
            [
                4959,
                4988
            ],
            [
                4988,
                5018
            ],
            [
                5018,
                5027
            ],
            [
                5027,
                5049
            ],
            [
                5049,
                5107
            ],
            [
                5107,
                5115
            ],
            [
                5115,
                5137
            ],
            [
                5137,
                5149
            ],
            [
                5155,
                5182
            ],
            [
                5188,
                5204
            ],
            [
                5204,
                5213
            ],
            [
                5213,
                5246
            ],
            [
                5260,
                5275
            ],
            [
                5276,
                5307
            ],
            [
                5313,
                5349
            ],
            [
                5351,
                5361
            ],
            [
                5368,
                5389
            ],
            [
                5395,
                5417
            ],
            [
                5417,
                5429
            ],
            [
                5438,
                5441
            ],
            [
                5441,
                5450
            ],
            [
                5450,
                5479
            ],
            [
                5479,
                5512
            ],
            [
                5512,
                5521
            ],
            [
                5521,
                5613
            ],
            [
                5613,
                5671
            ],
            [
                5694,
                5752
            ],
            [
                5752,
                5836
            ],
            [
                5836,
                5915
            ],
            [
                5917,
                5953
            ],
            [
                5953,
                5989
            ],
            [
                5989,
                6054
            ],
            [
                6055,
                6061
            ],
            [
                6070,
                6072
            ],
            [
                6073,
                6115
            ],
            [
                6115,
                6136
            ],
            [
                6137,
                6146
            ],
            [
                6146,
                6216
            ],
            [
                6217,
                6269
            ],
            [
                6270,
                6284
            ],
            [
                6284,
                6285
            ],
            [
                6286,
                6316
            ],
            [
                6317,
                6324
            ],
            [
                6325,
                6331
            ],
            [
                6332,
                6355
            ],
            [
                6355,
                6360
            ],
            [
                6360,
                6365
            ],
            [
                6365,
                6417
            ],
            [
                6417,
                6460
            ],
            [
                6460,
                6548
            ],
            [
                6553,
                6609
            ],
            [
                6614,
                6662
            ],
            [
                6662,
                6664
            ],
            [
                6664,
                6673
            ],
            [
                6684,
                6720
            ],
            [
                6725,
                6737
            ],
            [
                6738,
                6772
            ],
            [
                6781,
                6784
            ],
            [
                6784,
                6831
            ],
            [
                6831,
                6833
            ],
            [
                6833,
                6834
            ],
            [
                6855,
                6876
            ],
            [
                6876,
                6877
            ],
            [
                6877,
                6934
            ],
            [
                6934,
                6943
            ],
            [
                6945,
                6953
            ],
            [
                6962,
                6974
            ],
            [
                6974,
                7026
            ],
            [
                7026,
                7069
            ],
            [
                7077,
                7079
            ],
            [
                7079,
                7107
            ],
            [
                7112,
                7146
            ],
            [
                7146,
                7166
            ],
            [
                7173,
                7196
            ],
            [
                7196,
                7216
            ],
            [
                7217,
                7239
            ],
            [
                7239,
                7265
            ],
            [
                7265,
                7315
            ],
            [
                7315,
                7317
            ],
            [
                7317,
                7341
            ],
            [
                7354,
                7357
            ],
            [
                7357,
                7394
            ],
            [
                7394,
                7403
            ],
            [
                7404,
                7430
            ],
            [
                7439,
                7492
            ],
            [
                7492,
                7500
            ],
            [
                7501,
                7600
            ],
            [
                7601,
                7612
            ],
            [
                7613,
                7620
            ],
            [
                7621,
                7623
            ],
            [
                7634,
                7643
            ],
            [
                7643,
                7671
            ],
            [
                7671,
                7673
            ],
            [
                7682,
                7729
            ],
            [
                7730,
                7808
            ],
            [
                7817,
                7819
            ],
            [
                7825,
                7870
            ],
            [
                7870,
                7872
            ],
            [
                7872,
                7897
            ],
            [
                7905,
                7960
            ],
            [
                7960,
                7985
            ],
            [
                7985,
                7998
            ],
            [
                7998,
                8015
            ],
            [
                8015,
                8038
            ],
            [
                8039,
                8088
            ],
            [
                8089,
                8094
            ],
            [
                8095,
                8181
            ],
            [
                8181,
                8183
            ],
            [
                8190,
                8236
            ],
            [
                8237,
                8241
            ],
            [
                8242,
                8250
            ],
            [
                8255,
                8319
            ],
            [
                8319,
                8326
            ],
            [
                8327,
                8357
            ],
            [
                8358,
                8361
            ],
            [
                8362,
                8386
            ],
            [
                8387,
                8393
            ],
            [
                8394,
                8401
            ],
            [
                8401,
                8450
            ],
            [
                8451,
                8485
            ],
            [
                8486,
                8543
            ],
            [
                8544,
                8568
            ],
            [
                8569,
                8573
            ],
            [
                8574,
                8575
            ],
            [
                8576,
                8581
            ],
            [
                8582,
                8611
            ],
            [
                8611,
                8664
            ],
            [
                8665,
                8687
            ],
            [
                8687,
                8722
            ],
            [
                8722,
                8723
            ],
            [
                8724,
                8727
            ],
            [
                8733,
                8739
            ],
            [
                8740,
                8741
            ],
            [
                8747,
                8752
            ],
            [
                8752,
                8754
            ],
            [
                8754,
                8771
            ],
            [
                8771,
                8781
            ],
            [
                8782,
                8861
            ],
            [
                8862,
                8900
            ],
            [
                8900,
                8920
            ],
            [
                8921,
                8941
            ],
            [
                8942,
                8950
            ],
            [
                8951,
                8980
            ],
            [
                8996,
                9067
            ],
            [
                9067,
                9130
            ],
            [
                9130,
                9146
            ],
            [
                9147,
                9153
            ],
            [
                9154,
                9165
            ],
            [
                9165,
                9200
            ],
            [
                9200,
                9202
            ],
            [
                9212,
                9215
            ],
            [
                9232,
                9236
            ],
            [
                9244,
                9245
            ],
            [
                9267,
                9269
            ],
            [
                9280,
                9282
            ],
            [
                9283,
                9286
            ],
            [
                9303,
                9309
            ],
            [
                9314,
                9315
            ],
            [
                9316,
                9326
            ],
            [
                9327,
                9330
            ],
            [
                9331,
                9334
            ],
            [
                9345,
                9346
            ],
            [
                9364,
                9365
            ],
            [
                9383,
                9385
            ],
            [
                9390,
                9393
            ],
            [
                9393,
                9395
            ],
            [
                9395,
                9445
            ],
            [
                9445,
                9470
            ],
            [
                9478,
                9481
            ],
            [
                9481,
                9483
            ],
            [
                9483,
                9553
            ],
            [
                9553,
                9588
            ],
            [
                9589,
                9592
            ],
            [
                9612,
                9615
            ],
            [
                9644,
                9654
            ],
            [
                9659,
                9665
            ],
            [
                9671,
                9673
            ],
            [
                9674,
                9675
            ],
            [
                9676,
                9700
            ],
            [
                9700,
                9701
            ],
            [
                9708,
                9712
            ],
            [
                9713,
                9715
            ],
            [
                9716,
                9736
            ],
            [
                9737,
                9738
            ],
            [
                9739,
                9748
            ],
            [
                9749,
                9761
            ],
            [
                9762,
                9813
            ],
            [
                9813,
                9818
            ],
            [
                9821,
                9835
            ],
            [
                9838,
                9851
            ],
            [
                9851,
                9852
            ],
            [
                9853,
                9890
            ],
            [
                9891,
                9892
            ],
            [
                9893,
                9932
            ],
            [
                9933,
                9946
            ],
            [
                9947,
                9957
            ],
            [
                9958,
                9961
            ],
            [
                9962,
                9976
            ],
            [
                9980,
                9991
            ],
            [
                9998,
                10002
            ],
            [
                10003,
                10065
            ],
            [
                10066,
                10067
            ],
            [
                10068,
                10084
            ],
            [
                10086,
                10089
            ],
            [
                10092,
                10098
            ],
            [
                10099,
                10107
            ],
            [
                10113,
                10120
            ],
            [
                10129,
                10144
            ],
            [
                10144,
                10165
            ],
            [
                10165,
                10167
            ],
            [
                10177,
                10211
            ],
            [
                10211,
                10227
            ],
            [
                10228,
                10231
            ],
            [
                10238,
                10242
            ],
            [
                10242,
                10353
            ],
            [
                10353,
                10355
            ],
            [
                10355,
                10357
            ],
            [
                10376,
                10383
            ],
            [
                10384,
                10413
            ],
            [
                10414,
                10424
            ],
            [
                10427,
                10466
            ],
            [
                10469,
                10514
            ],
            [
                10514,
                10516
            ],
            [
                10516,
                10522
            ],
            [
                10522,
                10609
            ],
            [
                10616,
                10622
            ],
            [
                10623,
                10642
            ],
            [
                10642,
                10679
            ],
            [
                10679,
                10711
            ],
            [
                10718,
                10724
            ]
        ],
        "row_chars": [
            [
                0,
                164
            ],
            [
                164,
                236
            ],
            [
                236,
                670
            ],
            [
                670,
                891
            ],
            [
                891,
                954
            ],
            [
                954,
                1205
            ],
            [
                1205,
                1324
            ],
            [
                1324,
                1324
            ],
            [
                1324,
                1462
            ],
            [
                1462,
                1539
            ],
            [
                1539,
                1595
            ],
            [
                1595,
                1772
            ],
            [
                1772,
                1957
            ],
            [
                1957,
                2037
            ],
            [
                2037,
                2160
            ],
            [
                2160,
                2160
            ],
            [
                2160,
                2415
            ],
            [
                2415,
                2448
            ],
            [
                2448,
                2461
            ],
            [
                2461,
                2551
            ],
            [
                2551,
                2631
            ],
            [
                2631,
                2708
            ],
            [
                2708,
                2821
            ],
            [
                2821,
                2998
            ],
            [
                2998,
                3094
            ],
            [
                3094,
                3325
            ],
            [
                3325,
                3352
            ],
            [
                3352,
                3363
            ],
            [
                3363,
                3408
            ],
            [
                3408,
                3455
            ],
            [
                3455,
                3497
            ],
            [
                3497,
                3537
            ],
            [
                3537,
                3602
            ],
            [
                3602,
                3728
            ],
            [
                3728,
                3854
            ],
            [
                3854,
                3939
            ],
            [
                3939,
                3960
            ],
            [
                3960,
                4036
            ],
            [
                4036,
                4036
            ],
            [
                4036,
                4192
            ],
            [
                4192,
                4290
            ],
            [
                4290,
                4323
            ],
            [
                4323,
                4323
            ],
            [
                4323,
                4619
            ],
            [
                4619,
                4776
            ],
            [
                4776,
                4887
            ],
            [
                4887,
                4917
            ],
            [
                4917,
                4936
            ],
            [
                4936,
                4959
            ],
            [
                4959,
                4988
            ],
            [
                4988,
                5018
            ],
            [
                5018,
                5027
            ],
            [
                5027,
                5049
            ],
            [
                5049,
                5107
            ],
            [
                5107,
                5115
            ],
            [
                5115,
                5137
            ],
            [
                5137,
                5204
            ],
            [
                5204,
                5213
            ],
            [
                5213,
                5417
            ],
            [
                5417,
                5441
            ],
            [
                5441,
                5450
            ],
            [
                5450,
                5479
            ],
            [
                5479,
                5512
            ],
            [
                5512,
                5521
            ],
            [
                5521,
                5613
            ],
            [
                5613,
                5752
            ],
            [
                5752,
                5836
            ],
            [
                5836,
                5953
            ],
            [
                5953,
                5989
            ],
            [
                5989,
                6072
            ],
            [
                6072,
                6072
            ],
            [
                6072,
                6072
            ],
            [
                6072,
                6072
            ],
            [
                6072,
                6146
            ],
            [
                6146,
                6286
            ],
            [
                6286,
                6355
            ],
            [
                6355,
                6360
            ],
            [
                6360,
                6365
            ],
            [
                6365,
                6417
            ],
            [
                6417,
                6460
            ],
            [
                6460,
                6664
            ],
            [
                6664,
                6784
            ],
            [
                6784,
                6833
            ],
            [
                6833,
                6876
            ],
            [
                6876,
                6934
            ],
            [
                6934,
                6974
            ],
            [
                6974,
                7026
            ],
            [
                7026,
                7026
            ],
            [
                7026,
                7079
            ],
            [
                7079,
                7146
            ],
            [
                7146,
                7146
            ],
            [
                7146,
                7196
            ],
            [
                7196,
                7239
            ],
            [
                7239,
                7265
            ],
            [
                7265,
                7317
            ],
            [
                7317,
                7357
            ],
            [
                7357,
                7394
            ],
            [
                7394,
                7492
            ],
            [
                7492,
                7601
            ],
            [
                7601,
                7673
            ],
            [
                7673,
                7673
            ],
            [
                7673,
                7809
            ],
            [
                7809,
                7872
            ],
            [
                7872,
                7960
            ],
            [
                7960,
                7985
            ],
            [
                7985,
                7998
            ],
            [
                7998,
                8183
            ],
            [
                8183,
                8319
            ],
            [
                8319,
                8451
            ],
            [
                8451,
                8544
            ],
            [
                8544,
                8611
            ],
            [
                8611,
                8687
            ],
            [
                8687,
                8754
            ],
            [
                8754,
                8862
            ],
            [
                8862,
                8900
            ],
            [
                8900,
                9067
            ],
            [
                9067,
                9130
            ],
            [
                9130,
                9202
            ],
            [
                9202,
                9316
            ],
            [
                9316,
                9395
            ],
            [
                9395,
                9483
            ],
            [
                9483,
                9553
            ],
            [
                9553,
                9644
            ],
            [
                9644,
                9644
            ],
            [
                9644,
                9644
            ],
            [
                9644,
                10086
            ],
            [
                10086,
                10144
            ],
            [
                10144,
                10167
            ],
            [
                10167,
                10211
            ],
            [
                10211,
                10211
            ],
            [
                10211,
                10211
            ],
            [
                10211,
                10355
            ],
            [
                10355,
                10516
            ],
            [
                10516,
                10516
            ],
            [
                10516,
                10522
            ],
            [
                10522,
                10610
            ],
            [
                10610,
                10642
            ],
            [
                10642,
                10724
            ]
        ]
    }
}