{
    "original": {
        "text": "Sir Pitt Crawley was a philosopher with a taste for what is called low life. His first marriage with the daughter of the noble Binkie had been made under the auspices of his parents; and as he often told Lady Crawley in her lifetime she was such a confounded quarrelsome high-bred jade that when she died he was hanged if he would ever take another of her sort, at her ladyship's demise he kept his promise, and selected for a second wife Miss Rose Dawson, daughter of Mr. John Thomas Dawson, ironmonger, of Mudbury. What a happy woman was Rose to be my Lady Crawley!\nLet us set down the items of her happiness. In the first place, she gave up Peter Butt, a young man who kept company with her, and in consequence of his disappointment in love, took to smuggling, poaching, and a thousand other bad courses. Then she quarrelled, as in duty bound, with all the friends and intimates of her youth, who, of course, could not be received by my Lady at Queen's Crawley--nor did she find in her new rank and abode any persons who were willing to welcome her. Who ever did? Sir Huddleston Fuddleston had three daughters who all hoped to be Lady Crawley. Sir Giles Wapshot's family were insulted that one of the Wapshot girls had not the preference in the marriage, and the remaining baronets of the county were indignant at their comrade's misalliance. Never mind the commoners, whom we will leave to grumble anonymously.\nSir Pitt did not care, as he said, a brass farden for any one of them. He had his pretty Rose, and what more need a man require than to please himself? So he used to get drunk every night: to beat his pretty Rose sometimes: to leave her in Hampshire when he went to London for the parliamentary session, without a single friend in the wide world. Even Mrs. Bute Crawley, the Rector's wife, refused to visit her, as she said she would never give the pas to a tradesman's daughter.\nAs the only endowments with which Nature had gifted Lady Crawley were those of pink cheeks and a white skin, and as she had no sort of character, nor talents, nor opinions, nor occupations, nor amusements, nor that vigour of soul and ferocity of temper which often falls to the lot of entirely foolish women, her hold upon Sir Pitt's affections was not very great. Her roses faded out of her cheeks, and the pretty freshness left her figure after the birth of a couple of children, and she became a mere machine in her husband's house of no more use than the late Lady Crawley's grand piano. Being a light-complexioned woman, she wore light clothes, as most blondes will, and appeared, in preference, in draggled sea-green, or slatternly sky-blue. She worked that worsted day and night, or other pieces like it. She had counterpanes in the course of a few years to all the beds in Crawley. She had a small flower-garden, for which she had rather an affection; but beyond this no other like or disliking. When her husband was rude to her she was apathetic: whenever he struck her she cried. She had not character enough to take to drinking, and moaned about, slipshod and in curl-papers all day. O Vanity Fair--Vanity Fair! This might have been, but for you, a cheery lass--Peter Butt and Rose a happy man and wife, in a snug farm, with a hearty family; and an honest portion of pleasures, cares, hopes and struggles--but a title and a coach and four are toys more precious than happiness in Vanity Fair: and if Harry the Eighth or Bluebeard were alive now, and wanted a tenth wife, do you suppose he could not get the prettiest girl that shall be presented this season?\nThe languid dulness of their mamma did not, as it may be supposed, awaken much affection in her little daughters, but they were very happy in the servants' hall and in the stables; and the Scotch gardener having luckily a good wife and some good children, they got a little wholesome society and instruction in his lodge, which was the only education bestowed upon them until Miss Sharp came.\nHer engagement was owing to the remonstrances of Mr. Pitt Crawley, the only friend or protector Lady Crawley ever had, and the only person, besides her children, for whom she entertained a little feeble attachment. Mr. Pitt took after the noble Binkies, from whom he was descended, and was a very polite and proper gentleman. When he grew to man's estate, and came back from Christchurch, he began to reform the slackened discipline of the hall, in spite of his father, who stood in awe of him. He was a man of such rigid refinement, that he would have starved rather than have dined without a white neckcloth. Once, when just from college, and when Horrocks the butler brought him a letter without placing it previously on a tray, he gave that domestic a look, and administered to him a speech so cutting, that Horrocks ever after trembled before him; the whole household bowed to him: Lady Crawley's curl-papers came off earlier when he was at home: Sir Pitt's muddy gaiters disappeared; and if that incorrigible old man still adhered to other old habits, he never fuddled himself with rum-and-water in his son's presence, and only talked to his servants in a very reserved and polite manner; and those persons remarked that Sir Pitt never swore at Lady Crawley while his son was in the room.\nIt was he who taught the butler to say, \"My lady is served,\" and who insisted on handing her ladyship in to dinner. He seldom spoke to her, but when he did it was with the most powerful respect; and he never let her quit the apartment without rising in the most stately manner to open the door, and making an elegant bow at her egress.\nAt Eton he was called Miss Crawley; and there, I am sorry to say, his younger brother Rawdon used to lick him violently. But though his parts were not brilliant, he made up for his lack of talent by meritorious industry, and was never known, during eight years at school, to be subject to that punishment which it is generally thought none but a cherub can escape.\nAt college his career was of course highly creditable. And here he prepared himself for public life, into which he was to be introduced by the patronage of his grandfather, Lord Binkie, by studying the ancient and modern orators with great assiduity, and by speaking unceasingly at the debating societies. But though he had a fine flux of words, and delivered his little voice with great pomposity and pleasure to himself, and never advanced any sentiment or opinion which was not perfectly trite and stale, and supported by a Latin quotation; yet he failed somehow, in spite of a mediocrity which ought to have insured any man a success. He did not even get the prize poem, which all his friends said he was sure of.\nAfter leaving college he became Private Secretary to Lord Binkie, and was then appointed Attache to the Legation at Pumpernickel, which post he filled with perfect honour, and brought home despatches, consisting of Strasburg pie, to the Foreign Minister of the day. After remaining ten years Attache (several years after the lamented Lord Binkie's demise), and finding the advancement slow, he at length gave up the diplomatic service in some disgust, and began to turn country gentleman.\nHe wrote a pamphlet on Malt on returning to England (for he was an ambitious man, and always liked to be before the public), and took a strong part in the Negro Emancipation question. Then he became a friend of Mr. Wilberforce's, whose politics he admired, and had that famous correspondence with the Reverend Silas Hornblower, on the Ashantee Mission. He was in London, if not for the Parliament session, at least in May, for the religious meetings. In the country he was a magistrate, and an active visitor and speaker among those destitute of religious instruction. He was said to be paying his addresses to Lady Jane Sheepshanks, Lord Southdown's third daughter, and whose sister, Lady Emily, wrote those sweet tracts, \"The Sailor's True Binnacle,\" and \"The Applewoman of Finchley Common.\"\nMiss Sharp's accounts of his employment at Queen's Crawley were not caricatures. He subjected the servants there to the devotional exercises before mentioned, in which (and so much the better) he brought his father to join. He patronised an Independent meeting-house in Crawley parish, much to the indignation of his uncle the Rector, and to the consequent delight of Sir Pitt, who was induced to go himself once or twice, which occasioned some violent sermons at Crawley parish church, directed point-blank at the Baronet's old Gothic pew there. Honest Sir Pitt, however, did not feel the force of these discourses, as he always took his nap during sermon-time.\nMr. Crawley was very earnest, for the good of the nation and of the Christian world, that the old gentleman should yield him up his place in Parliament; but this the elder constantly refused to do. Both were of course too prudent to give up the fifteen hundred a year which was brought in by the second seat (at this period filled by Mr. Quadroon, with carte blanche on the Slave question); indeed the family estate was much embarrassed, and the income drawn from the borough was of great use to the house of Queen's Crawley.\nIt had never recovered the heavy fine imposed upon Walpole Crawley, first baronet, for peculation in the Tape and Sealing Wax Office. Sir Walpole was a jolly fellow, eager to seize and to spend money (alieni appetens, sui profusus, as Mr. Crawley would remark with a sigh), and in his day beloved by all the county for the constant drunkenness and hospitality which was maintained at Queen's Crawley. The cellars were filled with burgundy then, the kennels with hounds, and the stables with gallant hunters; now, such horses as Queen's Crawley possessed went to plough, or ran in the Trafalgar Coach; and it was with a team of these very horses, on an off-day, that Miss Sharp was brought to the Hall; for boor as he was, Sir Pitt was a stickler for his dignity while at home, and seldom drove out but with four horses, and though he dined off boiled mutton, had always three footmen to serve it.\nIf mere parsimony could have made a man rich, Sir Pitt Crawley might have become very wealthy--if he had been an attorney in a country town, with no capital but his brains, it is very possible that he would have turned them to good account, and might have achieved for himself a very considerable influence and competency. But he was unluckily endowed with a good name and a large though encumbered estate, both of which went rather to injure than to advance him. He had a taste for law, which cost him many thousands yearly; and being a great deal too clever to be robbed, as he said, by any single agent, allowed his affairs to be mismanaged by a dozen, whom he all equally mistrusted. He was such a sharp landlord, that he could hardly find any but bankrupt tenants; and such a close farmer, as to grudge almost the seed to the ground, whereupon revengeful Nature grudged him the crops which she granted to more liberal husbandmen. He speculated in every possible way; he worked mines; bought canal-shares; horsed coaches; took government contracts, and was the busiest man and magistrate of his county. As he would not pay honest agents at his granite quarry, he had the satisfaction of finding that four overseers ran away, and took fortunes with them to America. For want of proper precautions, his coal-mines filled with water: the government flung his contract of damaged beef upon his hands: and for his coach-horses, every mail proprietor in the kingdom knew that he lost more horses than any man in the country, from underfeeding and buying cheap. In disposition he was sociable, and far from being proud; nay, he rather preferred the society of a farmer or a horse-dealer to that of a gentleman, like my lord, his son: he was fond of drink, of swearing, of joking with the farmers' daughters: he was never known to give away a shilling or to do a good action, but was of a pleasant, sly, laughing mood, and would cut his joke and drink his glass with a tenant and sell him up the next day; or have his laugh with the poacher he was transporting with equal good humour. His politeness for the fair sex has already been hinted at by Miss Rebecca Sharp--in a word, the whole baronetage, peerage, commonage of England, did not contain a more cunning, mean, selfish, foolish, disreputable old man. That blood-red hand of Sir Pitt Crawley's would be in anybody's pocket except his own; and it is with grief and pain, that, as admirers of the British aristocracy, we find ourselves obliged to admit the existence of so many ill qualities in a person whose name is in Debrett.\nOne great cause why Mr. Crawley had such a hold over the affections of his father, resulted from money arrangements. The Baronet owed his son a sum of money out of the jointure of his mother, which he did not find it convenient to pay; indeed he had an almost invincible repugnance to paying anybody, and could only be brought by force to discharge his debts. Miss Sharp calculated (for she became, as we shall hear speedily, inducted into most of the secrets of the family) that the mere payment of his creditors cost the honourable Baronet several hundreds yearly; but this was a delight he could not forego; he had a savage pleasure in making the poor wretches wait, and in shifting from court to court and from term to term the period of satisfaction. What's the good of being in Parliament, he said, if you must pay your debts? Hence, indeed, his position as a senator was not a little useful to him.\nVanity Fair--Vanity Fair! Here was a man, who could not spell, and did not care to read--who had the habits and the cunning of a boor: whose aim in life was pettifogging: who never had a taste, or emotion, or enjoyment, but what was sordid and foul; and yet he had rank, and honours, and power, somehow: and was a dignitary of the land, and a pillar of the state. He was high sheriff, and rode in a golden coach. Great ministers and statesmen courted him; and in Vanity Fair he had a higher place than the most brilliant genius or spotless virtue.\nSir Pitt had an unmarried half-sister who inherited her mother's large fortune, and though the Baronet proposed to borrow this money of her on mortgage, Miss Crawley declined the offer, and preferred the security of the funds. She had signified, however, her intention of leaving her inheritance between Sir Pitt's second son and the family at the Rectory, and had once or twice paid the debts of Rawdon Crawley in his career at college and in the army. Miss Crawley was, in consequence, an object of great respect when she came to Queen's Crawley, for she had a balance at her banker's which would have made her beloved anywhere.\nWhat a dignity it gives an old lady, that balance at the banker's! How tenderly we look at her faults if she is a relative (and may every reader have a score of such), what a kind good-natured old creature we find her! How the junior partner of Hobbs and Dobbs leads her smiling to the carriage with the lozenge upon it, and the fat wheezy coachman! How, when she comes to pay us a visit, we generally find an opportunity to let our friends know her station in the world! We say (and with perfect truth) I wish I had Miss MacWhirter's signature to a cheque for five thousand pounds. She wouldn't miss it, says your wife. She is my aunt, say you, in an easy careless way, when your friend asks if Miss MacWhirter is any relative. Your wife is perpetually sending her little testimonies of affection, your little girls work endless worsted baskets, cushions, and footstools for her. What a good fire there is in her room when she comes to pay you a visit, although your wife laces her stays without one! The house during her stay assumes a festive, neat, warm, jovial, snug appearance not visible at other seasons. You yourself, dear sir, forget to go to sleep after dinner, and find yourself all of a sudden (though you invariably lose) very fond of a rubber. What good dinners you have--game every day, Malmsey-Madeira, and no end of fish from London. Even the servants in the kitchen share in the general prosperity; and, somehow, during the stay of Miss MacWhirter's fat coachman, the beer is grown much stronger, and the consumption of tea and sugar in the nursery (where her maid takes her meals) is not regarded in the least. Is it so, or is it not so? I appeal to the middle classes. Ah, gracious powers! I wish you would send me an old aunt--a maiden aunt--an aunt with a lozenge on her carriage, and a front of light coffee-coloured hair--how my children should work workbags for her, and my Julia and I would make her comfortable! Sweet--sweet vision! Foolish--foolish dream!",
        "paragraph_chars": [
            [
                0,
                568
            ],
            [
                568,
                1415
            ],
            [
                1415,
                1895
            ],
            [
                1895,
                3565
            ],
            [
                3565,
                3958
            ],
            [
                3958,
                5253
            ],
            [
                5253,
                5589
            ],
            [
                5589,
                5954
            ],
            [
                5954,
                6672
            ],
            [
                6672,
                7161
            ],
            [
                7161,
                7955
            ],
            [
                7955,
                8618
            ],
            [
                8618,
                9144
            ],
            [
                9144,
                10041
            ],
            [
                10041,
                12622
            ],
            [
                12622,
                13528
            ],
            [
                13528,
                14076
            ],
            [
                14076,
                14707
            ],
            [
                14707,
                16691
            ]
        ],
        "segment_chars": [
            [
                0,
                77
            ],
            [
                77,
                517
            ],
            [
                517,
                568
            ],
            [
                568,
                612
            ],
            [
                612,
                808
            ],
            [
                808,
                1053
            ],
            [
                1053,
                1067
            ],
            [
                1067,
                1147
            ],
            [
                1147,
                1346
            ],
            [
                1346,
                1415
            ],
            [
                1415,
                1486
            ],
            [
                1486,
                1567
            ],
            [
                1567,
                1762
            ],
            [
                1762,
                1895
            ],
            [
                1895,
                2260
            ],
            [
                2260,
                2487
            ],
            [
                2487,
                2643
            ],
            [
                2643,
                2707
            ],
            [
                2707,
                2785
            ],
            [
                2785,
                2899
            ],
            [
                2899,
                2985
            ],
            [
                2985,
                3090
            ],
            [
                3090,
                3118
            ],
            [
                3118,
                3565
            ],
            [
                3565,
                3958
            ],
            [
                3958,
                4173
            ],
            [
                4173,
                4284
            ],
            [
                4284,
                4453
            ],
            [
                4453,
                4569
            ],
            [
                4569,
                5253
            ],
            [
                5253,
                5369
            ],
            [
                5369,
                5589
            ],
            [
                5589,
                5710
            ],
            [
                5710,
                5954
            ],
            [
                5954,
                6009
            ],
            [
                6009,
                6260
            ],
            [
                6260,
                6593
            ],
            [
                6593,
                6672
            ],
            [
                6672,
                6938
            ],
            [
                6938,
                7161
            ],
            [
                7161,
                7345
            ],
            [
                7345,
                7514
            ],
            [
                7514,
                7612
            ],
            [
                7612,
                7730
            ],
            [
                7730,
                7955
            ],
            [
                7955,
                8036
            ],
            [
                8036,
                8179
            ],
            [
                8179,
                8502
            ],
            [
                8502,
                8618
            ],
            [
                8618,
                8816
            ],
            [
                8816,
                9144
            ],
            [
                9144,
                9278
            ],
            [
                9278,
                9545
            ],
            [
                9545,
                10041
            ],
            [
                10041,
                10364
            ],
            [
                10364,
                10505
            ],
            [
                10505,
                10729
            ],
            [
                10729,
                10976
            ],
            [
                10976,
                11148
            ],
            [
                11148,
                11310
            ],
            [
                11310,
                11600
            ],
            [
                11600,
                12122
            ],
            [
                12122,
                12346
            ],
            [
                12346,
                12622
            ],
            [
                12622,
                12739
            ],
            [
                12739,
                12982
            ],
            [
                12982,
                13378
            ],
            [
                13378,
                13455
            ],
            [
                13455,
                13528
            ],
            [
                13528,
                13554
            ],
            [
                13554,
                13892
            ],
            [
                13892,
                13941
            ],
            [
                13941,
                14076
            ],
            [
                14076,
                14303
            ],
            [
                14303,
                14530
            ],
            [
                14530,
                14707
            ],
            [
                14707,
                14774
            ],
            [
                14774,
                14926
            ],
            [
                14926,
                15057
            ],
            [
                15057,
                15179
            ],
            [
                15179,
                15290
            ],
            [
                15290,
                15328
            ],
            [
                15328,
                15436
            ],
            [
                15436,
                15588
            ],
            [
                15588,
                15709
            ],
            [
                15709,
                15820
            ],
            [
                15820,
                15966
            ],
            [
                15966,
                16059
            ],
            [
                16059,
                16338
            ],
            [
                16338,
                16365
            ],
            [
                16365,
                16397
            ],
            [
                16397,
                16418
            ],
            [
                16418,
                16647
            ],
            [
                16647,
                16668
            ],
            [
                16668,
                16691
            ]
        ],
        "overlap_chars": [
            [
                0,
                16
            ],
            [
                40,
                77
            ],
            [
                77,
                142
            ],
            [
                170,
                186
            ],
            [
                190,
                216
            ],
            [
                233,
                360
            ],
            [
                471,
                472
            ],
            [
                362,
                368
            ],
            [
                387,
                389
            ],
            [
                412,
                468
            ],
            [
                493,
                503
            ],
            [
                515,
                517
            ],
            [
                517,
                568
            ],
            [
                568,
                612
            ],
            [
                612,
                643
            ],
            [
                658,
                667
            ],
            [
                654,
                655
            ],
            [
                668,
                671
            ],
            [
                699,
                701
            ],
            [
                717,
                735
            ],
            [
                745,
                762
            ],
            [
                695,
                698
            ],
            [
                764,
                772
            ],
            [
                806,
                808
            ],
            [
                808,
                827
            ],
            [
                847,
                867
            ],
            [
                882,
                933
            ],
            [
                945,
                963
            ],
            [
                965,
                981
            ],
            [
                1008,
                1011
            ],
            [
                989,
                992
            ],
            [
                827,
                828
            ],
            [
                1200,
                1203
            ],
            [
                1276,
                1332
            ],
            [
                1248,
                1256
            ],
            [
                1051,
                1052
            ],
            [
                1415,
                1436
            ],
            [
                1484,
                1486
            ],
            [
                1486,
                1513
            ],
            [
                1551,
                1565
            ],
            [
                1567,
                1687
            ],
            [
                1717,
                1749
            ],
            [
                1755,
                1762
            ],
            [
                1762,
                1826
            ],
            [
                1830,
                1833
            ],
            [
                1871,
                1895
            ],
            [
                1895,
                1897
            ],
            [
                1947,
                1959
            ],
            [
                1902,
                1906
            ],
            [
                1960,
                1989
            ],
            [
                1992,
                2021
            ],
            [
                2030,
                2083
            ],
            [
                2202,
                2260
            ],
            [
                2450,
                2453
            ],
            [
                2264,
                2375
            ],
            [
                2381,
                2429
            ],
            [
                2375,
                2376
            ],
            [
                2430,
                2449
            ],
            [
                2474,
                2487
            ],
            [
                2643,
                2653
            ],
            [
                2667,
                2680
            ],
            [
                2783,
                2785
            ],
            [
                2785,
                2833
            ],
            [
                2841,
                2858
            ],
            [
                2871,
                2887
            ],
            [
                2897,
                2899
            ],
            [
                2899,
                2950
            ],
            [
                2960,
                2985
            ],
            [
                2985,
                2988
            ],
            [
                3039,
                3089
            ],
            [
                3090,
                3103
            ],
            [
                3112,
                3118
            ],
            [
                3123,
                3133
            ],
            [
                3213,
                3224
            ],
            [
                3312,
                3348
            ],
            [
                3354,
                3397
            ],
            [
                3565,
                3576
            ],
            [
                3580,
                3607
            ],
            [
                3632,
                3879
            ],
            [
                3885,
                3896
            ],
            [
                3901,
                3915
            ],
            [
                3935,
                3958
            ],
            [
                3958,
                3985
            ],
            [
                4007,
                4033
            ],
            [
                4044,
                4066
            ],
            [
                4072,
                4132
            ],
            [
                4161,
                4173
            ],
            [
                4173,
                4181
            ],
            [
                4244,
                4284
            ],
            [
                4284,
                4291
            ],
            [
                4318,
                4332
            ],
            [
                4345,
                4453
            ],
            [
                4453,
                4490
            ],
            [
                4492,
                4569
            ],
            [
                4889,
                4908
            ],
            [
                4573,
                4574
            ],
            [
                4910,
                4951
            ],
            [
                4617,
                4620
            ],
            [
                4973,
                4980
            ],
            [
                5019,
                5086
            ],
            [
                5206,
                5253
            ],
            [
                5416,
                5420
            ],
            [
                5439,
                5446
            ],
            [
                5452,
                5477
            ],
            [
                5488,
                5573
            ],
            [
                5587,
                5589
            ],
            [
                5589,
                5689
            ],
            [
                5695,
                5710
            ],
            [
                5710,
                5713
            ],
            [
                5751,
                5753
            ],
            [
                5800,
                5809
            ],
            [
                5736,
                5739
            ],
            [
                5778,
                5784
            ],
            [
                5749,
                5750
            ],
            [
                5810,
                5813
            ],
            [
                5954,
                5979
            ],
            [
                5990,
                6009
            ],
            [
                6018,
                6029
            ],
            [
                6038,
                6053
            ],
            [
                6140,
                6182
            ],
            [
                6203,
                6260
            ],
            [
                6260,
                6273
            ],
            [
                6304,
                6324
            ],
            [
                6331,
                6351
            ],
            [
                6375,
                6399
            ],
            [
                6413,
                6461
            ],
            [
                6498,
                6565
            ],
            [
                6584,
                6592
            ],
            [
                6672,
                6724
            ],
            [
                6725,
                6760
            ],
            [
                6769,
                6842
            ],
            [
                6936,
                6938
            ],
            [
                6938,
                6943
            ],
            [
                6954,
                6963
            ],
            [
                7061,
                7065
            ],
            [
                7076,
                7122
            ],
            [
                7066,
                7068
            ],
            [
                7045,
                7056
            ],
            [
                7122,
                7161
            ],
            [
                7189,
                7212
            ],
            [
                7161,
                7188
            ],
            [
                7241,
                7242
            ],
            [
                7286,
                7345
            ],
            [
                7514,
                7520
            ],
            [
                7360,
                7390
            ],
            [
                7418,
                7421
            ],
            [
                7353,
                7359
            ],
            [
                7634,
                7646
            ],
            [
                7648,
                7661
            ],
            [
                7674,
                7681
            ],
            [
                7489,
                7491
            ],
            [
                7707,
                7730
            ],
            [
                8179,
                8331
            ],
            [
                8500,
                8502
            ],
            [
                8590,
                8593
            ],
            [
                8517,
                8518
            ],
            [
                8616,
                8618
            ],
            [
                8618,
                8629
            ],
            [
                8703,
                8707
            ],
            [
                8726,
                8789
            ],
            [
                8801,
                8816
            ],
            [
                8816,
                8878
            ],
            [
                8879,
                8909
            ],
            [
                8910,
                8934
            ],
            [
                8942,
                8951
            ],
            [
                8952,
                8964
            ],
            [
                9006,
                9008
            ],
            [
                9016,
                9037
            ],
            [
                9142,
                9143
            ],
            [
                9167,
                9210
            ],
            [
                9227,
                9230
            ],
            [
                9210,
                9211
            ],
            [
                9545,
                9556
            ],
            [
                9525,
                9543
            ],
            [
                9147,
                9150
            ],
            [
                9562,
                9582
            ],
            [
                9587,
                9650
            ],
            [
                9276,
                9277
            ],
            [
                9652,
                9656
            ],
            [
                9662,
                9668
            ],
            [
                9698,
                9727
            ],
            [
                9738,
                9743
            ],
            [
                10039,
                10041
            ],
            [
                10041,
                10043
            ],
            [
                10087,
                10103
            ],
            [
                10142,
                10181
            ],
            [
                10214,
                10219
            ],
            [
                10225,
                10252
            ],
            [
                10362,
                10364
            ],
            [
                10364,
                10399
            ],
            [
                10416,
                10446
            ],
            [
                10503,
                10505
            ],
            [
                10505,
                10570
            ],
            [
                10732,
                10878
            ],
            [
                10974,
                10976
            ],
            [
                10976,
                10992
            ],
            [
                11023,
                11028
            ],
            [
                11094,
                11097
            ],
            [
                11118,
                11121
            ],
            [
                11072,
                11092
            ],
            [
                11146,
                11148
            ],
            [
                11148,
                11204
            ],
            [
                11245,
                11309
            ],
            [
                11615,
                11635
            ],
            [
                11651,
                11657
            ],
            [
                11663,
                11665
            ],
            [
                11673,
                11747
            ],
            [
                11772,
                11844
            ],
            [
                11846,
                11965
            ],
            [
                11974,
                11988
            ],
            [
                11999,
                12041
            ],
            [
                12120,
                12122
            ],
            [
                12204,
                12235
            ],
            [
                12268,
                12345
            ],
            [
                12644,
                12653
            ],
            [
                12665,
                12674
            ],
            [
                12693,
                12703
            ],
            [
                12705,
                12739
            ],
            [
                12739,
                12763
            ],
            [
                12773,
                12785
            ],
            [
                12802,
                12812
            ],
            [
                12790,
                12798
            ],
            [
                12812,
                12830
            ],
            [
                12850,
                12871
            ],
            [
                12764,
                12765
            ],
            [
                12893,
                12981
            ],
            [
                13528,
                13539
            ],
            [
                13548,
                13554
            ],
            [
                13554,
                13564
            ],
            [
                13657,
                13661
            ],
            [
                13565,
                13568
            ],
            [
                13570,
                13602
            ],
            [
                13611,
                13615
            ],
            [
                13699,
                13712
            ],
            [
                13737,
                13746
            ],
            [
                13748,
                13797
            ],
            [
                13812,
                13822
            ],
            [
                13832,
                13839
            ],
            [
                13869,
                13892
            ],
            [
                13892,
                13941
            ],
            [
                13941,
                14076
            ],
            [
                14076,
                14208
            ],
            [
                14212,
                14215
            ],
            [
                14227,
                14260
            ],
            [
                14301,
                14303
            ],
            [
                14303,
                14306
            ],
            [
                14320,
                14330
            ],
            [
                14356,
                14371
            ],
            [
                14372,
                14401
            ],
            [
                14402,
                14459
            ],
            [
                14473,
                14487
            ],
            [
                14464,
                14469
            ],
            [
                14528,
                14530
            ],
            [
                14530,
                14623
            ],
            [
                14705,
                14707
            ],
            [
                14707,
                14711
            ],
            [
                14714,
                14743
            ],
            [
                14712,
                14713
            ],
            [
                14749,
                14774
            ],
            [
                14774,
                14808
            ],
            [
                14875,
                14926
            ],
            [
                15436,
                15472
            ],
            [
                15495,
                15504
            ],
            [
                15504,
                15536
            ],
            [
                15545,
                15588
            ],
            [
                15709,
                15759
            ],
            [
                15766,
                15772
            ],
            [
                15779,
                15820
            ],
            [
                15966,
                15992
            ],
            [
                16017,
                16018
            ],
            [
                15994,
                16008
            ],
            [
                16025,
                16058
            ],
            [
                16397,
                16418
            ],
            [
                16418,
                16442
            ],
            [
                16456,
                16469
            ],
            [
                16479,
                16485
            ],
            [
                16501,
                16509
            ],
            [
                16538,
                16539
            ],
            [
                16554,
                16557
            ],
            [
                16604,
                16647
            ],
            [
                16654,
                16668
            ],
            [
                16677,
                16691
            ]
        ],
        "row_chars": [
            [
                0,
                77
            ],
            [
                77,
                517
            ],
            [
                517,
                568
            ],
            [
                568,
                612
            ],
            [
                612,
                808
            ],
            [
                808,
                1346
            ],
            [
                1346,
                1415
            ],
            [
                1415,
                1486
            ],
            [
                1486,
                1567
            ],
            [
                1567,
                1762
            ],
            [
                1762,
                1895
            ],
            [
                1895,
                2260
            ],
            [
                2260,
                2487
            ],
            [
                2487,
                2643
            ],
            [
                2643,
                2785
            ],
            [
                2785,
                2899
            ],
            [
                2899,
                2985
            ],
            [
                2985,
                3090
            ],
            [
                3090,
                3118
            ],
            [
                3118,
                3565
            ],
            [
                3565,
                3958
            ],
            [
                3958,
                4173
            ],
            [
                4173,
                4284
            ],
            [
                4284,
                4453
            ],
            [
                4453,
                4569
            ],
            [
                4569,
                5253
            ],
            [
                5253,
                5369
            ],
            [
                5369,
                5589
            ],
            [
                5589,
                5710
            ],
            [
                5710,
                6009
            ],
            [
                6009,
                6260
            ],
            [
                6260,
                6593
            ],
            [
                6593,
                6672
            ],
            [
                6672,
                6938
            ],
            [
                6938,
                7161
            ],
            [
                7161,
                7345
            ],
            [
                7345,
                7730
            ],
            [
                7730,
                7955
            ],
            [
                7955,
                8036
            ],
            [
                8036,
                8179
            ],
            [
                8179,
                8502
            ],
            [
                8502,
                8618
            ],
            [
                8618,
                8816
            ],
            [
                8816,
                9144
            ],
            [
                9144,
                10041
            ],
            [
                10041,
                10364
            ],
            [
                10364,
                10505
            ],
            [
                10505,
                10976
            ],
            [
                10976,
                11148
            ],
            [
                11148,
                11310
            ],
            [
                11310,
                11600
            ],
            [
                11600,
                12122
            ],
            [
                12122,
                12346
            ],
            [
                12346,
                12622
            ],
            [
                12622,
                12739
            ],
            [
                12739,
                12982
            ],
            [
                12982,
                13378
            ],
            [
                13378,
                13455
            ],
            [
                13455,
                13528
            ],
            [
                13528,
                13554
            ],
            [
                13554,
                13892
            ],
            [
                13892,
                13941
            ],
            [
                13941,
                14076
            ],
            [
                14076,
                14303
            ],
            [
                14303,
                14530
            ],
            [
                14530,
                14707
            ],
            [
                14707,
                14774
            ],
            [
                14774,
                14926
            ],
            [
                14926,
                15057
            ],
            [
                15057,
                15179
            ],
            [
                15179,
                15290
            ],
            [
                15290,
                15328
            ],
            [
                15328,
                15436
            ],
            [
                15436,
                15588
            ],
            [
                15588,
                15709
            ],
            [
                15709,
                15820
            ],
            [
                15820,
                15966
            ],
            [
                15966,
                16059
            ],
            [
                16059,
                16338
            ],
            [
                16338,
                16365
            ],
            [
                16365,
                16397
            ],
            [
                16397,
                16418
            ],
            [
                16418,
                16647
            ],
            [
                16647,
                16668
            ],
            [
                16668,
                16691
            ]
        ]
    },
    "abridged": {
        "text": "Sir Pitt Crawley had a taste for what is called low life. His first marriage with the daughter of the noble Binkie had been arranged by his parents; and he often told Lady Crawley that she was such a confounded quarrelsome high-bred jade that when she died he was hanged if he would ever take another of her sort.\nSo at her death he selected for a second wife Miss Rose Dawson, daughter of an ironmonger. What a happy woman was Rose to be my Lady Crawley!\nLet us set down the items of her happiness. In the first place, she gave up another young man, who in his disappointment took to smuggling and poaching. Then she quarrelled with all the friends of her youth, who, of course, could not be received at Queen's Crawley - nor did she find any new friends, since the baronets of the county were indignant at their comrade's marriage.\nSir Pitt did not care. He had his pretty Rose, and he could please himself. So he used to get drunk every night: to beat his pretty Rose sometimes: to leave her in Hampshire when he went to London, without a single friend in the world. Even Mrs. Bute Crawley, the Rector's wife, refused to visit her, because she was a tradesman's daughter.\nAs Lady Crawley's only gifts were those of pink cheeks and white skin, and as she had no character, nor talents, nor opinions, nor occupations, her hold upon Sir Pitt's affections was not very great. The roses faded out of her cheeks, and the pretty freshness left her figure after the birth of a couple of children. She became a mere machine in her husband's house, of no more use than a grand piano. She worked at her knitting day and night. She had a small flower-garden, for which she had an affection; but no other like or dislike. When her husband was rude to her she was apathetic: when he struck her she cried. She moaned about, slipshod and in curl-papers all day.\nO Vanity Fair - Vanity Fair! She might have lived on a snug farm - but a title and a coach and four are more precious than happiness in Vanity Fair.\nThe languid dullness of their mamma did not awaken much affection in her little daughters, but they were very happy in the servants' hall and in the stables; and the Scotch gardener having luckily a good wife and some good children, they got a little wholesome society and instruction in his house, which was their only education until Miss Sharp came.\nHer engagement was owing to young Mr. Pitt Crawley, the only protector Lady Crawley had, and the only person, besides her children, for whom she felt any attachment. Mr. Pitt was a very polite and proper gentleman. When he came back from university, he began to reform the slackened discipline of the hall, in spite of his father, who stood in awe of him. He was a man of such rigid refinement that he would have starved rather than have dined without a white neckcloth. When he was at home, Sir Pitt's muddy gaiters disappeared; and the old man never fuddled himself with rum-and-water in his son's presence, and did not swear at Lady Crawley while his son was in the room.\nMr Crawley treated his stepmother with respect. He never let her quit the room without rising in the most stately manner to open the door, and making an elegant bow.\nAt Eton he was called Miss Crawley; and there, I am sorry to say, his younger brother Rawdon used to beat him violently. But he worked with industry, if not talent, and at college his career was highly creditable. He prepared for public life by studying the ancient and modern orators, and by speaking unceasingly at the debating societies. But though he delivered his little speeches with great pomposity, and never advanced any opinion which was not perfectly trite and stale, yet he failed somehow, in spite of a mediocrity which ought to have ensured success.\nAfter leaving college he became Private Secretary to his grandfather Lord Binkie, and was then appointed Attach to the Legation at Pumpernickel, which post he filled with perfect honour. After ten years, he gave up the diplomatic service in some disgust at his lack of advancement, and began to turn country gentleman.\nOn returning to England he wrote a pamphlet on Malt, and took a strong part in the Negro Emancipation question. He was a friend of Mr. Wilberforce's, and became a magistrate and an active speaker on religious instruction. He patronised an Independent meeting-house in Crawley parish, much to the indignation of his uncle the Rector, and to the consequent delight of Sir Pitt. Mr. Crawley was said to be paying his addresses to Lady Jane Sheepshanks, Lord Southdown's third daughter.\nMr. Crawley thought that his father should yield him up his place in Parliament; but this the elder refused to do. Both were of course too prudent to give up the fifteen hundred pounds a year which was brought in by selling the second seat (at this time filled by a Mr. Quadroon); for the family estate was in debt. Before the heavy fine imposed upon Walpole Crawley for embezzlement, the cellars at Queen's Crawley had been filled with burgundy, the kennels with hounds, and the stables with gallant hunters. Now, any horses went to plough, or ran in the public coach.\nIf Sir Pitt Crawley had been an attorney in a country town, it is possible that he would have done well. But he was unluckily endowed with a large though encumbered estate. He had a taste for law, which cost him many thousands yearly; and was such a sharp landlord, that he could hardly find any but bankrupt tenants; and such a close farmer, as to grudge almost the seed to the ground. He speculated in mines and canals and government contracts. But as he would not pay honest agents at his granite quarry, four overseers ran away, and took fortunes with them to America.\nHe was sociable, and not proud; he preferred the society of a farmer or a horse-dealer to that of a gentleman. He was fond of drink, of swearing, of joking with the farmers' daughters. He was never known to give away a shilling or to do a good action, but was of a pleasant, sly, laughing mood, and would joke and drink with a tenant and sell him up the next day. In a word, the whole baronetage did not contain a more cunning, mean, selfish, foolish, disreputable old man.\nMr. Crawley's hold over his father resulted from money arrangements. The Baronet owed his son money out of his mother's jointure, which he did not wish to pay; indeed he had a great repugnance to paying anybody, and could only be brought by force to discharge his debts.\nVanity Fair - Vanity Fair! Here was a boorish man who could not spell, and did not read; who never had an enjoyment but what was sordid and foul; and yet he had rank and power, and was a pillar of the state. He was high sheriff, and rode in a golden coach. Great ministers and statesmen courted him; and in Vanity Fair he had a higher place than the most brilliant genius or spotless virtue.\nSir Pitt had an unmarried half-sister who inherited her mother's large fortune, and though the Baronet proposed to borrow this money from her, Miss Crawley declined the offer. She said, however, that she intended to leave her inheritance divided between Sir Pitt's second son Rawdon and the family at the Rectory, and had once or twice paid Rawdon Crawley's debts. Miss Crawley was, in consequence, an object of great respect when she came to Queen's Crawley.\nWhat dignity it gives an old lady, a balance at the banker's! How tenderly we look at her faults; what a kind good-natured old creature we find her! Your wife is perpetually sending her affectionate gifts, your little girls work endless baskets, cushions, and footstools for her. The house during her stay assumes a festive, neat, jovial appearance not visible at other seasons. And what good dinners you have - game every day, and no end of fish from London.\nAh, gracious powers! I wish you would send me a maiden aunt with a carriage - how my Julia and I would make her comfortable! Sweet vision! Foolish dream!",
        "paragraph_chars": [
            [
                0,
                314
            ],
            [
                314,
                456
            ],
            [
                456,
                834
            ],
            [
                834,
                1175
            ],
            [
                1175,
                1849
            ],
            [
                1849,
                1998
            ],
            [
                1998,
                2351
            ],
            [
                2351,
                3026
            ],
            [
                3026,
                3192
            ],
            [
                3192,
                3756
            ],
            [
                3756,
                4075
            ],
            [
                4075,
                4558
            ],
            [
                4558,
                5128
            ],
            [
                5128,
                5701
            ],
            [
                5701,
                6175
            ],
            [
                6175,
                6446
            ],
            [
                6446,
                6838
            ],
            [
                6838,
                7298
            ],
            [
                7298,
                7758
            ],
            [
                7758,
                7911
            ]
        ],
        "segment_chars": [
            [
                0,
                58
            ],
            [
                58,
                314
            ],
            [
                314,
                405
            ],
            [
                405,
                456
            ],
            [
                456,
                500
            ],
            [
                500,
                609
            ],
            [
                609,
                834
            ],
            [
                834,
                857
            ],
            [
                857,
                910
            ],
            [
                910,
                1070
            ],
            [
                1070,
                1175
            ],
            [
                1175,
                1375
            ],
            [
                1375,
                1492
            ],
            [
                1492,
                1577
            ],
            [
                1577,
                1619
            ],
            [
                1619,
                1712
            ],
            [
                1712,
                1794
            ],
            [
                1794,
                1849
            ],
            [
                1849,
                1878
            ],
            [
                1878,
                1998
            ],
            [
                1998,
                2351
            ],
            [
                2351,
                2517
            ],
            [
                2517,
                2566
            ],
            [
                2566,
                2707
            ],
            [
                2707,
                2822
            ],
            [
                2822,
                3026
            ],
            [
                3026,
                3074
            ],
            [
                3074,
                3192
            ],
            [
                3192,
                3313
            ],
            [
                3313,
                3406
            ],
            [
                3406,
                3533
            ],
            [
                3533,
                3756
            ],
            [
                3756,
                3943
            ],
            [
                3943,
                4075
            ],
            [
                4075,
                4187
            ],
            [
                4187,
                4297
            ],
            [
                4297,
                4451
            ],
            [
                4451,
                4558
            ],
            [
                4558,
                4673
            ],
            [
                4673,
                4874
            ],
            [
                4874,
                5068
            ],
            [
                5068,
                5128
            ],
            [
                5128,
                5233
            ],
            [
                5233,
                5301
            ],
            [
                5301,
                5515
            ],
            [
                5515,
                5575
            ],
            [
                5575,
                5701
            ],
            [
                5701,
                5812
            ],
            [
                5812,
                5886
            ],
            [
                5886,
                6065
            ],
            [
                6065,
                6175
            ],
            [
                6175,
                6244
            ],
            [
                6244,
                6446
            ],
            [
                6446,
                6473
            ],
            [
                6473,
                6654
            ],
            [
                6654,
                6703
            ],
            [
                6703,
                6838
            ],
            [
                6838,
                7014
            ],
            [
                7014,
                7203
            ],
            [
                7203,
                7298
            ],
            [
                7298,
                7360
            ],
            [
                7360,
                7447
            ],
            [
                7447,
                7578
            ],
            [
                7578,
                7677
            ],
            [
                7677,
                7758
            ],
            [
                7758,
                7779
            ],
            [
                7779,
                7883
            ],
            [
                7883,
                7897
            ],
            [
                7897,
                7911
            ]
        ],
        "overlap_chars": [
            [
                0,
                16
            ],
            [
                21,
                58
            ],
            [
                58,
                123
            ],
            [
                136,
                152
            ],
            [
                153,
                179
            ],
            [
                185,
                312
            ],
            [
                312,
                313
            ],
            [
                317,
                323
            ],
            [
                330,
                332
            ],
            [
                333,
                389
            ],
            [
                393,
                403
            ],
            [
                403,
                405
            ],
            [
                405,
                456
            ],
            [
                456,
                500
            ],
            [
                500,
                531
            ],
            [
                540,
                549
            ],
            [
                549,
                550
            ],
            [
                551,
                554
            ],
            [
                555,
                557
            ],
            [
                558,
                576
            ],
            [
                577,
                594
            ],
            [
                595,
                598
            ],
            [
                599,
                607
            ],
            [
                607,
                609
            ],
            [
                609,
                628
            ],
            [
                629,
                649
            ],
            [
                650,
                701
            ],
            [
                702,
                720
            ],
            [
                723,
                739
            ],
            [
                740,
                743
            ],
            [
                744,
                747
            ],
            [
                755,
                756
            ],
            [
                763,
                766
            ],
            [
                767,
                823
            ],
            [
                824,
                832
            ],
            [
                832,
                833
            ],
            [
                834,
                855
            ],
            [
                855,
                857
            ],
            [
                857,
                884
            ],
            [
                894,
                908
            ],
            [
                910,
                1030
            ],
            [
                1030,
                1062
            ],
            [
                1063,
                1070
            ],
            [
                1070,
                1134
            ],
            [
                1143,
                1146
            ],
            [
                1151,
                1175
            ],
            [
                1175,
                1177
            ],
            [
                1178,
                1190
            ],
            [
                1193,
                1197
            ],
            [
                1204,
                1233
            ],
            [
                1234,
                1263
            ],
            [
                1264,
                1317
            ],
            [
                1317,
                1375
            ],
            [
                1375,
                1378
            ],
            [
                1379,
                1490
            ],
            [
                1492,
                1540
            ],
            [
                1540,
                1541
            ],
            [
                1542,
                1561
            ],
            [
                1564,
                1577
            ],
            [
                1577,
                1587
            ],
            [
                1604,
                1617
            ],
            [
                1617,
                1619
            ],
            [
                1619,
                1667
            ],
            [
                1668,
                1685
            ],
            [
                1686,
                1702
            ],
            [
                1710,
                1712
            ],
            [
                1712,
                1763
            ],
            [
                1769,
                1794
            ],
            [
                1794,
                1797
            ],
            [
                1798,
                1848
            ],
            [
                1849,
                1862
            ],
            [
                1872,
                1878
            ],
            [
                1882,
                1892
            ],
            [
                1902,
                1913
            ],
            [
                1916,
                1952
            ],
            [
                1953,
                1996
            ],
            [
                1998,
                2009
            ],
            [
                2014,
                2041
            ],
            [
                2042,
                2289
            ],
            [
                2295,
                2306
            ],
            [
                2313,
                2327
            ],
            [
                2328,
                2351
            ],
            [
                2351,
                2378
            ],
            [
                2385,
                2411
            ],
            [
                2412,
                2434
            ],
            [
                2435,
                2495
            ],
            [
                2505,
                2517
            ],
            [
                2517,
                2525
            ],
            [
                2526,
                2566
            ],
            [
                2566,
                2573
            ],
            [
                2574,
                2588
            ],
            [
                2599,
                2707
            ],
            [
                2707,
                2744
            ],
            [
                2745,
                2822
            ],
            [
                2822,
                2841
            ],
            [
                2841,
                2842
            ],
            [
                2843,
                2884
            ],
            [
                2885,
                2888
            ],
            [
                2889,
                2896
            ],
            [
                2897,
                2964
            ],
            [
                2979,
                3026
            ],
            [
                3060,
                3064
            ],
            [
                3065,
                3072
            ],
            [
                3074,
                3099
            ],
            [
                3105,
                3190
            ],
            [
                3190,
                3192
            ],
            [
                3192,
                3292
            ],
            [
                3298,
                3313
            ],
            [
                3313,
                3316
            ],
            [
                3317,
                3319
            ],
            [
                3332,
                3341
            ],
            [
                3345,
                3348
            ],
            [
                3349,
                3355
            ],
            [
                3355,
                3356
            ],
            [
                3357,
                3360
            ],
            [
                3361,
                3386
            ],
            [
                3387,
                3406
            ],
            [
                3406,
                3417
            ],
            [
                3418,
                3433
            ],
            [
                3434,
                3476
            ],
            [
                3476,
                3533
            ],
            [
                3533,
                3546
            ],
            [
                3547,
                3567
            ],
            [
                3577,
                3597
            ],
            [
                3597,
                3621
            ],
            [
                3622,
                3670
            ],
            [
                3671,
                3738
            ],
            [
                3747,
                3755
            ],
            [
                3756,
                3808
            ],
            [
                3825,
                3860
            ],
            [
                3868,
                3941
            ],
            [
                3941,
                3943
            ],
            [
                3943,
                3948
            ],
            [
                3949,
                3958
            ],
            [
                3958,
                3962
            ],
            [
                3963,
                4009
            ],
            [
                4010,
                4012
            ],
            [
                4025,
                4036
            ],
            [
                4036,
                4075
            ],
            [
                4075,
                4098
            ],
            [
                4099,
                4126
            ],
            [
                4126,
                4127
            ],
            [
                4128,
                4187
            ],
            [
                4187,
                4193
            ],
            [
                4194,
                4224
            ],
            [
                4225,
                4228
            ],
            [
                4229,
                4235
            ],
            [
                4236,
                4248
            ],
            [
                4249,
                4262
            ],
            [
                4263,
                4270
            ],
            [
                4271,
                4273
            ],
            [
                4274,
                4297
            ],
            [
                4297,
                4449
            ],
            [
                4449,
                4451
            ],
            [
                4485,
                4488
            ],
            [
                4523,
                4524
            ],
            [
                4556,
                4558
            ],
            [
                4558,
                4569
            ],
            [
                4578,
                4582
            ],
            [
                4594,
                4657
            ],
            [
                4658,
                4673
            ],
            [
                4673,
                4735
            ],
            [
                4743,
                4773
            ],
            [
                4782,
                4806
            ],
            [
                4812,
                4821
            ],
            [
                4824,
                4836
            ],
            [
                4836,
                4838
            ],
            [
                4843,
                4864
            ],
            [
                4872,
                4873
            ],
            [
                4881,
                4924
            ],
            [
                4925,
                4928
            ],
            [
                4941,
                4942
            ],
            [
                4943,
                4954
            ],
            [
                4955,
                4973
            ],
            [
                4974,
                4977
            ],
            [
                4983,
                5003
            ],
            [
                5003,
                5066
            ],
            [
                5066,
                5067
            ],
            [
                5068,
                5072
            ],
            [
                5077,
                5083
            ],
            [
                5084,
                5113
            ],
            [
                5121,
                5126
            ],
            [
                5126,
                5128
            ],
            [
                5128,
                5130
            ],
            [
                5131,
                5147
            ],
            [
                5148,
                5187
            ],
            [
                5188,
                5193
            ],
            [
                5194,
                5221
            ],
            [
                5231,
                5233
            ],
            [
                5233,
                5268
            ],
            [
                5269,
                5299
            ],
            [
                5299,
                5301
            ],
            [
                5301,
                5366
            ],
            [
                5367,
                5513
            ],
            [
                5513,
                5515
            ],
            [
                5515,
                5531
            ],
            [
                5532,
                5537
            ],
            [
                5538,
                5541
            ],
            [
                5549,
                5552
            ],
            [
                5553,
                5573
            ],
            [
                5573,
                5575
            ],
            [
                5579,
                5635
            ],
            [
                5636,
                5700
            ],
            [
                5701,
                5721
            ],
            [
                5726,
                5732
            ],
            [
                5733,
                5735
            ],
            [
                5736,
                5810
            ],
            [
                5812,
                5884
            ],
            [
                5886,
                6005
            ],
            [
                6006,
                6020
            ],
            [
                6021,
                6063
            ],
            [
                6063,
                6065
            ],
            [
                6065,
                6096
            ],
            [
                6097,
                6174
            ],
            [
                6177,
                6186
            ],
            [
                6189,
                6198
            ],
            [
                6199,
                6209
            ],
            [
                6210,
                6244
            ],
            [
                6244,
                6268
            ],
            [
                6269,
                6281
            ],
            [
                6282,
                6292
            ],
            [
                6295,
                6303
            ],
            [
                6303,
                6321
            ],
            [
                6327,
                6348
            ],
            [
                6349,
                6350
            ],
            [
                6357,
                6445
            ],
            [
                6446,
                6457
            ],
            [
                6467,
                6473
            ],
            [
                6473,
                6483
            ],
            [
                6484,
                6488
            ],
            [
                6492,
                6495
            ],
            [
                6496,
                6528
            ],
            [
                6529,
                6533
            ],
            [
                6535,
                6548
            ],
            [
                6552,
                6561
            ],
            [
                6562,
                6611
            ],
            [
                6612,
                6622
            ],
            [
                6623,
                6630
            ],
            [
                6631,
                6654
            ],
            [
                6654,
                6703
            ],
            [
                6703,
                6838
            ],
            [
                6838,
                6970
            ],
            [
                6976,
                6979
            ],
            [
                6979,
                7012
            ],
            [
                7012,
                7014
            ],
            [
                7014,
                7017
            ],
            [
                7022,
                7032
            ],
            [
                7060,
                7075
            ],
            [
                7084,
                7113
            ],
            [
                7121,
                7178
            ],
            [
                7179,
                7193
            ],
            [
                7196,
                7201
            ],
            [
                7201,
                7203
            ],
            [
                7203,
                7296
            ],
            [
                7296,
                7298
            ],
            [
                7298,
                7302
            ],
            [
                7303,
                7332
            ],
            [
                7333,
                7334
            ],
            [
                7335,
                7360
            ],
            [
                7360,
                7394
            ],
            [
                7396,
                7447
            ],
            [
                7447,
                7483
            ],
            [
                7484,
                7493
            ],
            [
                7502,
                7534
            ],
            [
                7535,
                7578
            ],
            [
                7578,
                7628
            ],
            [
                7629,
                7635
            ],
            [
                7636,
                7677
            ],
            [
                7681,
                7707
            ],
            [
                7708,
                7709
            ],
            [
                7710,
                7724
            ],
            [
                7724,
                7757
            ],
            [
                7758,
                7779
            ],
            [
                7779,
                7803
            ],
            [
                7804,
                7817
            ],
            [
                7818,
                7824
            ],
            [
                7825,
                7833
            ],
            [
                7834,
                7835
            ],
            [
                7836,
                7839
            ],
            [
                7840,
                7883
            ],
            [
                7883,
                7897
            ],
            [
                7897,
                7911
            ]
        ],
        "row_chars": [
            [
                0,
                58
            ],
            [
                58,
                405
            ],
            [
                405,
                456
            ],
            [
                456,
                500
            ],
            [
                500,
                609
            ],
            [
                609,
                834
            ],
            [
                834,
                834
            ],
            [
                834,
                857
            ],
            [
                857,
                910
            ],
            [
                910,
                1070
            ],
            [
                1070,
                1175
            ],
            [
                1175,
                1375
            ],
            [
                1375,
                1577
            ],
            [
                1577,
                1577
            ],
            [
                1577,
                1619
            ],
            [
                1619,
                1712
            ],
            [
                1712,
                1794
            ],
            [
                1794,
                1849
            ],
            [
                1849,
                1878
            ],
            [
                1878,
                1998
            ],
            [
                1998,
                2351
            ],
            [
                2351,
                2517
            ],
            [
                2517,
                2566
            ],
            [
                2566,
                2707
            ],
            [
                2707,
                2822
            ],
            [
                2822,
                3026
            ],
            [
                3026,
                3026
            ],
            [
                3026,
                3192
            ],
            [
                3192,
                3313
            ],
            [
                3313,
                3406
            ],
            [
                3406,
                3533
            ],
            [
                3533,
                3756
            ],
            [
                3756,
                3756
            ],
            [
                3756,
                3943
            ],
            [
                3943,
                4075
            ],
            [
                4075,
                4187
            ],
            [
                4187,
                4297
            ],
            [
                4297,
                4297
            ],
            [
                4297,
                4297
            ],
            [
                4297,
                4297
            ],
            [
                4297,
                4451
            ],
            [
                4451,
                4558
            ],
            [
                4558,
                4673
            ],
            [
                4673,
                4874
            ],
            [
                4874,
                5128
            ],
            [
                5128,
                5233
            ],
            [
                5233,
                5301
            ],
            [
                5301,
                5515
            ],
            [
                5515,
                5575
            ],
            [
                5575,
                5701
            ],
            [
                5701,
                5701
            ],
            [
                5701,
                6065
            ],
            [
                6065,
                6175
            ],
            [
                6175,
                6175
            ],
            [
                6175,
                6244
            ],
            [
                6244,
                6446
            ],
            [
                6446,
                6446
            ],
            [
                6446,
                6446
            ],
            [
                6446,
                6446
            ],
            [
                6446,
                6473
            ],
            [
                6473,
                6654
            ],
            [
                6654,
                6703
            ],
            [
                6703,
                6838
            ],
            [
                6838,
                7014
            ],
            [
                7014,
                7203
            ],
            [
                7203,
                7298
            ],
            [
                7298,
                7360
            ],
            [
                7360,
                7447
            ],
            [
                7447,
                7447
            ],
            [
                7447,
                7447
            ],
            [
                7447,
                7447
            ],
            [
                7447,
                7447
            ],
            [
                7447,
                7447
            ],
            [
                7447,
                7578
            ],
            [
                7578,
                7578
            ],
            [
                7578,
                7677
            ],
            [
                7677,
                7677
            ],
            [
                7677,
                7758
            ],
            [
                7758,
                7758
            ],
            [
                7758,
                7758
            ],
            [
                7758,
                7758
            ],
            [
                7758,
                7779
            ],
            [
                7779,
                7883
            ],
            [
                7883,
                7897
            ],
            [
                7897,
                7911
            ]
        ]
    }
}