{
    "original": {
        "text": "Whether or no, she, whom you are to forgive, if you can, did or did not belong to the Upper Ten Thousand of this our English world, I am not prepared to say with any strength of affirmation. By blood she was connected with big people,--distantly connected with some very big people indeed, people who belonged to the Upper Ten Hundred if there be any such division; but of these very big relations she had known and seen little, and they had cared as little for her. Her grandfather, Squire Vavasor of Vavasor Hall, in Westmoreland, was a country gentleman, possessing some thousand a year at the outside, and he therefore never came up to London, and had no ambition to have himself numbered as one in any exclusive set. A hot-headed, ignorant, honest old gentleman, he lived ever at Vavasor Hall, declaring to any who would listen to him, that the country was going to the mischief, and congratulating himself that at any rate, in his county, parliamentary reform had been powerless to alter the old political arrangements. Alice Vavasor, whose offence against the world I am to tell you, and if possible to excuse, was the daughter of his younger son; and as her father, John Vavasor, had done nothing to raise the family name to eminence, Alice could not lay claim to any high position from her birth as a Vavasor. John Vavasor had come up to London early in life as a barrister, and had failed. He had failed at least in attaining either much wealth or much repute, though he had succeeded in earning, or perhaps I might better say, in obtaining, a livelihood. He had married a lady somewhat older than himself, who was in possession of four hundred a year, and who was related to those big people to whom I have alluded. Who these were and the special nature of the relationship, I shall be called upon to explain hereafter, but at present it will suffice to say that Alice Macleod gave great offence to all her friends by her marriage. She did not, however, give them much time for the indulgence of their anger. Having given birth to a daughter within twelve months of her marriage, she died, leaving in abeyance that question as to whether the fault of her marriage should or should not be pardoned by her family.\nWhen a man marries an heiress for her money, if that money be within her own control, as was the case with Miss Macleod's fortune, it is generally well for the speculating lover that the lady's friends should quarrel with him and with her. She is thereby driven to throw herself entirely into the gentleman's arms, and he thus becomes possessed of the wife and the money without the abominable nuisance of stringent settlements. But the Macleods, though they quarrelled with Alice, did not quarrel with her _ l'outrance_. They snubbed herself and her chosen husband; but they did not so far separate themselves from her and her affairs as to give up the charge of her possessions. Her four hundred a year was settled very closely on herself and on her children, without even a life interest having been given to Mr. Vavasor, and therefore when she died the mother's fortune became the property of the little baby. But, under these circumstances, the big people did not refuse to interest themselves to some extent on behalf of the father. I do not suppose that any actual agreement or compact was made between Mr. Vavasor and the Macleods; but it came to be understood between them that if he made no demand upon them for his daughter's money, and allowed them to have charge of her education, they would do something for him. He was a practising barrister, though his practice had never amounted to much; and a practising barrister is always supposed to be capable of filling any situation which may come his way. Two years after his wife's death Mr. Vavasor was appointed assistant commissioner in some office which had to do with insolvents, and which was abolished three years after his appointment. It was at first thought that he would keep his eight hundred a year for life and be required to do nothing for it; but a wretched cheeseparing Whig government, as John Vavasor called it when describing the circumstances of the arrangement to his father, down in Westmoreland, would not permit this; it gave him the option of taking four hundred a year for doing nothing, or of keeping his whole income and attending three days a week for three hours a day during term time, at a miserable dingy little office near Chancery Lane, where his duty would consist in signing his name to accounts which he never read, and at which he was never supposed even to look. He had sulkily elected to keep the money, and this signing had been now for nearly twenty years the business of his life. Of course he considered himself to be a very hardly-used man. One Lord Chancellor after another he petitioned, begging that he might be relieved from the cruelty of his position, and allowed to take his salary without doing anything in return for it. The amount of work which he did perform was certainly a minimum of labour. Term time, as terms were counted in Mr. Vavasor's office, hardly comprised half the year, and the hours of weekly attendance did not do more than make one day's work a week for a working man; but Mr. Vavasor had been appointed an assistant commissioner, and with every Lord Chancellor he argued that all Westminster Hall, and Lincoln's Inn to boot, had no right to call upon him to degrade himself by signing his name to accounts. In answer to every memorial he was offered the alternative of freedom with half his income; and so the thing went on.\nThere can, however, be no doubt that Mr. Vavasor was better off and happier with his almost nominal employment than he would have been without it. He always argued that it kept him in London; but he would undoubtedly have lived in London with or without his official occupation. He had become so habituated to London life in a small way, before the choice of leaving London was open to him, that nothing would have kept him long away from it. After his wife's death he dined at his club every day on which a dinner was not given to him by some friend elsewhere, and was rarely happy except when so dining. They who have seen him scanning the steward's list of dishes, and giving the necessary orders for his own and his friend's dinner, at about half past four in the afternoon, have seen John Vavasor at the only moment of the day at which he is ever much in earnest. All other things are light and easy to him,--to be taken easily and to be dismissed easily. Even the eating of the dinner calls forth from him no special sign of energy. Sometimes a frown will gather on his brow as he tastes the first half glass from his bottle of claret; but as a rule that which he has prepared for himself with so much elaborate care, is consumed with only pleasant enjoyment. Now and again it will happen that the cook is treacherous even to him, and then he can hit hard; but in hitting he is quiet, and strikes with a smile on his face.\nSuch had been Mr. Vavasor's pursuits and pleasures in life up to the time at which my story commences. But I must not allow the reader to suppose that he was a man without good qualities. Had he when young possessed the gift of industry I think that he might have shone in his profession, and have been well spoken of and esteemed in the world. As it was he was a discontented man, but nevertheless he was popular, and to some extent esteemed. He was liberal as far as his means would permit; he was a man of his word; and he understood well that code of by-laws which was presumed to constitute the character of a gentleman in his circle. He knew how to carry himself well among men, and understood thoroughly what might be said, and what might not; what might be done among those with whom he lived, and what should be left undone. By nature, too, he was kindly disposed, loving many persons a little if he loved few or none passionately. Moreover, at the age of fifty, he was a handsome man, with a fine forehead, round which the hair and beard was only beginning to show itself to be grey. He stood well, with a large person, only now beginning to become corpulent. His eyes were bright and grey, and his mouth and chin were sharply cut, and told of gentle birth. Most men who knew John Vavasor well, declared it to be a pity that he should spend his time in signing accounts in Chancery Lane.\nI have said that Alice Vavasor's big relatives cared but little for her in her early years; but I have also said that they were careful to undertake the charge of her education, and I must explain away this little discrepancy. The biggest of these big people had hardly heard of her; but there was a certain Lady Macleod, not very big herself, but, as it were, hanging on to the skirts of those who were so, who cared very much for Alice. She was the widow of a Sir Archibald Macleod, K.C.B., who had been a soldier, she herself having also been a Macleod by birth; and for very many years past--from a time previous to the birth of Alice Vavasor--she had lived at Cheltenham, making short sojourns in London during the spring, when the contents of her limited purse would admit of her doing so. Of old Lady Macleod I think I may say that she was a good woman;--that she was a good woman, though subject to two of the most serious drawbacks to goodness which can afflict a lady. She was a Calvinistic Sabbatarian in religion, and in worldly matters she was a devout believer in the high rank of her noble relatives. She could almost worship a youthful marquis, though he lived a life that would disgrace a heathen among heathens; and she could and did, in her own mind, condemn crowds of commonplace men and women to all eternal torments of which her imagination could conceive, because they listened to profane music in a park on Sunday. Yet she was a good woman. Out of her small means she gave much away. She owed no man anything. She strove to love her neighbours. She bore much pain with calm unspeaking endurance, and she lived in trust of a better world. Alice Vavasor, who was after all only her cousin, she loved with an exceeding love, and yet Alice had done very much to extinguish such love. Alice, in the years of her childhood, had been brought up by Lady Macleod; at the age of twelve she had been sent to a school at Aix-la-Chapelle,--a comitatus of her relatives having agreed that such was to be her fate, much in opposition to Lady Macleod's judgement; at nineteen she had returned to Cheltenham, and after remaining there for little more than a year, had expressed her unwillingness to remain longer with her cousin. She could sympathize neither with her relative's faults or virtues. She made an arrangement, therefore, with her father, that they two would keep house together in London, and so they had lived for the last five years;--for Alice Vavasor when she will be introduced to the reader had already passed her twenty-fourth birthday.\nTheir mode of life had been singular and certainly not in all respects satisfactory. Alice when she was twenty-one had the full command of her own fortune; and when she induced her father, who for the last fifteen years had lived in lodgings, to take a small house in Queen Anne Street, of course she offered to incur a portion of the expense. He had warned her that his habits were not those of a domestic man, but he had been content simply so to warn her. He had not felt it to be his duty to decline the arrangement because he knew himself to be unable to give to his child all that attention which a widowed father under such circumstances should pay to an only daughter. The house had been taken, and Alice and he had lived together, but their lives had been quite apart. For a short time, for a month or two, he had striven to dine at home and even to remain at home through the evening; but the work had been too hard for him and he had utterly broken down. He had said to her and to himself that his health would fail him under the effects of so great a change made so late in life, and I am not sure that he had not spoken truly. At any rate the effort had been abandoned, and Mr. Vavasor now never dined at home. Nor did he and his daughter ever dine out together. Their joint means did not admit of their giving dinners, and therefore they could not make their joint way in the same circle. It thus came to pass that they lived apart,--quite apart. They saw each other, probably daily; but they did little more than see each other. They did not even breakfast together, and after three o'clock in the day Mr. Vavasor was never to be found in his own house.\nMiss Vavasor had made for herself a certain footing in society, though I am disposed to doubt her right to be considered as holding a place among the Upper Ten Thousand. Two classes of people she had chosen to avoid, having been driven to such avoidings by her aunt's preferences; marquises and such-like, whether wicked or otherwise, she had eschewed, and had eschewed likewise all Low Church tendencies. The eschewing of marquises is not generally very difficult. Young ladies living with their fathers on very moderate incomes in or about Queen Anne Street are not usually much troubled on that matter. Nor can I say that Miss Vavasor was so troubled. But with her there was a certain definite thing to be done towards such eschewal. Lady Macleod by no means avoided her noble relatives, nor did she at all avoid Alice Vavasor. When in London she was persevering in her visits to Queen Anne Street, though she considered herself, nobody knew why, not to be on speaking terms with Mr. Vavasor. And she strove hard to produce an intimacy between Alice and her noble relatives--such an intimacy as that which she herself enjoyed;--an intimacy which gave her a footing in their houses but no footing in their hearts, or even in their habits. But all this Alice declined with as much consistency as she did those other struggles which her old cousin made on her behalf,--strong, never-flagging, but ever-failing efforts to induce the girl to go to such places of worship as Lady Macleod herself frequented.\nA few words must be said as to Alice Vavasor's person; one fact also must be told, and then, I believe, I may start upon my story. As regards her character, I will leave it to be read in the story itself. The reader already knows that she appears upon the scene at no very early age, and the mode of her life had perhaps given to her an appearance of more years than those which she really possessed. It was not that her face was old, but that there was nothing that was girlish in her manners. Her demeanour was as staid, and her voice as self-possessed as though she had already been ten years married. In person she was tall and well made, rather large in her neck and shoulders, as were all the Vavasors, but by no means fat. Her hair was brown, but very dark, and she wore it rather lower upon her forehead than is customary at the present day. Her eyes, too, were dark, though they were not black, and her complexion, though not quite that of a brunette, was far away from being fair. Her nose was somewhat broad, and _retrouss_ too, but to my thinking it was a charming nose, full of character, and giving to her face at times a look of pleasant humour, which it would otherwise have lacked. Her mouth was large, and full of character, and her chin oval, dimpled, and finely chiselled, like her father's. I beg you, in taking her for all in all, to admit that she was a fine, handsome, high-spirited young woman.\nAnd now for my fact. At the time of which I am writing she was already engaged to be married.",
        "paragraph_chars": [
            [
                0,
                2223
            ],
            [
                2223,
                5584
            ],
            [
                5584,
                7013
            ],
            [
                7013,
                8411
            ],
            [
                8411,
                10975
            ],
            [
                10975,
                12644
            ],
            [
                12644,
                14149
            ],
            [
                14149,
                15569
            ],
            [
                15569,
                15662
            ]
        ],
        "segment_chars": [
            [
                0,
                191
            ],
            [
                191,
                467
            ],
            [
                467,
                722
            ],
            [
                722,
                1026
            ],
            [
                1026,
                1319
            ],
            [
                1319,
                1400
            ],
            [
                1400,
                1566
            ],
            [
                1566,
                1727
            ],
            [
                1727,
                1943
            ],
            [
                1943,
                2020
            ],
            [
                2020,
                2223
            ],
            [
                2223,
                2463
            ],
            [
                2463,
                2652
            ],
            [
                2652,
                2745
            ],
            [
                2745,
                2904
            ],
            [
                2904,
                3137
            ],
            [
                3137,
                3262
            ],
            [
                3262,
                3550
            ],
            [
                3550,
                3738
            ],
            [
                3738,
                3927
            ],
            [
                3927,
                4587
            ],
            [
                4587,
                4709
            ],
            [
                4709,
                4771
            ],
            [
                4771,
                4960
            ],
            [
                4960,
                5035
            ],
            [
                5035,
                5466
            ],
            [
                5466,
                5584
            ],
            [
                5584,
                5731
            ],
            [
                5731,
                5863
            ],
            [
                5863,
                6027
            ],
            [
                6027,
                6190
            ],
            [
                6190,
                6453
            ],
            [
                6453,
                6545
            ],
            [
                6545,
                6623
            ],
            [
                6623,
                6850
            ],
            [
                6850,
                7013
            ],
            [
                7013,
                7116
            ],
            [
                7116,
                7201
            ],
            [
                7201,
                7358
            ],
            [
                7358,
                7457
            ],
            [
                7457,
                7653
            ],
            [
                7653,
                7847
            ],
            [
                7847,
                7954
            ],
            [
                7954,
                8107
            ],
            [
                8107,
                8183
            ],
            [
                8183,
                8281
            ],
            [
                8281,
                8411
            ],
            [
                8411,
                8638
            ],
            [
                8638,
                8850
            ],
            [
                8850,
                9207
            ],
            [
                9207,
                9390
            ],
            [
                9390,
                9527
            ],
            [
                9527,
                9850
            ],
            [
                9850,
                9876
            ],
            [
                9876,
                9919
            ],
            [
                9919,
                9945
            ],
            [
                9945,
                9980
            ],
            [
                9980,
                10073
            ],
            [
                10073,
                10215
            ],
            [
                10215,
                10648
            ],
            [
                10648,
                10716
            ],
            [
                10716,
                10975
            ],
            [
                10975,
                11060
            ],
            [
                11060,
                11319
            ],
            [
                11319,
                11434
            ],
            [
                11434,
                11652
            ],
            [
                11652,
                11753
            ],
            [
                11753,
                11941
            ],
            [
                11941,
                12115
            ],
            [
                12115,
                12199
            ],
            [
                12199,
                12251
            ],
            [
                12251,
                12378
            ],
            [
                12378,
                12436
            ],
            [
                12436,
                12519
            ],
            [
                12519,
                12644
            ],
            [
                12644,
                12814
            ],
            [
                12814,
                13050
            ],
            [
                13050,
                13110
            ],
            [
                13110,
                13250
            ],
            [
                13250,
                13299
            ],
            [
                13299,
                13381
            ],
            [
                13381,
                13475
            ],
            [
                13475,
                13640
            ],
            [
                13640,
                13885
            ],
            [
                13885,
                14149
            ],
            [
                14149,
                14280
            ],
            [
                14280,
                14354
            ],
            [
                14354,
                14550
            ],
            [
                14550,
                14644
            ],
            [
                14644,
                14754
            ],
            [
                14754,
                14879
            ],
            [
                14879,
                14999
            ],
            [
                14999,
                15140
            ],
            [
                15140,
                15348
            ],
            [
                15348,
                15461
            ],
            [
                15461,
                15569
            ],
            [
                15569,
                15590
            ],
            [
                15590,
                15662
            ]
        ],
        "overlap_chars": [
            [
                57,
                60
            ],
            [
                15,
                18
            ],
            [
                25,
                55
            ],
            [
                72,
                104
            ],
            [
                105,
                107
            ],
            [
                132,
                133
            ],
            [
                153,
                156
            ],
            [
                189,
                191
            ],
            [
                191,
                207
            ],
            [
                246,
                288
            ],
            [
                364,
                369
            ],
            [
                398,
                427
            ],
            [
                370,
                378
            ],
            [
                388,
                397
            ],
            [
                465,
                466
            ],
            [
                467,
                523
            ],
            [
                527,
                557
            ],
            [
                574,
                582
            ],
            [
                583,
                592
            ],
            [
                720,
                722
            ],
            [
                722,
                770
            ],
            [
                833,
                835
            ],
            [
                839,
                840
            ],
            [
                771,
                776
            ],
            [
                782,
                832
            ],
            [
                841,
                874
            ],
            [
                883,
                916
            ],
            [
                930,
                943
            ],
            [
                917,
                919
            ],
            [
                928,
                929
            ],
            [
                966,
                974
            ],
            [
                945,
                965
            ],
            [
                1024,
                1025
            ],
            [
                1026,
                1054
            ],
            [
                1073,
                1153
            ],
            [
                1317,
                1319
            ],
            [
                1469,
                1470
            ],
            [
                1319,
                1331
            ],
            [
                1505,
                1506
            ],
            [
                1332,
                1335
            ],
            [
                1371,
                1372
            ],
            [
                1347,
                1353
            ],
            [
                1373,
                1382
            ],
            [
                1354,
                1367
            ],
            [
                1382,
                1398
            ],
            [
                1344,
                1346
            ],
            [
                1443,
                1454
            ],
            [
                1536,
                1537
            ],
            [
                1400,
                1402
            ],
            [
                1552,
                1564
            ],
            [
                1564,
                1566
            ],
            [
                1566,
                1620
            ],
            [
                1642,
                1654
            ],
            [
                1655,
                1727
            ],
            [
                1727,
                1741
            ],
            [
                1784,
                1793
            ],
            [
                1812,
                1819
            ],
            [
                1829,
                1909
            ],
            [
                1914,
                1917
            ],
            [
                1926,
                1943
            ],
            [
                1943,
                1984
            ],
            [
                2138,
                2140
            ],
            [
                2007,
                2018
            ],
            [
                2099,
                2100
            ],
            [
                1985,
                1988
            ],
            [
                2033,
                2052
            ],
            [
                2089,
                2099
            ],
            [
                2221,
                2223
            ],
            [
                2652,
                2668
            ],
            [
                2705,
                2712
            ],
            [
                2745,
                2757
            ],
            [
                2766,
                2769
            ],
            [
                2859,
                2861
            ],
            [
                2788,
                2806
            ],
            [
                2865,
                2890
            ],
            [
                2902,
                2904
            ],
            [
                2904,
                2955
            ],
            [
                2964,
                2992
            ],
            [
                3032,
                3047
            ],
            [
                3062,
                3075
            ],
            [
                3089,
                3119
            ],
            [
                3131,
                3135
            ],
            [
                3135,
                3136
            ],
            [
                3167,
                3183
            ],
            [
                3225,
                3229
            ],
            [
                3199,
                3201
            ],
            [
                3250,
                3262
            ],
            [
                3367,
                3369
            ],
            [
                3316,
                3319
            ],
            [
                3381,
                3550
            ],
            [
                3771,
                3796
            ],
            [
                3823,
                3834
            ],
            [
                3845,
                3867
            ],
            [
                3835,
                3840
            ],
            [
                3868,
                3903
            ],
            [
                3925,
                3926
            ],
            [
                3934,
                3942
            ],
            [
                4090,
                4102
            ],
            [
                3943,
                4007
            ],
            [
                4020,
                4089
            ],
            [
                4551,
                4553
            ],
            [
                4103,
                4112
            ],
            [
                4201,
                4224
            ],
            [
                4226,
                4311
            ],
            [
                4129,
                4132
            ],
            [
                4316,
                4321
            ],
            [
                4343,
                4360
            ],
            [
                4179,
                4180
            ],
            [
                4361,
                4382
            ],
            [
                4399,
                4400
            ],
            [
                4166,
                4168
            ],
            [
                4404,
                4536
            ],
            [
                4585,
                4587
            ],
            [
                4587,
                4601
            ],
            [
                4610,
                4654
            ],
            [
                4699,
                4702
            ],
            [
                4659,
                4682
            ],
            [
                4707,
                4708
            ],
            [
                4719,
                4753
            ],
            [
                4760,
                4771
            ],
            [
                5593,
                5594
            ],
            [
                5584,
                5593
            ],
            [
                5604,
                5620
            ],
            [
                5633,
                5668
            ],
            [
                5684,
                5731
            ],
            [
                5863,
                5876
            ],
            [
                5891,
                5905
            ],
            [
                6025,
                6027
            ],
            [
                6027,
                6080
            ],
            [
                6144,
                6149
            ],
            [
                6099,
                6102
            ],
            [
                6174,
                6190
            ],
            [
                6389,
                6415
            ],
            [
                6425,
                6427
            ],
            [
                6431,
                6452
            ],
            [
                7120,
                7163
            ],
            [
                7185,
                7201
            ],
            [
                7205,
                7207
            ],
            [
                7201,
                7204
            ],
            [
                7311,
                7315
            ],
            [
                7213,
                7218
            ],
            [
                7263,
                7300
            ],
            [
                7356,
                7358
            ],
            [
                7428,
                7431
            ],
            [
                7368,
                7374
            ],
            [
                7377,
                7389
            ],
            [
                7393,
                7394
            ],
            [
                7412,
                7426
            ],
            [
                7455,
                7457
            ],
            [
                7457,
                7463
            ],
            [
                7472,
                7474
            ],
            [
                7479,
                7549
            ],
            [
                7609,
                7612
            ],
            [
                7560,
                7567
            ],
            [
                7628,
                7653
            ],
            [
                7847,
                7876
            ],
            [
                7885,
                7898
            ],
            [
                7907,
                7915
            ],
            [
                7916,
                7918
            ],
            [
                7935,
                7954
            ],
            [
                7964,
                7966
            ],
            [
                7978,
                7983
            ],
            [
                7985,
                7991
            ],
            [
                7992,
                8002
            ],
            [
                7962,
                7963
            ],
            [
                8003,
                8007
            ],
            [
                8046,
                8060
            ],
            [
                8065,
                8087
            ],
            [
                8101,
                8106
            ],
            [
                8428,
                8463
            ],
            [
                8468,
                8501
            ],
            [
                8587,
                8588
            ],
            [
                8529,
                8549
            ],
            [
                8564,
                8587
            ],
            [
                8593,
                8607
            ],
            [
                8613,
                8617
            ],
            [
                8636,
                8638
            ],
            [
                8699,
                8814
            ],
            [
                8817,
                8850
            ],
            [
                8850,
                8857
            ],
            [
                8871,
                8872
            ],
            [
                8862,
                8867
            ],
            [
                8894,
                8895
            ],
            [
                8904,
                8907
            ],
            [
                8981,
                8984
            ],
            [
                8990,
                9000
            ],
            [
                9063,
                9100
            ],
            [
                9110,
                9119
            ],
            [
                9139,
                9143
            ],
            [
                8928,
                8931
            ],
            [
                9205,
                9207
            ],
            [
                9210,
                9226
            ],
            [
                9282,
                9306
            ],
            [
                9398,
                9406
            ],
            [
                9435,
                9440
            ],
            [
                9468,
                9527
            ],
            [
                9527,
                9551
            ],
            [
                9749,
                9751
            ],
            [
                9606,
                9614
            ],
            [
                9570,
                9571
            ],
            [
                9645,
                9648
            ],
            [
                9689,
                9698
            ],
            [
                9711,
                9727
            ],
            [
                9732,
                9748
            ],
            [
                9788,
                9814
            ],
            [
                9823,
                9849
            ],
            [
                9850,
                9876
            ],
            [
                9876,
                9919
            ],
            [
                9945,
                9980
            ],
            [
                9980,
                10008
            ],
            [
                10020,
                10073
            ],
            [
                10123,
                10132
            ],
            [
                10111,
                10121
            ],
            [
                10073,
                10086
            ],
            [
                10155,
                10179
            ],
            [
                10185,
                10214
            ],
            [
                10215,
                10224
            ],
            [
                10238,
                10288
            ],
            [
                10290,
                10360
            ],
            [
                10457,
                10471
            ],
            [
                10481,
                10536
            ],
            [
                10547,
                10556
            ],
            [
                10574,
                10623
            ],
            [
                10624,
                10639
            ],
            [
                10646,
                10648
            ],
            [
                10716,
                10866
            ],
            [
                10868,
                10877
            ],
            [
                10917,
                10920
            ],
            [
                10951,
                10958
            ],
            [
                10973,
                10975
            ],
            [
                10975,
                10980
            ],
            [
                10986,
                11002
            ],
            [
                11012,
                11015
            ],
            [
                11026,
                11029
            ],
            [
                11046,
                11060
            ],
            [
                11079,
                11089
            ],
            [
                11060,
                11065
            ],
            [
                11111,
                11117
            ],
            [
                11122,
                11134
            ],
            [
                11152,
                11167
            ],
            [
                11195,
                11261
            ],
            [
                11168,
                11171
            ],
            [
                11272,
                11286
            ],
            [
                11303,
                11319
            ],
            [
                11434,
                11440
            ],
            [
                11503,
                11510
            ],
            [
                11441,
                11444
            ],
            [
                11535,
                11539
            ],
            [
                11543,
                11552
            ],
            [
                11479,
                11482
            ],
            [
                11562,
                11594
            ],
            [
                11620,
                11651
            ],
            [
                11652,
                11753
            ],
            [
                11771,
                11797
            ],
            [
                11806,
                11877
            ],
            [
                11883,
                11919
            ],
            [
                11928,
                11941
            ],
            [
                11941,
                11947
            ],
            [
                11956,
                11963
            ],
            [
                11967,
                12001
            ],
            [
                12090,
                12092
            ],
            [
                12045,
                12049
            ],
            [
                12027,
                12044
            ],
            [
                12050,
                12065
            ],
            [
                12113,
                12115
            ],
            [
                12127,
                12198
            ],
            [
                12199,
                12251
            ],
            [
                12322,
                12336
            ],
            [
                12299,
                12321
            ],
            [
                12273,
                12276
            ],
            [
                12358,
                12378
            ],
            [
                12436,
                12455
            ],
            [
                12466,
                12519
            ],
            [
                12519,
                12580
            ],
            [
                12592,
                12644
            ],
            [
                12644,
                12714
            ],
            [
                12784,
                12814
            ],
            [
                12901,
                12923
            ],
            [
                12840,
                12843
            ],
            [
                12873,
                12879
            ],
            [
                12851,
                12859
            ],
            [
                12859,
                12860
            ],
            [
                13023,
                13026
            ],
            [
                12829,
                12835
            ],
            [
                13048,
                13049
            ],
            [
                13433,
                13434
            ],
            [
                13386,
                13393
            ],
            [
                13439,
                13442
            ],
            [
                13454,
                13475
            ],
            [
                13475,
                13493
            ],
            [
                13510,
                13512
            ],
            [
                13527,
                13545
            ],
            [
                13546,
                13556
            ],
            [
                13494,
                13497
            ],
            [
                13594,
                13597
            ],
            [
                13604,
                13640
            ],
            [
                13640,
                13647
            ],
            [
                13655,
                13662
            ],
            [
                13671,
                13720
            ],
            [
                13727,
                13738
            ],
            [
                13722,
                13726
            ],
            [
                13739,
                13772
            ],
            [
                13858,
                13859
            ],
            [
                13787,
                13834
            ],
            [
                13843,
                13858
            ],
            [
                13883,
                13885
            ],
            [
                13885,
                13912
            ],
            [
                14147,
                14149
            ],
            [
                14149,
                14173
            ],
            [
                14180,
                14195
            ],
            [
                14202,
                14240
            ],
            [
                14253,
                14264
            ],
            [
                14270,
                14280
            ],
            [
                14280,
                14282
            ],
            [
                14291,
                14353
            ],
            [
                14593,
                14610
            ],
            [
                14620,
                14644
            ],
            [
                14714,
                14717
            ],
            [
                14665,
                14670
            ],
            [
                14672,
                14675
            ],
            [
                14689,
                14703
            ],
            [
                14752,
                14754
            ],
            [
                14764,
                14790
            ],
            [
                14856,
                14879
            ],
            [
                14879,
                14887
            ],
            [
                14914,
                14917
            ],
            [
                14999,
                15007
            ],
            [
                15014,
                15023
            ],
            [
                14892,
                14897
            ],
            [
                15053,
                15071
            ],
            [
                14888,
                14891
            ],
            [
                14908,
                14912
            ],
            [
                15138,
                15140
            ],
            [
                15140,
                15167
            ],
            [
                15169,
                15172
            ],
            [
                15174,
                15182
            ],
            [
                15187,
                15192
            ],
            [
                15215,
                15261
            ],
            [
                15265,
                15273
            ],
            [
                15283,
                15308
            ],
            [
                15310,
                15348
            ],
            [
                15348,
                15372
            ],
            [
                15396,
                15404
            ],
            [
                15424,
                15461
            ],
            [
                15490,
                15501
            ],
            [
                15516,
                15569
            ],
            [
                15569,
                15590
            ],
            [
                15590,
                15662
            ]
        ],
        "row_chars": [
            [
                0,
                191
            ],
            [
                191,
                467
            ],
            [
                467,
                722
            ],
            [
                722,
                1026
            ],
            [
                1026,
                1319
            ],
            [
                1319,
                1566
            ],
            [
                1566,
                1727
            ],
            [
                1727,
                1943
            ],
            [
                1943,
                2223
            ],
            [
                2223,
                2463
            ],
            [
                2463,
                2652
            ],
            [
                2652,
                2745
            ],
            [
                2745,
                2904
            ],
            [
                2904,
                3137
            ],
            [
                3137,
                3262
            ],
            [
                3262,
                3550
            ],
            [
                3550,
                3738
            ],
            [
                3738,
                3927
            ],
            [
                3927,
                4587
            ],
            [
                4587,
                4709
            ],
            [
                4709,
                4771
            ],
            [
                4771,
                4960
            ],
            [
                4960,
                5035
            ],
            [
                5035,
                5466
            ],
            [
                5466,
                5584
            ],
            [
                5584,
                5731
            ],
            [
                5731,
                5863
            ],
            [
                5863,
                6027
            ],
            [
                6027,
                6190
            ],
            [
                6190,
                6453
            ],
            [
                6453,
                6545
            ],
            [
                6545,
                6623
            ],
            [
                6623,
                6850
            ],
            [
                6850,
                7013
            ],
            [
                7013,
                7116
            ],
            [
                7116,
                7201
            ],
            [
                7201,
                7358
            ],
            [
                7358,
                7457
            ],
            [
                7457,
                7653
            ],
            [
                7653,
                7847
            ],
            [
                7847,
                7954
            ],
            [
                7954,
                8107
            ],
            [
                8107,
                8183
            ],
            [
                8183,
                8281
            ],
            [
                8281,
                8411
            ],
            [
                8411,
                8638
            ],
            [
                8638,
                8850
            ],
            [
                8850,
                9207
            ],
            [
                9207,
                9527
            ],
            [
                9527,
                9850
            ],
            [
                9850,
                9876
            ],
            [
                9876,
                9919
            ],
            [
                9919,
                9945
            ],
            [
                9945,
                9980
            ],
            [
                9980,
                10073
            ],
            [
                10073,
                10215
            ],
            [
                10215,
                10648
            ],
            [
                10648,
                10716
            ],
            [
                10716,
                10975
            ],
            [
                10975,
                11060
            ],
            [
                11060,
                11319
            ],
            [
                11319,
                11434
            ],
            [
                11434,
                11652
            ],
            [
                11652,
                11753
            ],
            [
                11753,
                11941
            ],
            [
                11941,
                12115
            ],
            [
                12115,
                12199
            ],
            [
                12199,
                12251
            ],
            [
                12251,
                12378
            ],
            [
                12378,
                12436
            ],
            [
                12436,
                12519
            ],
            [
                12519,
                12644
            ],
            [
                12644,
                12814
            ],
            [
                12814,
                13050
            ],
            [
                13050,
                13110
            ],
            [
                13110,
                13250
            ],
            [
                13250,
                13299
            ],
            [
                13299,
                13381
            ],
            [
                13381,
                13475
            ],
            [
                13475,
                13640
            ],
            [
                13640,
                13885
            ],
            [
                13885,
                14149
            ],
            [
                14149,
                14280
            ],
            [
                14280,
                14354
            ],
            [
                14354,
                14550
            ],
            [
                14550,
                14644
            ],
            [
                14644,
                14754
            ],
            [
                14754,
                14879
            ],
            [
                14879,
                15140
            ],
            [
                15140,
                15348
            ],
            [
                15348,
                15461
            ],
            [
                15461,
                15569
            ],
            [
                15569,
                15590
            ],
            [
                15590,
                15662
            ]
        ]
    },
    "abridged": {
        "text": "Did she (whom you are to forgive, if you can) belong to the Upper Ten Thousand People of England? I cannot say for sure. By blood she was connected with some very big people indeed; but she had known and seen little of these distant relations.\nHer grandfather, Squire Vavasor of Vavasor Hall, in Westmorland, was a country gentleman, with a thousand pounds a year at most. A hot-headed, ignorant, honest old gentleman, he never came to London, but lived at Vavasor Hall, declaring to any who would listen that the country was going to the dogs, and congratulating himself that in his county at least, there had been no parliamentary reform.\nAlice Vavasor, whose offence I am to tell you, and if possible to excuse, was the daughter of his younger son. Her father, John Vavasor, had been a London barrister early in life, and had failed to earn much wealth, although he obtained a livelihood through his marriage. He had married a lady somewhat older than himself, who had four hundred pounds a year, and who was related to those big people to whom I have alluded. Who these were, I shall explain later, but at present it will suffice to say that Alice Macleod gave great offence to her relations by her marriage. She did not, however, give them much time to indulge their anger, for after giving birth to a daughter, she died.\nBut the Macleods did not cut all ties. They snubbed Alice and John Vavasor; but they did not give up the charge of her money. Her four hundred a year was settled very closely on her and on her children, without any going to Mr. Vavasor, so when she died her fortune became the property of baby Alice.\nHowever, the big people gave some aid to the father. It was understood between them that if he made no demand upon them for his daughter's money, and allowed them to have charge of her education, they would do something for him. Thus Mr. Vavasor was appointed to some office to do with insolvents, a post which paid eight hundred pounds a year, and which was abolished three years later.\nAt first John Vavasor thought that he would keep his eight hundred a year for life and have to do nothing for it; but a wretched cheeseparing Whig government, as he called it, would not permit this. It gave him the option of taking four hundred a year for doing nothing, or of keeping the whole eight hundred by going three days a week, for three hours a day, to a miserable dingy little office near Chancery Lane, where his duty would consist in signing his name to accounts which he never read. He had sulkily chosen to keep the money, and this signing had been his work for nearly twenty years.\nHe considered himself to be a very ill-used man. However, there can be no doubt that he was better off and happier with his employment than he would have been without it. He had become used to London life. After his wife's death he dined at his club every day, and he was happiest when so dining. It was the only moment of the day when he was ever much in earnest.\nI must not allow the reader to suppose that John Vavasor had no good qualities. If he had been industrious as a young man he might have shone in his profession. And although he was discontented, he was popular. He was as generous as his means would permit; he was a man of his word; and he understood the code of gentleman in his circle. By nature, too, he was kindly, loving many people a little, if none passionately. At fifty he was still a handsome, upright man, whose hair and beard were only beginning to show grey.\nAlthough Alice Vavasor's big relatives cared little for her in her early years, they were careful to take charge of her education. I must explain this. There was a certain Lady Macleod, not very big herself, but, as it were, hanging on to the skirts of those who were, who cared very much for Alice. She was a widow, who for many years had lived at Cheltenham, making short stays in London when she could afford it. Old Lady Macleod was a good woman, though a Calvinist, and a devout believer in the high rank of her noble relatives. She could almost worship an aristocrat of the most disgraceful habits, although she mentally condemned crowds of ordinary men and women to eternal torments, because they listened to music in a park on Sunday.\nYet she was a good woman. Out of her small means she gave much away. She strove to love her neighbours. She bore much pain with calm, quiet endurance, and she lived in trust of a better world. She loved her cousin young Alice Vavasor exceedingly, and yet Alice had done much to extinguish such love.\nAlice, in her childhood, had been brought up by Lady Macleod. At the age of twelve she had been sent to a school at Aix-la-Chapelle, against Lady Macleod's wishes; at nineteen she had returned to Cheltenham, and after living there for a year, had expressed her unwillingness to remain any longer with her relative. She made an arrangement, therefore, with her father, that they two would keep house together in London, and so they had lived for the last five years; for Alice at the time of this story was twenty-four.\nTheir way of life had been unusual and not altogether satisfactory. At twenty-one Alice gained control of her fortune; and persuaded her father, who had lived in lodgings, to take a small house in Queen Anne Street, for which she offered to pay part of the expense. He had agreed, although he knew he would not give his child the attention which a widowed father should pay to an only daughter.\nThe house had been taken, and Alice and he had lived together, but their lives had been quite apart. For a month or two, he had tried to dine at home and even to remain at home through the evening; but the effort had been too hard for him and he had broken down. He had told her and himself that his health would fail if he made so great a change so late in life. The effort had been abandoned, and Mr. Vavasor now never dined at home.\nNor did he and his daughter ever dine out together. They could not afford to give dinners, and therefore could not mix in the same circle. They saw each other daily; but they did little more than see each other. They did not even breakfast together, and after three o'clock Mr. Vavasor was never to be found in his own house.\nMiss Vavasor had made for herself a certain footing in society, though not among the Upper Ten Thousand. Her aunt's preferences had driven her to avoid aristocrats, along with all Calvinistic people.\nHowever, Lady Macleod did not avoid Alice Vavasor. When in London she persevered in visiting Queen Anne Street, even though she was not on speaking terms with Mr. Vavasor. And she tried hard to nurture an intimacy between Alice and her noble relatives - an intimacy such as that which she herself enjoyed, which gave her a footing in their houses but no place in their hearts. But all this Alice declined.\nA few words must be said about Alice Vavasor's appearance; one fact also must be told, and then I may start my story. As for her character, I will leave it to be read in the story itself.\nThere was nothing girlish in her manners. She appeared staid and self-possessed. She was tall and well made, but by no means fat. Her hair and her eyes were dark brown; and her complexion was also dark. Her nose was somewhat broad and retrouss, but a charming nose, full of character, and giving her face a look of pleasant humour which it would otherwise have lacked. Her mouth was large, and her chin finely chiselled, like her father's. All in all, she was a fine, handsome, high-spirited young woman.\nAnd now for my fact. At the time of which I am writing she was already engaged to be married.",
        "paragraph_chars": [
            [
                0,
                244
            ],
            [
                244,
                641
            ],
            [
                641,
                1327
            ],
            [
                1327,
                1628
            ],
            [
                1628,
                2016
            ],
            [
                2016,
                2614
            ],
            [
                2614,
                2979
            ],
            [
                2979,
                3501
            ],
            [
                3501,
                4244
            ],
            [
                4244,
                4544
            ],
            [
                4544,
                5063
            ],
            [
                5063,
                5458
            ],
            [
                5458,
                5894
            ],
            [
                5894,
                6220
            ],
            [
                6220,
                6420
            ],
            [
                6420,
                6826
            ],
            [
                6826,
                7014
            ],
            [
                7014,
                7519
            ],
            [
                7519,
                7612
            ]
        ],
        "segment_chars": [
            [
                0,
                98
            ],
            [
                98,
                121
            ],
            [
                121,
                244
            ],
            [
                244,
                373
            ],
            [
                373,
                641
            ],
            [
                641,
                752
            ],
            [
                752,
                913
            ],
            [
                913,
                1064
            ],
            [
                1064,
                1213
            ],
            [
                1213,
                1327
            ],
            [
                1327,
                1366
            ],
            [
                1366,
                1453
            ],
            [
                1453,
                1628
            ],
            [
                1628,
                1681
            ],
            [
                1681,
                1857
            ],
            [
                1857,
                2016
            ],
            [
                2016,
                2215
            ],
            [
                2215,
                2513
            ],
            [
                2513,
                2614
            ],
            [
                2614,
                2663
            ],
            [
                2663,
                2785
            ],
            [
                2785,
                2820
            ],
            [
                2820,
                2911
            ],
            [
                2911,
                2979
            ],
            [
                2979,
                3059
            ],
            [
                3059,
                3140
            ],
            [
                3140,
                3190
            ],
            [
                3190,
                3317
            ],
            [
                3317,
                3399
            ],
            [
                3399,
                3501
            ],
            [
                3501,
                3632
            ],
            [
                3632,
                3653
            ],
            [
                3653,
                3801
            ],
            [
                3801,
                3917
            ],
            [
                3917,
                4035
            ],
            [
                4035,
                4244
            ],
            [
                4244,
                4270
            ],
            [
                4270,
                4313
            ],
            [
                4313,
                4348
            ],
            [
                4348,
                4437
            ],
            [
                4437,
                4544
            ],
            [
                4544,
                4606
            ],
            [
                4606,
                4859
            ],
            [
                4859,
                5063
            ],
            [
                5063,
                5131
            ],
            [
                5131,
                5329
            ],
            [
                5329,
                5458
            ],
            [
                5458,
                5559
            ],
            [
                5559,
                5721
            ],
            [
                5721,
                5822
            ],
            [
                5822,
                5894
            ],
            [
                5894,
                5946
            ],
            [
                5946,
                6033
            ],
            [
                6033,
                6106
            ],
            [
                6106,
                6220
            ],
            [
                6220,
                6325
            ],
            [
                6325,
                6420
            ],
            [
                6420,
                6471
            ],
            [
                6471,
                6592
            ],
            [
                6592,
                6797
            ],
            [
                6797,
                6826
            ],
            [
                6826,
                6944
            ],
            [
                6944,
                7014
            ],
            [
                7014,
                7056
            ],
            [
                7056,
                7095
            ],
            [
                7095,
                7144
            ],
            [
                7144,
                7217
            ],
            [
                7217,
                7383
            ],
            [
                7383,
                7454
            ],
            [
                7454,
                7519
            ],
            [
                7519,
                7540
            ],
            [
                7540,
                7612
            ]
        ],
        "overlap_chars": [
            [
                0,
                3
            ],
            [
                4,
                7
            ],
            [
                14,
                44
            ],
            [
                46,
                78
            ],
            [
                86,
                88
            ],
            [
                98,
                99
            ],
            [
                107,
                110
            ],
            [
                119,
                121
            ],
            [
                121,
                137
            ],
            [
                138,
                180
            ],
            [
                180,
                185
            ],
            [
                186,
                215
            ],
            [
                216,
                224
            ],
            [
                233,
                242
            ],
            [
                242,
                243
            ],
            [
                244,
                300
            ],
            [
                303,
                333
            ],
            [
                341,
                349
            ],
            [
                357,
                366
            ],
            [
                371,
                373
            ],
            [
                373,
                421
            ],
            [
                433,
                435
            ],
            [
                442,
                443
            ],
            [
                448,
                453
            ],
            [
                454,
                504
            ],
            [
                505,
                538
            ],
            [
                543,
                576
            ],
            [
                577,
                590
            ],
            [
                591,
                593
            ],
            [
                599,
                600
            ],
            [
                607,
                615
            ],
            [
                619,
                639
            ],
            [
                639,
                640
            ],
            [
                641,
                669
            ],
            [
                670,
                750
            ],
            [
                750,
                752
            ],
            [
                762,
                763
            ],
            [
                764,
                776
            ],
            [
                776,
                777
            ],
            [
                778,
                781
            ],
            [
                787,
                788
            ],
            [
                789,
                795
            ],
            [
                796,
                805
            ],
            [
                806,
                819
            ],
            [
                819,
                835
            ],
            [
                836,
                838
            ],
            [
                844,
                855
            ],
            [
                855,
                856
            ],
            [
                866,
                868
            ],
            [
                878,
                890
            ],
            [
                911,
                913
            ],
            [
                913,
                967
            ],
            [
                972,
                984
            ],
            [
                992,
                1064
            ],
            [
                1064,
                1078
            ],
            [
                1078,
                1087
            ],
            [
                1088,
                1095
            ],
            [
                1101,
                1181
            ],
            [
                1182,
                1185
            ],
            [
                1196,
                1213
            ],
            [
                1213,
                1254
            ],
            [
                1255,
                1257
            ],
            [
                1266,
                1277
            ],
            [
                1277,
                1278
            ],
            [
                1279,
                1282
            ],
            [
                1296,
                1315
            ],
            [
                1315,
                1325
            ],
            [
                1325,
                1327
            ],
            [
                1327,
                1343
            ],
            [
                1344,
                1351
            ],
            [
                1366,
                1378
            ],
            [
                1385,
                1388
            ],
            [
                1397,
                1399
            ],
            [
                1401,
                1419
            ],
            [
                1420,
                1445
            ],
            [
                1451,
                1453
            ],
            [
                1453,
                1504
            ],
            [
                1509,
                1537
            ],
            [
                1548,
                1563
            ],
            [
                1567,
                1580
            ],
            [
                1585,
                1615
            ],
            [
                1616,
                1620
            ],
            [
                1626,
                1627
            ],
            [
                1635,
                1651
            ],
            [
                1657,
                1661
            ],
            [
                1666,
                1668
            ],
            [
                1669,
                1681
            ],
            [
                1681,
                1683
            ],
            [
                1684,
                1687
            ],
            [
                1688,
                1857
            ],
            [
                1862,
                1887
            ],
            [
                1891,
                1902
            ],
            [
                1903,
                1925
            ],
            [
                1933,
                1938
            ],
            [
                1973,
                2008
            ],
            [
                2014,
                2015
            ],
            [
                2016,
                2024
            ],
            [
                2025,
                2037
            ],
            [
                2038,
                2102
            ],
            [
                2108,
                2177
            ],
            [
                2178,
                2180
            ],
            [
                2181,
                2190
            ],
            [
                2190,
                2213
            ],
            [
                2215,
                2300
            ],
            [
                2301,
                2304
            ],
            [
                2305,
                2310
            ],
            [
                2334,
                2351
            ],
            [
                2351,
                2352
            ],
            [
                2353,
                2374
            ],
            [
                2374,
                2375
            ],
            [
                2376,
                2378
            ],
            [
                2379,
                2511
            ],
            [
                2511,
                2513
            ],
            [
                2513,
                2527
            ],
            [
                2535,
                2579
            ],
            [
                2580,
                2583
            ],
            [
                2589,
                2612
            ],
            [
                2612,
                2613
            ],
            [
                2614,
                2648
            ],
            [
                2652,
                2663
            ],
            [
                2670,
                2671
            ],
            [
                2672,
                2681
            ],
            [
                2682,
                2698
            ],
            [
                2702,
                2737
            ],
            [
                2738,
                2785
            ],
            [
                2785,
                2798
            ],
            [
                2804,
                2818
            ],
            [
                2818,
                2820
            ],
            [
                2820,
                2873
            ],
            [
                2873,
                2878
            ],
            [
                2882,
                2885
            ],
            [
                2895,
                2911
            ],
            [
                2918,
                2944
            ],
            [
                2950,
                2952
            ],
            [
                2957,
                2978
            ],
            [
                2979,
                3022
            ],
            [
                3043,
                3059
            ],
            [
                3062,
                3064
            ],
            [
                3065,
                3068
            ],
            [
                3069,
                3073
            ],
            [
                3091,
                3096
            ],
            [
                3101,
                3138
            ],
            [
                3138,
                3140
            ],
            [
                3140,
                3143
            ],
            [
                3153,
                3159
            ],
            [
                3160,
                3172
            ],
            [
                3172,
                3173
            ],
            [
                3174,
                3188
            ],
            [
                3188,
                3190
            ],
            [
                3190,
                3196
            ],
            [
                3197,
                3199
            ],
            [
                3209,
                3279
            ],
            [
                3280,
                3283
            ],
            [
                3284,
                3291
            ],
            [
                3292,
                3317
            ],
            [
                3317,
                3346
            ],
            [
                3346,
                3359
            ],
            [
                3367,
                3375
            ],
            [
                3377,
                3379
            ],
            [
                3380,
                3399
            ],
            [
                3399,
                3401
            ],
            [
                3402,
                3407
            ],
            [
                3408,
                3414
            ],
            [
                3421,
                3431
            ],
            [
                3431,
                3432
            ],
            [
                3441,
                3445
            ],
            [
                3452,
                3466
            ],
            [
                3472,
                3494
            ],
            [
                3495,
                3500
            ],
            [
                3510,
                3545
            ],
            [
                3546,
                3579
            ],
            [
                3579,
                3580
            ],
            [
                3581,
                3601
            ],
            [
                3607,
                3630
            ],
            [
                3632,
                3646
            ],
            [
                3647,
                3651
            ],
            [
                3651,
                3653
            ],
            [
                3653,
                3768
            ],
            [
                3768,
                3801
            ],
            [
                3801,
                3808
            ],
            [
                3809,
                3810
            ],
            [
                3811,
                3816
            ],
            [
                3816,
                3817
            ],
            [
                3818,
                3821
            ],
            [
                3822,
                3825
            ],
            [
                3826,
                3836
            ],
            [
                3837,
                3874
            ],
            [
                3881,
                3890
            ],
            [
                3891,
                3895
            ],
            [
                3896,
                3899
            ],
            [
                3915,
                3917
            ],
            [
                3917,
                3933
            ],
            [
                3934,
                3958
            ],
            [
                3959,
                3967
            ],
            [
                3970,
                3975
            ],
            [
                3976,
                4035
            ],
            [
                4035,
                4059
            ],
            [
                4074,
                4076
            ],
            [
                4086,
                4094
            ],
            [
                4104,
                4105
            ],
            [
                4115,
                4118
            ],
            [
                4138,
                4147
            ],
            [
                4157,
                4173
            ],
            [
                4174,
                4190
            ],
            [
                4190,
                4216
            ],
            [
                4217,
                4243
            ],
            [
                4244,
                4270
            ],
            [
                4270,
                4313
            ],
            [
                4313,
                4348
            ],
            [
                4348,
                4376
            ],
            [
                4384,
                4437
            ],
            [
                4437,
                4446
            ],
            [
                4447,
                4457
            ],
            [
                4464,
                4477
            ],
            [
                4489,
                4513
            ],
            [
                4514,
                4543
            ],
            [
                4544,
                4553
            ],
            [
                4554,
                4604
            ],
            [
                4606,
                4676
            ],
            [
                4685,
                4699
            ],
            [
                4706,
                4761
            ],
            [
                4769,
                4778
            ],
            [
                4779,
                4828
            ],
            [
                4833,
                4848
            ],
            [
                4857,
                4859
            ],
            [
                4859,
                5009
            ],
            [
                5010,
                5019
            ],
            [
                5023,
                5026
            ],
            [
                5050,
                5057
            ],
            [
                5061,
                5063
            ],
            [
                5063,
                5068
            ],
            [
                5073,
                5089
            ],
            [
                5098,
                5101
            ],
            [
                5102,
                5105
            ],
            [
                5117,
                5131
            ],
            [
                5134,
                5144
            ],
            [
                5145,
                5150
            ],
            [
                5166,
                5172
            ],
            [
                5173,
                5185
            ],
            [
                5196,
                5211
            ],
            [
                5212,
                5278
            ],
            [
                5279,
                5282
            ],
            [
                5289,
                5303
            ],
            [
                5313,
                5329
            ],
            [
                5329,
                5335
            ],
            [
                5353,
                5360
            ],
            [
                5370,
                5373
            ],
            [
                5374,
                5378
            ],
            [
                5379,
                5388
            ],
            [
                5389,
                5392
            ],
            [
                5393,
                5425
            ],
            [
                5426,
                5457
            ],
            [
                5458,
                5559
            ],
            [
                5559,
                5585
            ],
            [
                5592,
                5663
            ],
            [
                5671,
                5707
            ],
            [
                5708,
                5721
            ],
            [
                5721,
                5727
            ],
            [
                5733,
                5740
            ],
            [
                5741,
                5775
            ],
            [
                5779,
                5781
            ],
            [
                5782,
                5786
            ],
            [
                5787,
                5804
            ],
            [
                5805,
                5820
            ],
            [
                5820,
                5822
            ],
            [
                5822,
                5893
            ],
            [
                5894,
                5946
            ],
            [
                5946,
                5960
            ],
            [
                5976,
                5998
            ],
            [
                6005,
                6008
            ],
            [
                6013,
                6033
            ],
            [
                6033,
                6052
            ],
            [
                6053,
                6106
            ],
            [
                6106,
                6167
            ],
            [
                6168,
                6220
            ],
            [
                6220,
                6290
            ],
            [
                6295,
                6325
            ],
            [
                6325,
                6347
            ],
            [
                6348,
                6351
            ],
            [
                6352,
                6358
            ],
            [
                6363,
                6371
            ],
            [
                6383,
                6384
            ],
            [
                6396,
                6399
            ],
            [
                6412,
                6418
            ],
            [
                6418,
                6419
            ],
            [
                6427,
                6428
            ],
            [
                6434,
                6441
            ],
            [
                6442,
                6445
            ],
            [
                6450,
                6471
            ],
            [
                6471,
                6489
            ],
            [
                6501,
                6503
            ],
            [
                6513,
                6531
            ],
            [
                6537,
                6547
            ],
            [
                6548,
                6551
            ],
            [
                6552,
                6555
            ],
            [
                6556,
                6592
            ],
            [
                6592,
                6599
            ],
            [
                6606,
                6613
            ],
            [
                6622,
                6671
            ],
            [
                6674,
                6685
            ],
            [
                6686,
                6690
            ],
            [
                6691,
                6724
            ],
            [
                6724,
                6725
            ],
            [
                6726,
                6773
            ],
            [
                6780,
                6795
            ],
            [
                6795,
                6797
            ],
            [
                6797,
                6824
            ],
            [
                6824,
                6826
            ],
            [
                6826,
                6850
            ],
            [
                6857,
                6872
            ],
            [
                6883,
                6921
            ],
            [
                6922,
                6933
            ],
            [
                6934,
                6944
            ],
            [
                6944,
                6946
            ],
            [
                6951,
                7013
            ],
            [
                7014,
                7031
            ],
            [
                7032,
                7056
            ],
            [
                7056,
                7059
            ],
            [
                7069,
                7074
            ],
            [
                7075,
                7078
            ],
            [
                7079,
                7093
            ],
            [
                7093,
                7095
            ],
            [
                7095,
                7121
            ],
            [
                7121,
                7144
            ],
            [
                7144,
                7152
            ],
            [
                7153,
                7156
            ],
            [
                7157,
                7165
            ],
            [
                7166,
                7175
            ],
            [
                7176,
                7181
            ],
            [
                7183,
                7201
            ],
            [
                7202,
                7205
            ],
            [
                7211,
                7215
            ],
            [
                7215,
                7217
            ],
            [
                7217,
                7244
            ],
            [
                7245,
                7248
            ],
            [
                7249,
                7257
            ],
            [
                7257,
                7262
            ],
            [
                7263,
                7309
            ],
            [
                7310,
                7318
            ],
            [
                7319,
                7344
            ],
            [
                7345,
                7383
            ],
            [
                7383,
                7407
            ],
            [
                7408,
                7416
            ],
            [
                7417,
                7454
            ],
            [
                7454,
                7465
            ],
            [
                7466,
                7519
            ],
            [
                7519,
                7540
            ],
            [
                7540,
                7612
            ]
        ],
        "row_chars": [
            [
                0,
                121
            ],
            [
                121,
                244
            ],
            [
                244,
                373
            ],
            [
                373,
                641
            ],
            [
                641,
                752
            ],
            [
                752,
                913
            ],
            [
                913,
                1064
            ],
            [
                1064,
                1213
            ],
            [
                1213,
                1327
            ],
            [
                1327,
                1327
            ],
            [
                1327,
                1327
            ],
            [
                1327,
                1366
            ],
            [
                1366,
                1453
            ],
            [
                1453,
                1628
            ],
            [
                1628,
                1681
            ],
            [
                1681,
                1857
            ],
            [
                1857,
                1857
            ],
            [
                1857,
                2016
            ],
            [
                2016,
                2513
            ],
            [
                2513,
                2614
            ],
            [
                2614,
                2663
            ],
            [
                2663,
                2663
            ],
            [
                2663,
                2663
            ],
            [
                2663,
                2663
            ],
            [
                2663,
                2663
            ],
            [
                2663,
                2785
            ],
            [
                2785,
                2785
            ],
            [
                2785,
                2820
            ],
            [
                2820,
                2911
            ],
            [
                2911,
                2979
            ],
            [
                2979,
                2979
            ],
            [
                2979,
                2979
            ],
            [
                2979,
                2979
            ],
            [
                2979,
                2979
            ],
            [
                2979,
                2979
            ],
            [
                2979,
                3059
            ],
            [
                3059,
                3140
            ],
            [
                3140,
                3190
            ],
            [
                3190,
                3317
            ],
            [
                3317,
                3317
            ],
            [
                3317,
                3399
            ],
            [
                3399,
                3501
            ],
            [
                3501,
                3501
            ],
            [
                3501,
                3501
            ],
            [
                3501,
                3501
            ],
            [
                3501,
                3653
            ],
            [
                3653,
                3801
            ],
            [
                3801,
                3917
            ],
            [
                3917,
                4035
            ],
            [
                4035,
                4244
            ],
            [
                4244,
                4270
            ],
            [
                4270,
                4313
            ],
            [
                4313,
                4313
            ],
            [
                4313,
                4348
            ],
            [
                4348,
                4437
            ],
            [
                4437,
                4544
            ],
            [
                4544,
                4859
            ],
            [
                4859,
                4859
            ],
            [
                4859,
                5063
            ],
            [
                5063,
                5131
            ],
            [
                5131,
                5329
            ],
            [
                5329,
                5329
            ],
            [
                5329,
                5458
            ],
            [
                5458,
                5559
            ],
            [
                5559,
                5721
            ],
            [
                5721,
                5822
            ],
            [
                5822,
                5894
            ],
            [
                5894,
                5946
            ],
            [
                5946,
                6033
            ],
            [
                6033,
                6033
            ],
            [
                6033,
                6106
            ],
            [
                6106,
                6220
            ],
            [
                6220,
                6325
            ],
            [
                6325,
                6420
            ],
            [
                6420,
                6420
            ],
            [
                6420,
                6420
            ],
            [
                6420,
                6420
            ],
            [
                6420,
                6420
            ],
            [
                6420,
                6471
            ],
            [
                6471,
                6592
            ],
            [
                6592,
                6797
            ],
            [
                6797,
                6826
            ],
            [
                6826,
                6944
            ],
            [
                6944,
                7014
            ],
            [
                7014,
                7014
            ],
            [
                7014,
                7056
            ],
            [
                7056,
                7095
            ],
            [
                7095,
                7144
            ],
            [
                7144,
                7217
            ],
            [
                7217,
                7383
            ],
            [
                7383,
                7454
            ],
            [
                7454,
                7519
            ],
            [
                7519,
                7540
            ],
            [
                7540,
                7612
            ]
        ]
    }
}