{
    "original": {
        "text": "The handmaiden at George Vavasor's lodgings announced \"another gent,\" and then Mr. Scruby entered the room in which were seated George, and Mr. Grimes the publican from the \"Handsome Man\" on the Brompton Road. Mr. Scruby was an attorney from Great Marlborough Street, supposed to be very knowing in the ways of metropolitan elections; and he had now stepped round, as he called it, with the object of saying a few words to Mr. Grimes, partly on the subject of the forthcoming contest at Chelsea, and partly on that of the contest last past. These words were to be said in the presence of Mr. Vavasor, the person interested. That some other words had been spoken between Mr. Scruby and Mr. Grimes on the same subjects behind Mr. Vavasor's back I think very probable. But even though this might have been so I am not prepared to say that Mr. Vavasor had been deceived by their combinations.\nThe two men were very civil to each other in their salutations, the attorney assuming an air of patronizing condescension, always calling the other Grimes; whereas Mr. Scruby was treated with considerable deference by the publican, and was always called Mr. Scruby. \"Business is business,\" said the publican as soon as these salutations were over; \"isn't it now, Mr. Scruby?\"\n\"And I suppose Grimes thinks Sunday morning a particularly good time for business,\" said the attorney, laughing.\n\"It's quiet, you know,\" said Grimes. \"But it warn't me as named Sunday morning. It was Mr. Vavasor here. But it is quiet; ain't it, Mr. Scruby?\"\nMr. Scruby acknowledged that it was quiet, especially looking out over the river, and then they proceeded to business. \"We must pull the governor through better next time than we did last,\" said the attorney.\n\"Of course we must, Mr. Scruby; but, Lord love you, Mr. Vavasor, whose fault was it? What notice did I get,--just tell me that? Why, Travers's name was up on the liberal interest ever so long before the governor had ever thought about it.\"\n\"Nobody is blaming you, Mr. Grimes,\" said George.\n\"And nobody can't, Mr. Vavasor. I done my work true as steel, and there ain't another man about the place as could have done half as much. You ask Mr. Scruby else. Mr. Scruby knows, if ere a man in London does. I tell you what it is, Mr. Vavasor, them Chelsea fellows, who lives mostly down by the river, ain't like your Maryboners or Finsburyites. It wants something of a man to manage them. Don't it Mr. Scruby?\"\n\"It wants something of a man to manage any of them as far as my experience goes,\" said Mr. Scruby.\n\"Of course it do; and there ain't one in London knows so much about it as you do, Mr. Scruby. I will say that for you. But the long and the short of it is this;--business is business, and money is money.\"\n\"Money is money, certainly,\" said Mr. Scruby. \"There's no doubt in the world about that, Grimes;--and a deal of it you had out of the last election.\"\n\"No, I hadn't; begging your pardon, Mr. Scruby, for making so free. What I had to my own cheek wasn't nothing to speak of. I wasn't paid for my time; that's what I wasn't. You look how a publican's business gets cut up at them elections;--and then the state of the house afterwards! What would the governor say to me if I was to put down painting inside and out in my little bill?\"\n\"It doesn't seem to make much difference how you put it down,\" said Vavasor. \"The total is what I look at.\"\n\"Just so, Mr. Vavasor; just so. The total is what I looks at too. And I has to look at it a deuced long time before I gets it. I ain't a got it yet; have I, Mr. Vavasor?\"\n\"Well; if you ask me I should say you had,\" said George. \"I know I paid Mr. Scruby three hundred pounds on your account.\"\n\"And I got every shilling of it, Mr. Vavasor. I'm not a going to deny the money, Mr. Vavasor. You'll never find me doing that. I'm as round as your hat, and as square as your elbow,--I am. Mr. Scruby knows me; don't you, Mr. Scruby?\"\n\"Perhaps I know you too well, Grimes.\"\n\"No you don't, Mr. Scruby; not a bit too well. Nor I don't know you too well, either. I respect you, Mr. Scruby, because you're a man as understands your business. But as I was saying, what's three hundred pounds when a man's bill is three hundred and ninety-two thirteen and fourpence?\"\n\"I thought that was all settled, Mr. Scruby,\" said Vavasor.\n\"Why you see, Mr. Vavasor, it's very hard to settle these things. If you ask me whether Mr. Grimes here can sue you for the balance, I tell you very plainly that he can't. We were a little short of money when we came to a settlement, as is generally the case at such times, and so we took Mr. Grimes' receipt for three hundred pounds.\"\n\"Of course you did, Mr. Scruby.\"\n\"Not on account, but in full of all demands.\"\n\"Now Mr. Scruby!\" and the publican as he made this appeal looked at the attorney with an expression of countenance which was absolutely eloquent. \"Are you going to put me off with such an excuse as that?\" so the look spoke plainly enough. \"Are you going to bring up my own signature against me, when you know very well that I shouldn't have got a shilling at all for the next twelve months if I hadn't given it? Oh Mr. Scruby!\" That's what Mr. Grimes' look said, and both Mr. Scruby and Mr. Vavasor understood it perfectly.\n\"In full of all demands,\" said Mr. Scruby, with a slight tone of triumph in his voice, as though to show that Grimes' appeal had no effect at all upon his conscience. \"If you were to go into a court of law, Grimes, you wouldn't have a leg to stand upon.\"\n\"A court of law? Who's a going to law with the governor, I should like to know? not I; not if he didn't pay me them ninety-two pounds thirteen and fourpence for the next five years.\"\n\"Five years or fifteen would make no difference,\" said Scruby. \"You couldn't do it.\"\n\"And I ain't a going to try. That's not the ticket I've come here about, Mr. Vavasor, this blessed Sunday morning. Going to law, indeed! But Mr. Scruby, I've got a family.\"\n\"Not in the vale of Taunton, I hope,\" said George.\n\"They is at the 'Handsome Man' in the Brompton Road, Mr. Vavasor; and I always feels that I owes my first duty to them. If a man don't work for his family, what do he work for?\"\n\"Come, come, Grimes,\" said Mr. Scruby. \"What is it you're at? Out with it, and don't keep us here all day.\"\n\"What is it I'm at, Mr. Scruby? As if you didn't know very well what I'm at. There's my house;--in all them Chelsea districts it's the most convenientest of any public as is open for all manner of election purposes. That's given up to it.\"\n\"And what next?\" said Scruby.\n\"The next is, I myself. There isn't one of the lot of 'em can work them Chelsea fellows down along the river unless it is me. Mr. Scruby knows that. Why I've been a getting of them up with a view to this very job ever since;--why ever since they was a talking of the Chelsea districts. When Lord Robert was a coming in for the county on the religious dodge, he couldn't have worked them fellows anyhow, only for me. Mr. Scruby knows that.\"\n\"Let's take it all for granted, Mr. Grimes,\" said Vavasor. \"What comes next?\"\n\"Well;--them Bunratty people; it is they as has come next. They know which side their bread is likely to be buttered; they do. They're a bidding for the 'Handsome Man' already; they are.\"\n\"And you'd let your house to the Tory party, Grimes!\" said Mr. Scruby, in a tone in which disgust and anger were blended.\n\"Who said anything of my letting my house to the Tory party, Mr. Scruby? I'm as round as your hat, Mr. Scruby, and as square as your elbow; I am. But suppose as all the liberal gents as employs you, Mr. Scruby, was to turn again you and not pay you your little bills, wouldn't you have your eyes open for customers of another kind? Come now, Mr. Scruby?\"\n[Illustration: \"I'm as round as your hat, and as square as your elbow; I am.\"]\n\"You won't make much of that game, Grimes.\"\n\"Perhaps not; perhaps not. There's a risk in all these things; isn't there, Mr. Vavasor? I should like to see you a Parliament gent; I should indeed. You'd be a credit to the districts; I really think you would.\"\n\"I'm much obliged by your good opinion, Mr. Grimes,\" said George.\n\"When I sees a gent coming forward I knows whether he's fit for Parliament, or whether he ain't. I says you are fit. But Lord love you, Mr. Vavasor; it's a thing a gentleman always has to pay for.\"\n\"That's true enough; a deal more than it's worth, generally.\"\n\"A thing's worth what it fetches. I'm worth what I'll fetch; that's the long and the short of it. I want to have my balance, that's the truth. It's the odd money in a man's bill as always carries the profit. You ask Mr. Scruby else;--only with a lawyer it's all profit I believe.\"\n\"That's what you know about it,\" said Scruby.\n\"If you cut off a man's odd money,\" continued the publican, \"you break his heart. He'd almost sooner have that and leave the other standing. He'd call the hundreds capital, and if he lost them at last, why he'd put it down as being in the way of trade. But the odd money;--he looks at that, Mr. Vavasor, as in a manner the very sweat of his brow, the work of his own hand; that's what goes to his family, and keeps the pot a boiling down-stairs. Never stop a man's odd money, Mr. Vavasor; that is, unless he comes it very strong indeed.\"\n\"And what is it you want now?\" said Scruby.\n\"I wants ninety-two pounds thirteen and fourpence, Mr. Scruby, and then we'll go to work for the new fight with contented hearts. If we're to begin at all, it's quite time; it is indeed, Mr. Vavasor.\"\n\"And what you mean us to understand is, that you won't begin at all without your money,\" said the lawyer.\n\"That's about it, Mr. Scruby.\"\n\"Take a fifty-pound note, Grimes,\" said the lawyer.\n\"Fifty-pound notes are not so ready,\" said George.\n\"Oh, he'll be only too happy to have your acceptance; won't you, Grimes.\"\n\"Not for fifty pounds, Mr. Scruby. It's the odd money that I wants. I don't mind the thirteen and four, because that's neither here nor there among friends, but if I didn't get all them ninety-two pounds I should be a broken-hearted man; I should indeed, Mr. Vavasor. I couldn't go about your work for next year so as to do you justice among the electors. I couldn't indeed.\"\n\"You'd better give him a bill for ninety pounds at three months, Mr. Vavasor. I have no doubt he has got a stamp in his pocket.\"\n\"That I have, Mr. Scruby; there ain't no mistake about that. A bill stamp is a thing that often turns up convenient with gents as mean business like Mr. Vavasor and you. But you must make it ninety-two; you must indeed, Mr. Vavasor. And do make it two months if you can, Mr. Vavasor; they do charge so unconscionable on ninety days at them branch banks; they do indeed.\"\nGeorge Vavasor and Mr. Scruby, between them, yielded at last, so far as to allow the bill to be drawn for ninety-two pounds, but they were stanch as to the time. \"If it must be, it must,\" said the publican, with a deep sigh, as he folded up the paper and put it into the pocket of a huge case which he carried. \"And now, gents, I'll tell you what it is. We'll make safe work of this here next election. We know what's to be our little game in time, and if we don't go in and win, my name ain't Jacob Grimes, and I ain't the landlord of the 'Handsome Man.' As you gents has perhaps got something to say among yourselves, I'll make so bold as to wish you good morning.\" So, with that, Mr. Grimes lifted his hat from the floor, and bowed himself out of the room.\n\"You couldn't have done it cheaper; you couldn't, indeed,\" said the lawyer, as soon as the sound of the closing front door had been heard.\n\"Perhaps not; but what a thief the man is! I remember your telling me that the bill was about the most preposterous you had ever seen.\"\n\"So it was, and if we hadn't wanted him again of course we shouldn't have paid him. But we'll have it all off his next account, Mr. Vavasor,--every shilling of it, It's only lent; that's all;--it's only lent.\"\n\"But one doesn't want to lend such a man money, if one could help it.\"\n\"That's true. If you look at it in that light, it's quite true. But you see we cannot do without him. If he hadn't got your bill, he'd have gone over to the other fellows before the week was over; and the worst of it would have been that he knows our hand. Looking at it all round you've got him cheap, Mr. Vavasor;--you have, indeed.\"\n\"Looking at it all round is just what I don't like, Mr. Scruby, But if a man will have a whistle, he must pay for it.\"\n\"You can't do it cheap for any of these metropolitan seats; you can't, indeed, Mr. Vavasor. That is, a new man can't. When you've been in four or five times, like old Duncombe, why then, of course, you may snap your fingers at such men as Grimes. But the Chelsea districts ain't dear. I don't call them by any means dear. Now Marylebone is dear,--and so is Southwark. It's dear, and nasty; that's what the borough is. Only that I never tell tales, I could tell you a tale, Mr. Vavasor, that'd make your hair stand on end; I could indeed.\"\n\"Ah! the game is hardly worth the candle, I believe.\"\n\"That depends on what way you choose to look at it. A seat in Parliament is a great thing to a man who wants to make his way;--a very great thing;--specially when a man's young, like you, Mr. Vavasor.\"\n\"Young!\" said George. \"Sometimes it seems to me as though I've been living for a hundred years. But I won't trouble you with that, Mr. Scruby, and I believe I needn't keep you any longer.\" With that, he got up and bowed the attorney out of the room, with just a little more ceremony than he had shown to the publican.\n\"Young!\" said Vavasor to himself, when he was left alone. \"There's my uncle, or the old squire,--they're both younger men than I am. One cares for his dinner, and the other for his bullocks and his trees. But what is there that I care for, unless it is not getting among the sheriff's officers for debt?\" Then he took out a little memorandum-book from his breast-pocket, and having made in it an entry as to the amount and date of that bill which he had just accepted on the publican's behalf, he conned over the particulars of its pages. \"Very blue; very blue, indeed,\" he said to himself when he had completed the study. \"But nobody shall say I hadn't the courage to play the game out, and that old fellow must die some day, one supposes. If I were not a fool, I should make it up with him before he went; but I am a fool, and shall remain so to the last.\" Soon after that he dressed himself slowly, reading a little every now and then as he did so. When his toilet was completed, and his Sunday newspapers sufficiently perused, he took up his hat and umbrella and sauntered out.",
        "paragraph_chars": [
            [
                0,
                889
            ],
            [
                889,
                1265
            ],
            [
                1265,
                1378
            ],
            [
                1378,
                1523
            ],
            [
                1523,
                1732
            ],
            [
                1732,
                1972
            ],
            [
                1972,
                2022
            ],
            [
                2022,
                2437
            ],
            [
                2437,
                2536
            ],
            [
                2536,
                2741
            ],
            [
                2741,
                2891
            ],
            [
                2891,
                3273
            ],
            [
                3273,
                3381
            ],
            [
                3381,
                3552
            ],
            [
                3552,
                3674
            ],
            [
                3674,
                3908
            ],
            [
                3908,
                3947
            ],
            [
                3947,
                4235
            ],
            [
                4235,
                4295
            ],
            [
                4295,
                4631
            ],
            [
                4631,
                4664
            ],
            [
                4664,
                4710
            ],
            [
                4710,
                5234
            ],
            [
                5234,
                5489
            ],
            [
                5489,
                5672
            ],
            [
                5672,
                5757
            ],
            [
                5757,
                5930
            ],
            [
                5930,
                5981
            ],
            [
                5981,
                6159
            ],
            [
                6159,
                6267
            ],
            [
                6267,
                6507
            ],
            [
                6507,
                6537
            ],
            [
                6537,
                6977
            ],
            [
                6977,
                7055
            ],
            [
                7055,
                7243
            ],
            [
                7243,
                7365
            ],
            [
                7365,
                7720
            ],
            [
                7720,
                7799
            ],
            [
                7799,
                7843
            ],
            [
                7843,
                8056
            ],
            [
                8056,
                8122
            ],
            [
                8122,
                8320
            ],
            [
                8320,
                8382
            ],
            [
                8382,
                8663
            ],
            [
                8663,
                8709
            ],
            [
                8709,
                9247
            ],
            [
                9247,
                9291
            ],
            [
                9291,
                9492
            ],
            [
                9492,
                9598
            ],
            [
                9598,
                9629
            ],
            [
                9629,
                9681
            ],
            [
                9681,
                9732
            ],
            [
                9732,
                9806
            ],
            [
                9806,
                10182
            ],
            [
                10182,
                10311
            ],
            [
                10311,
                10682
            ],
            [
                10682,
                11442
            ],
            [
                11442,
                11581
            ],
            [
                11581,
                11717
            ],
            [
                11717,
                11927
            ],
            [
                11927,
                11998
            ],
            [
                11998,
                12334
            ],
            [
                12334,
                12453
            ],
            [
                12453,
                12992
            ],
            [
                12992,
                13046
            ],
            [
                13046,
                13248
            ],
            [
                13248,
                13566
            ],
            [
                13566,
                14647
            ]
        ],
        "segment_chars": [
            [
                0,
                210
            ],
            [
                210,
                541
            ],
            [
                541,
                624
            ],
            [
                624,
                766
            ],
            [
                766,
                889
            ],
            [
                889,
                1155
            ],
            [
                1155,
                1265
            ],
            [
                1265,
                1378
            ],
            [
                1378,
                1415
            ],
            [
                1415,
                1458
            ],
            [
                1458,
                1483
            ],
            [
                1483,
                1523
            ],
            [
                1523,
                1642
            ],
            [
                1642,
                1732
            ],
            [
                1732,
                1817
            ],
            [
                1817,
                1860
            ],
            [
                1860,
                1972
            ],
            [
                1972,
                2022
            ],
            [
                2022,
                2054
            ],
            [
                2054,
                2161
            ],
            [
                2161,
                2186
            ],
            [
                2186,
                2233
            ],
            [
                2233,
                2371
            ],
            [
                2371,
                2415
            ],
            [
                2415,
                2437
            ],
            [
                2437,
                2536
            ],
            [
                2536,
                2630
            ],
            [
                2630,
                2655
            ],
            [
                2655,
                2741
            ],
            [
                2741,
                2787
            ],
            [
                2787,
                2891
            ],
            [
                2891,
                2959
            ],
            [
                2959,
                3014
            ],
            [
                3014,
                3063
            ],
            [
                3063,
                3174
            ],
            [
                3174,
                3273
            ],
            [
                3273,
                3350
            ],
            [
                3350,
                3381
            ],
            [
                3381,
                3413
            ],
            [
                3413,
                3447
            ],
            [
                3447,
                3508
            ],
            [
                3508,
                3552
            ],
            [
                3552,
                3609
            ],
            [
                3609,
                3674
            ],
            [
                3674,
                3720
            ],
            [
                3720,
                3768
            ],
            [
                3768,
                3801
            ],
            [
                3801,
                3863
            ],
            [
                3863,
                3908
            ],
            [
                3908,
                3947
            ],
            [
                3947,
                3994
            ],
            [
                3994,
                4033
            ],
            [
                4033,
                4111
            ],
            [
                4111,
                4235
            ],
            [
                4235,
                4295
            ],
            [
                4295,
                4361
            ],
            [
                4361,
                4467
            ],
            [
                4467,
                4631
            ],
            [
                4631,
                4664
            ],
            [
                4664,
                4710
            ],
            [
                4710,
                4728
            ],
            [
                4728,
                4856
            ],
            [
                4856,
                4915
            ],
            [
                4915,
                4949
            ],
            [
                4949,
                5122
            ],
            [
                5122,
                5138
            ],
            [
                5138,
                5234
            ],
            [
                5234,
                5401
            ],
            [
                5401,
                5489
            ],
            [
                5489,
                5506
            ],
            [
                5506,
                5569
            ],
            [
                5569,
                5672
            ],
            [
                5672,
                5735
            ],
            [
                5735,
                5757
            ],
            [
                5757,
                5786
            ],
            [
                5786,
                5872
            ],
            [
                5872,
                5894
            ],
            [
                5894,
                5930
            ],
            [
                5930,
                5981
            ],
            [
                5981,
                6101
            ],
            [
                6101,
                6159
            ],
            [
                6159,
                6198
            ],
            [
                6198,
                6221
            ],
            [
                6221,
                6267
            ],
            [
                6267,
                6299
            ],
            [
                6299,
                6344
            ],
            [
                6344,
                6483
            ],
            [
                6483,
                6507
            ],
            [
                6507,
                6524
            ],
            [
                6524,
                6537
            ],
            [
                6537,
                6561
            ],
            [
                6561,
                6663
            ],
            [
                6663,
                6686
            ],
            [
                6686,
                6823
            ],
            [
                6823,
                6953
            ],
            [
                6953,
                6977
            ],
            [
                6977,
                7036
            ],
            [
                7036,
                7055
            ],
            [
                7055,
                7114
            ],
            [
                7114,
                7182
            ],
            [
                7182,
                7243
            ],
            [
                7243,
                7297
            ],
            [
                7297,
                7365
            ],
            [
                7365,
                7438
            ],
            [
                7438,
                7511
            ],
            [
                7511,
                7697
            ],
            [
                7697,
                7720
            ],
            [
                7720,
                7799
            ],
            [
                7799,
                7843
            ],
            [
                7843,
                7870
            ],
            [
                7870,
                7932
            ],
            [
                7932,
                7993
            ],
            [
                7993,
                8056
            ],
            [
                8056,
                8122
            ],
            [
                8122,
                8219
            ],
            [
                8219,
                8239
            ],
            [
                8239,
                8320
            ],
            [
                8320,
                8382
            ],
            [
                8382,
                8416
            ],
            [
                8416,
                8480
            ],
            [
                8480,
                8525
            ],
            [
                8525,
                8590
            ],
            [
                8590,
                8663
            ],
            [
                8663,
                8709
            ],
            [
                8709,
                8791
            ],
            [
                8791,
                8850
            ],
            [
                8850,
                8962
            ],
            [
                8962,
                9155
            ],
            [
                9155,
                9247
            ],
            [
                9247,
                9278
            ],
            [
                9278,
                9291
            ],
            [
                9291,
                9421
            ],
            [
                9421,
                9492
            ],
            [
                9492,
                9598
            ],
            [
                9598,
                9629
            ],
            [
                9629,
                9681
            ],
            [
                9681,
                9732
            ],
            [
                9732,
                9806
            ],
            [
                9806,
                9841
            ],
            [
                9841,
                9874
            ],
            [
                9874,
                10074
            ],
            [
                10074,
                10162
            ],
            [
                10162,
                10182
            ],
            [
                10182,
                10260
            ],
            [
                10260,
                10311
            ],
            [
                10311,
                10372
            ],
            [
                10372,
                10481
            ],
            [
                10481,
                10544
            ],
            [
                10544,
                10682
            ],
            [
                10682,
                10844
            ],
            [
                10844,
                10993
            ],
            [
                10993,
                11036
            ],
            [
                11036,
                11085
            ],
            [
                11085,
                11238
            ],
            [
                11238,
                11350
            ],
            [
                11350,
                11442
            ],
            [
                11442,
                11581
            ],
            [
                11581,
                11624
            ],
            [
                11624,
                11717
            ],
            [
                11717,
                11801
            ],
            [
                11801,
                11927
            ],
            [
                11927,
                11998
            ],
            [
                11998,
                12012
            ],
            [
                12012,
                12062
            ],
            [
                12062,
                12100
            ],
            [
                12100,
                12255
            ],
            [
                12255,
                12334
            ],
            [
                12334,
                12453
            ],
            [
                12453,
                12545
            ],
            [
                12545,
                12571
            ],
            [
                12571,
                12700
            ],
            [
                12700,
                12738
            ],
            [
                12738,
                12775
            ],
            [
                12775,
                12821
            ],
            [
                12821,
                12871
            ],
            [
                12871,
                12992
            ],
            [
                12992,
                12997
            ],
            [
                12997,
                13046
            ],
            [
                13046,
                13098
            ],
            [
                13098,
                13248
            ],
            [
                13248,
                13257
            ],
            [
                13257,
                13270
            ],
            [
                13270,
                13344
            ],
            [
                13344,
                13437
            ],
            [
                13437,
                13566
            ],
            [
                13566,
                13575
            ],
            [
                13575,
                13624
            ],
            [
                13624,
                13699
            ],
            [
                13699,
                13771
            ],
            [
                13771,
                13871
            ],
            [
                13871,
                14105
            ],
            [
                14105,
                14189
            ],
            [
                14189,
                14307
            ],
            [
                14307,
                14425
            ],
            [
                14425,
                14518
            ],
            [
                14518,
                14647
            ]
        ],
        "overlap_chars": [
            [
                0,
                14
            ],
            [
                44,
                73
            ],
            [
                79,
                106
            ],
            [
                208,
                210
            ],
            [
                368,
                370
            ],
            [
                221,
                236
            ],
            [
                266,
                310
            ],
            [
                324,
                349
            ],
            [
                408,
                433
            ],
            [
                539,
                541
            ],
            [
                743,
                750
            ],
            [
                751,
                755
            ],
            [
                624,
                669
            ],
            [
                699,
                702
            ],
            [
                717,
                742
            ],
            [
                764,
                766
            ],
            [
                766,
                769
            ],
            [
                840,
                847
            ],
            [
                782,
                786
            ],
            [
                887,
                889
            ],
            [
                889,
                900
            ],
            [
                940,
                943
            ],
            [
                920,
                930
            ],
            [
                906,
                910
            ],
            [
                1603,
                1613
            ],
            [
                1619,
                1641
            ],
            [
                1642,
                1732
            ],
            [
                1732,
                1817
            ],
            [
                1817,
                1838
            ],
            [
                1972,
                2022
            ],
            [
                2022,
                2054
            ],
            [
                2054,
                2111
            ],
            [
                2128,
                2161
            ],
            [
                2161,
                2179
            ],
            [
                2184,
                2186
            ],
            [
                2233,
                2289
            ],
            [
                2308,
                2325
            ],
            [
                2327,
                2371
            ],
            [
                2371,
                2379
            ],
            [
                2393,
                2415
            ],
            [
                2415,
                2423
            ],
            [
                2424,
                2437
            ],
            [
                2437,
                2446
            ],
            [
                2460,
                2487
            ],
            [
                2516,
                2536
            ],
            [
                2536,
                2630
            ],
            [
                2655,
                2690
            ],
            [
                2698,
                2741
            ],
            [
                2741,
                2787
            ],
            [
                2787,
                2788
            ],
            [
                2839,
                2842
            ],
            [
                2856,
                2863
            ],
            [
                2843,
                2855
            ],
            [
                2871,
                2888
            ],
            [
                2828,
                2836
            ],
            [
                2888,
                2891
            ],
            [
                2891,
                2904
            ],
            [
                2937,
                2938
            ],
            [
                2906,
                2937
            ],
            [
                2957,
                2959
            ],
            [
                2959,
                2969
            ],
            [
                2986,
                3014
            ],
            [
                3014,
                3039
            ],
            [
                3061,
                3063
            ],
            [
                3130,
                3151
            ],
            [
                3162,
                3174
            ],
            [
                3174,
                3201
            ],
            [
                3208,
                3237
            ],
            [
                3253,
                3270
            ],
            [
                3508,
                3515
            ],
            [
                3525,
                3552
            ],
            [
                3552,
                3557
            ],
            [
                3573,
                3609
            ],
            [
                3609,
                3674
            ],
            [
                3674,
                3720
            ],
            [
                3720,
                3727
            ],
            [
                3730,
                3743
            ],
            [
                3766,
                3768
            ],
            [
                4111,
                4114
            ],
            [
                4132,
                4235
            ],
            [
                4235,
                4295
            ],
            [
                4295,
                4299
            ],
            [
                4307,
                4359
            ],
            [
                4359,
                4361
            ],
            [
                4631,
                4632
            ],
            [
                4467,
                4628
            ],
            [
                4685,
                4692
            ],
            [
                4693,
                4707
            ],
            [
                4653,
                4654
            ],
            [
                5402,
                5419
            ],
            [
                5425,
                5489
            ],
            [
                5489,
                5506
            ],
            [
                5786,
                5796
            ],
            [
                5808,
                5841
            ],
            [
                5870,
                5872
            ],
            [
                5872,
                5894
            ],
            [
                6344,
                6354
            ],
            [
                6428,
                6434
            ],
            [
                6355,
                6361
            ],
            [
                6363,
                6420
            ],
            [
                6446,
                6483
            ],
            [
                6595,
                6624
            ],
            [
                6630,
                6645
            ],
            [
                6663,
                6686
            ],
            [
                7163,
                7166
            ],
            [
                7063,
                7083
            ],
            [
                7237,
                7240
            ],
            [
                7190,
                7191
            ],
            [
                7200,
                7230
            ],
            [
                7240,
                7243
            ],
            [
                7243,
                7297
            ],
            [
                7297,
                7316
            ],
            [
                7333,
                7340
            ],
            [
                7363,
                7365
            ],
            [
                7365,
                7383
            ],
            [
                7436,
                7438
            ],
            [
                7511,
                7582
            ],
            [
                7602,
                7609
            ],
            [
                7614,
                7645
            ],
            [
                7666,
                7695
            ],
            [
                7799,
                7843
            ],
            [
                7843,
                7844
            ],
            [
                7857,
                7870
            ],
            [
                7919,
                7930
            ],
            [
                7917,
                7918
            ],
            [
                7932,
                7993
            ],
            [
                7993,
                8027
            ],
            [
                8053,
                8056
            ],
            [
                8056,
                8073
            ],
            [
                8106,
                8122
            ],
            [
                8239,
                8269
            ],
            [
                8271,
                8295
            ],
            [
                8303,
                8320
            ],
            [
                8320,
                8321
            ],
            [
                8341,
                8342
            ],
            [
                8343,
                8382
            ],
            [
                8382,
                8416
            ],
            [
                9292,
                9293
            ],
            [
                9294,
                9299
            ],
            [
                9300,
                9340
            ],
            [
                9352,
                9421
            ],
            [
                9421,
                9451
            ],
            [
                9458,
                9462
            ],
            [
                9489,
                9492
            ],
            [
                9492,
                9493
            ],
            [
                9502,
                9510
            ],
            [
                9532,
                9598
            ],
            [
                9598,
                9629
            ],
            [
                9629,
                9681
            ],
            [
                9681,
                9732
            ],
            [
                9874,
                9908
            ],
            [
                9961,
                10074
            ],
            [
                10074,
                10103
            ],
            [
                10118,
                10160
            ],
            [
                10182,
                10258
            ],
            [
                10258,
                10259
            ],
            [
                10485,
                10544
            ],
            [
                10544,
                10580
            ],
            [
                10679,
                10682
            ],
            [
                10682,
                10711
            ],
            [
                10727,
                10810
            ],
            [
                10842,
                10843
            ],
            [
                10844,
                10943
            ],
            [
                10991,
                10993
            ],
            [
                10993,
                11009
            ],
            [
                11036,
                11085
            ],
            [
                11135,
                11146
            ],
            [
                11157,
                11188
            ],
            [
                11302,
                11306
            ],
            [
                11326,
                11350
            ],
            [
                11367,
                11375
            ],
            [
                11411,
                11442
            ],
            [
                11442,
                11476
            ],
            [
                11498,
                11517
            ],
            [
                11565,
                11568
            ],
            [
                11579,
                11581
            ],
            [
                11581,
                11624
            ],
            [
                11697,
                11700
            ],
            [
                11648,
                11650
            ],
            [
                11656,
                11668
            ],
            [
                11684,
                11696
            ],
            [
                11714,
                11717
            ],
            [
                11717,
                11801
            ],
            [
                11801,
                11856
            ],
            [
                12100,
                12193
            ],
            [
                12253,
                12255
            ],
            [
                12279,
                12299
            ],
            [
                12303,
                12304
            ],
            [
                13098,
                13171
            ],
            [
                13173,
                13174
            ],
            [
                13217,
                13222
            ],
            [
                13211,
                13214
            ],
            [
                13224,
                13232
            ],
            [
                13245,
                13248
            ],
            [
                13248,
                13257
            ],
            [
                13257,
                13270
            ],
            [
                13270,
                13289
            ],
            [
                13296,
                13344
            ],
            [
                13395,
                13434
            ],
            [
                13377,
                13389
            ],
            [
                13434,
                13437
            ],
            [
                13448,
                13450
            ],
            [
                13468,
                13484
            ],
            [
                13564,
                13566
            ],
            [
                13566,
                13575
            ],
            [
                13575,
                13579
            ],
            [
                13588,
                13611
            ],
            [
                13617,
                13624
            ],
            [
                13624,
                13625
            ],
            [
                13633,
                13641
            ],
            [
                13646,
                13660
            ],
            [
                13671,
                13699
            ],
            [
                13699,
                13771
            ],
            [
                13771,
                13779
            ],
            [
                13794,
                13805
            ],
            [
                13819,
                13830
            ],
            [
                13860,
                13870
            ],
            [
                13871,
                13896
            ],
            [
                13913,
                13921
            ],
            [
                13929,
                13952
            ],
            [
                13959,
                13967
            ],
            [
                14037,
                14051
            ],
            [
                14002,
                14006
            ],
            [
                14058,
                14062
            ],
            [
                14094,
                14104
            ],
            [
                14105,
                14106
            ],
            [
                14117,
                14155
            ],
            [
                14187,
                14189
            ],
            [
                14189,
                14252
            ],
            [
                14254,
                14273
            ],
            [
                14274,
                14291
            ],
            [
                14305,
                14307
            ],
            [
                14307,
                14389
            ],
            [
                14422,
                14425
            ],
            [
                14597,
                14599
            ],
            [
                14547,
                14548
            ],
            [
                14600,
                14647
            ]
        ],
        "row_chars": [
            [
                0,
                210
            ],
            [
                210,
                541
            ],
            [
                541,
                624
            ],
            [
                624,
                766
            ],
            [
                766,
                889
            ],
            [
                889,
                1642
            ],
            [
                1642,
                1732
            ],
            [
                1732,
                1817
            ],
            [
                1817,
                1860
            ],
            [
                1860,
                1972
            ],
            [
                1972,
                2022
            ],
            [
                2022,
                2054
            ],
            [
                2054,
                2161
            ],
            [
                2161,
                2186
            ],
            [
                2186,
                2233
            ],
            [
                2233,
                2371
            ],
            [
                2371,
                2415
            ],
            [
                2415,
                2437
            ],
            [
                2437,
                2536
            ],
            [
                2536,
                2630
            ],
            [
                2630,
                2655
            ],
            [
                2655,
                2741
            ],
            [
                2741,
                2787
            ],
            [
                2787,
                2891
            ],
            [
                2891,
                2959
            ],
            [
                2959,
                3014
            ],
            [
                3014,
                3063
            ],
            [
                3063,
                3174
            ],
            [
                3174,
                3273
            ],
            [
                3273,
                3350
            ],
            [
                3350,
                3381
            ],
            [
                3381,
                3413
            ],
            [
                3413,
                3447
            ],
            [
                3447,
                3508
            ],
            [
                3508,
                3552
            ],
            [
                3552,
                3609
            ],
            [
                3609,
                3674
            ],
            [
                3674,
                3720
            ],
            [
                3720,
                3768
            ],
            [
                3768,
                3801
            ],
            [
                3801,
                3863
            ],
            [
                3863,
                3908
            ],
            [
                3908,
                3947
            ],
            [
                3947,
                3994
            ],
            [
                3994,
                4033
            ],
            [
                4033,
                4111
            ],
            [
                4111,
                4235
            ],
            [
                4235,
                4295
            ],
            [
                4295,
                4361
            ],
            [
                4361,
                4467
            ],
            [
                4467,
                4710
            ],
            [
                4710,
                4728
            ],
            [
                4728,
                4856
            ],
            [
                4856,
                4915
            ],
            [
                4915,
                4949
            ],
            [
                4949,
                5122
            ],
            [
                5122,
                5138
            ],
            [
                5138,
                5234
            ],
            [
                5234,
                5401
            ],
            [
                5401,
                5489
            ],
            [
                5489,
                5506
            ],
            [
                5506,
                5569
            ],
            [
                5569,
                5672
            ],
            [
                5672,
                5735
            ],
            [
                5735,
                5757
            ],
            [
                5757,
                5786
            ],
            [
                5786,
                5872
            ],
            [
                5872,
                5894
            ],
            [
                5894,
                5930
            ],
            [
                5930,
                5981
            ],
            [
                5981,
                6101
            ],
            [
                6101,
                6159
            ],
            [
                6159,
                6198
            ],
            [
                6198,
                6221
            ],
            [
                6221,
                6267
            ],
            [
                6267,
                6299
            ],
            [
                6299,
                6344
            ],
            [
                6344,
                6483
            ],
            [
                6483,
                6507
            ],
            [
                6507,
                6524
            ],
            [
                6524,
                6537
            ],
            [
                6537,
                6561
            ],
            [
                6561,
                6686
            ],
            [
                6686,
                6823
            ],
            [
                6823,
                6953
            ],
            [
                6953,
                6977
            ],
            [
                6977,
                7036
            ],
            [
                7036,
                7055
            ],
            [
                7055,
                7243
            ],
            [
                7243,
                7297
            ],
            [
                7297,
                7365
            ],
            [
                7365,
                7438
            ],
            [
                7438,
                7511
            ],
            [
                7511,
                7697
            ],
            [
                7697,
                7720
            ],
            [
                7720,
                7799
            ],
            [
                7799,
                7843
            ],
            [
                7843,
                7870
            ],
            [
                7870,
                7993
            ],
            [
                7993,
                8056
            ],
            [
                8056,
                8122
            ],
            [
                8122,
                8219
            ],
            [
                8219,
                8239
            ],
            [
                8239,
                8320
            ],
            [
                8320,
                8382
            ],
            [
                8382,
                8416
            ],
            [
                8416,
                8480
            ],
            [
                8480,
                8525
            ],
            [
                8525,
                8590
            ],
            [
                8590,
                8663
            ],
            [
                8663,
                8709
            ],
            [
                8709,
                8791
            ],
            [
                8791,
                8850
            ],
            [
                8850,
                8962
            ],
            [
                8962,
                9155
            ],
            [
                9155,
                9247
            ],
            [
                9247,
                9278
            ],
            [
                9278,
                9291
            ],
            [
                9291,
                9421
            ],
            [
                9421,
                9492
            ],
            [
                9492,
                9598
            ],
            [
                9598,
                9629
            ],
            [
                9629,
                9681
            ],
            [
                9681,
                9732
            ],
            [
                9732,
                9806
            ],
            [
                9806,
                9841
            ],
            [
                9841,
                9874
            ],
            [
                9874,
                10074
            ],
            [
                10074,
                10162
            ],
            [
                10162,
                10182
            ],
            [
                10182,
                10260
            ],
            [
                10260,
                10311
            ],
            [
                10311,
                10372
            ],
            [
                10372,
                10481
            ],
            [
                10481,
                10544
            ],
            [
                10544,
                10682
            ],
            [
                10682,
                10844
            ],
            [
                10844,
                10993
            ],
            [
                10993,
                11085
            ],
            [
                11085,
                11238
            ],
            [
                11238,
                11350
            ],
            [
                11350,
                11442
            ],
            [
                11442,
                11581
            ],
            [
                11581,
                11624
            ],
            [
                11624,
                11717
            ],
            [
                11717,
                11801
            ],
            [
                11801,
                11927
            ],
            [
                11927,
                11998
            ],
            [
                11998,
                12012
            ],
            [
                12012,
                12062
            ],
            [
                12062,
                12100
            ],
            [
                12100,
                12255
            ],
            [
                12255,
                12334
            ],
            [
                12334,
                12453
            ],
            [
                12453,
                12545
            ],
            [
                12545,
                12571
            ],
            [
                12571,
                12700
            ],
            [
                12700,
                12738
            ],
            [
                12738,
                12775
            ],
            [
                12775,
                12821
            ],
            [
                12821,
                12871
            ],
            [
                12871,
                12992
            ],
            [
                12992,
                12997
            ],
            [
                12997,
                13046
            ],
            [
                13046,
                13098
            ],
            [
                13098,
                13248
            ],
            [
                13248,
                13257
            ],
            [
                13257,
                13270
            ],
            [
                13270,
                13344
            ],
            [
                13344,
                13437
            ],
            [
                13437,
                13566
            ],
            [
                13566,
                13575
            ],
            [
                13575,
                13624
            ],
            [
                13624,
                13699
            ],
            [
                13699,
                13771
            ],
            [
                13771,
                13871
            ],
            [
                13871,
                14105
            ],
            [
                14105,
                14189
            ],
            [
                14189,
                14307
            ],
            [
                14307,
                14425
            ],
            [
                14425,
                14518
            ],
            [
                14518,
                14647
            ]
        ]
    },
    "abridged": {
        "text": "The handmaiden announced \"another gent,\" and Mr. Scruby entered the room. He was an attorney, supposed to be very knowing in the ways of elections; and he had now come to say a few words to Mr. Grimes. I think it very likely that some other words had been spoken between the two men behind Mr. Vavasor's back. But Vavasor probably knew this.\nThe two men saluted each other very civilly, and then got proceeded to business.\n\"We must pull the governor through better next time than we did last,\" said the attorney.\n\"Of course we must, Mr. Scruby; but, Lord love you, Mr. Vavasor, whose fault was it? What notice did I get?\"\n\"Nobody is blaming you, Mr. Grimes,\" said George.\n\"And nobody can't, Mr. Vavasor. I done my work true as steel, and there ain't another man as could have done half as much. You ask Mr. Scruby. I tell you what it is, Mr. Vavasor, them Chelsea fellows down by the river ain't like your Maryboners or Finsburyites. It wants a man to manage them. Don't it, Mr. Scruby?\"\n\"It wants a man to manage any of them,\" said Mr. Scruby.\n\"Of course it do; and there ain't one in London knows so much about it as you do, Mr. Scruby. But the long and the short of it is - business is business, and money is money.\"\n\"Money is money, certainly,\" said Mr. Scruby. \"and you had a deal of it for the last election, Grimes.\"\n\"No, I hadn't, begging your pardon, Mr. Scruby. What I had for myself wasn't nothing to speak of. I wasn't paid for my time. And then the state of my tavern afterwards! What would the governor say if I was to put down painting in my little bill? But I ain't been paid yet; have I, Mr. Vavasor?\"\n\"Well, I should say you had,\" said George. \"I know I paid Mr. Scruby three hundred pounds on your account.\"\n\"And I got every shilling of it, Mr. Vavasor. I'm not going to deny that. But what's three hundred pounds when a man's bill is three hundred and ninety-two thirteen and fourpence?\"\n\"I thought that was all settled, Mr. Scruby,\" said Vavasor.\n\"Why, Mr. Vavasor, it's very hard to settle these things,\" said the attorney. \"We were a little short of money when we came to a settlement, as is generally the case at such times, and so we took Mr. Grimes' receipt for three hundred pounds - in full payment of all demands. If you were to go to a court of law, Grimes, you wouldn't have a leg to stand upon.\"\n\"A court of law? That's not what I've come here about, Mr. Vavasor. Going to law, indeed! There's my public-house; in all them Chelsea districts it's the most convenientest for all manner of election purposes. And I can work them Chelsea fellows along the river - Mr. Scruby knows that. But them Bunratty people are a-bidding for the 'Handsome Man' already.\"\n\"And you'd let your house to the Tory party, Grimes!\" said Mr. Scruby, in tones of disgust.\n\"Who said anything about that? But suppose as all the liberal gents as employs you, Mr. Scruby, was to not pay your little bills, wouldn't you look for customers of another kind?\"\n\"You won't make much of that game, Grimes.\"\n\"Perhaps not. But Mr. Vavasor, I should like to see you a Parliament gent; I should indeed. You'd be a credit to the districts.\"\n\"I'm much obliged,\" said George.\n\"But Lord love you, Mr. Vavasor, it's a thing a gentleman has to pay for.\"\n\"A good deal more than it's worth, generally.\"\n\"A thing's worth what it fetches. I just wants my ninety-two pounds thirteen and fourpence, and then we'll go to work for the new fight with contented hearts. If we're to begin at all, it's time.\"\n\"You mean that you won't begin at all without your money,\" said the lawyer.\n\"That's about it, Mr. Scruby.\"\n\"Take a fifty-pound note, Grimes,\" said the lawyer.\n\"Fifty-pound notes are not so ready,\" said George.\n\"I don't mind the thirteen and four, but if I didn't get all them ninety-two pounds I should be a broken-hearted man; I should indeed, Mr. Vavasor. I couldn't go about your work so as to do you justice among the electors.\"\n\"You'd better give him a bill for ninety pounds at three months, Mr. Vavasor,\" said the attorney.\n\"You must make it ninety-two; you must indeed, Mr. Vavasor. And do make it two months if you can.\"\nGeorge Vavasor and Mr. Scruby yielded at last, so far as to allow the bill to be drawn for ninety-two pounds, but at three months distant.\n\"If it must be, it must,\" said the publican, with a deep sigh, as he folded up the paper and put it away. \"And now, gents, we'll make safe work of this here next election. If we don't win, my name ain't Jacob Grimes. I'll wish you good morning.\" Mr. Grimes bowed himself out of the room.\n\"You couldn't have done it cheaper,\" said the lawyer, once he had gone.\n\"Perhaps not; but what a thief the man is! You told me the bill was preposterous.\"\n\"So it was, and if we hadn't wanted him again of course we shouldn't have paid him. But we'll have it all off his next account, Mr. Vavasor. You see, if he hadn't got your bill, he'd have gone over to the other fellows before the week was over. You've got him cheap. A seat in Parliament is a great thing to a man who wants to make his way; specially a young man like you.\"\n\"Young!\" said George. \"Sometimes it seems as though I've been living for a hundred years. I believe I needn't keep you any longer, Mr. Scruby.\" He saw the attorney out.\n\"Young!\" he said to himself, when he was alone. \"My uncle and the old squire are both younger men than I am. One cares for his dinner, and the other for his bullocks and his trees. But what do I care for, except not getting arrested for debt?\"\nThen he took out a little notebook from his pocket, and having made an entry about the publican's bill, he looked through its pages.\n\"Very blue, indeed,\" he said to himself. \"But nobody shall say I hadn't the courage to play the game out; and that old fellow in Westmorland must die some day. If I were not a fool, I should make it up with him before he went; but I am a fool.\" Then he dressed himself, took up his hat and umbrella and sauntered out.",
        "paragraph_chars": [
            [
                0,
                342
            ],
            [
                342,
                423
            ],
            [
                423,
                513
            ],
            [
                513,
                622
            ],
            [
                622,
                672
            ],
            [
                672,
                988
            ],
            [
                988,
                1045
            ],
            [
                1045,
                1220
            ],
            [
                1220,
                1324
            ],
            [
                1324,
                1619
            ],
            [
                1619,
                1727
            ],
            [
                1727,
                1908
            ],
            [
                1908,
                1968
            ],
            [
                1968,
                2328
            ],
            [
                2328,
                2687
            ],
            [
                2687,
                2779
            ],
            [
                2779,
                2959
            ],
            [
                2959,
                3003
            ],
            [
                3003,
                3132
            ],
            [
                3132,
                3165
            ],
            [
                3165,
                3240
            ],
            [
                3240,
                3287
            ],
            [
                3287,
                3484
            ],
            [
                3484,
                3560
            ],
            [
                3560,
                3591
            ],
            [
                3591,
                3643
            ],
            [
                3643,
                3694
            ],
            [
                3694,
                3917
            ],
            [
                3917,
                4015
            ],
            [
                4015,
                4114
            ],
            [
                4114,
                4253
            ],
            [
                4253,
                4541
            ],
            [
                4541,
                4613
            ],
            [
                4613,
                4696
            ],
            [
                4696,
                5070
            ],
            [
                5070,
                5239
            ],
            [
                5239,
                5483
            ],
            [
                5483,
                5616
            ],
            [
                5616,
                5933
            ]
        ],
        "segment_chars": [
            [
                0,
                74
            ],
            [
                74,
                202
            ],
            [
                202,
                310
            ],
            [
                310,
                342
            ],
            [
                342,
                423
            ],
            [
                423,
                513
            ],
            [
                513,
                598
            ],
            [
                598,
                622
            ],
            [
                622,
                672
            ],
            [
                672,
                704
            ],
            [
                704,
                795
            ],
            [
                795,
                815
            ],
            [
                815,
                934
            ],
            [
                934,
                965
            ],
            [
                965,
                988
            ],
            [
                988,
                1045
            ],
            [
                1045,
                1139
            ],
            [
                1139,
                1220
            ],
            [
                1220,
                1266
            ],
            [
                1266,
                1324
            ],
            [
                1324,
                1372
            ],
            [
                1372,
                1422
            ],
            [
                1422,
                1449
            ],
            [
                1449,
                1493
            ],
            [
                1493,
                1570
            ],
            [
                1570,
                1619
            ],
            [
                1619,
                1662
            ],
            [
                1662,
                1727
            ],
            [
                1727,
                1773
            ],
            [
                1773,
                1801
            ],
            [
                1801,
                1908
            ],
            [
                1908,
                1968
            ],
            [
                1968,
                2046
            ],
            [
                2046,
                2243
            ],
            [
                2243,
                2328
            ],
            [
                2328,
                2345
            ],
            [
                2345,
                2396
            ],
            [
                2396,
                2418
            ],
            [
                2418,
                2538
            ],
            [
                2538,
                2615
            ],
            [
                2615,
                2687
            ],
            [
                2687,
                2741
            ],
            [
                2741,
                2779
            ],
            [
                2779,
                2810
            ],
            [
                2810,
                2959
            ],
            [
                2959,
                3003
            ],
            [
                3003,
                3017
            ],
            [
                3017,
                3095
            ],
            [
                3095,
                3132
            ],
            [
                3132,
                3165
            ],
            [
                3165,
                3240
            ],
            [
                3240,
                3287
            ],
            [
                3287,
                3321
            ],
            [
                3321,
                3446
            ],
            [
                3446,
                3484
            ],
            [
                3484,
                3560
            ],
            [
                3560,
                3591
            ],
            [
                3591,
                3643
            ],
            [
                3643,
                3694
            ],
            [
                3694,
                3842
            ],
            [
                3842,
                3917
            ],
            [
                3917,
                4015
            ],
            [
                4015,
                4075
            ],
            [
                4075,
                4114
            ],
            [
                4114,
                4253
            ],
            [
                4253,
                4359
            ],
            [
                4359,
                4425
            ],
            [
                4425,
                4470
            ],
            [
                4470,
                4499
            ],
            [
                4499,
                4541
            ],
            [
                4541,
                4613
            ],
            [
                4613,
                4656
            ],
            [
                4656,
                4696
            ],
            [
                4696,
                4780
            ],
            [
                4780,
                4837
            ],
            [
                4837,
                4941
            ],
            [
                4941,
                4963
            ],
            [
                4963,
                5070
            ],
            [
                5070,
                5079
            ],
            [
                5079,
                5092
            ],
            [
                5092,
                5160
            ],
            [
                5160,
                5214
            ],
            [
                5214,
                5239
            ],
            [
                5239,
                5248
            ],
            [
                5248,
                5287
            ],
            [
                5287,
                5348
            ],
            [
                5348,
                5420
            ],
            [
                5420,
                5483
            ],
            [
                5483,
                5616
            ],
            [
                5616,
                5657
            ],
            [
                5657,
                5776
            ],
            [
                5776,
                5861
            ],
            [
                5861,
                5933
            ]
        ],
        "overlap_chars": [
            [
                0,
                14
            ],
            [
                15,
                44
            ],
            [
                45,
                72
            ],
            [
                72,
                74
            ],
            [
                74,
                76
            ],
            [
                77,
                92
            ],
            [
                92,
                136
            ],
            [
                137,
                162
            ],
            [
                175,
                200
            ],
            [
                200,
                202
            ],
            [
                202,
                209
            ],
            [
                213,
                217
            ],
            [
                225,
                270
            ],
            [
                271,
                274
            ],
            [
                283,
                308
            ],
            [
                308,
                310
            ],
            [
                310,
                313
            ],
            [
                314,
                321
            ],
            [
                336,
                340
            ],
            [
                340,
                342
            ],
            [
                342,
                353
            ],
            [
                354,
                357
            ],
            [
                362,
                372
            ],
            [
                373,
                377
            ],
            [
                385,
                395
            ],
            [
                400,
                422
            ],
            [
                423,
                513
            ],
            [
                513,
                598
            ],
            [
                598,
                619
            ],
            [
                622,
                672
            ],
            [
                672,
                704
            ],
            [
                704,
                761
            ],
            [
                762,
                795
            ],
            [
                795,
                813
            ],
            [
                813,
                815
            ],
            [
                815,
                871
            ],
            [
                872,
                889
            ],
            [
                890,
                934
            ],
            [
                934,
                942
            ],
            [
                943,
                965
            ],
            [
                965,
                973
            ],
            [
                975,
                988
            ],
            [
                988,
                997
            ],
            [
                998,
                1025
            ],
            [
                1025,
                1045
            ],
            [
                1045,
                1139
            ],
            [
                1139,
                1174
            ],
            [
                1177,
                1220
            ],
            [
                1220,
                1266
            ],
            [
                1266,
                1267
            ],
            [
                1267,
                1270
            ],
            [
                1271,
                1278
            ],
            [
                1279,
                1291
            ],
            [
                1296,
                1313
            ],
            [
                1313,
                1321
            ],
            [
                1321,
                1324
            ],
            [
                1324,
                1337
            ],
            [
                1337,
                1338
            ],
            [
                1339,
                1370
            ],
            [
                1370,
                1372
            ],
            [
                1372,
                1382
            ],
            [
                1394,
                1422
            ],
            [
                1422,
                1447
            ],
            [
                1447,
                1449
            ],
            [
                1449,
                1470
            ],
            [
                1481,
                1493
            ],
            [
                1493,
                1520
            ],
            [
                1521,
                1550
            ],
            [
                1551,
                1568
            ],
            [
                1574,
                1581
            ],
            [
                1592,
                1619
            ],
            [
                1619,
                1624
            ],
            [
                1626,
                1662
            ],
            [
                1662,
                1727
            ],
            [
                1727,
                1773
            ],
            [
                1773,
                1780
            ],
            [
                1781,
                1794
            ],
            [
                1799,
                1801
            ],
            [
                1801,
                1804
            ],
            [
                1805,
                1908
            ],
            [
                1908,
                1968
            ],
            [
                1968,
                1972
            ],
            [
                1972,
                2024
            ],
            [
                2044,
                2046
            ],
            [
                2046,
                2047
            ],
            [
                2047,
                2208
            ],
            [
                2211,
                2218
            ],
            [
                2227,
                2241
            ],
            [
                2241,
                2242
            ],
            [
                2243,
                2260
            ],
            [
                2264,
                2328
            ],
            [
                2328,
                2345
            ],
            [
                2345,
                2355
            ],
            [
                2361,
                2394
            ],
            [
                2394,
                2396
            ],
            [
                2396,
                2418
            ],
            [
                2418,
                2428
            ],
            [
                2429,
                2435
            ],
            [
                2436,
                2442
            ],
            [
                2443,
                2500
            ],
            [
                2501,
                2538
            ],
            [
                2544,
                2573
            ],
            [
                2574,
                2589
            ],
            [
                2592,
                2615
            ],
            [
                2615,
                2618
            ],
            [
                2619,
                2639
            ],
            [
                2640,
                2643
            ],
            [
                2644,
                2645
            ],
            [
                2654,
                2684
            ],
            [
                2684,
                2687
            ],
            [
                2687,
                2741
            ],
            [
                2741,
                2760
            ],
            [
                2770,
                2777
            ],
            [
                2777,
                2779
            ],
            [
                2779,
                2797
            ],
            [
                2808,
                2810
            ],
            [
                2810,
                2881
            ],
            [
                2882,
                2889
            ],
            [
                2890,
                2921
            ],
            [
                2927,
                2956
            ],
            [
                2959,
                3003
            ],
            [
                3003,
                3004
            ],
            [
                3004,
                3017
            ],
            [
                3021,
                3032
            ],
            [
                3032,
                3033
            ],
            [
                3034,
                3095
            ],
            [
                3095,
                3129
            ],
            [
                3129,
                3132
            ],
            [
                3132,
                3149
            ],
            [
                3149,
                3165
            ],
            [
                3166,
                3196
            ],
            [
                3198,
                3222
            ],
            [
                3223,
                3240
            ],
            [
                3240,
                3241
            ],
            [
                3241,
                3242
            ],
            [
                3248,
                3287
            ],
            [
                3287,
                3321
            ],
            [
                3321,
                3322
            ],
            [
                3328,
                3333
            ],
            [
                3337,
                3377
            ],
            [
                3377,
                3446
            ],
            [
                3446,
                3476
            ],
            [
                3477,
                3481
            ],
            [
                3481,
                3484
            ],
            [
                3484,
                3485
            ],
            [
                3485,
                3493
            ],
            [
                3494,
                3560
            ],
            [
                3560,
                3591
            ],
            [
                3591,
                3643
            ],
            [
                3643,
                3694
            ],
            [
                3695,
                3729
            ],
            [
                3729,
                3842
            ],
            [
                3842,
                3871
            ],
            [
                3872,
                3914
            ],
            [
                3917,
                3993
            ],
            [
                4013,
                4014
            ],
            [
                4016,
                4075
            ],
            [
                4075,
                4111
            ],
            [
                4111,
                4114
            ],
            [
                4114,
                4143
            ],
            [
                4144,
                4227
            ],
            [
                4251,
                4252
            ],
            [
                4253,
                4352
            ],
            [
                4357,
                4359
            ],
            [
                4359,
                4375
            ],
            [
                4376,
                4425
            ],
            [
                4425,
                4436
            ],
            [
                4437,
                4468
            ],
            [
                4470,
                4474
            ],
            [
                4475,
                4499
            ],
            [
                4501,
                4509
            ],
            [
                4510,
                4541
            ],
            [
                4541,
                4575
            ],
            [
                4575,
                4594
            ],
            [
                4603,
                4606
            ],
            [
                4611,
                4613
            ],
            [
                4613,
                4656
            ],
            [
                4656,
                4659
            ],
            [
                4665,
                4667
            ],
            [
                4668,
                4680
            ],
            [
                4681,
                4693
            ],
            [
                4693,
                4696
            ],
            [
                4696,
                4780
            ],
            [
                4780,
                4835
            ],
            [
                4846,
                4939
            ],
            [
                4939,
                4941
            ],
            [
                4941,
                4961
            ],
            [
                4961,
                4962
            ],
            [
                4963,
                5036
            ],
            [
                5047,
                5048
            ],
            [
                5049,
                5054
            ],
            [
                5055,
                5058
            ],
            [
                5059,
                5067
            ],
            [
                5067,
                5070
            ],
            [
                5070,
                5079
            ],
            [
                5079,
                5092
            ],
            [
                5092,
                5111
            ],
            [
                5112,
                5160
            ],
            [
                5160,
                5199
            ],
            [
                5199,
                5211
            ],
            [
                5211,
                5214
            ],
            [
                5214,
                5216
            ],
            [
                5221,
                5237
            ],
            [
                5237,
                5239
            ],
            [
                5239,
                5248
            ],
            [
                5251,
                5255
            ],
            [
                5256,
                5279
            ],
            [
                5280,
                5287
            ],
            [
                5287,
                5288
            ],
            [
                5288,
                5296
            ],
            [
                5301,
                5315
            ],
            [
                5320,
                5348
            ],
            [
                5348,
                5420
            ],
            [
                5420,
                5428
            ],
            [
                5432,
                5443
            ],
            [
                5451,
                5462
            ],
            [
                5472,
                5482
            ],
            [
                5483,
                5508
            ],
            [
                5518,
                5526
            ],
            [
                5527,
                5550
            ],
            [
                5551,
                5559
            ],
            [
                5566,
                5580
            ],
            [
                5581,
                5585
            ],
            [
                5585,
                5589
            ],
            [
                5605,
                5615
            ],
            [
                5616,
                5617
            ],
            [
                5617,
                5655
            ],
            [
                5655,
                5657
            ],
            [
                5657,
                5720
            ],
            [
                5722,
                5741
            ],
            [
                5757,
                5774
            ],
            [
                5774,
                5776
            ],
            [
                5776,
                5858
            ],
            [
                5858,
                5861
            ],
            [
                5866,
                5868
            ],
            [
                5884,
                5885
            ],
            [
                5886,
                5933
            ]
        ],
        "row_chars": [
            [
                0,
                74
            ],
            [
                74,
                202
            ],
            [
                202,
                202
            ],
            [
                202,
                310
            ],
            [
                310,
                342
            ],
            [
                342,
                423
            ],
            [
                423,
                513
            ],
            [
                513,
                598
            ],
            [
                598,
                622
            ],
            [
                622,
                622
            ],
            [
                622,
                672
            ],
            [
                672,
                704
            ],
            [
                704,
                795
            ],
            [
                795,
                815
            ],
            [
                815,
                815
            ],
            [
                815,
                934
            ],
            [
                934,
                965
            ],
            [
                965,
                988
            ],
            [
                988,
                1045
            ],
            [
                1045,
                1139
            ],
            [
                1139,
                1139
            ],
            [
                1139,
                1220
            ],
            [
                1220,
                1266
            ],
            [
                1266,
                1324
            ],
            [
                1324,
                1372
            ],
            [
                1372,
                1422
            ],
            [
                1422,
                1449
            ],
            [
                1449,
                1493
            ],
            [
                1493,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1570
            ],
            [
                1570,
                1619
            ],
            [
                1619,
                1662
            ],
            [
                1662,
                1727
            ],
            [
                1727,
                1773
            ],
            [
                1773,
                1801
            ],
            [
                1801,
                1801
            ],
            [
                1801,
                1801
            ],
            [
                1801,
                1801
            ],
            [
                1801,
                1801
            ],
            [
                1801,
                1801
            ],
            [
                1801,
                1801
            ],
            [
                1801,
                1801
            ],
            [
                1801,
                1908
            ],
            [
                1908,
                1968
            ],
            [
                1968,
                2046
            ],
            [
                2046,
                2046
            ],
            [
                2046,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2328
            ],
            [
                2328,
                2345
            ],
            [
                2345,
                2345
            ],
            [
                2345,
                2345
            ],
            [
                2345,
                2345
            ],
            [
                2345,
                2345
            ],
            [
                2345,
                2345
            ],
            [
                2345,
                2396
            ],
            [
                2396,
                2418
            ],
            [
                2418,
                2418
            ],
            [
                2418,
                2418
            ],
            [
                2418,
                2418
            ],
            [
                2418,
                2418
            ],
            [
                2418,
                2418
            ],
            [
                2418,
                2418
            ],
            [
                2418,
                2418
            ],
            [
                2418,
                2418
            ],
            [
                2418,
                2418
            ],
            [
                2418,
                2538
            ],
            [
                2538,
                2538
            ],
            [
                2538,
                2538
            ],
            [
                2538,
                2538
            ],
            [
                2538,
                2538
            ],
            [
                2538,
                2615
            ],
            [
                2615,
                2615
            ],
            [
                2615,
                2615
            ],
            [
                2615,
                2615
            ],
            [
                2615,
                2615
            ],
            [
                2615,
                2615
            ],
            [
                2615,
                2687
            ],
            [
                2687,
                2741
            ],
            [
                2741,
                2779
            ],
            [
                2779,
                2810
            ],
            [
                2810,
                2810
            ],
            [
                2810,
                2959
            ],
            [
                2959,
                2959
            ],
            [
                2959,
                2959
            ],
            [
                2959,
                3003
            ],
            [
                3003,
                3017
            ],
            [
                3017,
                3095
            ],
            [
                3095,
                3132
            ],
            [
                3132,
                3165
            ],
            [
                3165,
                3165
            ],
            [
                3165,
                3165
            ],
            [
                3165,
                3240
            ],
            [
                3240,
                3287
            ],
            [
                3287,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3321
            ],
            [
                3321,
                3446
            ],
            [
                3446,
                3484
            ],
            [
                3484,
                3560
            ],
            [
                3560,
                3591
            ],
            [
                3591,
                3643
            ],
            [
                3643,
                3694
            ],
            [
                3694,
                3694
            ],
            [
                3694,
                3694
            ],
            [
                3694,
                3694
            ],
            [
                3694,
                3842
            ],
            [
                3842,
                3917
            ],
            [
                3917,
                3917
            ],
            [
                3917,
                4015
            ],
            [
                4015,
                4015
            ],
            [
                4015,
                4015
            ],
            [
                4015,
                4015
            ],
            [
                4015,
                4075
            ],
            [
                4075,
                4114
            ],
            [
                4114,
                4253
            ],
            [
                4253,
                4359
            ],
            [
                4359,
                4425
            ],
            [
                4425,
                4470
            ],
            [
                4470,
                4499
            ],
            [
                4499,
                4541
            ],
            [
                4541,
                4613
            ],
            [
                4613,
                4656
            ],
            [
                4656,
                4696
            ],
            [
                4696,
                4780
            ],
            [
                4780,
                4837
            ],
            [
                4837,
                4837
            ],
            [
                4837,
                4837
            ],
            [
                4837,
                4837
            ],
            [
                4837,
                4837
            ],
            [
                4837,
                4941
            ],
            [
                4941,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                4963
            ],
            [
                4963,
                5070
            ],
            [
                5070,
                5079
            ],
            [
                5079,
                5092
            ],
            [
                5092,
                5160
            ],
            [
                5160,
                5214
            ],
            [
                5214,
                5239
            ],
            [
                5239,
                5248
            ],
            [
                5248,
                5287
            ],
            [
                5287,
                5348
            ],
            [
                5348,
                5420
            ],
            [
                5420,
                5483
            ],
            [
                5483,
                5616
            ],
            [
                5616,
                5657
            ],
            [
                5657,
                5776
            ],
            [
                5776,
                5861
            ],
            [
                5861,
                5861
            ],
            [
                5861,
                5933
            ]
        ]
    }
}