{
    "original": {
        "text": "Kate Vavasor had sent to her brother only the first half of her cousin's letter, that half in which Alice had attempted to describe what had taken place between her and Mr. Grey. In doing this, Kate had been a wicked traitor,--a traitor to that feminine faith against which treason on the part of one woman is always unpardonable in the eyes of other women. But her treason would have been of a deeper die had she sent the latter portion, for in that Alice had spoken of George Vavasor himself. But even of this treason, Kate would, I think, have been guilty, had the words which Alice wrote been of a nature to serve her own purpose if read by her brother. But they had not been of this nature. They had spoken of George as a man with whom any closer connection than that which existed at present was impossible, and had been written with the view of begging Kate to desist from making futile attempts in that direction. \"I feel myself driven,\" Alice had said, \"to write all this, as otherwise,--if I were simply to tell you that I have resolved to part from Mr. Grey,--you would think that the other thing might follow. The other thing cannot follow. I should think myself untrue in my friendship to you if I did not tell you about Mr. Grey; and you will be untrue in your friendship to me if you take advantage of my confidence by saying more about your brother.\" This part of Alice's letter Kate had not sent to George Vavasor;--\"But the other thing shall follow,\" Kate had said, as she read the words for the second time, and then put the papers into her desk. \"It shall follow.\"\nTo give Kate Vavasor her due, she was, at any rate, unselfish in her intrigues. She was obstinately persistent, and she was moreover unscrupulous, but she was not selfish. Many years ago she had made up her mind that George and Alice should be man and wife, feeling that such a marriage would be good at any rate for her brother. It had been almost brought about, and had then been hindered altogether through a fault on her brother's part. But she had forgiven him this sin as she had forgiven many others, and she was now at work in his behalf again, determined that they two should be married, even though neither of them might be now anxious that it should be so. The intrigue itself was dear to her, and success in it was necessary to her self-respect.\nShe answered Alice's letter with a pleasant, gossiping epistle, which shall be recorded, as it will tell us something of Mrs. Greenow's proceedings at Yarmouth. Kate had promised to stay at Yarmouth for a month, but she had already been there six weeks, and was still under her aunt's wing.\nYarmouth, October, 186--.\nDEAREST ALICE,\nOf course I am delighted. It is no good saying that I am not. I know how difficult it is to deal with you, and therefore I sit down to answer your letter with fear and trembling, lest I should say a word too much, and thereby drive you back, or not say quite enough and thereby fail to encourage you on. Of course I am glad. I have long thought that Mr. Grey could not make you happy, and as I have thought so, how can I not be glad? It is no use saying that he is good and noble, and all that sort of thing. I have never denied it. But he was not suited to you, and his life would have made you wretched. Ergo, I rejoice. And as you are the dearest friend I have, of course I rejoice mightily.\nI can understand accurately the sort of way in which the interview went. Of course he had the best of it. I can see him so plainly as he stood up in unruffled self-possession, ignoring all that you said, suggesting that you were feverish or perhaps bilious, waving his hand over you a little, as though that might possibly do you some small good, and then taking his leave with an assurance that it would be all right as soon as the wind changed. I suppose it's very noble in him, not taking you at your word, and giving you, as it were, another chance; but there is a kind of nobility which is almost too great for this world. I think very well of you, my dear, as women go, but I do not think well enough of you to believe that you are fit to be Mr. John Grey's wife.\nOf course I'm very glad. You have known my mind from the first to the last, and, therefore, what would be the good of my mincing matters? No woman wishes her dearest friend to marry a man to whom she herself is antipathetic. You would have been as much lost to me, had you become Mrs. Grey of Nethercoats, Cambridgeshire, as though you had gone to heaven. I don't say but what Nethercoats may be a kind of heaven,--but then one doesn't wish one's friend that distant sort of happiness. A flat Eden I can fancy it, hemmed in by broad dykes, in which cream and eggs are very plentiful, where an Adam and an Eve might drink the choicest tea out of the finest china, with toast buttered to perfection, from year's end to year's end; into which no money troubles would ever find their way, nor yet any naughty novels. But such an Eden is not tempting to me, nor, as I think, to you. I can fancy you stretching your poor neck over the dyke, longing to fly away that you might cease to be at rest, but knowing that the matrimonial dragon was too strong for any such flight. If ever bird banged his wings to pieces against gilded bars, you would have banged yours to pieces in that cage.\nYou say that you have failed to make him understand that the matter is settled. I need not say that of course it is settled, and that he must be made to understand it. You owe it to him now to put him out of all doubt. He is, I suppose, accessible to the words of a mortal, god though he be. But I do not fear about this, for, after all, you have as much firmness about you as most people;--perhaps as much as he has at bottom, though you may not have so many occasions to show it.\nAs to that other matter I can only say that you shall be obliged, as far as it is in my power to obey you. For what may come out from me by word of mouth when we are together, I will not answer with certainty. But my pen is under better control, and it shall not write the offending name.\nAnd now I must tell you a little about myself;--or rather, I am inclined to spin a yarn, and tell you a great deal. I have got such a lover! But I did describe him before. Of course it's Mr. Cheesacre. If I were to say he hasn't declared himself, I should hardly give you a fair idea of my success. And yet he has not declared himself,--and, which is worse, is very anxious to marry a rival. But it's a strong point in my favour that my rival wants him to take me, and that he will assuredly be driven to make me an offer sooner or later, in obedience to her orders. My aunt is my rival, and I do not feel the least doubt as to his having offered to her half a dozen times. But then she has another lover, Captain Bellfield, and I see that she prefers him. He is a penniless scamp and looks as though he drank. He paints his whiskers too, which I don't like; and, being forty, tries to look like twenty-five. Otherwise he is agreeable enough, and I rather approve of my aunt's taste in preferring him.\nBut my lover has solid attractions, and allures me on by a description of the fat cattle which he sends to market. He is a man of substance, and should I ever become Mrs. Cheesacre, I have reason to think that I shall not be left in want. We went up to his place on a visit the other day. Oileymead is the name of my future home;--not so pretty as Nethercoats, is it? And we had such a time there! We reached the place at ten and left it at four, and he managed to give us three meals. I'm sure we had before our eyes at different times every bit of china, delf, glass, and plate in the establishment. He made us go into the cellar, and told us how much wine he had got there, and how much beer. \"It's all paid for, Mrs. Greenow, every bottle of it,\" he said, turning round to my aunt, with a pathetic earnestness, for which I had hardly given him credit. \"Everything in this house is my own; it's all paid for. I don't call anything a man's own till it's paid for. Now that jacket that Bellfield swells about with on the sands at Yarmouth,--that's not his own,--and it's not like to be either.\" And then he winked his eye as though bidding my aunt to think of that before she encouraged such a lover as Bellfield. He took us into every bedroom, and disclosed to us all the glories of his upper chambers. It would have done you good to see him lifting the counterpanes, and bidding my aunt feel the texture of the blankets! And then to see her turn round to me and say:--\"Kate, it's simply the best-furnished house I ever went over in my life!\"--\"It does seem very comfortable,\" said I. \"Comfortable!\" said he. \"Yes, I don't think there's anybody can say that Oileymead isn't comfortable.\" I did so think of you and Nethercoats. The attractions are the same;--only in the one place you would have a god for your keeper, and in the other a brute. For myself, if ever I'm to have a keeper at all, I shall prefer a man. But when we got to the farmyard his eloquence reached the highest pitch. \"Mrs. Greenow,\" said he, \"look at that,\" and he pointed to heaps of manure raised like the streets of a little city. \"Look at that!\" \"There's a great deal,\" said my aunt. \"I believe you,\" said he. \"I've more muck upon this place here than any farmer in Norfolk, gentle or simple; I don't care who the other is.\" Only fancy, Alice; it may all be mine; the blankets, the wine, the muck, and the rest of it. So my aunt assured me when we got home that evening. When I remarked that the wealth had been exhibited to her and not to me, she did not affect to deny it, but treated that as a matter of no moment. \"He wants a wife, my dear,\" she said, \"and you may pick him up to-morrow by putting out your hand.\" When I remarked that his mind seemed to be intent on low things, and specially named the muck, she only laughed at me. \"Money's never dirty,\" she said, \"nor yet what makes money.\" She talks of taking lodgings in Norwich for the winter, saying that in her widowed state she will be as well there as anywhere else, and she wants me to stay with her up to Christmas. Indeed she first proposed the Norwich plan on the ground that it might be useful to me,--with a view to Mr. Cheesacre, of course; but I fancy that she is unwilling to tear herself away from Captain Bellfield. At any rate to Norwich she will go, and I have promised not to leave her before the second week in November. With all her absurdities I like her. Her faults are terrible faults, but she has not the fault of hiding them by falsehood. She is never stupid, and she is very good-natured. She would have allowed me to equip myself from head to foot at her expense, if I would have accepted her liberality, and absolutely offered to give me my trousseau if I would marry Mr. Cheesacre.\nI live in the hope that you will come down to the old place at Christmas. I won't offend you more than I can help. At any rate he won't be there. And if I don't see you there, where am I to see you? If I were you I would certainly not go to Cheltenham. You are never happy there.\nDo you ever dream of the river at Basle? I do;--so often.\nMost affectionately yours,\nKATE VAVASOR.\n[Illustration: \"Mrs. Greenow, look at that.\"]\nAlice had almost lost the sensation created by the former portion of Kate's letter by the fun of the latter, before she had quite made that sensation her own. The picture of the Cambridgeshire Eden would have displeased her had she dwelt upon it, and the allusion to the cream and toast would have had the very opposite effect to that which Kate had intended. Perhaps Kate had felt this, and had therefore merged it all in her stories about Mr. Cheesacre. \"I will go to Cheltenham,\" she said to herself. \"He has recommended it. I shall never be his wife;--but, till we have parted altogether, I will show him that I think well of his advice.\" That same afternoon she told her father that she would go to Lady Macleod's at Cheltenham before the end of the month. She was, in truth, prompted to this by a resolution, of which she was herself hardly conscious, that she would not at this period of her life be in any way guided by her cousin. Having made up her mind about Mr. Grey, it was right that she should let her cousin know her purpose; but she would never be driven to confess to herself that Kate had influenced her in the matter. She would go to Cheltenham. Lady Macleod would no doubt vex her by hourly solicitations that the match might be renewed; but, if she knew herself, she had strength to withstand Lady Macleod.\nShe received one letter from Mr. Grey before the time came for her departure, and she answered it, telling him of her intention;--telling him also that she now felt herself bound to explain to her father her present position. \"I tell you this,\" she said, \"in consequence of what you said to me on the matter. My father will know it to-morrow, and on the following morning I shall start for Cheltenham. I have heard from Lady Macleod and she expects me.\"\nOn the following morning she did tell her father, standing by him as he sat at his breakfast. \"What!\" said he, putting down his tea-cup and looking up into her face; \"What! not marry John Grey!\"\n\"No, papa; I know how strange you must think it.\"\n\"And you say that there has been no quarrel.\"\n\"No;--there has been no quarrel. By degrees I have learned to feel that I should not make him happy as his wife.\"\n\"It's d----d nonsense,\" said Mr. Vavasor. Now such an expression as this from him, addressed to his daughter, showed that he was very deeply moved.\n\"Oh, papa! don't talk to me in that way.\"\n\"But it is. I never heard such trash in my life. If he comes to me I shall tell him so. Not make him happy! Why can't you make him happy?\"\n\"We are not suited to each other.\"\n\"But what's the matter with him? He's a gentleman.\"\n\"Yes; he's a gentleman.\"\n\"And a man of honour, and with good means, and with all that knowledge and reading which you profess to like. Look here, Alice; I am not going to interfere, nor shall I attempt to make you marry anyone. You are your own mistress as far as that is concerned. But I do hope, for your sake and for mine,--I do hope that there is nothing again between you and your cousin.\"\n\"There is nothing, papa.\"\n\"I did not like your going abroad with him, though I didn't choose to interrupt your plan by saying so. But if there were anything of that kind going on, I should be bound to tell you that your cousin's position at present is not a good one. Men do not speak well of him.\"\n\"There is nothing between us, papa; but if there were, men speaking ill of him would not deter me.\"\n\"And men speaking well of Mr. Grey will not do the other thing. I know very well that women can be obstinate.\"\n\"I haven't come to this resolution without thinking much about it, papa.\"\n\"I suppose not. Well;--I can't say anything more. You are your own mistress, and your fortune is in your own keeping. I can't make you marry John Grey. I think you very foolish, and if he comes to me I shall tell him so. You are going down to Cheltenham, are you?\"\n\"Yes, papa; I have promised Lady Macleod.\"\n\"Very well. I'd sooner it should be you than me; that's all I can say.\" Then he took up his newspaper, thereby showing that he had nothing further to say on the matter, and Alice left him alone.\nThe whole thing was so vexatious that even Mr. Vavasor was disturbed by it. As it was not term time he had no signing to do in Chancery Lane, and could not, therefore, bury his unhappiness in his daily labour,--or rather in his labour that was by no means daily. So he sat at home till four o'clock, expressing to himself in various phrases his wonder that \"any man alive should ever rear a daughter.\" And when he got to his club the waiters found him quite unmanageable about his dinner, which he ate alone, rejecting all proposition of companionship. But later in the evening he regained his composure over a glass of whiskey-toddy and a cigar. \"She's got her own money,\" he said to himself, \"and what does it matter? I don't suppose she'll marry her cousin. I don't think she's fool enough for that. And after all she'll probably make it up again with John Grey.\" And in this way he determined that he might let this annoyance run off him, and that he need not as a father take the trouble of any interference.\nBut while he was at his club there came a visitor to Queen Anne Street, and that visitor was the dangerous cousin of whom, according to his uncle's testimony, men at present did not speak well. Alice had not seen him since they had parted on the day of their arrival in London,--nor, indeed, had heard of his whereabouts. In the consternation of her mind at this step which she was taking,--a step which she had taught herself to regard as essentially her duty before it was taken, but which seemed to herself to be false and treacherous the moment she had taken it,--she had become aware that she had been wrong to travel with her cousin. She felt sure,--she thought that she was sure,--that her doing so had in nowise affected her dealings with Mr. Grey. She was very certain,--she thought that she was certain,--that she would have rejected him just the same had she never gone to Switzerland. But every one would say of her that her journey to Switzerland with such companions had produced that result. It had been unlucky and she was sorry for it, and she now wished to avoid all communication with her cousin till this affair should be altogether over. She was especially unwilling to see him; but she had not felt it necessary to give any special injunctions as to his admittance; and now, before she had time to think of it,--on the eve of her departure for Cheltenham,--he was in the room with her, just as the dusk of the October evening was coming on. She was sitting away from the fire, almost behind the window-curtains, thinking of John Grey and very unhappy in her thoughts, when George Vavasor was announced. It will of course be understood that Vavasor had at this time received his sister's letter. He had received it, and had had time to consider the matter since the Sunday morning on which we saw him in his own rooms in Cecil Street. \"She can turn it all into capital to-morrow, if she pleases,\" he had said to himself when thinking of her income. But he had also reminded himself that her grandfather would probably enable him to settle an income out of the property upon Alice, in the event of their being married. And then he had also felt that he could have no greater triumph than \"walking atop of John Grey,\" as he called it. His return for the Chelsea Districts would hardly be sweeter to him than that.\n\"You must have thought I had vanished out of the world,\" said George, coming up to her with his extended hand.\nAlice was confused, and hardly knew how to address him. \"Somebody told me that you were shooting,\" she said after a pause.\n\"So I was, but my shooting is not like the shooting of your great Nimrods,--men who are hunters upon the earth. Two days among the grouse and two more among the partridges are about the extent of it. Capel Court is the preserve in which I am usually to be found.\"\nAlice knew nothing of Capel Court, and said, \"Oh, indeed.\"\n\"Have you heard from Kate?\" George asked.\n\"Yes, once or twice; she is still at Yarmouth with Aunt Greenow.\"\n\"And is going to Norwich, as she says. Kate seems to have made a league with Aunt Greenow. I, who don't pretend to be very disinterested in money matters, think that she is quite right. No doubt Aunt Greenow may marry again, but friends with forty thousand pounds are always agreeable.\"\n\"I don't believe that Kate thinks much of that,\" said Alice.\n\"Not so much as she ought, I dare say. Poor Kate is not a rich woman, or, I fear, likely to become one. She doesn't seem to dream of getting married, and her own fortune is less than a hundred a year.\"\n\"Girls who never dream of getting married are just those who make the best marriages at last,\" said Alice.\n\"Perhaps so, but I wish I was easier about Kate. She is the best sister a man ever had.\"\n\"Indeed she is.\"\n\"And I have done nothing for her as yet. I did think, while I was in that wine business, that I could have done anything I pleased for her. But my grandfather's obstinacy put me out of that; and now I'm beginning the world again,--that is, comparatively. I wonder whether you think I'm wrong in trying to get into Parliament?\"\n\"No; quite right. I admire you for it. It is just what I would do in your place. You are unmarried, and have a right to run the risk.\"\n\"I am so glad to hear you speak like that,\" said he. He had now managed to take up that friendly, confidential, almost affectionate tone of talking which he had so often used when abroad with her, and which he had failed to assume when first entering the room.\n\"I have always thought so.\"\n\"But you have never said it.\"\n\"Haven't I? I thought I had.\"\n\"Not heartily like that. I know that people abuse me;--my own people, my grandfather, and probably your father,--saying that I am reckless and the rest of it. I do risk everything for my object; but I do not know that any one can blame me,--unless it be Kate. To whom else do I owe anything?\"\n\"Kate does not blame you.\"\n\"No; she sympathizes with me; she, and she only, unless it be you.\" Then he paused for an answer, but she made him none. \"She is brave enough to give me her hearty sympathy. But perhaps for that very reason I ought to be the more chary in endangering the only support that she is like to have. What is ninety pounds a year for the maintenance of a single lady?\"\n\"I hope that Kate will always live with me,\" said Alice; \"that is, as soon as she has lost her home at Vavasor Hall.\"\nHe had been very crafty and had laid a trap for her. He had laid a trap for her, and she had fallen into it. She had determined not to be induced to talk of herself; but he had brought the thing round so cunningly that the words were out of her mouth before she remembered whither they would lead her. She did remember this as she was speaking them, but then it was too late.\n\"What;--at Nethercoats?\" said he. \"Neither she nor I doubt your love, but few men would like such an intruder as that into their household, and of all men Mr. Grey, whose nature is retiring, would like it the least.\"\n\"I was not thinking of Nethercoats,\" said Alice.\n\"Ah, no; that is it, you see. Kate says so often to me that when you are married she will be alone in the world.\"\n\"I don't think she will ever find that I shall separate myself from her.\"\n\"No; not by any will of your own. Poor Kate! You cannot be surprised that she should think of your marriage with dread. How much of her life has been made up of her companionship with you;--and all the best of it too! You ought not to be angry with her for regarding your withdrawal into Cambridgeshire with dismay.\"\nAlice could not act the lie which now seemed to be incumbent on her. She could not let him talk of Nethercoats as though it were to be her future home. She made the struggle, and she found that she could not do it. She was unable to find the words which should tell no lie to the ear, and which should yet deceive him. \"Kate may still live with me,\" she said slowly. \"Everything is over between me and Mr. Grey.\"\n\"Alice!--is that true?\"\n\"Yes, George; it is true. If you will allow me to say so, I would rather not talk about it;--not just at present.\"\n\"And does Kate know it?\"\n\"Yes, Kate knows it.\"\n\"And my uncle?\"\n\"Yes, papa knows it also.\"\n\"Alice, how can I help speaking of it? How can I not tell you that I am rejoiced that you are saved from a thraldom which I have long felt sure would break your heart?\"\n\"Pray do not talk of it further.\"\n\"Well; if I am forbidden I shall of course obey. But I own it is hard to me. How can I not congratulate you?\" To this she answered nothing, but beat with her foot upon the floor as though she were impatient of his words. \"Yes, Alice, I understand. You are angry with me,\" he continued. \"And yet you have no right to be surprised that when you tell me this I should think of all that passed between us in Switzerland. Surely the cousin who was with you then has a right to say what he thinks of this change in your life; at any rate he may do so, if as in this case he approves altogether of what you are doing.\"\n\"I am glad of your approval, George; but pray let that be an end to it.\"\nAfter that the two sat silent for a minute or two. She was waiting for him to go, but she could not bid him leave the house. She was angry with herself, in that she had allowed herself to tell him of her altered plans, and she was angry with him because he would not understand that she ought to be spared all conversation on the subject. So she sat looking through the window at the row of gaslights as they were being lit, and he remained in his chair with his elbow on the table and his head resting on his hand.\n\"Do you remember asking me whether I ever shivered,\" he said at last; \"--whether I ever thought of things that made me shiver? Don't you remember; on the bridge at Basle?\"\n\"Yes; I remember.\"\n\"Well, Alice;--one cause for my shivering is over. I won't say more than that now. Shall you remain long at Cheltenham?\"\n\"Just a month.\"\n\"And then you come back here?\"\n\"I suppose so. Papa and I will probably go down to Vavasor Hall before Christmas. How much before I cannot say.\"\n\"I shall see you at any rate after your return from Cheltenham? Of course Kate will know, and she will tell me.\"\n\"Yes; Kate will know. I suppose she will stay here when she comes up from Norfolk. Good-bye.\"\n\"Good-bye, Alice. I shall have fewer fits of that inward shivering that you spoke of,--many less, on account of what I have now heard. God bless you, Alice; good-bye.\"\n\"Good-bye, George.\"\nAs he went he took her hand and pressed it closely between his own. In those days when they were lovers,--engaged lovers, a close, long-continued pressure of her hand had been his most eloquent speech of love. He had not been given to many kisses,--not even to many words of love. But he would take her hand and hold it, even as he looked away from her, and she remembered well the touch of his palm. It was ever cool,--cool, and with a surface smooth as a woman's,--a small hand that had a firm grip. There had been days when she had loved to feel that her own was within it, when she trusted in it, and intended that it should be her staff through life. Now she distrusted it; and as the thoughts of the old days came upon her, and the remembrance of that touch was recalled, she drew her hand away rapidly. Not for that had she driven from her as honest a man as had ever wished to mate with a woman. He, George Vavasor, had never so held her hand since the day when they had parted, and now on this first occasion of her freedom she felt it again. What did he think of her? Did he suppose that she could transfer her love in that way, as a flower may be taken from one buttonhole and placed in another? He read it all, and knew that he was hurrying on too quickly. \"I can understand well,\" he said in a whisper, \"what your present feelings are; but I do not think you will be really angry with me because I have been unable to repress my joy at what I cannot but regard as your release from a great misfortune.\" Then he went.\n\"My release!\" she said, seating herself on the chair from which he had risen. \"My release from a misfortune! No;--but my fall from heaven! Oh, what a man he is! That he should have loved me, and that I should have driven him away from me!\" Her thoughts travelled off to the sweetness of that home at Nethercoats, to the excellence of that master who might have been hers; and then in an agony of despair she told herself that she had been an idiot and a fool, as well as a traitor. What had she wanted in life that she should have thus quarrelled with as happy a lot as ever had been offered to a woman? Had she not been mad, when she sent from her side the only man that she loved,--the only man that she had ever truly respected? For hours she sat there, all alone, putting out the candles which the servant had lighted for her, and leaving untasted the tea that was brought to her.\nPoor Alice! I hope that she may be forgiven. It was her special fault, that when at Rome she longed for Tibur, and when at Tibur she regretted Rome. Not that her cousin George is to be taken as representing the joys of the great capital, though Mr. Grey may be presumed to form no inconsiderable part of the promised delights of the country. Now that she had sacrificed her Tibur, because it had seemed to her that the sunny quiet of its pastures lacked the excitement necessary for the happiness of life, she was again prepared to quarrel with the heartlessness of Rome, and already was again sighing for the tranquillity of the country.\nSitting there, full of these regrets, she declared to herself that she would wait for her father's return, and then, throwing herself upon his love and upon his mercy, would beg him to go to Mr. Grey and ask for pardon for her. \"I should be very humble to him,\" she said; \"but he is so good, that I may dare to be humble before him.\" So she waited for her father. She waited till twelve, till one, till two;--but still he did not come. Later than that she did not dare to wait for him. She feared to trust him on such business returning so late as that,--after so many cigars; after, perhaps, some superfluous beakers of club nectar. His temper at such a moment would not be fit for such work as hers. But if he was late in coming home, who had sent him away from his home in unhappiness? Between two and three she went to bed, and on the following morning she left Queen Anne Street for the Great Western Station before her father was up.",
        "paragraph_chars": [
            [
                0,
                1585
            ],
            [
                1585,
                2343
            ],
            [
                2343,
                2634
            ],
            [
                2634,
                2660
            ],
            [
                2660,
                2675
            ],
            [
                2675,
                3370
            ],
            [
                3370,
                4140
            ],
            [
                4140,
                5320
            ],
            [
                5320,
                5802
            ],
            [
                5802,
                6091
            ],
            [
                6091,
                7093
            ],
            [
                7093,
                10841
            ],
            [
                10841,
                11121
            ],
            [
                11121,
                11179
            ],
            [
                11179,
                11206
            ],
            [
                11206,
                11220
            ],
            [
                11220,
                11266
            ],
            [
                11266,
                12595
            ],
            [
                12595,
                13049
            ],
            [
                13049,
                13244
            ],
            [
                13244,
                13294
            ],
            [
                13294,
                13340
            ],
            [
                13340,
                13454
            ],
            [
                13454,
                13602
            ],
            [
                13602,
                13644
            ],
            [
                13644,
                13783
            ],
            [
                13783,
                13818
            ],
            [
                13818,
                13870
            ],
            [
                13870,
                13895
            ],
            [
                13895,
                14265
            ],
            [
                14265,
                14291
            ],
            [
                14291,
                14564
            ],
            [
                14564,
                14664
            ],
            [
                14664,
                14775
            ],
            [
                14775,
                14849
            ],
            [
                14849,
                15114
            ],
            [
                15114,
                15157
            ],
            [
                15157,
                15352
            ],
            [
                15352,
                16366
            ],
            [
                16366,
                18699
            ],
            [
                18699,
                18810
            ],
            [
                18810,
                18933
            ],
            [
                18933,
                19197
            ],
            [
                19197,
                19256
            ],
            [
                19256,
                19298
            ],
            [
                19298,
                19364
            ],
            [
                19364,
                19651
            ],
            [
                19651,
                19712
            ],
            [
                19712,
                19914
            ],
            [
                19914,
                20021
            ],
            [
                20021,
                20110
            ],
            [
                20110,
                20127
            ],
            [
                20127,
                20454
            ],
            [
                20454,
                20589
            ],
            [
                20589,
                20850
            ],
            [
                20850,
                20878
            ],
            [
                20878,
                20908
            ],
            [
                20908,
                20938
            ],
            [
                20938,
                21231
            ],
            [
                21231,
                21258
            ],
            [
                21258,
                21620
            ],
            [
                21620,
                21738
            ],
            [
                21738,
                22114
            ],
            [
                22114,
                22331
            ],
            [
                22331,
                22380
            ],
            [
                22380,
                22494
            ],
            [
                22494,
                22568
            ],
            [
                22568,
                22885
            ],
            [
                22885,
                23298
            ],
            [
                23298,
                23322
            ],
            [
                23322,
                23437
            ],
            [
                23437,
                23462
            ],
            [
                23462,
                23484
            ],
            [
                23484,
                23500
            ],
            [
                23500,
                23527
            ],
            [
                23527,
                23696
            ],
            [
                23696,
                23730
            ],
            [
                23730,
                24342
            ],
            [
                24342,
                24415
            ],
            [
                24415,
                24931
            ],
            [
                24931,
                25103
            ],
            [
                25103,
                25122
            ],
            [
                25122,
                25243
            ],
            [
                25243,
                25259
            ],
            [
                25259,
                25290
            ],
            [
                25290,
                25403
            ],
            [
                25403,
                25516
            ],
            [
                25516,
                25610
            ],
            [
                25610,
                25778
            ],
            [
                25778,
                25798
            ],
            [
                25798,
                27328
            ],
            [
                27328,
                28213
            ],
            [
                28213,
                28852
            ],
            [
                28852,
                29791
            ]
        ],
        "segment_chars": [
            [
                0,
                179
            ],
            [
                179,
                358
            ],
            [
                358,
                495
            ],
            [
                495,
                658
            ],
            [
                658,
                696
            ],
            [
                696,
                922
            ],
            [
                922,
                1122
            ],
            [
                1122,
                1153
            ],
            [
                1153,
                1367
            ],
            [
                1367,
                1566
            ],
            [
                1566,
                1585
            ],
            [
                1585,
                1665
            ],
            [
                1665,
                1757
            ],
            [
                1757,
                1915
            ],
            [
                1915,
                2026
            ],
            [
                2026,
                2253
            ],
            [
                2253,
                2343
            ],
            [
                2343,
                2504
            ],
            [
                2504,
                2634
            ],
            [
                2634,
                2660
            ],
            [
                2660,
                2675
            ],
            [
                2675,
                2701
            ],
            [
                2701,
                2737
            ],
            [
                2737,
                2979
            ],
            [
                2979,
                3000
            ],
            [
                3000,
                3109
            ],
            [
                3109,
                3184
            ],
            [
                3184,
                3208
            ],
            [
                3208,
                3281
            ],
            [
                3281,
                3298
            ],
            [
                3298,
                3370
            ],
            [
                3370,
                3443
            ],
            [
                3443,
                3476
            ],
            [
                3476,
                3817
            ],
            [
                3817,
                3998
            ],
            [
                3998,
                4140
            ],
            [
                4140,
                4165
            ],
            [
                4165,
                4278
            ],
            [
                4278,
                4365
            ],
            [
                4365,
                4496
            ],
            [
                4496,
                4626
            ],
            [
                4626,
                4953
            ],
            [
                4953,
                5018
            ],
            [
                5018,
                5207
            ],
            [
                5207,
                5320
            ],
            [
                5320,
                5400
            ],
            [
                5400,
                5488
            ],
            [
                5488,
                5539
            ],
            [
                5539,
                5612
            ],
            [
                5612,
                5802
            ],
            [
                5802,
                5909
            ],
            [
                5909,
                6012
            ],
            [
                6012,
                6091
            ],
            [
                6091,
                6207
            ],
            [
                6207,
                6232
            ],
            [
                6232,
                6263
            ],
            [
                6263,
                6293
            ],
            [
                6293,
                6390
            ],
            [
                6390,
                6483
            ],
            [
                6483,
                6658
            ],
            [
                6658,
                6765
            ],
            [
                6765,
                6848
            ],
            [
                6848,
                6902
            ],
            [
                6902,
                7000
            ],
            [
                7000,
                7093
            ],
            [
                7093,
                7208
            ],
            [
                7208,
                7332
            ],
            [
                7332,
                7382
            ],
            [
                7382,
                7461
            ],
            [
                7461,
                7491
            ],
            [
                7491,
                7579
            ],
            [
                7579,
                7695
            ],
            [
                7695,
                7789
            ],
            [
                7789,
                7949
            ],
            [
                7949,
                8005
            ],
            [
                8005,
                8059
            ],
            [
                8059,
                8189
            ],
            [
                8189,
                8308
            ],
            [
                8308,
                8398
            ],
            [
                8398,
                8517
            ],
            [
                8517,
                8637
            ],
            [
                8637,
                8680
            ],
            [
                8680,
                8695
            ],
            [
                8695,
                8704
            ],
            [
                8704,
                8783
            ],
            [
                8783,
                8822
            ],
            [
                8822,
                8939
            ],
            [
                8939,
                9010
            ],
            [
                9010,
                9083
            ],
            [
                9083,
                9200
            ],
            [
                9200,
                9216
            ],
            [
                9216,
                9254
            ],
            [
                9254,
                9280
            ],
            [
                9280,
                9395
            ],
            [
                9395,
                9488
            ],
            [
                9488,
                9541
            ],
            [
                9541,
                9688
            ],
            [
                9688,
                9788
            ],
            [
                9788,
                9907
            ],
            [
                9907,
                9968
            ],
            [
                9968,
                10152
            ],
            [
                10152,
                10361
            ],
            [
                10361,
                10470
            ],
            [
                10470,
                10507
            ],
            [
                10507,
                10594
            ],
            [
                10594,
                10645
            ],
            [
                10645,
                10841
            ],
            [
                10841,
                10915
            ],
            [
                10915,
                10956
            ],
            [
                10956,
                10987
            ],
            [
                10987,
                11040
            ],
            [
                11040,
                11094
            ],
            [
                11094,
                11121
            ],
            [
                11121,
                11162
            ],
            [
                11162,
                11179
            ],
            [
                11179,
                11206
            ],
            [
                11206,
                11220
            ],
            [
                11220,
                11266
            ],
            [
                11266,
                11425
            ],
            [
                11425,
                11626
            ],
            [
                11626,
                11722
            ],
            [
                11722,
                11770
            ],
            [
                11770,
                11794
            ],
            [
                11794,
                11909
            ],
            [
                11909,
                12028
            ],
            [
                12028,
                12206
            ],
            [
                12206,
                12404
            ],
            [
                12404,
                12432
            ],
            [
                12432,
                12595
            ],
            [
                12595,
                12821
            ],
            [
                12821,
                12904
            ],
            [
                12904,
                12997
            ],
            [
                12997,
                13049
            ],
            [
                13049,
                13143
            ],
            [
                13143,
                13151
            ],
            [
                13151,
                13222
            ],
            [
                13222,
                13244
            ],
            [
                13244,
                13294
            ],
            [
                13294,
                13340
            ],
            [
                13340,
                13373
            ],
            [
                13373,
                13454
            ],
            [
                13454,
                13496
            ],
            [
                13496,
                13602
            ],
            [
                13602,
                13613
            ],
            [
                13613,
                13644
            ],
            [
                13644,
                13656
            ],
            [
                13656,
                13693
            ],
            [
                13693,
                13732
            ],
            [
                13732,
                13752
            ],
            [
                13752,
                13783
            ],
            [
                13783,
                13818
            ],
            [
                13818,
                13851
            ],
            [
                13851,
                13870
            ],
            [
                13870,
                13895
            ],
            [
                13895,
                14005
            ],
            [
                14005,
                14098
            ],
            [
                14098,
                14153
            ],
            [
                14153,
                14265
            ],
            [
                14265,
                14291
            ],
            [
                14291,
                14395
            ],
            [
                14395,
                14533
            ],
            [
                14533,
                14564
            ],
            [
                14564,
                14664
            ],
            [
                14664,
                14728
            ],
            [
                14728,
                14775
            ],
            [
                14775,
                14849
            ],
            [
                14849,
                14865
            ],
            [
                14865,
                14899
            ],
            [
                14899,
                14967
            ],
            [
                14967,
                15001
            ],
            [
                15001,
                15070
            ],
            [
                15070,
                15114
            ],
            [
                15114,
                15157
            ],
            [
                15157,
                15169
            ],
            [
                15169,
                15229
            ],
            [
                15229,
                15352
            ],
            [
                15352,
                15428
            ],
            [
                15428,
                15615
            ],
            [
                15615,
                15754
            ],
            [
                15754,
                15905
            ],
            [
                15905,
                15999
            ],
            [
                15999,
                16072
            ],
            [
                16072,
                16113
            ],
            [
                16113,
                16155
            ],
            [
                16155,
                16219
            ],
            [
                16219,
                16366
            ],
            [
                16366,
                16560
            ],
            [
                16560,
                16688
            ],
            [
                16688,
                17006
            ],
            [
                17006,
                17123
            ],
            [
                17123,
                17263
            ],
            [
                17263,
                17373
            ],
            [
                17373,
                17525
            ],
            [
                17525,
                17829
            ],
            [
                17829,
                17991
            ],
            [
                17991,
                18083
            ],
            [
                18083,
                18222
            ],
            [
                18222,
                18336
            ],
            [
                18336,
                18505
            ],
            [
                18505,
                18620
            ],
            [
                18620,
                18699
            ],
            [
                18699,
                18810
            ],
            [
                18810,
                18866
            ],
            [
                18866,
                18933
            ],
            [
                18933,
                19045
            ],
            [
                19045,
                19133
            ],
            [
                19133,
                19197
            ],
            [
                19197,
                19256
            ],
            [
                19256,
                19284
            ],
            [
                19284,
                19298
            ],
            [
                19298,
                19364
            ],
            [
                19364,
                19403
            ],
            [
                19403,
                19455
            ],
            [
                19455,
                19550
            ],
            [
                19550,
                19651
            ],
            [
                19651,
                19712
            ],
            [
                19712,
                19751
            ],
            [
                19751,
                19816
            ],
            [
                19816,
                19914
            ],
            [
                19914,
                20021
            ],
            [
                20021,
                20070
            ],
            [
                20070,
                20110
            ],
            [
                20110,
                20127
            ],
            [
                20127,
                20168
            ],
            [
                20168,
                20267
            ],
            [
                20267,
                20382
            ],
            [
                20382,
                20454
            ],
            [
                20454,
                20472
            ],
            [
                20472,
                20493
            ],
            [
                20493,
                20535
            ],
            [
                20535,
                20589
            ],
            [
                20589,
                20642
            ],
            [
                20642,
                20850
            ],
            [
                20850,
                20878
            ],
            [
                20878,
                20908
            ],
            [
                20908,
                20920
            ],
            [
                20920,
                20938
            ],
            [
                20938,
                20963
            ],
            [
                20963,
                21097
            ],
            [
                21097,
                21198
            ],
            [
                21198,
                21231
            ],
            [
                21231,
                21258
            ],
            [
                21258,
                21326
            ],
            [
                21326,
                21379
            ],
            [
                21379,
                21432
            ],
            [
                21432,
                21552
            ],
            [
                21552,
                21620
            ],
            [
                21620,
                21738
            ],
            [
                21738,
                21791
            ],
            [
                21791,
                21847
            ],
            [
                21847,
                22040
            ],
            [
                22040,
                22114
            ],
            [
                22114,
                22139
            ],
            [
                22139,
                22148
            ],
            [
                22148,
                22331
            ],
            [
                22331,
                22380
            ],
            [
                22380,
                22410
            ],
            [
                22410,
                22494
            ],
            [
                22494,
                22568
            ],
            [
                22568,
                22602
            ],
            [
                22602,
                22613
            ],
            [
                22613,
                22688
            ],
            [
                22688,
                22786
            ],
            [
                22786,
                22885
            ],
            [
                22885,
                22954
            ],
            [
                22954,
                23037
            ],
            [
                23037,
                23100
            ],
            [
                23100,
                23204
            ],
            [
                23204,
                23252
            ],
            [
                23252,
                23298
            ],
            [
                23298,
                23322
            ],
            [
                23322,
                23348
            ],
            [
                23348,
                23437
            ],
            [
                23437,
                23462
            ],
            [
                23462,
                23484
            ],
            [
                23484,
                23500
            ],
            [
                23500,
                23527
            ],
            [
                23527,
                23566
            ],
            [
                23566,
                23696
            ],
            [
                23696,
                23730
            ],
            [
                23730,
                23779
            ],
            [
                23779,
                23807
            ],
            [
                23807,
                23840
            ],
            [
                23840,
                23951
            ],
            [
                23951,
                23978
            ],
            [
                23978,
                24016
            ],
            [
                24016,
                24147
            ],
            [
                24147,
                24342
            ],
            [
                24342,
                24415
            ],
            [
                24415,
                24466
            ],
            [
                24466,
                24540
            ],
            [
                24540,
                24754
            ],
            [
                24754,
                24931
            ],
            [
                24931,
                25058
            ],
            [
                25058,
                25103
            ],
            [
                25103,
                25122
            ],
            [
                25122,
                25173
            ],
            [
                25173,
                25205
            ],
            [
                25205,
                25243
            ],
            [
                25243,
                25259
            ],
            [
                25259,
                25290
            ],
            [
                25290,
                25305
            ],
            [
                25305,
                25372
            ],
            [
                25372,
                25403
            ],
            [
                25403,
                25467
            ],
            [
                25467,
                25516
            ],
            [
                25516,
                25538
            ],
            [
                25538,
                25599
            ],
            [
                25599,
                25610
            ],
            [
                25610,
                25628
            ],
            [
                25628,
                25745
            ],
            [
                25745,
                25778
            ],
            [
                25778,
                25798
            ],
            [
                25798,
                25866
            ],
            [
                25866,
                26008
            ],
            [
                26008,
                26079
            ],
            [
                26079,
                26199
            ],
            [
                26199,
                26300
            ],
            [
                26300,
                26454
            ],
            [
                26454,
                26608
            ],
            [
                26608,
                26702
            ],
            [
                26702,
                26850
            ],
            [
                26850,
                26876
            ],
            [
                26876,
                27005
            ],
            [
                27005,
                27067
            ],
            [
                27067,
                27314
            ],
            [
                27314,
                27328
            ],
            [
                27328,
                27342
            ],
            [
                27342,
                27406
            ],
            [
                27406,
                27437
            ],
            [
                27437,
                27467
            ],
            [
                27467,
                27489
            ],
            [
                27489,
                27568
            ],
            [
                27568,
                27810
            ],
            [
                27810,
                27932
            ],
            [
                27932,
                28060
            ],
            [
                28060,
                28213
            ],
            [
                28213,
                28225
            ],
            [
                28225,
                28258
            ],
            [
                28258,
                28362
            ],
            [
                28362,
                28555
            ],
            [
                28555,
                28852
            ],
            [
                28852,
                29080
            ],
            [
                29080,
                29186
            ],
            [
                29186,
                29216
            ],
            [
                29216,
                29288
            ],
            [
                29288,
                29338
            ],
            [
                29338,
                29486
            ],
            [
                29486,
                29554
            ],
            [
                29554,
                29641
            ],
            [
                29641,
                29791
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                91,
                109
            ],
            [
                161,
                164
            ],
            [
                169,
                179
            ],
            [
                179,
                224
            ],
            [
                237,
                239
            ],
            [
                356,
                358
            ],
            [
                358,
                389
            ],
            [
                410,
                413
            ],
            [
                406,
                409
            ],
            [
                414,
                422
            ],
            [
                437,
                438
            ],
            [
                443,
                445
            ],
            [
                451,
                494
            ],
            [
                521,
                525
            ],
            [
                542,
                546
            ],
            [
                499,
                503
            ],
            [
                507,
                511
            ],
            [
                519,
                520
            ],
            [
                634,
                636
            ],
            [
                580,
                585
            ],
            [
                667,
                674
            ],
            [
                705,
                762
            ],
            [
                798,
                812
            ],
            [
                656,
                657
            ],
            [
                560,
                563
            ],
            [
                860,
                867
            ],
            [
                880,
                921
            ],
            [
                922,
                995
            ],
            [
                1000,
                1001
            ],
            [
                1017,
                1069
            ],
            [
                1071,
                1122
            ],
            [
                1122,
                1151
            ],
            [
                1433,
                1473
            ],
            [
                1478,
                1505
            ],
            [
                1564,
                1565
            ],
            [
                1585,
                1622
            ],
            [
                1637,
                1665
            ],
            [
                1665,
                1700
            ],
            [
                1718,
                1757
            ],
            [
                1757,
                1915
            ],
            [
                1915,
                1921
            ],
            [
                1927,
                1933
            ],
            [
                1947,
                1975
            ],
            [
                1987,
                1994
            ],
            [
                2006,
                2019
            ],
            [
                1997,
                2002
            ],
            [
                2024,
                2026
            ],
            [
                2026,
                2029
            ],
            [
                2097,
                2116
            ],
            [
                2120,
                2153
            ],
            [
                2159,
                2180
            ],
            [
                2251,
                2253
            ],
            [
                2253,
                2301
            ],
            [
                2308,
                2343
            ],
            [
                2343,
                2405
            ],
            [
                2464,
                2504
            ],
            [
                2504,
                2596
            ],
            [
                2611,
                2633
            ],
            [
                2660,
                2675
            ],
            [
                2675,
                2701
            ],
            [
                2701,
                2735
            ],
            [
                2737,
                2738
            ],
            [
                2810,
                2871
            ],
            [
                2879,
                2887
            ],
            [
                2977,
                2979
            ],
            [
                3000,
                3058
            ],
            [
                3134,
                3182
            ],
            [
                3208,
                3281
            ],
            [
                3287,
                3297
            ],
            [
                3370,
                3375
            ],
            [
                3376,
                3386
            ],
            [
                3423,
                3443
            ],
            [
                3476,
                3500
            ],
            [
                3516,
                3518
            ],
            [
                3733,
                3736
            ],
            [
                3519,
                3607
            ],
            [
                3626,
                3652
            ],
            [
                3663,
                3683
            ],
            [
                3693,
                3699
            ],
            [
                3711,
                3720
            ],
            [
                3743,
                3817
            ],
            [
                3817,
                3850
            ],
            [
                3884,
                3997
            ],
            [
                4140,
                4165
            ],
            [
                4278,
                4327
            ],
            [
                4331,
                4347
            ],
            [
                4363,
                4365
            ],
            [
                4365,
                4384
            ],
            [
                4393,
                4403
            ],
            [
                4385,
                4387
            ],
            [
                4420,
                4444
            ],
            [
                4494,
                4496
            ],
            [
                4496,
                4497
            ],
            [
                4650,
                4652
            ],
            [
                4970,
                4972
            ],
            [
                4536,
                4537
            ],
            [
                5129,
                5134
            ],
            [
                5207,
                5320
            ],
            [
                5320,
                5400
            ],
            [
                5420,
                5448
            ],
            [
                5454,
                5488
            ],
            [
                5488,
                5538
            ],
            [
                6091,
                6137
            ],
            [
                6139,
                6149
            ],
            [
                6184,
                6207
            ],
            [
                6207,
                6232
            ],
            [
                6236,
                6237
            ],
            [
                6251,
                6263
            ],
            [
                6263,
                6293
            ],
            [
                6713,
                6715
            ],
            [
                6394,
                6426
            ],
            [
                6428,
                6432
            ],
            [
                6489,
                6491
            ],
            [
                6442,
                6481
            ],
            [
                6658,
                6665
            ],
            [
                6481,
                6482
            ],
            [
                6483,
                6486
            ],
            [
                6534,
                6555
            ],
            [
                6565,
                6572
            ],
            [
                6583,
                6657
            ],
            [
                6778,
                6819
            ],
            [
                6831,
                6848
            ],
            [
                6848,
                6902
            ],
            [
                6902,
                6928
            ],
            [
                6948,
                6949
            ],
            [
                7000,
                7032
            ],
            [
                7091,
                7093
            ],
            [
                7093,
                7127
            ],
            [
                7206,
                7208
            ],
            [
                7208,
                7276
            ],
            [
                7311,
                7332
            ],
            [
                7332,
                7339
            ],
            [
                7343,
                7345
            ],
            [
                7361,
                7366
            ],
            [
                7346,
                7355
            ],
            [
                7367,
                7382
            ],
            [
                7382,
                7394
            ],
            [
                7399,
                7403
            ],
            [
                7461,
                7491
            ],
            [
                7491,
                7579
            ],
            [
                7579,
                7590
            ],
            [
                7630,
                7648
            ],
            [
                7654,
                7695
            ],
            [
                7695,
                7751
            ],
            [
                7770,
                7773
            ],
            [
                7783,
                7787
            ],
            [
                7752,
                7768
            ],
            [
                7787,
                7788
            ],
            [
                7789,
                7835
            ],
            [
                7841,
                7851
            ],
            [
                7879,
                7906
            ],
            [
                7947,
                7949
            ],
            [
                8005,
                8059
            ],
            [
                8059,
                8107
            ],
            [
                8135,
                8153
            ],
            [
                8186,
                8188
            ],
            [
                8308,
                8342
            ],
            [
                8356,
                8362
            ],
            [
                8367,
                8374
            ],
            [
                8396,
                8398
            ],
            [
                8417,
                8420
            ],
            [
                8407,
                8411
            ],
            [
                8433,
                8436
            ],
            [
                8467,
                8491
            ],
            [
                8500,
                8517
            ],
            [
                8517,
                8520
            ],
            [
                8542,
                8557
            ],
            [
                8561,
                8562
            ],
            [
                8564,
                8637
            ],
            [
                8704,
                8708
            ],
            [
                8708,
                8709
            ],
            [
                8740,
                8783
            ],
            [
                8783,
                8784
            ],
            [
                8798,
                8822
            ],
            [
                8822,
                8851
            ],
            [
                8853,
                8938
            ],
            [
                9010,
                9082
            ],
            [
                9083,
                9157
            ],
            [
                9198,
                9200
            ],
            [
                9280,
                9343
            ],
            [
                9392,
                9395
            ],
            [
                9395,
                9488
            ],
            [
                9488,
                9541
            ],
            [
                9541,
                9625
            ],
            [
                9636,
                9648
            ],
            [
                9720,
                9725
            ],
            [
                9688,
                9713
            ],
            [
                9727,
                9738
            ],
            [
                9744,
                9747
            ],
            [
                9761,
                9787
            ],
            [
                9788,
                9794
            ],
            [
                9873,
                9899
            ],
            [
                9905,
                9907
            ],
            [
                9907,
                9944
            ],
            [
                9949,
                9968
            ],
            [
                9968,
                10022
            ],
            [
                10099,
                10152
            ],
            [
                10286,
                10361
            ],
            [
                10361,
                10372
            ],
            [
                10395,
                10396
            ],
            [
                10401,
                10470
            ],
            [
                10470,
                10494
            ],
            [
                10531,
                10538
            ],
            [
                10495,
                10506
            ],
            [
                10594,
                10645
            ],
            [
                10645,
                10648
            ],
            [
                10766,
                10841
            ],
            [
                10841,
                10842
            ],
            [
                10855,
                10878
            ],
            [
                10884,
                10915
            ],
            [
                10915,
                10956
            ],
            [
                10956,
                10987
            ],
            [
                11040,
                11094
            ],
            [
                11094,
                11121
            ],
            [
                11121,
                11162
            ],
            [
                11162,
                11167
            ],
            [
                11169,
                11179
            ],
            [
                11179,
                11206
            ],
            [
                11206,
                11220
            ],
            [
                11722,
                11748
            ],
            [
                11753,
                11757
            ],
            [
                11758,
                11768
            ],
            [
                11768,
                11770
            ],
            [
                11770,
                11794
            ],
            [
                11794,
                11820
            ],
            [
                11822,
                11825
            ],
            [
                11859,
                11909
            ],
            [
                11909,
                11913
            ],
            [
                11919,
                11998
            ],
            [
                12026,
                12027
            ],
            [
                12028,
                12055
            ],
            [
                12064,
                12142
            ],
            [
                12170,
                12172
            ],
            [
                12184,
                12204
            ],
            [
                12204,
                12206
            ],
            [
                12404,
                12432
            ],
            [
                12432,
                12470
            ],
            [
                12492,
                12528
            ],
            [
                12551,
                12595
            ],
            [
                12595,
                12639
            ],
            [
                12671,
                12705
            ],
            [
                12742,
                12759
            ],
            [
                12768,
                12784
            ],
            [
                12640,
                12643
            ],
            [
                12811,
                12819
            ],
            [
                12785,
                12798
            ],
            [
                12819,
                12820
            ],
            [
                13049,
                13077
            ],
            [
                13087,
                13097
            ],
            [
                13125,
                13127
            ],
            [
                13132,
                13142
            ],
            [
                13143,
                13151
            ],
            [
                13151,
                13184
            ],
            [
                13215,
                13222
            ],
            [
                13222,
                13244
            ],
            [
                13244,
                13294
            ],
            [
                13294,
                13298
            ],
            [
                13312,
                13337
            ],
            [
                13340,
                13343
            ],
            [
                13371,
                13373
            ],
            [
                13384,
                13454
            ],
            [
                13454,
                13461
            ],
            [
                13465,
                13494
            ],
            [
                13535,
                13536
            ],
            [
                13583,
                13602
            ],
            [
                13602,
                13613
            ],
            [
                13613,
                13644
            ],
            [
                13644,
                13656
            ],
            [
                13656,
                13693
            ],
            [
                13693,
                13732
            ],
            [
                13732,
                13752
            ],
            [
                13752,
                13783
            ],
            [
                13783,
                13818
            ],
            [
                13818,
                13851
            ],
            [
                13851,
                13870
            ],
            [
                13870,
                13874
            ],
            [
                13892,
                13895
            ],
            [
                13895,
                14005
            ],
            [
                14005,
                14050
            ],
            [
                14096,
                14098
            ],
            [
                14098,
                14123
            ],
            [
                14151,
                14153
            ],
            [
                14153,
                14156
            ],
            [
                14197,
                14265
            ],
            [
                14265,
                14291
            ],
            [
                14291,
                14350
            ],
            [
                14358,
                14360
            ],
            [
                14391,
                14395
            ],
            [
                14395,
                14398
            ],
            [
                14445,
                14446
            ],
            [
                14466,
                14479
            ],
            [
                14533,
                14557
            ],
            [
                14480,
                14491
            ],
            [
                14561,
                14564
            ],
            [
                14564,
                14664
            ],
            [
                14664,
                14726
            ],
            [
                14726,
                14728
            ],
            [
                14776,
                14777
            ],
            [
                14832,
                14849
            ],
            [
                14967,
                15001
            ],
            [
                15001,
                15068
            ],
            [
                15229,
                15352
            ],
            [
                15352,
                15389
            ],
            [
                15758,
                15762
            ],
            [
                15395,
                15406
            ],
            [
                15770,
                15839
            ],
            [
                15903,
                15905
            ],
            [
                15905,
                15962
            ],
            [
                15972,
                15998
            ],
            [
                15999,
                16072
            ],
            [
                16113,
                16144
            ],
            [
                16095,
                16112
            ],
            [
                16155,
                16158
            ],
            [
                16169,
                16219
            ],
            [
                16235,
                16237
            ],
            [
                16299,
                16315
            ],
            [
                16328,
                16332
            ],
            [
                16348,
                16351
            ],
            [
                16321,
                16327
            ],
            [
                16337,
                16344
            ],
            [
                16364,
                16366
            ],
            [
                16366,
                16394
            ],
            [
                16406,
                16415
            ],
            [
                16401,
                16405
            ],
            [
                16416,
                16436
            ],
            [
                16459,
                16479
            ],
            [
                16558,
                16560
            ],
            [
                16560,
                16607
            ],
            [
                16619,
                16642
            ],
            [
                16686,
                16688
            ],
            [
                16688,
                16690
            ],
            [
                16712,
                16715
            ],
            [
                16721,
                16754
            ],
            [
                16757,
                16805
            ],
            [
                16818,
                16826
            ],
            [
                16846,
                16931
            ],
            [
                16934,
                17005
            ],
            [
                17006,
                17019
            ],
            [
                17072,
                17075
            ],
            [
                17086,
                17123
            ],
            [
                17123,
                17143
            ],
            [
                17146,
                17157
            ],
            [
                17163,
                17178
            ],
            [
                17181,
                17227
            ],
            [
                17261,
                17263
            ],
            [
                17263,
                17266
            ],
            [
                17277,
                17286
            ],
            [
                17294,
                17310
            ],
            [
                17347,
                17350
            ],
            [
                17415,
                17426
            ],
            [
                17431,
                17480
            ],
            [
                17411,
                17414
            ],
            [
                17427,
                17430
            ],
            [
                17523,
                17525
            ],
            [
                17697,
                17698
            ],
            [
                17570,
                17581
            ],
            [
                17608,
                17611
            ],
            [
                17638,
                17691
            ],
            [
                17742,
                17743
            ],
            [
                17745,
                17785
            ],
            [
                17798,
                17805
            ],
            [
                17786,
                17790
            ],
            [
                17814,
                17828
            ],
            [
                17829,
                17864
            ],
            [
                17926,
                17991
            ],
            [
                18083,
                18089
            ],
            [
                18053,
                18081
            ],
            [
                18101,
                18142
            ],
            [
                18081,
                18082
            ],
            [
                18222,
                18235
            ],
            [
                18239,
                18242
            ],
            [
                18324,
                18334
            ],
            [
                18243,
                18255
            ],
            [
                18265,
                18306
            ],
            [
                18334,
                18336
            ],
            [
                18336,
                18404
            ],
            [
                18412,
                18435
            ],
            [
                18456,
                18466
            ],
            [
                18436,
                18442
            ],
            [
                18447,
                18455
            ],
            [
                18496,
                18505
            ],
            [
                18505,
                18508
            ],
            [
                18514,
                18600
            ],
            [
                18699,
                18767
            ],
            [
                18808,
                18810
            ],
            [
                18810,
                18815
            ],
            [
                18820,
                18829
            ],
            [
                18834,
                18866
            ],
            [
                18866,
                18933
            ],
            [
                18933,
                18947
            ],
            [
                19045,
                19104
            ],
            [
                19109,
                19133
            ],
            [
                19257,
                19283
            ],
            [
                19298,
                19364
            ],
            [
                19364,
                19403
            ],
            [
                19403,
                19426
            ],
            [
                19436,
                19453
            ],
            [
                19456,
                19457
            ],
            [
                19455,
                19456
            ],
            [
                19519,
                19550
            ],
            [
                19593,
                19651
            ],
            [
                19651,
                19689
            ],
            [
                19693,
                19712
            ],
            [
                19712,
                19751
            ],
            [
                19751,
                19816
            ],
            [
                19816,
                19914
            ],
            [
                19914,
                20021
            ],
            [
                20021,
                20070
            ],
            [
                20070,
                20110
            ],
            [
                20110,
                20127
            ],
            [
                20168,
                20238
            ],
            [
                20258,
                20267
            ],
            [
                20267,
                20297
            ],
            [
                20312,
                20355
            ],
            [
                20358,
                20382
            ],
            [
                20382,
                20454
            ],
            [
                20454,
                20458
            ],
            [
                20472,
                20493
            ],
            [
                20493,
                20535
            ],
            [
                20535,
                20589
            ],
            [
                20589,
                20642
            ],
            [
                20642,
                20699
            ],
            [
                20721,
                20749
            ],
            [
                20753,
                20784
            ],
            [
                20848,
                20850
            ],
            [
                20850,
                20878
            ],
            [
                20878,
                20908
            ],
            [
                20908,
                20920
            ],
            [
                20920,
                20938
            ],
            [
                20938,
                20963
            ],
            [
                20963,
                20990
            ],
            [
                21006,
                21007
            ],
            [
                21058,
                21097
            ],
            [
                21097,
                21155
            ],
            [
                21164,
                21177
            ],
            [
                21179,
                21198
            ],
            [
                21198,
                21231
            ],
            [
                21231,
                21258
            ],
            [
                21258,
                21287
            ],
            [
                21305,
                21326
            ],
            [
                21326,
                21379
            ],
            [
                21379,
                21432
            ],
            [
                21432,
                21478
            ],
            [
                21483,
                21487
            ],
            [
                21494,
                21537
            ],
            [
                21543,
                21550
            ],
            [
                21620,
                21642
            ],
            [
                21650,
                21686
            ],
            [
                21698,
                21738
            ],
            [
                21738,
                21765
            ],
            [
                21794,
                21847
            ],
            [
                21847,
                21854
            ],
            [
                21855,
                21869
            ],
            [
                21884,
                21907
            ],
            [
                21957,
                22010
            ],
            [
                22019,
                22039
            ],
            [
                22114,
                22119
            ],
            [
                22122,
                22139
            ],
            [
                22139,
                22148
            ],
            [
                22148,
                22149
            ],
            [
                22188,
                22223
            ],
            [
                22232,
                22331
            ],
            [
                22331,
                22380
            ],
            [
                22380,
                22387
            ],
            [
                22408,
                22410
            ],
            [
                22410,
                22419
            ],
            [
                22423,
                22491
            ],
            [
                22602,
                22613
            ],
            [
                22613,
                22652
            ],
            [
                22681,
                22686
            ],
            [
                22662,
                22675
            ],
            [
                22686,
                22688
            ],
            [
                22688,
                22755
            ],
            [
                22784,
                22786
            ],
            [
                22786,
                22839
            ],
            [
                22871,
                22885
            ],
            [
                22958,
                23036
            ],
            [
                23204,
                23252
            ],
            [
                23252,
                23298
            ],
            [
                23298,
                23304
            ],
            [
                23307,
                23322
            ],
            [
                23322,
                23334
            ],
            [
                23346,
                23348
            ],
            [
                23380,
                23412
            ],
            [
                23424,
                23437
            ],
            [
                23437,
                23462
            ],
            [
                23462,
                23466
            ],
            [
                23481,
                23484
            ],
            [
                23484,
                23500
            ],
            [
                23500,
                23527
            ],
            [
                23527,
                23566
            ],
            [
                23594,
                23650
            ],
            [
                23666,
                23693
            ],
            [
                23696,
                23730
            ],
            [
                23730,
                23736
            ],
            [
                23755,
                23779
            ],
            [
                23779,
                23782
            ],
            [
                23807,
                23840
            ],
            [
                23840,
                23917
            ],
            [
                23927,
                23951
            ],
            [
                23951,
                23978
            ],
            [
                23978,
                24016
            ],
            [
                24158,
                24164
            ],
            [
                24187,
                24249
            ],
            [
                24276,
                24278
            ],
            [
                24295,
                24306
            ],
            [
                24318,
                24320
            ],
            [
                24339,
                24342
            ],
            [
                24342,
                24415
            ],
            [
                24415,
                24466
            ],
            [
                24466,
                24528
            ],
            [
                24538,
                24540
            ],
            [
                24540,
                24567
            ],
            [
                24592,
                24754
            ],
            [
                24754,
                24798
            ],
            [
                24806,
                24809
            ],
            [
                24816,
                24868
            ],
            [
                24929,
                24931
            ],
            [
                24931,
                24999
            ],
            [
                25001,
                25002
            ],
            [
                25078,
                25103
            ],
            [
                25103,
                25122
            ],
            [
                25122,
                25134
            ],
            [
                25137,
                25173
            ],
            [
                25173,
                25205
            ],
            [
                25205,
                25243
            ],
            [
                25243,
                25259
            ],
            [
                25259,
                25290
            ],
            [
                25290,
                25305
            ],
            [
                25305,
                25332
            ],
            [
                25338,
                25370
            ],
            [
                25403,
                25467
            ],
            [
                25467,
                25491
            ],
            [
                25513,
                25516
            ],
            [
                25538,
                25547
            ],
            [
                25552,
                25581
            ],
            [
                25585,
                25599
            ],
            [
                25599,
                25610
            ],
            [
                25610,
                25628
            ],
            [
                25628,
                25651
            ],
            [
                25734,
                25737
            ],
            [
                25652,
                25694
            ],
            [
                25743,
                25745
            ],
            [
                25745,
                25778
            ],
            [
                25778,
                25798
            ],
            [
                25809,
                25866
            ],
            [
                25866,
                25868
            ],
            [
                25875,
                25894
            ],
            [
                25918,
                25927
            ],
            [
                25944,
                26008
            ],
            [
                26008,
                26044
            ],
            [
                26047,
                26079
            ],
            [
                26079,
                26117
            ],
            [
                26150,
                26199
            ],
            [
                26199,
                26205
            ],
            [
                26233,
                26234
            ],
            [
                26211,
                26216
            ],
            [
                26243,
                26249
            ],
            [
                26222,
                26223
            ],
            [
                26267,
                26300
            ],
            [
                26300,
                26398
            ],
            [
                26430,
                26453
            ],
            [
                26454,
                26480
            ],
            [
                26576,
                26608
            ],
            [
                26850,
                26876
            ],
            [
                26876,
                27004
            ],
            [
                27005,
                27066
            ],
            [
                27067,
                27094
            ],
            [
                27112,
                27246
            ],
            [
                27275,
                27314
            ],
            [
                27314,
                27328
            ],
            [
                27328,
                27342
            ],
            [
                27342,
                27350
            ],
            [
                27404,
                27406
            ],
            [
                27406,
                27437
            ],
            [
                27437,
                27440
            ],
            [
                27446,
                27467
            ],
            [
                27467,
                27489
            ],
            [
                27489,
                27557
            ],
            [
                27565,
                27568
            ],
            [
                27568,
                27661
            ],
            [
                27667,
                27673
            ],
            [
                27698,
                27703
            ],
            [
                27709,
                27810
            ],
            [
                27932,
                27967
            ],
            [
                27982,
                28009
            ],
            [
                28012,
                28060
            ],
            [
                28060,
                28095
            ],
            [
                28163,
                28213
            ],
            [
                28213,
                28225
            ],
            [
                28225,
                28258
            ],
            [
                28852,
                29003
            ],
            [
                29013,
                29079
            ],
            [
                29080,
                29186
            ],
            [
                29186,
                29216
            ],
            [
                29216,
                29259
            ],
            [
                29261,
                29288
            ],
            [
                29288,
                29338
            ],
            [
                29486,
                29506
            ],
            [
                29514,
                29534
            ],
            [
                29552,
                29554
            ],
            [
                29641,
                29743
            ],
            [
                29758,
                29791
            ]
        ],
        "row_chars": [
            [
                0,
                179
            ],
            [
                179,
                358
            ],
            [
                358,
                495
            ],
            [
                495,
                922
            ],
            [
                922,
                1122
            ],
            [
                1122,
                1153
            ],
            [
                1153,
                1367
            ],
            [
                1367,
                1566
            ],
            [
                1566,
                1585
            ],
            [
                1585,
                1665
            ],
            [
                1665,
                1757
            ],
            [
                1757,
                1915
            ],
            [
                1915,
                2026
            ],
            [
                2026,
                2253
            ],
            [
                2253,
                2343
            ],
            [
                2343,
                2504
            ],
            [
                2504,
                2634
            ],
            [
                2634,
                2660
            ],
            [
                2660,
                2675
            ],
            [
                2675,
                2701
            ],
            [
                2701,
                2979
            ],
            [
                2979,
                3000
            ],
            [
                3000,
                3109
            ],
            [
                3109,
                3281
            ],
            [
                3281,
                3298
            ],
            [
                3298,
                3370
            ],
            [
                3370,
                3443
            ],
            [
                3443,
                3476
            ],
            [
                3476,
                3817
            ],
            [
                3817,
                3998
            ],
            [
                3998,
                4140
            ],
            [
                4140,
                4165
            ],
            [
                4165,
                4278
            ],
            [
                4278,
                4365
            ],
            [
                4365,
                4496
            ],
            [
                4496,
                5320
            ],
            [
                5320,
                5400
            ],
            [
                5400,
                5488
            ],
            [
                5488,
                5539
            ],
            [
                5539,
                5612
            ],
            [
                5612,
                5802
            ],
            [
                5802,
                5909
            ],
            [
                5909,
                6012
            ],
            [
                6012,
                6091
            ],
            [
                6091,
                6207
            ],
            [
                6207,
                6232
            ],
            [
                6232,
                6263
            ],
            [
                6263,
                6293
            ],
            [
                6293,
                6390
            ],
            [
                6390,
                6765
            ],
            [
                6765,
                6848
            ],
            [
                6848,
                6902
            ],
            [
                6902,
                7093
            ],
            [
                7093,
                7208
            ],
            [
                7208,
                7332
            ],
            [
                7332,
                7382
            ],
            [
                7382,
                7491
            ],
            [
                7491,
                7579
            ],
            [
                7579,
                7695
            ],
            [
                7695,
                7789
            ],
            [
                7789,
                7949
            ],
            [
                7949,
                8005
            ],
            [
                8005,
                8059
            ],
            [
                8059,
                8189
            ],
            [
                8189,
                8308
            ],
            [
                8308,
                8398
            ],
            [
                8398,
                8517
            ],
            [
                8517,
                8637
            ],
            [
                8637,
                8680
            ],
            [
                8680,
                8695
            ],
            [
                8695,
                8704
            ],
            [
                8704,
                8783
            ],
            [
                8783,
                8822
            ],
            [
                8822,
                8939
            ],
            [
                8939,
                9010
            ],
            [
                9010,
                9083
            ],
            [
                9083,
                9200
            ],
            [
                9200,
                9216
            ],
            [
                9216,
                9254
            ],
            [
                9254,
                9280
            ],
            [
                9280,
                9395
            ],
            [
                9395,
                9488
            ],
            [
                9488,
                9541
            ],
            [
                9541,
                9788
            ],
            [
                9788,
                9907
            ],
            [
                9907,
                9968
            ],
            [
                9968,
                10152
            ],
            [
                10152,
                10361
            ],
            [
                10361,
                10470
            ],
            [
                10470,
                10594
            ],
            [
                10594,
                10645
            ],
            [
                10645,
                10841
            ],
            [
                10841,
                10915
            ],
            [
                10915,
                10956
            ],
            [
                10956,
                10987
            ],
            [
                10987,
                11040
            ],
            [
                11040,
                11094
            ],
            [
                11094,
                11121
            ],
            [
                11121,
                11162
            ],
            [
                11162,
                11179
            ],
            [
                11179,
                11206
            ],
            [
                11206,
                11220
            ],
            [
                11220,
                11266
            ],
            [
                11266,
                11425
            ],
            [
                11425,
                11626
            ],
            [
                11626,
                11722
            ],
            [
                11722,
                11770
            ],
            [
                11770,
                11794
            ],
            [
                11794,
                11909
            ],
            [
                11909,
                12028
            ],
            [
                12028,
                12206
            ],
            [
                12206,
                12404
            ],
            [
                12404,
                12432
            ],
            [
                12432,
                12595
            ],
            [
                12595,
                12821
            ],
            [
                12821,
                12904
            ],
            [
                12904,
                12997
            ],
            [
                12997,
                13049
            ],
            [
                13049,
                13143
            ],
            [
                13143,
                13151
            ],
            [
                13151,
                13222
            ],
            [
                13222,
                13244
            ],
            [
                13244,
                13294
            ],
            [
                13294,
                13340
            ],
            [
                13340,
                13373
            ],
            [
                13373,
                13454
            ],
            [
                13454,
                13602
            ],
            [
                13602,
                13613
            ],
            [
                13613,
                13644
            ],
            [
                13644,
                13656
            ],
            [
                13656,
                13693
            ],
            [
                13693,
                13732
            ],
            [
                13732,
                13752
            ],
            [
                13752,
                13783
            ],
            [
                13783,
                13818
            ],
            [
                13818,
                13851
            ],
            [
                13851,
                13870
            ],
            [
                13870,
                13895
            ],
            [
                13895,
                14005
            ],
            [
                14005,
                14098
            ],
            [
                14098,
                14153
            ],
            [
                14153,
                14265
            ],
            [
                14265,
                14291
            ],
            [
                14291,
                14395
            ],
            [
                14395,
                14564
            ],
            [
                14564,
                14664
            ],
            [
                14664,
                14728
            ],
            [
                14728,
                14775
            ],
            [
                14775,
                14849
            ],
            [
                14849,
                14865
            ],
            [
                14865,
                14899
            ],
            [
                14899,
                14967
            ],
            [
                14967,
                15001
            ],
            [
                15001,
                15070
            ],
            [
                15070,
                15114
            ],
            [
                15114,
                15157
            ],
            [
                15157,
                15169
            ],
            [
                15169,
                15229
            ],
            [
                15229,
                15352
            ],
            [
                15352,
                15905
            ],
            [
                15905,
                15999
            ],
            [
                15999,
                16072
            ],
            [
                16072,
                16155
            ],
            [
                16155,
                16219
            ],
            [
                16219,
                16366
            ],
            [
                16366,
                16560
            ],
            [
                16560,
                16688
            ],
            [
                16688,
                17006
            ],
            [
                17006,
                17123
            ],
            [
                17123,
                17263
            ],
            [
                17263,
                17525
            ],
            [
                17525,
                17829
            ],
            [
                17829,
                17991
            ],
            [
                17991,
                18222
            ],
            [
                18222,
                18336
            ],
            [
                18336,
                18505
            ],
            [
                18505,
                18620
            ],
            [
                18620,
                18699
            ],
            [
                18699,
                18810
            ],
            [
                18810,
                18866
            ],
            [
                18866,
                18933
            ],
            [
                18933,
                19133
            ],
            [
                19133,
                19197
            ],
            [
                19197,
                19256
            ],
            [
                19256,
                19284
            ],
            [
                19284,
                19298
            ],
            [
                19298,
                19364
            ],
            [
                19364,
                19403
            ],
            [
                19403,
                19550
            ],
            [
                19550,
                19651
            ],
            [
                19651,
                19712
            ],
            [
                19712,
                19751
            ],
            [
                19751,
                19816
            ],
            [
                19816,
                19914
            ],
            [
                19914,
                20021
            ],
            [
                20021,
                20070
            ],
            [
                20070,
                20110
            ],
            [
                20110,
                20127
            ],
            [
                20127,
                20168
            ],
            [
                20168,
                20267
            ],
            [
                20267,
                20382
            ],
            [
                20382,
                20454
            ],
            [
                20454,
                20493
            ],
            [
                20493,
                20535
            ],
            [
                20535,
                20589
            ],
            [
                20589,
                20642
            ],
            [
                20642,
                20850
            ],
            [
                20850,
                20878
            ],
            [
                20878,
                20908
            ],
            [
                20908,
                20920
            ],
            [
                20920,
                20938
            ],
            [
                20938,
                20963
            ],
            [
                20963,
                21097
            ],
            [
                21097,
                21198
            ],
            [
                21198,
                21231
            ],
            [
                21231,
                21258
            ],
            [
                21258,
                21326
            ],
            [
                21326,
                21379
            ],
            [
                21379,
                21432
            ],
            [
                21432,
                21552
            ],
            [
                21552,
                21620
            ],
            [
                21620,
                21738
            ],
            [
                21738,
                21847
            ],
            [
                21847,
                22040
            ],
            [
                22040,
                22114
            ],
            [
                22114,
                22139
            ],
            [
                22139,
                22148
            ],
            [
                22148,
                22331
            ],
            [
                22331,
                22380
            ],
            [
                22380,
                22410
            ],
            [
                22410,
                22494
            ],
            [
                22494,
                22568
            ],
            [
                22568,
                22602
            ],
            [
                22602,
                22613
            ],
            [
                22613,
                22688
            ],
            [
                22688,
                22786
            ],
            [
                22786,
                22885
            ],
            [
                22885,
                22954
            ],
            [
                22954,
                23037
            ],
            [
                23037,
                23100
            ],
            [
                23100,
                23204
            ],
            [
                23204,
                23252
            ],
            [
                23252,
                23298
            ],
            [
                23298,
                23322
            ],
            [
                23322,
                23348
            ],
            [
                23348,
                23437
            ],
            [
                23437,
                23462
            ],
            [
                23462,
                23484
            ],
            [
                23484,
                23500
            ],
            [
                23500,
                23527
            ],
            [
                23527,
                23566
            ],
            [
                23566,
                23696
            ],
            [
                23696,
                23730
            ],
            [
                23730,
                23779
            ],
            [
                23779,
                23840
            ],
            [
                23840,
                23951
            ],
            [
                23951,
                23978
            ],
            [
                23978,
                24016
            ],
            [
                24016,
                24147
            ],
            [
                24147,
                24342
            ],
            [
                24342,
                24415
            ],
            [
                24415,
                24466
            ],
            [
                24466,
                24540
            ],
            [
                24540,
                24754
            ],
            [
                24754,
                24931
            ],
            [
                24931,
                25103
            ],
            [
                25103,
                25122
            ],
            [
                25122,
                25173
            ],
            [
                25173,
                25205
            ],
            [
                25205,
                25243
            ],
            [
                25243,
                25259
            ],
            [
                25259,
                25290
            ],
            [
                25290,
                25305
            ],
            [
                25305,
                25372
            ],
            [
                25372,
                25403
            ],
            [
                25403,
                25467
            ],
            [
                25467,
                25516
            ],
            [
                25516,
                25538
            ],
            [
                25538,
                25599
            ],
            [
                25599,
                25610
            ],
            [
                25610,
                25628
            ],
            [
                25628,
                25745
            ],
            [
                25745,
                25778
            ],
            [
                25778,
                25798
            ],
            [
                25798,
                25866
            ],
            [
                25866,
                26008
            ],
            [
                26008,
                26079
            ],
            [
                26079,
                26199
            ],
            [
                26199,
                26300
            ],
            [
                26300,
                26454
            ],
            [
                26454,
                26608
            ],
            [
                26608,
                26702
            ],
            [
                26702,
                26850
            ],
            [
                26850,
                26876
            ],
            [
                26876,
                27005
            ],
            [
                27005,
                27067
            ],
            [
                27067,
                27314
            ],
            [
                27314,
                27328
            ],
            [
                27328,
                27342
            ],
            [
                27342,
                27406
            ],
            [
                27406,
                27437
            ],
            [
                27437,
                27467
            ],
            [
                27467,
                27489
            ],
            [
                27489,
                27568
            ],
            [
                27568,
                27810
            ],
            [
                27810,
                27932
            ],
            [
                27932,
                28060
            ],
            [
                28060,
                28213
            ],
            [
                28213,
                28225
            ],
            [
                28225,
                28258
            ],
            [
                28258,
                28362
            ],
            [
                28362,
                28555
            ],
            [
                28555,
                28852
            ],
            [
                28852,
                29080
            ],
            [
                29080,
                29186
            ],
            [
                29186,
                29216
            ],
            [
                29216,
                29288
            ],
            [
                29288,
                29338
            ],
            [
                29338,
                29486
            ],
            [
                29486,
                29554
            ],
            [
                29554,
                29641
            ],
            [
                29641,
                29791
            ]
        ]
    },
    "abridged": {
        "text": "Kate Vavasor had sent to her brother only the first half of her cousin's letter, in which Alice had described her meeting with Mr. Grey. In doing this, Kate had been a wicked traitor to Alice. But her treason would have been worse if she had sent the second half, in which Alice had spoken of George Vavasor himself.\nKate might have done even this, if Alice had not spoken of George as a man with whom any closer connection was impossible. She had begged Kate to cease making futile attempts in that direction.\n\"I feel myself driven,\" Alice had said, \"to write all this, as otherwise, when I tell you that I have resolved to part from Mr. Grey, you would think that the other thing might follow. The other thing cannot follow.\"\n\"But the other thing shall follow,\" Kate said, as she read the words.\nTo give Kate Vavasor her due, she was unselfish in her intrigues. She was obstinately persistent, and unscrupulous, but she was not selfish. Many years ago she had made up her mind that George and Alice should be man and wife, feeling that such a marriage would be good at any rate for her brother. It had almost happened, and had then been hindered through her brother's fault. But she was now at work on his behalf again, determined that the two should be married. The intrigue itself was dear to her, and success was necessary to her self-respect.\nShe answered Alice's letter with a pleasant, gossiping epistle about Mrs. Greenow's proceedings at Yarmouth. Kate had promised to stay at Yarmouth for a month, but she had already been there six weeks, under her aunt's wing. She wrote:\nDearest Alice,\nOf course I am delighted. It is no good saying that I am not; but I answer your letter with fear and trembling, lest I should say too much. I have long thought that Mr. Grey could not make you happy. He is good and noble, and all that sort of thing; but he was not suited to you, and his life would have made you wretched. So I rejoice.\nI can well understand how the interview went. I can see him so plainly in his unruffled self-possession, ignoring all that you said, suggesting that you were feverish, waving his hand over you as though that might do you good, and leaving with an assurance that it would be all right as soon as the wind changed. I suppose it's very noble in him, giving you, as it were, another chance; but there is a kind of nobility which is almost too great for this world.\nOf course I'm very glad. No woman wishes her dearest friend to marry a man whom she herself does not like. You would have been lost to me as Mrs. Grey of Nethercoats. I daresay it is a lovely place, but if ever bird banged his wings to pieces against gilded bars, you would have banged yours to pieces in that cage.\nYou say that you have failed to make him understand that the matter is settled. Of course it is settled, and he must be made to understand it. You owe it to him now to put him out of all doubt.\nAnd now I must tell you a little about myself; or rather, tell you a great deal. I have got such a lover! I described him before. Of course it's Mr. Cheesacre. As yet he has not declared himself, and, what's worse, is very anxious to marry a rival - my aunt. But she wants him to take me, so he will be driven to make me an offer sooner or later, in obedience to her orders.\nMy aunt has another lover, Captain Bellfield, and she prefers him. He is a penniless scamp and looks as though he drank. He paints his whiskers too; otherwise he is agreeable enough.\nBut my lover has solid attractions. He is a man of substance, and should I ever become Mrs. Cheesacre, I should not be left in want. We went to visit his place the other day. Oileymead is its name - and we had such a time there! We reached the place at ten and left it at four, and he managed to give us three meals. I'm sure we saw every bit of china, glass, and plate in the establishment. He made us go into the cellar, and told us how much wine and beer he had got there.\n\"It's all paid for, Mrs. Greenow, every bottle,\" he said with a pathetic earnestness. \"I don't call anything a man's own till it's paid for. Now that jacket that Bellfield swells about with - that's not his own.\"\nThen he took us into every bedroom, and showed us all their glories. You should have seen him bidding my aunt feel the thickness of the blankets! And she turned round to me and said:\n\"Kate, it's simply the best-furnished house I ever went over in my life!\"\n\"Yes,\" said he, \"nobody can say that Oileymead isn't comfortable.\" I thought of you and Nethercoats. The attractions are the same; only in the one place you would have a god for your keeper, and in the other a brute.\nBut when we got to the farmyard his eloquence reached the highest pitch.\n\"Mrs. Greenow,\" said he, \"look at that,\" and he pointed to heaps of manure. \"I've more muck upon this place here than any farmer in Norfolk.\" Only fancy, Alice; it may all be mine; the blankets, the wine, the muck, and the rest of it. So my aunt assured me when we got home that evening. When I remarked that the wealth had been exhibited to her and not to me, she did not deny it, but said, \"He wants a wife, my dear, and you may have him tomorrow by putting out your hand.\"\nWhen I mentioned the muck, she only laughed. \"Money's never dirty,\" she said, \"nor what makes money.\" She talks of taking lodgings in Norwich for the winter, and she wants me to stay with her up to Christmas. I fancy that she is unwilling to tear herself away from Captain Bellfield. At any rate, I have promised not to leave her before the second week in November. With all her absurdities and faults, I like her. She is never stupid, and she is very good-natured. She absolutely offered to give me my trousseau if I would marry Mr. Cheesacre.\nI hope that you will come up to the old place at Christmas. I won't offend you more than I can help. At any rate he won't be there. If I were you I would certainly not go to Cheltenham. You are never happy there.\nDo you ever dream of the river at Basle? I do; so often.\nMost affectionately yours,\nKate Vavasor.\n\"I will go to Cheltenham,\" said Alice to herself after reading this. \"He has recommended it. I shall never be his wife; but I will show him that I think well of his advice.\" That afternoon she told her father that she would go to Lady Macleod's at Cheltenham.\nShe was, in truth, prompted by a resolution, of which she was herself hardly conscious, that she would not be guided by her cousin just now. She would go to Cheltenham. Lady Macleod would no doubt vex her by begging that the match might be renewed; but she had strength to withstand Lady Macleod.\nShe received one letter from Mr. Grey before she departed, and she answered it, telling him that she now felt bound to explain the position to her father.\nOn the following morning she told her father at breakfast.\n\"What!\" said he, putting down his tea-cup. \"What! not marry John Grey!\"\n\"No, papa; I know how strange you must think it.\"\n\"And there has been no quarrel?\"\n\"No. But I have learned to feel that I should not make him happy as his wife.\"\n\"It's d---d nonsense,\" said Mr. Vavasor, very deeply moved.\n\"Oh, papa! don't talk to me in that way.\"\n\"But it is. I never heard such trash in my life. If he comes to me I shall tell him so. Not make him happy! Why can't you make him happy?\"\n\"We are not suited to each other.\"\n\"But what's the matter with him? He's a gentleman.\"\n\"Yes.\"\n\"And a man of honour, and with good means, and with all that knowledge and reading which you profess to like. Look here, Alice; I am not going to interfere. You are your own mistress. But I do hope that there is nothing again between you and your cousin.\"\n\"There is nothing, papa.\"\n\"I did not like your going abroad with him, though I didn't want to say so. But I must tell you that men do not speak well of your cousin.\"\n\"There is nothing between us, papa; but if there were, men speaking ill of him would not deter me.\"\n\"And men speaking well of Mr. Grey will not do the other thing.\"\n\"No. I have thought a great deal about it, papa.\"\n\"Well; I can't make you marry John Grey. I think you very foolish, and if he comes to me I shall tell him so.\" Then he took up his newspaper, thereby showing that he had nothing further to say on the matter, and Alice left him alone.\nThe whole thing was so vexatious that when Mr. Vavasor went to his club the waiters found him quite unmanageable about his dinner. But later in the evening he regained his composure over a whiskey-toddy and a cigar.\n\"She's got her own money,\" he said to himself, \"and what does it matter? I don't think she's fool enough to marry her cousin. And she'll probably make it up again with John Grey.\" So he decided that he need not take any fatherly trouble about it.\nBut while he was at his club a visitor came to Queen Anne Street: the dangerous cousin. Alice had not seen him since they had parted on their arrival in London. In her trouble at this step which she was taking - a step which she had taught herself to regard as her duty, but which seemed to herself to be false and treacherous the moment she had taken it - she had become aware that she had been wrong to travel with her cousin.\nShe felt sure it had not affected her dealings with Mr. Grey. She was very certain - she thought she was certain - that she would have rejected him just the same. But everyone would say that her journey had caused it, and she wished to avoid all communication with her cousin for now. However, she had not given any orders about his admittance; and now, before she had time to think, he was in the room with her, just as the October dusk was coming on.\nShe was sitting away from the fire, very unhappy in her thoughts, when George Vavasor was announced. He had received his sister's letter, and had had time to consider the matter.\n\"She can turn all her income into capital tomorrow, if she pleases,\" he had said to himself. But he had also reminded himself that her grandfather would probably allow him to settle an income upon Alice out of his property if they married. And he had also felt that he could have no greater triumph than \"walking atop of John Grey.\"\n\"You must have thought I had vanished out of the world,\" said George.\nAlice, confused, hardly knew how to address him. \"Somebody told me that you were shooting,\" she said after a pause.\n\"So I was, but two days among the grouse and two more among the partridges was about the extent of it. Have you heard from Kate?\"\n\"Yes, once or twice; she is still at Yarmouth with Aunt Greenow.\"\n\"And is going to Norwich, as she says. Kate seems to have made friends with Aunt Greenow, and I think that she is quite right. Friends with forty thousand pounds are always agreeable.\"\n\"I don't believe that Kate thinks much about that,\" said Alice.\n\"Not so much as she ought, I dare say. Poor Kate is not a rich woman, or, I fear, likely to become one. She doesn't seem to dream of getting married, and her own fortune is less than a hundred a year.\"\n\"Girls who never dream of getting married are just those who make the best marriages at last,\" said Alice.\n\"Perhaps so, but I wish I was easier about Kate. She is the best sister a man ever had.\"\n\"Indeed she is.\"\n\"I did think, while I was in that wine business, that I could have done something for her. But my grandfather's obstinacy prevented that; and now I'm beginning the world again - that is, comparatively. I wonder whether you think I'm wrong in trying to get into Parliament?\"\n\"No; I admire you for it. It is just what I would do in your place. You are unmarried, and have a right to run the risk.\"\n\"I am so glad to hear you speak like that,\" said he. He had now managed to take up that friendly, confidential tone of talking which he had often used when abroad with her.\n\"I have always thought so.\"\n\"But you have never said it.\"\n\"Haven't I? I thought I had.\"\n\"Not heartily like that. I know that people abuse me, saying that I am reckless and the rest of it. I do risk everything for my object; but I do not know that anyone can blame me, unless it be Kate. To whom else do I owe anything?\"\n\"Kate does not blame you.\"\n\"No; she sympathizes with me; no-one else does, unless it be you.\" Then he paused for an answer, but she made him none. \"She is brave enough to give me her hearty sympathy. But perhaps for that very reason I ought to be more careful in endangering the only support that she is likely to have.\"\n\"I hope that Kate will live with me,\" said Alice; \"that is, once she has lost her home at Vavasor Hall.\"\nHe had been very crafty and had laid a trap for her, and she had fallen into it. She had been determined not to talk of herself; but the words were out of her mouth before she remembered where they would lead her.\n\"What - at Nethercoats?\" said he. \"Few men would like such an intruder into their household, and of all men Mr. Grey, whose nature is retiring, would like it the least.\"\n\"I was not thinking of Nethercoats,\" said Alice.\n\"Ah, no. Kate says often to me that when you are married she will be alone in the world. Poor Kate! You cannot be surprised that she should dread your marriage. How much of her life has been made up of her companionship with you! You ought not to be angry with her for regarding your marriage with dismay.\"\nAlice could not let him talk of Nethercoats as though it were to be her future home.\n\"Kate may still live with me,\" she said slowly. \"Everything is over between me and Mr. Grey.\"\n\"Alice! is that true?\"\n\"Yes, George. I would rather not talk about it at present.\"\n\"And does Kate know it?\"\n\"Yes.\"\n\"And my uncle?\"\n\"Yes, papa knows it also.\"\n\"Alice, how can I help speaking of it? I am rejoiced that you are saved from a thraldom which I was sure would break your heart!\"\n\"Pray do not talk of it further.\"\n\"Well; I shall of course obey. But how can I not congratulate you?\" To this she answered nothing, but beat with her foot upon the floor as though impatient of his words. \"Yes, Alice, I understand. You are angry with me,\" he continued. \"Yet surely your cousin has a right to say what he thinks of this change in your life; especially if he approves of it.\"\n\"I am glad of your approval, George; but pray let that be an end to it.\"\nAfter that the two sat silent for a minute or two. She was waiting for him to go, but she could not bid him leave. She was angry with herself, for allowing herself to tell him of her altered plans, and she was angry with him because he would not understand that she ought to be spared all conversation on the subject. So she sat looking through the window at the gas-lamps as they were being lit, and he remained in his chair.\n\"Do you remember asking me whether I ever shivered,\" he said at last, \"on the bridge at Basle?\"\n\"Yes; I remember.\"\n\"Well, Alice, one cause for my shivering is over. I won't say more than that now. Shall you remain long at Cheltenham?\"\n\"Just a month.\"\n\"And then you come back here?\"\n\"I suppose so. Papa and I will probably go to Vavasor Hall before Christmas.\"\n\"I shall see you at any rate after your return from Cheltenham? Of course Kate will know.\"\n\"Yes; I suppose Kate will stay here when she comes back from Norfolk. Good-bye.\"\n\"Good-bye, Alice. I shall have fewer fits now of that inward shivering that you spoke of. God bless you, Alice; good-bye.\"\n\"Good-bye, George.\"\nHe took her hand and pressed it closely between his own. In the days when they were engaged, a close pressure of her hand had been his most eloquent speech of love. He had not been given to many kisses - not even to many words of love. But he would take her hand and hold it, and she remembered well the touch of his palm. It was a cool, smooth, small hand that had a firm grip. There had been days when she had loved to feel that her own was within it, when she trusted in it, as her staff through life.\nNow she distrusted it; and she drew her hand away rapidly. What did he think of her? Did he suppose that she could transfer her love in that way, as a flower may be taken from one buttonhole and placed in another?\nHe read it all, and knew that he was hurrying on too quickly.\n\"I can understand well,\" he whispered, \"what your present feelings are; but I do not think you will be really angry with me because I have been unable to repress my joy at your release from a great misfortune.\" Then he went.\n\"My release!\" she said. \"My release from a misfortune! No; my fall from heaven! Oh, what a man he is! That he should have loved me, and that I should have driven him away!\" Her thoughts travelled off to the sweetness of that home at Nethercoats, to the excellence of its master; and in an agony of despair she told herself that she had been an idiot and a fool, as well as a traitor. Had she not been mad, when she sent away the only man that she loved - the only man that she had ever truly respected? For hours she sat there, all alone, leaving untasted the tea that was brought to her.\nPoor Alice! I hope that she may be forgiven. Sitting there, full of these regrets, she declared to herself that she would wait for her father's return, and then, throwing herself upon his love and mercy, would beg him to go to Mr. Grey and ask for pardon for her.\n\"I should be very humble to him,\" she said; \"but he is so good, that I may dare to be humble before him.\" So she waited for her father. She waited till twelve, till one, till two;-but still he did not come. Later than that she did not dare to wait for him. His temper at such a time would not be fit for the task. Between two and three she went to bed, and on the following morning she left Queen Anne Street for the station before her father was up.",
        "paragraph_chars": [
            [
                0,
                317
            ],
            [
                317,
                511
            ],
            [
                511,
                728
            ],
            [
                728,
                798
            ],
            [
                798,
                1349
            ],
            [
                1349,
                1585
            ],
            [
                1585,
                1600
            ],
            [
                1600,
                1937
            ],
            [
                1937,
                2398
            ],
            [
                2398,
                2714
            ],
            [
                2714,
                2908
            ],
            [
                2908,
                3283
            ],
            [
                3283,
                3466
            ],
            [
                3466,
                3942
            ],
            [
                3942,
                4155
            ],
            [
                4155,
                4338
            ],
            [
                4338,
                4412
            ],
            [
                4412,
                4629
            ],
            [
                4629,
                4702
            ],
            [
                4702,
                5178
            ],
            [
                5178,
                5723
            ],
            [
                5723,
                5936
            ],
            [
                5936,
                5993
            ],
            [
                5993,
                6020
            ],
            [
                6020,
                6034
            ],
            [
                6034,
                6294
            ],
            [
                6294,
                6591
            ],
            [
                6591,
                6746
            ],
            [
                6746,
                6805
            ],
            [
                6805,
                6877
            ],
            [
                6877,
                6927
            ],
            [
                6927,
                6960
            ],
            [
                6960,
                7039
            ],
            [
                7039,
                7099
            ],
            [
                7099,
                7141
            ],
            [
                7141,
                7280
            ],
            [
                7280,
                7315
            ],
            [
                7315,
                7367
            ],
            [
                7367,
                7374
            ],
            [
                7374,
                7630
            ],
            [
                7630,
                7656
            ],
            [
                7656,
                7796
            ],
            [
                7796,
                7896
            ],
            [
                7896,
                7961
            ],
            [
                7961,
                8011
            ],
            [
                8011,
                8245
            ],
            [
                8245,
                8461
            ],
            [
                8461,
                8708
            ],
            [
                8708,
                9137
            ],
            [
                9137,
                9590
            ],
            [
                9590,
                9769
            ],
            [
                9769,
                10102
            ],
            [
                10102,
                10172
            ],
            [
                10172,
                10288
            ],
            [
                10288,
                10418
            ],
            [
                10418,
                10484
            ],
            [
                10484,
                10669
            ],
            [
                10669,
                10733
            ],
            [
                10733,
                10935
            ],
            [
                10935,
                11042
            ],
            [
                11042,
                11131
            ],
            [
                11131,
                11148
            ],
            [
                11148,
                11422
            ],
            [
                11422,
                11544
            ],
            [
                11544,
                11717
            ],
            [
                11717,
                11745
            ],
            [
                11745,
                11775
            ],
            [
                11775,
                11805
            ],
            [
                11805,
                12037
            ],
            [
                12037,
                12064
            ],
            [
                12064,
                12358
            ],
            [
                12358,
                12463
            ],
            [
                12463,
                12677
            ],
            [
                12677,
                12847
            ],
            [
                12847,
                12896
            ],
            [
                12896,
                13203
            ],
            [
                13203,
                13288
            ],
            [
                13288,
                13382
            ],
            [
                13382,
                13405
            ],
            [
                13405,
                13465
            ],
            [
                13465,
                13490
            ],
            [
                13490,
                13497
            ],
            [
                13497,
                13513
            ],
            [
                13513,
                13540
            ],
            [
                13540,
                13670
            ],
            [
                13670,
                13704
            ],
            [
                13704,
                14060
            ],
            [
                14060,
                14133
            ],
            [
                14133,
                14560
            ],
            [
                14560,
                14656
            ],
            [
                14656,
                14675
            ],
            [
                14675,
                14795
            ],
            [
                14795,
                14811
            ],
            [
                14811,
                14842
            ],
            [
                14842,
                14920
            ],
            [
                14920,
                15011
            ],
            [
                15011,
                15092
            ],
            [
                15092,
                15215
            ],
            [
                15215,
                15235
            ],
            [
                15235,
                15740
            ],
            [
                15740,
                15954
            ],
            [
                15954,
                16016
            ],
            [
                16016,
                16241
            ],
            [
                16241,
                16830
            ],
            [
                16830,
                17094
            ],
            [
                17094,
                17544
            ]
        ],
        "segment_chars": [
            [
                0,
                137
            ],
            [
                137,
                193
            ],
            [
                193,
                317
            ],
            [
                317,
                440
            ],
            [
                440,
                511
            ],
            [
                511,
                696
            ],
            [
                696,
                728
            ],
            [
                728,
                798
            ],
            [
                798,
                864
            ],
            [
                864,
                939
            ],
            [
                939,
                1097
            ],
            [
                1097,
                1177
            ],
            [
                1177,
                1265
            ],
            [
                1265,
                1349
            ],
            [
                1349,
                1458
            ],
            [
                1458,
                1574
            ],
            [
                1574,
                1585
            ],
            [
                1585,
                1600
            ],
            [
                1600,
                1626
            ],
            [
                1626,
                1740
            ],
            [
                1740,
                1800
            ],
            [
                1800,
                1923
            ],
            [
                1923,
                1937
            ],
            [
                1937,
                1983
            ],
            [
                1983,
                2250
            ],
            [
                2250,
                2398
            ],
            [
                2398,
                2423
            ],
            [
                2423,
                2505
            ],
            [
                2505,
                2565
            ],
            [
                2565,
                2714
            ],
            [
                2714,
                2794
            ],
            [
                2794,
                2857
            ],
            [
                2857,
                2908
            ],
            [
                2908,
                2989
            ],
            [
                2989,
                3014
            ],
            [
                3014,
                3038
            ],
            [
                3038,
                3068
            ],
            [
                3068,
                3167
            ],
            [
                3167,
                3283
            ],
            [
                3283,
                3350
            ],
            [
                3350,
                3404
            ],
            [
                3404,
                3466
            ],
            [
                3466,
                3502
            ],
            [
                3502,
                3599
            ],
            [
                3599,
                3641
            ],
            [
                3641,
                3695
            ],
            [
                3695,
                3783
            ],
            [
                3783,
                3858
            ],
            [
                3858,
                3942
            ],
            [
                3942,
                4028
            ],
            [
                4028,
                4083
            ],
            [
                4083,
                4155
            ],
            [
                4155,
                4224
            ],
            [
                4224,
                4301
            ],
            [
                4301,
                4338
            ],
            [
                4338,
                4412
            ],
            [
                4412,
                4479
            ],
            [
                4479,
                4513
            ],
            [
                4513,
                4629
            ],
            [
                4629,
                4702
            ],
            [
                4702,
                4778
            ],
            [
                4778,
                4844
            ],
            [
                4844,
                4937
            ],
            [
                4937,
                4990
            ],
            [
                4990,
                5178
            ],
            [
                5178,
                5223
            ],
            [
                5223,
                5280
            ],
            [
                5280,
                5387
            ],
            [
                5387,
                5462
            ],
            [
                5462,
                5544
            ],
            [
                5544,
                5593
            ],
            [
                5593,
                5644
            ],
            [
                5644,
                5723
            ],
            [
                5723,
                5783
            ],
            [
                5783,
                5824
            ],
            [
                5824,
                5855
            ],
            [
                5855,
                5909
            ],
            [
                5909,
                5936
            ],
            [
                5936,
                5977
            ],
            [
                5977,
                5993
            ],
            [
                5993,
                6020
            ],
            [
                6020,
                6034
            ],
            [
                6034,
                6103
            ],
            [
                6103,
                6127
            ],
            [
                6127,
                6208
            ],
            [
                6208,
                6294
            ],
            [
                6294,
                6435
            ],
            [
                6435,
                6463
            ],
            [
                6463,
                6591
            ],
            [
                6591,
                6746
            ],
            [
                6746,
                6805
            ],
            [
                6805,
                6813
            ],
            [
                6813,
                6848
            ],
            [
                6848,
                6855
            ],
            [
                6855,
                6877
            ],
            [
                6877,
                6927
            ],
            [
                6927,
                6960
            ],
            [
                6960,
                6965
            ],
            [
                6965,
                7039
            ],
            [
                7039,
                7099
            ],
            [
                7099,
                7110
            ],
            [
                7110,
                7141
            ],
            [
                7141,
                7153
            ],
            [
                7153,
                7190
            ],
            [
                7190,
                7229
            ],
            [
                7229,
                7249
            ],
            [
                7249,
                7280
            ],
            [
                7280,
                7315
            ],
            [
                7315,
                7348
            ],
            [
                7348,
                7367
            ],
            [
                7367,
                7374
            ],
            [
                7374,
                7484
            ],
            [
                7484,
                7531
            ],
            [
                7531,
                7558
            ],
            [
                7558,
                7630
            ],
            [
                7630,
                7656
            ],
            [
                7656,
                7732
            ],
            [
                7732,
                7796
            ],
            [
                7796,
                7896
            ],
            [
                7896,
                7961
            ],
            [
                7961,
                7966
            ],
            [
                7966,
                8011
            ],
            [
                8011,
                8052
            ],
            [
                8052,
                8122
            ],
            [
                8122,
                8245
            ],
            [
                8245,
                8376
            ],
            [
                8376,
                8461
            ],
            [
                8461,
                8534
            ],
            [
                8534,
                8587
            ],
            [
                8587,
                8641
            ],
            [
                8641,
                8708
            ],
            [
                8708,
                8796
            ],
            [
                8796,
                8869
            ],
            [
                8869,
                9137
            ],
            [
                9137,
                9199
            ],
            [
                9199,
                9300
            ],
            [
                9300,
                9422
            ],
            [
                9422,
                9590
            ],
            [
                9590,
                9691
            ],
            [
                9691,
                9769
            ],
            [
                9769,
                9862
            ],
            [
                9862,
                10009
            ],
            [
                10009,
                10102
            ],
            [
                10102,
                10172
            ],
            [
                10172,
                10221
            ],
            [
                10221,
                10288
            ],
            [
                10288,
                10391
            ],
            [
                10391,
                10418
            ],
            [
                10418,
                10484
            ],
            [
                10484,
                10523
            ],
            [
                10523,
                10611
            ],
            [
                10611,
                10669
            ],
            [
                10669,
                10733
            ],
            [
                10733,
                10772
            ],
            [
                10772,
                10837
            ],
            [
                10837,
                10935
            ],
            [
                10935,
                11042
            ],
            [
                11042,
                11091
            ],
            [
                11091,
                11131
            ],
            [
                11131,
                11148
            ],
            [
                11148,
                11239
            ],
            [
                11239,
                11350
            ],
            [
                11350,
                11422
            ],
            [
                11422,
                11448
            ],
            [
                11448,
                11490
            ],
            [
                11490,
                11544
            ],
            [
                11544,
                11597
            ],
            [
                11597,
                11717
            ],
            [
                11717,
                11745
            ],
            [
                11745,
                11775
            ],
            [
                11775,
                11787
            ],
            [
                11787,
                11805
            ],
            [
                11805,
                11830
            ],
            [
                11830,
                11905
            ],
            [
                11905,
                12004
            ],
            [
                12004,
                12037
            ],
            [
                12037,
                12064
            ],
            [
                12064,
                12131
            ],
            [
                12131,
                12184
            ],
            [
                12184,
                12237
            ],
            [
                12237,
                12358
            ],
            [
                12358,
                12463
            ],
            [
                12463,
                12544
            ],
            [
                12544,
                12677
            ],
            [
                12677,
                12702
            ],
            [
                12702,
                12711
            ],
            [
                12711,
                12847
            ],
            [
                12847,
                12896
            ],
            [
                12896,
                12905
            ],
            [
                12905,
                12985
            ],
            [
                12985,
                12996
            ],
            [
                12996,
                13057
            ],
            [
                13057,
                13126
            ],
            [
                13126,
                13203
            ],
            [
                13203,
                13288
            ],
            [
                13288,
                13336
            ],
            [
                13336,
                13382
            ],
            [
                13382,
                13390
            ],
            [
                13390,
                13405
            ],
            [
                13405,
                13419
            ],
            [
                13419,
                13465
            ],
            [
                13465,
                13490
            ],
            [
                13490,
                13497
            ],
            [
                13497,
                13513
            ],
            [
                13513,
                13540
            ],
            [
                13540,
                13579
            ],
            [
                13579,
                13670
            ],
            [
                13670,
                13704
            ],
            [
                13704,
                13735
            ],
            [
                13735,
                13772
            ],
            [
                13772,
                13874
            ],
            [
                13874,
                13901
            ],
            [
                13901,
                13939
            ],
            [
                13939,
                14060
            ],
            [
                14060,
                14133
            ],
            [
                14133,
                14184
            ],
            [
                14184,
                14248
            ],
            [
                14248,
                14451
            ],
            [
                14451,
                14560
            ],
            [
                14560,
                14656
            ],
            [
                14656,
                14675
            ],
            [
                14675,
                14725
            ],
            [
                14725,
                14757
            ],
            [
                14757,
                14795
            ],
            [
                14795,
                14811
            ],
            [
                14811,
                14842
            ],
            [
                14842,
                14857
            ],
            [
                14857,
                14920
            ],
            [
                14920,
                14984
            ],
            [
                14984,
                15011
            ],
            [
                15011,
                15081
            ],
            [
                15081,
                15092
            ],
            [
                15092,
                15110
            ],
            [
                15110,
                15182
            ],
            [
                15182,
                15215
            ],
            [
                15215,
                15235
            ],
            [
                15235,
                15292
            ],
            [
                15292,
                15400
            ],
            [
                15400,
                15471
            ],
            [
                15471,
                15558
            ],
            [
                15558,
                15614
            ],
            [
                15614,
                15740
            ],
            [
                15740,
                15799
            ],
            [
                15799,
                15825
            ],
            [
                15825,
                15954
            ],
            [
                15954,
                16016
            ],
            [
                16016,
                16227
            ],
            [
                16227,
                16241
            ],
            [
                16241,
                16255
            ],
            [
                16255,
                16265
            ],
            [
                16265,
                16296
            ],
            [
                16296,
                16321
            ],
            [
                16321,
                16343
            ],
            [
                16343,
                16414
            ],
            [
                16414,
                16625
            ],
            [
                16625,
                16744
            ],
            [
                16744,
                16830
            ],
            [
                16830,
                16842
            ],
            [
                16842,
                16875
            ],
            [
                16875,
                17094
            ],
            [
                17094,
                17200
            ],
            [
                17200,
                17230
            ],
            [
                17230,
                17301
            ],
            [
                17301,
                17351
            ],
            [
                17351,
                17408
            ],
            [
                17408,
                17544
            ]
        ],
        "overlap_chars": [
            [
                0,
                80
            ],
            [
                81,
                99
            ],
            [
                110,
                113
            ],
            [
                127,
                137
            ],
            [
                137,
                182
            ],
            [
                183,
                185
            ],
            [
                191,
                193
            ],
            [
                193,
                224
            ],
            [
                234,
                237
            ],
            [
                238,
                241
            ],
            [
                242,
                250
            ],
            [
                262,
                263
            ],
            [
                264,
                266
            ],
            [
                273,
                316
            ],
            [
                317,
                321
            ],
            [
                328,
                332
            ],
            [
                338,
                342
            ],
            [
                343,
                347
            ],
            [
                347,
                348
            ],
            [
                349,
                351
            ],
            [
                352,
                357
            ],
            [
                358,
                365
            ],
            [
                366,
                423
            ],
            [
                424,
                438
            ],
            [
                438,
                439
            ],
            [
                444,
                447
            ],
            [
                455,
                462
            ],
            [
                469,
                510
            ],
            [
                511,
                584
            ],
            [
                590,
                591
            ],
            [
                592,
                644
            ],
            [
                645,
                696
            ],
            [
                696,
                725
            ],
            [
                728,
                768
            ],
            [
                769,
                796
            ],
            [
                796,
                797
            ],
            [
                798,
                835
            ],
            [
                836,
                864
            ],
            [
                864,
                899
            ],
            [
                900,
                939
            ],
            [
                939,
                1097
            ],
            [
                1097,
                1103
            ],
            [
                1104,
                1110
            ],
            [
                1119,
                1147
            ],
            [
                1148,
                1155
            ],
            [
                1156,
                1169
            ],
            [
                1170,
                1175
            ],
            [
                1175,
                1177
            ],
            [
                1177,
                1180
            ],
            [
                1181,
                1200
            ],
            [
                1204,
                1237
            ],
            [
                1242,
                1263
            ],
            [
                1263,
                1265
            ],
            [
                1265,
                1313
            ],
            [
                1314,
                1349
            ],
            [
                1349,
                1411
            ],
            [
                1418,
                1458
            ],
            [
                1458,
                1550
            ],
            [
                1551,
                1573
            ],
            [
                1585,
                1600
            ],
            [
                1600,
                1626
            ],
            [
                1626,
                1660
            ],
            [
                1666,
                1667
            ],
            [
                1668,
                1729
            ],
            [
                1730,
                1738
            ],
            [
                1738,
                1740
            ],
            [
                1740,
                1798
            ],
            [
                1800,
                1848
            ],
            [
                1850,
                1923
            ],
            [
                1926,
                1936
            ],
            [
                1937,
                1942
            ],
            [
                1948,
                1958
            ],
            [
                1963,
                1983
            ],
            [
                1983,
                2007
            ],
            [
                2008,
                2010
            ],
            [
                2011,
                2014
            ],
            [
                2015,
                2103
            ],
            [
                2103,
                2129
            ],
            [
                2130,
                2150
            ],
            [
                2151,
                2157
            ],
            [
                2158,
                2167
            ],
            [
                2176,
                2250
            ],
            [
                2250,
                2283
            ],
            [
                2284,
                2397
            ],
            [
                2398,
                2423
            ],
            [
                2423,
                2472
            ],
            [
                2473,
                2489
            ],
            [
                2503,
                2505
            ],
            [
                2505,
                2524
            ],
            [
                2525,
                2535
            ],
            [
                2536,
                2538
            ],
            [
                2539,
                2563
            ],
            [
                2563,
                2565
            ],
            [
                2565,
                2566
            ],
            [
                2575,
                2577
            ],
            [
                2578,
                2580
            ],
            [
                2581,
                2582
            ],
            [
                2595,
                2600
            ],
            [
                2601,
                2714
            ],
            [
                2714,
                2794
            ],
            [
                2794,
                2822
            ],
            [
                2823,
                2857
            ],
            [
                2857,
                2907
            ],
            [
                2908,
                2954
            ],
            [
                2955,
                2965
            ],
            [
                2966,
                2989
            ],
            [
                2989,
                3014
            ],
            [
                3014,
                3015
            ],
            [
                3026,
                3038
            ],
            [
                3038,
                3068
            ],
            [
                3068,
                3070
            ],
            [
                3071,
                3103
            ],
            [
                3104,
                3108
            ],
            [
                3113,
                3115
            ],
            [
                3116,
                3155
            ],
            [
                3158,
                3165
            ],
            [
                3165,
                3166
            ],
            [
                3167,
                3170
            ],
            [
                3175,
                3196
            ],
            [
                3200,
                3207
            ],
            [
                3208,
                3282
            ],
            [
                3291,
                3332
            ],
            [
                3333,
                3350
            ],
            [
                3350,
                3404
            ],
            [
                3404,
                3430
            ],
            [
                3430,
                3431
            ],
            [
                3432,
                3464
            ],
            [
                3464,
                3466
            ],
            [
                3466,
                3500
            ],
            [
                3500,
                3502
            ],
            [
                3502,
                3570
            ],
            [
                3578,
                3599
            ],
            [
                3599,
                3606
            ],
            [
                3607,
                3609
            ],
            [
                3610,
                3615
            ],
            [
                3616,
                3625
            ],
            [
                3626,
                3641
            ],
            [
                3641,
                3653
            ],
            [
                3658,
                3662
            ],
            [
                3665,
                3695
            ],
            [
                3695,
                3783
            ],
            [
                3783,
                3794
            ],
            [
                3799,
                3817
            ],
            [
                3817,
                3858
            ],
            [
                3858,
                3914
            ],
            [
                3915,
                3918
            ],
            [
                3919,
                3923
            ],
            [
                3924,
                3940
            ],
            [
                3940,
                3941
            ],
            [
                3942,
                3988
            ],
            [
                3988,
                3998
            ],
            [
                3999,
                4026
            ],
            [
                4026,
                4028
            ],
            [
                4029,
                4083
            ],
            [
                4083,
                4131
            ],
            [
                4134,
                4152
            ],
            [
                4152,
                4154
            ],
            [
                4160,
                4194
            ],
            [
                4202,
                4208
            ],
            [
                4215,
                4222
            ],
            [
                4222,
                4224
            ],
            [
                4224,
                4227
            ],
            [
                4235,
                4239
            ],
            [
                4245,
                4248
            ],
            [
                4249,
                4273
            ],
            [
                4284,
                4301
            ],
            [
                4301,
                4304
            ],
            [
                4316,
                4331
            ],
            [
                4336,
                4337
            ],
            [
                4338,
                4411
            ],
            [
                4412,
                4416
            ],
            [
                4426,
                4427
            ],
            [
                4436,
                4479
            ],
            [
                4479,
                4480
            ],
            [
                4489,
                4513
            ],
            [
                4513,
                4542
            ],
            [
                4543,
                4628
            ],
            [
                4629,
                4701
            ],
            [
                4702,
                4776
            ],
            [
                4776,
                4778
            ],
            [
                4778,
                4841
            ],
            [
                4841,
                4844
            ],
            [
                4844,
                4937
            ],
            [
                4937,
                4990
            ],
            [
                4990,
                5074
            ],
            [
                5075,
                5087
            ],
            [
                5088,
                5093
            ],
            [
                5094,
                5119
            ],
            [
                5121,
                5132
            ],
            [
                5138,
                5141
            ],
            [
                5151,
                5177
            ],
            [
                5178,
                5184
            ],
            [
                5195,
                5221
            ],
            [
                5221,
                5223
            ],
            [
                5223,
                5260
            ],
            [
                5261,
                5280
            ],
            [
                5280,
                5334
            ],
            [
                5334,
                5387
            ],
            [
                5387,
                5462
            ],
            [
                5462,
                5473
            ],
            [
                5473,
                5474
            ],
            [
                5475,
                5544
            ],
            [
                5544,
                5568
            ],
            [
                5573,
                5580
            ],
            [
                5581,
                5592
            ],
            [
                5593,
                5644
            ],
            [
                5644,
                5647
            ],
            [
                5648,
                5723
            ],
            [
                5723,
                5724
            ],
            [
                5725,
                5748
            ],
            [
                5752,
                5783
            ],
            [
                5783,
                5824
            ],
            [
                5824,
                5855
            ],
            [
                5855,
                5909
            ],
            [
                5909,
                5936
            ],
            [
                5936,
                5977
            ],
            [
                5977,
                5982
            ],
            [
                5983,
                5993
            ],
            [
                5993,
                6020
            ],
            [
                6020,
                6034
            ],
            [
                6034,
                6060
            ],
            [
                6061,
                6065
            ],
            [
                6072,
                6082
            ],
            [
                6101,
                6103
            ],
            [
                6103,
                6127
            ],
            [
                6127,
                6153
            ],
            [
                6154,
                6157
            ],
            [
                6158,
                6208
            ],
            [
                6208,
                6212
            ],
            [
                6213,
                6292
            ],
            [
                6292,
                6293
            ],
            [
                6294,
                6321
            ],
            [
                6322,
                6400
            ],
            [
                6401,
                6403
            ],
            [
                6404,
                6424
            ],
            [
                6433,
                6435
            ],
            [
                6435,
                6463
            ],
            [
                6463,
                6501
            ],
            [
                6510,
                6546
            ],
            [
                6547,
                6591
            ],
            [
                6591,
                6635
            ],
            [
                6648,
                6682
            ],
            [
                6683,
                6700
            ],
            [
                6701,
                6717
            ],
            [
                6718,
                6721
            ],
            [
                6722,
                6730
            ],
            [
                6731,
                6744
            ],
            [
                6744,
                6745
            ],
            [
                6746,
                6774
            ],
            [
                6780,
                6790
            ],
            [
                6791,
                6793
            ],
            [
                6794,
                6804
            ],
            [
                6805,
                6813
            ],
            [
                6813,
                6846
            ],
            [
                6848,
                6855
            ],
            [
                6855,
                6877
            ],
            [
                6877,
                6927
            ],
            [
                6927,
                6931
            ],
            [
                6932,
                6957
            ],
            [
                6960,
                6963
            ],
            [
                6963,
                6965
            ],
            [
                6969,
                7039
            ],
            [
                7039,
                7046
            ],
            [
                7049,
                7078
            ],
            [
                7078,
                7079
            ],
            [
                7080,
                7099
            ],
            [
                7099,
                7110
            ],
            [
                7110,
                7141
            ],
            [
                7141,
                7153
            ],
            [
                7153,
                7190
            ],
            [
                7190,
                7229
            ],
            [
                7229,
                7249
            ],
            [
                7249,
                7280
            ],
            [
                7280,
                7315
            ],
            [
                7315,
                7348
            ],
            [
                7348,
                7367
            ],
            [
                7367,
                7371
            ],
            [
                7371,
                7374
            ],
            [
                7374,
                7484
            ],
            [
                7484,
                7529
            ],
            [
                7529,
                7531
            ],
            [
                7531,
                7556
            ],
            [
                7556,
                7558
            ],
            [
                7558,
                7561
            ],
            [
                7562,
                7630
            ],
            [
                7630,
                7656
            ],
            [
                7656,
                7715
            ],
            [
                7721,
                7723
            ],
            [
                7728,
                7732
            ],
            [
                7732,
                7735
            ],
            [
                7736,
                7737
            ],
            [
                7743,
                7756
            ],
            [
                7757,
                7781
            ],
            [
                7782,
                7793
            ],
            [
                7793,
                7796
            ],
            [
                7796,
                7896
            ],
            [
                7896,
                7958
            ],
            [
                7964,
                7966
            ],
            [
                7966,
                7967
            ],
            [
                7994,
                8011
            ],
            [
                8018,
                8052
            ],
            [
                8052,
                8119
            ],
            [
                8122,
                8245
            ],
            [
                8245,
                8282
            ],
            [
                8283,
                8287
            ],
            [
                8288,
                8299
            ],
            [
                8305,
                8374
            ],
            [
                8374,
                8376
            ],
            [
                8376,
                8433
            ],
            [
                8434,
                8460
            ],
            [
                8461,
                8534
            ],
            [
                8534,
                8565
            ],
            [
                8569,
                8586
            ],
            [
                8587,
                8590
            ],
            [
                8591,
                8641
            ],
            [
                8644,
                8646
            ],
            [
                8655,
                8671
            ],
            [
                8672,
                8676
            ],
            [
                8677,
                8680
            ],
            [
                8681,
                8687
            ],
            [
                8690,
                8697
            ],
            [
                8706,
                8708
            ],
            [
                8708,
                8736
            ],
            [
                8737,
                8746
            ],
            [
                8747,
                8751
            ],
            [
                8752,
                8772
            ],
            [
                8774,
                8794
            ],
            [
                8794,
                8796
            ],
            [
                8796,
                8843
            ],
            [
                8844,
                8867
            ],
            [
                8867,
                8869
            ],
            [
                8869,
                8871
            ],
            [
                8872,
                8875
            ],
            [
                8884,
                8917
            ],
            [
                8920,
                8968
            ],
            [
                8969,
                8977
            ],
            [
                8977,
                9062
            ],
            [
                9065,
                9136
            ],
            [
                9137,
                9150
            ],
            [
                9154,
                9157
            ],
            [
                9162,
                9199
            ],
            [
                9199,
                9219
            ],
            [
                9222,
                9233
            ],
            [
                9234,
                9249
            ],
            [
                9252,
                9298
            ],
            [
                9298,
                9300
            ],
            [
                9300,
                9303
            ],
            [
                9313,
                9322
            ],
            [
                9323,
                9339
            ],
            [
                9340,
                9343
            ],
            [
                9351,
                9362
            ],
            [
                9363,
                9412
            ],
            [
                9413,
                9416
            ],
            [
                9417,
                9420
            ],
            [
                9420,
                9422
            ],
            [
                9429,
                9430
            ],
            [
                9431,
                9442
            ],
            [
                9449,
                9452
            ],
            [
                9466,
                9519
            ],
            [
                9519,
                9520
            ],
            [
                9521,
                9561
            ],
            [
                9562,
                9569
            ],
            [
                9570,
                9574
            ],
            [
                9575,
                9589
            ],
            [
                9590,
                9625
            ],
            [
                9626,
                9691
            ],
            [
                9691,
                9697
            ],
            [
                9698,
                9726
            ],
            [
                9726,
                9767
            ],
            [
                9767,
                9768
            ],
            [
                9769,
                9782
            ],
            [
                9783,
                9786
            ],
            [
                9787,
                9797
            ],
            [
                9798,
                9810
            ],
            [
                9819,
                9860
            ],
            [
                9860,
                9862
            ],
            [
                9862,
                9930
            ],
            [
                9937,
                9960
            ],
            [
                9961,
                9971
            ],
            [
                9972,
                9978
            ],
            [
                9983,
                9991
            ],
            [
                10000,
                10009
            ],
            [
                10009,
                10012
            ],
            [
                10013,
                10099
            ],
            [
                10102,
                10170
            ],
            [
                10170,
                10172
            ],
            [
                10172,
                10177
            ],
            [
                10179,
                10188
            ],
            [
                10189,
                10221
            ],
            [
                10221,
                10288
            ],
            [
                10288,
                10302
            ],
            [
                10303,
                10362
            ],
            [
                10367,
                10391
            ],
            [
                10391,
                10417
            ],
            [
                10418,
                10484
            ],
            [
                10484,
                10523
            ],
            [
                10523,
                10546
            ],
            [
                10555,
                10572
            ],
            [
                10572,
                10573
            ],
            [
                10578,
                10579
            ],
            [
                10580,
                10611
            ],
            [
                10611,
                10669
            ],
            [
                10669,
                10707
            ],
            [
                10714,
                10733
            ],
            [
                10733,
                10772
            ],
            [
                10772,
                10837
            ],
            [
                10837,
                10935
            ],
            [
                10935,
                11042
            ],
            [
                11042,
                11091
            ],
            [
                11091,
                11131
            ],
            [
                11131,
                11148
            ],
            [
                11149,
                11219
            ],
            [
                11230,
                11239
            ],
            [
                11239,
                11269
            ],
            [
                11280,
                11323
            ],
            [
                11326,
                11350
            ],
            [
                11350,
                11422
            ],
            [
                11422,
                11426
            ],
            [
                11427,
                11448
            ],
            [
                11448,
                11490
            ],
            [
                11490,
                11544
            ],
            [
                11544,
                11597
            ],
            [
                11597,
                11654
            ],
            [
                11655,
                11683
            ],
            [
                11684,
                11715
            ],
            [
                11715,
                11717
            ],
            [
                11717,
                11745
            ],
            [
                11745,
                11775
            ],
            [
                11775,
                11787
            ],
            [
                11787,
                11805
            ],
            [
                11805,
                11830
            ],
            [
                11830,
                11857
            ],
            [
                11857,
                11858
            ],
            [
                11866,
                11905
            ],
            [
                11905,
                11963
            ],
            [
                11971,
                11984
            ],
            [
                11985,
                12004
            ],
            [
                12004,
                12037
            ],
            [
                12037,
                12064
            ],
            [
                12064,
                12093
            ],
            [
                12110,
                12131
            ],
            [
                12131,
                12184
            ],
            [
                12184,
                12237
            ],
            [
                12237,
                12283
            ],
            [
                12284,
                12288
            ],
            [
                12297,
                12340
            ],
            [
                12348,
                12355
            ],
            [
                12358,
                12380
            ],
            [
                12381,
                12417
            ],
            [
                12423,
                12463
            ],
            [
                12463,
                12490
            ],
            [
                12491,
                12544
            ],
            [
                12544,
                12551
            ],
            [
                12557,
                12571
            ],
            [
                12572,
                12595
            ],
            [
                12596,
                12649
            ],
            [
                12656,
                12676
            ],
            [
                12677,
                12682
            ],
            [
                12685,
                12702
            ],
            [
                12702,
                12711
            ],
            [
                12711,
                12712
            ],
            [
                12712,
                12747
            ],
            [
                12748,
                12847
            ],
            [
                12847,
                12896
            ],
            [
                12896,
                12903
            ],
            [
                12903,
                12905
            ],
            [
                12905,
                12914
            ],
            [
                12915,
                12983
            ],
            [
                12985,
                12996
            ],
            [
                12996,
                13035
            ],
            [
                13036,
                13041
            ],
            [
                13042,
                13055
            ],
            [
                13055,
                13057
            ],
            [
                13057,
                13124
            ],
            [
                13124,
                13126
            ],
            [
                13126,
                13179
            ],
            [
                13189,
                13203
            ],
            [
                13209,
                13287
            ],
            [
                13288,
                13336
            ],
            [
                13336,
                13382
            ],
            [
                13382,
                13388
            ],
            [
                13390,
                13405
            ],
            [
                13405,
                13417
            ],
            [
                13417,
                13419
            ],
            [
                13419,
                13451
            ],
            [
                13452,
                13465
            ],
            [
                13465,
                13490
            ],
            [
                13490,
                13494
            ],
            [
                13494,
                13497
            ],
            [
                13497,
                13513
            ],
            [
                13513,
                13540
            ],
            [
                13540,
                13579
            ],
            [
                13579,
                13635
            ],
            [
                13640,
                13667
            ],
            [
                13670,
                13704
            ],
            [
                13704,
                13710
            ],
            [
                13711,
                13735
            ],
            [
                13735,
                13738
            ],
            [
                13739,
                13772
            ],
            [
                13772,
                13849
            ],
            [
                13850,
                13874
            ],
            [
                13874,
                13901
            ],
            [
                13901,
                13939
            ],
            [
                13956,
                13962
            ],
            [
                13963,
                14025
            ],
            [
                14037,
                14039
            ],
            [
                14040,
                14051
            ],
            [
                14052,
                14054
            ],
            [
                14057,
                14060
            ],
            [
                14060,
                14133
            ],
            [
                14133,
                14184
            ],
            [
                14184,
                14246
            ],
            [
                14246,
                14248
            ],
            [
                14248,
                14275
            ],
            [
                14289,
                14451
            ],
            [
                14451,
                14495
            ],
            [
                14496,
                14499
            ],
            [
                14506,
                14558
            ],
            [
                14558,
                14560
            ],
            [
                14560,
                14628
            ],
            [
                14630,
                14631
            ],
            [
                14631,
                14656
            ],
            [
                14656,
                14675
            ],
            [
                14675,
                14687
            ],
            [
                14689,
                14725
            ],
            [
                14725,
                14757
            ],
            [
                14757,
                14795
            ],
            [
                14795,
                14811
            ],
            [
                14811,
                14842
            ],
            [
                14842,
                14857
            ],
            [
                14857,
                14884
            ],
            [
                14885,
                14917
            ],
            [
                14920,
                14984
            ],
            [
                14984,
                15008
            ],
            [
                15008,
                15011
            ],
            [
                15017,
                15026
            ],
            [
                15032,
                15061
            ],
            [
                15067,
                15081
            ],
            [
                15081,
                15092
            ],
            [
                15092,
                15110
            ],
            [
                15110,
                15133
            ],
            [
                15134,
                15137
            ],
            [
                15138,
                15180
            ],
            [
                15180,
                15182
            ],
            [
                15182,
                15215
            ],
            [
                15215,
                15235
            ],
            [
                15235,
                15292
            ],
            [
                15292,
                15294
            ],
            [
                15299,
                15318
            ],
            [
                15326,
                15335
            ],
            [
                15336,
                15400
            ],
            [
                15400,
                15436
            ],
            [
                15439,
                15471
            ],
            [
                15471,
                15509
            ],
            [
                15509,
                15558
            ],
            [
                15558,
                15564
            ],
            [
                15565,
                15566
            ],
            [
                15567,
                15572
            ],
            [
                15573,
                15579
            ],
            [
                15579,
                15580
            ],
            [
                15581,
                15614
            ],
            [
                15614,
                15712
            ],
            [
                15716,
                15739
            ],
            [
                15740,
                15766
            ],
            [
                15767,
                15799
            ],
            [
                15799,
                15825
            ],
            [
                15825,
                15953
            ],
            [
                15954,
                16015
            ],
            [
                16016,
                16043
            ],
            [
                16053,
                16187
            ],
            [
                16188,
                16227
            ],
            [
                16227,
                16241
            ],
            [
                16241,
                16255
            ],
            [
                16255,
                16263
            ],
            [
                16263,
                16265
            ],
            [
                16265,
                16296
            ],
            [
                16296,
                16299
            ],
            [
                16300,
                16321
            ],
            [
                16321,
                16343
            ],
            [
                16343,
                16411
            ],
            [
                16411,
                16414
            ],
            [
                16414,
                16507
            ],
            [
                16512,
                16518
            ],
            [
                16518,
                16523
            ],
            [
                16524,
                16625
            ],
            [
                16625,
                16660
            ],
            [
                16666,
                16693
            ],
            [
                16696,
                16744
            ],
            [
                16744,
                16779
            ],
            [
                16780,
                16830
            ],
            [
                16830,
                16842
            ],
            [
                16842,
                16875
            ],
            [
                16875,
                17026
            ],
            [
                17027,
                17093
            ],
            [
                17094,
                17200
            ],
            [
                17200,
                17230
            ],
            [
                17230,
                17273
            ],
            [
                17274,
                17301
            ],
            [
                17301,
                17351
            ],
            [
                17351,
                17371
            ],
            [
                17377,
                17397
            ],
            [
                17406,
                17408
            ],
            [
                17408,
                17510
            ],
            [
                17511,
                17544
            ]
        ],
        "row_chars": [
            [
                0,
                137
            ],
            [
                137,
                193
            ],
            [
                193,
                317
            ],
            [
                317,
                511
            ],
            [
                511,
                696
            ],
            [
                696,
                728
            ],
            [
                728,
                728
            ],
            [
                728,
                798
            ],
            [
                798,
                798
            ],
            [
                798,
                864
            ],
            [
                864,
                939
            ],
            [
                939,
                1097
            ],
            [
                1097,
                1177
            ],
            [
                1177,
                1265
            ],
            [
                1265,
                1349
            ],
            [
                1349,
                1458
            ],
            [
                1458,
                1585
            ],
            [
                1585,
                1585
            ],
            [
                1585,
                1600
            ],
            [
                1600,
                1626
            ],
            [
                1626,
                1740
            ],
            [
                1740,
                1740
            ],
            [
                1740,
                1800
            ],
            [
                1800,
                1923
            ],
            [
                1923,
                1937
            ],
            [
                1937,
                1937
            ],
            [
                1937,
                1983
            ],
            [
                1983,
                1983
            ],
            [
                1983,
                2250
            ],
            [
                2250,
                2398
            ],
            [
                2398,
                2398
            ],
            [
                2398,
                2423
            ],
            [
                2423,
                2423
            ],
            [
                2423,
                2505
            ],
            [
                2505,
                2565
            ],
            [
                2565,
                2714
            ],
            [
                2714,
                2794
            ],
            [
                2794,
                2857
            ],
            [
                2857,
                2908
            ],
            [
                2908,
                2908
            ],
            [
                2908,
                2908
            ],
            [
                2908,
                2908
            ],
            [
                2908,
                2908
            ],
            [
                2908,
                2908
            ],
            [
                2908,
                2989
            ],
            [
                2989,
                3014
            ],
            [
                3014,
                3038
            ],
            [
                3038,
                3068
            ],
            [
                3068,
                3068
            ],
            [
                3068,
                3283
            ],
            [
                3283,
                3350
            ],
            [
                3350,
                3404
            ],
            [
                3404,
                3466
            ],
            [
                3466,
                3502
            ],
            [
                3502,
                3599
            ],
            [
                3599,
                3641
            ],
            [
                3641,
                3695
            ],
            [
                3695,
                3783
            ],
            [
                3783,
                3858
            ],
            [
                3858,
                3942
            ],
            [
                3942,
                4028
            ],
            [
                4028,
                4028
            ],
            [
                4028,
                4083
            ],
            [
                4083,
                4155
            ],
            [
                4155,
                4155
            ],
            [
                4155,
                4224
            ],
            [
                4224,
                4301
            ],
            [
                4301,
                4412
            ],
            [
                4412,
                4412
            ],
            [
                4412,
                4412
            ],
            [
                4412,
                4412
            ],
            [
                4412,
                4479
            ],
            [
                4479,
                4513
            ],
            [
                4513,
                4629
            ],
            [
                4629,
                4629
            ],
            [
                4629,
                4702
            ],
            [
                4702,
                4778
            ],
            [
                4778,
                4778
            ],
            [
                4778,
                4778
            ],
            [
                4778,
                4778
            ],
            [
                4778,
                4844
            ],
            [
                4844,
                4937
            ],
            [
                4937,
                4990
            ],
            [
                4990,
                5178
            ],
            [
                5178,
                5223
            ],
            [
                5223,
                5280
            ],
            [
                5280,
                5387
            ],
            [
                5387,
                5462
            ],
            [
                5462,
                5544
            ],
            [
                5544,
                5593
            ],
            [
                5593,
                5644
            ],
            [
                5644,
                5723
            ],
            [
                5723,
                5783
            ],
            [
                5783,
                5824
            ],
            [
                5824,
                5855
            ],
            [
                5855,
                5855
            ],
            [
                5855,
                5909
            ],
            [
                5909,
                5936
            ],
            [
                5936,
                5977
            ],
            [
                5977,
                5993
            ],
            [
                5993,
                6020
            ],
            [
                6020,
                6034
            ],
            [
                6034,
                6034
            ],
            [
                6034,
                6034
            ],
            [
                6034,
                6034
            ],
            [
                6034,
                6034
            ],
            [
                6034,
                6103
            ],
            [
                6103,
                6127
            ],
            [
                6127,
                6208
            ],
            [
                6208,
                6294
            ],
            [
                6294,
                6435
            ],
            [
                6435,
                6435
            ],
            [
                6435,
                6463
            ],
            [
                6463,
                6591
            ],
            [
                6591,
                6746
            ],
            [
                6746,
                6746
            ],
            [
                6746,
                6746
            ],
            [
                6746,
                6746
            ],
            [
                6746,
                6805
            ],
            [
                6805,
                6813
            ],
            [
                6813,
                6855
            ],
            [
                6855,
                6877
            ],
            [
                6877,
                6927
            ],
            [
                6927,
                6960
            ],
            [
                6960,
                6965
            ],
            [
                6965,
                7039
            ],
            [
                7039,
                7099
            ],
            [
                7099,
                7110
            ],
            [
                7110,
                7141
            ],
            [
                7141,
                7153
            ],
            [
                7153,
                7190
            ],
            [
                7190,
                7229
            ],
            [
                7229,
                7249
            ],
            [
                7249,
                7280
            ],
            [
                7280,
                7315
            ],
            [
                7315,
                7348
            ],
            [
                7348,
                7367
            ],
            [
                7367,
                7374
            ],
            [
                7374,
                7484
            ],
            [
                7484,
                7531
            ],
            [
                7531,
                7558
            ],
            [
                7558,
                7630
            ],
            [
                7630,
                7656
            ],
            [
                7656,
                7732
            ],
            [
                7732,
                7796
            ],
            [
                7796,
                7896
            ],
            [
                7896,
                7966
            ],
            [
                7966,
                7966
            ],
            [
                7966,
                8011
            ],
            [
                8011,
                8011
            ],
            [
                8011,
                8011
            ],
            [
                8011,
                8011
            ],
            [
                8011,
                8052
            ],
            [
                8052,
                8122
            ],
            [
                8122,
                8122
            ],
            [
                8122,
                8122
            ],
            [
                8122,
                8122
            ],
            [
                8122,
                8122
            ],
            [
                8122,
                8245
            ],
            [
                8245,
                8376
            ],
            [
                8376,
                8461
            ],
            [
                8461,
                8534
            ],
            [
                8534,
                8587
            ],
            [
                8587,
                8641
            ],
            [
                8641,
                8708
            ],
            [
                8708,
                8796
            ],
            [
                8796,
                8869
            ],
            [
                8869,
                9137
            ],
            [
                9137,
                9199
            ],
            [
                9199,
                9300
            ],
            [
                9300,
                9422
            ],
            [
                9422,
                9590
            ],
            [
                9590,
                9691
            ],
            [
                9691,
                9769
            ],
            [
                9769,
                9862
            ],
            [
                9862,
                10009
            ],
            [
                10009,
                10102
            ],
            [
                10102,
                10102
            ],
            [
                10102,
                10172
            ],
            [
                10172,
                10221
            ],
            [
                10221,
                10288
            ],
            [
                10288,
                10391
            ],
            [
                10391,
                10391
            ],
            [
                10391,
                10391
            ],
            [
                10391,
                10418
            ],
            [
                10418,
                10418
            ],
            [
                10418,
                10484
            ],
            [
                10484,
                10523
            ],
            [
                10523,
                10611
            ],
            [
                10611,
                10669
            ],
            [
                10669,
                10733
            ],
            [
                10733,
                10772
            ],
            [
                10772,
                10837
            ],
            [
                10837,
                10935
            ],
            [
                10935,
                11042
            ],
            [
                11042,
                11091
            ],
            [
                11091,
                11131
            ],
            [
                11131,
                11148
            ],
            [
                11148,
                11148
            ],
            [
                11148,
                11239
            ],
            [
                11239,
                11350
            ],
            [
                11350,
                11422
            ],
            [
                11422,
                11448
            ],
            [
                11448,
                11490
            ],
            [
                11490,
                11544
            ],
            [
                11544,
                11597
            ],
            [
                11597,
                11717
            ],
            [
                11717,
                11745
            ],
            [
                11745,
                11775
            ],
            [
                11775,
                11787
            ],
            [
                11787,
                11805
            ],
            [
                11805,
                11830
            ],
            [
                11830,
                11905
            ],
            [
                11905,
                12004
            ],
            [
                12004,
                12037
            ],
            [
                12037,
                12064
            ],
            [
                12064,
                12131
            ],
            [
                12131,
                12184
            ],
            [
                12184,
                12237
            ],
            [
                12237,
                12358
            ],
            [
                12358,
                12358
            ],
            [
                12358,
                12463
            ],
            [
                12463,
                12544
            ],
            [
                12544,
                12677
            ],
            [
                12677,
                12677
            ],
            [
                12677,
                12702
            ],
            [
                12702,
                12711
            ],
            [
                12711,
                12847
            ],
            [
                12847,
                12896
            ],
            [
                12896,
                12905
            ],
            [
                12905,
                12985
            ],
            [
                12985,
                12985
            ],
            [
                12985,
                12985
            ],
            [
                12985,
                12996
            ],
            [
                12996,
                13057
            ],
            [
                13057,
                13126
            ],
            [
                13126,
                13203
            ],
            [
                13203,
                13203
            ],
            [
                13203,
                13288
            ],
            [
                13288,
                13288
            ],
            [
                13288,
                13288
            ],
            [
                13288,
                13336
            ],
            [
                13336,
                13382
            ],
            [
                13382,
                13405
            ],
            [
                13405,
                13419
            ],
            [
                13419,
                13465
            ],
            [
                13465,
                13490
            ],
            [
                13490,
                13497
            ],
            [
                13497,
                13513
            ],
            [
                13513,
                13540
            ],
            [
                13540,
                13579
            ],
            [
                13579,
                13670
            ],
            [
                13670,
                13704
            ],
            [
                13704,
                13735
            ],
            [
                13735,
                13772
            ],
            [
                13772,
                13874
            ],
            [
                13874,
                13901
            ],
            [
                13901,
                13939
            ],
            [
                13939,
                13939
            ],
            [
                13939,
                14060
            ],
            [
                14060,
                14133
            ],
            [
                14133,
                14184
            ],
            [
                14184,
                14248
            ],
            [
                14248,
                14451
            ],
            [
                14451,
                14560
            ],
            [
                14560,
                14656
            ],
            [
                14656,
                14675
            ],
            [
                14675,
                14725
            ],
            [
                14725,
                14757
            ],
            [
                14757,
                14795
            ],
            [
                14795,
                14811
            ],
            [
                14811,
                14842
            ],
            [
                14842,
                14857
            ],
            [
                14857,
                14920
            ],
            [
                14920,
                14920
            ],
            [
                14920,
                14984
            ],
            [
                14984,
                15011
            ],
            [
                15011,
                15011
            ],
            [
                15011,
                15081
            ],
            [
                15081,
                15092
            ],
            [
                15092,
                15110
            ],
            [
                15110,
                15182
            ],
            [
                15182,
                15215
            ],
            [
                15215,
                15235
            ],
            [
                15235,
                15292
            ],
            [
                15292,
                15400
            ],
            [
                15400,
                15471
            ],
            [
                15471,
                15558
            ],
            [
                15558,
                15614
            ],
            [
                15614,
                15740
            ],
            [
                15740,
                15799
            ],
            [
                15799,
                15799
            ],
            [
                15799,
                15799
            ],
            [
                15799,
                15825
            ],
            [
                15825,
                15954
            ],
            [
                15954,
                16016
            ],
            [
                16016,
                16227
            ],
            [
                16227,
                16241
            ],
            [
                16241,
                16255
            ],
            [
                16255,
                16265
            ],
            [
                16265,
                16296
            ],
            [
                16296,
                16321
            ],
            [
                16321,
                16343
            ],
            [
                16343,
                16414
            ],
            [
                16414,
                16625
            ],
            [
                16625,
                16625
            ],
            [
                16625,
                16744
            ],
            [
                16744,
                16830
            ],
            [
                16830,
                16842
            ],
            [
                16842,
                16875
            ],
            [
                16875,
                16875
            ],
            [
                16875,
                16875
            ],
            [
                16875,
                16875
            ],
            [
                16875,
                17094
            ],
            [
                17094,
                17200
            ],
            [
                17200,
                17230
            ],
            [
                17230,
                17301
            ],
            [
                17301,
                17351
            ],
            [
                17351,
                17351
            ],
            [
                17351,
                17408
            ],
            [
                17408,
                17408
            ],
            [
                17408,
                17544
            ]
        ]
    }
}