{
    "original": {
        "text": "Lady Macleod lived at No. 3, Paramount Crescent, in Cheltenham, where she occupied a very handsome first-floor drawing-room, with a bedroom behind it, looking over a stable-yard, and a small room which would have been the dressing-room had the late Sir Archibald been alive, but which was at present called the dining-room: and in it Lady Macleod did dine whenever her larger room was to be used for any purposes of evening company. The vicinity of the stable-yard was not regarded by the tenant as among the attractions of the house; but it had the effect of lowering the rent, and Lady Macleod was a woman who regarded such matters. Her income, though small, would have sufficed to enable her to live removed from such discomforts; but she was one of those women who regard it as a duty to leave something behind them,--even though it be left to those who do not at all want it; and Lady Macleod was a woman who wilfully neglected no duty. So she pinched herself, and inhaled the effluvia of the stables, and squabbled with the cabmen, in order that she might bequeath a thousand pounds or two to some Lady Midlothian, who cared, perhaps, little for her, and would hardly thank her memory for the money.\nHad Alice consented to live with her, she would have merged that duty of leaving money behind her in that other duty of finding a home for her adopted niece. But Alice had gone away, and therefore the money was due to Lady Midlothian rather than to her. The saving, however, was postponed whenever Alice would consent to visit Cheltenham; and a bedroom was secured for her which did not look out over the stables. Accommodation was also found for her maid much better than that provided for Lady Macleod's own maid. She was a hospitable, good old woman, painfully struggling to do the best she could in the world. It was a pity that she was such a bore, a pity that she was so hard to cabmen and others, a pity that she suspected all tradesmen, servants, and people generally of a rank of life inferior to her own, a pity that she was disposed to condemn for ever and ever so many of her own rank because they played cards on week days, and did not go to church on Sundays,--and a pity, as I think above all, that while she was so suspicious of the poor she was so lenient to the vices of earls, earl's sons, and such like.\nAlice, having fully considered the matter, had thought it most prudent to tell Lady Macleod by letter what she had done in regard to Mr. Grey. There had been many objections to the writing of such a letter, but there appeared to be stronger objection to that telling it face to face which would have been forced upon her had she not written. There would in such case have arisen on Lady Macleod's countenance a sternness of rebuke which Alice did not choose to encounter. The same sternness of rebuke would come upon the countenance on receipt of the written information; but it would come in its most aggravated form on the immediate receipt of the letter, and some of its bitterness would have passed away before Alice's arrival. I think that Alice was right. It is better for both parties that any great offence should be confessed by letter.\nBut Alice trembled as the cab drew up at No. 3, Paramount Crescent. She met her aunt, as was usual, just inside the drawing-room door, and she saw at once that if any bitterness had passed away from that face, the original bitterness must indeed have been bitter. She had so timed her letter that Lady Macleod should have no opportunity of answering it. The answer was written there in the mingled anger and sorrow of those austere features.\n\"Alice!\" she said, as she took her niece in her arms and kissed her; \"oh, Alice, what is this?\"\n\"Yes, aunt; it is very bad, I know,\" and poor Alice tried to make a jest of it. \"Young ladies are very wicked when they don't know their own minds. But if they haven't known them and have been wicked, what can they do but repent?\"\n\"Repent!\" said Lady Macleod. \"Yes; I hope you will repent. Poor Mr. Grey;--what must he think of it?\"\n\"I can only hope, aunt, that he won't think of it at all for very long.\"\n\"That's nonsense, my dear, Of course he'll think of it, and of course you'll marry him.\"\n\"Shall I, aunt?\"\n\"Of course you will. Why, Alice, hasn't it been all settled among families? Lady Midlothian knew all the particulars of it just as well as I did. And is not your word pledged to him? I really don't understand what you mean. I don't see how it is possible you should go back. Gentlemen when they do that kind of thing are put out of society;--but I really think it is worse in a woman.\"\n\"Then they may if they please put me out of society;--only that I don't know that I'm particularly in it.\"\n\"And the wickedness of the thing, Alice! I'm obliged to say so.\"\n\"When you talk to me about society, aunt, and about Lady Midlothian, I give up to you, willingly;--the more willingly, perhaps, because I don't care much for one or the other.\" Here Lady Macleod tried to say a word; but she failed, and Alice went on, boldly looking up into her aunt's face, which became a shade more bitter than ever. \"But when you tell me about wickedness and my conscience, then I must be my own judge. It is my conscience, and the fear of committing wickedness, that has made me do this.\"\n\"You should submit to be guided by your elders, Alice.\"\n\"No; my elders in such a matter as this cannot teach me. It cannot be right that I should go to a man's house and be his wife, if I do not think that I can make him happy.\"\n\"Then why did you accept him?\"\n\"Because I was mistaken. I am not going to defend that. If you choose to scold me for that, you may do so, aunt, and I will not answer you. But as to marrying him or not marrying him now,--as to that, I must judge for myself.\"\n\"It was a pity you did not know your own mind earlier.\"\n\"It was a pity,--a great pity. I have done myself an injury that is quite irretrievable;--I know that, and am prepared to bear it. I have done him, too, an injustice which I regret with my whole heart. I can only excuse myself by saying that I might have done him a worse injustice.\"\nAll this was said at the very moment of her arrival, and the greeting did not seem to promise much for the happiness of the next month; but perhaps it was better for them both that the attack and the defence should thus be made suddenly, at their first meeting. It is better to pull the string at once when you are in the shower-bath, and not to stand shivering, thinking of the inevitable shock which you can only postpone for a few minutes. Lady Macleod in this case had pulled the string, and thus reaped the advantage of her alacrity.\n\"Well, my dear,\" said her ladyship, \"I suppose you will like to go up-stairs and take off your bonnet. Mary shall bring you some tea when you come down.\" So Alice escaped, and when she returned to the comfort of her cup of tea in the drawing-room, the fury of the storm had passed away. She sat talking of other things till dinner; and though Lady Macleod did during the evening make one allusion to \"poor Mr. Grey,\" the subject was allowed to drop. Alice was very tender as to her aunt's ailments, was more than ordinarily attentive to the long list of Cheltenham iniquities which was displayed to her, and refrained from combating any of her aunt's religious views. After a while they got upon the subject of Aunt Greenow, for whose name Lady Macleod had a special aversion,--as indeed she had for all the Vavasor side of Alice's family; and then Alice offered to read, and did read to her aunt many pages out of one of those terrible books of wrath, which from time to time come forth and tell us that there is no hope for us. Lady Macleod liked to be so told; and as she now, poor woman, could not read at nights herself, she enjoyed her evening.\nLady Macleod no doubt did enjoy her niece's sojourn at Cheltenham, but I do not think it could have been pleasant to Alice. On the second day nothing was said about Mr. Grey, and Alice hoped that by her continual readings in the book of wrath her aunt's heart might be softened towards her. But it seemed that Lady Macleod measured the periods of respite, for on the third day and on the fifth she returned to the attack. \"Did John Grey still wish that the match should go on?\" she asked, categorically. It was in vain that Alice tried to put aside the question, and begged that the matter might not be discussed. Lady Macleod insisted on her right to carry on the examination, and Alice was driven to acknowledge that she believed he did wish it. She could hardly say otherwise, seeing that she had at that moment a letter from him in her pocket, in which he still spoke of his engagement as being absolutely binding on him, and expressed a hope that this change from London to Cheltenham would bring her round and set everything to rights. He certainly did, in a fashion, wave his hand over her, as Kate had said of him. This letter Alice had resolved that she would not answer. He would probably write again, and she would beg him to desist. Instead of Cheltenham bringing her round, Cheltenham had made her firmer than ever in her resolution. I am inclined to think that the best mode of bringing her round at this moment would have been a course of visits from her cousin George, and a series of letters from her cousin Kate. Lady Macleod's injunctions would certainly not bring her round.\nAfter ten days, ten terrible days, devoted to discussions on matrimony in the morning, and to the book of wrath in the evening,--relieved by two tea-parties, in which the sins of Cheltenham were discussed at length,--Lady Macleod herself got a letter from Mr. Grey. Mr. Grey's kindest compliments to Lady Macleod. He believed that Lady Macleod was aware of the circumstances of his engagement with Miss Vavasor. Might he call on Miss Vavasor at Lady Macleod's house in Cheltenham? and might he also hope to have the pleasure of making Lady Macleod's acquaintance? Alice had been in the room when her aunt received this letter, but her aunt had said nothing, and Alice had not known from whom the letter had come. When her aunt crept away with it after breakfast she had suspected nothing, and had never imagined that Lady Macleod, in the privacy of her own room looking out upon the stables, had addressed a letter to Nethercoats. But such a letter had been addressed to Nethercoats, and Mr. Grey had been informed that he would be received in Paramount Crescent with great pleasure.\nMr. Grey had even indicated the day on which he would come, and on the morning of that day Lady Macleod had presided over the two teacups in a state of nervous excitement which was quite visible to Alice. More than once Alice asked little questions, not supposing that she was specially concerned in the matter which had caused her aunt's fidgety restlessness, but observing it so plainly that it was almost impossible not to allude to it. \"There's nothing the matter, my dear, at all,\" at last Lady Macleod said; but as she said so she was making up her mind that the moment had not come in which she must apprise Alice of Mr. Grey's intended visit. As Alice had questioned her at the breakfast table she would say nothing about it then, but waited till the teacups were withdrawn, and till the maid had given her last officious poke to the fire. Then she began. She had Mr. Grey's letter in her pocket, and as she prepared herself to speak, she pulled it out and held it on the little table before her.\n\"Alice,\" she said, \"I expect a visitor here to-day.\"\nAlice knew instantly who was the expected visitor. Probably any girl under such circumstances would have known equally well. \"A visitor, aunt,\" she said, and managed to hide her knowledge admirably.\n\"Yes, Alice a visitor. I should have told you before, only I thought,--I thought I had better not. It is Mr.--Mr. Grey.\"\n\"Indeed, aunt! Is he coming to see you?\"\n\"Well;--he is desirous no doubt of seeing you more especially; but he has expressed a wish to make my acquaintance, which I cannot, under the circumstances, think is unnatural. Of course, Alice, he must want to talk over this affair with your friends.\"\n\"I wish I could have spared them,\" said Alice,--\"I wish I could.\"\n\"I have brought his letter here, and you can see it if you please. It is very nicely written, and as far as I am concerned I should not think of refusing to see him. And now comes the question. What are we to do with him? Am I to ask him to dinner? I take it for granted that he will not expect me to offer him a bed, as he knows that I live in lodgings.\"\n\"Oh no, aunt; he certainly will not expect that.\"\n\"But ought I to ask him to dinner? I should be most happy to entertain him, though you know how very scanty my means of doing so are;--but I really do not know how it might be,--between you and him, I mean.\"\n\"We should not fight, aunt.\"\n\"No, I suppose not;--but if you cannot be affectionate in your manner to him--\"\n\"I will not answer for my manners, aunt; but you may be sure of this,--that I should be affectionate in my heart. I shall always regard him as a dearly loved friend; though for many years, no doubt, I shall be unable to express my friendship.\"\n\"That may be all very well, Alice, but it will not be what he will want. I think upon the whole that I had better not ask him to dinner.\"\n\"Perhaps not, aunt.\"\n\"It is a period of the day in which any special constraint among people is more disagreeable than at any other time, and then at dinner the servants must see it. I think there might be some awkwardness if he were to dine here.\"\n\"I really think there would,\" said Alice, anxious to have the subject dropped.\n\"I hope he won't think that I am inhospitable. I should be so happy to do the best I could for him, for I regard him, Alice, quite as though he were to be your husband. And when anybody at all connected with me has come to Cheltenham I always have asked them to dine, and then I have Gubbins's man to come and wait at table,--as you know.\"\n\"Of all men in the world Mr. Grey is the last to think about it.\"\n\"That should only make me the more careful. But I think it would perhaps be more comfortable if he were to come in the evening.\"\n\"Much more comfortable, aunt.\"\n\"I suppose he will be here in the afternoon, before dinner, and we had better wait at home for him. I dare say he'll want to see you alone, and therefore I'll retire to my own rooms,\"--looking over the stables! Dear old lady. \"But if you wish it, I will receive him first--and then Martha,\"--Martha was Alice's maid--\"can fetch you down.\"\nThis discussion as to the propriety or impropriety of giving her lover a dinner had not been pleasant to Alice, but, nevertheless, when it was over she felt grateful to Lady Macleod. There was an attempt in the arrangement to make Mr. Grey's visit as little painful as possible; and though such a discussion at such a time might as well have been avoided, the decision to which her ladyship had at last come with reference both to the dinner and the management of the visit was, no doubt, the right one.\nLady Macleod had been quite correct in all her anticipations. At three o'clock Mr. Grey was announced, and Lady Macleod, alone, received him in her drawing-room. She had intended to give him a great deal of good advice, to bid him still keep up his heart and as it were hold up his head, to confess to him how very badly Alice was behaving, and to express her entire concurrence with that theory of bodily ailment as the cause and origin of her conduct. But she found that Mr. Grey was a man to whom she could not give much advice. It was he who did the speaking at this conference, and not she. She was overawed by him after the first three minutes. Indeed her first glance at him had awed her. He was so handsome,--and then, in his beauty, he had so quiet and almost saddened an air! Strange to say that after she had seen him, Lady Macleod entertained for him an infinitely higher admiration than before, and yet she was less surprised than she had been at Alice's refusal of him. The conference was very short; and Mr. Grey had not been a quarter of an hour in the house before Martha attended upon her mistress with her summons.\nAlice was ready and came down instantly. She found Mr. Grey standing in the middle of the room waiting to receive her, and the look of majesty which had cowed Lady Macleod had gone from his countenance. He could not have received her with a kinder smile, had she come to him with a promise that she would at this meeting name the day for their marriage. \"At any rate it does not make him unhappy,\" she said to herself.\n\"You are not angry,\" he said, \"that I should have followed you all the way here, to see you.\"\n\"No, certainly; not angry, Mr. Grey. All anger that there may be between us must be on your side. I feel that thoroughly.\"\n\"Then there shall be none on either side. Whatever may be done, I will not be angry with you. Your father advised me to come down here to you.\"\n\"You have seen him, then?\"\n\"Yes, I have seen him. I was in London the day you left.\"\n\"It is so terrible to think that I should have brought upon you all this trouble.\"\n\"You will bring upon me much worse trouble than that unless--. But I have not now come down here to tell you that. I believe that according to rule in such matters I should not have come to you at all, but I don't know that I care much about such rules.\"\n\"It is I that have broken all rules.\"\n\"When a lady tells a gentleman that she does not wish to see more of him--\"\n\"Oh, Mr. Grey, I have not told you that.\"\n\"Have you not? I am glad at any rate to hear you deny it. But you will understand what I mean. When a gentleman gets his dismissal from a lady he should accept it,--that is, his dismissal under such circumstances as I have received mine. But I cannot lay down my love in that way; nor, maintaining my love, can I give up the battle. It seems to me that I have a right at any rate to know something of your comings and goings as long as,--unless, Alice, you should take another name than mine.\"\n\"My intention is to keep my own.\" This she said in the lowest possible tone,--almost in a whisper,--with her eyes fixed upon the ground.\n\"And you will not deny me that right?\"\n\"I cannot hinder you. Whatever you may do, I myself have sinned so against you that I can have no right to blame you.\"\n\"There shall be no question between us of injury from one to the other. In any conversation that we may have, or in any correspondence--\"\n\"Oh, Mr. Grey, do not ask me to write.\"\n\"Listen to me. Should there be any on either side, there shall be no idea of any wrong done.\"\n\"But I have done you wrong;--great wrong.\"\n\"No, Alice; I will not have it so. When I asked you to accept my hand,--begging the greatest boon which it could ever come to my lot to ask from a fellow-mortal,--I knew well how great was your goodness to me when you told me that it should be mine. Now that you refuse it, I know also that you are good, thinking that in doing so you are acting for my welfare,--thinking more of my welfare than of your own.\"\n\"Oh yes, yes; it is so, Mr. Grey; indeed it is so.\"\n\"Believing that, how can I talk of wrong? That you are wrong in your thinking on this subject,--that your mind has become twisted by false impressions,--that I believe. But I cannot therefore love you less,--nor, so believing, can I consider myself to be injured. Nor am I even so little selfish as you are. I think if you were my wife that I could make you happy; but I feel sure that my happiness depends on your being my wife.\"\nShe looked up into his face, but it was still serene in all its manly beauty. Her cousin George, if he were moved to strong feeling, showed it at once in his eyes,--in his mouth, in the whole visage of his countenance. He glared in his anger, and was impassioned in his love. But Mr. Grey when speaking of the happiness of his entire life, when confessing that it was now at stake with a decision against him that would be ruinous to it, spoke without a quiver in his voice, and had no more sign of passion in his face than if he were telling his gardener to move a rose tree.\n\"I hope--and believe that you will find your happiness elsewhere, Mr. Grey.\"\n\"Well; we can but differ, Alice. In that we do differ. And now I will say one word to explain why I have come here. If I were to write to you against your will, it would seem that I were persecuting you. I cannot bring myself to do that, even though I had the right. But if I were to let you go from me, taking what you have said to me and doing nothing, it would seem that I had accepted your decision as final. I do not do so. I will not do so. I come simply to tell you that I am still your suitor. If you will let me, I will see you again early in January,--as soon as you have returned to town. You will hardly refuse to see me.\"\n\"No,\" she said; \"I cannot refuse to see you.\"\n\"Then it shall be so,\" he said, \"and I will not trouble you with letters, nor will I trouble you longer now with words. Tell your aunt that I have said what I came to say, and that I give her my kindest thanks.\" Then he took her hand and pressed it,--not as George Vavasor had pressed it,--and was gone. When Lady Macleod returned, she found that the question of the evening's tea arrangements had settled itself.",
        "paragraph_chars": [
            [
                0,
                1206
            ],
            [
                1206,
                2330
            ],
            [
                2330,
                3176
            ],
            [
                3176,
                3618
            ],
            [
                3618,
                3714
            ],
            [
                3714,
                3945
            ],
            [
                3945,
                4047
            ],
            [
                4047,
                4120
            ],
            [
                4120,
                4209
            ],
            [
                4209,
                4226
            ],
            [
                4226,
                4612
            ],
            [
                4612,
                4719
            ],
            [
                4719,
                4784
            ],
            [
                4784,
                5293
            ],
            [
                5293,
                5349
            ],
            [
                5349,
                5522
            ],
            [
                5522,
                5553
            ],
            [
                5553,
                5780
            ],
            [
                5780,
                5836
            ],
            [
                5836,
                6120
            ],
            [
                6120,
                6659
            ],
            [
                6659,
                7810
            ],
            [
                7810,
                9405
            ],
            [
                9405,
                10489
            ],
            [
                10489,
                11494
            ],
            [
                11494,
                11547
            ],
            [
                11547,
                11746
            ],
            [
                11746,
                11867
            ],
            [
                11867,
                11908
            ],
            [
                11908,
                12161
            ],
            [
                12161,
                12227
            ],
            [
                12227,
                12583
            ],
            [
                12583,
                12633
            ],
            [
                12633,
                12841
            ],
            [
                12841,
                12870
            ],
            [
                12870,
                12950
            ],
            [
                12950,
                13194
            ],
            [
                13194,
                13332
            ],
            [
                13332,
                13353
            ],
            [
                13353,
                13581
            ],
            [
                13581,
                13660
            ],
            [
                13660,
                14000
            ],
            [
                14000,
                14066
            ],
            [
                14066,
                14195
            ],
            [
                14195,
                14226
            ],
            [
                14226,
                14565
            ],
            [
                14565,
                15069
            ],
            [
                15069,
                16203
            ],
            [
                16203,
                16622
            ],
            [
                16622,
                16716
            ],
            [
                16716,
                16839
            ],
            [
                16839,
                16983
            ],
            [
                16983,
                17010
            ],
            [
                17010,
                17068
            ],
            [
                17068,
                17151
            ],
            [
                17151,
                17406
            ],
            [
                17406,
                17444
            ],
            [
                17444,
                17520
            ],
            [
                17520,
                17562
            ],
            [
                17562,
                18056
            ],
            [
                18056,
                18193
            ],
            [
                18193,
                18232
            ],
            [
                18232,
                18351
            ],
            [
                18351,
                18489
            ],
            [
                18489,
                18529
            ],
            [
                18529,
                18623
            ],
            [
                18623,
                18666
            ],
            [
                18666,
                19076
            ],
            [
                19076,
                19128
            ],
            [
                19128,
                19559
            ],
            [
                19559,
                20136
            ],
            [
                20136,
                20213
            ],
            [
                20213,
                20848
            ],
            [
                20848,
                20894
            ],
            [
                20894,
                21307
            ]
        ],
        "segment_chars": [
            [
                0,
                433
            ],
            [
                433,
                635
            ],
            [
                635,
                942
            ],
            [
                942,
                1206
            ],
            [
                1206,
                1364
            ],
            [
                1364,
                1460
            ],
            [
                1460,
                1620
            ],
            [
                1620,
                1722
            ],
            [
                1722,
                1820
            ],
            [
                1820,
                2330
            ],
            [
                2330,
                2473
            ],
            [
                2473,
                2672
            ],
            [
                2672,
                2802
            ],
            [
                2802,
                3062
            ],
            [
                3062,
                3092
            ],
            [
                3092,
                3176
            ],
            [
                3176,
                3244
            ],
            [
                3244,
                3440
            ],
            [
                3440,
                3530
            ],
            [
                3530,
                3618
            ],
            [
                3618,
                3627
            ],
            [
                3627,
                3714
            ],
            [
                3714,
                3794
            ],
            [
                3794,
                3862
            ],
            [
                3862,
                3945
            ],
            [
                3945,
                3955
            ],
            [
                3955,
                3974
            ],
            [
                3974,
                4004
            ],
            [
                4004,
                4047
            ],
            [
                4047,
                4120
            ],
            [
                4120,
                4209
            ],
            [
                4209,
                4226
            ],
            [
                4226,
                4247
            ],
            [
                4247,
                4302
            ],
            [
                4302,
                4372
            ],
            [
                4372,
                4409
            ],
            [
                4409,
                4450
            ],
            [
                4450,
                4501
            ],
            [
                4501,
                4612
            ],
            [
                4612,
                4719
            ],
            [
                4719,
                4760
            ],
            [
                4760,
                4784
            ],
            [
                4784,
                4961
            ],
            [
                4961,
                5119
            ],
            [
                5119,
                5206
            ],
            [
                5206,
                5293
            ],
            [
                5293,
                5349
            ],
            [
                5349,
                5406
            ],
            [
                5406,
                5522
            ],
            [
                5522,
                5553
            ],
            [
                5553,
                5578
            ],
            [
                5578,
                5609
            ],
            [
                5609,
                5693
            ],
            [
                5693,
                5780
            ],
            [
                5780,
                5836
            ],
            [
                5836,
                5867
            ],
            [
                5867,
                5967
            ],
            [
                5967,
                6038
            ],
            [
                6038,
                6120
            ],
            [
                6120,
                6382
            ],
            [
                6382,
                6563
            ],
            [
                6563,
                6659
            ],
            [
                6659,
                6762
            ],
            [
                6762,
                6813
            ],
            [
                6813,
                6946
            ],
            [
                6946,
                7109
            ],
            [
                7109,
                7327
            ],
            [
                7327,
                7689
            ],
            [
                7689,
                7810
            ],
            [
                7810,
                7934
            ],
            [
                7934,
                8101
            ],
            [
                8101,
                8232
            ],
            [
                8232,
                8288
            ],
            [
                8288,
                8314
            ],
            [
                8314,
                8424
            ],
            [
                8424,
                8558
            ],
            [
                8558,
                8852
            ],
            [
                8852,
                8933
            ],
            [
                8933,
                8991
            ],
            [
                8991,
                9055
            ],
            [
                9055,
                9157
            ],
            [
                9157,
                9341
            ],
            [
                9341,
                9405
            ],
            [
                9405,
                9671
            ],
            [
                9671,
                9719
            ],
            [
                9719,
                9817
            ],
            [
                9817,
                9886
            ],
            [
                9886,
                9969
            ],
            [
                9969,
                10118
            ],
            [
                10118,
                10336
            ],
            [
                10336,
                10489
            ],
            [
                10489,
                10694
            ],
            [
                10694,
                10929
            ],
            [
                10929,
                11140
            ],
            [
                11140,
                11337
            ],
            [
                11337,
                11353
            ],
            [
                11353,
                11494
            ],
            [
                11494,
                11547
            ],
            [
                11547,
                11598
            ],
            [
                11598,
                11672
            ],
            [
                11672,
                11746
            ],
            [
                11746,
                11769
            ],
            [
                11769,
                11845
            ],
            [
                11845,
                11867
            ],
            [
                11867,
                11882
            ],
            [
                11882,
                11908
            ],
            [
                11908,
                12085
            ],
            [
                12085,
                12161
            ],
            [
                12161,
                12227
            ],
            [
                12227,
                12294
            ],
            [
                12294,
                12393
            ],
            [
                12393,
                12421
            ],
            [
                12421,
                12449
            ],
            [
                12449,
                12476
            ],
            [
                12476,
                12583
            ],
            [
                12583,
                12633
            ],
            [
                12633,
                12668
            ],
            [
                12668,
                12841
            ],
            [
                12841,
                12870
            ],
            [
                12870,
                12950
            ],
            [
                12950,
                13064
            ],
            [
                13064,
                13194
            ],
            [
                13194,
                13267
            ],
            [
                13267,
                13332
            ],
            [
                13332,
                13353
            ],
            [
                13353,
                13515
            ],
            [
                13515,
                13581
            ],
            [
                13581,
                13660
            ],
            [
                13660,
                13707
            ],
            [
                13707,
                13829
            ],
            [
                13829,
                14000
            ],
            [
                14000,
                14066
            ],
            [
                14066,
                14110
            ],
            [
                14110,
                14195
            ],
            [
                14195,
                14226
            ],
            [
                14226,
                14326
            ],
            [
                14326,
                14437
            ],
            [
                14437,
                14452
            ],
            [
                14452,
                14565
            ],
            [
                14565,
                14748
            ],
            [
                14748,
                15069
            ],
            [
                15069,
                15131
            ],
            [
                15131,
                15231
            ],
            [
                15231,
                15523
            ],
            [
                15523,
                15601
            ],
            [
                15601,
                15665
            ],
            [
                15665,
                15720
            ],
            [
                15720,
                15765
            ],
            [
                15765,
                15855
            ],
            [
                15855,
                16053
            ],
            [
                16053,
                16203
            ],
            [
                16203,
                16244
            ],
            [
                16244,
                16406
            ],
            [
                16406,
                16557
            ],
            [
                16557,
                16622
            ],
            [
                16622,
                16716
            ],
            [
                16716,
                16753
            ],
            [
                16753,
                16814
            ],
            [
                16814,
                16839
            ],
            [
                16839,
                16881
            ],
            [
                16881,
                16933
            ],
            [
                16933,
                16983
            ],
            [
                16983,
                17010
            ],
            [
                17010,
                17033
            ],
            [
                17033,
                17068
            ],
            [
                17068,
                17151
            ],
            [
                17151,
                17214
            ],
            [
                17214,
                17266
            ],
            [
                17266,
                17406
            ],
            [
                17406,
                17444
            ],
            [
                17444,
                17520
            ],
            [
                17520,
                17562
            ],
            [
                17562,
                17577
            ],
            [
                17577,
                17620
            ],
            [
                17620,
                17657
            ],
            [
                17657,
                17800
            ],
            [
                17800,
                17895
            ],
            [
                17895,
                18056
            ],
            [
                18056,
                18090
            ],
            [
                18090,
                18193
            ],
            [
                18193,
                18232
            ],
            [
                18232,
                18254
            ],
            [
                18254,
                18351
            ],
            [
                18351,
                18423
            ],
            [
                18423,
                18489
            ],
            [
                18489,
                18529
            ],
            [
                18529,
                18544
            ],
            [
                18544,
                18623
            ],
            [
                18623,
                18666
            ],
            [
                18666,
                18701
            ],
            [
                18701,
                18916
            ],
            [
                18916,
                19076
            ],
            [
                19076,
                19128
            ],
            [
                19128,
                19170
            ],
            [
                19170,
                19297
            ],
            [
                19297,
                19392
            ],
            [
                19392,
                19436
            ],
            [
                19436,
                19559
            ],
            [
                19559,
                19637
            ],
            [
                19637,
                19778
            ],
            [
                19778,
                19835
            ],
            [
                19835,
                20136
            ],
            [
                20136,
                20213
            ],
            [
                20213,
                20246
            ],
            [
                20246,
                20268
            ],
            [
                20268,
                20329
            ],
            [
                20329,
                20417
            ],
            [
                20417,
                20480
            ],
            [
                20480,
                20626
            ],
            [
                20626,
                20642
            ],
            [
                20642,
                20660
            ],
            [
                20660,
                20715
            ],
            [
                20715,
                20813
            ],
            [
                20813,
                20848
            ],
            [
                20848,
                20894
            ],
            [
                20894,
                21014
            ],
            [
                21014,
                21106
            ],
            [
                21106,
                21198
            ],
            [
                21198,
                21307
            ]
        ],
        "overlap_chars": [
            [
                0,
                149
            ],
            [
                218,
                221
            ],
            [
                166,
                190
            ],
            [
                311,
                322
            ],
            [
                431,
                433
            ],
            [
                449,
                472
            ],
            [
                533,
                541
            ],
            [
                569,
                577
            ],
            [
                633,
                635
            ],
            [
                890,
                897
            ],
            [
                639,
                680
            ],
            [
                691,
                702
            ],
            [
                716,
                741
            ],
            [
                776,
                778
            ],
            [
                635,
                638
            ],
            [
                784,
                797
            ],
            [
                808,
                814
            ],
            [
                681,
                683
            ],
            [
                837,
                839
            ],
            [
                940,
                942
            ],
            [
                942,
                948
            ],
            [
                970,
                981
            ],
            [
                991,
                1124
            ],
            [
                1161,
                1206
            ],
            [
                1460,
                1509
            ],
            [
                1533,
                1620
            ],
            [
                1702,
                1709
            ],
            [
                1726,
                1820
            ],
            [
                1820,
                1875
            ],
            [
                1926,
                1960
            ],
            [
                1891,
                1901
            ],
            [
                1965,
                1971
            ],
            [
                1982,
                1984
            ],
            [
                2000,
                2008
            ],
            [
                1987,
                1991
            ],
            [
                1972,
                1981
            ],
            [
                2181,
                2191
            ],
            [
                2215,
                2294
            ],
            [
                2328,
                2330
            ],
            [
                2330,
                2335
            ],
            [
                2373,
                2387
            ],
            [
                2393,
                2431
            ],
            [
                2463,
                2473
            ],
            [
                2479,
                2482
            ],
            [
                2504,
                2506
            ],
            [
                2589,
                2596
            ],
            [
                2647,
                2650
            ],
            [
                2600,
                2612
            ],
            [
                2900,
                2901
            ],
            [
                2992,
                2999
            ],
            [
                2712,
                2726
            ],
            [
                3004,
                3014
            ],
            [
                2751,
                2760
            ],
            [
                3015,
                3061
            ],
            [
                3176,
                3216
            ],
            [
                3224,
                3244
            ],
            [
                3244,
                3260
            ],
            [
                3288,
                3314
            ],
            [
                3319,
                3440
            ],
            [
                3574,
                3590
            ],
            [
                3566,
                3573
            ],
            [
                3559,
                3561
            ],
            [
                3594,
                3618
            ],
            [
                3618,
                3627
            ],
            [
                3627,
                3643
            ],
            [
                3675,
                3685
            ],
            [
                3653,
                3658
            ],
            [
                3685,
                3714
            ],
            [
                3714,
                3748
            ],
            [
                3755,
                3794
            ],
            [
                3794,
                3862
            ],
            [
                3862,
                3892
            ],
            [
                3913,
                3945
            ],
            [
                3945,
                3955
            ],
            [
                3955,
                3974
            ],
            [
                3974,
                4004
            ],
            [
                4004,
                4018
            ],
            [
                4020,
                4038
            ],
            [
                4044,
                4047
            ],
            [
                4047,
                4049
            ],
            [
                4059,
                4120
            ],
            [
                4120,
                4209
            ],
            [
                4209,
                4226
            ],
            [
                4226,
                4247
            ],
            [
                4247,
                4258
            ],
            [
                4376,
                4409
            ],
            [
                4450,
                4465
            ],
            [
                4481,
                4484
            ],
            [
                4492,
                4499
            ],
            [
                4466,
                4468
            ],
            [
                4499,
                4501
            ],
            [
                4501,
                4546
            ],
            [
                4558,
                4566
            ],
            [
                4568,
                4612
            ],
            [
                4612,
                4626
            ],
            [
                4656,
                4664
            ],
            [
                4666,
                4670
            ],
            [
                4676,
                4683
            ],
            [
                4694,
                4719
            ],
            [
                4719,
                4720
            ],
            [
                4724,
                4741
            ],
            [
                4751,
                4758
            ],
            [
                4784,
                4825
            ],
            [
                4853,
                4854
            ],
            [
                4866,
                4869
            ],
            [
                5020,
                5025
            ],
            [
                5035,
                5041
            ],
            [
                5117,
                5119
            ],
            [
                5119,
                5157
            ],
            [
                5175,
                5206
            ],
            [
                5206,
                5293
            ],
            [
                5293,
                5304
            ],
            [
                5315,
                5349
            ],
            [
                5349,
                5353
            ],
            [
                5364,
                5380
            ],
            [
                5354,
                5363
            ],
            [
                5389,
                5406
            ],
            [
                5406,
                5438
            ],
            [
                5463,
                5465
            ],
            [
                5445,
                5452
            ],
            [
                5470,
                5474
            ],
            [
                5476,
                5522
            ],
            [
                5522,
                5553
            ],
            [
                5553,
                5578
            ],
            [
                5609,
                5664
            ],
            [
                5691,
                5693
            ],
            [
                5693,
                5715
            ],
            [
                5752,
                5780
            ],
            [
                5780,
                5836
            ],
            [
                5836,
                5843
            ],
            [
                5853,
                5867
            ],
            [
                5867,
                5924
            ],
            [
                5926,
                5937
            ],
            [
                5965,
                5967
            ],
            [
                5967,
                6038
            ],
            [
                6038,
                6120
            ],
            [
                6120,
                6176
            ],
            [
                6190,
                6334
            ],
            [
                6340,
                6347
            ],
            [
                6358,
                6360
            ],
            [
                6380,
                6381
            ],
            [
                6659,
                6725
            ],
            [
                6736,
                6762
            ],
            [
                6762,
                6812
            ],
            [
                6813,
                6855
            ],
            [
                6889,
                6946
            ],
            [
                6962,
                7018
            ],
            [
                7038,
                7109
            ],
            [
                7109,
                7123
            ],
            [
                7183,
                7192
            ],
            [
                7137,
                7157
            ],
            [
                7255,
                7261
            ],
            [
                7200,
                7234
            ],
            [
                7261,
                7326
            ],
            [
                7327,
                7349
            ],
            [
                7355,
                7387
            ],
            [
                7399,
                7434
            ],
            [
                7437,
                7529
            ],
            [
                7618,
                7622
            ],
            [
                7574,
                7610
            ],
            [
                7612,
                7617
            ],
            [
                7689,
                7701
            ],
            [
                7808,
                7810
            ],
            [
                7810,
                7853
            ],
            [
                7875,
                7880
            ],
            [
                7927,
                7932
            ],
            [
                7886,
                7889
            ],
            [
                7932,
                7934
            ],
            [
                7934,
                8101
            ],
            [
                8101,
                8104
            ],
            [
                8170,
                8186
            ],
            [
                8120,
                8132
            ],
            [
                8208,
                8231
            ],
            [
                8232,
                8288
            ],
            [
                8288,
                8297
            ],
            [
                8312,
                8314
            ],
            [
                8492,
                8497
            ],
            [
                8459,
                8461
            ],
            [
                8524,
                8558
            ],
            [
                8558,
                8609
            ],
            [
                8625,
                8702
            ],
            [
                8720,
                8773
            ],
            [
                8786,
                8852
            ],
            [
                8933,
                8991
            ],
            [
                8991,
                9046
            ],
            [
                9053,
                9055
            ],
            [
                9055,
                9065
            ],
            [
                9077,
                9156
            ],
            [
                9405,
                9410
            ],
            [
                9421,
                9438
            ],
            [
                9440,
                9531
            ],
            [
                9543,
                9619
            ],
            [
                9627,
                9670
            ],
            [
                9671,
                9679
            ],
            [
                9682,
                9701
            ],
            [
                9717,
                9719
            ],
            [
                9719,
                9817
            ],
            [
                9817,
                9870
            ],
            [
                9884,
                9886
            ],
            [
                9886,
                9889
            ],
            [
                9899,
                9903
            ],
            [
                9912,
                9968
            ],
            [
                9969,
                9974
            ],
            [
                9984,
                10044
            ],
            [
                10049,
                10061
            ],
            [
                10116,
                10118
            ],
            [
                10151,
                10166
            ],
            [
                10222,
                10234
            ],
            [
                10311,
                10312
            ],
            [
                10373,
                10388
            ],
            [
                10393,
                10401
            ],
            [
                10420,
                10489
            ],
            [
                10553,
                10570
            ],
            [
                10580,
                10614
            ],
            [
                10619,
                10694
            ],
            [
                10758,
                10761
            ],
            [
                10715,
                10720
            ],
            [
                10817,
                10827
            ],
            [
                10836,
                10848
            ],
            [
                10864,
                10866
            ],
            [
                10806,
                10809
            ],
            [
                10912,
                10914
            ],
            [
                10927,
                10928
            ],
            [
                10929,
                10965
            ],
            [
                10973,
                10975
            ],
            [
                10984,
                11001
            ],
            [
                11138,
                11140
            ],
            [
                11191,
                11194
            ],
            [
                11232,
                11238
            ],
            [
                11175,
                11184
            ],
            [
                11324,
                11326
            ],
            [
                11361,
                11378
            ],
            [
                11446,
                11449
            ],
            [
                11382,
                11392
            ],
            [
                11492,
                11494
            ],
            [
                11494,
                11537
            ],
            [
                11544,
                11547
            ],
            [
                11547,
                11571
            ],
            [
                11576,
                11579
            ],
            [
                11589,
                11596
            ],
            [
                11572,
                11575
            ],
            [
                11596,
                11598
            ],
            [
                11672,
                11688
            ],
            [
                11746,
                11757
            ],
            [
                11767,
                11769
            ],
            [
                11856,
                11867
            ],
            [
                11867,
                11882
            ],
            [
                11882,
                11908
            ],
            [
                11908,
                11913
            ],
            [
                12022,
                12023
            ],
            [
                11931,
                11939
            ],
            [
                11916,
                11918
            ],
            [
                11950,
                11958
            ],
            [
                11969,
                12022
            ],
            [
                12083,
                12085
            ],
            [
                12228,
                12234
            ],
            [
                12243,
                12285
            ],
            [
                12292,
                12294
            ],
            [
                12294,
                12319
            ],
            [
                12391,
                12393
            ],
            [
                12393,
                12421
            ],
            [
                12421,
                12449
            ],
            [
                12449,
                12476
            ],
            [
                12668,
                12749
            ],
            [
                12762,
                12766
            ],
            [
                12768,
                12808
            ],
            [
                12811,
                12841
            ],
            [
                12841,
                12844
            ],
            [
                12852,
                12867
            ],
            [
                13064,
                13194
            ],
            [
                13194,
                13199
            ],
            [
                13207,
                13235
            ],
            [
                13241,
                13244
            ],
            [
                13248,
                13267
            ],
            [
                13267,
                13329
            ],
            [
                13515,
                13581
            ],
            [
                13581,
                13660
            ],
            [
                13660,
                13707
            ],
            [
                14326,
                14407
            ],
            [
                14453,
                14468
            ],
            [
                14471,
                14497
            ],
            [
                14499,
                14507
            ],
            [
                14537,
                14541
            ],
            [
                14544,
                14564
            ],
            [
                14565,
                14580
            ],
            [
                14704,
                14707
            ],
            [
                14649,
                14652
            ],
            [
                14658,
                14676
            ],
            [
                14713,
                14746
            ],
            [
                14680,
                14681
            ],
            [
                14754,
                14757
            ],
            [
                14788,
                14842
            ],
            [
                15067,
                15069
            ],
            [
                15131,
                15188
            ],
            [
                15197,
                15209
            ],
            [
                15190,
                15195
            ],
            [
                15210,
                15231
            ],
            [
                15231,
                15287
            ],
            [
                15289,
                15299
            ],
            [
                15306,
                15327
            ],
            [
                15339,
                15378
            ],
            [
                15384,
                15428
            ],
            [
                15448,
                15452
            ],
            [
                15458,
                15467
            ],
            [
                15521,
                15522
            ],
            [
                15523,
                15601
            ],
            [
                15601,
                15631
            ],
            [
                15663,
                15665
            ],
            [
                15665,
                15720
            ],
            [
                15765,
                15783
            ],
            [
                15786,
                15789
            ],
            [
                15814,
                15855
            ],
            [
                15855,
                15869
            ],
            [
                15875,
                15911
            ],
            [
                15928,
                15931
            ],
            [
                15964,
                16053
            ],
            [
                16053,
                16087
            ],
            [
                16134,
                16137
            ],
            [
                16185,
                16203
            ],
            [
                16203,
                16208
            ],
            [
                16223,
                16244
            ],
            [
                16244,
                16262
            ],
            [
                16298,
                16383
            ],
            [
                16404,
                16406
            ],
            [
                16406,
                16456
            ],
            [
                16555,
                16556
            ],
            [
                16557,
                16622
            ],
            [
                16622,
                16713
            ],
            [
                16716,
                16730
            ],
            [
                16732,
                16735
            ],
            [
                16751,
                16753
            ],
            [
                16757,
                16762
            ],
            [
                16792,
                16812
            ],
            [
                16839,
                16881
            ],
            [
                16881,
                16889
            ],
            [
                16901,
                16933
            ],
            [
                16933,
                16963
            ],
            [
                16969,
                16973
            ],
            [
                17266,
                17293
            ],
            [
                17294,
                17344
            ],
            [
                17351,
                17406
            ],
            [
                17406,
                17414
            ],
            [
                17420,
                17444
            ],
            [
                17444,
                17516
            ],
            [
                17520,
                17562
            ],
            [
                17562,
                17577
            ],
            [
                17577,
                17586
            ],
            [
                17599,
                17606
            ],
            [
                17618,
                17620
            ],
            [
                17620,
                17627
            ],
            [
                17633,
                17657
            ],
            [
                17657,
                17724
            ],
            [
                17798,
                17800
            ],
            [
                17800,
                17846
            ],
            [
                17869,
                17895
            ],
            [
                17895,
                17986
            ],
            [
                18000,
                18056
            ],
            [
                18056,
                18057
            ],
            [
                18073,
                18090
            ],
            [
                18090,
                18103
            ],
            [
                18134,
                18154
            ],
            [
                18156,
                18193
            ],
            [
                18193,
                18232
            ],
            [
                18275,
                18276
            ],
            [
                18284,
                18351
            ],
            [
                18351,
                18399
            ],
            [
                18421,
                18423
            ],
            [
                18423,
                18485
            ],
            [
                18489,
                18529
            ],
            [
                18529,
                18544
            ],
            [
                18544,
                18563
            ],
            [
                18564,
                18623
            ],
            [
                18623,
                18643
            ],
            [
                18652,
                18666
            ],
            [
                18666,
                18676
            ],
            [
                18699,
                18701
            ],
            [
                18701,
                18735
            ],
            [
                18819,
                18820
            ],
            [
                18746,
                18758
            ],
            [
                18764,
                18769
            ],
            [
                18773,
                18783
            ],
            [
                18802,
                18805
            ],
            [
                18829,
                18835
            ],
            [
                18841,
                18874
            ],
            [
                18770,
                18772
            ],
            [
                18914,
                18916
            ],
            [
                18916,
                18946
            ],
            [
                18980,
                19004
            ],
            [
                19029,
                19076
            ],
            [
                19076,
                19084
            ],
            [
                19110,
                19116
            ],
            [
                19125,
                19128
            ],
            [
                19128,
                19129
            ],
            [
                19145,
                19170
            ],
            [
                19170,
                19205
            ],
            [
                19224,
                19278
            ],
            [
                19281,
                19297
            ],
            [
                19297,
                19334
            ],
            [
                19336,
                19339
            ],
            [
                19361,
                19392
            ],
            [
                19399,
                19400
            ],
            [
                19396,
                19398
            ],
            [
                19416,
                19423
            ],
            [
                19427,
                19430
            ],
            [
                19434,
                19436
            ],
            [
                19436,
                19559
            ],
            [
                19559,
                19614
            ],
            [
                19619,
                19637
            ],
            [
                19637,
                19716
            ],
            [
                19745,
                19750
            ],
            [
                19776,
                19778
            ],
            [
                19778,
                19835
            ],
            [
                19835,
                19847
            ],
            [
                19897,
                19898
            ],
            [
                19848,
                19897
            ],
            [
                19995,
                20037
            ],
            [
                19940,
                19944
            ],
            [
                20042,
                20136
            ],
            [
                20136,
                20143
            ],
            [
                20157,
                20213
            ],
            [
                20213,
                20219
            ],
            [
                20246,
                20256
            ],
            [
                20231,
                20245
            ],
            [
                20268,
                20282
            ],
            [
                20299,
                20322
            ],
            [
                20327,
                20329
            ],
            [
                20487,
                20488
            ],
            [
                20602,
                20625
            ],
            [
                20660,
                20715
            ],
            [
                20715,
                20773
            ],
            [
                20786,
                20789
            ],
            [
                20804,
                20813
            ],
            [
                20813,
                20848
            ],
            [
                20848,
                20894
            ],
            [
                20894,
                20895
            ],
            [
                20931,
                20990
            ],
            [
                20991,
                21014
            ],
            [
                21014,
                21028
            ],
            [
                21070,
                21106
            ],
            [
                21106,
                21142
            ],
            [
                21145,
                21181
            ],
            [
                21184,
                21197
            ]
        ],
        "row_chars": [
            [
                0,
                433
            ],
            [
                433,
                635
            ],
            [
                635,
                942
            ],
            [
                942,
                1206
            ],
            [
                1206,
                1364
            ],
            [
                1364,
                1460
            ],
            [
                1460,
                1620
            ],
            [
                1620,
                1820
            ],
            [
                1820,
                2330
            ],
            [
                2330,
                2473
            ],
            [
                2473,
                3062
            ],
            [
                3062,
                3092
            ],
            [
                3092,
                3176
            ],
            [
                3176,
                3244
            ],
            [
                3244,
                3440
            ],
            [
                3440,
                3530
            ],
            [
                3530,
                3618
            ],
            [
                3618,
                3627
            ],
            [
                3627,
                3714
            ],
            [
                3714,
                3794
            ],
            [
                3794,
                3862
            ],
            [
                3862,
                3945
            ],
            [
                3945,
                3955
            ],
            [
                3955,
                3974
            ],
            [
                3974,
                4004
            ],
            [
                4004,
                4047
            ],
            [
                4047,
                4120
            ],
            [
                4120,
                4209
            ],
            [
                4209,
                4226
            ],
            [
                4226,
                4247
            ],
            [
                4247,
                4409
            ],
            [
                4409,
                4450
            ],
            [
                4450,
                4501
            ],
            [
                4501,
                4612
            ],
            [
                4612,
                4719
            ],
            [
                4719,
                4760
            ],
            [
                4760,
                4784
            ],
            [
                4784,
                5119
            ],
            [
                5119,
                5206
            ],
            [
                5206,
                5293
            ],
            [
                5293,
                5349
            ],
            [
                5349,
                5406
            ],
            [
                5406,
                5522
            ],
            [
                5522,
                5553
            ],
            [
                5553,
                5578
            ],
            [
                5578,
                5609
            ],
            [
                5609,
                5693
            ],
            [
                5693,
                5780
            ],
            [
                5780,
                5836
            ],
            [
                5836,
                5867
            ],
            [
                5867,
                5967
            ],
            [
                5967,
                6038
            ],
            [
                6038,
                6120
            ],
            [
                6120,
                6382
            ],
            [
                6382,
                6563
            ],
            [
                6563,
                6659
            ],
            [
                6659,
                6762
            ],
            [
                6762,
                6813
            ],
            [
                6813,
                6946
            ],
            [
                6946,
                7109
            ],
            [
                7109,
                7327
            ],
            [
                7327,
                7810
            ],
            [
                7810,
                7934
            ],
            [
                7934,
                8101
            ],
            [
                8101,
                8232
            ],
            [
                8232,
                8288
            ],
            [
                8288,
                8314
            ],
            [
                8314,
                8424
            ],
            [
                8424,
                8558
            ],
            [
                8558,
                8852
            ],
            [
                8852,
                8933
            ],
            [
                8933,
                8991
            ],
            [
                8991,
                9055
            ],
            [
                9055,
                9157
            ],
            [
                9157,
                9341
            ],
            [
                9341,
                9405
            ],
            [
                9405,
                9671
            ],
            [
                9671,
                9719
            ],
            [
                9719,
                9817
            ],
            [
                9817,
                9886
            ],
            [
                9886,
                9969
            ],
            [
                9969,
                10118
            ],
            [
                10118,
                10489
            ],
            [
                10489,
                10694
            ],
            [
                10694,
                10929
            ],
            [
                10929,
                11140
            ],
            [
                11140,
                11494
            ],
            [
                11494,
                11547
            ],
            [
                11547,
                11598
            ],
            [
                11598,
                11672
            ],
            [
                11672,
                11746
            ],
            [
                11746,
                11769
            ],
            [
                11769,
                11845
            ],
            [
                11845,
                11867
            ],
            [
                11867,
                11882
            ],
            [
                11882,
                11908
            ],
            [
                11908,
                12085
            ],
            [
                12085,
                12161
            ],
            [
                12161,
                12227
            ],
            [
                12227,
                12294
            ],
            [
                12294,
                12393
            ],
            [
                12393,
                12421
            ],
            [
                12421,
                12449
            ],
            [
                12449,
                12476
            ],
            [
                12476,
                12583
            ],
            [
                12583,
                12633
            ],
            [
                12633,
                12668
            ],
            [
                12668,
                12841
            ],
            [
                12841,
                12870
            ],
            [
                12870,
                12950
            ],
            [
                12950,
                13064
            ],
            [
                13064,
                13194
            ],
            [
                13194,
                13267
            ],
            [
                13267,
                13332
            ],
            [
                13332,
                13353
            ],
            [
                13353,
                13515
            ],
            [
                13515,
                13581
            ],
            [
                13581,
                13660
            ],
            [
                13660,
                13707
            ],
            [
                13707,
                13829
            ],
            [
                13829,
                14000
            ],
            [
                14000,
                14066
            ],
            [
                14066,
                14110
            ],
            [
                14110,
                14195
            ],
            [
                14195,
                14226
            ],
            [
                14226,
                14326
            ],
            [
                14326,
                14437
            ],
            [
                14437,
                14452
            ],
            [
                14452,
                14565
            ],
            [
                14565,
                15069
            ],
            [
                15069,
                15131
            ],
            [
                15131,
                15231
            ],
            [
                15231,
                15523
            ],
            [
                15523,
                15601
            ],
            [
                15601,
                15665
            ],
            [
                15665,
                15720
            ],
            [
                15720,
                15765
            ],
            [
                15765,
                15855
            ],
            [
                15855,
                16053
            ],
            [
                16053,
                16203
            ],
            [
                16203,
                16244
            ],
            [
                16244,
                16406
            ],
            [
                16406,
                16557
            ],
            [
                16557,
                16622
            ],
            [
                16622,
                16716
            ],
            [
                16716,
                16753
            ],
            [
                16753,
                16814
            ],
            [
                16814,
                16839
            ],
            [
                16839,
                16881
            ],
            [
                16881,
                16933
            ],
            [
                16933,
                16983
            ],
            [
                16983,
                17010
            ],
            [
                17010,
                17033
            ],
            [
                17033,
                17068
            ],
            [
                17068,
                17151
            ],
            [
                17151,
                17214
            ],
            [
                17214,
                17266
            ],
            [
                17266,
                17406
            ],
            [
                17406,
                17444
            ],
            [
                17444,
                17520
            ],
            [
                17520,
                17562
            ],
            [
                17562,
                17577
            ],
            [
                17577,
                17620
            ],
            [
                17620,
                17657
            ],
            [
                17657,
                17800
            ],
            [
                17800,
                17895
            ],
            [
                17895,
                18056
            ],
            [
                18056,
                18090
            ],
            [
                18090,
                18193
            ],
            [
                18193,
                18232
            ],
            [
                18232,
                18254
            ],
            [
                18254,
                18351
            ],
            [
                18351,
                18423
            ],
            [
                18423,
                18489
            ],
            [
                18489,
                18529
            ],
            [
                18529,
                18544
            ],
            [
                18544,
                18623
            ],
            [
                18623,
                18666
            ],
            [
                18666,
                18701
            ],
            [
                18701,
                18916
            ],
            [
                18916,
                19076
            ],
            [
                19076,
                19128
            ],
            [
                19128,
                19170
            ],
            [
                19170,
                19297
            ],
            [
                19297,
                19392
            ],
            [
                19392,
                19436
            ],
            [
                19436,
                19559
            ],
            [
                19559,
                19637
            ],
            [
                19637,
                19778
            ],
            [
                19778,
                19835
            ],
            [
                19835,
                20136
            ],
            [
                20136,
                20213
            ],
            [
                20213,
                20268
            ],
            [
                20268,
                20329
            ],
            [
                20329,
                20417
            ],
            [
                20417,
                20480
            ],
            [
                20480,
                20642
            ],
            [
                20642,
                20660
            ],
            [
                20660,
                20715
            ],
            [
                20715,
                20813
            ],
            [
                20813,
                20848
            ],
            [
                20848,
                20894
            ],
            [
                20894,
                21014
            ],
            [
                21014,
                21106
            ],
            [
                21106,
                21198
            ],
            [
                21198,
                21307
            ]
        ]
    },
    "abridged": {
        "text": "Lady Macleod lived at No. 3, Paramount Crescent, in Cheltenham, where she occupied a very handsome first-floor drawing-room, with a bedroom behind it overlooking the stable-yard, and a small dining-room. The stable-yard was not attractive; but it lowered the rent. Lady Macleod's income, though small, would have sufficed for her to live without such discomforts; but she thought it her duty to leave some money behind to be inherited. So she inhaled the scent of the stables, and squabbled with the cabmen, in order that she might bequeath a thousand pounds or two to some Lady Midlothian, who would hardly thank her memory for the money.\nThe saving, however, was postponed whenever Alice visited Cheltenham; and a bedroom was secured for her which did not look out over the stables. Lady Macleod was a hospitable, good old woman, painfully struggling to do the best she could in the world. It was a pity that she was such a bore, a pity that she suspected all tradesmen, servants, cabmen and people of an inferior rank generally - and a pity that while she was so suspicious of the poor she was so lenient to the vices of the high-born.\nAlice had thought it prudent to tell Lady Macleod by letter about Mr. Grey. This had seemed preferable to telling her face to face; some of Lady Macleod's bitterness of rebuke would have passed away before Alice's arrival.\nBut Alice trembled as the cab drew up at Paramount Crescent. She met her aunt at the drawing-room door, and saw at once that if any bitterness had passed away from that face, the original bitterness must indeed have been bitter. Anger and sorrow were mingled in those austere features.\n\"Alice!\" she said, as she kissed her niece; \"oh, Alice, what is this?\"\n\"Yes, aunt; it is very bad, I know.\" Poor Alice tried to make a jest of it. \"Young ladies are very wicked when they don't know their own minds. But if they haven't known them, what can they do but repent?\"\n\"Repent!\" said Lady Macleod. \"Yes; I hope you will repent. Poor Mr. Grey; what must he think?\"\n\"I hope, aunt, that he won't think of it at all for very long.\"\n\"That's nonsense, my dear, Of course he'll think of it, and of course you'll marry him.\"\n\"Shall I, aunt?\"\n\"Of course you will. Why, Alice, is not your word pledged to him? I don't see how you can go back on it. Gentlemen when they do that kind of thing are expelled from society; but I really think it is worse in a woman.\"\n\"Then they may expel from society; only I don't think I'm particularly in it.\"\n\"The wickedness of it, Alice!\"\n\"When you talk to me about society, aunt, I let you,\" answered Alice boldly. \"But when you tell me about wickedness, then I must be my own judge. It is my conscience, and the fear of committing wickedness, that has made me do this.\"\n\"You should be guided by your elders, Alice.\"\n\"No; in such a matter my elders cannot teach me. It cannot be right that I should be a man's wife if I do not think that I can make him happy.\"\n\"Then why did you accept him?\"\n\"Because I was mistaken. If you choose to scold me for that, you may do so, aunt. But as to marrying him, I must judge for myself.\"\n\"It was a pity you did not know your own mind earlier.\"\n\"It was a great pity. I have done myself an injury that is quite irretrievable; I know that. I have done him, too, an injustice which I regret with my whole heart. I can only excuse myself by saying that I might have done him a worse injustice.\"\nAll this was said at the very moment of her arrival, and did not seem to promise much for the happiness of the next month; but perhaps it was better for them both that the attack and the defence should be made at once.\n\"Well, my dear,\" said her ladyship, \"I suppose you will like to go upstairs and take off your bonnet. Mary shall bring you some tea when you come down.\"\nSo Alice escaped, and when she returned to the drawing-room, the fury of the storm had passed away. They talked of other things till dinner; and though Lady Macleod did make one allusion to \"poor Mr. Grey,\" the subject was allowed to drop. Alice was very attentive in asking about her aunt's ailments, and listening to her long list of Cheltenham iniquities, and refrained from combating any of her aunt's religious views.\nAfter a while they got onto the subject of Aunt Greenow, for whom Lady Macleod had a special aversion - as indeed she had for all the Vavasor side of Alice's family; and then Alice offered to read from one of those terrible books of wrathful sermons which Lady Macleod took much pleasure in.\nLady Macleod no doubt did enjoy her niece's stay, but Alice did not. On the second day nothing was said about Mr. Grey, and Alice hoped that by her continual readings in the book of wrath her aunt's heart might be softened towards her. But on the third day Lady Macleod returned to the attack.\n\"Did John Grey still wish that the match should go on?\" she asked. Alice had to admit that she believed he did wish it. She could hardly say otherwise, seeing that she had a letter from him in her pocket, in which he still spoke of his engagement as binding on him, and expressed a hope that this change to Cheltenham would bring her round and set everything to rights. This letter Alice had resolved that she would not answer. He would probably write again, and she would beg him to stop. Instead of bringing her round, Cheltenham had made her firmer than ever in her resolution.\nAfter ten terrible days devoted to discussions on matrimony in the morning, and to the book of wrath in the evening - relieved by two tea-parties, in which the sins of Cheltenham were discussed at length - Lady Macleod herself got a letter from Mr. Grey.\nMr. Grey sent her his kindest compliments. He believed that Lady Macleod was aware of the circumstances of his engagement with Miss Vavasor. Might he call on Miss Vavasor at Lady Macleod's house? and also have the pleasure of making Lady Macleod's acquaintance?\nAlice was in the room when her aunt received this letter, but her aunt said nothing. After breakfast Lady Macleod privately wrote a reply to Nethercoats, informing Mr. Grey that he would be received in Paramount Crescent with great pleasure.\nOn the morning of his visit Lady Macleod had presided over the teacups in a state of nervous excitement which was quite visible to Alice. She asked about her aunt's restlessness without suspecting it had anything to do with her.\n\"There's nothing the matter, my dear,\" Lady Macleod said. She waited until after breakfast to pull Mr. Grey's letter out of her pocket.\n\"Alice,\" she said, \"I expect a visitor here today.\"\nAlice knew instantly who the visitor was. \"A visitor, aunt?\"\n\"Yes, Alice. Mr. Grey.\"\n\"Indeed, aunt! Is he coming to see you?\"\n\"Well, no doubt he wants to see you more; but he has expressed a wish to make my acquaintance. I have his letter here, and you can see it if you wish. It is very nicely written. And now comes the question. What are we to do with him? Am I to ask him to dinner? I should be most happy to entertain him, though you know how very scanty my means are; but I really do not know how it might be - between you and him, I mean.\"\n\"We would not fight, aunt. I shall always regard him as a dearly loved friend; though for many years, no doubt, I shall be unable to express my friendship.\"\n\"That is all very well, Alice, but it is not what he will want. I think upon the whole that I had better not ask him to dinner. I think there might be some awkwardness if he were to dine here.\"\n\"I really think there would,\" said Alice, anxious to have the subject dropped.\n\"I hope he won't think that I am inhospitable. I dare say he'll want to see you alone, and therefore I'll retire to my own rooms. But if you wish, I will receive him first, and then the maid can fetch you down.\" Although this discussion was not pleasant to Alice, she felt grateful to Lady Macleod, who was attempting to make Mr. Grey's visit as little painful as possible.\nAt three o'clock Mr. Grey was announced, and Lady Macleod received him alone in her drawing-room. She had intended to give him a great deal of good advice: to bid him keep up his heart and hold up his head, to confess to him how badly Alice was behaving, and to express her agreement with his theory of illness.\nBut she found that Mr. Grey was a man to whom she could not give much advice. It was he who did the speaking. She was overawed by him after the first three minutes. He was so handsome - and had so quiet and almost saddened an air! Strange to say, after she had seen him, Lady Macleod admired him much more than before, and yet she was less surprised than she had been at Alice's refusal of him. The conference was very short; and after fifteen minutes the maid went to Alice with her summons.\nAlice came down instantly. She found Mr. Grey waiting to receive her, and the look of majesty which had cowed Lady Macleod had gone. He could not have received her with a kinder smile.\n\"At any rate it does not make him unhappy,\" she said to herself.\n\"You are not angry,\" he said, \"that I should have followed you all the way here, to see you?\"\n\"No, certainly not. Any anger must be on your side.\"\n\"Then there shall be none on either side. Whatever happens, I will not be angry with you. Your father advised me to come here. I believe that according to the rule in such matters I should not have come to you, but I don't know that I care much about such rules.\"\n\"It is I who have broken all rules.\"\n\"When a lady tells a gentleman that she does not wish to see more of him-\"\n\"Oh, Mr. Grey, I have not told you that.\"\n\"Have you not? I am glad to hear that. But you understand what I mean. When a gentleman gets his dismissal from a lady he should accept it. But I cannot lay down my love in that way; nor can I give up the battle. It seems to me that I have a right at any rate to know something of your comings and goings - unless, Alice, you should take another name than mine.\"\n\"I intend to keep my own.\" This she said almost in a whisper, with her eyes fixed upon the ground.\n\"And you will not deny me that right?\"\n\"I have sinned so against you that I can have no right to blame you.\"\n\"There shall be no question between us of injury. In any conversation that we may have, or in any correspondence-\"\n\"Oh, Mr. Grey, do not ask me to write.\"\n\"Listen to me. Should there be any communication on either side, there shall be no idea of any wrong done.\"\n\"But I have done you great wrong.\"\n\"No, Alice. When I asked you to accept my hand - begging the greatest gift which I could ever ask for - I knew how great was your goodness to me in accepting it. Now that you refuse it, I know that in doing so you are thinking more of my welfare than of your own.\"\n\"Oh yes, indeed.\"\n\"Then how can I talk of wrong? That you are wrong in your thinking - that your mind has become twisted by false impressions - that I believe. But I cannot therefore love you less, nor consider myself to be injured. I am more selfish than you. I think if you were my wife that I could make you happy; but I feel sure that my happiness depends on your being my wife.\"\nShe looked up into his face, but it was still serene in its manly beauty. Her cousin George, if he were moved to strong feeling, showed it at once in his whole expression. He glared in his anger, and was impassioned in his love. But Mr. Grey, when speaking of the happiness of his entire life, spoke without a quiver in his voice, and with no more sign of passion in his face than if he were telling his gardener to move a rose tree.\n\"I hope that you will find your happiness elsewhere, Mr. Grey.\"\n\"Well; in that we differ, Alice. And now I will explain why I have come. I cannot accept your decision as final. I come simply to tell you that I am still your suitor. If you will let me, I will see you again early in January, when you return to town. You will hardly refuse to see me.\"\n\"No,\" she said; \"I cannot refuse to see you.\"\n\"Meanwhile I will not trouble you with letters, nor will I trouble you any longer now with words. Tell your aunt that I give her my kindest thanks.\" Then he took her hand and pressed it - not as George Vavasor had pressed it - and was gone.",
        "paragraph_chars": [
            [
                0,
                640
            ],
            [
                640,
                1139
            ],
            [
                1139,
                1362
            ],
            [
                1362,
                1648
            ],
            [
                1648,
                1719
            ],
            [
                1719,
                1925
            ],
            [
                1925,
                2020
            ],
            [
                2020,
                2084
            ],
            [
                2084,
                2173
            ],
            [
                2173,
                2190
            ],
            [
                2190,
                2408
            ],
            [
                2408,
                2487
            ],
            [
                2487,
                2518
            ],
            [
                2518,
                2751
            ],
            [
                2751,
                2797
            ],
            [
                2797,
                2941
            ],
            [
                2941,
                2972
            ],
            [
                2972,
                3104
            ],
            [
                3104,
                3160
            ],
            [
                3160,
                3406
            ],
            [
                3406,
                3625
            ],
            [
                3625,
                3778
            ],
            [
                3778,
                4201
            ],
            [
                4201,
                4493
            ],
            [
                4493,
                4787
            ],
            [
                4787,
                5368
            ],
            [
                5368,
                5623
            ],
            [
                5623,
                5885
            ],
            [
                5885,
                6127
            ],
            [
                6127,
                6356
            ],
            [
                6356,
                6492
            ],
            [
                6492,
                6544
            ],
            [
                6544,
                6605
            ],
            [
                6605,
                6629
            ],
            [
                6629,
                6670
            ],
            [
                6670,
                7091
            ],
            [
                7091,
                7248
            ],
            [
                7248,
                7442
            ],
            [
                7442,
                7521
            ],
            [
                7521,
                7895
            ],
            [
                7895,
                8207
            ],
            [
                8207,
                8700
            ],
            [
                8700,
                8885
            ],
            [
                8885,
                8950
            ],
            [
                8950,
                9044
            ],
            [
                9044,
                9097
            ],
            [
                9097,
                9361
            ],
            [
                9361,
                9398
            ],
            [
                9398,
                9473
            ],
            [
                9473,
                9515
            ],
            [
                9515,
                9878
            ],
            [
                9878,
                9977
            ],
            [
                9977,
                10016
            ],
            [
                10016,
                10086
            ],
            [
                10086,
                10201
            ],
            [
                10201,
                10241
            ],
            [
                10241,
                10349
            ],
            [
                10349,
                10384
            ],
            [
                10384,
                10649
            ],
            [
                10649,
                10667
            ],
            [
                10667,
                11033
            ],
            [
                11033,
                11467
            ],
            [
                11467,
                11531
            ],
            [
                11531,
                11818
            ],
            [
                11818,
                11864
            ],
            [
                11864,
                12104
            ]
        ],
        "segment_chars": [
            [
                0,
                204
            ],
            [
                204,
                265
            ],
            [
                265,
                436
            ],
            [
                436,
                640
            ],
            [
                640,
                785
            ],
            [
                785,
                892
            ],
            [
                892,
                1139
            ],
            [
                1139,
                1215
            ],
            [
                1215,
                1362
            ],
            [
                1362,
                1423
            ],
            [
                1423,
                1591
            ],
            [
                1591,
                1648
            ],
            [
                1648,
                1657
            ],
            [
                1657,
                1719
            ],
            [
                1719,
                1756
            ],
            [
                1756,
                1795
            ],
            [
                1795,
                1863
            ],
            [
                1863,
                1925
            ],
            [
                1925,
                1935
            ],
            [
                1935,
                1954
            ],
            [
                1954,
                1984
            ],
            [
                1984,
                2020
            ],
            [
                2020,
                2084
            ],
            [
                2084,
                2173
            ],
            [
                2173,
                2190
            ],
            [
                2190,
                2211
            ],
            [
                2211,
                2256
            ],
            [
                2256,
                2295
            ],
            [
                2295,
                2408
            ],
            [
                2408,
                2487
            ],
            [
                2487,
                2518
            ],
            [
                2518,
                2595
            ],
            [
                2595,
                2664
            ],
            [
                2664,
                2751
            ],
            [
                2751,
                2797
            ],
            [
                2797,
                2846
            ],
            [
                2846,
                2941
            ],
            [
                2941,
                2972
            ],
            [
                2972,
                2997
            ],
            [
                2997,
                3054
            ],
            [
                3054,
                3104
            ],
            [
                3104,
                3160
            ],
            [
                3160,
                3182
            ],
            [
                3182,
                3253
            ],
            [
                3253,
                3324
            ],
            [
                3324,
                3406
            ],
            [
                3406,
                3625
            ],
            [
                3625,
                3727
            ],
            [
                3727,
                3778
            ],
            [
                3778,
                3878
            ],
            [
                3878,
                4018
            ],
            [
                4018,
                4201
            ],
            [
                4201,
                4493
            ],
            [
                4493,
                4562
            ],
            [
                4562,
                4729
            ],
            [
                4729,
                4787
            ],
            [
                4787,
                4843
            ],
            [
                4843,
                4854
            ],
            [
                4854,
                4907
            ],
            [
                4907,
                5157
            ],
            [
                5157,
                5215
            ],
            [
                5215,
                5277
            ],
            [
                5277,
                5368
            ],
            [
                5368,
                5623
            ],
            [
                5623,
                5666
            ],
            [
                5666,
                5764
            ],
            [
                5764,
                5819
            ],
            [
                5819,
                5885
            ],
            [
                5885,
                5970
            ],
            [
                5970,
                6127
            ],
            [
                6127,
                6265
            ],
            [
                6265,
                6356
            ],
            [
                6356,
                6414
            ],
            [
                6414,
                6492
            ],
            [
                6492,
                6544
            ],
            [
                6544,
                6586
            ],
            [
                6586,
                6605
            ],
            [
                6605,
                6618
            ],
            [
                6618,
                6629
            ],
            [
                6629,
                6644
            ],
            [
                6644,
                6670
            ],
            [
                6670,
                6765
            ],
            [
                6765,
                6821
            ],
            [
                6821,
                6848
            ],
            [
                6848,
                6876
            ],
            [
                6876,
                6904
            ],
            [
                6904,
                6931
            ],
            [
                6931,
                7091
            ],
            [
                7091,
                7118
            ],
            [
                7118,
                7248
            ],
            [
                7248,
                7312
            ],
            [
                7312,
                7376
            ],
            [
                7376,
                7442
            ],
            [
                7442,
                7521
            ],
            [
                7521,
                7568
            ],
            [
                7568,
                7651
            ],
            [
                7651,
                7733
            ],
            [
                7733,
                7895
            ],
            [
                7895,
                7993
            ],
            [
                7993,
                8207
            ],
            [
                8207,
                8285
            ],
            [
                8285,
                8317
            ],
            [
                8317,
                8372
            ],
            [
                8372,
                8438
            ],
            [
                8438,
                8602
            ],
            [
                8602,
                8700
            ],
            [
                8700,
                8727
            ],
            [
                8727,
                8833
            ],
            [
                8833,
                8885
            ],
            [
                8885,
                8950
            ],
            [
                8950,
                9044
            ],
            [
                9044,
                9064
            ],
            [
                9064,
                9097
            ],
            [
                9097,
                9139
            ],
            [
                9139,
                9187
            ],
            [
                9187,
                9224
            ],
            [
                9224,
                9361
            ],
            [
                9361,
                9398
            ],
            [
                9398,
                9473
            ],
            [
                9473,
                9515
            ],
            [
                9515,
                9530
            ],
            [
                9530,
                9554
            ],
            [
                9554,
                9586
            ],
            [
                9586,
                9655
            ],
            [
                9655,
                9728
            ],
            [
                9728,
                9878
            ],
            [
                9878,
                9905
            ],
            [
                9905,
                9977
            ],
            [
                9977,
                10016
            ],
            [
                10016,
                10086
            ],
            [
                10086,
                10136
            ],
            [
                10136,
                10201
            ],
            [
                10201,
                10241
            ],
            [
                10241,
                10256
            ],
            [
                10256,
                10349
            ],
            [
                10349,
                10384
            ],
            [
                10384,
                10396
            ],
            [
                10396,
                10546
            ],
            [
                10546,
                10649
            ],
            [
                10649,
                10667
            ],
            [
                10667,
                10698
            ],
            [
                10698,
                10809
            ],
            [
                10809,
                10882
            ],
            [
                10882,
                10910
            ],
            [
                10910,
                11033
            ],
            [
                11033,
                11107
            ],
            [
                11107,
                11205
            ],
            [
                11205,
                11262
            ],
            [
                11262,
                11467
            ],
            [
                11467,
                11531
            ],
            [
                11531,
                11564
            ],
            [
                11564,
                11604
            ],
            [
                11604,
                11644
            ],
            [
                11644,
                11699
            ],
            [
                11699,
                11783
            ],
            [
                11783,
                11818
            ],
            [
                11818,
                11864
            ],
            [
                11864,
                11962
            ],
            [
                11962,
                12013
            ],
            [
                12013,
                12104
            ]
        ],
        "overlap_chars": [
            [
                0,
                149
            ],
            [
                162,
                165
            ],
            [
                166,
                190
            ],
            [
                191,
                202
            ],
            [
                202,
                204
            ],
            [
                204,
                227
            ],
            [
                238,
                246
            ],
            [
                255,
                263
            ],
            [
                263,
                265
            ],
            [
                270,
                277
            ],
            [
                280,
                321
            ],
            [
                326,
                337
            ],
            [
                346,
                371
            ],
            [
                380,
                382
            ],
            [
                383,
                386
            ],
            [
                387,
                400
            ],
            [
                412,
                418
            ],
            [
                419,
                421
            ],
            [
                422,
                424
            ],
            [
                434,
                436
            ],
            [
                436,
                442
            ],
            [
                443,
                454
            ],
            [
                461,
                594
            ],
            [
                595,
                640
            ],
            [
                640,
                689
            ],
            [
                698,
                785
            ],
            [
                790,
                797
            ],
            [
                798,
                892
            ],
            [
                892,
                947
            ],
            [
                948,
                982
            ],
            [
                983,
                993
            ],
            [
                994,
                1000
            ],
            [
                1001,
                1003
            ],
            [
                1007,
                1015
            ],
            [
                1016,
                1020
            ],
            [
                1021,
                1030
            ],
            [
                1033,
                1043
            ],
            [
                1044,
                1123
            ],
            [
                1137,
                1139
            ],
            [
                1139,
                1144
            ],
            [
                1145,
                1159
            ],
            [
                1160,
                1198
            ],
            [
                1205,
                1215
            ],
            [
                1220,
                1223
            ],
            [
                1242,
                1244
            ],
            [
                1245,
                1252
            ],
            [
                1253,
                1256
            ],
            [
                1257,
                1269
            ],
            [
                1269,
                1270
            ],
            [
                1271,
                1278
            ],
            [
                1279,
                1293
            ],
            [
                1294,
                1304
            ],
            [
                1305,
                1314
            ],
            [
                1315,
                1361
            ],
            [
                1362,
                1402
            ],
            [
                1403,
                1423
            ],
            [
                1423,
                1439
            ],
            [
                1443,
                1469
            ],
            [
                1470,
                1591
            ],
            [
                1591,
                1607
            ],
            [
                1613,
                1620
            ],
            [
                1621,
                1623
            ],
            [
                1624,
                1648
            ],
            [
                1648,
                1657
            ],
            [
                1657,
                1673
            ],
            [
                1674,
                1684
            ],
            [
                1685,
                1690
            ],
            [
                1690,
                1719
            ],
            [
                1719,
                1753
            ],
            [
                1756,
                1795
            ],
            [
                1795,
                1863
            ],
            [
                1863,
                1893
            ],
            [
                1893,
                1925
            ],
            [
                1925,
                1935
            ],
            [
                1935,
                1954
            ],
            [
                1954,
                1984
            ],
            [
                1984,
                1998
            ],
            [
                1999,
                2017
            ],
            [
                2017,
                2020
            ],
            [
                2020,
                2022
            ],
            [
                2023,
                2084
            ],
            [
                2084,
                2173
            ],
            [
                2173,
                2190
            ],
            [
                2190,
                2211
            ],
            [
                2211,
                2222
            ],
            [
                2223,
                2256
            ],
            [
                2256,
                2271
            ],
            [
                2272,
                2275
            ],
            [
                2280,
                2287
            ],
            [
                2291,
                2293
            ],
            [
                2293,
                2295
            ],
            [
                2295,
                2340
            ],
            [
                2355,
                2363
            ],
            [
                2364,
                2408
            ],
            [
                2408,
                2422
            ],
            [
                2434,
                2442
            ],
            [
                2443,
                2447
            ],
            [
                2448,
                2455
            ],
            [
                2462,
                2487
            ],
            [
                2487,
                2488
            ],
            [
                2488,
                2505
            ],
            [
                2508,
                2515
            ],
            [
                2518,
                2559
            ],
            [
                2560,
                2561
            ],
            [
                2566,
                2569
            ],
            [
                2581,
                2586
            ],
            [
                2587,
                2593
            ],
            [
                2593,
                2595
            ],
            [
                2595,
                2633
            ],
            [
                2633,
                2664
            ],
            [
                2664,
                2751
            ],
            [
                2751,
                2762
            ],
            [
                2763,
                2797
            ],
            [
                2797,
                2801
            ],
            [
                2802,
                2818
            ],
            [
                2819,
                2828
            ],
            [
                2829,
                2846
            ],
            [
                2846,
                2878
            ],
            [
                2879,
                2881
            ],
            [
                2882,
                2889
            ],
            [
                2890,
                2894
            ],
            [
                2895,
                2941
            ],
            [
                2941,
                2972
            ],
            [
                2972,
                2997
            ],
            [
                2997,
                3052
            ],
            [
                3052,
                3054
            ],
            [
                3054,
                3076
            ],
            [
                3076,
                3104
            ],
            [
                3104,
                3160
            ],
            [
                3160,
                3167
            ],
            [
                3168,
                3182
            ],
            [
                3182,
                3239
            ],
            [
                3240,
                3251
            ],
            [
                3251,
                3253
            ],
            [
                3253,
                3324
            ],
            [
                3324,
                3406
            ],
            [
                3406,
                3462
            ],
            [
                3463,
                3607
            ],
            [
                3608,
                3615
            ],
            [
                3616,
                3618
            ],
            [
                3623,
                3624
            ],
            [
                3625,
                3691
            ],
            [
                3701,
                3727
            ],
            [
                3727,
                3777
            ],
            [
                3778,
                3820
            ],
            [
                3821,
                3878
            ],
            [
                3890,
                3946
            ],
            [
                3947,
                4018
            ],
            [
                4018,
                4032
            ],
            [
                4033,
                4042
            ],
            [
                4059,
                4079
            ],
            [
                4094,
                4100
            ],
            [
                4101,
                4135
            ],
            [
                4135,
                4200
            ],
            [
                4201,
                4223
            ],
            [
                4229,
                4261
            ],
            [
                4267,
                4302
            ],
            [
                4305,
                4397
            ],
            [
                4398,
                4402
            ],
            [
                4403,
                4439
            ],
            [
                4451,
                4456
            ],
            [
                4457,
                4469
            ],
            [
                4491,
                4493
            ],
            [
                4493,
                4536
            ],
            [
                4541,
                4546
            ],
            [
                4547,
                4552
            ],
            [
                4557,
                4560
            ],
            [
                4560,
                4562
            ],
            [
                4562,
                4729
            ],
            [
                4729,
                4732
            ],
            [
                4733,
                4749
            ],
            [
                4750,
                4762
            ],
            [
                4763,
                4786
            ],
            [
                4787,
                4843
            ],
            [
                4843,
                4852
            ],
            [
                4852,
                4854
            ],
            [
                4854,
                4859
            ],
            [
                4864,
                4866
            ],
            [
                4873,
                4907
            ],
            [
                4907,
                4958
            ],
            [
                4959,
                5036
            ],
            [
                5037,
                5090
            ],
            [
                5091,
                5157
            ],
            [
                5157,
                5215
            ],
            [
                5215,
                5270
            ],
            [
                5275,
                5277
            ],
            [
                5277,
                5287
            ],
            [
                5288,
                5367
            ],
            [
                5368,
                5373
            ],
            [
                5374,
                5391
            ],
            [
                5392,
                5483
            ],
            [
                5495,
                5571
            ],
            [
                5579,
                5622
            ],
            [
                5623,
                5631
            ],
            [
                5645,
                5664
            ],
            [
                5664,
                5666
            ],
            [
                5666,
                5764
            ],
            [
                5764,
                5817
            ],
            [
                5817,
                5819
            ],
            [
                5819,
                5822
            ],
            [
                5823,
                5827
            ],
            [
                5828,
                5884
            ],
            [
                5885,
                5890
            ],
            [
                5895,
                5955
            ],
            [
                5956,
                5968
            ],
            [
                5968,
                5970
            ],
            [
                5970,
                5985
            ],
            [
                5986,
                5998
            ],
            [
                6015,
                6016
            ],
            [
                6023,
                6038
            ],
            [
                6049,
                6057
            ],
            [
                6058,
                6127
            ],
            [
                6127,
                6144
            ],
            [
                6155,
                6189
            ],
            [
                6190,
                6265
            ],
            [
                6265,
                6268
            ],
            [
                6269,
                6274
            ],
            [
                6281,
                6291
            ],
            [
                6292,
                6304
            ],
            [
                6324,
                6326
            ],
            [
                6327,
                6330
            ],
            [
                6340,
                6342
            ],
            [
                6354,
                6355
            ],
            [
                6356,
                6392
            ],
            [
                6392,
                6394
            ],
            [
                6395,
                6412
            ],
            [
                6412,
                6414
            ],
            [
                6414,
                6417
            ],
            [
                6418,
                6424
            ],
            [
                6437,
                6446
            ],
            [
                6447,
                6449
            ],
            [
                6455,
                6472
            ],
            [
                6473,
                6476
            ],
            [
                6480,
                6490
            ],
            [
                6490,
                6492
            ],
            [
                6492,
                6535
            ],
            [
                6541,
                6544
            ],
            [
                6544,
                6568
            ],
            [
                6569,
                6572
            ],
            [
                6573,
                6580
            ],
            [
                6581,
                6584
            ],
            [
                6584,
                6586
            ],
            [
                6586,
                6602
            ],
            [
                6605,
                6616
            ],
            [
                6616,
                6618
            ],
            [
                6618,
                6629
            ],
            [
                6629,
                6644
            ],
            [
                6644,
                6670
            ],
            [
                6670,
                6675
            ],
            [
                6675,
                6676
            ],
            [
                6677,
                6685
            ],
            [
                6686,
                6688
            ],
            [
                6702,
                6710
            ],
            [
                6710,
                6763
            ],
            [
                6763,
                6765
            ],
            [
                6765,
                6771
            ],
            [
                6772,
                6814
            ],
            [
                6819,
                6821
            ],
            [
                6821,
                6846
            ],
            [
                6846,
                6848
            ],
            [
                6848,
                6876
            ],
            [
                6876,
                6904
            ],
            [
                6904,
                6931
            ],
            [
                6931,
                7012
            ],
            [
                7013,
                7017
            ],
            [
                7018,
                7058
            ],
            [
                7061,
                7091
            ],
            [
                7091,
                7094
            ],
            [
                7101,
                7116
            ],
            [
                7118,
                7248
            ],
            [
                7248,
                7253
            ],
            [
                7257,
                7285
            ],
            [
                7289,
                7292
            ],
            [
                7293,
                7312
            ],
            [
                7312,
                7374
            ],
            [
                7376,
                7442
            ],
            [
                7442,
                7521
            ],
            [
                7521,
                7568
            ],
            [
                7568,
                7649
            ],
            [
                7651,
                7666
            ],
            [
                7666,
                7692
            ],
            [
                7694,
                7702
            ],
            [
                7707,
                7711
            ],
            [
                7712,
                7732
            ],
            [
                7742,
                7757
            ],
            [
                7758,
                7761
            ],
            [
                7762,
                7765
            ],
            [
                7766,
                7784
            ],
            [
                7785,
                7818
            ],
            [
                7818,
                7819
            ],
            [
                7824,
                7827
            ],
            [
                7839,
                7893
            ],
            [
                7893,
                7895
            ],
            [
                7895,
                7952
            ],
            [
                7953,
                7965
            ],
            [
                7966,
                7971
            ],
            [
                7972,
                7993
            ],
            [
                7993,
                8049
            ],
            [
                8051,
                8061
            ],
            [
                8062,
                8083
            ],
            [
                8084,
                8123
            ],
            [
                8124,
                8168
            ],
            [
                8179,
                8183
            ],
            [
                8188,
                8197
            ],
            [
                8205,
                8206
            ],
            [
                8207,
                8285
            ],
            [
                8285,
                8315
            ],
            [
                8315,
                8317
            ],
            [
                8317,
                8372
            ],
            [
                8372,
                8390
            ],
            [
                8393,
                8396
            ],
            [
                8397,
                8438
            ],
            [
                8438,
                8452
            ],
            [
                8454,
                8490
            ],
            [
                8499,
                8502
            ],
            [
                8513,
                8602
            ],
            [
                8602,
                8636
            ],
            [
                8659,
                8662
            ],
            [
                8682,
                8700
            ],
            [
                8700,
                8705
            ],
            [
                8706,
                8727
            ],
            [
                8727,
                8745
            ],
            [
                8746,
                8831
            ],
            [
                8831,
                8833
            ],
            [
                8833,
                8883
            ],
            [
                8883,
                8884
            ],
            [
                8885,
                8950
            ],
            [
                8950,
                9041
            ],
            [
                9044,
                9058
            ],
            [
                9059,
                9062
            ],
            [
                9062,
                9064
            ],
            [
                9068,
                9073
            ],
            [
                9074,
                9094
            ],
            [
                9097,
                9139
            ],
            [
                9139,
                9147
            ],
            [
                9155,
                9187
            ],
            [
                9187,
                9217
            ],
            [
                9218,
                9222
            ],
            [
                9224,
                9251
            ],
            [
                9256,
                9306
            ],
            [
                9306,
                9361
            ],
            [
                9361,
                9369
            ],
            [
                9374,
                9398
            ],
            [
                9398,
                9470
            ],
            [
                9473,
                9515
            ],
            [
                9515,
                9530
            ],
            [
                9530,
                9539
            ],
            [
                9540,
                9547
            ],
            [
                9552,
                9554
            ],
            [
                9554,
                9561
            ],
            [
                9562,
                9586
            ],
            [
                9586,
                9653
            ],
            [
                9653,
                9655
            ],
            [
                9655,
                9701
            ],
            [
                9702,
                9728
            ],
            [
                9728,
                9819
            ],
            [
                9822,
                9878
            ],
            [
                9878,
                9879
            ],
            [
                9888,
                9905
            ],
            [
                9905,
                9918
            ],
            [
                9919,
                9939
            ],
            [
                9940,
                9977
            ],
            [
                9977,
                10016
            ],
            [
                10017,
                10018
            ],
            [
                10019,
                10086
            ],
            [
                10086,
                10134
            ],
            [
                10134,
                10136
            ],
            [
                10136,
                10198
            ],
            [
                10201,
                10241
            ],
            [
                10241,
                10256
            ],
            [
                10256,
                10275
            ],
            [
                10290,
                10349
            ],
            [
                10349,
                10369
            ],
            [
                10370,
                10384
            ],
            [
                10384,
                10394
            ],
            [
                10394,
                10396
            ],
            [
                10396,
                10430
            ],
            [
                10431,
                10432
            ],
            [
                10441,
                10453
            ],
            [
                10459,
                10464
            ],
            [
                10467,
                10477
            ],
            [
                10478,
                10481
            ],
            [
                10488,
                10494
            ],
            [
                10495,
                10528
            ],
            [
                10542,
                10544
            ],
            [
                10544,
                10546
            ],
            [
                10546,
                10576
            ],
            [
                10577,
                10601
            ],
            [
                10602,
                10649
            ],
            [
                10649,
                10657
            ],
            [
                10658,
                10664
            ],
            [
                10664,
                10667
            ],
            [
                10667,
                10668
            ],
            [
                10673,
                10698
            ],
            [
                10698,
                10733
            ],
            [
                10736,
                10790
            ],
            [
                10793,
                10809
            ],
            [
                10809,
                10846
            ],
            [
                10847,
                10850
            ],
            [
                10851,
                10882
            ],
            [
                10882,
                10883
            ],
            [
                10884,
                10886
            ],
            [
                10892,
                10899
            ],
            [
                10905,
                10908
            ],
            [
                10908,
                10910
            ],
            [
                10910,
                11033
            ],
            [
                11033,
                11088
            ],
            [
                11089,
                11107
            ],
            [
                11107,
                11186
            ],
            [
                11187,
                11192
            ],
            [
                11203,
                11205
            ],
            [
                11205,
                11262
            ],
            [
                11262,
                11274
            ],
            [
                11274,
                11275
            ],
            [
                11276,
                11325
            ],
            [
                11325,
                11367
            ],
            [
                11368,
                11372
            ],
            [
                11373,
                11467
            ],
            [
                11467,
                11474
            ],
            [
                11475,
                11531
            ],
            [
                11531,
                11537
            ],
            [
                11538,
                11548
            ],
            [
                11549,
                11563
            ],
            [
                11564,
                11578
            ],
            [
                11579,
                11602
            ],
            [
                11602,
                11604
            ],
            [
                11604,
                11605
            ],
            [
                11620,
                11643
            ],
            [
                11644,
                11699
            ],
            [
                11699,
                11757
            ],
            [
                11763,
                11766
            ],
            [
                11774,
                11783
            ],
            [
                11783,
                11818
            ],
            [
                11818,
                11864
            ],
            [
                11864,
                11865
            ],
            [
                11875,
                11934
            ],
            [
                11939,
                11962
            ],
            [
                11962,
                11976
            ],
            [
                11977,
                12013
            ],
            [
                12013,
                12049
            ],
            [
                12052,
                12088
            ],
            [
                12091,
                12104
            ]
        ],
        "row_chars": [
            [
                0,
                204
            ],
            [
                204,
                265
            ],
            [
                265,
                436
            ],
            [
                436,
                640
            ],
            [
                640,
                640
            ],
            [
                640,
                640
            ],
            [
                640,
                785
            ],
            [
                785,
                892
            ],
            [
                892,
                1139
            ],
            [
                1139,
                1215
            ],
            [
                1215,
                1362
            ],
            [
                1362,
                1362
            ],
            [
                1362,
                1362
            ],
            [
                1362,
                1423
            ],
            [
                1423,
                1591
            ],
            [
                1591,
                1591
            ],
            [
                1591,
                1648
            ],
            [
                1648,
                1657
            ],
            [
                1657,
                1719
            ],
            [
                1719,
                1795
            ],
            [
                1795,
                1863
            ],
            [
                1863,
                1925
            ],
            [
                1925,
                1935
            ],
            [
                1935,
                1954
            ],
            [
                1954,
                1984
            ],
            [
                1984,
                2020
            ],
            [
                2020,
                2084
            ],
            [
                2084,
                2173
            ],
            [
                2173,
                2190
            ],
            [
                2190,
                2211
            ],
            [
                2211,
                2256
            ],
            [
                2256,
                2256
            ],
            [
                2256,
                2295
            ],
            [
                2295,
                2408
            ],
            [
                2408,
                2487
            ],
            [
                2487,
                2518
            ],
            [
                2518,
                2518
            ],
            [
                2518,
                2595
            ],
            [
                2595,
                2664
            ],
            [
                2664,
                2751
            ],
            [
                2751,
                2797
            ],
            [
                2797,
                2846
            ],
            [
                2846,
                2941
            ],
            [
                2941,
                2972
            ],
            [
                2972,
                2997
            ],
            [
                2997,
                2997
            ],
            [
                2997,
                3054
            ],
            [
                3054,
                3104
            ],
            [
                3104,
                3160
            ],
            [
                3160,
                3182
            ],
            [
                3182,
                3253
            ],
            [
                3253,
                3324
            ],
            [
                3324,
                3406
            ],
            [
                3406,
                3625
            ],
            [
                3625,
                3625
            ],
            [
                3625,
                3625
            ],
            [
                3625,
                3727
            ],
            [
                3727,
                3778
            ],
            [
                3778,
                3878
            ],
            [
                3878,
                4018
            ],
            [
                4018,
                4201
            ],
            [
                4201,
                4493
            ],
            [
                4493,
                4562
            ],
            [
                4562,
                4729
            ],
            [
                4729,
                4787
            ],
            [
                4787,
                4843
            ],
            [
                4843,
                4854
            ],
            [
                4854,
                4854
            ],
            [
                4854,
                4907
            ],
            [
                4907,
                5157
            ],
            [
                5157,
                5157
            ],
            [
                5157,
                5215
            ],
            [
                5215,
                5277
            ],
            [
                5277,
                5368
            ],
            [
                5368,
                5368
            ],
            [
                5368,
                5368
            ],
            [
                5368,
                5623
            ],
            [
                5623,
                5666
            ],
            [
                5666,
                5764
            ],
            [
                5764,
                5819
            ],
            [
                5819,
                5885
            ],
            [
                5885,
                5970
            ],
            [
                5970,
                6127
            ],
            [
                6127,
                6265
            ],
            [
                6265,
                6356
            ],
            [
                6356,
                6414
            ],
            [
                6414,
                6492
            ],
            [
                6492,
                6544
            ],
            [
                6544,
                6586
            ],
            [
                6586,
                6586
            ],
            [
                6586,
                6605
            ],
            [
                6605,
                6618
            ],
            [
                6618,
                6618
            ],
            [
                6618,
                6629
            ],
            [
                6629,
                6644
            ],
            [
                6644,
                6670
            ],
            [
                6670,
                6765
            ],
            [
                6765,
                6765
            ],
            [
                6765,
                6765
            ],
            [
                6765,
                6821
            ],
            [
                6821,
                6848
            ],
            [
                6848,
                6876
            ],
            [
                6876,
                6904
            ],
            [
                6904,
                6931
            ],
            [
                6931,
                6931
            ],
            [
                6931,
                6931
            ],
            [
                6931,
                6931
            ],
            [
                6931,
                7091
            ],
            [
                7091,
                7118
            ],
            [
                7118,
                7118
            ],
            [
                7118,
                7118
            ],
            [
                7118,
                7248
            ],
            [
                7248,
                7312
            ],
            [
                7312,
                7376
            ],
            [
                7376,
                7376
            ],
            [
                7376,
                7376
            ],
            [
                7376,
                7442
            ],
            [
                7442,
                7521
            ],
            [
                7521,
                7568
            ],
            [
                7568,
                7568
            ],
            [
                7568,
                7568
            ],
            [
                7568,
                7568
            ],
            [
                7568,
                7568
            ],
            [
                7568,
                7568
            ],
            [
                7568,
                7568
            ],
            [
                7568,
                7568
            ],
            [
                7568,
                7651
            ],
            [
                7651,
                7651
            ],
            [
                7651,
                7733
            ],
            [
                7733,
                7895
            ],
            [
                7895,
                7895
            ],
            [
                7895,
                7993
            ],
            [
                7993,
                8207
            ],
            [
                8207,
                8285
            ],
            [
                8285,
                8317
            ],
            [
                8317,
                8372
            ],
            [
                8372,
                8372
            ],
            [
                8372,
                8438
            ],
            [
                8438,
                8602
            ],
            [
                8602,
                8700
            ],
            [
                8700,
                8727
            ],
            [
                8727,
                8833
            ],
            [
                8833,
                8885
            ],
            [
                8885,
                8950
            ],
            [
                8950,
                9044
            ],
            [
                9044,
                9064
            ],
            [
                9064,
                9097
            ],
            [
                9097,
                9097
            ],
            [
                9097,
                9139
            ],
            [
                9139,
                9187
            ],
            [
                9187,
                9224
            ],
            [
                9224,
                9224
            ],
            [
                9224,
                9224
            ],
            [
                9224,
                9224
            ],
            [
                9224,
                9224
            ],
            [
                9224,
                9224
            ],
            [
                9224,
                9224
            ],
            [
                9224,
                9361
            ],
            [
                9361,
                9398
            ],
            [
                9398,
                9473
            ],
            [
                9473,
                9515
            ],
            [
                9515,
                9530
            ],
            [
                9530,
                9554
            ],
            [
                9554,
                9586
            ],
            [
                9586,
                9655
            ],
            [
                9655,
                9728
            ],
            [
                9728,
                9878
            ],
            [
                9878,
                9905
            ],
            [
                9905,
                9977
            ],
            [
                9977,
                10016
            ],
            [
                10016,
                10016
            ],
            [
                10016,
                10086
            ],
            [
                10086,
                10136
            ],
            [
                10136,
                10201
            ],
            [
                10201,
                10241
            ],
            [
                10241,
                10256
            ],
            [
                10256,
                10349
            ],
            [
                10349,
                10384
            ],
            [
                10384,
                10396
            ],
            [
                10396,
                10546
            ],
            [
                10546,
                10649
            ],
            [
                10649,
                10667
            ],
            [
                10667,
                10698
            ],
            [
                10698,
                10809
            ],
            [
                10809,
                10882
            ],
            [
                10882,
                10910
            ],
            [
                10910,
                11033
            ],
            [
                11033,
                11107
            ],
            [
                11107,
                11205
            ],
            [
                11205,
                11262
            ],
            [
                11262,
                11467
            ],
            [
                11467,
                11531
            ],
            [
                11531,
                11564
            ],
            [
                11564,
                11604
            ],
            [
                11604,
                11604
            ],
            [
                11604,
                11604
            ],
            [
                11604,
                11644
            ],
            [
                11644,
                11644
            ],
            [
                11644,
                11699
            ],
            [
                11699,
                11783
            ],
            [
                11783,
                11818
            ],
            [
                11818,
                11864
            ],
            [
                11864,
                11962
            ],
            [
                11962,
                12013
            ],
            [
                12013,
                12104
            ],
            [
                12104,
                12104
            ]
        ]
    }
}