{
    "original": {
        "text": "It has been said that George Vavasor had a little establishment at Roebury, down in Oxfordshire, and thither he betook himself about the middle of November. He had been long known in this county, and whether or no men spoke well of him as a man of business in London, men spoke well of him down there, as one who knew how to ride to hounds. Not that Vavasor was popular among fellow-sportsmen. It was quite otherwise. He was not a man that made himself really popular in any social meetings of men. He did not himself care for the loose little talkings, half flat and half sharp, of men when they meet together in idleness. He was not open enough in his nature for such popularity. Some men were afraid of him, and some suspected him. There were others who made up to him, seeking his intimacy, but these he usually snubbed, and always kept at a distance. Though he had indulged in all the ordinary pleasures of young men, he had never been a jovial man. In his conversations with men he always seemed to think that he should use his time towards serving some purpose of business. With women he was quite the reverse. With women he could be happy. With women he could really associate. A woman he could really love;--but I doubt whether for all that he could treat a woman well.\nBut he was known in the Oxfordshire country as a man who knew what he was about, and such men are always welcome. It is the man who does not know how to ride that is made uncomfortable in the hunting field by cold looks or expressed censure. And yet it is very rarely that such men do any real harm. Such a one may now and then get among the hounds or override the hunt, but it is not often so. Many such complaints are made; but in truth the too forward man, who presses the dogs, is generally one who can ride, but is too eager or too selfish to keep in his proper place. The bad rider, like the bad whist player, pays highly for what he does not enjoy, and should be thanked. But at both games he gets cruelly snubbed. At both games George Vavasor was great and he never got snubbed.\nThere were men who lived together at Roebury in a kind of club,--four or five of them, who came thither from London, running backwards and forwards as hunting arrangements enabled them to do so,--a brewer or two and a banker, with a would-be fast attorney, a sporting literary gentleman, and a young unmarried Member of Parliament who had no particular home of his own in the country. These men formed the Roebury Club, and a jolly life they had of it. They had their own wine closet at the King's Head,--or Roebury Inn as the house had come to be popularly called,--and supplied their own game. The landlord found everything else; and as they were not very particular about their bills, they were allowed to do pretty much as they liked in the house. They were rather imperious, very late in their hours, sometimes, though not often, noisy, and once there had been a hasty quarrel which had made the landlord in his anger say that the club should be turned out of his house. But they paid well, chaffed the servants much oftener than they bullied them, and on the whole were very popular.\nTo this club Vavasor did not belong, alleging that he could not afford to live at their pace, and alleging, also, that his stays at Roebury were not long enough to make him a desirable member. The invitation to him was not repeated and he lodged elsewhere in the little town. But he occasionally went in of an evening, and would make up with the members a table at whist.\nHe had come down to Roebury by mail train, ready for hunting the next morning, and walked into the club-room just at midnight. There he found Maxwell the banker, Grindley the would-be fast attorney, and Calder Jones the Member of Parliament, playing dummy. Neither of the brewers were there, nor was the sporting literary gentleman.\n\"Here's Vavasor,\" said Maxwell, \"and now we won't play this blackguard game any longer. Somebody told me, Vavasor, that you were gone away.\"\n\"Gone away;--what, like a fox?\"\n\"I don't know what it was; that something had happened to you since last season; that you were married, or dead, or gone abroad. By George, I've lost the trick after all! I hate dummy like the devil. I never hold a card in dummy's hand. Yes, I know; that's seven points on each side. Vavasor, come and cut. Upon my word if any one had asked me, I should have said you were dead.\"\n\"But you see, nobody ever does think of asking you anything.\"\n\"What you probably mean,\" said Grindley, \"is that Vavasor was not returned for Chelsea last February; but you've seen him since that. Are you going to try it again, Vavasor?\"\n\"If you'll lend me the money I will.\"\n\"I don't see what on earth a man gains by going into the house,\" said Calder Jones. \"I couldn't help myself as it happened, but, upon my word it's a deuce of a bore. A fellow thinks he can do as he likes about going,--but he can't. It wouldn't do for me to give it up, because--\"\n\"Oh no, of course not; where should we all be?\" said Vavasor.\n\"It's you and me, Grindems,\" said Maxwell. \"D---- parliament, and now let's have a rubber.\"\nThey played till three and Mr. Calder Jones lost a good deal of money,--a good deal of money in a little way, for they never played above ten-shilling points, and no bet was made for more than a pound or two. But Vavasor was the winner, and when he left the room he became the subject of some ill-natured remarks.\n\"I wonder he likes coming in here,\" said Grindley, who had himself been the man to invite him to belong to the club, and who had at one time indulged the ambition of an intimacy with George Vavasor.\n\"I can't understand it,\" said Calder Jones, who was a little bitter about his money. \"Last year he seemed to walk in just when he liked, as though he were one of us.\"\n\"He's a bad sort of fellow,\" said Grindley; \"he's so uncommonly dark. I don't know where on earth he gets his money from, He was heir to some small property in the north, but he lost every shilling of that when he was in the wine trade.\"\n\"You're wrong there, Grindems,\" said Maxwell,--making use of a playful nickname which he had invented for his friend. \"He made a pot of money at the wine business, and had he stuck to it he would have been a rich man.\"\n\"He's lost it all since then, and that place in the north into the bargain.\"\n\"Wrong again, Grindems, my boy. If old Vavasor were to die to-morrow, Vavasor Hall would go just as he might choose to leave it. George may be a ruined man for aught I know--\"\n\"There's no doubt about that, I believe,\" said Grindley.\n\"Perhaps not, Grindems; but he can't have lost Vavasor Hall because he has never as yet had an interest in it. He's the natural heir, and will probably get it some day.\"\n\"All the same,\" said Calder Jones, \"isn't it rather odd he should come in here?\"\n\"We've asked him often enough,\" said Maxwell; \"not because we like him, but because we want him so often to make up a rubber. I don't like George Vavasor, and I don't know who does; but I like him better than dummy. And I'd sooner play whist with men I don't like, Grindems, than I'd not play at all.\" A bystander might have thought from the tone of Mr. Maxwell's voice that he was alluding to Mr. Grindley himself, but Mr. Grindley didn't seem to take it in that light.\n\"That's true, of course,\" said he. \"We can't pick men just as we please. But I certainly didn't think that he'd make it out for another season.\"\nThe club breakfasted the next morning at nine o'clock, in order that they might start at half-past for the meet at Edgehill. Edgehill is twelve miles from Roebury, and the hacks would do it in an hour and a half,--or perhaps a little less. \"Does anybody know anything about that brown horse of Vavasor's?\" said Maxwell. \"I saw him coming into the yard yesterday with that old groom of his.\"\n\"He had a brown horse last season,\" said Grindley;--\"a little thing that went very fast, but wasn't quite sound on the road.\"\n\"That was a mare,\" said Maxwell, \"and he sold her to Cinquebars.\"*\n[*Ah, my friend, from whom I have borrowed this scion of the nobility! Had he been left with us he would have forgiven me my little theft, and now that he has gone I will not change the name.]\n\"For a hundred and fifty,\" said Calder Jones, \"and she wasn't worth the odd fifty.\"\n\"He won seventy with her at Leamington,\" said Maxwell, \"and I doubt whether he'd take his money now.\"\n\"Is Cinquebars coming down here this year?\"\n\"I don't know,\" said Maxwell. \"I hope not. He's the best fellow in the world, but he can't ride, and he don't care for hunting, and he makes more row than any fellow I ever met. I wish some fellow could tell me something about that fellow's brown horse.\"\n\"I'd never buy a horse of Vavasor's if I were you,\" said Grindley. \"He never has anything that's all right all round.\"\n\"And who has?\" said Maxwell, as he took into his plate a second mutton chop, which had just been brought up hot into the room especially for him. \"That's the mistake men make about horses, and that's why there's so much cheating. I never ask for a warranty with a horse, and don't very often have a horse examined. Yet I do as well as others. You can't have perfect horses any more than you can perfect men, or perfect women. You put up with red hair, or bad teeth, or big feet,--or sometimes with the devil of a voice. But a man when he wants a horse won't put up with anything! Therefore those who've got horses to sell must lie. When I go into the market with three hundred pounds I expect a perfect animal. As I never do that now I never expect a perfect animal. I like 'em to see; I like 'em to have four legs; and I like 'em to have a little wind. I don't much mind anything else.\"\n\"By Jove you're about right,\" said Calder Jones. The reader will therefore readily see that Mr. Maxwell the banker reigned as king in that club.\nVavasor had sent two horses on in charge of Bat Smithers, and followed on a pony about fourteen hands high, which he had ridden as a cover hack for the last four years. He did not start till near ten, but he was able to catch Bat with his two horses about a mile and a half on that side of Edgehill. \"Have you managed to come along pretty clean?\" the master asked as he came up with his servant.\n\"They be the most beastly roads in all England,\" said Bat, who always found fault with any county in which he happened to be located. \"But I'll warrant I'm cleaner than most on 'em. What for any county should make such roads as them I never could tell.\"\n\"The roads about there are bad, certainly;--very bad. But I suppose they would have been better had Providence sent better materials. And what do you think of the brown horse, Bat?\"\n\"Well, sir.\" He said no more, and that he said with a drawl.\n\"He's as fine an animal to look at as ever I put my eye on,\" said George.\n\"He's all that,\" said Bat.\n\"He's got lots of pace too.\"\n\"I'm sure he has, sir.\"\n\"And they tell me you can't beat him at jumping.\"\n\"They can mostly do that, sir, if they're well handled.\"\n\"You see he's a deal over my weight.\"\n\"Yes, he is, Mr. Vavasor. He is a fourteen stoner.\"\n\"Or fifteen,\" said Vavasor.\n\"Perhaps he may, sir. There's no knowing what a 'orse can carry till he's tried.\"\nGeorge asked his groom no more questions, but felt sure that he had better sell his brown horse if he could. Now I here protest that there was nothing specially amiss with the brown horse. Towards the end of the preceding season he had overreached himself and had been lame, and had been sold by some owner with more money than brains who had not cared to wait for a cure. Then there had gone with him a bad character, and a vague suspicion had attached itself to him, as there does to hundreds of horses which are very good animals in their way. He had come thus to Tattersall's, and Vavasor had bought him cheap, thinking that he might make money of him, from his form and action. He had found nothing amiss with him,--nor, indeed, had Bat Smithers. But his character went with him, and therefore Bat Smithers thought it well to be knowing. George Vavasor knew as much of horses as most men can,--as, perhaps, as any man can who is not a dealer, or a veterinary surgeon; but he, like all men, doubted his own knowledge, though on that subject he would never admit that he doubted it. Therefore he took Bat's word and felt sure that the horse was wrong.\n\"We shall have a run from the big wood,\" said George.\n\"If they make un break, you will, sir,\" said Bat.\n\"At any rate I'll ride the brown horse,\" said George. Then, as soon as that was settled between them, the Roebury Club overtook them.\nThere was now a rush of horses on the road altogether, and they were within a quarter of a mile of Edgehill church, close to which was the meet. Bat with his two hunters fell a little behind, and the others trotted on together. The other grooms with their animals were on in advance, and were by this time employed in combing out forelocks, and rubbing stirrup leathers and horses' legs free from the dirt of the roads;--but Bat Smithers was like his master, and did not congregate much with other men, and Vavasor was sure to give orders to his servant different from the orders given by others.\n\"Are you well mounted this year?\" Maxwell asked of George Vavasor.\n\"No, indeed; I never was what I call well mounted yet. I generally have one horse and three or four cripples. That brown horse behind there is pretty good, I believe.\"\n\"I see your man has got the old chestnut mare with him.\"\n\"She's one of the cripples,--not but what she's as sound as a bell, and as good a hunter as ever I wish to ride; but she makes a little noise when she's going.\"\n\"So that you can hear her three fields off,\" said Grindley.\n\"Five if the fields are small enough and your ears are sharp enough,\" said Vavasor. \"All the same I wouldn't change her for the best horse I ever saw under you.\"\n\"Had you there, Grindems,\" said Maxwell.\n\"No, he didn't,\" said Grindley. \"He didn't have me at all.\"\n\"Your horses, Grindley, are always up to all the work they have to do,\" said George; \"and I don't know what any man wants more than that.\"\n\"Had you again, Grindems,\" said Maxwell.\n\"I can ride against him any day,\" said Grindley.\n\"Yes; or against a brick wall either, if your horse didn't know any better,\" said George.\n\"Had you again, Grindems,\" said Maxwell. Whereupon Mr. Grindley trotted on, round the corner by the church, and into the field in which the hounds were assembled. The fire had become too hot for him, and he thought it best to escape. Had it been Vavasor alone he would have turned upon him and snarled, but he could not afford to exhibit any ill temper to the king of the club. Mr. Grindley was not popular, and were Maxwell to turn openly against him his sporting life down at Roebury would decidedly be a failure.\nThe lives of such men as Mr. Grindley,--men who are tolerated in the daily society of others who are accounted their superiors, do not seem to have many attractions. And yet how many such men does one see in almost every set? Why Mr. Grindley should have been inferior to Mr. Maxwell the banker, or to Stone, or to Prettyman who were brewers, or even to Mr. Pollock the heavy-weight literary gentleman, I can hardly say. An attorney by his trade is at any rate as good as a brewer, and there are many attorneys who hold their heads high anywhere. Grindley was a rich man,--or at any rate rich enough for the life he led. I don't know much about his birth, but I believe it was as good as Maxwell's. He was not ignorant, or a fool;--whereas I rather think Maxwell was a fool. Grindley had made his own way in the world, but Maxwell would certainly not have made himself a banker if his father had not been a banker before him; nor could the bank have gone on and prospered had there not been partners there who were better men of business than our friend. Grindley knew that he had a better intellect than Maxwell; and yet he allowed Maxwell to snub him, and he toadied Maxwell in return. It was not on the score of riding that Maxwell claimed and held his superiority, for Grindley did not want pluck, and every one knew that Maxwell had lived freely and that his nerves were not what they had been. I think it had come from the outward look of the men, from the form of each, from the gait and visage which in one was good and in the other insignificant. The nature of such dominion of man over man is very singular, but this is certain that when once obtained in manhood it may be easily held.\nAmong boys at school the same thing is even more conspicuous, because boys have less of conscience than men, are more addicted to tyranny, and when weak are less prone to feel the misery and disgrace of succumbing. Who has been through a large school and does not remember the Maxwells and Grindleys,--the tyrants and the slaves,--those who domineered and those who submitted? Nor was it, even then, personal strength, nor always superior courage, that gave the power of command. Nor was it intellect, or thoughtfulness, nor by any means such qualities as make men and boys lovable. It is said by many who have had to deal with boys, that certain among them claim and obtain ascendancy by the spirit within them; but I doubt whether the ascendancy is not rather thrust on them than claimed by them. Here again I think the outward gait of the boy goes far towards obtaining for him the submission of his fellows.\nBut the tyrant boy does not become the tyrant man, or the slave boy the slave man, because the outward visage, that has been noble or mean in the one, changes and becomes so often mean or noble in the other.\n\"By George, there's Pollock!\" said Maxwell, as he rode into the field by the church. \"I'll bet half a crown that he's come down from London this morning, that he was up all night last night, and that he tells us so three times before the hounds go out of the paddock.\" Mr. Pollock was the heavy-weight sporting literary gentleman.",
        "paragraph_chars": [
            [
                0,
                1279
            ],
            [
                1279,
                2066
            ],
            [
                2066,
                3156
            ],
            [
                3156,
                3528
            ],
            [
                3528,
                3861
            ],
            [
                3861,
                4002
            ],
            [
                4002,
                4034
            ],
            [
                4034,
                4414
            ],
            [
                4414,
                4476
            ],
            [
                4476,
                4651
            ],
            [
                4651,
                4689
            ],
            [
                4689,
                4969
            ],
            [
                4969,
                5031
            ],
            [
                5031,
                5123
            ],
            [
                5123,
                5437
            ],
            [
                5437,
                5636
            ],
            [
                5636,
                5803
            ],
            [
                5803,
                6041
            ],
            [
                6041,
                6260
            ],
            [
                6260,
                6337
            ],
            [
                6337,
                6513
            ],
            [
                6513,
                6570
            ],
            [
                6570,
                6740
            ],
            [
                6740,
                6821
            ],
            [
                6821,
                7292
            ],
            [
                7292,
                7437
            ],
            [
                7437,
                7828
            ],
            [
                7828,
                7954
            ],
            [
                7954,
                8021
            ],
            [
                8021,
                8214
            ],
            [
                8214,
                8298
            ],
            [
                8298,
                8400
            ],
            [
                8400,
                8444
            ],
            [
                8444,
                8699
            ],
            [
                8699,
                8818
            ],
            [
                8818,
                9706
            ],
            [
                9706,
                9851
            ],
            [
                9851,
                10247
            ],
            [
                10247,
                10501
            ],
            [
                10501,
                10683
            ],
            [
                10683,
                10744
            ],
            [
                10744,
                10818
            ],
            [
                10818,
                10845
            ],
            [
                10845,
                10874
            ],
            [
                10874,
                10898
            ],
            [
                10898,
                10948
            ],
            [
                10948,
                11005
            ],
            [
                11005,
                11043
            ],
            [
                11043,
                11095
            ],
            [
                11095,
                11123
            ],
            [
                11123,
                11205
            ],
            [
                11205,
                12360
            ],
            [
                12360,
                12414
            ],
            [
                12414,
                12464
            ],
            [
                12464,
                12598
            ],
            [
                12598,
                13195
            ],
            [
                13195,
                13262
            ],
            [
                13262,
                13430
            ],
            [
                13430,
                13487
            ],
            [
                13487,
                13648
            ],
            [
                13648,
                13708
            ],
            [
                13708,
                13870
            ],
            [
                13870,
                13911
            ],
            [
                13911,
                13971
            ],
            [
                13971,
                14110
            ],
            [
                14110,
                14151
            ],
            [
                14151,
                14200
            ],
            [
                14200,
                14290
            ],
            [
                14290,
                14806
            ],
            [
                14806,
                16502
            ],
            [
                16502,
                17414
            ],
            [
                17414,
                17622
            ],
            [
                17622,
                17952
            ]
        ],
        "segment_chars": [
            [
                0,
                157
            ],
            [
                157,
                341
            ],
            [
                341,
                394
            ],
            [
                394,
                418
            ],
            [
                418,
                499
            ],
            [
                499,
                624
            ],
            [
                624,
                682
            ],
            [
                682,
                735
            ],
            [
                735,
                856
            ],
            [
                856,
                955
            ],
            [
                955,
                1081
            ],
            [
                1081,
                1118
            ],
            [
                1118,
                1148
            ],
            [
                1148,
                1186
            ],
            [
                1186,
                1279
            ],
            [
                1279,
                1393
            ],
            [
                1393,
                1521
            ],
            [
                1521,
                1579
            ],
            [
                1579,
                1674
            ],
            [
                1674,
                1853
            ],
            [
                1853,
                1958
            ],
            [
                1958,
                2001
            ],
            [
                2001,
                2066
            ],
            [
                2066,
                2451
            ],
            [
                2451,
                2519
            ],
            [
                2519,
                2662
            ],
            [
                2662,
                2818
            ],
            [
                2818,
                3042
            ],
            [
                3042,
                3156
            ],
            [
                3156,
                3349
            ],
            [
                3349,
                3432
            ],
            [
                3432,
                3528
            ],
            [
                3528,
                3655
            ],
            [
                3655,
                3785
            ],
            [
                3785,
                3861
            ],
            [
                3861,
                3949
            ],
            [
                3949,
                4002
            ],
            [
                4002,
                4034
            ],
            [
                4034,
                4163
            ],
            [
                4163,
                4205
            ],
            [
                4205,
                4234
            ],
            [
                4234,
                4271
            ],
            [
                4271,
                4318
            ],
            [
                4318,
                4341
            ],
            [
                4341,
                4414
            ],
            [
                4414,
                4476
            ],
            [
                4476,
                4610
            ],
            [
                4610,
                4651
            ],
            [
                4651,
                4689
            ],
            [
                4689,
                4773
            ],
            [
                4773,
                4855
            ],
            [
                4855,
                4921
            ],
            [
                4921,
                4969
            ],
            [
                4969,
                5017
            ],
            [
                5017,
                5031
            ],
            [
                5031,
                5074
            ],
            [
                5074,
                5123
            ],
            [
                5123,
                5332
            ],
            [
                5332,
                5437
            ],
            [
                5437,
                5636
            ],
            [
                5636,
                5721
            ],
            [
                5721,
                5803
            ],
            [
                5803,
                5873
            ],
            [
                5873,
                6041
            ],
            [
                6041,
                6159
            ],
            [
                6159,
                6260
            ],
            [
                6260,
                6337
            ],
            [
                6337,
                6369
            ],
            [
                6369,
                6466
            ],
            [
                6466,
                6513
            ],
            [
                6513,
                6570
            ],
            [
                6570,
                6681
            ],
            [
                6681,
                6740
            ],
            [
                6740,
                6821
            ],
            [
                6821,
                6947
            ],
            [
                6947,
                7037
            ],
            [
                7037,
                7123
            ],
            [
                7123,
                7292
            ],
            [
                7292,
                7327
            ],
            [
                7327,
                7365
            ],
            [
                7365,
                7437
            ],
            [
                7437,
                7562
            ],
            [
                7562,
                7677
            ],
            [
                7677,
                7743
            ],
            [
                7743,
                7757
            ],
            [
                7757,
                7828
            ],
            [
                7828,
                7954
            ],
            [
                7954,
                8021
            ],
            [
                8021,
                8092
            ],
            [
                8092,
                8214
            ],
            [
                8214,
                8298
            ],
            [
                8298,
                8400
            ],
            [
                8400,
                8444
            ],
            [
                8444,
                8474
            ],
            [
                8474,
                8487
            ],
            [
                8487,
                8622
            ],
            [
                8622,
                8699
            ],
            [
                8699,
                8766
            ],
            [
                8766,
                8818
            ],
            [
                8818,
                8833
            ],
            [
                8833,
                8964
            ],
            [
                8964,
                9048
            ],
            [
                9048,
                9133
            ],
            [
                9133,
                9161
            ],
            [
                9161,
                9244
            ],
            [
                9244,
                9338
            ],
            [
                9338,
                9398
            ],
            [
                9398,
                9450
            ],
            [
                9450,
                9529
            ],
            [
                9529,
                9585
            ],
            [
                9585,
                9672
            ],
            [
                9672,
                9706
            ],
            [
                9706,
                9755
            ],
            [
                9755,
                9851
            ],
            [
                9851,
                10020
            ],
            [
                10020,
                10151
            ],
            [
                10151,
                10198
            ],
            [
                10198,
                10247
            ],
            [
                10247,
                10381
            ],
            [
                10381,
                10429
            ],
            [
                10429,
                10501
            ],
            [
                10501,
                10555
            ],
            [
                10555,
                10635
            ],
            [
                10635,
                10683
            ],
            [
                10683,
                10696
            ],
            [
                10696,
                10744
            ],
            [
                10744,
                10818
            ],
            [
                10818,
                10845
            ],
            [
                10845,
                10874
            ],
            [
                10874,
                10898
            ],
            [
                10898,
                10948
            ],
            [
                10948,
                11005
            ],
            [
                11005,
                11043
            ],
            [
                11043,
                11069
            ],
            [
                11069,
                11095
            ],
            [
                11095,
                11123
            ],
            [
                11123,
                11145
            ],
            [
                11145,
                11205
            ],
            [
                11205,
                11314
            ],
            [
                11314,
                11394
            ],
            [
                11394,
                11578
            ],
            [
                11578,
                11752
            ],
            [
                11752,
                11888
            ],
            [
                11888,
                11957
            ],
            [
                11957,
                12048
            ],
            [
                12048,
                12291
            ],
            [
                12291,
                12360
            ],
            [
                12360,
                12414
            ],
            [
                12414,
                12464
            ],
            [
                12464,
                12518
            ],
            [
                12518,
                12598
            ],
            [
                12598,
                12743
            ],
            [
                12743,
                12826
            ],
            [
                12826,
                13195
            ],
            [
                13195,
                13229
            ],
            [
                13229,
                13262
            ],
            [
                13262,
                13317
            ],
            [
                13317,
                13372
            ],
            [
                13372,
                13430
            ],
            [
                13430,
                13487
            ],
            [
                13487,
                13648
            ],
            [
                13648,
                13708
            ],
            [
                13708,
                13792
            ],
            [
                13792,
                13870
            ],
            [
                13870,
                13911
            ],
            [
                13911,
                13943
            ],
            [
                13943,
                13971
            ],
            [
                13971,
                14110
            ],
            [
                14110,
                14151
            ],
            [
                14151,
                14200
            ],
            [
                14200,
                14290
            ],
            [
                14290,
                14331
            ],
            [
                14331,
                14453
            ],
            [
                14453,
                14524
            ],
            [
                14524,
                14668
            ],
            [
                14668,
                14806
            ],
            [
                14806,
                14972
            ],
            [
                14972,
                15032
            ],
            [
                15032,
                15227
            ],
            [
                15227,
                15353
            ],
            [
                15353,
                15427
            ],
            [
                15427,
                15505
            ],
            [
                15505,
                15581
            ],
            [
                15581,
                15861
            ],
            [
                15861,
                15994
            ],
            [
                15994,
                16206
            ],
            [
                16206,
                16362
            ],
            [
                16362,
                16502
            ],
            [
                16502,
                16717
            ],
            [
                16717,
                16879
            ],
            [
                16879,
                16982
            ],
            [
                16982,
                17085
            ],
            [
                17085,
                17301
            ],
            [
                17301,
                17414
            ],
            [
                17414,
                17622
            ],
            [
                17622,
                17652
            ],
            [
                17652,
                17707
            ],
            [
                17707,
                17891
            ],
            [
                17891,
                17952
            ]
        ],
        "overlap_chars": [
            [
                0,
                75
            ],
            [
                81,
                95
            ],
            [
                97,
                100
            ],
            [
                109,
                111
            ],
            [
                133,
                155
            ],
            [
                95,
                96
            ],
            [
                155,
                157
            ],
            [
                180,
                194
            ],
            [
                266,
                289
            ],
            [
                300,
                329
            ],
            [
                339,
                340
            ],
            [
                341,
                375
            ],
            [
                376,
                394
            ],
            [
                499,
                509
            ],
            [
                518,
                536
            ],
            [
                544,
                548
            ],
            [
                580,
                601
            ],
            [
                611,
                624
            ],
            [
                624,
                664
            ],
            [
                670,
                680
            ],
            [
                709,
                714
            ],
            [
                836,
                840
            ],
            [
                746,
                752
            ],
            [
                841,
                856
            ],
            [
                923,
                955
            ],
            [
                985,
                1015
            ],
            [
                958,
                984
            ],
            [
                1019,
                1025
            ],
            [
                1055,
                1081
            ],
            [
                1081,
                1118
            ],
            [
                1118,
                1148
            ],
            [
                1186,
                1215
            ],
            [
                1217,
                1236
            ],
            [
                1250,
                1279
            ],
            [
                1358,
                1359
            ],
            [
                1283,
                1289
            ],
            [
                1384,
                1391
            ],
            [
                1296,
                1298
            ],
            [
                1303,
                1314
            ],
            [
                1323,
                1358
            ],
            [
                1391,
                1393
            ],
            [
                2066,
                2076
            ],
            [
                2077,
                2084
            ],
            [
                2114,
                2128
            ],
            [
                2100,
                2110
            ],
            [
                2128,
                2129
            ],
            [
                2251,
                2253
            ],
            [
                2438,
                2441
            ],
            [
                2170,
                2181
            ],
            [
                2217,
                2224
            ],
            [
                2449,
                2450
            ],
            [
                2262,
                2263
            ],
            [
                2144,
                2146
            ],
            [
                2151,
                2152
            ],
            [
                2282,
                2291
            ],
            [
                2297,
                2307
            ],
            [
                2313,
                2396
            ],
            [
                2451,
                2484
            ],
            [
                2484,
                2519
            ],
            [
                2519,
                2523
            ],
            [
                2637,
                2660
            ],
            [
                2568,
                2569
            ],
            [
                2662,
                2674
            ],
            [
                2681,
                2803
            ],
            [
                2816,
                2818
            ],
            [
                2818,
                2871
            ],
            [
                2908,
                2911
            ],
            [
                2872,
                2881
            ],
            [
                2901,
                2906
            ],
            [
                3042,
                3061
            ],
            [
                3070,
                3082
            ],
            [
                3096,
                3156
            ],
            [
                3169,
                3191
            ],
            [
                3156,
                3168
            ],
            [
                3191,
                3192
            ],
            [
                3202,
                3226
            ],
            [
                3415,
                3430
            ],
            [
                3248,
                3249
            ],
            [
                3392,
                3411
            ],
            [
                3430,
                3432
            ],
            [
                3432,
                3459
            ],
            [
                3473,
                3492
            ],
            [
                3510,
                3528
            ],
            [
                3528,
                3636
            ],
            [
                3642,
                3655
            ],
            [
                3655,
                3711
            ],
            [
                3717,
                3784
            ],
            [
                3861,
                3891
            ],
            [
                3947,
                3949
            ],
            [
                3949,
                3999
            ],
            [
                4147,
                4149
            ],
            [
                4115,
                4145
            ],
            [
                4161,
                4163
            ],
            [
                4163,
                4193
            ],
            [
                4203,
                4205
            ],
            [
                4205,
                4217
            ],
            [
                4232,
                4234
            ],
            [
                4271,
                4318
            ],
            [
                4318,
                4341
            ],
            [
                4354,
                4356
            ],
            [
                4365,
                4414
            ],
            [
                4414,
                4418
            ],
            [
                4428,
                4476
            ],
            [
                4476,
                4533
            ],
            [
                4538,
                4541
            ],
            [
                4555,
                4576
            ],
            [
                4608,
                4610
            ],
            [
                4610,
                4651
            ],
            [
                4651,
                4689
            ],
            [
                4689,
                4706
            ],
            [
                4716,
                4773
            ],
            [
                4773,
                4796
            ],
            [
                4811,
                4816
            ],
            [
                4831,
                4837
            ],
            [
                4849,
                4855
            ],
            [
                4921,
                4965
            ],
            [
                4969,
                5017
            ],
            [
                5017,
                5031
            ],
            [
                5031,
                5074
            ],
            [
                5074,
                5076
            ],
            [
                5081,
                5120
            ],
            [
                5120,
                5123
            ],
            [
                5123,
                5145
            ],
            [
                5192,
                5193
            ],
            [
                5146,
                5192
            ],
            [
                5330,
                5332
            ],
            [
                5336,
                5437
            ],
            [
                5437,
                5487
            ],
            [
                5509,
                5516
            ],
            [
                5488,
                5495
            ],
            [
                5527,
                5565
            ],
            [
                5517,
                5519
            ],
            [
                5634,
                5636
            ],
            [
                5636,
                5679
            ],
            [
                5688,
                5721
            ],
            [
                5721,
                5803
            ],
            [
                5803,
                5848
            ],
            [
                5873,
                5923
            ],
            [
                5871,
                5872
            ],
            [
                5925,
                5944
            ],
            [
                5951,
                6000
            ],
            [
                6021,
                6041
            ],
            [
                6041,
                6085
            ],
            [
                6157,
                6159
            ],
            [
                6159,
                6203
            ],
            [
                6257,
                6260
            ],
            [
                6260,
                6337
            ],
            [
                6337,
                6369
            ],
            [
                6369,
                6395
            ],
            [
                6405,
                6428
            ],
            [
                6396,
                6398
            ],
            [
                6464,
                6466
            ],
            [
                6681,
                6702
            ],
            [
                6737,
                6740
            ],
            [
                6740,
                6821
            ],
            [
                6821,
                6865
            ],
            [
                6891,
                6892
            ],
            [
                6867,
                6868
            ],
            [
                6926,
                6947
            ],
            [
                6947,
                6974
            ],
            [
                7001,
                7006
            ],
            [
                7041,
                7085
            ],
            [
                7025,
                7029
            ],
            [
                7105,
                7122
            ],
            [
                7437,
                7500
            ],
            [
                7523,
                7543
            ],
            [
                7544,
                7562
            ],
            [
                7562,
                7608
            ],
            [
                7615,
                7648
            ],
            [
                7675,
                7676
            ],
            [
                7677,
                7743
            ],
            [
                7743,
                7757
            ],
            [
                7757,
                7767
            ],
            [
                7780,
                7828
            ],
            [
                7828,
                7878
            ],
            [
                7880,
                7882
            ],
            [
                7906,
                7915
            ],
            [
                7883,
                7895
            ],
            [
                7951,
                7954
            ],
            [
                7954,
                8019
            ],
            [
                8214,
                8281
            ],
            [
                8295,
                8298
            ],
            [
                8298,
                8351
            ],
            [
                8400,
                8444
            ],
            [
                8444,
                8474
            ],
            [
                8474,
                8487
            ],
            [
                8487,
                8539
            ],
            [
                8620,
                8622
            ],
            [
                8622,
                8628
            ],
            [
                8641,
                8699
            ],
            [
                8699,
                8734
            ],
            [
                8748,
                8766
            ],
            [
                8766,
                8818
            ],
            [
                8818,
                8833
            ],
            [
                8833,
                8846
            ],
            [
                8873,
                8893
            ],
            [
                8962,
                8964
            ],
            [
                9161,
                9204
            ],
            [
                9229,
                9244
            ],
            [
                9552,
                9585
            ],
            [
                9585,
                9632
            ],
            [
                9634,
                9637
            ],
            [
                9670,
                9672
            ],
            [
                9672,
                9689
            ],
            [
                9690,
                9706
            ],
            [
                9706,
                9714
            ],
            [
                9715,
                9721
            ],
            [
                9728,
                9755
            ],
            [
                9755,
                9770
            ],
            [
                9789,
                9851
            ],
            [
                9851,
                9878
            ],
            [
                9882,
                9884
            ],
            [
                9999,
                10002
            ],
            [
                9885,
                9894
            ],
            [
                9895,
                9926
            ],
            [
                9927,
                9931
            ],
            [
                9959,
                9967
            ],
            [
                9979,
                9983
            ],
            [
                9990,
                9994
            ],
            [
                10018,
                10020
            ],
            [
                10020,
                10113
            ],
            [
                10141,
                10150
            ],
            [
                10151,
                10198
            ],
            [
                10198,
                10220
            ],
            [
                10234,
                10247
            ],
            [
                10247,
                10304
            ],
            [
                10379,
                10381
            ],
            [
                10381,
                10382
            ],
            [
                10399,
                10429
            ],
            [
                10438,
                10471
            ],
            [
                10480,
                10501
            ],
            [
                10501,
                10511
            ],
            [
                10524,
                10527
            ],
            [
                10545,
                10549
            ],
            [
                10528,
                10542
            ],
            [
                10553,
                10555
            ],
            [
                10635,
                10683
            ],
            [
                10683,
                10696
            ],
            [
                10696,
                10703
            ],
            [
                10730,
                10744
            ],
            [
                10744,
                10788
            ],
            [
                10802,
                10818
            ],
            [
                10818,
                10845
            ],
            [
                10845,
                10874
            ],
            [
                10874,
                10898
            ],
            [
                10898,
                10948
            ],
            [
                10948,
                11005
            ],
            [
                11005,
                11043
            ],
            [
                11043,
                11069
            ],
            [
                11069,
                11092
            ],
            [
                11096,
                11098
            ],
            [
                11092,
                11095
            ],
            [
                11205,
                11314
            ],
            [
                11338,
                11394
            ],
            [
                11434,
                11440
            ],
            [
                11474,
                11478
            ],
            [
                11402,
                11433
            ],
            [
                11478,
                11511
            ],
            [
                11540,
                11578
            ],
            [
                11578,
                11676
            ],
            [
                11683,
                11752
            ],
            [
                11790,
                11819
            ],
            [
                11786,
                11789
            ],
            [
                11895,
                11923
            ],
            [
                11957,
                12048
            ],
            [
                12048,
                12097
            ],
            [
                12101,
                12102
            ],
            [
                12178,
                12184
            ],
            [
                12200,
                12225
            ],
            [
                12289,
                12291
            ],
            [
                12291,
                12338
            ],
            [
                12349,
                12358
            ],
            [
                12339,
                12348
            ],
            [
                12358,
                12360
            ],
            [
                12360,
                12413
            ],
            [
                12464,
                12465
            ],
            [
                12477,
                12502
            ],
            [
                12518,
                12522
            ],
            [
                12566,
                12598
            ],
            [
                12598,
                12640
            ],
            [
                12720,
                12722
            ],
            [
                12697,
                12712
            ],
            [
                12741,
                12743
            ],
            [
                12743,
                12746
            ],
            [
                12747,
                12767
            ],
            [
                12768,
                12825
            ],
            [
                13195,
                13229
            ],
            [
                13229,
                13242
            ],
            [
                13246,
                13262
            ],
            [
                13262,
                13274
            ],
            [
                13317,
                13372
            ],
            [
                13372,
                13430
            ],
            [
                13430,
                13475
            ],
            [
                13484,
                13487
            ],
            [
                13487,
                13513
            ],
            [
                13538,
                13558
            ],
            [
                13567,
                13568
            ],
            [
                13562,
                13566
            ],
            [
                13569,
                13575
            ],
            [
                13598,
                13615
            ],
            [
                13623,
                13648
            ],
            [
                13648,
                13708
            ],
            [
                13708,
                13737
            ],
            [
                13769,
                13792
            ],
            [
                13792,
                13870
            ],
            [
                13870,
                13911
            ],
            [
                13911,
                13942
            ],
            [
                13971,
                13998
            ],
            [
                14006,
                14110
            ],
            [
                14110,
                14151
            ],
            [
                14151,
                14199
            ],
            [
                14490,
                14496
            ],
            [
                14354,
                14361
            ],
            [
                14366,
                14451
            ],
            [
                14364,
                14365
            ],
            [
                14513,
                14524
            ],
            [
                14524,
                14668
            ],
            [
                14668,
                14701
            ],
            [
                14707,
                14741
            ],
            [
                14804,
                14806
            ],
            [
                15353,
                15372
            ],
            [
                15399,
                15405
            ],
            [
                15373,
                15377
            ],
            [
                15512,
                15536
            ],
            [
                15546,
                15581
            ],
            [
                15581,
                15666
            ],
            [
                15675,
                15731
            ],
            [
                15782,
                15787
            ],
            [
                15816,
                15820
            ],
            [
                15821,
                15843
            ],
            [
                15859,
                15861
            ],
            [
                15861,
                15874
            ],
            [
                15958,
                15959
            ],
            [
                15924,
                15958
            ],
            [
                15992,
                15994
            ],
            [
                15997,
                16004
            ],
            [
                16118,
                16121
            ],
            [
                16049,
                16052
            ],
            [
                16337,
                16362
            ],
            [
                16496,
                16500
            ],
            [
                16381,
                16389
            ],
            [
                16397,
                16401
            ],
            [
                16500,
                16502
            ],
            [
                17622,
                17652
            ],
            [
                17652,
                17691
            ],
            [
                17705,
                17707
            ],
            [
                17707,
                17800
            ],
            [
                17811,
                17866
            ],
            [
                17877,
                17891
            ],
            [
                17891,
                17952
            ]
        ],
        "row_chars": [
            [
                0,
                157
            ],
            [
                157,
                341
            ],
            [
                341,
                394
            ],
            [
                394,
                418
            ],
            [
                418,
                499
            ],
            [
                499,
                624
            ],
            [
                624,
                856
            ],
            [
                856,
                955
            ],
            [
                955,
                1081
            ],
            [
                1081,
                1118
            ],
            [
                1118,
                1148
            ],
            [
                1148,
                1186
            ],
            [
                1186,
                1279
            ],
            [
                1279,
                1393
            ],
            [
                1393,
                1521
            ],
            [
                1521,
                1579
            ],
            [
                1579,
                1674
            ],
            [
                1674,
                1853
            ],
            [
                1853,
                1958
            ],
            [
                1958,
                2001
            ],
            [
                2001,
                2066
            ],
            [
                2066,
                2451
            ],
            [
                2451,
                2519
            ],
            [
                2519,
                2818
            ],
            [
                2818,
                3156
            ],
            [
                3156,
                3432
            ],
            [
                3432,
                3528
            ],
            [
                3528,
                3655
            ],
            [
                3655,
                3785
            ],
            [
                3785,
                3861
            ],
            [
                3861,
                3949
            ],
            [
                3949,
                4002
            ],
            [
                4002,
                4034
            ],
            [
                4034,
                4163
            ],
            [
                4163,
                4205
            ],
            [
                4205,
                4234
            ],
            [
                4234,
                4271
            ],
            [
                4271,
                4318
            ],
            [
                4318,
                4341
            ],
            [
                4341,
                4414
            ],
            [
                4414,
                4476
            ],
            [
                4476,
                4610
            ],
            [
                4610,
                4651
            ],
            [
                4651,
                4689
            ],
            [
                4689,
                4773
            ],
            [
                4773,
                4855
            ],
            [
                4855,
                4921
            ],
            [
                4921,
                4969
            ],
            [
                4969,
                5017
            ],
            [
                5017,
                5031
            ],
            [
                5031,
                5074
            ],
            [
                5074,
                5123
            ],
            [
                5123,
                5332
            ],
            [
                5332,
                5437
            ],
            [
                5437,
                5636
            ],
            [
                5636,
                5721
            ],
            [
                5721,
                5803
            ],
            [
                5803,
                6041
            ],
            [
                6041,
                6159
            ],
            [
                6159,
                6260
            ],
            [
                6260,
                6337
            ],
            [
                6337,
                6369
            ],
            [
                6369,
                6466
            ],
            [
                6466,
                6513
            ],
            [
                6513,
                6570
            ],
            [
                6570,
                6681
            ],
            [
                6681,
                6740
            ],
            [
                6740,
                6821
            ],
            [
                6821,
                6947
            ],
            [
                6947,
                7123
            ],
            [
                7123,
                7292
            ],
            [
                7292,
                7327
            ],
            [
                7327,
                7365
            ],
            [
                7365,
                7437
            ],
            [
                7437,
                7562
            ],
            [
                7562,
                7677
            ],
            [
                7677,
                7743
            ],
            [
                7743,
                7757
            ],
            [
                7757,
                7828
            ],
            [
                7828,
                7954
            ],
            [
                7954,
                8021
            ],
            [
                8021,
                8092
            ],
            [
                8092,
                8214
            ],
            [
                8214,
                8298
            ],
            [
                8298,
                8400
            ],
            [
                8400,
                8444
            ],
            [
                8444,
                8474
            ],
            [
                8474,
                8487
            ],
            [
                8487,
                8622
            ],
            [
                8622,
                8699
            ],
            [
                8699,
                8766
            ],
            [
                8766,
                8818
            ],
            [
                8818,
                8833
            ],
            [
                8833,
                8964
            ],
            [
                8964,
                9048
            ],
            [
                9048,
                9133
            ],
            [
                9133,
                9161
            ],
            [
                9161,
                9244
            ],
            [
                9244,
                9338
            ],
            [
                9338,
                9398
            ],
            [
                9398,
                9450
            ],
            [
                9450,
                9529
            ],
            [
                9529,
                9585
            ],
            [
                9585,
                9672
            ],
            [
                9672,
                9706
            ],
            [
                9706,
                9755
            ],
            [
                9755,
                9851
            ],
            [
                9851,
                10020
            ],
            [
                10020,
                10151
            ],
            [
                10151,
                10198
            ],
            [
                10198,
                10247
            ],
            [
                10247,
                10381
            ],
            [
                10381,
                10429
            ],
            [
                10429,
                10501
            ],
            [
                10501,
                10555
            ],
            [
                10555,
                10635
            ],
            [
                10635,
                10683
            ],
            [
                10683,
                10696
            ],
            [
                10696,
                10744
            ],
            [
                10744,
                10818
            ],
            [
                10818,
                10845
            ],
            [
                10845,
                10874
            ],
            [
                10874,
                10898
            ],
            [
                10898,
                10948
            ],
            [
                10948,
                11005
            ],
            [
                11005,
                11043
            ],
            [
                11043,
                11069
            ],
            [
                11069,
                11123
            ],
            [
                11123,
                11145
            ],
            [
                11145,
                11205
            ],
            [
                11205,
                11314
            ],
            [
                11314,
                11394
            ],
            [
                11394,
                11578
            ],
            [
                11578,
                11752
            ],
            [
                11752,
                12048
            ],
            [
                12048,
                12291
            ],
            [
                12291,
                12360
            ],
            [
                12360,
                12414
            ],
            [
                12414,
                12464
            ],
            [
                12464,
                12518
            ],
            [
                12518,
                12598
            ],
            [
                12598,
                12743
            ],
            [
                12743,
                12826
            ],
            [
                12826,
                13195
            ],
            [
                13195,
                13229
            ],
            [
                13229,
                13262
            ],
            [
                13262,
                13372
            ],
            [
                13372,
                13430
            ],
            [
                13430,
                13487
            ],
            [
                13487,
                13648
            ],
            [
                13648,
                13708
            ],
            [
                13708,
                13792
            ],
            [
                13792,
                13870
            ],
            [
                13870,
                13911
            ],
            [
                13911,
                13943
            ],
            [
                13943,
                13971
            ],
            [
                13971,
                14110
            ],
            [
                14110,
                14151
            ],
            [
                14151,
                14200
            ],
            [
                14200,
                14290
            ],
            [
                14290,
                14331
            ],
            [
                14331,
                14524
            ],
            [
                14524,
                14668
            ],
            [
                14668,
                14806
            ],
            [
                14806,
                14972
            ],
            [
                14972,
                15032
            ],
            [
                15032,
                15227
            ],
            [
                15227,
                15353
            ],
            [
                15353,
                15581
            ],
            [
                15581,
                15861
            ],
            [
                15861,
                15994
            ],
            [
                15994,
                16362
            ],
            [
                16362,
                16502
            ],
            [
                16502,
                16717
            ],
            [
                16717,
                16879
            ],
            [
                16879,
                16982
            ],
            [
                16982,
                17085
            ],
            [
                17085,
                17301
            ],
            [
                17301,
                17414
            ],
            [
                17414,
                17622
            ],
            [
                17622,
                17652
            ],
            [
                17652,
                17707
            ],
            [
                17707,
                17891
            ],
            [
                17891,
                17952
            ]
        ]
    },
    "abridged": {
        "text": "It has been said that George Vavasor had a little establishment at Roebury, in Oxfordshire; and he went there in the middle of November, to hunt. In this county, men spoke well of him, as one who knew how to ride.\nNot that Vavasor was popular among his fellow-sportsmen. He did not care for the loose talk of men when they meet in idleness. He was not open enough in his nature for popularity, and kept others at a distance. He had never been a jovial man. He always seemed to think that his conversations with men should serve some purpose of business. With women he was quite the reverse. With women he could be happy. A woman he could really love; but I doubt whether he could treat a woman well.\nHowever, he was welcome in Oxfordshire as a man who knew what he was about. There were several men who formed a kind of club at Roebury, travelling to the inn there from London for the hunting. They comprised a couple of brewers, a banker, a would-be attorney, a sporting literary gentleman, and a young unmarried Member of Parliament.\nThese men formed the Roebury Club at the King's Head, and a jolly life they had of it. They supplied their own game, while the landlord supplied everything else; and as they were not very particular about their bills, they were allowed to do pretty much as they liked. They were rather imperious, very late in their hours, and sometimes noisy; but they paid well, joked with the servants more than they bullied them, and on the whole were very popular.\nVavasor did not belong to this club, claiming that he could not afford it; when he visited the little town, he lodged elsewhere. But he occasionally went in, and would make up a table at whist.\nHe had come down to Roebury by mail train, ready for hunting the next morning, and walked into the club-room at midnight. There he found Maxwell the banker, Grindley the would-be attorney, and Calder Jones the Member of Parliament, playing dummy.\n\"Here's Vavasor,\" said Maxwell. \"Somebody told me, Vavasor, that you were gone away. Or that you were married, or dead. By George, I've lost the trick! I hate dummy. Yes, I know; that's seven points on each side. Vavasor, come and cut. If anyone had asked me, I should have said you were dead.\"\n\"But nobody ever does think of asking you anything.\"\n\"What you probably mean,\" said Grindley, \"is that Vavasor did not win the seat at Chelsea last February. Are you going to try it again, Vavasor?\"\n\"If you'll lend me the money I will.\"\n\"I don't see what a man gains by going into the House,\" said Calder Jones. \"I couldn't help myself, but it's a dead bore. It wouldn't do for me to give it up, because-\"\n\"Oh no, of course not; where should we all be?\" said Vavasor.\n\"It's you and me, Grindems,\" said Maxwell. \"D-- parliament, and now let's have a rubber of whist.\"\nThey played till three, and Mr. Calder Jones lost a good deal of money. Vavasor was the winner, and when he left the room he became the subject of some ill-natured remarks.\n\"I wonder he likes coming in here,\" said Grindley, the man who had first invited him to belong to the club, and who had hoped to become his friend.\n\"I can't understand it,\" said Calder Jones, a little bitter about his money. \"Last year he seemed to walk in just when he liked, as though he were one of us.\"\n\"He's a bad sort of fellow,\" said Grindley; \"I don't know where on earth he gets his money from. He was heir to some property in the north, but he lost every shilling in the wine trade.\"\n\"You're wrong there, Grindems,\" said Maxwell. \"He made a pot of money at the wine business.\"\n\"He's lost it all since then, and that place in the north into the bargain.\"\n\"Wrong again, Grindems, my boy. If old Vavasor were to die tomorrow, Vavasor Hall would go to him. He's the natural heir.\"\n\"All the same,\" said Calder Jones, \"isn't it rather odd he should come in here?\"\n\"We've asked him often enough,\" said Maxwell, \"to make up a rubber. I don't like George Vavasor; but I'd sooner play whist with men I don't like, than not play at all.\"\nThe club breakfasted the next morning at nine o'clock, in order to leave at half-past for the hunting meet at Edgehill. Edgehill is twelve miles from Roebury, and the horses would do it in an hour and a half.\n\"Does anybody know anything about that brown horse of Vavasor's?\" said Maxwell. \"I saw him in the yard yesterday with that old groom of his.\"\n\"He had a brown horse last season,\" said Grindley; \"a very fast little thing.\"\n\"That was a mare,\" said Maxwell, \"and he sold her to Cinquebars.\"\n\"For a hundred and fifty,\" said Calder Jones, \"and she wasn't worth it.\"\n\"He won seventy with her at Leamington,\" said Maxwell.\n\"Is Cinquebars coming down here this year?\"\n\"I don't know,\" said Maxwell. \"I hope not. He's the best fellow in the world, but he can't ride. I wish someone could tell me something about that fellow's brown horse.\"\n\"I'd never buy a horse of Vavasor's,\" said Grindley. \"He never has anything that's all right all round.\"\n\"And who has?\" said Maxwell, helping himself to a second mutton chop. \"You can't have perfect horses any more than perfect women. I never expect a perfect animal. I like 'em to see; I like 'em to have four legs, and decent lungs. I don't much mind about anything else.\"\n\"By Jove, you're right,\" said Calder Jones. The reader will see that Mr. Maxwell the banker reigned as king in that club.\nVavasor had sent two horses ahead in the charge of his old groom Bat Smithers, and followed on a big pony which he kept as a hack. He did not start till near ten, but he was able to catch Bat with his two horses about a mile outside Edgehill.\n\"Have you managed to come along pretty clean?\" the master asked as he joined his servant.\n\"They be the most beastly roads in all England,\" said Bat. \"I'm cleaner than most on 'em. But why any county should make such roads I never could tell.\"\n\"The roads are very bad, certainly. And what do you think of the brown horse, Bat?\"\n\"Well, sir.\" He said it with a drawl.\n\"He's as fine an animal to look at as ever I saw,\" said George.\n\"He's all that,\" said Bat.\n\"He's got lots of pace too.\"\n\"I'm sure he has, sir.\"\n\"And they tell me you can't beat him at jumping.\"\n\"They can mostly do that, sir, if they're well handled.\"\n\"You see he's a deal over my weight.\"\n\"Yes, he is, Mr. Vavasor. He is a fourteen stoner, or more.\"\nGeorge asked his groom no more questions, but felt sure that he had better sell his brown horse if he could. There was nothing specially amiss with the brown horse. He had gone lame at the end of the preceding season, and had been sold by some owner who had not cared to wait for a cure. Then there had gone with him a bad character, and a vague suspicion had attached itself to him, as it does to hundreds of horses which are very good animals in their way. Vavasor had bought him cheap, and found nothing amiss with him; but his character went with him, and therefore Bat Smithers thought it well to be knowing. George Vavasor knew as much of horses as most men, but he doubted his own knowledge. Therefore he took Bat's word and felt sure that something was wrong with the horse.\n\"We shall have a run from the big wood,\" said George. \"I'll ride the brown horse.\" Then the Roebury Club overtook them.\nThere was now a rush of horses on the road to Edgehill church. Bat, with his two hunters, fell a little behind, and the others trotted on together.\n\"Are you well mounted this year?\" Maxwell asked George Vavasor.\n\"No, indeed; I generally have one horse and three or four cripples. That brown horse behind there is pretty good, I believe.\"\n\"I see your man has got the old chestnut mare.\"\n\"She's one of the cripples - sound as a bell, and a good hunter; but she makes a noise when she's going.\"\n\"So that you can hear her three fields off,\" said Grindley.\n\"Five if the fields are small enough,\" said Vavasor. \"All the same I wouldn't change her for the best horse I ever saw under you.\"\n\"Had you there, Grindems,\" said Maxwell.\n\"No, he didn't,\" said Grindley.\n\"Your horses, Grindley, are up to all the work they have to do,\" said George; \"and I don't know what any man wants more than that.\"\n\"Had you again, Grindems,\" said Maxwell.\n\"I can ride against him any day,\" said Grindley. And he trotted round the corner by the church, and into the field in which the hounds were assembled, to escape. Had it been Vavasor alone he would have turned upon him and snarled, but he could not afford to exhibit any ill temper to the king of the club. Mr. Grindley was not popular, and he did not wish Maxwell to turn openly against him.\nGrindley was a rich enough man, and not ignorant, or a fool; whereas I rather think Maxwell was a fool. Grindley had made his own way in the world, but Maxwell would certainly not have made a banker if his father had not been a banker before him; there were many better men of business. Grindley knew this, yet he allowed Maxwell to snub him. Maxwell was not even a better rider; but one looked imposing and the other insignificant. So Maxwell held dominion over him.\n\"By George, there's Pollock!\" said Maxwell, as he rode into the field. \"I'll bet half a crown that he's come down from London this morning, that he was up all night, and that he tells us so three times before the hounds leave the paddock.\" Mr. Pollock was the heavy-weight sporting literary gentleman.",
        "paragraph_chars": [
            [
                0,
                214
            ],
            [
                214,
                700
            ],
            [
                700,
                1036
            ],
            [
                1036,
                1489
            ],
            [
                1489,
                1683
            ],
            [
                1683,
                1930
            ],
            [
                1930,
                2225
            ],
            [
                2225,
                2278
            ],
            [
                2278,
                2424
            ],
            [
                2424,
                2462
            ],
            [
                2462,
                2631
            ],
            [
                2631,
                2693
            ],
            [
                2693,
                2792
            ],
            [
                2792,
                2965
            ],
            [
                2965,
                3113
            ],
            [
                3113,
                3272
            ],
            [
                3272,
                3459
            ],
            [
                3459,
                3552
            ],
            [
                3552,
                3629
            ],
            [
                3629,
                3752
            ],
            [
                3752,
                3833
            ],
            [
                3833,
                4002
            ],
            [
                4002,
                4211
            ],
            [
                4211,
                4353
            ],
            [
                4353,
                4432
            ],
            [
                4432,
                4498
            ],
            [
                4498,
                4571
            ],
            [
                4571,
                4626
            ],
            [
                4626,
                4670
            ],
            [
                4670,
                4840
            ],
            [
                4840,
                4945
            ],
            [
                4945,
                5215
            ],
            [
                5215,
                5337
            ],
            [
                5337,
                5580
            ],
            [
                5580,
                5670
            ],
            [
                5670,
                5823
            ],
            [
                5823,
                5907
            ],
            [
                5907,
                5945
            ],
            [
                5945,
                6009
            ],
            [
                6009,
                6036
            ],
            [
                6036,
                6065
            ],
            [
                6065,
                6089
            ],
            [
                6089,
                6139
            ],
            [
                6139,
                6196
            ],
            [
                6196,
                6234
            ],
            [
                6234,
                6295
            ],
            [
                6295,
                7078
            ],
            [
                7078,
                7198
            ],
            [
                7198,
                7346
            ],
            [
                7346,
                7410
            ],
            [
                7410,
                7536
            ],
            [
                7536,
                7584
            ],
            [
                7584,
                7690
            ],
            [
                7690,
                7750
            ],
            [
                7750,
                7881
            ],
            [
                7881,
                7922
            ],
            [
                7922,
                7954
            ],
            [
                7954,
                8086
            ],
            [
                8086,
                8127
            ],
            [
                8127,
                8519
            ],
            [
                8519,
                8987
            ],
            [
                8987,
                9288
            ]
        ],
        "segment_chars": [
            [
                0,
                146
            ],
            [
                146,
                214
            ],
            [
                214,
                271
            ],
            [
                271,
                341
            ],
            [
                341,
                425
            ],
            [
                425,
                457
            ],
            [
                457,
                554
            ],
            [
                554,
                591
            ],
            [
                591,
                621
            ],
            [
                621,
                700
            ],
            [
                700,
                776
            ],
            [
                776,
                894
            ],
            [
                894,
                1036
            ],
            [
                1036,
                1123
            ],
            [
                1123,
                1305
            ],
            [
                1305,
                1489
            ],
            [
                1489,
                1618
            ],
            [
                1618,
                1683
            ],
            [
                1683,
                1805
            ],
            [
                1805,
                1930
            ],
            [
                1930,
                1962
            ],
            [
                1962,
                2015
            ],
            [
                2015,
                2050
            ],
            [
                2050,
                2082
            ],
            [
                2082,
                2096
            ],
            [
                2096,
                2143
            ],
            [
                2143,
                2166
            ],
            [
                2166,
                2225
            ],
            [
                2225,
                2278
            ],
            [
                2278,
                2383
            ],
            [
                2383,
                2424
            ],
            [
                2424,
                2462
            ],
            [
                2462,
                2537
            ],
            [
                2537,
                2584
            ],
            [
                2584,
                2631
            ],
            [
                2631,
                2679
            ],
            [
                2679,
                2693
            ],
            [
                2693,
                2736
            ],
            [
                2736,
                2792
            ],
            [
                2792,
                2864
            ],
            [
                2864,
                2965
            ],
            [
                2965,
                3113
            ],
            [
                3113,
                3190
            ],
            [
                3190,
                3272
            ],
            [
                3272,
                3369
            ],
            [
                3369,
                3459
            ],
            [
                3459,
                3505
            ],
            [
                3505,
                3552
            ],
            [
                3552,
                3629
            ],
            [
                3629,
                3661
            ],
            [
                3661,
                3728
            ],
            [
                3728,
                3752
            ],
            [
                3752,
                3833
            ],
            [
                3833,
                3901
            ],
            [
                3901,
                4002
            ],
            [
                4002,
                4122
            ],
            [
                4122,
                4211
            ],
            [
                4211,
                4277
            ],
            [
                4277,
                4291
            ],
            [
                4291,
                4353
            ],
            [
                4353,
                4432
            ],
            [
                4432,
                4498
            ],
            [
                4498,
                4571
            ],
            [
                4571,
                4626
            ],
            [
                4626,
                4670
            ],
            [
                4670,
                4700
            ],
            [
                4700,
                4713
            ],
            [
                4713,
                4767
            ],
            [
                4767,
                4840
            ],
            [
                4840,
                4893
            ],
            [
                4893,
                4945
            ],
            [
                4945,
                4960
            ],
            [
                4960,
                5015
            ],
            [
                5015,
                5075
            ],
            [
                5075,
                5108
            ],
            [
                5108,
                5175
            ],
            [
                5175,
                5215
            ],
            [
                5215,
                5259
            ],
            [
                5259,
                5337
            ],
            [
                5337,
                5468
            ],
            [
                5468,
                5580
            ],
            [
                5580,
                5627
            ],
            [
                5627,
                5670
            ],
            [
                5670,
                5729
            ],
            [
                5729,
                5760
            ],
            [
                5760,
                5823
            ],
            [
                5823,
                5859
            ],
            [
                5859,
                5907
            ],
            [
                5907,
                5920
            ],
            [
                5920,
                5945
            ],
            [
                5945,
                6009
            ],
            [
                6009,
                6036
            ],
            [
                6036,
                6065
            ],
            [
                6065,
                6089
            ],
            [
                6089,
                6139
            ],
            [
                6139,
                6196
            ],
            [
                6196,
                6234
            ],
            [
                6234,
                6260
            ],
            [
                6260,
                6295
            ],
            [
                6295,
                6404
            ],
            [
                6404,
                6460
            ],
            [
                6460,
                6583
            ],
            [
                6583,
                6754
            ],
            [
                6754,
                6909
            ],
            [
                6909,
                6994
            ],
            [
                6994,
                7078
            ],
            [
                7078,
                7132
            ],
            [
                7132,
                7161
            ],
            [
                7161,
                7198
            ],
            [
                7198,
                7261
            ],
            [
                7261,
                7346
            ],
            [
                7346,
                7380
            ],
            [
                7380,
                7410
            ],
            [
                7410,
                7478
            ],
            [
                7478,
                7536
            ],
            [
                7536,
                7584
            ],
            [
                7584,
                7690
            ],
            [
                7690,
                7750
            ],
            [
                7750,
                7803
            ],
            [
                7803,
                7881
            ],
            [
                7881,
                7922
            ],
            [
                7922,
                7954
            ],
            [
                7954,
                8086
            ],
            [
                8086,
                8127
            ],
            [
                8127,
                8176
            ],
            [
                8176,
                8289
            ],
            [
                8289,
                8433
            ],
            [
                8433,
                8519
            ],
            [
                8519,
                8623
            ],
            [
                8623,
                8806
            ],
            [
                8806,
                8862
            ],
            [
                8862,
                8952
            ],
            [
                8952,
                8987
            ],
            [
                8987,
                9017
            ],
            [
                9017,
                9058
            ],
            [
                9058,
                9227
            ],
            [
                9227,
                9288
            ]
        ],
        "overlap_chars": [
            [
                0,
                75
            ],
            [
                76,
                90
            ],
            [
                92,
                95
            ],
            [
                96,
                98
            ],
            [
                113,
                135
            ],
            [
                135,
                136
            ],
            [
                144,
                146
            ],
            [
                146,
                160
            ],
            [
                160,
                183
            ],
            [
                183,
                212
            ],
            [
                212,
                213
            ],
            [
                214,
                248
            ],
            [
                253,
                271
            ],
            [
                271,
                281
            ],
            [
                282,
                300
            ],
            [
                301,
                305
            ],
            [
                306,
                327
            ],
            [
                328,
                341
            ],
            [
                341,
                381
            ],
            [
                382,
                392
            ],
            [
                392,
                397
            ],
            [
                398,
                402
            ],
            [
                403,
                409
            ],
            [
                410,
                425
            ],
            [
                425,
                457
            ],
            [
                457,
                487
            ],
            [
                488,
                514
            ],
            [
                515,
                521
            ],
            [
                528,
                554
            ],
            [
                554,
                591
            ],
            [
                591,
                621
            ],
            [
                621,
                650
            ],
            [
                651,
                670
            ],
            [
                671,
                700
            ],
            [
                707,
                708
            ],
            [
                709,
                715
            ],
            [
                716,
                723
            ],
            [
                724,
                726
            ],
            [
                727,
                738
            ],
            [
                739,
                774
            ],
            [
                774,
                776
            ],
            [
                776,
                786
            ],
            [
                795,
                802
            ],
            [
                810,
                824
            ],
            [
                825,
                835
            ],
            [
                835,
                836
            ],
            [
                848,
                850
            ],
            [
                851,
                854
            ],
            [
                865,
                876
            ],
            [
                885,
                892
            ],
            [
                892,
                893
            ],
            [
                909,
                910
            ],
            [
                918,
                920
            ],
            [
                928,
                929
            ],
            [
                930,
                939
            ],
            [
                940,
                950
            ],
            [
                951,
                1034
            ],
            [
                1036,
                1069
            ],
            [
                1088,
                1123
            ],
            [
                1123,
                1127
            ],
            [
                1128,
                1151
            ],
            [
                1151,
                1152
            ],
            [
                1159,
                1171
            ],
            [
                1181,
                1303
            ],
            [
                1303,
                1305
            ],
            [
                1305,
                1358
            ],
            [
                1359,
                1362
            ],
            [
                1363,
                1372
            ],
            [
                1373,
                1378
            ],
            [
                1380,
                1399
            ],
            [
                1411,
                1423
            ],
            [
                1429,
                1489
            ],
            [
                1489,
                1511
            ],
            [
                1512,
                1524
            ],
            [
                1524,
                1525
            ],
            [
                1535,
                1559
            ],
            [
                1580,
                1595
            ],
            [
                1595,
                1596
            ],
            [
                1597,
                1616
            ],
            [
                1616,
                1618
            ],
            [
                1618,
                1645
            ],
            [
                1645,
                1664
            ],
            [
                1665,
                1683
            ],
            [
                1683,
                1791
            ],
            [
                1792,
                1805
            ],
            [
                1805,
                1861
            ],
            [
                1862,
                1929
            ],
            [
                1930,
                1960
            ],
            [
                1960,
                1962
            ],
            [
                1963,
                2013
            ],
            [
                2015,
                2017
            ],
            [
                2018,
                2048
            ],
            [
                2048,
                2050
            ],
            [
                2050,
                2080
            ],
            [
                2080,
                2082
            ],
            [
                2082,
                2094
            ],
            [
                2094,
                2096
            ],
            [
                2096,
                2143
            ],
            [
                2143,
                2166
            ],
            [
                2166,
                2168
            ],
            [
                2176,
                2225
            ],
            [
                2225,
                2229
            ],
            [
                2230,
                2278
            ],
            [
                2278,
                2335
            ],
            [
                2340,
                2343
            ],
            [
                2360,
                2381
            ],
            [
                2381,
                2383
            ],
            [
                2383,
                2424
            ],
            [
                2424,
                2462
            ],
            [
                2462,
                2479
            ],
            [
                2480,
                2537
            ],
            [
                2537,
                2560
            ],
            [
                2560,
                2565
            ],
            [
                2566,
                2572
            ],
            [
                2578,
                2584
            ],
            [
                2584,
                2628
            ],
            [
                2631,
                2679
            ],
            [
                2679,
                2693
            ],
            [
                2693,
                2736
            ],
            [
                2736,
                2738
            ],
            [
                2741,
                2780
            ],
            [
                2789,
                2792
            ],
            [
                2792,
                2814
            ],
            [
                2814,
                2815
            ],
            [
                2816,
                2862
            ],
            [
                2862,
                2864
            ],
            [
                2864,
                2965
            ],
            [
                2965,
                3015
            ],
            [
                3016,
                3023
            ],
            [
                3024,
                3031
            ],
            [
                3046,
                3084
            ],
            [
                3091,
                3093
            ],
            [
                3111,
                3113
            ],
            [
                3113,
                3156
            ],
            [
                3157,
                3190
            ],
            [
                3190,
                3272
            ],
            [
                3272,
                3317
            ],
            [
                3317,
                3367
            ],
            [
                3367,
                3368
            ],
            [
                3369,
                3388
            ],
            [
                3389,
                3438
            ],
            [
                3439,
                3459
            ],
            [
                3459,
                3503
            ],
            [
                3503,
                3505
            ],
            [
                3505,
                3549
            ],
            [
                3549,
                3552
            ],
            [
                3552,
                3629
            ],
            [
                3629,
                3661
            ],
            [
                3661,
                3687
            ],
            [
                3696,
                3719
            ],
            [
                3720,
                3722
            ],
            [
                3726,
                3728
            ],
            [
                3728,
                3749
            ],
            [
                3749,
                3752
            ],
            [
                3752,
                3833
            ],
            [
                3833,
                3877
            ],
            [
                3877,
                3878
            ],
            [
                3879,
                3880
            ],
            [
                3880,
                3901
            ],
            [
                3901,
                3928
            ],
            [
                3928,
                3933
            ],
            [
                3934,
                3978
            ],
            [
                3979,
                3983
            ],
            [
                3984,
                4001
            ],
            [
                4002,
                4065
            ],
            [
                4075,
                4095
            ],
            [
                4104,
                4122
            ],
            [
                4122,
                4168
            ],
            [
                4176,
                4209
            ],
            [
                4209,
                4210
            ],
            [
                4211,
                4277
            ],
            [
                4277,
                4291
            ],
            [
                4291,
                4301
            ],
            [
                4305,
                4353
            ],
            [
                4353,
                4403
            ],
            [
                4404,
                4406
            ],
            [
                4407,
                4416
            ],
            [
                4417,
                4429
            ],
            [
                4429,
                4432
            ],
            [
                4432,
                4497
            ],
            [
                4498,
                4565
            ],
            [
                4568,
                4571
            ],
            [
                4571,
                4624
            ],
            [
                4626,
                4670
            ],
            [
                4670,
                4700
            ],
            [
                4700,
                4713
            ],
            [
                4713,
                4765
            ],
            [
                4765,
                4767
            ],
            [
                4767,
                4773
            ],
            [
                4782,
                4840
            ],
            [
                4840,
                4875
            ],
            [
                4875,
                4893
            ],
            [
                4893,
                4945
            ],
            [
                4945,
                4960
            ],
            [
                4960,
                4973
            ],
            [
                4993,
                5013
            ],
            [
                5013,
                5015
            ],
            [
                5016,
                5059
            ],
            [
                5060,
                5075
            ],
            [
                5075,
                5108
            ],
            [
                5108,
                5155
            ],
            [
                5157,
                5160
            ],
            [
                5173,
                5175
            ],
            [
                5175,
                5192
            ],
            [
                5199,
                5215
            ],
            [
                5215,
                5223
            ],
            [
                5225,
                5231
            ],
            [
                5232,
                5259
            ],
            [
                5259,
                5274
            ],
            [
                5275,
                5337
            ],
            [
                5337,
                5364
            ],
            [
                5371,
                5373
            ],
            [
                5374,
                5377
            ],
            [
                5378,
                5387
            ],
            [
                5402,
                5433
            ],
            [
                5438,
                5442
            ],
            [
                5443,
                5451
            ],
            [
                5457,
                5461
            ],
            [
                5462,
                5466
            ],
            [
                5466,
                5468
            ],
            [
                5468,
                5561
            ],
            [
                5570,
                5579
            ],
            [
                5580,
                5627
            ],
            [
                5627,
                5649
            ],
            [
                5657,
                5670
            ],
            [
                5670,
                5727
            ],
            [
                5727,
                5729
            ],
            [
                5729,
                5730
            ],
            [
                5730,
                5760
            ],
            [
                5768,
                5801
            ],
            [
                5802,
                5823
            ],
            [
                5823,
                5833
            ],
            [
                5834,
                5837
            ],
            [
                5838,
                5842
            ],
            [
                5843,
                5857
            ],
            [
                5857,
                5859
            ],
            [
                5859,
                5907
            ],
            [
                5907,
                5920
            ],
            [
                5920,
                5927
            ],
            [
                5931,
                5945
            ],
            [
                5945,
                5989
            ],
            [
                5993,
                6009
            ],
            [
                6009,
                6036
            ],
            [
                6036,
                6065
            ],
            [
                6065,
                6089
            ],
            [
                6089,
                6139
            ],
            [
                6139,
                6196
            ],
            [
                6196,
                6234
            ],
            [
                6234,
                6260
            ],
            [
                6260,
                6283
            ],
            [
                6285,
                6287
            ],
            [
                6292,
                6295
            ],
            [
                6295,
                6404
            ],
            [
                6404,
                6460
            ],
            [
                6460,
                6466
            ],
            [
                6472,
                6476
            ],
            [
                6480,
                6511
            ],
            [
                6511,
                6544
            ],
            [
                6545,
                6583
            ],
            [
                6583,
                6681
            ],
            [
                6685,
                6754
            ],
            [
                6754,
                6783
            ],
            [
                6784,
                6787
            ],
            [
                6788,
                6816
            ],
            [
                6818,
                6909
            ],
            [
                6909,
                6958
            ],
            [
                6958,
                6959
            ],
            [
                6960,
                6966
            ],
            [
                6967,
                6992
            ],
            [
                6992,
                6994
            ],
            [
                6994,
                7041
            ],
            [
                7052,
                7061
            ],
            [
                7067,
                7076
            ],
            [
                7076,
                7078
            ],
            [
                7078,
                7131
            ],
            [
                7132,
                7133
            ],
            [
                7133,
                7158
            ],
            [
                7161,
                7165
            ],
            [
                7166,
                7198
            ],
            [
                7198,
                7240
            ],
            [
                7241,
                7243
            ],
            [
                7244,
                7259
            ],
            [
                7259,
                7261
            ],
            [
                7261,
                7264
            ],
            [
                7266,
                7286
            ],
            [
                7288,
                7345
            ],
            [
                7346,
                7380
            ],
            [
                7380,
                7393
            ],
            [
                7394,
                7410
            ],
            [
                7410,
                7422
            ],
            [
                7423,
                7478
            ],
            [
                7478,
                7536
            ],
            [
                7536,
                7581
            ],
            [
                7581,
                7584
            ],
            [
                7584,
                7610
            ],
            [
                7613,
                7633
            ],
            [
                7634,
                7635
            ],
            [
                7636,
                7640
            ],
            [
                7641,
                7647
            ],
            [
                7647,
                7664
            ],
            [
                7665,
                7690
            ],
            [
                7690,
                7750
            ],
            [
                7750,
                7779
            ],
            [
                7780,
                7803
            ],
            [
                7803,
                7881
            ],
            [
                7881,
                7922
            ],
            [
                7922,
                7953
            ],
            [
                7954,
                7981
            ],
            [
                7982,
                8086
            ],
            [
                8086,
                8127
            ],
            [
                8127,
                8175
            ],
            [
                8176,
                8182
            ],
            [
                8183,
                8190
            ],
            [
                8191,
                8276
            ],
            [
                8276,
                8277
            ],
            [
                8278,
                8289
            ],
            [
                8289,
                8433
            ],
            [
                8433,
                8466
            ],
            [
                8483,
                8517
            ],
            [
                8517,
                8519
            ],
            [
                8519,
                8538
            ],
            [
                8539,
                8545
            ],
            [
                8546,
                8550
            ],
            [
                8555,
                8579
            ],
            [
                8588,
                8623
            ],
            [
                8623,
                8708
            ],
            [
                8709,
                8765
            ],
            [
                8766,
                8771
            ],
            [
                8772,
                8776
            ],
            [
                8782,
                8804
            ],
            [
                8804,
                8806
            ],
            [
                8806,
                8819
            ],
            [
                8824,
                8825
            ],
            [
                8826,
                8860
            ],
            [
                8860,
                8862
            ],
            [
                8870,
                8877
            ],
            [
                8903,
                8906
            ],
            [
                8923,
                8926
            ],
            [
                8927,
                8952
            ],
            [
                8963,
                8967
            ],
            [
                8968,
                8976
            ],
            [
                8977,
                8981
            ],
            [
                8985,
                8987
            ],
            [
                8987,
                9017
            ],
            [
                9017,
                9056
            ],
            [
                9056,
                9058
            ],
            [
                9058,
                9151
            ],
            [
                9151,
                9206
            ],
            [
                9213,
                9227
            ],
            [
                9227,
                9288
            ]
        ],
        "row_chars": [
            [
                0,
                146
            ],
            [
                146,
                214
            ],
            [
                214,
                271
            ],
            [
                271,
                271
            ],
            [
                271,
                271
            ],
            [
                271,
                341
            ],
            [
                341,
                425
            ],
            [
                425,
                457
            ],
            [
                457,
                554
            ],
            [
                554,
                591
            ],
            [
                591,
                621
            ],
            [
                621,
                621
            ],
            [
                621,
                700
            ],
            [
                700,
                776
            ],
            [
                776,
                776
            ],
            [
                776,
                776
            ],
            [
                776,
                776
            ],
            [
                776,
                776
            ],
            [
                776,
                776
            ],
            [
                776,
                776
            ],
            [
                776,
                776
            ],
            [
                776,
                1036
            ],
            [
                1036,
                1123
            ],
            [
                1123,
                1305
            ],
            [
                1305,
                1489
            ],
            [
                1489,
                1618
            ],
            [
                1618,
                1683
            ],
            [
                1683,
                1805
            ],
            [
                1805,
                1930
            ],
            [
                1930,
                1930
            ],
            [
                1930,
                1962
            ],
            [
                1962,
                2015
            ],
            [
                2015,
                2015
            ],
            [
                2015,
                2050
            ],
            [
                2050,
                2082
            ],
            [
                2082,
                2096
            ],
            [
                2096,
                2096
            ],
            [
                2096,
                2143
            ],
            [
                2143,
                2166
            ],
            [
                2166,
                2225
            ],
            [
                2225,
                2278
            ],
            [
                2278,
                2383
            ],
            [
                2383,
                2424
            ],
            [
                2424,
                2462
            ],
            [
                2462,
                2537
            ],
            [
                2537,
                2584
            ],
            [
                2584,
                2584
            ],
            [
                2584,
                2631
            ],
            [
                2631,
                2679
            ],
            [
                2679,
                2693
            ],
            [
                2693,
                2736
            ],
            [
                2736,
                2792
            ],
            [
                2792,
                2864
            ],
            [
                2864,
                2965
            ],
            [
                2965,
                3113
            ],
            [
                3113,
                3190
            ],
            [
                3190,
                3272
            ],
            [
                3272,
                3459
            ],
            [
                3459,
                3505
            ],
            [
                3505,
                3552
            ],
            [
                3552,
                3629
            ],
            [
                3629,
                3661
            ],
            [
                3661,
                3728
            ],
            [
                3728,
                3728
            ],
            [
                3728,
                3728
            ],
            [
                3728,
                3728
            ],
            [
                3728,
                3752
            ],
            [
                3752,
                3833
            ],
            [
                3833,
                3901
            ],
            [
                3901,
                4002
            ],
            [
                4002,
                4002
            ],
            [
                4002,
                4002
            ],
            [
                4002,
                4002
            ],
            [
                4002,
                4002
            ],
            [
                4002,
                4122
            ],
            [
                4122,
                4211
            ],
            [
                4211,
                4277
            ],
            [
                4277,
                4291
            ],
            [
                4291,
                4353
            ],
            [
                4353,
                4432
            ],
            [
                4432,
                4498
            ],
            [
                4498,
                4498
            ],
            [
                4498,
                4498
            ],
            [
                4498,
                4571
            ],
            [
                4571,
                4626
            ],
            [
                4626,
                4670
            ],
            [
                4670,
                4700
            ],
            [
                4700,
                4713
            ],
            [
                4713,
                4767
            ],
            [
                4767,
                4840
            ],
            [
                4840,
                4893
            ],
            [
                4893,
                4945
            ],
            [
                4945,
                4960
            ],
            [
                4960,
                5015
            ],
            [
                5015,
                5015
            ],
            [
                5015,
                5015
            ],
            [
                5015,
                5015
            ],
            [
                5015,
                5075
            ],
            [
                5075,
                5075
            ],
            [
                5075,
                5075
            ],
            [
                5075,
                5075
            ],
            [
                5075,
                5075
            ],
            [
                5075,
                5108
            ],
            [
                5108,
                5175
            ],
            [
                5175,
                5215
            ],
            [
                5215,
                5259
            ],
            [
                5259,
                5337
            ],
            [
                5337,
                5468
            ],
            [
                5468,
                5580
            ],
            [
                5580,
                5627
            ],
            [
                5627,
                5670
            ],
            [
                5670,
                5729
            ],
            [
                5729,
                5760
            ],
            [
                5760,
                5823
            ],
            [
                5823,
                5859
            ],
            [
                5859,
                5859
            ],
            [
                5859,
                5907
            ],
            [
                5907,
                5920
            ],
            [
                5920,
                5945
            ],
            [
                5945,
                6009
            ],
            [
                6009,
                6036
            ],
            [
                6036,
                6065
            ],
            [
                6065,
                6089
            ],
            [
                6089,
                6139
            ],
            [
                6139,
                6196
            ],
            [
                6196,
                6234
            ],
            [
                6234,
                6260
            ],
            [
                6260,
                6295
            ],
            [
                6295,
                6295
            ],
            [
                6295,
                6295
            ],
            [
                6295,
                6404
            ],
            [
                6404,
                6460
            ],
            [
                6460,
                6583
            ],
            [
                6583,
                6754
            ],
            [
                6754,
                6909
            ],
            [
                6909,
                6994
            ],
            [
                6994,
                7078
            ],
            [
                7078,
                7132
            ],
            [
                7132,
                7132
            ],
            [
                7132,
                7161
            ],
            [
                7161,
                7198
            ],
            [
                7198,
                7261
            ],
            [
                7261,
                7346
            ],
            [
                7346,
                7346
            ],
            [
                7346,
                7380
            ],
            [
                7380,
                7410
            ],
            [
                7410,
                7478
            ],
            [
                7478,
                7536
            ],
            [
                7536,
                7584
            ],
            [
                7584,
                7690
            ],
            [
                7690,
                7750
            ],
            [
                7750,
                7803
            ],
            [
                7803,
                7881
            ],
            [
                7881,
                7922
            ],
            [
                7922,
                7954
            ],
            [
                7954,
                7954
            ],
            [
                7954,
                8086
            ],
            [
                8086,
                8127
            ],
            [
                8127,
                8176
            ],
            [
                8176,
                8176
            ],
            [
                8176,
                8176
            ],
            [
                8176,
                8289
            ],
            [
                8289,
                8433
            ],
            [
                8433,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8519
            ],
            [
                8519,
                8623
            ],
            [
                8623,
                8806
            ],
            [
                8806,
                8862
            ],
            [
                8862,
                8952
            ],
            [
                8952,
                8987
            ],
            [
                8987,
                8987
            ],
            [
                8987,
                8987
            ],
            [
                8987,
                8987
            ],
            [
                8987,
                8987
            ],
            [
                8987,
                8987
            ],
            [
                8987,
                8987
            ],
            [
                8987,
                8987
            ],
            [
                8987,
                9017
            ],
            [
                9017,
                9058
            ],
            [
                9058,
                9227
            ],
            [
                9227,
                9288
            ]
        ]
    }
}