{
    "original": {
        "text": "The next day was Sunday, and it was well known at the lodging-house in the Close that Mr. Cheesacre would not be seen there then. Mrs. Greenow had specially warned him that she was not fond of Sunday visitors, fearing that otherwise he might find it convenient to give them too much of his society on that idle day. In the morning the aunt and niece both went to the Cathedral, and then at three o'clock they dined. But on this occasion they did not dine alone. Charlie Fairstairs, who, with her family, had come home from Yarmouth, had been asked to join them; and in order that Charlie might not feel it dull, Mrs. Greenow had, with her usual good-nature, invited Captain Bellfield. A very nice little dinner they had. The captain carved the turkey, giving due honour to Mr. Cheesacre as he did so; and when he nibbled his celery with his cheese, he was prettily jocose about the richness of the farmyard at Oileymead.\n\"He is the most generous man I ever met,\" said Mrs. Greenow.\n\"So he is,\" said Captain Bellfield, \"and we'll drink his health. Poor old Cheesy! It's a great pity he shouldn't get himself a wife.\"\n\"I don't know any man more calculated to make a young woman happy,\" said Mrs. Greenow.\n\"No, indeed,\" said Miss Fairstairs. \"I'm told that his house and all about it is quite beautiful.\"\n\"Especially the straw-yard and the horse-pond,\" said the Captain. And then they drank the health of their absent friend.\nIt had been arranged that the ladies should go to church in the evening, and it was thought that Captain Bellfield would, perhaps, accompany them; but when the time for starting came, Kate and Charlie were ready, but the widow was not, and she remained,--in order, as she afterwards explained to Kate, that Captain Bellfield might not seem to be turned out of the house. He had made no offer churchwards, and,--\"Poor man,\" as Mrs. Greenow said in her little explanation, \"if I hadn't let him stay there, he would have had no resting-place for the sole of his foot, but some horrid barrack-room!\" Therefore the Captain was allowed to find a resting-place in Mrs. Greenow's drawing-room; but on the return of the young ladies from church, he was not there, and the widow was alone, \"looking back,\" she said, \"to things that were gone;--that were gone. But come, dears, I am not going to make you melancholy.\" So they had tea, and Mr. Cheesacre's cream was used with liberality.\nCaptain Bellfield had not allowed the opportunity to slip idly from his hands. In the first quarter of an hour after the younger ladies had gone, he said little or nothing, but sat with a wine-glass before him, which once or twice he filled from the decanter. \"I'm afraid the wine is not very good,\" said Mrs. Greenow. \"But one can't get good wine in lodgings.\"\n\"I'm not thinking very much about it, Mrs. Greenow; that's the truth,\" said the Captain. \"I daresay the wine is very good of its kind.\" Then there was another period of silence between them.\n\"I suppose you find it rather dull, living in lodgings; don't you?\" asked the Captain.\n\"I don't know quite what you mean by dull, Captain Bellfield; but a woman circumstanced as I am, can't find her life very gay. It's not a full twelvemonth yet since I lost all that made life desirable, and sometimes I wonder at myself for holding up as well as I do.\"\n\"It's wicked to give way to grief too much, Mrs. Greenow.\"\n\"That's what my dear Kate always says to me, and I'm sure I do my best to overcome it.\" Upon this soft tears trickled down her cheek, showing in their course that she at any rate used no paint in producing that freshness of colour which was one of her great charms. Then she pressed her handkerchief to her eyes, and removing it, smiled faintly on the Captain. \"I didn't intend to treat you to such a scene as this, Captain Bellfield.\"\n\"There is nothing on earth, Mrs. Greenow, I desire so much, as permission to dry those tears.\"\n\"Time alone can do that, Captain Bellfield;--time alone.\"\n\"But cannot time be aided by love and friendship and affection?\"\n\"By friendship, yes. What would life be worth without the solace of friendship?\"\n\"And how much better is the warm glow of love?\" Captain Bellfield, as he asked this question, deliberately got up, and moved his chair over to the widow's side. But the widow as deliberately changed her position to the corner of a sofa. The Captain did not at once follow her, nor did he in any way show that he was aware that she had fled from him.\n\"How much better is the warm glow of love?\" he said again, contenting himself with looking into her face with all his eyes. He had hoped that he would have been able to press her hand by this time.\n\"The warm, glow of love, Captain Bellfield, if you have ever felt it--\"\n\"If I have ever felt it! Do I not feel it now, Mrs. Greenow? There can be no longer any mask kept upon my feelings. I never could restrain the yearnings of my heart when they have been strong.\"\n\"Have they often been strong, Captain Bellfield?\"\n\"Yes; often;--in various scenes of life; on the field of battle--\"\n\"I did not know that you had seen active service.\"\n\"What!--not on the plains of Zuzuland, when with fifty picked men I kept five hundred Caffres at bay for seven weeks;--never knew the comfort of a bed, or a pillow to my head, for seven long weeks!\"\n\"Not for seven weeks?\" said Mrs. Greenow.\n\"No. Did I not see active service at Essiquebo, on the burning coast of Guiana, when all the wild Africans from the woods rose up to destroy the colony; or again at the mouth of the Kitchyhomy River, when I made good the capture of a slaver by my own hand and my own sword!\"\n\"I really hadn't heard,\" said Mrs. Greenow.\n\"Ah, I understand. I know. Cheesy is the best fellow in the world in some respects, but he cannot bring himself to speak well of a fellow behind his back. I know who has belittled me. Who was the first to storm the heights of Inkerman?\" demanded the Captain, thinking in the heat of the moment that he might as well be hung for a sheep as a lamb.\n\"But when you spoke of yearnings, I thought you meant yearnings of a softer kind.\"\n\"So I did. So I did. I don't know why I have been led away to speak of deeds that are very seldom mentioned, at any rate by myself. But I cannot bear that a slanderous backbiting tongue should make you think that I have seen no service. I have served her Majesty in the four quarters of the globe, Mrs. Greenow; and now I am ready to serve you in any way in which you will allow me to make my service acceptable.\" Whereupon he took one stride over to the sofa, and went down upon his knees before her.\n\"But, Captain Bellfield, I don't want any services. Pray get up now; the girl will come in.\"\n\"I care nothing for any girl. I am planted here till some answer shall have been made to me; till some word shall have been said that may give me a little hope.\" Then he attempted to get hold of her hand, but she put them behind her back and shook her head. \"Arabella,\" he said, \"will you not speak a word to me?\"\n\"Not a word, Captain Bellfield, till you get up; and I won't have you call me Arabella. I am the widow of Samuel Greenow, than whom no man was more respected where he was known, and it is not fitting that I should be addressed in that way.\"\n\"But I want you to become my wife,--and then--\"\n\"Ah, then indeed! But that then isn't likely to come. Get up, Captain Bellfield, or I'll push you over and then ring the bell. A man never looks so much like a fool as when he's kneeling down,--unless he's saying his prayers, as you ought to be doing now. Get up, I tell you. It's just half past seven, and I told Jeannette to come to me then.\"\nThere was that in the widow's voice which made him get up, and he rose slowly to his feet. \"You've pushed all the chairs about, you stupid man,\" she said. Then in one minute she had restored the scattered furniture to their proper places, and had rung the bell. When Jeannette came she desired that tea might be ready by the time that the young ladies returned, and asked Captain Bellfield if a cup should be set for him. This he declined, and bade her farewell while Jeannette was still in the room. She shook hands with him without any sign of anger, and even expressed a hope that they might see him again before long.\n\"He's a very handsome man, is the Captain,\" said Jeannette, as the hero of the Kitchyhomy River descended the stairs.\n\"You shouldn't think about handsome men, child,\" said Mrs. Greenow.\n\"And I'm sure I don't,\" said Jeannette. \"Not no more than anybody else; but if a man is handsome, ma'am, why it stands to reason that he is handsome.\"\n\"I suppose Captain Bellfield has given you a kiss and a pair of gloves.\"\n\"As for gloves and such like, Mr. Cheesacre is much better for giving than the Captain; as we all know; don't we, ma'am? But in regard to kisses, they're presents as I never takes from anybody. Let everybody pay his debts. If the Captain ever gets a wife, let him kiss her.\"\nOn the following Tuesday morning Mr. Cheesacre as usual called in the Close, but he brought with him no basket. He merely left a winter nosegay made of green leaves and laurestinus flowers, and sent up a message to say that he should call at half past three, and hoped that he might then be able to see Mrs. Greenow--on particular business.\n\"That means you, Kate,\" said Mrs. Greenow.\n\"No, it doesn't; it doesn't mean me at all. At any rate he won't see me.\"\n\"I dare say it's me he wishes to see. It seems to be the fashionable plan now for gentlemen to make offers by deputy. If he says anything, I can only refer him to you, you know.\"\n\"Yes, you can; you can tell him simply that I won't have him. But he is no more thinking of me than--\"\n\"Than he is of me, you were going to say.\"\n\"No, aunt; I wasn't going to say that at all.\"\n\"Well, we shall see. If he does mean anything, of course you can please yourself; but I really think you might do worse.\"\n\"But if I don't want to do at all?\"\n\"Very well; you must have your own way. I can only tell you what I think.\"\nAt half past three o'clock punctually Mr. Cheesacre came to the door, and was shown up-stairs. He was told by Jeannette that Captain Bellfield had looked in on the Sunday afternoon, but that Miss Fairstairs and Miss Vavasor had been there the whole time. He had not got on his black boots nor yet had his round topped hat. And as he did wear a new frock coat, and had his left hand thrust into a kid glove, Jeannette was quite sure that he intended business of some kind. With new boots, creaking loudly, he walked up into the drawing-room, and there he found the widow alone.\n\"Thanks for the flowers,\" she said at once. \"It was so good of you to bring something that we could accept.\"\n\"As for that,\" said he, \"I don't see why you should scruple about a trifle of cream, but I hope that any such feeling as that will be over before long.\" To this the widow made no answer, but she looked very sweetly on him as she bade him sit down.\nHe did sit down; but first he put his hat and stick carefully away in one corner, and then he pulled off his glove--somewhat laboriously, for his hand was warm. He was clearly prepared for great things. As he pushed up his hair with his hands there came from his locks an ambrosial perfume,--as of marrow-oil, and there was a fixed propriety of position of every hair of his whiskers, which indicated very plainly that he had been at a hairdresser's shop since he left the market. Nor do I believe that he had worn that coat when he came to the door earlier in the morning. If I were to say that he had called at his tailor's also, I do not think that I should be wrong.\n\"How goes everything at Oileymead?\" said Mrs. Greenow, seeing that her guest wanted some little assistance in leading off the conversation.\n\"Pretty well, Mrs. Greenow; pretty well. Everything will go very well if I am successful in the object which I have on hand to-day.\"\n\"I'm sure I hope you'll be successful in all your undertakings.\"\n\"In all my business undertakings I am, Mrs. Greenow. There isn't a shilling due on my land to e'er a bank in Norwich; and I haven't thrashed out a quarter of last year's corn yet, which is more than many of them can say. But there ain't many of them who don't have to pay rent, and so perhaps I oughtn't to boast.\"\n\"I know that Providence has been very good to you, Mr. Cheesacre, as regards worldly matters.\"\n\"And I haven't left it all to Providence, either. Those who do, generally go to the wall, as far as I can see. I'm always at work late and early, and I know when I get a profit out of a man's labour and when I don't, as well as though it was my only chance of bread and cheese.\"\n\"I always thought you understood farming business, Mr. Cheesacre.\"\n\"Yes, I do. I like a bit of fun well enough, when the time for it comes, as you saw at Yarmouth. And I keep my three or four hunters, as I think a country gentleman should; and I shoot over my own ground. But I always stick to my work. There are men, like Bellfield, who won't work. What do they come to? They're always borrowing.\"\n\"But he has fought his country's battles, Mr. Cheesacre.\"\n\"He fight! I suppose he's been telling you some of his old stories. He was ten years in the West Indies, and all his fighting was with the mosquitoes.\"\n\"But he was in the Crimea. At Inkerman, for instance--\"\n\"He in the Crimea! Well, never mind. But do you inquire before you believe that story. But as I was saying, Mrs. Greenow, you have seen my little place at Oileymead.\"\n\"A charming house. All you want is a mistress for it.\"\n\"That's it; that's just it. All I want is a mistress for it. And there's only one woman on earth that I would wish to see in that position. Arabella Greenow, will you be that woman?\" As he made the offer he got up and stood before her, placing his right hand upon his heart.\n[Illustration: \"Arabella Greenow, will you be that woman?\"]\n\"I, Mr. Cheesacre!\" she said.\n\"Yes, you. Who else? Since I saw you what other woman has been anything to me; or, indeed, I may say before? Since the first day I saw you I felt that there my happiness depended.\"\n\"Oh, Mr. Cheesacre, I thought you were looking elsewhere.\"\n\"No, no, no. There never was such a mistake as that. I have the highest regard and esteem for Miss Vavasor, but really--\"\n\"Mr. Cheesacre, what am I to say to you?\"\n\"What are you to say to me? Say that you'll be mine. Say that I shall be yours. Say that all I have at Oileymead shall be yours. Say that the open carriage for a pair of ponies to be driven by a lady which I have been looking at this morning shall be yours. Yes, indeed; the sweetest thing you ever saw in your life,--just like one that the lady of the Lord Lieutenant drives about in always. That's what you must say. Come, Mrs. Greenow!\"\n\"Ah, Mr. Cheesacre, you don't know what it is to have buried the pride of your youth hardly yet twelve months.\"\n\"But you have buried him, and there let there be an end of it. Your sitting here all alone, morning, noon, and night, won't bring him back. I'm sorry for him; I am indeed. Poor Greenow! But what more can I do?\"\n\"I can do more, Mr. Cheesacre. I can mourn for him in solitude and in silence.\"\n\"No, no, no. What's the use of it,--breaking your heart for nothing,--and my heart too. You never think of that.\" And Mr. Cheesacre spoke in a tone that was full of reproach.\n\"It cannot be, Mr. Cheesacre.\"\n\"Ah, but it can be. Come, Mrs. Greenow. We understand each other well enough now, surely. Come, dearest.\" And he approached her as though to put his arm round her waist. But at that moment there came a knock at the door, and Jeannette, entering the room, told her mistress that Captain Bellfield was below and wanted to know whether he could see her for a minute on particular business.\n\"Show Captain Bellfield up, certainly,\" said Mrs. Greenow.\n\"D---- Captain Bellfield!\" said Mr. Cheesacre.",
        "paragraph_chars": [
            [
                0,
                921
            ],
            [
                921,
                982
            ],
            [
                982,
                1116
            ],
            [
                1116,
                1203
            ],
            [
                1203,
                1302
            ],
            [
                1302,
                1423
            ],
            [
                1423,
                2399
            ],
            [
                2399,
                2761
            ],
            [
                2761,
                2952
            ],
            [
                2952,
                3039
            ],
            [
                3039,
                3307
            ],
            [
                3307,
                3366
            ],
            [
                3366,
                3802
            ],
            [
                3802,
                3897
            ],
            [
                3897,
                3955
            ],
            [
                3955,
                4020
            ],
            [
                4020,
                4101
            ],
            [
                4101,
                4451
            ],
            [
                4451,
                4649
            ],
            [
                4649,
                4721
            ],
            [
                4721,
                4915
            ],
            [
                4915,
                4965
            ],
            [
                4965,
                5032
            ],
            [
                5032,
                5083
            ],
            [
                5083,
                5282
            ],
            [
                5282,
                5324
            ],
            [
                5324,
                5599
            ],
            [
                5599,
                5643
            ],
            [
                5643,
                5990
            ],
            [
                5990,
                6073
            ],
            [
                6073,
                6575
            ],
            [
                6575,
                6668
            ],
            [
                6668,
                6982
            ],
            [
                6982,
                7223
            ],
            [
                7223,
                7271
            ],
            [
                7271,
                7616
            ],
            [
                7616,
                8238
            ],
            [
                8238,
                8356
            ],
            [
                8356,
                8424
            ],
            [
                8424,
                8575
            ],
            [
                8575,
                8648
            ],
            [
                8648,
                8923
            ],
            [
                8923,
                9264
            ],
            [
                9264,
                9307
            ],
            [
                9307,
                9381
            ],
            [
                9381,
                9560
            ],
            [
                9560,
                9663
            ],
            [
                9663,
                9706
            ],
            [
                9706,
                9753
            ],
            [
                9753,
                9875
            ],
            [
                9875,
                9911
            ],
            [
                9911,
                9986
            ],
            [
                9986,
                10563
            ],
            [
                10563,
                10672
            ],
            [
                10672,
                10920
            ],
            [
                10920,
                11591
            ],
            [
                11591,
                11731
            ],
            [
                11731,
                11864
            ],
            [
                11864,
                11929
            ],
            [
                11929,
                12244
            ],
            [
                12244,
                12339
            ],
            [
                12339,
                12618
            ],
            [
                12618,
                12685
            ],
            [
                12685,
                13017
            ],
            [
                13017,
                13075
            ],
            [
                13075,
                13227
            ],
            [
                13227,
                13283
            ],
            [
                13283,
                13450
            ],
            [
                13450,
                13505
            ],
            [
                13505,
                13780
            ],
            [
                13780,
                13840
            ],
            [
                13840,
                13870
            ],
            [
                13870,
                14051
            ],
            [
                14051,
                14110
            ],
            [
                14110,
                14232
            ],
            [
                14232,
                14274
            ],
            [
                14274,
                14714
            ],
            [
                14714,
                14826
            ],
            [
                14826,
                15037
            ],
            [
                15037,
                15117
            ],
            [
                15117,
                15292
            ],
            [
                15292,
                15323
            ],
            [
                15323,
                15710
            ],
            [
                15710,
                15769
            ],
            [
                15769,
                15815
            ]
        ],
        "segment_chars": [
            [
                0,
                130
            ],
            [
                130,
                316
            ],
            [
                316,
                416
            ],
            [
                416,
                462
            ],
            [
                462,
                685
            ],
            [
                685,
                721
            ],
            [
                721,
                921
            ],
            [
                921,
                982
            ],
            [
                982,
                1047
            ],
            [
                1047,
                1064
            ],
            [
                1064,
                1116
            ],
            [
                1116,
                1203
            ],
            [
                1203,
                1239
            ],
            [
                1239,
                1302
            ],
            [
                1302,
                1368
            ],
            [
                1368,
                1423
            ],
            [
                1423,
                1794
            ],
            [
                1794,
                2019
            ],
            [
                2019,
                2273
            ],
            [
                2273,
                2330
            ],
            [
                2330,
                2399
            ],
            [
                2399,
                2478
            ],
            [
                2478,
                2659
            ],
            [
                2659,
                2718
            ],
            [
                2718,
                2761
            ],
            [
                2761,
                2850
            ],
            [
                2850,
                2897
            ],
            [
                2897,
                2952
            ],
            [
                2952,
                3020
            ],
            [
                3020,
                3039
            ],
            [
                3039,
                3166
            ],
            [
                3166,
                3307
            ],
            [
                3307,
                3366
            ],
            [
                3366,
                3454
            ],
            [
                3454,
                3632
            ],
            [
                3632,
                3727
            ],
            [
                3727,
                3802
            ],
            [
                3802,
                3897
            ],
            [
                3897,
                3955
            ],
            [
                3955,
                4020
            ],
            [
                4020,
                4041
            ],
            [
                4041,
                4101
            ],
            [
                4101,
                4149
            ],
            [
                4149,
                4262
            ],
            [
                4262,
                4338
            ],
            [
                4338,
                4451
            ],
            [
                4451,
                4495
            ],
            [
                4495,
                4575
            ],
            [
                4575,
                4649
            ],
            [
                4649,
                4721
            ],
            [
                4721,
                4746
            ],
            [
                4746,
                4782
            ],
            [
                4782,
                4837
            ],
            [
                4837,
                4915
            ],
            [
                4915,
                4965
            ],
            [
                4965,
                5032
            ],
            [
                5032,
                5083
            ],
            [
                5083,
                5282
            ],
            [
                5282,
                5305
            ],
            [
                5305,
                5324
            ],
            [
                5324,
                5329
            ],
            [
                5329,
                5599
            ],
            [
                5599,
                5643
            ],
            [
                5643,
                5662
            ],
            [
                5662,
                5670
            ],
            [
                5670,
                5798
            ],
            [
                5798,
                5827
            ],
            [
                5827,
                5880
            ],
            [
                5880,
                5990
            ],
            [
                5990,
                6073
            ],
            [
                6073,
                6084
            ],
            [
                6084,
                6094
            ],
            [
                6094,
                6205
            ],
            [
                6205,
                6310
            ],
            [
                6310,
                6487
            ],
            [
                6487,
                6575
            ],
            [
                6575,
                6627
            ],
            [
                6627,
                6668
            ],
            [
                6668,
                6698
            ],
            [
                6698,
                6830
            ],
            [
                6830,
                6926
            ],
            [
                6926,
                6982
            ],
            [
                6982,
                7070
            ],
            [
                7070,
                7223
            ],
            [
                7223,
                7271
            ],
            [
                7271,
                7289
            ],
            [
                7289,
                7325
            ],
            [
                7325,
                7398
            ],
            [
                7398,
                7527
            ],
            [
                7527,
                7547
            ],
            [
                7547,
                7616
            ],
            [
                7616,
                7707
            ],
            [
                7707,
                7771
            ],
            [
                7771,
                7878
            ],
            [
                7878,
                8038
            ],
            [
                8038,
                8117
            ],
            [
                8117,
                8238
            ],
            [
                8238,
                8356
            ],
            [
                8356,
                8424
            ],
            [
                8424,
                8464
            ],
            [
                8464,
                8575
            ],
            [
                8575,
                8648
            ],
            [
                8648,
                8769
            ],
            [
                8769,
                8842
            ],
            [
                8842,
                8871
            ],
            [
                8871,
                8923
            ],
            [
                8923,
                9035
            ],
            [
                9035,
                9264
            ],
            [
                9264,
                9307
            ],
            [
                9307,
                9351
            ],
            [
                9351,
                9381
            ],
            [
                9381,
                9419
            ],
            [
                9419,
                9499
            ],
            [
                9499,
                9560
            ],
            [
                9560,
                9622
            ],
            [
                9622,
                9663
            ],
            [
                9663,
                9706
            ],
            [
                9706,
                9753
            ],
            [
                9753,
                9774
            ],
            [
                9774,
                9875
            ],
            [
                9875,
                9911
            ],
            [
                9911,
                9951
            ],
            [
                9951,
                9986
            ],
            [
                9986,
                10081
            ],
            [
                10081,
                10241
            ],
            [
                10241,
                10309
            ],
            [
                10309,
                10458
            ],
            [
                10458,
                10563
            ],
            [
                10563,
                10607
            ],
            [
                10607,
                10672
            ],
            [
                10672,
                10825
            ],
            [
                10825,
                10920
            ],
            [
                10920,
                11081
            ],
            [
                11081,
                11123
            ],
            [
                11123,
                11401
            ],
            [
                11401,
                11494
            ],
            [
                11494,
                11591
            ],
            [
                11591,
                11627
            ],
            [
                11627,
                11731
            ],
            [
                11731,
                11772
            ],
            [
                11772,
                11864
            ],
            [
                11864,
                11929
            ],
            [
                11929,
                11982
            ],
            [
                11982,
                12150
            ],
            [
                12150,
                12244
            ],
            [
                12244,
                12339
            ],
            [
                12339,
                12389
            ],
            [
                12389,
                12450
            ],
            [
                12450,
                12618
            ],
            [
                12618,
                12685
            ],
            [
                12685,
                12697
            ],
            [
                12697,
                12782
            ],
            [
                12782,
                12890
            ],
            [
                12890,
                12921
            ],
            [
                12921,
                12968
            ],
            [
                12968,
                12990
            ],
            [
                12990,
                13017
            ],
            [
                13017,
                13075
            ],
            [
                13075,
                13086
            ],
            [
                13086,
                13143
            ],
            [
                13143,
                13227
            ],
            [
                13227,
                13254
            ],
            [
                13254,
                13283
            ],
            [
                13283,
                13302
            ],
            [
                13302,
                13320
            ],
            [
                13320,
                13370
            ],
            [
                13370,
                13450
            ],
            [
                13450,
                13469
            ],
            [
                13469,
                13505
            ],
            [
                13505,
                13533
            ],
            [
                13533,
                13566
            ],
            [
                13566,
                13645
            ],
            [
                13645,
                13688
            ],
            [
                13688,
                13780
            ],
            [
                13780,
                13840
            ],
            [
                13840,
                13860
            ],
            [
                13860,
                13870
            ],
            [
                13870,
                13881
            ],
            [
                13881,
                13891
            ],
            [
                13891,
                13979
            ],
            [
                13979,
                14051
            ],
            [
                14051,
                14110
            ],
            [
                14110,
                14123
            ],
            [
                14123,
                14163
            ],
            [
                14163,
                14232
            ],
            [
                14232,
                14274
            ],
            [
                14274,
                14302
            ],
            [
                14302,
                14327
            ],
            [
                14327,
                14354
            ],
            [
                14354,
                14403
            ],
            [
                14403,
                14532
            ],
            [
                14532,
                14667
            ],
            [
                14667,
                14693
            ],
            [
                14693,
                14714
            ],
            [
                14714,
                14826
            ],
            [
                14826,
                14889
            ],
            [
                14889,
                14966
            ],
            [
                14966,
                14998
            ],
            [
                14998,
                15012
            ],
            [
                15012,
                15037
            ],
            [
                15037,
                15068
            ],
            [
                15068,
                15117
            ],
            [
                15117,
                15130
            ],
            [
                15130,
                15205
            ],
            [
                15205,
                15231
            ],
            [
                15231,
                15292
            ],
            [
                15292,
                15323
            ],
            [
                15323,
                15343
            ],
            [
                15343,
                15363
            ],
            [
                15363,
                15413
            ],
            [
                15413,
                15429
            ],
            [
                15429,
                15493
            ],
            [
                15493,
                15710
            ],
            [
                15710,
                15769
            ],
            [
                15769,
                15796
            ],
            [
                15796,
                15815
            ]
        ],
        "overlap_chars": [
            [
                0,
                23
            ],
            [
                128,
                130
            ],
            [
                130,
                146
            ],
            [
                157,
                163
            ],
            [
                168,
                241
            ],
            [
                264,
                297
            ],
            [
                314,
                316
            ],
            [
                316,
                349
            ],
            [
                355,
                381
            ],
            [
                387,
                415
            ],
            [
                416,
                419
            ],
            [
                437,
                462
            ],
            [
                462,
                480
            ],
            [
                533,
                565
            ],
            [
                575,
                685
            ],
            [
                721,
                851
            ],
            [
                856,
                864
            ],
            [
                872,
                921
            ],
            [
                921,
                982
            ],
            [
                982,
                1047
            ],
            [
                1047,
                1064
            ],
            [
                1064,
                1070
            ],
            [
                1077,
                1116
            ],
            [
                1116,
                1203
            ],
            [
                1203,
                1239
            ],
            [
                1239,
                1302
            ],
            [
                1302,
                1368
            ],
            [
                1368,
                1423
            ],
            [
                1449,
                1459
            ],
            [
                1763,
                1765
            ],
            [
                1467,
                1543
            ],
            [
                1554,
                1578
            ],
            [
                1423,
                1425
            ],
            [
                1583,
                1587
            ],
            [
                1605,
                1657
            ],
            [
                1663,
                1666
            ],
            [
                1688,
                1723
            ],
            [
                1754,
                1757
            ],
            [
                1730,
                1747
            ],
            [
                1776,
                1793
            ],
            [
                2130,
                2146
            ],
            [
                2147,
                2254
            ],
            [
                2271,
                2273
            ],
            [
                2273,
                2330
            ],
            [
                2330,
                2346
            ],
            [
                2382,
                2386
            ],
            [
                2351,
                2372
            ],
            [
                2397,
                2399
            ],
            [
                2399,
                2456
            ],
            [
                2476,
                2478
            ],
            [
                2510,
                2559
            ],
            [
                2570,
                2658
            ],
            [
                2659,
                2718
            ],
            [
                2718,
                2761
            ],
            [
                2761,
                2778
            ],
            [
                2789,
                2850
            ],
            [
                2952,
                3006
            ],
            [
                3017,
                3019
            ],
            [
                3039,
                3040
            ],
            [
                3105,
                3112
            ],
            [
                3136,
                3164
            ],
            [
                3080,
                3099
            ],
            [
                3164,
                3166
            ],
            [
                3166,
                3174
            ],
            [
                3175,
                3181
            ],
            [
                3194,
                3229
            ],
            [
                3304,
                3307
            ],
            [
                3307,
                3366
            ],
            [
                3366,
                3391
            ],
            [
                3399,
                3403
            ],
            [
                3409,
                3414
            ],
            [
                3424,
                3454
            ],
            [
                3454,
                3463
            ],
            [
                3498,
                3499
            ],
            [
                3464,
                3498
            ],
            [
                3630,
                3632
            ],
            [
                3637,
                3682
            ],
            [
                3696,
                3710
            ],
            [
                3725,
                3727
            ],
            [
                3727,
                3802
            ],
            [
                3802,
                3843
            ],
            [
                3844,
                3860
            ],
            [
                3862,
                3897
            ],
            [
                3897,
                3939
            ],
            [
                3952,
                3955
            ],
            [
                3955,
                4020
            ],
            [
                4020,
                4041
            ],
            [
                4041,
                4073
            ],
            [
                4088,
                4101
            ],
            [
                4101,
                4149
            ],
            [
                4149,
                4262
            ],
            [
                4262,
                4338
            ],
            [
                4338,
                4349
            ],
            [
                4441,
                4445
            ],
            [
                4373,
                4376
            ],
            [
                4449,
                4451
            ],
            [
                4451,
                4495
            ],
            [
                4495,
                4508
            ],
            [
                4573,
                4574
            ],
            [
                4649,
                4717
            ],
            [
                4721,
                4746
            ],
            [
                4746,
                4782
            ],
            [
                4782,
                4837
            ],
            [
                4837,
                4915
            ],
            [
                4915,
                4965
            ],
            [
                4965,
                4976
            ],
            [
                5004,
                5028
            ],
            [
                5032,
                5083
            ],
            [
                5083,
                5088
            ],
            [
                5091,
                5137
            ],
            [
                5145,
                5168
            ],
            [
                5177,
                5183
            ],
            [
                5202,
                5233
            ],
            [
                5259,
                5279
            ],
            [
                5329,
                5479
            ],
            [
                5486,
                5530
            ],
            [
                5556,
                5564
            ],
            [
                5568,
                5599
            ],
            [
                5599,
                5643
            ],
            [
                5643,
                5662
            ],
            [
                5670,
                5798
            ],
            [
                5827,
                5880
            ],
            [
                5880,
                5900
            ],
            [
                5988,
                5990
            ],
            [
                5990,
                5991
            ],
            [
                5995,
                6073
            ],
            [
                6073,
                6084
            ],
            [
                6111,
                6158
            ],
            [
                6164,
                6180
            ],
            [
                6203,
                6205
            ],
            [
                6205,
                6310
            ],
            [
                6310,
                6454
            ],
            [
                6484,
                6487
            ],
            [
                6497,
                6575
            ],
            [
                6575,
                6627
            ],
            [
                6627,
                6638
            ],
            [
                6642,
                6668
            ],
            [
                6668,
                6698
            ],
            [
                6698,
                6720
            ],
            [
                6806,
                6830
            ],
            [
                6830,
                6850
            ],
            [
                6863,
                6884
            ],
            [
                6890,
                6926
            ],
            [
                6926,
                6982
            ],
            [
                6982,
                7070
            ],
            [
                7070,
                7102
            ],
            [
                7158,
                7223
            ],
            [
                7223,
                7256
            ],
            [
                7259,
                7267
            ],
            [
                7271,
                7289
            ],
            [
                7289,
                7297
            ],
            [
                7303,
                7318
            ],
            [
                7323,
                7325
            ],
            [
                7325,
                7398
            ],
            [
                7398,
                7463
            ],
            [
                7465,
                7527
            ],
            [
                7527,
                7547
            ],
            [
                7547,
                7551
            ],
            [
                7557,
                7616
            ],
            [
                7631,
                7651
            ],
            [
                7658,
                7706
            ],
            [
                7707,
                7771
            ],
            [
                7776,
                7806
            ],
            [
                7831,
                7878
            ],
            [
                7878,
                7945
            ],
            [
                7951,
                8008
            ],
            [
                8029,
                8032
            ],
            [
                8009,
                8014
            ],
            [
                8036,
                8037
            ],
            [
                8043,
                8059
            ],
            [
                8069,
                8077
            ],
            [
                8115,
                8117
            ],
            [
                8117,
                8132
            ],
            [
                8142,
                8238
            ],
            [
                8238,
                8300
            ],
            [
                8334,
                8356
            ],
            [
                8356,
                8423
            ],
            [
                8575,
                8648
            ],
            [
                8648,
                8734
            ],
            [
                8769,
                8772
            ],
            [
                8786,
                8792
            ],
            [
                8802,
                8842
            ],
            [
                8871,
                8923
            ],
            [
                8923,
                8969
            ],
            [
                8979,
                8985
            ],
            [
                8970,
                8978
            ],
            [
                8986,
                9003
            ],
            [
                9007,
                9014
            ],
            [
                9024,
                9035
            ],
            [
                9035,
                9091
            ],
            [
                9104,
                9121
            ],
            [
                9125,
                9238
            ],
            [
                9240,
                9264
            ],
            [
                9264,
                9307
            ],
            [
                9307,
                9308
            ],
            [
                9324,
                9349
            ],
            [
                9419,
                9437
            ],
            [
                9455,
                9499
            ],
            [
                9499,
                9560
            ],
            [
                9560,
                9561
            ],
            [
                9575,
                9622
            ],
            [
                9622,
                9631
            ],
            [
                9640,
                9654
            ],
            [
                9753,
                9774
            ],
            [
                9774,
                9875
            ],
            [
                9986,
                10012
            ],
            [
                10024,
                10037
            ],
            [
                10054,
                10069
            ],
            [
                10079,
                10081
            ],
            [
                10081,
                10145
            ],
            [
                10150,
                10241
            ],
            [
                10313,
                10318
            ],
            [
                10328,
                10349
            ],
            [
                10382,
                10385
            ],
            [
                10391,
                10458
            ],
            [
                10463,
                10472
            ],
            [
                10474,
                10530
            ],
            [
                10540,
                10563
            ],
            [
                10563,
                10597
            ],
            [
                10694,
                10695
            ],
            [
                10879,
                10886
            ],
            [
                10901,
                10920
            ],
            [
                10941,
                10981
            ],
            [
                10987,
                10989
            ],
            [
                10994,
                11005
            ],
            [
                11045,
                11056
            ],
            [
                11014,
                11028
            ],
            [
                11079,
                11081
            ],
            [
                11163,
                11182
            ],
            [
                11143,
                11147
            ],
            [
                11189,
                11209
            ],
            [
                11224,
                11225
            ],
            [
                11212,
                11217
            ],
            [
                11225,
                11228
            ],
            [
                11230,
                11233
            ],
            [
                11389,
                11392
            ],
            [
                11246,
                11251
            ],
            [
                11265,
                11273
            ],
            [
                11288,
                11303
            ],
            [
                11311,
                11320
            ],
            [
                11334,
                11345
            ],
            [
                11346,
                11369
            ],
            [
                11399,
                11400
            ],
            [
                11591,
                11627
            ],
            [
                11627,
                11667
            ],
            [
                11675,
                11679
            ],
            [
                11687,
                11700
            ],
            [
                11713,
                11731
            ],
            [
                11731,
                11757
            ],
            [
                11770,
                11772
            ],
            [
                11772,
                11822
            ],
            [
                11827,
                11833
            ],
            [
                11861,
                11864
            ],
            [
                11864,
                11929
            ],
            [
                11929,
                11982
            ],
            [
                12051,
                12052
            ],
            [
                11991,
                11993
            ],
            [
                11994,
                12004
            ],
            [
                12020,
                12022
            ],
            [
                12030,
                12045
            ],
            [
                12244,
                12308
            ],
            [
                12336,
                12339
            ],
            [
                12339,
                12340
            ],
            [
                12344,
                12389
            ],
            [
                12450,
                12468
            ],
            [
                12483,
                12484
            ],
            [
                12469,
                12483
            ],
            [
                12697,
                12728
            ],
            [
                12756,
                12782
            ],
            [
                12782,
                12856
            ],
            [
                12888,
                12890
            ],
            [
                12890,
                12921
            ],
            [
                12921,
                12968
            ],
            [
                12968,
                12990
            ],
            [
                12990,
                13017
            ],
            [
                13017,
                13075
            ],
            [
                13075,
                13086
            ],
            [
                13086,
                13143
            ],
            [
                13143,
                13227
            ],
            [
                13227,
                13254
            ],
            [
                13254,
                13279
            ],
            [
                13283,
                13302
            ],
            [
                13302,
                13320
            ],
            [
                13320,
                13323
            ],
            [
                13327,
                13370
            ],
            [
                13370,
                13450
            ],
            [
                13450,
                13469
            ],
            [
                13469,
                13505
            ],
            [
                13505,
                13506
            ],
            [
                13517,
                13533
            ],
            [
                13533,
                13566
            ],
            [
                13566,
                13645
            ],
            [
                13645,
                13688
            ],
            [
                13709,
                13780
            ],
            [
                13840,
                13860
            ],
            [
                13860,
                13870
            ],
            [
                13870,
                13881
            ],
            [
                13881,
                13891
            ],
            [
                13979,
                14020
            ],
            [
                14027,
                14048
            ],
            [
                14048,
                14051
            ],
            [
                14051,
                14110
            ],
            [
                14110,
                14123
            ],
            [
                14163,
                14188
            ],
            [
                14200,
                14228
            ],
            [
                14232,
                14274
            ],
            [
                14302,
                14327
            ],
            [
                14693,
                14714
            ],
            [
                14714,
                14805
            ],
            [
                14810,
                14826
            ],
            [
                14826,
                14855
            ],
            [
                14894,
                14916
            ],
            [
                14944,
                14966
            ],
            [
                14966,
                14975
            ],
            [
                14990,
                14998
            ],
            [
                15012,
                15037
            ],
            [
                15037,
                15038
            ],
            [
                15068,
                15103
            ],
            [
                15107,
                15114
            ],
            [
                15051,
                15066
            ],
            [
                15114,
                15117
            ],
            [
                15117,
                15130
            ],
            [
                15130,
                15147
            ],
            [
                15153,
                15184
            ],
            [
                15187,
                15203
            ],
            [
                15237,
                15254
            ],
            [
                15282,
                15290
            ],
            [
                15290,
                15292
            ],
            [
                15292,
                15323
            ],
            [
                15323,
                15343
            ],
            [
                15363,
                15413
            ],
            [
                15413,
                15429
            ],
            [
                15429,
                15492
            ],
            [
                15493,
                15567
            ],
            [
                15576,
                15710
            ],
            [
                15710,
                15769
            ],
            [
                15769,
                15771
            ],
            [
                15776,
                15796
            ],
            [
                15796,
                15815
            ]
        ],
        "row_chars": [
            [
                0,
                130
            ],
            [
                130,
                316
            ],
            [
                316,
                416
            ],
            [
                416,
                462
            ],
            [
                462,
                685
            ],
            [
                685,
                721
            ],
            [
                721,
                921
            ],
            [
                921,
                982
            ],
            [
                982,
                1047
            ],
            [
                1047,
                1064
            ],
            [
                1064,
                1116
            ],
            [
                1116,
                1203
            ],
            [
                1203,
                1239
            ],
            [
                1239,
                1302
            ],
            [
                1302,
                1368
            ],
            [
                1368,
                1423
            ],
            [
                1423,
                1794
            ],
            [
                1794,
                2019
            ],
            [
                2019,
                2273
            ],
            [
                2273,
                2330
            ],
            [
                2330,
                2399
            ],
            [
                2399,
                2478
            ],
            [
                2478,
                2659
            ],
            [
                2659,
                2718
            ],
            [
                2718,
                2761
            ],
            [
                2761,
                2850
            ],
            [
                2850,
                2897
            ],
            [
                2897,
                2952
            ],
            [
                2952,
                3020
            ],
            [
                3020,
                3039
            ],
            [
                3039,
                3166
            ],
            [
                3166,
                3307
            ],
            [
                3307,
                3366
            ],
            [
                3366,
                3454
            ],
            [
                3454,
                3632
            ],
            [
                3632,
                3727
            ],
            [
                3727,
                3802
            ],
            [
                3802,
                3897
            ],
            [
                3897,
                3955
            ],
            [
                3955,
                4020
            ],
            [
                4020,
                4041
            ],
            [
                4041,
                4101
            ],
            [
                4101,
                4149
            ],
            [
                4149,
                4262
            ],
            [
                4262,
                4338
            ],
            [
                4338,
                4451
            ],
            [
                4451,
                4495
            ],
            [
                4495,
                4575
            ],
            [
                4575,
                4649
            ],
            [
                4649,
                4721
            ],
            [
                4721,
                4746
            ],
            [
                4746,
                4782
            ],
            [
                4782,
                4837
            ],
            [
                4837,
                4915
            ],
            [
                4915,
                4965
            ],
            [
                4965,
                5032
            ],
            [
                5032,
                5083
            ],
            [
                5083,
                5282
            ],
            [
                5282,
                5305
            ],
            [
                5305,
                5324
            ],
            [
                5324,
                5329
            ],
            [
                5329,
                5599
            ],
            [
                5599,
                5643
            ],
            [
                5643,
                5662
            ],
            [
                5662,
                5670
            ],
            [
                5670,
                5798
            ],
            [
                5798,
                5827
            ],
            [
                5827,
                5880
            ],
            [
                5880,
                5990
            ],
            [
                5990,
                6073
            ],
            [
                6073,
                6084
            ],
            [
                6084,
                6094
            ],
            [
                6094,
                6205
            ],
            [
                6205,
                6310
            ],
            [
                6310,
                6487
            ],
            [
                6487,
                6575
            ],
            [
                6575,
                6627
            ],
            [
                6627,
                6668
            ],
            [
                6668,
                6698
            ],
            [
                6698,
                6830
            ],
            [
                6830,
                6926
            ],
            [
                6926,
                6982
            ],
            [
                6982,
                7070
            ],
            [
                7070,
                7223
            ],
            [
                7223,
                7271
            ],
            [
                7271,
                7289
            ],
            [
                7289,
                7325
            ],
            [
                7325,
                7398
            ],
            [
                7398,
                7527
            ],
            [
                7527,
                7547
            ],
            [
                7547,
                7616
            ],
            [
                7616,
                7707
            ],
            [
                7707,
                7771
            ],
            [
                7771,
                7878
            ],
            [
                7878,
                8038
            ],
            [
                8038,
                8117
            ],
            [
                8117,
                8238
            ],
            [
                8238,
                8356
            ],
            [
                8356,
                8424
            ],
            [
                8424,
                8464
            ],
            [
                8464,
                8575
            ],
            [
                8575,
                8648
            ],
            [
                8648,
                8769
            ],
            [
                8769,
                8842
            ],
            [
                8842,
                8871
            ],
            [
                8871,
                8923
            ],
            [
                8923,
                9035
            ],
            [
                9035,
                9264
            ],
            [
                9264,
                9307
            ],
            [
                9307,
                9351
            ],
            [
                9351,
                9381
            ],
            [
                9381,
                9419
            ],
            [
                9419,
                9499
            ],
            [
                9499,
                9560
            ],
            [
                9560,
                9622
            ],
            [
                9622,
                9663
            ],
            [
                9663,
                9706
            ],
            [
                9706,
                9753
            ],
            [
                9753,
                9774
            ],
            [
                9774,
                9875
            ],
            [
                9875,
                9911
            ],
            [
                9911,
                9951
            ],
            [
                9951,
                9986
            ],
            [
                9986,
                10081
            ],
            [
                10081,
                10241
            ],
            [
                10241,
                10309
            ],
            [
                10309,
                10458
            ],
            [
                10458,
                10563
            ],
            [
                10563,
                10920
            ],
            [
                10920,
                11081
            ],
            [
                11081,
                11123
            ],
            [
                11123,
                11401
            ],
            [
                11401,
                11494
            ],
            [
                11494,
                11591
            ],
            [
                11591,
                11627
            ],
            [
                11627,
                11731
            ],
            [
                11731,
                11772
            ],
            [
                11772,
                11864
            ],
            [
                11864,
                11929
            ],
            [
                11929,
                11982
            ],
            [
                11982,
                12150
            ],
            [
                12150,
                12244
            ],
            [
                12244,
                12339
            ],
            [
                12339,
                12389
            ],
            [
                12389,
                12450
            ],
            [
                12450,
                12618
            ],
            [
                12618,
                12685
            ],
            [
                12685,
                12697
            ],
            [
                12697,
                12782
            ],
            [
                12782,
                12890
            ],
            [
                12890,
                12921
            ],
            [
                12921,
                12968
            ],
            [
                12968,
                12990
            ],
            [
                12990,
                13017
            ],
            [
                13017,
                13075
            ],
            [
                13075,
                13086
            ],
            [
                13086,
                13143
            ],
            [
                13143,
                13227
            ],
            [
                13227,
                13254
            ],
            [
                13254,
                13283
            ],
            [
                13283,
                13302
            ],
            [
                13302,
                13320
            ],
            [
                13320,
                13370
            ],
            [
                13370,
                13450
            ],
            [
                13450,
                13469
            ],
            [
                13469,
                13505
            ],
            [
                13505,
                13533
            ],
            [
                13533,
                13566
            ],
            [
                13566,
                13645
            ],
            [
                13645,
                13688
            ],
            [
                13688,
                13780
            ],
            [
                13780,
                13840
            ],
            [
                13840,
                13860
            ],
            [
                13860,
                13870
            ],
            [
                13870,
                13881
            ],
            [
                13881,
                13891
            ],
            [
                13891,
                13979
            ],
            [
                13979,
                14051
            ],
            [
                14051,
                14110
            ],
            [
                14110,
                14123
            ],
            [
                14123,
                14163
            ],
            [
                14163,
                14232
            ],
            [
                14232,
                14274
            ],
            [
                14274,
                14302
            ],
            [
                14302,
                14327
            ],
            [
                14327,
                14354
            ],
            [
                14354,
                14403
            ],
            [
                14403,
                14532
            ],
            [
                14532,
                14667
            ],
            [
                14667,
                14693
            ],
            [
                14693,
                14714
            ],
            [
                14714,
                14826
            ],
            [
                14826,
                14966
            ],
            [
                14966,
                14998
            ],
            [
                14998,
                15012
            ],
            [
                15012,
                15037
            ],
            [
                15037,
                15117
            ],
            [
                15117,
                15130
            ],
            [
                15130,
                15205
            ],
            [
                15205,
                15231
            ],
            [
                15231,
                15292
            ],
            [
                15292,
                15323
            ],
            [
                15323,
                15343
            ],
            [
                15343,
                15363
            ],
            [
                15363,
                15413
            ],
            [
                15413,
                15429
            ],
            [
                15429,
                15493
            ],
            [
                15493,
                15710
            ],
            [
                15710,
                15769
            ],
            [
                15769,
                15796
            ],
            [
                15796,
                15815
            ]
        ]
    },
    "abridged": {
        "text": "The next day was Sunday. Mrs. Greenow had warned Mr. Cheesacre that she was not fond of Sunday visitors, fearing that otherwise he might give them too much of his society. In the morning the aunt and niece went to the Cathedral, and at three o'clock they dined.\nBut today they did not dine alone. Charlie Fairstairs had been asked to join them; and so that Charlie might not feel it dull, Mrs. Greenow had, with her usual good-nature, invited Captain Bellfield. The captain carved the turkey, giving due honour to Mr. Cheesacre as he did so; and when he nibbled his celery with his cheese, he joked prettily about the richness of the farmyard at Oileymead.\n\"He is the most generous man I ever met,\" said Mrs. Greenow.\n\"So he is,\" said Captain Bellfield, \"and we'll drink his health. Poor old Cheesy! It's a pity he shouldn't get himself a wife.\"\n\"I don't know any man more calculated to make a young woman happy,\" said Mrs. Greenow.\n\"No, indeed,\" said Miss Fairstairs. \"I'm told that his house and all about it is quite beautiful.\"\n\"Especially the straw-yard and the horse-pond,\" said the Captain. And then they drank the health of their absent friend.\nThe ladies were to go to church in the evening, and it was thought that Captain Bellfield would accompany them; but when it was time to set out, Kate and Charlie were ready, but the widow was not. She stayed behind - as she afterwards explained to Kate - so as not to turn Captain Bellfield out of the house.\nHowever, when the young ladies returned from church, he was not there, and the widow was alone, \"looking back,\" she said, \"to things that were gone. But come, dears, I am not going to make you melancholy.\" So they had tea, with Mr. Cheesacre's cream.\nCaptain Bellfield had not allowed the opportunity to slip. After the younger ladies had gone, he said little, but sat with a wine-glass before him, which once or twice he filled from the decanter.\n\"I'm afraid the wine is not very good,\" said Mrs. Greenow. \"But one can't get good wine in lodgings.\"\n\"I'm not thinking about it, Mrs. Greenow; that's the truth,\" said the Captain. \"I suppose you find it rather dull, living in lodgings?\"\n\"A woman in my circumstances can't find her life very gay, Captain Bellfield. It's not yet a full year yet since I lost all that made life happy.\"\n\"It's wicked to give way to grief too much, Mrs. Greenow.\"\n\"That's what my dear Kate says, and I do my best to overcome it.\" Upon this, soft tears trickled down her cheek. She pressed her handkerchief to her eyes, and smiled faintly. \"I didn't intend to treat you to such a scene as this, Captain Bellfield.\"\n\"There is nothing on earth, Mrs. Greenow, that I desire so much as permission to dry those tears.\"\n\"Time alone can do that, Captain Bellfield.\"\n\"But cannot time be aided by love and friendship and affection?\"\n\"By friendship, yes. What would life be worth without friendship?\"\n\"And how much better is the warm glow of love?\" Captain Bellfield, as he asked this question, deliberately got up, and moved his chair over to the widow's side. But the widow as deliberately changed her position to the corner of a sofa. The Captain refrained from following her immediately.\n\"How much better is the warm glow of love?\" he said again.\n\"The warm, glow of love, Captain Bellfield, if you have ever felt it-\"\n\"If I have ever felt it! Do I not feel it now, Mrs. Greenow? There can be no longer any mask kept upon my feelings. I never could restrain the yearnings of my heart when they have been strong.\"\n\"Have they often been strong, Captain Bellfield?\"\n\"Yes; often; on the field of battle-\"\n\"I did not know that you had seen active service.\"\n\"What! - not on the plains of Zuzuland, when with fifty men I kept five hundred Kaffirs at bay - and never knew the comfort of a bed for seven long weeks! And did I not see active service at Essiquebo, on the burning coast of Guiana, when all the wild Africans from the woods rose up to destroy the colony; or at the mouth of the Kitchyhomy River, when I captured a slaver with my own hand and my own sword!\"\n\"I really hadn't heard,\" said Mrs. Greenow.\n\"Ah, I understand. Cheesy is the best fellow in the world in some respects, but he cannot bring himself to speak well of a fellow behind his back. Yet who was the first to storm the heights of Inkerman?\" demanded the Captain.\n\"When you spoke of yearnings, I thought you meant yearnings of a softer kind.\"\n\"So I did. I have been led away to speak of deeds that are seldom mentioned. But I cannot bear that a slanderous backbiting tongue should make you think that I have seen no service. I have served her Majesty in the four quarters of the globe, Mrs. Greenow; and now I am ready to serve you in any way in which you will allow me.\" He took one stride over to the sofa, and went down upon his knees before her.\n\"But, Captain Bellfield, I don't want any services. Pray get up; the girl will come in.\"\n\"I care nothing for any girl. I am planted here till you give me a little hope.\" Then he attempted to take her hand, but she put her hands behind her back and shook her head. \"Arabella,\" he said, \"will you not speak a word to me?\"\n\"Not a word, Captain Bellfield, till you get up; and I won't have you call me Arabella. I am the widow of Samuel Greenow, and it is not fitting that I should be addressed in that way.\"\n\"But I want you to become my wife - and then-\"\n\"Ah, then indeed! But that isn't likely to happen. Get up, Captain Bellfield, or I'll push you over and then ring the bell. A man never looks so much like a fool as when he's kneeling down, unless he's saying his prayers, as you ought to be doing now. Get up, I tell you. It's half past seven, and I told Jeannette to come to me then.\"\nSomething in the widow's voice made him get up, and he rose slowly to his feet.\n\"You've pushed all the chairs about, you stupid man,\" she said. In one minute she had restored them to their proper places, and had rung the bell. When Jeannette came she desired that tea might be ready by the time the young ladies returned, and asked Captain Bellfield if he would stay for a cup.\nHe declined, and said farewell. She shook hands without any sign of anger, and even expressed a hope that they might see him again before long.\n\"He's a very handsome man, is the Captain,\" said Jeannette, as he descended the stairs.\n\"You shouldn't think about handsome men, child,\" said Mrs. Greenow. \"I suppose Captain Bellfield has given you a kiss and a pair of gloves.\"\n\"As for gloves and such like, Mr. Cheesacre is much better for giving than the Captain. But kisses is presents as I never takes from anybody. If the Captain ever gets a wife, let him kiss her.\"\nOn the following Tuesday morning Mr. Cheesacre called as usual in the Close, but brought no basket. He merely left a winter nosegay made of green leaves and viburnum flowers, and sent a message to say that he should call at half past three, and hoped that he might then be able to see Mrs. Greenow on particular business.\n\"That means you, Kate,\" said Mrs. Greenow.\n\"It doesn't mean me at all.\"\n\"It seems to be the fashion now for gentlemen to make offers by deputy. If he says anything, I can only refer him to you, you know.\"\n\"You can tell him simply that I won't have him. But he is not thinking of me.\"\n\"Well, we shall see. If he does mean anything, of course you can please yourself; but I really think you might do worse.\"\nAt half past three o'clock Mr. Cheesacre arrived, and was shown upstairs. He was told by Jeannette that Captain Bellfield had looked in on Sunday afternoon, but that Miss Fairstairs and Miss Vavasor had been there the whole time. As he wore a new frock coat, and kid gloves, Jeannette was quite sure that he intended business of some kind. His new boots creaking loudly, he walked up into the drawing-room, and found the widow alone.\n\"Thanks for the flowers,\" she said, and sweetly bade him sit down.\nFirst he put his hat and stick carefully in a corner, and laboriously pulled off his gloves. There came from his hair an ambrosial perfume - as of bone-marrow oil - and the fixed position of his whiskers indicated that he had recently been at a hairdresser's.\n\"How goes everything at Oileymead?\" said Mrs. Greenow, seeing that her guest needed some assistance in starting the conversation.\n\"Pretty well, Mrs. Greenow. Everything will go very well if I am successful in my object today.\"\n\"I'm sure I hope you'll be successful in all your undertakings.\"\n\"In all my business undertakings I am, Mrs. Greenow. I don't owe a shilling to any bank in Norwich.\"\n\"I know that Providence has been very good to you, Mr. Cheesacre.\"\n\"I haven't left it all to Providence, either. I'm always at work, late and early. I like a bit of fun well enough, as you saw at Yarmouth. And I keep my three or four hunters, as I think a country gentleman should. But I always stick to my work. There are men, like Bellfield, who won't work. What do they come to? They're always borrowing.\"\n\"But he has fought his country's battles, Mr. Cheesacre.\"\n\"He fight! I suppose he's been telling you some of his old stories. He was ten years in the West Indies, and all his fighting was with the mosquitoes.\"\n\"But he was in the Crimea. At Inkerman, for instance-\"\n\"He in the Crimea! Well, never mind. But you inquire before you believe that story. But as I was saying, Mrs. Greenow, you have seen my little place at Oileymead.\"\n\"A charming house. All you want is a mistress for it.\"\n\"That's just it. All I want is a mistress for it. And there's only one woman on earth that I would wish to see in that position. Arabella Greenow, will you be that woman?\" He got up and stood before her, placing his right hand upon his heart.\n\"I, Mr. Cheesacre!\" she said.\n\"Yes, you. Who else? Since the first day I saw you I felt that my happiness depended on you.\"\n\"Oh, Mr. Cheesacre, I thought you were looking elsewhere.\"\n\"No, no, no. I have the highest regard for Miss Vavasor, but really-\"\n\"Mr. Cheesacre, what am I to say to you?\"\n\"Say that you'll be mine. Come, Mrs. Greenow!\"\n\"Ah, Mr. Cheesacre, you don't know what it is to have buried the pride of your youth hardly twelve months.\"\n\"But you have buried him, and sitting here all alone won't bring him back. I'm sorry, indeed. But what more can I do?\"\n\"I can mourn for him in solitude and silence, Mr. Cheesacre.\"\n\"No, no, no. What's the use of breaking your heart for nothing - and my heart too.\" Mr. Cheesacre spoke reproachfully.\n\"It cannot be, Mr. Cheesacre.\"\n\"Ah, but it can be. We understand each other well enough now, surely. Come, dearest.\" And he approached her as though to put his arm round her waist.\nBut at that moment there came a knock at the door, and Jeannette, entering, told her mistress that Captain Bellfield was below and wanted to know whether he could see her for a minute on particular business.\n\"Show Captain Bellfield up, certainly,\" said Mrs. Greenow.\n\"D-- Captain Bellfield!\" said Mr. Cheesacre.",
        "paragraph_chars": [
            [
                0,
                262
            ],
            [
                262,
                657
            ],
            [
                657,
                718
            ],
            [
                718,
                846
            ],
            [
                846,
                933
            ],
            [
                933,
                1032
            ],
            [
                1032,
                1153
            ],
            [
                1153,
                1462
            ],
            [
                1462,
                1713
            ],
            [
                1713,
                1910
            ],
            [
                1910,
                2012
            ],
            [
                2012,
                2148
            ],
            [
                2148,
                2295
            ],
            [
                2295,
                2354
            ],
            [
                2354,
                2604
            ],
            [
                2604,
                2703
            ],
            [
                2703,
                2748
            ],
            [
                2748,
                2813
            ],
            [
                2813,
                2880
            ],
            [
                2880,
                3171
            ],
            [
                3171,
                3230
            ],
            [
                3230,
                3301
            ],
            [
                3301,
                3495
            ],
            [
                3495,
                3545
            ],
            [
                3545,
                3583
            ],
            [
                3583,
                3634
            ],
            [
                3634,
                4043
            ],
            [
                4043,
                4087
            ],
            [
                4087,
                4313
            ],
            [
                4313,
                4392
            ],
            [
                4392,
                4799
            ],
            [
                4799,
                4888
            ],
            [
                4888,
                5119
            ],
            [
                5119,
                5304
            ],
            [
                5304,
                5351
            ],
            [
                5351,
                5687
            ],
            [
                5687,
                5767
            ],
            [
                5767,
                6065
            ],
            [
                6065,
                6209
            ],
            [
                6209,
                6297
            ],
            [
                6297,
                6438
            ],
            [
                6438,
                6632
            ],
            [
                6632,
                6954
            ],
            [
                6954,
                6997
            ],
            [
                6997,
                7026
            ],
            [
                7026,
                7159
            ],
            [
                7159,
                7238
            ],
            [
                7238,
                7360
            ],
            [
                7360,
                7794
            ],
            [
                7794,
                7861
            ],
            [
                7861,
                8121
            ],
            [
                8121,
                8251
            ],
            [
                8251,
                8348
            ],
            [
                8348,
                8413
            ],
            [
                8413,
                8514
            ],
            [
                8514,
                8581
            ],
            [
                8581,
                8923
            ],
            [
                8923,
                8981
            ],
            [
                8981,
                9133
            ],
            [
                9133,
                9188
            ],
            [
                9188,
                9352
            ],
            [
                9352,
                9407
            ],
            [
                9407,
                9650
            ],
            [
                9650,
                9680
            ],
            [
                9680,
                9774
            ],
            [
                9774,
                9833
            ],
            [
                9833,
                9903
            ],
            [
                9903,
                9945
            ],
            [
                9945,
                9992
            ],
            [
                9992,
                10100
            ],
            [
                10100,
                10219
            ],
            [
                10219,
                10281
            ],
            [
                10281,
                10400
            ],
            [
                10400,
                10431
            ],
            [
                10431,
                10581
            ],
            [
                10581,
                10789
            ],
            [
                10789,
                10848
            ],
            [
                10848,
                10892
            ]
        ],
        "segment_chars": [
            [
                0,
                25
            ],
            [
                25,
                172
            ],
            [
                172,
                262
            ],
            [
                262,
                297
            ],
            [
                297,
                462
            ],
            [
                462,
                657
            ],
            [
                657,
                718
            ],
            [
                718,
                783
            ],
            [
                783,
                800
            ],
            [
                800,
                846
            ],
            [
                846,
                933
            ],
            [
                933,
                969
            ],
            [
                969,
                1032
            ],
            [
                1032,
                1098
            ],
            [
                1098,
                1153
            ],
            [
                1153,
                1350
            ],
            [
                1350,
                1462
            ],
            [
                1462,
                1611
            ],
            [
                1611,
                1668
            ],
            [
                1668,
                1713
            ],
            [
                1713,
                1772
            ],
            [
                1772,
                1910
            ],
            [
                1910,
                1969
            ],
            [
                1969,
                2012
            ],
            [
                2012,
                2091
            ],
            [
                2091,
                2148
            ],
            [
                2148,
                2226
            ],
            [
                2226,
                2295
            ],
            [
                2295,
                2354
            ],
            [
                2354,
                2420
            ],
            [
                2420,
                2467
            ],
            [
                2467,
                2529
            ],
            [
                2529,
                2604
            ],
            [
                2604,
                2703
            ],
            [
                2703,
                2748
            ],
            [
                2748,
                2813
            ],
            [
                2813,
                2834
            ],
            [
                2834,
                2880
            ],
            [
                2880,
                2928
            ],
            [
                2928,
                3041
            ],
            [
                3041,
                3117
            ],
            [
                3117,
                3171
            ],
            [
                3171,
                3215
            ],
            [
                3215,
                3230
            ],
            [
                3230,
                3301
            ],
            [
                3301,
                3326
            ],
            [
                3326,
                3362
            ],
            [
                3362,
                3417
            ],
            [
                3417,
                3495
            ],
            [
                3495,
                3545
            ],
            [
                3545,
                3583
            ],
            [
                3583,
                3634
            ],
            [
                3634,
                3641
            ],
            [
                3641,
                3789
            ],
            [
                3789,
                4043
            ],
            [
                4043,
                4087
            ],
            [
                4087,
                4106
            ],
            [
                4106,
                4234
            ],
            [
                4234,
                4291
            ],
            [
                4291,
                4313
            ],
            [
                4313,
                4392
            ],
            [
                4392,
                4403
            ],
            [
                4403,
                4469
            ],
            [
                4469,
                4574
            ],
            [
                4574,
                4721
            ],
            [
                4721,
                4799
            ],
            [
                4799,
                4851
            ],
            [
                4851,
                4888
            ],
            [
                4888,
                4918
            ],
            [
                4918,
                4969
            ],
            [
                4969,
                5063
            ],
            [
                5063,
                5119
            ],
            [
                5119,
                5207
            ],
            [
                5207,
                5304
            ],
            [
                5304,
                5351
            ],
            [
                5351,
                5369
            ],
            [
                5369,
                5402
            ],
            [
                5402,
                5475
            ],
            [
                5475,
                5603
            ],
            [
                5603,
                5623
            ],
            [
                5623,
                5687
            ],
            [
                5687,
                5767
            ],
            [
                5767,
                5831
            ],
            [
                5831,
                5914
            ],
            [
                5914,
                6065
            ],
            [
                6065,
                6097
            ],
            [
                6097,
                6209
            ],
            [
                6209,
                6297
            ],
            [
                6297,
                6365
            ],
            [
                6365,
                6438
            ],
            [
                6438,
                6526
            ],
            [
                6526,
                6580
            ],
            [
                6580,
                6632
            ],
            [
                6632,
                6732
            ],
            [
                6732,
                6954
            ],
            [
                6954,
                6997
            ],
            [
                6997,
                7026
            ],
            [
                7026,
                7098
            ],
            [
                7098,
                7159
            ],
            [
                7159,
                7207
            ],
            [
                7207,
                7238
            ],
            [
                7238,
                7259
            ],
            [
                7259,
                7360
            ],
            [
                7360,
                7434
            ],
            [
                7434,
                7590
            ],
            [
                7590,
                7700
            ],
            [
                7700,
                7794
            ],
            [
                7794,
                7861
            ],
            [
                7861,
                7954
            ],
            [
                7954,
                8121
            ],
            [
                8121,
                8157
            ],
            [
                8157,
                8251
            ],
            [
                8251,
                8279
            ],
            [
                8279,
                8348
            ],
            [
                8348,
                8413
            ],
            [
                8413,
                8466
            ],
            [
                8466,
                8514
            ],
            [
                8514,
                8581
            ],
            [
                8581,
                8627
            ],
            [
                8627,
                8663
            ],
            [
                8663,
                8720
            ],
            [
                8720,
                8796
            ],
            [
                8796,
                8827
            ],
            [
                8827,
                8874
            ],
            [
                8874,
                8896
            ],
            [
                8896,
                8923
            ],
            [
                8923,
                8981
            ],
            [
                8981,
                8992
            ],
            [
                8992,
                9049
            ],
            [
                9049,
                9133
            ],
            [
                9133,
                9160
            ],
            [
                9160,
                9188
            ],
            [
                9188,
                9207
            ],
            [
                9207,
                9225
            ],
            [
                9225,
                9272
            ],
            [
                9272,
                9352
            ],
            [
                9352,
                9371
            ],
            [
                9371,
                9407
            ],
            [
                9407,
                9424
            ],
            [
                9424,
                9457
            ],
            [
                9457,
                9536
            ],
            [
                9536,
                9579
            ],
            [
                9579,
                9650
            ],
            [
                9650,
                9670
            ],
            [
                9670,
                9680
            ],
            [
                9680,
                9691
            ],
            [
                9691,
                9701
            ],
            [
                9701,
                9774
            ],
            [
                9774,
                9833
            ],
            [
                9833,
                9846
            ],
            [
                9846,
                9903
            ],
            [
                9903,
                9945
            ],
            [
                9945,
                9971
            ],
            [
                9971,
                9992
            ],
            [
                9992,
                10100
            ],
            [
                10100,
                10175
            ],
            [
                10175,
                10194
            ],
            [
                10194,
                10219
            ],
            [
                10219,
                10281
            ],
            [
                10281,
                10294
            ],
            [
                10294,
                10365
            ],
            [
                10365,
                10400
            ],
            [
                10400,
                10431
            ],
            [
                10431,
                10451
            ],
            [
                10451,
                10501
            ],
            [
                10501,
                10517
            ],
            [
                10517,
                10581
            ],
            [
                10581,
                10789
            ],
            [
                10789,
                10848
            ],
            [
                10848,
                10873
            ],
            [
                10873,
                10892
            ]
        ],
        "overlap_chars": [
            [
                0,
                23
            ],
            [
                23,
                25
            ],
            [
                25,
                41
            ],
            [
                42,
                48
            ],
            [
                63,
                136
            ],
            [
                137,
                170
            ],
            [
                170,
                172
            ],
            [
                172,
                205
            ],
            [
                206,
                232
            ],
            [
                233,
                261
            ],
            [
                262,
                265
            ],
            [
                272,
                297
            ],
            [
                297,
                315
            ],
            [
                316,
                348
            ],
            [
                352,
                462
            ],
            [
                462,
                592
            ],
            [
                599,
                607
            ],
            [
                608,
                657
            ],
            [
                657,
                718
            ],
            [
                718,
                783
            ],
            [
                783,
                800
            ],
            [
                800,
                806
            ],
            [
                807,
                846
            ],
            [
                846,
                933
            ],
            [
                933,
                969
            ],
            [
                969,
                1032
            ],
            [
                1032,
                1098
            ],
            [
                1098,
                1153
            ],
            [
                1153,
                1163
            ],
            [
                1169,
                1171
            ],
            [
                1172,
                1248
            ],
            [
                1249,
                1273
            ],
            [
                1274,
                1276
            ],
            [
                1281,
                1285
            ],
            [
                1296,
                1348
            ],
            [
                1350,
                1353
            ],
            [
                1370,
                1405
            ],
            [
                1414,
                1417
            ],
            [
                1426,
                1443
            ],
            [
                1444,
                1461
            ],
            [
                1476,
                1492
            ],
            [
                1502,
                1609
            ],
            [
                1609,
                1611
            ],
            [
                1611,
                1668
            ],
            [
                1668,
                1684
            ],
            [
                1685,
                1689
            ],
            [
                1690,
                1711
            ],
            [
                1711,
                1713
            ],
            [
                1713,
                1770
            ],
            [
                1770,
                1772
            ],
            [
                1772,
                1821
            ],
            [
                1821,
                1909
            ],
            [
                1910,
                1969
            ],
            [
                1969,
                2012
            ],
            [
                2012,
                2029
            ],
            [
                2030,
                2091
            ],
            [
                2091,
                2145
            ],
            [
                2145,
                2147
            ],
            [
                2148,
                2149
            ],
            [
                2149,
                2156
            ],
            [
                2177,
                2205
            ],
            [
                2205,
                2224
            ],
            [
                2224,
                2226
            ],
            [
                2226,
                2234
            ],
            [
                2239,
                2245
            ],
            [
                2251,
                2286
            ],
            [
                2292,
                2295
            ],
            [
                2295,
                2354
            ],
            [
                2354,
                2379
            ],
            [
                2380,
                2384
            ],
            [
                2384,
                2389
            ],
            [
                2390,
                2420
            ],
            [
                2420,
                2429
            ],
            [
                2429,
                2430
            ],
            [
                2431,
                2465
            ],
            [
                2465,
                2467
            ],
            [
                2467,
                2512
            ],
            [
                2513,
                2527
            ],
            [
                2527,
                2529
            ],
            [
                2529,
                2604
            ],
            [
                2604,
                2645
            ],
            [
                2651,
                2667
            ],
            [
                2668,
                2703
            ],
            [
                2703,
                2745
            ],
            [
                2745,
                2748
            ],
            [
                2748,
                2813
            ],
            [
                2813,
                2834
            ],
            [
                2834,
                2866
            ],
            [
                2867,
                2880
            ],
            [
                2880,
                2928
            ],
            [
                2928,
                3041
            ],
            [
                3041,
                3117
            ],
            [
                3117,
                3128
            ],
            [
                3139,
                3143
            ],
            [
                3154,
                3157
            ],
            [
                3169,
                3171
            ],
            [
                3171,
                3215
            ],
            [
                3215,
                3228
            ],
            [
                3228,
                3229
            ],
            [
                3230,
                3298
            ],
            [
                3301,
                3326
            ],
            [
                3326,
                3362
            ],
            [
                3362,
                3417
            ],
            [
                3417,
                3495
            ],
            [
                3495,
                3545
            ],
            [
                3545,
                3556
            ],
            [
                3556,
                3580
            ],
            [
                3583,
                3634
            ],
            [
                3634,
                3639
            ],
            [
                3643,
                3689
            ],
            [
                3690,
                3713
            ],
            [
                3722,
                3728
            ],
            [
                3735,
                3766
            ],
            [
                3767,
                3787
            ],
            [
                3793,
                3943
            ],
            [
                3944,
                3988
            ],
            [
                3998,
                4006
            ],
            [
                4012,
                4043
            ],
            [
                4043,
                4087
            ],
            [
                4087,
                4106
            ],
            [
                4106,
                4234
            ],
            [
                4238,
                4291
            ],
            [
                4291,
                4311
            ],
            [
                4311,
                4313
            ],
            [
                4313,
                4314
            ],
            [
                4314,
                4392
            ],
            [
                4392,
                4403
            ],
            [
                4403,
                4450
            ],
            [
                4451,
                4467
            ],
            [
                4467,
                4469
            ],
            [
                4469,
                4574
            ],
            [
                4574,
                4718
            ],
            [
                4718,
                4721
            ],
            [
                4721,
                4799
            ],
            [
                4799,
                4851
            ],
            [
                4851,
                4862
            ],
            [
                4862,
                4888
            ],
            [
                4888,
                4918
            ],
            [
                4918,
                4940
            ],
            [
                4945,
                4969
            ],
            [
                4969,
                4989
            ],
            [
                4995,
                5016
            ],
            [
                5027,
                5063
            ],
            [
                5063,
                5119
            ],
            [
                5119,
                5207
            ],
            [
                5207,
                5239
            ],
            [
                5239,
                5304
            ],
            [
                5304,
                5337
            ],
            [
                5340,
                5348
            ],
            [
                5351,
                5369
            ],
            [
                5369,
                5377
            ],
            [
                5378,
                5393
            ],
            [
                5400,
                5402
            ],
            [
                5402,
                5475
            ],
            [
                5475,
                5540
            ],
            [
                5541,
                5603
            ],
            [
                5603,
                5623
            ],
            [
                5623,
                5627
            ],
            [
                5628,
                5687
            ],
            [
                5697,
                5717
            ],
            [
                5718,
                5766
            ],
            [
                5767,
                5831
            ],
            [
                5831,
                5861
            ],
            [
                5867,
                5914
            ],
            [
                5914,
                5981
            ],
            [
                5982,
                6039
            ],
            [
                6054,
                6057
            ],
            [
                6058,
                6063
            ],
            [
                6063,
                6064
            ],
            [
                6065,
                6081
            ],
            [
                6087,
                6095
            ],
            [
                6095,
                6097
            ],
            [
                6097,
                6112
            ],
            [
                6113,
                6209
            ],
            [
                6209,
                6271
            ],
            [
                6275,
                6297
            ],
            [
                6297,
                6364
            ],
            [
                6365,
                6438
            ],
            [
                6438,
                6524
            ],
            [
                6526,
                6529
            ],
            [
                6530,
                6536
            ],
            [
                6540,
                6580
            ],
            [
                6580,
                6632
            ],
            [
                6632,
                6678
            ],
            [
                6679,
                6685
            ],
            [
                6686,
                6694
            ],
            [
                6695,
                6712
            ],
            [
                6713,
                6720
            ],
            [
                6721,
                6732
            ],
            [
                6732,
                6788
            ],
            [
                6798,
                6815
            ],
            [
                6816,
                6929
            ],
            [
                6930,
                6954
            ],
            [
                6954,
                6997
            ],
            [
                6997,
                6998
            ],
            [
                6998,
                7023
            ],
            [
                7027,
                7045
            ],
            [
                7054,
                7098
            ],
            [
                7098,
                7159
            ],
            [
                7159,
                7160
            ],
            [
                7160,
                7207
            ],
            [
                7207,
                7216
            ],
            [
                7221,
                7235
            ],
            [
                7238,
                7259
            ],
            [
                7259,
                7360
            ],
            [
                7360,
                7386
            ],
            [
                7387,
                7400
            ],
            [
                7408,
                7423
            ],
            [
                7432,
                7434
            ],
            [
                7434,
                7498
            ],
            [
                7499,
                7590
            ],
            [
                7590,
                7595
            ],
            [
                7601,
                7622
            ],
            [
                7623,
                7626
            ],
            [
                7633,
                7700
            ],
            [
                7704,
                7713
            ],
            [
                7714,
                7770
            ],
            [
                7771,
                7794
            ],
            [
                7794,
                7828
            ],
            [
                7828,
                7829
            ],
            [
                7834,
                7841
            ],
            [
                7842,
                7861
            ],
            [
                7861,
                7901
            ],
            [
                7902,
                7904
            ],
            [
                7907,
                7918
            ],
            [
                7919,
                7930
            ],
            [
                7931,
                7945
            ],
            [
                7952,
                7954
            ],
            [
                7954,
                7973
            ],
            [
                7974,
                7978
            ],
            [
                7979,
                7999
            ],
            [
                8000,
                8001
            ],
            [
                8002,
                8007
            ],
            [
                8020,
                8023
            ],
            [
                8026,
                8029
            ],
            [
                8030,
                8033
            ],
            [
                8034,
                8039
            ],
            [
                8040,
                8048
            ],
            [
                8049,
                8064
            ],
            [
                8065,
                8074
            ],
            [
                8075,
                8086
            ],
            [
                8096,
                8119
            ],
            [
                8119,
                8120
            ],
            [
                8121,
                8157
            ],
            [
                8157,
                8197
            ],
            [
                8205,
                8209
            ],
            [
                8210,
                8223
            ],
            [
                8233,
                8251
            ],
            [
                8251,
                8277
            ],
            [
                8277,
                8279
            ],
            [
                8279,
                8329
            ],
            [
                8333,
                8339
            ],
            [
                8345,
                8348
            ],
            [
                8348,
                8413
            ],
            [
                8413,
                8466
            ],
            [
                8466,
                8467
            ],
            [
                8471,
                8473
            ],
            [
                8478,
                8488
            ],
            [
                8489,
                8491
            ],
            [
                8496,
                8511
            ],
            [
                8514,
                8578
            ],
            [
                8578,
                8581
            ],
            [
                8581,
                8582
            ],
            [
                8582,
                8627
            ],
            [
                8627,
                8645
            ],
            [
                8645,
                8646
            ],
            [
                8647,
                8661
            ],
            [
                8663,
                8694
            ],
            [
                8694,
                8720
            ],
            [
                8720,
                8794
            ],
            [
                8794,
                8796
            ],
            [
                8796,
                8827
            ],
            [
                8827,
                8874
            ],
            [
                8874,
                8896
            ],
            [
                8896,
                8923
            ],
            [
                8923,
                8981
            ],
            [
                8981,
                8992
            ],
            [
                8992,
                9049
            ],
            [
                9049,
                9133
            ],
            [
                9133,
                9160
            ],
            [
                9160,
                9185
            ],
            [
                9188,
                9207
            ],
            [
                9207,
                9225
            ],
            [
                9225,
                9228
            ],
            [
                9229,
                9272
            ],
            [
                9272,
                9352
            ],
            [
                9352,
                9371
            ],
            [
                9371,
                9407
            ],
            [
                9407,
                9408
            ],
            [
                9408,
                9424
            ],
            [
                9424,
                9457
            ],
            [
                9457,
                9536
            ],
            [
                9536,
                9579
            ],
            [
                9579,
                9650
            ],
            [
                9650,
                9670
            ],
            [
                9670,
                9680
            ],
            [
                9680,
                9691
            ],
            [
                9691,
                9701
            ],
            [
                9701,
                9742
            ],
            [
                9743,
                9764
            ],
            [
                9771,
                9774
            ],
            [
                9774,
                9833
            ],
            [
                9833,
                9846
            ],
            [
                9846,
                9871
            ],
            [
                9872,
                9900
            ],
            [
                9903,
                9945
            ],
            [
                9946,
                9971
            ],
            [
                9971,
                9992
            ],
            [
                9992,
                10083
            ],
            [
                10084,
                10100
            ],
            [
                10100,
                10129
            ],
            [
                10130,
                10152
            ],
            [
                10153,
                10175
            ],
            [
                10175,
                10184
            ],
            [
                10186,
                10194
            ],
            [
                10194,
                10219
            ],
            [
                10219,
                10220
            ],
            [
                10220,
                10255
            ],
            [
                10256,
                10263
            ],
            [
                10263,
                10278
            ],
            [
                10278,
                10281
            ],
            [
                10281,
                10294
            ],
            [
                10294,
                10311
            ],
            [
                10312,
                10343
            ],
            [
                10346,
                10362
            ],
            [
                10367,
                10384
            ],
            [
                10385,
                10393
            ],
            [
                10398,
                10400
            ],
            [
                10400,
                10431
            ],
            [
                10431,
                10451
            ],
            [
                10451,
                10501
            ],
            [
                10501,
                10517
            ],
            [
                10517,
                10580
            ],
            [
                10581,
                10655
            ],
            [
                10655,
                10789
            ],
            [
                10789,
                10848
            ],
            [
                10848,
                10850
            ],
            [
                10853,
                10873
            ],
            [
                10873,
                10892
            ]
        ],
        "row_chars": [
            [
                0,
                25
            ],
            [
                25,
                172
            ],
            [
                172,
                262
            ],
            [
                262,
                297
            ],
            [
                297,
                462
            ],
            [
                462,
                462
            ],
            [
                462,
                657
            ],
            [
                657,
                718
            ],
            [
                718,
                783
            ],
            [
                783,
                800
            ],
            [
                800,
                846
            ],
            [
                846,
                933
            ],
            [
                933,
                969
            ],
            [
                969,
                1032
            ],
            [
                1032,
                1098
            ],
            [
                1098,
                1153
            ],
            [
                1153,
                1462
            ],
            [
                1462,
                1462
            ],
            [
                1462,
                1611
            ],
            [
                1611,
                1668
            ],
            [
                1668,
                1713
            ],
            [
                1713,
                1772
            ],
            [
                1772,
                1910
            ],
            [
                1910,
                1969
            ],
            [
                1969,
                2012
            ],
            [
                2012,
                2091
            ],
            [
                2091,
                2091
            ],
            [
                2091,
                2091
            ],
            [
                2091,
                2148
            ],
            [
                2148,
                2148
            ],
            [
                2148,
                2226
            ],
            [
                2226,
                2295
            ],
            [
                2295,
                2354
            ],
            [
                2354,
                2420
            ],
            [
                2420,
                2467
            ],
            [
                2467,
                2529
            ],
            [
                2529,
                2604
            ],
            [
                2604,
                2703
            ],
            [
                2703,
                2748
            ],
            [
                2748,
                2813
            ],
            [
                2813,
                2834
            ],
            [
                2834,
                2880
            ],
            [
                2880,
                2928
            ],
            [
                2928,
                3041
            ],
            [
                3041,
                3117
            ],
            [
                3117,
                3171
            ],
            [
                3171,
                3215
            ],
            [
                3215,
                3230
            ],
            [
                3230,
                3230
            ],
            [
                3230,
                3301
            ],
            [
                3301,
                3326
            ],
            [
                3326,
                3362
            ],
            [
                3362,
                3417
            ],
            [
                3417,
                3495
            ],
            [
                3495,
                3545
            ],
            [
                3545,
                3583
            ],
            [
                3583,
                3634
            ],
            [
                3634,
                3789
            ],
            [
                3789,
                3789
            ],
            [
                3789,
                3789
            ],
            [
                3789,
                3789
            ],
            [
                3789,
                4043
            ],
            [
                4043,
                4087
            ],
            [
                4087,
                4106
            ],
            [
                4106,
                4106
            ],
            [
                4106,
                4234
            ],
            [
                4234,
                4234
            ],
            [
                4234,
                4291
            ],
            [
                4291,
                4313
            ],
            [
                4313,
                4392
            ],
            [
                4392,
                4403
            ],
            [
                4403,
                4403
            ],
            [
                4403,
                4469
            ],
            [
                4469,
                4574
            ],
            [
                4574,
                4721
            ],
            [
                4721,
                4799
            ],
            [
                4799,
                4851
            ],
            [
                4851,
                4888
            ],
            [
                4888,
                4918
            ],
            [
                4918,
                4969
            ],
            [
                4969,
                5063
            ],
            [
                5063,
                5119
            ],
            [
                5119,
                5207
            ],
            [
                5207,
                5304
            ],
            [
                5304,
                5351
            ],
            [
                5351,
                5369
            ],
            [
                5369,
                5402
            ],
            [
                5402,
                5475
            ],
            [
                5475,
                5603
            ],
            [
                5603,
                5623
            ],
            [
                5623,
                5687
            ],
            [
                5687,
                5767
            ],
            [
                5767,
                5831
            ],
            [
                5831,
                5914
            ],
            [
                5914,
                6065
            ],
            [
                6065,
                6097
            ],
            [
                6097,
                6209
            ],
            [
                6209,
                6297
            ],
            [
                6297,
                6365
            ],
            [
                6365,
                6365
            ],
            [
                6365,
                6365
            ],
            [
                6365,
                6438
            ],
            [
                6438,
                6526
            ],
            [
                6526,
                6580
            ],
            [
                6580,
                6580
            ],
            [
                6580,
                6632
            ],
            [
                6632,
                6732
            ],
            [
                6732,
                6954
            ],
            [
                6954,
                6997
            ],
            [
                6997,
                7026
            ],
            [
                7026,
                7026
            ],
            [
                7026,
                7026
            ],
            [
                7026,
                7098
            ],
            [
                7098,
                7159
            ],
            [
                7159,
                7207
            ],
            [
                7207,
                7238
            ],
            [
                7238,
                7238
            ],
            [
                7238,
                7238
            ],
            [
                7238,
                7259
            ],
            [
                7259,
                7360
            ],
            [
                7360,
                7360
            ],
            [
                7360,
                7360
            ],
            [
                7360,
                7360
            ],
            [
                7360,
                7434
            ],
            [
                7434,
                7590
            ],
            [
                7590,
                7590
            ],
            [
                7590,
                7700
            ],
            [
                7700,
                7794
            ],
            [
                7794,
                7861
            ],
            [
                7861,
                7954
            ],
            [
                7954,
                7954
            ],
            [
                7954,
                8121
            ],
            [
                8121,
                8121
            ],
            [
                8121,
                8121
            ],
            [
                8121,
                8157
            ],
            [
                8157,
                8251
            ],
            [
                8251,
                8279
            ],
            [
                8279,
                8348
            ],
            [
                8348,
                8413
            ],
            [
                8413,
                8466
            ],
            [
                8466,
                8514
            ],
            [
                8514,
                8514
            ],
            [
                8514,
                8581
            ],
            [
                8581,
                8627
            ],
            [
                8627,
                8627
            ],
            [
                8627,
                8663
            ],
            [
                8663,
                8663
            ],
            [
                8663,
                8663
            ],
            [
                8663,
                8720
            ],
            [
                8720,
                8796
            ],
            [
                8796,
                8827
            ],
            [
                8827,
                8874
            ],
            [
                8874,
                8896
            ],
            [
                8896,
                8923
            ],
            [
                8923,
                8981
            ],
            [
                8981,
                8992
            ],
            [
                8992,
                9049
            ],
            [
                9049,
                9133
            ],
            [
                9133,
                9160
            ],
            [
                9160,
                9188
            ],
            [
                9188,
                9207
            ],
            [
                9207,
                9225
            ],
            [
                9225,
                9272
            ],
            [
                9272,
                9352
            ],
            [
                9352,
                9371
            ],
            [
                9371,
                9407
            ],
            [
                9407,
                9424
            ],
            [
                9424,
                9457
            ],
            [
                9457,
                9536
            ],
            [
                9536,
                9579
            ],
            [
                9579,
                9650
            ],
            [
                9650,
                9650
            ],
            [
                9650,
                9670
            ],
            [
                9670,
                9680
            ],
            [
                9680,
                9691
            ],
            [
                9691,
                9701
            ],
            [
                9701,
                9701
            ],
            [
                9701,
                9774
            ],
            [
                9774,
                9833
            ],
            [
                9833,
                9846
            ],
            [
                9846,
                9846
            ],
            [
                9846,
                9903
            ],
            [
                9903,
                9945
            ],
            [
                9945,
                9945
            ],
            [
                9945,
                9971
            ],
            [
                9971,
                9971
            ],
            [
                9971,
                9971
            ],
            [
                9971,
                9971
            ],
            [
                9971,
                9971
            ],
            [
                9971,
                9971
            ],
            [
                9971,
                9992
            ],
            [
                9992,
                10100
            ],
            [
                10100,
                10175
            ],
            [
                10175,
                10194
            ],
            [
                10194,
                10194
            ],
            [
                10194,
                10219
            ],
            [
                10219,
                10281
            ],
            [
                10281,
                10294
            ],
            [
                10294,
                10365
            ],
            [
                10365,
                10365
            ],
            [
                10365,
                10400
            ],
            [
                10400,
                10431
            ],
            [
                10431,
                10451
            ],
            [
                10451,
                10451
            ],
            [
                10451,
                10501
            ],
            [
                10501,
                10517
            ],
            [
                10517,
                10581
            ],
            [
                10581,
                10789
            ],
            [
                10789,
                10848
            ],
            [
                10848,
                10873
            ],
            [
                10873,
                10892
            ]
        ]
    }
}