{
    "original": {
        "text": "Mr. Grey's answer to Alice Vavasor's letter, which was duly sent by return of post and duly received on the morning after Lady Macleod's visit, may perhaps be taken as giving a sample of his worthiness. It was dated from Nethercoats, a small country-house in Cambridgeshire which belonged to him, at which he already spent much of his time, and at which he intended to live altogether after his marriage.\nNethercoats, June, 186--.\nDEAREST ALICE,\nI am glad you have settled your affairs,--foreign affairs, I mean,--so much to your mind. As to your home affairs they are not, to my thinking, quite so satisfactorily arranged. But as I am a party interested in the latter my opinion may perhaps have an undue bias. Touching the tour, I quite agree with you that you and Kate would have been uncomfortable alone. It's a very fine theory, that of women being able to get along without men as well as with them; but, like other fine theories, it will be found very troublesome by those who first put it in practice. Gloved hands, petticoats, feminine softness, and the general homage paid to beauty, all stand in the way of success. These things may perhaps some day be got rid of, and possibly with advantage; but while young ladies are still encumbered with them a male companion will always be found to be a comfort. I don't quite know whether your cousin George is the best possible knight you might have chosen. I should consider myself to be infinitely preferable, had my going been upon the cards. Were you in danger of meeting Paynim foes, he, no doubt, would kill them off much quicker than I could do, and would be much more serviceable in liberating you from the dungeons of oppressors, or even from stray tigers in the Swiss forests. But I doubt his being punctual with the luggage. He will want you or Kate to keep the accounts, if any are kept. He will be slow in getting you glasses of water at the railway stations, and will always keep you waiting at breakfast. I hold that a man with two ladies on a tour should be an absolute slave to them, or they will not fully enjoy themselves. He should simply be an upper servant, with the privilege of sitting at the same table with his mistresses. I have my doubts as to whether your cousin is fit for the place; but, as to myself, it is just the thing that I was made for. Luckily, however, neither you nor Kate are without wills of your own, and perhaps you may be able to reduce Mr. Vavasor to obedience.\nAs to the home affairs I have very little to say here,--in this letter. I shall of course run up and see you before you start, and shall probably stay a week in town. I know I ought not to do so, as it will be a week of idleness, and yet not a week of happiness. I'd sooner have an hour with you in the country than a whole day in London. And I always feel in town that I've too much to do to allow of my doing anything. If it were sheer idleness I could enjoy it, but it is a feverish idleness, in which one is driven here and there, expecting some gratification which not only never comes, but which never even begins to come. I will, however, undergo a week of it,--say the last seven days of this month, and shall trust to you to recompense me by as much of yourself as your town doings will permit.\nAnd now again as to those home affairs. If I say nothing now I believe you will understand why I refrain. You have cunningly just left me to imply, from what you say, that all my arguments have been of no avail; but you do not answer them, or even tell me that you have decided. I shall therefore imply nothing, and still trust to my personal eloquence for success. Or rather not trust,--not trust, but hope.\nThe garden is going on very well. We are rather short of water, and therefore not quite as bright as I had hoped; but we are preparing with untiring industry for future brightness. Your commands have been obeyed in all things, and Morrison always says \"The mistress didn't mean this,\" or \"The mistress did intend that.\" God bless the mistress is what I now say, and send her home, to her own home, to her flowers, and her fruit, and her house, and her husband, as soon as may be, with no more of these delays which are to me so grievous, and which seem to me to be so unnecessary. That is my prayer.\nYours ever and always,\nJ. G.\n\"I didn't give commands,\" Alice said to herself, as she sat with the letter at her solitary breakfast-table. \"He asked me how I liked the things, and of course I was obliged to say. I was obliged to seem to care, even if I didn't care.\" Such were her first thoughts as she put the letter back into its envelope, after reading it the second time. When she opened it, which she did quickly, not pausing a moment lest she should suspect herself of fearing to see what might be its contents, her mind was full of that rebuke which her aunt had anticipated, and which she had almost taught herself to expect. She had torn the letter open rapidly, and had dashed at its contents with quick eyes. In half a moment she had seen what was the nature of the reply respecting the proposed companion of her tour, and then she had completed her reading slowly enough. \"No; I gave no commands,\" she repeated to herself, as though she might thereby absolve herself from blame in reference to some possible future accusations, which might perhaps be brought against her under certain circumstances which she was contemplating.\nThen she considered the letter bit by bit, taking it backwards, and sipping her tea every now and then amidst her thoughts. No; she had no home, no house, there. She had no husband;--not as yet. He spoke of their engagement as though it were a betrothal, as betrothals used to be of yore; as though they were already in some sort married. Such betrothals were not made now-a-days. There still remained, both to him and to her, a certain liberty of extricating themselves from this engagement. Should he come to her and say that he found that their contemplated marriage would not make him happy, would not she release him without a word of reproach? Would not she regard him as much more honourable in doing so than in adhering to a marriage which was distasteful to him? And if she would so judge him,--judge him and certainly acquit him, was it not reasonable that she under similar circumstances should expect a similar acquittal? Then she declared to herself that she carried on this argument within her own breast simply as an argument, induced to do so by that assertion on his part that he was already her husband,--that his house was even now her home. She had no intention of using that power which was still hers. She had no wish to go back from her pledged word. She thought that she had no such wish. She loved him much, and admired him even more than she loved him. He was noble, generous, clever, good,--so good as to be almost perfect; nay, for aught she knew he was perfect. Would that he had some faults! Would that he had! Would that he had! How could she, full of faults as she knew herself to be,--how could she hope to make happy a man perfect as he was! But then there would be no doubt as to her present duty. She loved him, and that was everything. Having told him that she loved him, and having on that score accepted his love, nothing but a change in her heart towards him could justify her in seeking to break the bond which bound them together. She did love him, and she loved him only.\nBut she had once loved her cousin. Yes, truly it was so. In her thoughts she did not now deny it. She had loved him, and was tormented by a feeling that she had had a more full delight in that love than in this other that had sprung up subsequently. She had told herself that this had come of her youth;--that love at twenty was sweeter than it could be afterwards. There had been a something of rapture in that earlier dream which could never be repeated,--which could never live, indeed, except in a dream. Now, now that she was older and perhaps wiser, love meant a partnership, in which each partner would be honest to the other, in which each would wish and strive for the other's welfare, so that thus their joint welfare might be insured. Then, in those early girlish days, it had meant a total abnegation of self. The one was of earth, and therefore possible. The other had been a ray from heaven,--and impossible, except in a dream.\nAnd she had been mistaken in her first love. She admitted that frankly. He whom she had worshipped had been an idol of clay, and she knew that it was well for her to have abandoned that idolatry. He had not only been untrue to her, but, worse than that, had been false in excusing his untruth. He had not only promised falsely, but had made such promises with a deliberate, premeditated falsehood. And he had been selfish, coldly selfish, weighing the value of his own low lusts against that of her holy love. She had known this, and had parted from him with an oath to herself that no promised contrition on his part should ever bring them again together. But she had pardoned him as a man, though never as a lover, and had bade him welcome again as a cousin and as her friend's brother. She had again become very anxious as to his career, not hiding her regard, but professing that anxiety aloud. She knew him to be clever, ambitious, bold,--and she believed even yet, in spite of her own experience, that he might not be bad at heart. Now, as she told herself that in truth she loved the man to whom her troth was plighted, I fear that she almost thought more of that other man from whom she had torn herself asunder.\n\"Why should he find himself unhappy in London?\" she said, as she went back to the letter. \"Why should he pretend to condemn the very place which most men find the fittest for all their energies? Were I a man, no earthly consideration should induce me to live elsewhere. It is odd how we differ in all things. However brilliant might be his own light, he would be contented to hide it under a bushel!\"\nAnd at last she recurred to that matter as to which she had been so anxious when she first opened her lover's letter. It will be remembered how assured she had expressed herself that Mr. Grey would not condescend to object to her travelling with her cousin. He had not so condescended. He had written on the matter with a pleasant joke, like a gentleman as he was, disdaining to allude to the past passages in the life of her whom he loved, abstaining even from expressing anything that might be taken as a permission on his part. There had been in Alice's words, as she told him of their proposed plan, a something that had betrayed a tremor in her thoughts. She had studiously striven so to frame her phrases that her tale might be told as any other simple statement,--as though there had been no trembling in her mind as she wrote. But she had failed, and she knew that she had failed. She had failed; and he had read all her effort and all her failure. She was quite conscious of this; she felt it thoroughly; and she knew that he was noble and a gentleman to the last drop of his blood. And yet--yet--yet there was almost a feeling of disappointment in that he had not written such a letter as Lady Macleod had anticipated.\nDuring the next week Lady Macleod still came almost daily to Queen Anne Street, but nothing further was said between her and Miss Vavasor as to the Swiss tour; nor were any questions asked about Mr. Grey's opinion on the subject. The old lady of course discovered that there was no quarrel, or, as she believed, any probability of a quarrel; and with that she was obliged to be contented. Nor did she again on this occasion attempt to take Alice to Lady Midlothian's. Indeed, their usual subjects of conversation were almost abandoned, and Lady Macleod's visits, though they were as constant as heretofore, were not so long. She did not dare to talk about Mr. Grey, and because she did not so dare, was determined to regard herself as in a degree ill-used. So she was silent, reserved, and fretful. At length came the last day of her London season, and her last visit to her niece. \"I would come because it's my last day,\" said Lady Macleod; \"but really I'm so hurried, and have so many things to do, that I hardly know how to manage it.\"\n\"It's very kind,\" said Alice, giving her aunt an affectionate squeeze of the hand.\n\"I'm keeping the cab, so I can just stay twenty-five minutes. I've marked the time accurately, but I know the man will swear it's over the half-hour.\"\n\"You'll have no more trouble about cabs, aunt, when you are back in Cheltenham.\"\n\"The flies are worse, my dear. I really think they're worse. I pay the bill every month, but they've always one down that I didn't have. It's the regular practice, for I've had them from all the men in the place.\"\n\"It's hard enough to find honest men anywhere, I suppose.\"\n\"Or honest women either. What do you think of Mrs. Green wanting to charge me for an extra week, because she says I didn't give her notice till Tuesday morning? I won't pay her, and she may stop my things if she dares. However, it's the last time. I shall never come up to London again, my dear.\"\n\"Oh, aunt, don't say that!\"\n\"But I do say it, my dear. What should an old woman like me do, trailing up to town every year, merely because it's what people choose to call the season.\"\n\"To see your friends, of course. Age doesn't matter when a person's health is so good as yours.\"\n\"If you knew what I suffer from lumbago,--though I must say coming to London always does cure that for the time. But as for friends--! Well, I suppose one has no right to complain when one gets to be as old as I am; but I declare I believe that those I love best would sooner be without me than with me.\"\n\"Do you mean me, aunt?\"\n\"No, my dear, I don't mean you. Of course my life would have been very different if you could have consented to remain with me till you were married. But I didn't mean you. I don't know that I meant any one. You shouldn't mind what an old woman like me says.\"\n\"You're a little melancholy because you're going away.\"\n\"No, indeed. I don't know why I stayed the last week. I did say to Lady Midlothian that I thought I should go on the 20th; and, though I know that she knew that I really didn't go, she has not once sent to me since. To be sure they've been out every night; but I thought she might have asked me to come and lunch. It's so very lonely dining by myself in lodgings in London.\"\n\"And yet you never will come and dine with me.\"\n\"No, my dear; no. But we won't talk about that. I've just one word more to say. Let me see. I've just six minutes to stay. I've made up my mind that I'll never come up to town again,--except for one thing.\"\n\"And what's that, aunt?\" Alice, as she asked the question, well knew what that one thing was.\n\"I'll come for your marriage, my dear. I do hope you will not keep me long waiting.\"\n\"Ah! I can't make any promise. There's no knowing when that may be.\"\n\"And why should there be no knowing? I always think that when a girl is once engaged the sooner she's married the better. There may be reasons for delay on the gentleman's part.\"\n\"There very often are, you know,\"\n\"But, Alice, you don't mean to say that Mr. Grey is putting it off?\"\nAlice was silent for a moment, during which Lady Macleod's face assumed a look of almost tragic horror. Was there something wrong on Mr. Grey's side of which she was altogether unaware? Alice, though for a second or two she had been guilty of a slight playful deceit, was too honest to allow the impression to remain. \"No, aunt,\" she said; \"Mr. Grey is not putting it off. It has been left to me to fix the time.\"\n\"And why don't you fix it?\"\n\"It is such a serious thing! After all it is not more than four months yet since I--I accepted him. I don't know that there has been any delay.\"\n\"But you might fix the time now, if he wishes it.\"\n\"Well, perhaps I shall,--some day, aunt. I'm going to think about it, and you mustn't drive me.\"\n\"But you should have some one to advise you, Alice.\"\n\"Ah! that's just it. People always do seem to think it so terrible that a girl should have her own way in anything. She mustn't like any one at first; and then, when she does like some one, she must marry him directly she's bidden. I haven't much of my own way at present; but you see, when I'm married I shan't have it at all. You can't wonder that I shouldn't be in a hurry.\"\n\"I am not advocating anything like hurry, my dear. But, goodness gracious me! I've been here twenty-eight minutes, and that horrid man will impose upon me. Good-bye; God bless you! Mind you write.\" And Lady Macleod hurried out of the room more intent at the present moment upon saving her sixpence than she was on any other matter whatsoever.\nAnd then John Grey came up to town, arriving a day or two after the time that he had fixed. It is not, perhaps, improbable that Alice had used some diplomatic skill in preventing a meeting between Lady Macleod and her lover. They both were very anxious to obtain the same object, and Alice was to some extent opposed to their views. Had Lady Macleod and John Grey put their forces together she might have found herself unable to resist their joint endeavours. She was resolved that she would not at any rate name any day for her marriage before her return from Switzerland; and she may therefore have thought it wise to keep Mr. Grey in the country till after Lady Macleod had gone, even though she thereby cut down the time of his sojourn in London to four days. On the occasion of that visit Mr. Vavasor did a very memorable thing. He dined at home with the view of welcoming his future son-in-law. He dined at home, and asked, or rather assented to Alice's asking, George and Kate Vavasor to join the dinner-party. \"What an auspicious omen for the future nuptials!\" said Kate, with her little sarcastic smile. \"Uncle John dines at home, and Mr. Grey joins in the dissipation of a dinner-party. We shall all be changed soon, I suppose, and George and I will take to keeping a little cottage in the country.\"\n\"Kate,\" said Alice, angrily, \"I think you are about the most unjust person I ever met. I would forgive your raillery, however painful it might be, if it were only fair.\"\n\"And to whom is it unfair on the present occasion;--to your father?\"\n\"It was not intended for him.\"\n\"To yourself?\"\n\"I care nothing as to myself; you know that very well.\"\n\"Then it must have been unfair to Mr. Grey.\"\n\"Yes; it was Mr. Grey whom you meant to attack. If I can forgive him for not caring for society, surely you might do so.\"\n\"Exactly; but that's just what you can't do, my dear. You don't forgive him. If you did you might be quite sure that I should say nothing. And if you choose to bid me hold my tongue I will say nothing. But when you tell me all your own thoughts about this thing you can hardly expect but that I should let you know mine in return. I'm not particular; and if you are ready for a little good, wholesome, useful hypocrisy, I won't balk you. I mayn't be quite so dishonest as you call me, but I'm not so wedded to truth but what I can look, and act, and speak a few falsehoods if you wish it. Only let us understand each other.\"\n\"You know I wish for no falsehood, Kate.\"\n\"I know it's very hard to understand what you do wish. I know that for the last year or two I have been trying to find out your wishes, and, upon my word, my success has been very indifferent. I suppose you wish to marry Mr. Grey, but I'm by no means certain. I suppose the last thing on earth you'd wish would be to marry George?\"\n\"The very last. You're right there at any rate.\"\n\"Alice--! sometimes you drive me too hard; you do, indeed. You make me doubt whether I hate or love you most. Knowing what my feelings are about George, I cannot understand how you can bring yourself to speak of him to me with such contempt!\" Kate Vavasor, as she spoke these words, left the room with a quick step, and hurried up to her own chamber. There Alice found her in tears, and was driven by her friend's real grief into the expression of an apology, which she knew was not properly due from her. Kate was acquainted with all the circumstances of that old affair between her brother and Alice. She had given in her adhesion to the propriety of what Alice had done. She had allowed that her brother George's behaviour had been such as to make any engagement between them impossible. The fault, therefore, had been hers in making any reference to the question of such a marriage. Nor had it been by any means her first fault of the same kind. Till Alice had become engaged to Mr. Grey she had spoken of George only as her brother, or as her friend's cousin, but now she was constantly making allusion to those past occurrences, which all of them should have striven to forget. Under these circumstances was not Lady Macleod right in saying that George Vavasor should not have been accepted as a companion for the Swiss tour?\n[Illustration: \"Sometimes you drive me too hard.\"]\nThe little dinner-party went off very quietly; and if no other ground existed for charging Mr. Grey with London dissipation than what that afforded, he was accused most unjustly. The two young men had never before met each other; and Vavasor had gone to his uncle's house, prepared not only to dislike but to despise his successor in Alice's favour. But in this he was either disappointed or gratified, as the case may be. \"He has plenty to say for himself,\" he said to Kate on his way home.\n\"Oh yes; he can talk.\"\n\"And he doesn't talk like a prig either, which was what I expected. He's uncommonly handsome.\"\n\"I thought men never saw that in each other. I never see it in any man.\"\n\"I see it in every animal--in men, women, horses, dogs, and even pigs. I like to look on handsome things. I think people always do who are ugly themselves.\"\n\"And so you're going into raptures in favour of John Grey.\"\n\"No, I'm not. I very seldom go into raptures about anything. But he talks in the way I like a man to talk. How he bowled my uncle over about those actors; and yet if my uncle knows anything about anything it is about the stage twenty years ago.\" There was nothing more said then about John Grey; but Kate understood her brother well enough to be aware that this praise meant very little. George Vavasor spoke sometimes from his heart, and did so more frequently to his sister than to any one else; but his words came generally from his head.\nOn the day after the little dinner in Queen Anne Street, John Grey came to say good-bye to his betrothed;--for his betrothed she certainly was, in spite of those very poor arguments which she had used in trying to convince herself that she was still free if she wished to claim her freedom. Though he had been constantly with Alice during the last three days, he had not hitherto said anything as to the day of their marriage. He had been constantly with her alone, sitting for hours in that ugly green drawing-room, but he had never touched the subject. He had told her much of Switzerland, which she had never yet seen but which he knew well. He had told her much of his garden and house, whither she had once gone with her father, whilst paying a visit nominally to the colleges at Cambridge. And he had talked of various matters, matters bearing in no immediate way upon his own or her affairs; for Mr. Grey was a man who knew well how to make words pleasant; but previous to this last moment he had said nothing on that subject on which he was so intent.\n\"Well, Alice,\" he said, when the last hour had come, \"and about that question of home affairs?\"\n\"Let us finish off the foreign affairs first.\"\n\"We have finished them; haven't we?\"\n\"Finished them! why we haven't started yet.\"\n\"No; you haven't started. But we've had the discussion. Is there any reason why you'd rather not have this thing settled.\"\n\"No; no special reason.\"\n\"Then why not let it be fixed? Do you fear coming to me as my wife?\"\n\"No.\"\n\"I cannot think that you repent your goodness to me.\"\n\"No; I don't repent it;--what you call my goodness? I love you too entirely for that.\"\n\"My darling!\" And now he passed his arm round her waist as they stood near the empty fireplace. \"And if you love me--\"\n\"I do love you.\"\n\"Then why should you not wish to come to me?\"\n\"I do wish it. I think I wish it.\"\n\"But, Alice, you must have wished it altogether when you consented to be my wife.\"\n\"A person may wish for a thing altogether, and yet not wish for it instantly.\"\n\"Instantly! Come; I have not been hard on you. This is still June. Will you say the middle of September, and we shall still be in time for warm pleasant days among the lakes? Is that asking for too much?\"\n\"It is not asking for anything.\"\n\"Nay, but it is, love. Grant it, and I will swear that you have granted me everything.\"\nShe was silent, having things to say but not knowing in what words to put them. Now that he was with her she could not say the things which she had told herself that she would utter to him. She could not bring herself to hint to him that his views of life were so unlike her own, that there could be no chance of happiness between them, unless each could strive to lean somewhat towards the other. No man could be more gracious in word and manner than John Grey; no man more chivalrous in his carriage towards a woman; but he always spoke and acted as though there could be no question that his manner of life was to be adopted, without a word or thought of doubting, by his wife. When two came together, why should not each yield something, and each claim something? This she had meant to say to him on this day; but now that he was with her she could not say it.\n\"John,\" she said at last, \"do not press me about this till I return.\"\n\"But then you will say the time is short. It would be short then.\"\n\"I cannot answer you now;--indeed, I cannot. That is I cannot answer in the affirmative. It is such a solemn thing.\"\n\"Will it ever be less solemn, dearest?\"\n\"Never, I hope never.\"\nHe did not press her further then, but kissed her and bade her farewell.",
        "paragraph_chars": [
            [
                0,
                405
            ],
            [
                405,
                431
            ],
            [
                431,
                446
            ],
            [
                446,
                2462
            ],
            [
                2462,
                3266
            ],
            [
                3266,
                3675
            ],
            [
                3675,
                4275
            ],
            [
                4275,
                4298
            ],
            [
                4298,
                4304
            ],
            [
                4304,
                5414
            ],
            [
                5414,
                7429
            ],
            [
                7429,
                8371
            ],
            [
                8371,
                9592
            ],
            [
                9592,
                9993
            ],
            [
                9993,
                11222
            ],
            [
                11222,
                12261
            ],
            [
                12261,
                12344
            ],
            [
                12344,
                12495
            ],
            [
                12495,
                12576
            ],
            [
                12576,
                12790
            ],
            [
                12790,
                12849
            ],
            [
                12849,
                13146
            ],
            [
                13146,
                13174
            ],
            [
                13174,
                13330
            ],
            [
                13330,
                13427
            ],
            [
                13427,
                13732
            ],
            [
                13732,
                13756
            ],
            [
                13756,
                14016
            ],
            [
                14016,
                14072
            ],
            [
                14072,
                14447
            ],
            [
                14447,
                14495
            ],
            [
                14495,
                14702
            ],
            [
                14702,
                14796
            ],
            [
                14796,
                14881
            ],
            [
                14881,
                14950
            ],
            [
                14950,
                15129
            ],
            [
                15129,
                15163
            ],
            [
                15163,
                15232
            ],
            [
                15232,
                15646
            ],
            [
                15646,
                15674
            ],
            [
                15674,
                15819
            ],
            [
                15819,
                15870
            ],
            [
                15870,
                15967
            ],
            [
                15967,
                16020
            ],
            [
                16020,
                16398
            ],
            [
                16398,
                16741
            ],
            [
                16741,
                18051
            ],
            [
                18051,
                18221
            ],
            [
                18221,
                18290
            ],
            [
                18290,
                18321
            ],
            [
                18321,
                18336
            ],
            [
                18336,
                18392
            ],
            [
                18392,
                18437
            ],
            [
                18437,
                18559
            ],
            [
                18559,
                19184
            ],
            [
                19184,
                19226
            ],
            [
                19226,
                19558
            ],
            [
                19558,
                19607
            ],
            [
                19607,
                20939
            ],
            [
                20939,
                20990
            ],
            [
                20990,
                21482
            ],
            [
                21482,
                21505
            ],
            [
                21505,
                21600
            ],
            [
                21600,
                21673
            ],
            [
                21673,
                21830
            ],
            [
                21830,
                21890
            ],
            [
                21890,
                22432
            ],
            [
                22432,
                23492
            ],
            [
                23492,
                23588
            ],
            [
                23588,
                23635
            ],
            [
                23635,
                23672
            ],
            [
                23672,
                23717
            ],
            [
                23717,
                23840
            ],
            [
                23840,
                23865
            ],
            [
                23865,
                23934
            ],
            [
                23934,
                23940
            ],
            [
                23940,
                23994
            ],
            [
                23994,
                24081
            ],
            [
                24081,
                24200
            ],
            [
                24200,
                24217
            ],
            [
                24217,
                24263
            ],
            [
                24263,
                24298
            ],
            [
                24298,
                24381
            ],
            [
                24381,
                24460
            ],
            [
                24460,
                24665
            ],
            [
                24665,
                24698
            ],
            [
                24698,
                24786
            ],
            [
                24786,
                25651
            ],
            [
                25651,
                25721
            ],
            [
                25721,
                25788
            ],
            [
                25788,
                25905
            ],
            [
                25905,
                25945
            ],
            [
                25945,
                25968
            ],
            [
                25968,
                26040
            ]
        ],
        "segment_chars": [
            [
                0,
                203
            ],
            [
                203,
                405
            ],
            [
                405,
                431
            ],
            [
                431,
                446
            ],
            [
                446,
                536
            ],
            [
                536,
                624
            ],
            [
                624,
                712
            ],
            [
                712,
                809
            ],
            [
                809,
                1010
            ],
            [
                1010,
                1127
            ],
            [
                1127,
                1314
            ],
            [
                1314,
                1411
            ],
            [
                1411,
                1499
            ],
            [
                1499,
                1740
            ],
            [
                1740,
                1789
            ],
            [
                1789,
                1853
            ],
            [
                1853,
                1973
            ],
            [
                1973,
                2095
            ],
            [
                2095,
                2202
            ],
            [
                2202,
                2328
            ],
            [
                2328,
                2462
            ],
            [
                2462,
                2534
            ],
            [
                2534,
                2629
            ],
            [
                2629,
                2725
            ],
            [
                2725,
                2801
            ],
            [
                2801,
                2883
            ],
            [
                2883,
                3091
            ],
            [
                3091,
                3266
            ],
            [
                3266,
                3306
            ],
            [
                3306,
                3372
            ],
            [
                3372,
                3545
            ],
            [
                3545,
                3632
            ],
            [
                3632,
                3675
            ],
            [
                3675,
                3709
            ],
            [
                3709,
                3856
            ],
            [
                3856,
                3995
            ],
            [
                3995,
                4256
            ],
            [
                4256,
                4275
            ],
            [
                4275,
                4298
            ],
            [
                4298,
                4304
            ],
            [
                4304,
                4413
            ],
            [
                4413,
                4486
            ],
            [
                4486,
                4541
            ],
            [
                4541,
                4650
            ],
            [
                4650,
                4908
            ],
            [
                4908,
                4994
            ],
            [
                4994,
                5158
            ],
            [
                5158,
                5414
            ],
            [
                5414,
                5538
            ],
            [
                5538,
                5576
            ],
            [
                5576,
                5609
            ],
            [
                5609,
                5753
            ],
            [
                5753,
                5795
            ],
            [
                5795,
                5907
            ],
            [
                5907,
                6064
            ],
            [
                6064,
                6186
            ],
            [
                6186,
                6348
            ],
            [
                6348,
                6575
            ],
            [
                6575,
                6638
            ],
            [
                6638,
                6688
            ],
            [
                6688,
                6727
            ],
            [
                6727,
                6793
            ],
            [
                6793,
                6905
            ],
            [
                6905,
                6936
            ],
            [
                6936,
                6955
            ],
            [
                6955,
                6974
            ],
            [
                6974,
                7090
            ],
            [
                7090,
                7147
            ],
            [
                7147,
                7187
            ],
            [
                7187,
                7387
            ],
            [
                7387,
                7429
            ],
            [
                7429,
                7464
            ],
            [
                7464,
                7486
            ],
            [
                7486,
                7527
            ],
            [
                7527,
                7679
            ],
            [
                7679,
                7795
            ],
            [
                7795,
                7938
            ],
            [
                7938,
                8175
            ],
            [
                8175,
                8251
            ],
            [
                8251,
                8297
            ],
            [
                8297,
                8371
            ],
            [
                8371,
                8416
            ],
            [
                8416,
                8443
            ],
            [
                8443,
                8567
            ],
            [
                8567,
                8665
            ],
            [
                8665,
                8769
            ],
            [
                8769,
                8881
            ],
            [
                8881,
                9028
            ],
            [
                9028,
                9160
            ],
            [
                9160,
                9270
            ],
            [
                9270,
                9409
            ],
            [
                9409,
                9592
            ],
            [
                9592,
                9640
            ],
            [
                9640,
                9682
            ],
            [
                9682,
                9787
            ],
            [
                9787,
                9862
            ],
            [
                9862,
                9901
            ],
            [
                9901,
                9993
            ],
            [
                9993,
                10111
            ],
            [
                10111,
                10251
            ],
            [
                10251,
                10279
            ],
            [
                10279,
                10524
            ],
            [
                10524,
                10653
            ],
            [
                10653,
                10828
            ],
            [
                10828,
                10882
            ],
            [
                10882,
                10950
            ],
            [
                10950,
                11085
            ],
            [
                11085,
                11222
            ],
            [
                11222,
                11452
            ],
            [
                11452,
                11611
            ],
            [
                11611,
                11690
            ],
            [
                11690,
                11847
            ],
            [
                11847,
                11979
            ],
            [
                11979,
                12021
            ],
            [
                12021,
                12104
            ],
            [
                12104,
                12261
            ],
            [
                12261,
                12344
            ],
            [
                12344,
                12406
            ],
            [
                12406,
                12495
            ],
            [
                12495,
                12576
            ],
            [
                12576,
                12607
            ],
            [
                12607,
                12637
            ],
            [
                12637,
                12713
            ],
            [
                12713,
                12790
            ],
            [
                12790,
                12849
            ],
            [
                12849,
                12874
            ],
            [
                12874,
                13010
            ],
            [
                13010,
                13068
            ],
            [
                13068,
                13097
            ],
            [
                13097,
                13146
            ],
            [
                13146,
                13174
            ],
            [
                13174,
                13201
            ],
            [
                13201,
                13330
            ],
            [
                13330,
                13363
            ],
            [
                13363,
                13427
            ],
            [
                13427,
                13540
            ],
            [
                13540,
                13562
            ],
            [
                13562,
                13732
            ],
            [
                13732,
                13756
            ],
            [
                13756,
                13788
            ],
            [
                13788,
                13906
            ],
            [
                13906,
                13929
            ],
            [
                13929,
                13964
            ],
            [
                13964,
                14016
            ],
            [
                14016,
                14072
            ],
            [
                14072,
                14085
            ],
            [
                14085,
                14126
            ],
            [
                14126,
                14288
            ],
            [
                14288,
                14386
            ],
            [
                14386,
                14447
            ],
            [
                14447,
                14495
            ],
            [
                14495,
                14513
            ],
            [
                14513,
                14543
            ],
            [
                14543,
                14575
            ],
            [
                14575,
                14587
            ],
            [
                14587,
                14618
            ],
            [
                14618,
                14702
            ],
            [
                14702,
                14727
            ],
            [
                14727,
                14796
            ],
            [
                14796,
                14835
            ],
            [
                14835,
                14881
            ],
            [
                14881,
                14886
            ],
            [
                14886,
                14912
            ],
            [
                14912,
                14950
            ],
            [
                14950,
                14987
            ],
            [
                14987,
                15072
            ],
            [
                15072,
                15129
            ],
            [
                15129,
                15163
            ],
            [
                15163,
                15232
            ],
            [
                15232,
                15336
            ],
            [
                15336,
                15418
            ],
            [
                15418,
                15550
            ],
            [
                15550,
                15605
            ],
            [
                15605,
                15646
            ],
            [
                15646,
                15674
            ],
            [
                15674,
                15703
            ],
            [
                15703,
                15774
            ],
            [
                15774,
                15819
            ],
            [
                15819,
                15870
            ],
            [
                15870,
                15911
            ],
            [
                15911,
                15967
            ],
            [
                15967,
                16020
            ],
            [
                16020,
                16025
            ],
            [
                16025,
                16041
            ],
            [
                16041,
                16136
            ],
            [
                16136,
                16252
            ],
            [
                16252,
                16348
            ],
            [
                16348,
                16398
            ],
            [
                16398,
                16449
            ],
            [
                16449,
                16476
            ],
            [
                16476,
                16554
            ],
            [
                16554,
                16579
            ],
            [
                16579,
                16596
            ],
            [
                16596,
                16741
            ],
            [
                16741,
                16833
            ],
            [
                16833,
                16966
            ],
            [
                16966,
                17074
            ],
            [
                17074,
                17201
            ],
            [
                17201,
                17505
            ],
            [
                17505,
                17575
            ],
            [
                17575,
                17642
            ],
            [
                17642,
                17759
            ],
            [
                17759,
                17810
            ],
            [
                17810,
                17854
            ],
            [
                17854,
                17938
            ],
            [
                17938,
                18051
            ],
            [
                18051,
                18138
            ],
            [
                18138,
                18221
            ],
            [
                18221,
                18290
            ],
            [
                18290,
                18321
            ],
            [
                18321,
                18336
            ],
            [
                18336,
                18392
            ],
            [
                18392,
                18437
            ],
            [
                18437,
                18485
            ],
            [
                18485,
                18559
            ],
            [
                18559,
                18613
            ],
            [
                18613,
                18636
            ],
            [
                18636,
                18698
            ],
            [
                18698,
                18761
            ],
            [
                18761,
                18890
            ],
            [
                18890,
                18997
            ],
            [
                18997,
                19148
            ],
            [
                19148,
                19184
            ],
            [
                19184,
                19226
            ],
            [
                19226,
                19281
            ],
            [
                19281,
                19419
            ],
            [
                19419,
                19486
            ],
            [
                19486,
                19558
            ],
            [
                19558,
                19574
            ],
            [
                19574,
                19607
            ],
            [
                19607,
                19617
            ],
            [
                19617,
                19666
            ],
            [
                19666,
                19717
            ],
            [
                19717,
                19850
            ],
            [
                19850,
                19958
            ],
            [
                19958,
                20113
            ],
            [
                20113,
                20210
            ],
            [
                20210,
                20281
            ],
            [
                20281,
                20398
            ],
            [
                20398,
                20494
            ],
            [
                20494,
                20557
            ],
            [
                20557,
                20791
            ],
            [
                20791,
                20939
            ],
            [
                20939,
                20990
            ],
            [
                20990,
                21169
            ],
            [
                21169,
                21340
            ],
            [
                21340,
                21413
            ],
            [
                21413,
                21482
            ],
            [
                21482,
                21505
            ],
            [
                21505,
                21573
            ],
            [
                21573,
                21600
            ],
            [
                21600,
                21645
            ],
            [
                21645,
                21673
            ],
            [
                21673,
                21744
            ],
            [
                21744,
                21779
            ],
            [
                21779,
                21830
            ],
            [
                21830,
                21890
            ],
            [
                21890,
                21904
            ],
            [
                21904,
                21951
            ],
            [
                21951,
                21997
            ],
            [
                21997,
                22136
            ],
            [
                22136,
                22278
            ],
            [
                22278,
                22432
            ],
            [
                22432,
                22723
            ],
            [
                22723,
                22859
            ],
            [
                22859,
                22987
            ],
            [
                22987,
                23077
            ],
            [
                23077,
                23228
            ],
            [
                23228,
                23492
            ],
            [
                23492,
                23588
            ],
            [
                23588,
                23635
            ],
            [
                23635,
                23672
            ],
            [
                23672,
                23688
            ],
            [
                23688,
                23717
            ],
            [
                23717,
                23743
            ],
            [
                23743,
                23773
            ],
            [
                23773,
                23840
            ],
            [
                23840,
                23865
            ],
            [
                23865,
                23896
            ],
            [
                23896,
                23934
            ],
            [
                23934,
                23940
            ],
            [
                23940,
                23994
            ],
            [
                23994,
                24046
            ],
            [
                24046,
                24081
            ],
            [
                24081,
                24095
            ],
            [
                24095,
                24177
            ],
            [
                24177,
                24200
            ],
            [
                24200,
                24217
            ],
            [
                24217,
                24263
            ],
            [
                24263,
                24278
            ],
            [
                24278,
                24298
            ],
            [
                24298,
                24381
            ],
            [
                24381,
                24460
            ],
            [
                24460,
                24472
            ],
            [
                24472,
                24507
            ],
            [
                24507,
                24527
            ],
            [
                24527,
                24635
            ],
            [
                24635,
                24665
            ],
            [
                24665,
                24698
            ],
            [
                24698,
                24721
            ],
            [
                24721,
                24786
            ],
            [
                24786,
                24866
            ],
            [
                24866,
                24976
            ],
            [
                24976,
                25184
            ],
            [
                25184,
                25467
            ],
            [
                25467,
                25554
            ],
            [
                25554,
                25651
            ],
            [
                25651,
                25721
            ],
            [
                25721,
                25763
            ],
            [
                25763,
                25788
            ],
            [
                25788,
                25833
            ],
            [
                25833,
                25877
            ],
            [
                25877,
                25905
            ],
            [
                25905,
                25945
            ],
            [
                25945,
                25968
            ],
            [
                25968,
                26040
            ]
        ],
        "overlap_chars": [
            [
                21,
                26
            ],
            [
                92,
                100
            ],
            [
                127,
                128
            ],
            [
                2,
                20
            ],
            [
                37,
                43
            ],
            [
                104,
                107
            ],
            [
                108,
                115
            ],
            [
                201,
                203
            ],
            [
                203,
                209
            ],
            [
                297,
                299
            ],
            [
                221,
                233
            ],
            [
                236,
                273
            ],
            [
                295,
                296
            ],
            [
                306,
                308
            ],
            [
                317,
                344
            ],
            [
                357,
                373
            ],
            [
                385,
                405
            ],
            [
                431,
                446
            ],
            [
                446,
                477
            ],
            [
                488,
                503
            ],
            [
                514,
                529
            ],
            [
                534,
                536
            ],
            [
                536,
                538
            ],
            [
                542,
                559
            ],
            [
                560,
                624
            ],
            [
                624,
                635
            ],
            [
                655,
                657
            ],
            [
                680,
                683
            ],
            [
                710,
                711
            ],
            [
                721,
                744
            ],
            [
                754,
                809
            ],
            [
                809,
                832
            ],
            [
                834,
                838
            ],
            [
                842,
                847
            ],
            [
                862,
                883
            ],
            [
                884,
                891
            ],
            [
                904,
                989
            ],
            [
                994,
                996
            ],
            [
                1053,
                1058
            ],
            [
                1259,
                1280
            ],
            [
                1300,
                1314
            ],
            [
                1314,
                1411
            ],
            [
                1411,
                1464
            ],
            [
                1497,
                1499
            ],
            [
                1504,
                1507
            ],
            [
                1529,
                1628
            ],
            [
                1508,
                1510
            ],
            [
                1655,
                1663
            ],
            [
                1668,
                1676
            ],
            [
                1690,
                1694
            ],
            [
                1700,
                1704
            ],
            [
                1705,
                1740
            ],
            [
                1740,
                1751
            ],
            [
                1762,
                1789
            ],
            [
                1853,
                1903
            ],
            [
                1908,
                1973
            ],
            [
                1973,
                1974
            ],
            [
                1980,
                2052
            ],
            [
                2093,
                2095
            ],
            [
                2202,
                2259
            ],
            [
                2265,
                2328
            ],
            [
                2328,
                2462
            ],
            [
                2462,
                2484
            ],
            [
                2515,
                2516
            ],
            [
                2485,
                2510
            ],
            [
                2518,
                2534
            ],
            [
                2534,
                2629
            ],
            [
                2629,
                2725
            ],
            [
                2725,
                2801
            ],
            [
                2931,
                3031
            ],
            [
                3041,
                3052
            ],
            [
                3089,
                3091
            ],
            [
                3091,
                3097
            ],
            [
                3135,
                3143
            ],
            [
                3118,
                3122
            ],
            [
                3155,
                3173
            ],
            [
                3186,
                3188
            ],
            [
                3213,
                3223
            ],
            [
                3189,
                3192
            ],
            [
                3233,
                3266
            ],
            [
                3286,
                3304
            ],
            [
                3327,
                3362
            ],
            [
                3315,
                3326
            ],
            [
                3370,
                3372
            ],
            [
                3438,
                3470
            ],
            [
                3476,
                3481
            ],
            [
                3482,
                3505
            ],
            [
                3545,
                3552
            ],
            [
                3582,
                3599
            ],
            [
                3609,
                3618
            ],
            [
                3619,
                3631
            ],
            [
                3675,
                3709
            ],
            [
                3856,
                3976
            ],
            [
                3988,
                3995
            ],
            [
                3995,
                4062
            ],
            [
                4080,
                4087
            ],
            [
                4102,
                4256
            ],
            [
                4256,
                4275
            ],
            [
                4275,
                4298
            ],
            [
                4298,
                4304
            ],
            [
                4304,
                4413
            ],
            [
                4413,
                4484
            ],
            [
                4515,
                4541
            ],
            [
                4541,
                4569
            ],
            [
                4616,
                4629
            ],
            [
                4581,
                4591
            ],
            [
                4633,
                4649
            ],
            [
                4650,
                4668
            ],
            [
                4790,
                4824
            ],
            [
                4861,
                4908
            ],
            [
                4908,
                4949
            ],
            [
                4977,
                4994
            ],
            [
                4994,
                5023
            ],
            [
                5033,
                5056
            ],
            [
                5094,
                5097
            ],
            [
                5081,
                5090
            ],
            [
                5068,
                5071
            ],
            [
                5098,
                5120
            ],
            [
                5135,
                5149
            ],
            [
                5156,
                5157
            ],
            [
                5158,
                5196
            ],
            [
                5207,
                5218
            ],
            [
                5197,
                5199
            ],
            [
                5237,
                5266
            ],
            [
                5285,
                5312
            ],
            [
                5412,
                5414
            ],
            [
                5414,
                5476
            ],
            [
                5536,
                5538
            ],
            [
                5538,
                5576
            ],
            [
                5576,
                5595
            ],
            [
                5597,
                5600
            ],
            [
                5604,
                5609
            ],
            [
                5609,
                5647
            ],
            [
                5713,
                5738
            ],
            [
                5744,
                5753
            ],
            [
                5817,
                5821
            ],
            [
                5801,
                5806
            ],
            [
                5822,
                5824
            ],
            [
                5885,
                5889
            ],
            [
                5895,
                5907
            ],
            [
                5914,
                5916
            ],
            [
                5922,
                5932
            ],
            [
                5937,
                5961
            ],
            [
                5975,
                6064
            ],
            [
                6064,
                6084
            ],
            [
                6089,
                6091
            ],
            [
                6102,
                6112
            ],
            [
                6184,
                6186
            ],
            [
                6186,
                6192
            ],
            [
                6252,
                6284
            ],
            [
                6313,
                6347
            ],
            [
                6348,
                6356
            ],
            [
                6369,
                6381
            ],
            [
                6511,
                6514
            ],
            [
                6573,
                6575
            ],
            [
                6575,
                6598
            ],
            [
                6660,
                6673
            ],
            [
                6682,
                6688
            ],
            [
                6727,
                6793
            ],
            [
                6793,
                6829
            ],
            [
                6849,
                6855
            ],
            [
                6896,
                6905
            ],
            [
                6916,
                6936
            ],
            [
                6974,
                7030
            ],
            [
                7054,
                7058
            ],
            [
                7065,
                7066
            ],
            [
                7071,
                7078
            ],
            [
                7067,
                7070
            ],
            [
                7059,
                7064
            ],
            [
                7090,
                7093
            ],
            [
                7099,
                7104
            ],
            [
                7114,
                7147
            ],
            [
                7208,
                7233
            ],
            [
                7248,
                7300
            ],
            [
                7313,
                7354
            ],
            [
                7385,
                7387
            ],
            [
                7387,
                7408
            ],
            [
                7419,
                7429
            ],
            [
                7433,
                7463
            ],
            [
                7464,
                7468
            ],
            [
                7475,
                7481
            ],
            [
                7484,
                7486
            ],
            [
                7486,
                7513
            ],
            [
                7518,
                7527
            ],
            [
                7527,
                7639
            ],
            [
                7677,
                7679
            ],
            [
                7679,
                7709
            ],
            [
                7719,
                7732
            ],
            [
                7734,
                7765
            ],
            [
                7766,
                7794
            ],
            [
                7943,
                8082
            ],
            [
                8092,
                8122
            ],
            [
                8173,
                8175
            ],
            [
                8259,
                8297
            ],
            [
                8297,
                8333
            ],
            [
                8336,
                8371
            ],
            [
                8371,
                8416
            ],
            [
                8416,
                8443
            ],
            [
                8451,
                8469
            ],
            [
                8479,
                8499
            ],
            [
                8470,
                8473
            ],
            [
                8552,
                8567
            ],
            [
                8570,
                8606
            ],
            [
                8625,
                8628
            ],
            [
                8634,
                8639
            ],
            [
                8663,
                8665
            ],
            [
                8665,
                8671
            ],
            [
                8707,
                8711
            ],
            [
                8717,
                8769
            ],
            [
                8769,
                8784
            ],
            [
                8794,
                8869
            ],
            [
                8875,
                8881
            ],
            [
                8881,
                8915
            ],
            [
                8938,
                8956
            ],
            [
                8966,
                9011
            ],
            [
                9018,
                9026
            ],
            [
                9012,
                9017
            ],
            [
                9026,
                9027
            ],
            [
                9028,
                9031
            ],
            [
                9063,
                9069
            ],
            [
                9101,
                9104
            ],
            [
                9076,
                9087
            ],
            [
                9032,
                9039
            ],
            [
                9113,
                9118
            ],
            [
                9049,
                9057
            ],
            [
                9124,
                9130
            ],
            [
                9061,
                9062
            ],
            [
                9131,
                9148
            ],
            [
                9148,
                9160
            ],
            [
                9160,
                9167
            ],
            [
                9174,
                9193
            ],
            [
                9200,
                9210
            ],
            [
                9268,
                9270
            ],
            [
                9270,
                9312
            ],
            [
                9315,
                9318
            ],
            [
                9388,
                9391
            ],
            [
                9395,
                9409
            ],
            [
                9409,
                9438
            ],
            [
                9448,
                9457
            ],
            [
                9496,
                9582
            ],
            [
                9590,
                9592
            ],
            [
                9592,
                9603
            ],
            [
                9607,
                9640
            ],
            [
                9640,
                9682
            ],
            [
                9682,
                9686
            ],
            [
                9708,
                9719
            ],
            [
                9725,
                9766
            ],
            [
                9771,
                9787
            ],
            [
                9787,
                9800
            ],
            [
                9846,
                9850
            ],
            [
                9860,
                9862
            ],
            [
                9862,
                9901
            ],
            [
                9901,
                9918
            ],
            [
                9928,
                9941
            ],
            [
                9919,
                9927
            ],
            [
                9941,
                9993
            ],
            [
                9993,
                10008
            ],
            [
                10216,
                10251
            ],
            [
                10279,
                10346
            ],
            [
                10356,
                10357
            ],
            [
                10372,
                10375
            ],
            [
                10379,
                10390
            ],
            [
                10475,
                10479
            ],
            [
                10514,
                10517
            ],
            [
                10500,
                10510
            ],
            [
                10522,
                10524
            ],
            [
                10542,
                10547
            ],
            [
                10530,
                10533
            ],
            [
                10564,
                10581
            ],
            [
                10591,
                10596
            ],
            [
                10653,
                10660
            ],
            [
                10683,
                10685
            ],
            [
                10597,
                10598
            ],
            [
                10745,
                10751
            ],
            [
                10555,
                10556
            ],
            [
                10752,
                10761
            ],
            [
                10896,
                10897
            ],
            [
                10828,
                10831
            ],
            [
                10852,
                10880
            ],
            [
                10846,
                10851
            ],
            [
                10609,
                10613
            ],
            [
                10902,
                10913
            ],
            [
                10937,
                10950
            ],
            [
                10950,
                10982
            ],
            [
                11007,
                11031
            ],
            [
                11042,
                11085
            ],
            [
                11085,
                11092
            ],
            [
                11099,
                11147
            ],
            [
                11151,
                11174
            ],
            [
                11180,
                11181
            ],
            [
                11182,
                11188
            ],
            [
                11175,
                11179
            ],
            [
                11189,
                11222
            ],
            [
                11222,
                11282
            ],
            [
                11300,
                11313
            ],
            [
                11322,
                11330
            ],
            [
                11366,
                11385
            ],
            [
                11411,
                11435
            ],
            [
                11450,
                11452
            ],
            [
                11452,
                11464
            ],
            [
                11475,
                11512
            ],
            [
                11520,
                11523
            ],
            [
                11594,
                11611
            ],
            [
                11611,
                11628
            ],
            [
                11646,
                11689
            ],
            [
                11690,
                11756
            ],
            [
                11845,
                11847
            ],
            [
                11851,
                11891
            ],
            [
                11990,
                12021
            ],
            [
                12021,
                12103
            ],
            [
                12104,
                12106
            ],
            [
                12118,
                12165
            ],
            [
                12176,
                12177
            ],
            [
                12196,
                12221
            ],
            [
                12258,
                12261
            ],
            [
                12261,
                12344
            ],
            [
                12344,
                12406
            ],
            [
                12406,
                12495
            ],
            [
                12495,
                12576
            ],
            [
                13077,
                13081
            ],
            [
                13086,
                13095
            ],
            [
                13095,
                13097
            ],
            [
                13097,
                13146
            ],
            [
                13146,
                13174
            ],
            [
                13174,
                13201
            ],
            [
                13206,
                13233
            ],
            [
                13238,
                13268
            ],
            [
                13330,
                13363
            ],
            [
                13363,
                13407
            ],
            [
                13411,
                13427
            ],
            [
                13427,
                13466
            ],
            [
                13538,
                13540
            ],
            [
                13540,
                13558
            ],
            [
                13560,
                13562
            ],
            [
                13562,
                13606
            ],
            [
                13641,
                13646
            ],
            [
                13657,
                13695
            ],
            [
                13703,
                13732
            ],
            [
                13732,
                13756
            ],
            [
                13756,
                13788
            ],
            [
                13929,
                13964
            ],
            [
                13964,
                14016
            ],
            [
                14016,
                14072
            ],
            [
                14072,
                14085
            ],
            [
                14085,
                14126
            ],
            [
                14200,
                14208
            ],
            [
                14139,
                14161
            ],
            [
                14172,
                14178
            ],
            [
                14291,
                14293
            ],
            [
                14251,
                14269
            ],
            [
                14358,
                14366
            ],
            [
                14136,
                14138
            ],
            [
                14379,
                14384
            ],
            [
                14281,
                14287
            ],
            [
                14386,
                14434
            ],
            [
                14444,
                14447
            ],
            [
                14447,
                14495
            ],
            [
                14495,
                14507
            ],
            [
                14511,
                14513
            ],
            [
                14513,
                14543
            ],
            [
                14543,
                14575
            ],
            [
                14587,
                14591
            ],
            [
                14597,
                14608
            ],
            [
                14616,
                14618
            ],
            [
                14618,
                14676
            ],
            [
                14679,
                14702
            ],
            [
                14702,
                14727
            ],
            [
                14727,
                14732
            ],
            [
                14766,
                14770
            ],
            [
                14747,
                14750
            ],
            [
                14794,
                14796
            ],
            [
                14796,
                14797
            ],
            [
                14811,
                14835
            ],
            [
                14835,
                14865
            ],
            [
                14871,
                14878
            ],
            [
                14866,
                14870
            ],
            [
                14878,
                14881
            ],
            [
                14881,
                14886
            ],
            [
                14886,
                14912
            ],
            [
                14912,
                14950
            ],
            [
                14950,
                14951
            ],
            [
                14955,
                14958
            ],
            [
                14985,
                14986
            ],
            [
                15007,
                15034
            ],
            [
                15035,
                15072
            ],
            [
                15176,
                15232
            ],
            [
                15232,
                15262
            ],
            [
                15276,
                15336
            ],
            [
                15418,
                15423
            ],
            [
                15500,
                15549
            ],
            [
                15550,
                15605
            ],
            [
                15605,
                15638
            ],
            [
                15643,
                15646
            ],
            [
                15646,
                15674
            ],
            [
                15674,
                15703
            ],
            [
                15703,
                15712
            ],
            [
                15713,
                15756
            ],
            [
                15758,
                15772
            ],
            [
                15819,
                15841
            ],
            [
                15847,
                15850
            ],
            [
                15867,
                15870
            ],
            [
                15870,
                15892
            ],
            [
                15895,
                15899
            ],
            [
                15903,
                15911
            ],
            [
                15911,
                15955
            ],
            [
                15962,
                15967
            ],
            [
                15967,
                15987
            ],
            [
                15997,
                16020
            ],
            [
                16020,
                16025
            ],
            [
                16025,
                16041
            ],
            [
                16041,
                16136
            ],
            [
                16136,
                16199
            ],
            [
                16208,
                16228
            ],
            [
                16238,
                16243
            ],
            [
                16250,
                16252
            ],
            [
                16252,
                16296
            ],
            [
                16306,
                16348
            ],
            [
                16370,
                16371
            ],
            [
                16385,
                16387
            ],
            [
                16390,
                16398
            ],
            [
                16398,
                16418
            ],
            [
                16433,
                16449
            ],
            [
                16449,
                16462
            ],
            [
                16472,
                16476
            ],
            [
                16476,
                16554
            ],
            [
                16554,
                16579
            ],
            [
                16579,
                16596
            ],
            [
                16596,
                16624
            ],
            [
                16739,
                16741
            ],
            [
                16745,
                16775
            ],
            [
                16831,
                16833
            ],
            [
                16869,
                16874
            ],
            [
                16879,
                16964
            ],
            [
                16842,
                16843
            ],
            [
                16966,
                16970
            ],
            [
                16875,
                16878
            ],
            [
                17105,
                17201
            ],
            [
                17201,
                17217
            ],
            [
                17233,
                17236
            ],
            [
                17358,
                17360
            ],
            [
                17249,
                17313
            ],
            [
                17503,
                17504
            ],
            [
                17529,
                17534
            ],
            [
                17466,
                17468
            ],
            [
                17366,
                17374
            ],
            [
                17491,
                17493
            ],
            [
                17484,
                17490
            ],
            [
                17422,
                17423
            ],
            [
                17535,
                17575
            ],
            [
                17575,
                17591
            ],
            [
                17619,
                17640
            ],
            [
                17660,
                17680
            ],
            [
                17690,
                17758
            ],
            [
                17759,
                17787
            ],
            [
                17807,
                17810
            ],
            [
                17810,
                17854
            ],
            [
                17854,
                17938
            ],
            [
                17938,
                18051
            ],
            [
                18051,
                18136
            ],
            [
                18221,
                18233
            ],
            [
                18270,
                18271
            ],
            [
                18273,
                18290
            ],
            [
                18437,
                18438
            ],
            [
                18443,
                18485
            ],
            [
                18485,
                18559
            ],
            [
                18559,
                18572
            ],
            [
                18590,
                18599
            ],
            [
                18602,
                18613
            ],
            [
                18613,
                18636
            ],
            [
                18636,
                18646
            ],
            [
                18676,
                18677
            ],
            [
                18685,
                18698
            ],
            [
                18761,
                18809
            ],
            [
                18821,
                18842
            ],
            [
                18888,
                18890
            ],
            [
                18948,
                18949
            ],
            [
                18914,
                18943
            ],
            [
                18961,
                18986
            ],
            [
                18992,
                18997
            ],
            [
                18997,
                19049
            ],
            [
                19086,
                19089
            ],
            [
                19109,
                19148
            ],
            [
                19148,
                19184
            ],
            [
                19184,
                19226
            ],
            [
                19226,
                19227
            ],
            [
                19234,
                19281
            ],
            [
                19293,
                19361
            ],
            [
                19384,
                19391
            ],
            [
                19417,
                19419
            ],
            [
                19419,
                19486
            ],
            [
                19486,
                19558
            ],
            [
                19558,
                19574
            ],
            [
                19574,
                19607
            ],
            [
                19607,
                19613
            ],
            [
                19615,
                19617
            ],
            [
                19666,
                19717
            ],
            [
                19717,
                19822
            ],
            [
                19829,
                19850
            ],
            [
                19850,
                19862
            ],
            [
                19890,
                19903
            ],
            [
                19921,
                19958
            ],
            [
                19958,
                20036
            ],
            [
                20055,
                20065
            ],
            [
                20067,
                20076
            ],
            [
                20086,
                20089
            ],
            [
                20111,
                20112
            ],
            [
                20113,
                20117
            ],
            [
                20138,
                20210
            ],
            [
                20210,
                20217
            ],
            [
                20243,
                20281
            ],
            [
                20281,
                20288
            ],
            [
                20297,
                20336
            ],
            [
                20358,
                20372
            ],
            [
                20386,
                20398
            ],
            [
                20398,
                20407
            ],
            [
                20420,
                20433
            ],
            [
                20407,
                20408
            ],
            [
                20434,
                20436
            ],
            [
                20458,
                20464
            ],
            [
                20474,
                20493
            ],
            [
                20502,
                20504
            ],
            [
                20498,
                20501
            ],
            [
                20505,
                20509
            ],
            [
                20542,
                20545
            ],
            [
                20527,
                20532
            ],
            [
                20555,
                20557
            ],
            [
                20562,
                20598
            ],
            [
                20643,
                20644
            ],
            [
                20603,
                20606
            ],
            [
                20688,
                20698
            ],
            [
                20718,
                20728
            ],
            [
                20740,
                20771
            ],
            [
                20780,
                20791
            ],
            [
                20791,
                20939
            ],
            [
                20990,
                21035
            ],
            [
                21167,
                21169
            ],
            [
                21169,
                21223
            ],
            [
                21224,
                21320
            ],
            [
                21338,
                21340
            ],
            [
                21340,
                21358
            ],
            [
                21366,
                21378
            ],
            [
                21411,
                21412
            ],
            [
                21413,
                21482
            ],
            [
                21482,
                21505
            ],
            [
                21505,
                21545
            ],
            [
                21561,
                21573
            ],
            [
                21573,
                21600
            ],
            [
                21830,
                21831
            ],
            [
                21835,
                21890
            ],
            [
                21890,
                21904
            ],
            [
                21904,
                21951
            ],
            [
                21951,
                21995
            ],
            [
                22136,
                22278
            ],
            [
                22278,
                22324
            ],
            [
                22388,
                22391
            ],
            [
                22407,
                22432
            ],
            [
                22432,
                22466
            ],
            [
                22487,
                22522
            ],
            [
                22721,
                22723
            ],
            [
                22723,
                22757
            ],
            [
                22764,
                22802
            ],
            [
                22812,
                22825
            ],
            [
                22832,
                22859
            ],
            [
                22987,
                23029
            ],
            [
                23063,
                23075
            ],
            [
                23121,
                23122
            ],
            [
                23112,
                23115
            ],
            [
                23098,
                23104
            ],
            [
                23116,
                23121
            ],
            [
                23228,
                23231
            ],
            [
                23105,
                23111
            ],
            [
                23164,
                23165
            ],
            [
                23257,
                23265
            ],
            [
                23331,
                23362
            ],
            [
                23368,
                23399
            ],
            [
                23429,
                23492
            ],
            [
                23492,
                23585
            ],
            [
                23773,
                23837
            ],
            [
                23840,
                23865
            ],
            [
                23865,
                23896
            ],
            [
                23896,
                23934
            ],
            [
                23934,
                23940
            ],
            [
                23940,
                23994
            ],
            [
                23994,
                23998
            ],
            [
                24046,
                24081
            ],
            [
                24081,
                24095
            ],
            [
                24103,
                24136
            ],
            [
                24175,
                24177
            ],
            [
                24217,
                24263
            ],
            [
                24263,
                24276
            ],
            [
                24278,
                24285
            ],
            [
                24276,
                24277
            ],
            [
                24382,
                24411
            ],
            [
                24422,
                24460
            ],
            [
                24460,
                24472
            ],
            [
                24472,
                24507
            ],
            [
                24507,
                24527
            ],
            [
                24527,
                24635
            ],
            [
                24635,
                24665
            ],
            [
                24665,
                24698
            ],
            [
                24698,
                24721
            ],
            [
                24721,
                24786
            ],
            [
                24786,
                24801
            ],
            [
                24827,
                24838
            ],
            [
                24842,
                24855
            ],
            [
                24864,
                24866
            ],
            [
                24866,
                24961
            ],
            [
                24968,
                24976
            ],
            [
                24976,
                25011
            ],
            [
                25019,
                25064
            ],
            [
                25066,
                25155
            ],
            [
                25165,
                25183
            ],
            [
                25184,
                25213
            ],
            [
                25430,
                25432
            ],
            [
                25261,
                25271
            ],
            [
                25233,
                25247
            ],
            [
                25303,
                25324
            ],
            [
                25335,
                25424
            ],
            [
                25433,
                25467
            ],
            [
                25491,
                25554
            ],
            [
                25554,
                25586
            ],
            [
                25598,
                25651
            ],
            [
                25651,
                25718
            ],
            [
                25789,
                25813
            ],
            [
                25877,
                25905
            ],
            [
                25905,
                25945
            ],
            [
                25945,
                25959
            ],
            [
                25965,
                25968
            ],
            [
                25968,
                26040
            ]
        ],
        "row_chars": [
            [
                0,
                203
            ],
            [
                203,
                405
            ],
            [
                405,
                431
            ],
            [
                431,
                446
            ],
            [
                446,
                536
            ],
            [
                536,
                624
            ],
            [
                624,
                712
            ],
            [
                712,
                809
            ],
            [
                809,
                1314
            ],
            [
                1314,
                1411
            ],
            [
                1411,
                1499
            ],
            [
                1499,
                1740
            ],
            [
                1740,
                1789
            ],
            [
                1789,
                1853
            ],
            [
                1853,
                1973
            ],
            [
                1973,
                2095
            ],
            [
                2095,
                2202
            ],
            [
                2202,
                2328
            ],
            [
                2328,
                2462
            ],
            [
                2462,
                2534
            ],
            [
                2534,
                2629
            ],
            [
                2629,
                2725
            ],
            [
                2725,
                2801
            ],
            [
                2801,
                2883
            ],
            [
                2883,
                3091
            ],
            [
                3091,
                3266
            ],
            [
                3266,
                3372
            ],
            [
                3372,
                3632
            ],
            [
                3632,
                3675
            ],
            [
                3675,
                3709
            ],
            [
                3709,
                3856
            ],
            [
                3856,
                3995
            ],
            [
                3995,
                4256
            ],
            [
                4256,
                4275
            ],
            [
                4275,
                4298
            ],
            [
                4298,
                4304
            ],
            [
                4304,
                4413
            ],
            [
                4413,
                4541
            ],
            [
                4541,
                4650
            ],
            [
                4650,
                4908
            ],
            [
                4908,
                4994
            ],
            [
                4994,
                5158
            ],
            [
                5158,
                5414
            ],
            [
                5414,
                5538
            ],
            [
                5538,
                5576
            ],
            [
                5576,
                5609
            ],
            [
                5609,
                5753
            ],
            [
                5753,
                5795
            ],
            [
                5795,
                5907
            ],
            [
                5907,
                6064
            ],
            [
                6064,
                6186
            ],
            [
                6186,
                6348
            ],
            [
                6348,
                6575
            ],
            [
                6575,
                6688
            ],
            [
                6688,
                6727
            ],
            [
                6727,
                6793
            ],
            [
                6793,
                6905
            ],
            [
                6905,
                6936
            ],
            [
                6936,
                6955
            ],
            [
                6955,
                6974
            ],
            [
                6974,
                7090
            ],
            [
                7090,
                7147
            ],
            [
                7147,
                7187
            ],
            [
                7187,
                7387
            ],
            [
                7387,
                7429
            ],
            [
                7429,
                7464
            ],
            [
                7464,
                7486
            ],
            [
                7486,
                7527
            ],
            [
                7527,
                7679
            ],
            [
                7679,
                7795
            ],
            [
                7795,
                7938
            ],
            [
                7938,
                8175
            ],
            [
                8175,
                8251
            ],
            [
                8251,
                8297
            ],
            [
                8297,
                8371
            ],
            [
                8371,
                8416
            ],
            [
                8416,
                8443
            ],
            [
                8443,
                8567
            ],
            [
                8567,
                8665
            ],
            [
                8665,
                8769
            ],
            [
                8769,
                8881
            ],
            [
                8881,
                9028
            ],
            [
                9028,
                9160
            ],
            [
                9160,
                9270
            ],
            [
                9270,
                9409
            ],
            [
                9409,
                9592
            ],
            [
                9592,
                9640
            ],
            [
                9640,
                9682
            ],
            [
                9682,
                9787
            ],
            [
                9787,
                9862
            ],
            [
                9862,
                9901
            ],
            [
                9901,
                9993
            ],
            [
                9993,
                10251
            ],
            [
                10251,
                10279
            ],
            [
                10279,
                10524
            ],
            [
                10524,
                10950
            ],
            [
                10950,
                11085
            ],
            [
                11085,
                11222
            ],
            [
                11222,
                11452
            ],
            [
                11452,
                11611
            ],
            [
                11611,
                11690
            ],
            [
                11690,
                11847
            ],
            [
                11847,
                12021
            ],
            [
                12021,
                12104
            ],
            [
                12104,
                12261
            ],
            [
                12261,
                12344
            ],
            [
                12344,
                12406
            ],
            [
                12406,
                12495
            ],
            [
                12495,
                12576
            ],
            [
                12576,
                12607
            ],
            [
                12607,
                12637
            ],
            [
                12637,
                12713
            ],
            [
                12713,
                12790
            ],
            [
                12790,
                12849
            ],
            [
                12849,
                12874
            ],
            [
                12874,
                13010
            ],
            [
                13010,
                13068
            ],
            [
                13068,
                13097
            ],
            [
                13097,
                13146
            ],
            [
                13146,
                13174
            ],
            [
                13174,
                13201
            ],
            [
                13201,
                13330
            ],
            [
                13330,
                13363
            ],
            [
                13363,
                13427
            ],
            [
                13427,
                13540
            ],
            [
                13540,
                13562
            ],
            [
                13562,
                13732
            ],
            [
                13732,
                13756
            ],
            [
                13756,
                13788
            ],
            [
                13788,
                13906
            ],
            [
                13906,
                13929
            ],
            [
                13929,
                13964
            ],
            [
                13964,
                14016
            ],
            [
                14016,
                14072
            ],
            [
                14072,
                14085
            ],
            [
                14085,
                14126
            ],
            [
                14126,
                14386
            ],
            [
                14386,
                14447
            ],
            [
                14447,
                14495
            ],
            [
                14495,
                14513
            ],
            [
                14513,
                14543
            ],
            [
                14543,
                14575
            ],
            [
                14575,
                14587
            ],
            [
                14587,
                14618
            ],
            [
                14618,
                14702
            ],
            [
                14702,
                14727
            ],
            [
                14727,
                14796
            ],
            [
                14796,
                14835
            ],
            [
                14835,
                14881
            ],
            [
                14881,
                14886
            ],
            [
                14886,
                14912
            ],
            [
                14912,
                14950
            ],
            [
                14950,
                15072
            ],
            [
                15072,
                15129
            ],
            [
                15129,
                15163
            ],
            [
                15163,
                15232
            ],
            [
                15232,
                15336
            ],
            [
                15336,
                15418
            ],
            [
                15418,
                15550
            ],
            [
                15550,
                15605
            ],
            [
                15605,
                15646
            ],
            [
                15646,
                15674
            ],
            [
                15674,
                15703
            ],
            [
                15703,
                15774
            ],
            [
                15774,
                15819
            ],
            [
                15819,
                15870
            ],
            [
                15870,
                15911
            ],
            [
                15911,
                15967
            ],
            [
                15967,
                16020
            ],
            [
                16020,
                16025
            ],
            [
                16025,
                16041
            ],
            [
                16041,
                16136
            ],
            [
                16136,
                16252
            ],
            [
                16252,
                16348
            ],
            [
                16348,
                16398
            ],
            [
                16398,
                16449
            ],
            [
                16449,
                16476
            ],
            [
                16476,
                16554
            ],
            [
                16554,
                16579
            ],
            [
                16579,
                16596
            ],
            [
                16596,
                16741
            ],
            [
                16741,
                16833
            ],
            [
                16833,
                17201
            ],
            [
                17201,
                17575
            ],
            [
                17575,
                17759
            ],
            [
                17759,
                17810
            ],
            [
                17810,
                17854
            ],
            [
                17854,
                17938
            ],
            [
                17938,
                18051
            ],
            [
                18051,
                18138
            ],
            [
                18138,
                18221
            ],
            [
                18221,
                18290
            ],
            [
                18290,
                18321
            ],
            [
                18321,
                18336
            ],
            [
                18336,
                18392
            ],
            [
                18392,
                18437
            ],
            [
                18437,
                18485
            ],
            [
                18485,
                18559
            ],
            [
                18559,
                18613
            ],
            [
                18613,
                18636
            ],
            [
                18636,
                18698
            ],
            [
                18698,
                18761
            ],
            [
                18761,
                18890
            ],
            [
                18890,
                18997
            ],
            [
                18997,
                19148
            ],
            [
                19148,
                19184
            ],
            [
                19184,
                19226
            ],
            [
                19226,
                19281
            ],
            [
                19281,
                19419
            ],
            [
                19419,
                19486
            ],
            [
                19486,
                19558
            ],
            [
                19558,
                19574
            ],
            [
                19574,
                19607
            ],
            [
                19607,
                19617
            ],
            [
                19617,
                19666
            ],
            [
                19666,
                19717
            ],
            [
                19717,
                19850
            ],
            [
                19850,
                19958
            ],
            [
                19958,
                20113
            ],
            [
                20113,
                20210
            ],
            [
                20210,
                20281
            ],
            [
                20281,
                20398
            ],
            [
                20398,
                20494
            ],
            [
                20494,
                20557
            ],
            [
                20557,
                20791
            ],
            [
                20791,
                20939
            ],
            [
                20939,
                20990
            ],
            [
                20990,
                21169
            ],
            [
                21169,
                21340
            ],
            [
                21340,
                21413
            ],
            [
                21413,
                21482
            ],
            [
                21482,
                21505
            ],
            [
                21505,
                21573
            ],
            [
                21573,
                21600
            ],
            [
                21600,
                21645
            ],
            [
                21645,
                21673
            ],
            [
                21673,
                21744
            ],
            [
                21744,
                21779
            ],
            [
                21779,
                21830
            ],
            [
                21830,
                21890
            ],
            [
                21890,
                21904
            ],
            [
                21904,
                21951
            ],
            [
                21951,
                21997
            ],
            [
                21997,
                22136
            ],
            [
                22136,
                22278
            ],
            [
                22278,
                22432
            ],
            [
                22432,
                22723
            ],
            [
                22723,
                22859
            ],
            [
                22859,
                22987
            ],
            [
                22987,
                23492
            ],
            [
                23492,
                23588
            ],
            [
                23588,
                23635
            ],
            [
                23635,
                23672
            ],
            [
                23672,
                23688
            ],
            [
                23688,
                23717
            ],
            [
                23717,
                23743
            ],
            [
                23743,
                23773
            ],
            [
                23773,
                23840
            ],
            [
                23840,
                23865
            ],
            [
                23865,
                23896
            ],
            [
                23896,
                23934
            ],
            [
                23934,
                23940
            ],
            [
                23940,
                23994
            ],
            [
                23994,
                24081
            ],
            [
                24081,
                24095
            ],
            [
                24095,
                24177
            ],
            [
                24177,
                24200
            ],
            [
                24200,
                24217
            ],
            [
                24217,
                24263
            ],
            [
                24263,
                24298
            ],
            [
                24298,
                24381
            ],
            [
                24381,
                24460
            ],
            [
                24460,
                24472
            ],
            [
                24472,
                24507
            ],
            [
                24507,
                24527
            ],
            [
                24527,
                24635
            ],
            [
                24635,
                24665
            ],
            [
                24665,
                24698
            ],
            [
                24698,
                24721
            ],
            [
                24721,
                24786
            ],
            [
                24786,
                24866
            ],
            [
                24866,
                24976
            ],
            [
                24976,
                25184
            ],
            [
                25184,
                25467
            ],
            [
                25467,
                25554
            ],
            [
                25554,
                25651
            ],
            [
                25651,
                25721
            ],
            [
                25721,
                25763
            ],
            [
                25763,
                25788
            ],
            [
                25788,
                25905
            ],
            [
                25905,
                25945
            ],
            [
                25945,
                25968
            ],
            [
                25968,
                26040
            ]
        ]
    },
    "abridged": {
        "text": "Alice received Mr. Grey's answer to her letter the next morning. It was written at Nethercoats, his small country-house in Cambridgeshire, where he spent much of his time, and intended to live after his marriage.\nDearest Alice,\nI am glad you have settled your foreign affairs so much to your liking. As for your home affairs, they are not, to my thinking, quite so satisfactorily arranged. But as I am involved in them, I may be biased.\nAbout the tour, I quite agree that you and Kate would have been uncomfortable alone. It's a very fine theory that women can get along without men just as well; but, like other fine theories, it will be found very troublesome by those who first try it, and a male companion will be a comfort. I don't quite know whether your cousin George is the best possible knight you might have chosen. I should consider myself to be infinitely preferable, if it were possible. If you should meet Paynim foes, he, no doubt, would kill them off much quicker than I could do, and would be much more useful in rescuing you from dungeons, or from any stray tigers in the Swiss forests. But I doubt if he will be punctual with the luggage. He will be slow in getting you glasses of water at railway stations, and will always keep you waiting at breakfast. I believe that a man with two ladies on a tour should be an absolute slave to them. I have my doubts as to whether your cousin is fit for the position; but, as to myself, it is just the thing that I was made for. Luckily, however, neither you nor Kate are without wills of your own, and perhaps you may be able to reduce Mr. Vavasor to obedience.\nAs to the home affairs, I have very little to say in this letter. I shall of course run up and see you before you start, and shall probably stay a week in town. I know I ought not to do so, as it will be a week of idleness, and yet not a week of happiness. I'd sooner have an hour with you in the country than a whole day in London. And in town it is a feverish idleness, in which one is driven here and there, expecting some gratification which never comes. I will come for the last week of this month, and hope to see as much of you as your town doings will permit.\nAbout those home affairs: I believe you will understand why I saying nothing now. Perhaps all my arguments have been of no use; but as you do not answer them, I shall still trust to my eloquence in person for success.\nThe garden is going on very well. Your commands have been obeyed in all things, and Morrison always says \"The mistress didn't mean this,\" or \"The mistress intended that.\" God bless the mistress is what I now say, and send her home, to her flowers, and her house, and her husband, as soon as may be, with no more of these delays which are to me so grievous, and which seem to me to be so unnecessary. That is my prayer.\nYours ever and always,\nJ. G.\n\"I didn't give commands,\" Alice said to herself, as she sat with the letter at her solitary breakfast-table. \"He asked me how I liked the things, and of course I was obliged to say, even if I didn't care.\" Such were her first thoughts after reading the letter the second time.\nWhen she opened it, her mind was full of that rebuke which she had almost taught herself to expect. She had torn the letter open rapidly, and scanned it with quick eyes. In half a moment she had seen the nature of the reply about her companion for the tour, and then she had finished reading slowly.\n\"No; I gave no commands,\" she repeated, as though to absolve herself from blame in any possible future accusations.\nThen she considered the letter bit by bit, taking it backwards. No; she had no home, no house, there. She had no husband; not yet. He spoke of their engagement as though they were already in some way married. Yet they were both still free to withdraw from the engagement. If he came to her and said that he found that their marriage would not make him happy, would not she release him without a word of reproach? Would not she regard it as an honourable act? And if things were the other way round, was it not reasonable that she should expect a similar acquittal?\nThen she told herself that it was theoretical. She had no intention of going back from her word. She loved him much, and admired him even more than she loved him. He was noble, generous, clever, good - almost perfect. If only he had some faults! How could she, full of faults as she knew herself to be, make such a perfect man happy?\nBut there was no doubt as to her present duty. She loved him, and having accepted his love, nothing but a change in her heart could justify her in seeking to break the engagement. She did love him, and him only.\nHowever, she had once loved her cousin.\nYes, it was true. In her thoughts she did not deny it. She had loved him, and was tormented by a feeling that she had had a more full delight in that love than in this. She had told herself that this was a result of her youth; that love at twenty was sweeter and more rapturous than it could be afterwards.\nNow that she was older and perhaps wiser, love meant a partnership, in which each partner would be honest to the other, in which each would strive for the other's welfare. This love was of earth, and therefore possible. The other had been a ray from heaven - and impossible, except in a dream.\nAnd she had been mistaken in her first love. She admitted that frankly. She had worshipped an idol of clay, and had done the best thing in abandoning that idolatry. George had not only been untrue to her, but had made false excuses. He had made promises with a deliberate, premeditated falsehood. And he had been coldly selfish, weighing the value of his own low lusts against that of her love. She had known this, and had parted vowing to herself that no contrition on his part should ever bring them together again.\nBut though she did not pardon him as a lover, she had again welcomed him as a cousin, and as her friend Kate's brother. She had become very anxious about his career. She knew him to be clever, ambitious, bold - and perhaps not bad at heart. Now, as she told herself that she loved John Grey, I fear that she almost thought more of that other man from whom she had torn herself apart.\n\"Why should Mr. Grey find himself unhappy in London?\" she said, as she went back to the letter. \"Why condemn the place which most men find the fittest for their energies? If I were I a man, I would live there. It is odd how we differ in all things. However brilliant his own light might be, he would be contented to hide it under a bushel!\"\nAnd at last she reflected on his response to her travelling with her cousin. He had written on the matter with a pleasant joke, like a gentleman, without alluding to the past or implying that she needed his permission. When Alice had told him of their plan, she had tried to make it a simple, ordinary statement; but she knew that she had failed, and that he had read her failure. She was quite conscious of this; and she knew that he was a gentleman to the last drop of his blood. And yet - yet there was almost a feeling of disappointment that he had not written a disapproving letter such as Lady Macleod had anticipated.\nDuring the next week Lady Macleod still came almost daily to see Alice, but nothing was said about the Swiss tour; nor did she ask about Mr. Grey's opinion. When the old lady discovered that there was no quarrel, she had to be contented. Nor did she again attempt to take Alice to Lady Midlothian's.\nIndeed, their usual subjects of conversation were almost abandoned. Lady Macleod did not dare to talk about Mr. Grey, and became silent, reserved, and fretful. At length came the last day of her London season, and her last visit to her niece.\n\"I came because it's my last day,\" said Lady Macleod; \"even though I have so many things to do.\"\n\"It's very kind,\" said Alice, giving her aunt an affectionate squeeze of the hand.\n\"I'm keeping the cab, so I can just stay twenty-five minutes. I've marked the time accurately, but I know the man will swear it's over the half-hour.\"\n\"You'll have no more trouble about cabs, aunt, when you are back in Cheltenham.\"\n\"It's my last time here. I shall never come up to London again, my dear.\"\n\"Oh, aunt, don't say that!\"\n\"But I do say it, my dear. Why should an old woman like me come trailing up to town every year?\"\n\"To see your friends, of course. Age doesn't matter when a person's health is as good as yours.\"\n\"If you knew what I suffer from lumbago. But as for friends-! Well, I suppose one has no right to complain; but I believe that those I love best would rather be without me than with me.\"\n\"Do you mean me, aunt?\"\n\"No, my dear, I don't mean you. I don't know that I meant any one. You shouldn't mind what an old woman like me says.\"\n\"You're a little melancholy because you're going away.\"\n\"No, indeed. I don't know why I stayed the last week. Though I told Lady Midlothian that I should be leaving, she has not once asked me even to lunch since. It's so very lonely dining by myself in lodgings.\"\n\"And yet you never will come and dine with me.\"\n\"No, my dear. But we won't talk about that. I've just one word more to say. I've six minutes. I've made up my mind that I'll never come up to town again - except for one thing.\"\n\"And what's that, aunt?\" Alice already knew the answer.\n\"Your marriage, my dear. I do hope you will not keep me waiting long.\"\n\"Ah! I can't make any promise. There's no knowing when that may be.\"\n\"Why not? When a girl is once engaged, the sooner she's married the better. You don't mean to say that Mr. Grey is putting it off?\"\nAlice was silent for a moment, while Lady Macleod's face assumed a look of almost tragic horror. Alice was too honest to allow the impression to remain.\n\"No, aunt,\" she said; \"Mr. Grey is not putting it off. It has been left to me to fix the day.\"\n\"And why don't you fix it?\"\n\"It is such a serious thing! After all, it is not more than four months yet since I - I accepted him.\"\n\"But you might fix the day now.\"\n\"Well, perhaps I shall - some time, aunt. I'm going to think about it, and you mustn't push me.\"\n\"But you should have someone to advise you, Alice.\"\n\"Ah! that's just it. People always do seem to think it so terrible that a girl should have her own way in anything. She mustn't like any one at first; and then, when she does like someone, she must marry him as soon as she's told. I haven't much of my own way at present; but when I'm married I shan't have it at all. So I'm in no hurry.\"\n\"I am not advocating any hurry, my dear. But, goodness me! I've been here twenty-eight minutes, and that horrid man will impose upon me. Good-bye; God bless you! Mind you write.\" And Lady Macleod hurried out.\nThen John Grey came up to town. Alice may have used some diplomatic skill in preventing a meeting between Lady Macleod and her lover, for if they had put their forces together she might have found herself unable to resist their joint endeavours. She was resolved not to name any day for her marriage before her return from Switzerland.\nDuring this visit of Mr. Grey's to London, Mr. Vavasor did a very memorable thing. He dined at home to welcome his future son-in-law; and asked, or rather agreed to Alice's asking, George and Kate Vavasor to join the dinner-party.\n\"What an auspicious omen for your marriage!\" said Kate, with her little sarcastic smile. \"Uncle John dines at home, and Mr. Grey joins in the dissipation of a dinner-party. We shall all be changed soon, I suppose, and George and I will take to keeping a little cottage in the country.\"\n\"Kate,\" said Alice, angrily, \"I think you are about the most unjust person I ever met.\"\n\"And to whom am I being unjust; to your father?\"\n\"It was Mr. Grey whom you meant to attack. If I can forgive him for not caring for society, surely you might do so.\"\n\"Exactly; but you can't, my dear. You don't forgive him. If you did, I would say nothing. But when you tell me all your own thoughts about it you can hardly expect me to keep quiet. Still, if you are ready for a little useful hypocrisy, I won't prevent you. I mayn't be quite so dishonest as you call me, but I can speak a few falsehoods if you wish it. Only let us understand each other.\"\n\"You know I wish for no falsehood, Kate.\"\n\"It's very hard to understand what you do wish. For the last year or two I have been trying to find out your wishes, without success. I suppose you wish to marry Mr. Grey, but I'm by no means certain. I suppose the last thing on earth you'd wish would be to marry George?\"\n\"The very last. You're right there at any rate.\"\n\"Alice! You make me doubt whether I hate or love you most. Knowing what my feelings are about George, I cannot understand how you can bring yourself to speak of him with such contempt!\" Kate Vavasor left the room quickly, and hurried up to her own chamber. There Alice found her in tears, and was driven by her friend's real grief into making an apology which she felt she did not owe.\nKate knew all the circumstances of that old affair between her brother and Alice. She had agreed with the propriety of what Alice had done. She had admitted that her brother George's behaviour had made any engagement impossible. The fault had been hers, in referring to the possibility of such a marriage.\nIt had not been for the first time. Since Alice had become engaged to Mr. Grey, Kate had been constantly mentioning those past events, which all of them should have tried to forget. Under these circumstances was not Lady Macleod right in saying that George Vavasor should not have been accepted as a companion for the Swiss tour?\nThe little dinner-party went off very quietly. The two young men had never before met each other; and George Vavasor had gone to his uncle's house, prepared not only to dislike but to despise his successor. But in this he was disappointed.\n\"He has plenty to say for himself,\" he said to Kate on his way home.\n\"Oh yes; he can talk.\"\n\"And he doesn't talk like a prig either, like I expected. He's uncommonly handsome.\"\n\"So you're going into raptures in favour of John Grey.\"\n\"No, I'm not. I very seldom go into raptures about anything. But he talks in the way I like a man to talk.\"\nThere was nothing more said then about John Grey; but Kate understood her brother well enough to be aware that this praise meant very little. George Vavasor spoke sometimes from his heart, but generally from his head.\nOn the day after the little dinner, John Grey came to say good-bye to Alice. Though he had been constantly with her during the last three days, he had not said anything about the day of their marriage. He had told her much of Switzerland, which he knew well, and of his house and garden, and other matters, for Mr. Grey was a man who knew how to make words pleasant; but he had said nothing on that subject on which he was so intent.\n\"Well, Alice,\" he said, when the last hour had come, \"and about that question of home affairs. Is there any reason why you'd rather not have this thing settled?\"\n\"No; no special reason.\"\n\"Then why not let it be fixed? Do you fear coming to me as my wife?\"\n\"No.\"\n\"I cannot think that you repent your goodness to me.\"\n\"No; I love you too entirely for that.\"\n\"My darling!\" He passed his arm round her waist. \"Then why should you not wish to come to me?\"\n\"I do wish it, I think. But a person may wish for a thing, and yet not wish for it instantly.\"\n\"Instantly! Come; I have not been hard on you. This is still June. Will you say the middle of September, and we shall still be in time for warm pleasant days among the lakes? Is that asking for too much?\"\n\"It is not asking for anything.\"\n\"Nay, but it is, love. Grant it, and I will swear that you have granted me everything.\"\nShe was silent, not knowing what words to use. Now that he was with her she could not say the things which she had told herself that she would say to him. She could not bring herself to hint that his views of life were so unlike her own that there could be no chance of happiness between them, unless each could strive to lean towards the other.\nNo man could be more gracious or chivalrous than John Grey; but he always spoke as though there could be no question that his manner of life was to be adopted, without a thought of doubting, by his wife. Why should not each yield something, and each claim something? This she had meant to say to him; but now that he was with her she could not say it.\n\"John,\" she said at last, \"do not press me about this till I return. I cannot answer you now; it is such a solemn thing.\"\n\"Will it ever be less solemn, dearest?\"\n\"Never, I hope.\"\nHe did not press her further then, but kissed her and bade her farewell.",
        "paragraph_chars": [
            [
                0,
                213
            ],
            [
                213,
                228
            ],
            [
                228,
                437
            ],
            [
                437,
                1621
            ],
            [
                1621,
                2189
            ],
            [
                2189,
                2407
            ],
            [
                2407,
                2826
            ],
            [
                2826,
                2849
            ],
            [
                2849,
                2855
            ],
            [
                2855,
                3132
            ],
            [
                3132,
                3432
            ],
            [
                3432,
                3548
            ],
            [
                3548,
                4113
            ],
            [
                4113,
                4447
            ],
            [
                4447,
                4659
            ],
            [
                4659,
                4699
            ],
            [
                4699,
                5006
            ],
            [
                5006,
                5300
            ],
            [
                5300,
                5818
            ],
            [
                5818,
                6202
            ],
            [
                6202,
                6543
            ],
            [
                6543,
                7168
            ],
            [
                7168,
                7468
            ],
            [
                7468,
                7711
            ],
            [
                7711,
                7808
            ],
            [
                7808,
                7891
            ],
            [
                7891,
                8042
            ],
            [
                8042,
                8123
            ],
            [
                8123,
                8197
            ],
            [
                8197,
                8225
            ],
            [
                8225,
                8322
            ],
            [
                8322,
                8419
            ],
            [
                8419,
                8606
            ],
            [
                8606,
                8630
            ],
            [
                8630,
                8749
            ],
            [
                8749,
                8805
            ],
            [
                8805,
                9013
            ],
            [
                9013,
                9061
            ],
            [
                9061,
                9239
            ],
            [
                9239,
                9295
            ],
            [
                9295,
                9366
            ],
            [
                9366,
                9435
            ],
            [
                9435,
                9567
            ],
            [
                9567,
                9720
            ],
            [
                9720,
                9815
            ],
            [
                9815,
                9843
            ],
            [
                9843,
                9946
            ],
            [
                9946,
                9979
            ],
            [
                9979,
                10076
            ],
            [
                10076,
                10128
            ],
            [
                10128,
                10467
            ],
            [
                10467,
                10676
            ],
            [
                10676,
                11012
            ],
            [
                11012,
                11243
            ],
            [
                11243,
                11529
            ],
            [
                11529,
                11617
            ],
            [
                11617,
                11666
            ],
            [
                11666,
                11783
            ],
            [
                11783,
                12173
            ],
            [
                12173,
                12215
            ],
            [
                12215,
                12488
            ],
            [
                12488,
                12537
            ],
            [
                12537,
                12923
            ],
            [
                12923,
                13229
            ],
            [
                13229,
                13559
            ],
            [
                13559,
                13799
            ],
            [
                13799,
                13868
            ],
            [
                13868,
                13891
            ],
            [
                13891,
                13976
            ],
            [
                13976,
                14032
            ],
            [
                14032,
                14140
            ],
            [
                14140,
                14358
            ],
            [
                14358,
                14792
            ],
            [
                14792,
                14954
            ],
            [
                14954,
                14979
            ],
            [
                14979,
                15048
            ],
            [
                15048,
                15054
            ],
            [
                15054,
                15108
            ],
            [
                15108,
                15148
            ],
            [
                15148,
                15243
            ],
            [
                15243,
                15338
            ],
            [
                15338,
                15543
            ],
            [
                15543,
                15576
            ],
            [
                15576,
                15664
            ],
            [
                15664,
                16010
            ],
            [
                16010,
                16362
            ],
            [
                16362,
                16484
            ],
            [
                16484,
                16524
            ],
            [
                16524,
                16541
            ],
            [
                16541,
                16613
            ]
        ],
        "segment_chars": [
            [
                0,
                65
            ],
            [
                65,
                213
            ],
            [
                213,
                228
            ],
            [
                228,
                300
            ],
            [
                300,
                390
            ],
            [
                390,
                437
            ],
            [
                437,
                522
            ],
            [
                522,
                729
            ],
            [
                729,
                826
            ],
            [
                826,
                901
            ],
            [
                901,
                1105
            ],
            [
                1105,
                1158
            ],
            [
                1158,
                1274
            ],
            [
                1274,
                1358
            ],
            [
                1358,
                1487
            ],
            [
                1487,
                1621
            ],
            [
                1621,
                1687
            ],
            [
                1687,
                1782
            ],
            [
                1782,
                1878
            ],
            [
                1878,
                1954
            ],
            [
                1954,
                2080
            ],
            [
                2080,
                2189
            ],
            [
                2189,
                2271
            ],
            [
                2271,
                2407
            ],
            [
                2407,
                2441
            ],
            [
                2441,
                2578
            ],
            [
                2578,
                2807
            ],
            [
                2807,
                2826
            ],
            [
                2826,
                2849
            ],
            [
                2849,
                2855
            ],
            [
                2855,
                2964
            ],
            [
                2964,
                3061
            ],
            [
                3061,
                3132
            ],
            [
                3132,
                3232
            ],
            [
                3232,
                3302
            ],
            [
                3302,
                3432
            ],
            [
                3432,
                3548
            ],
            [
                3548,
                3612
            ],
            [
                3612,
                3650
            ],
            [
                3650,
                3679
            ],
            [
                3679,
                3757
            ],
            [
                3757,
                3820
            ],
            [
                3820,
                3961
            ],
            [
                3961,
                4007
            ],
            [
                4007,
                4113
            ],
            [
                4113,
                4160
            ],
            [
                4160,
                4210
            ],
            [
                4210,
                4276
            ],
            [
                4276,
                4331
            ],
            [
                4331,
                4359
            ],
            [
                4359,
                4447
            ],
            [
                4447,
                4494
            ],
            [
                4494,
                4627
            ],
            [
                4627,
                4659
            ],
            [
                4659,
                4699
            ],
            [
                4699,
                4717
            ],
            [
                4717,
                4754
            ],
            [
                4754,
                4868
            ],
            [
                4868,
                5006
            ],
            [
                5006,
                5178
            ],
            [
                5178,
                5226
            ],
            [
                5226,
                5300
            ],
            [
                5300,
                5345
            ],
            [
                5345,
                5372
            ],
            [
                5372,
                5465
            ],
            [
                5465,
                5533
            ],
            [
                5533,
                5597
            ],
            [
                5597,
                5695
            ],
            [
                5695,
                5818
            ],
            [
                5818,
                5938
            ],
            [
                5938,
                5984
            ],
            [
                5984,
                6059
            ],
            [
                6059,
                6202
            ],
            [
                6202,
                6256
            ],
            [
                6256,
                6298
            ],
            [
                6298,
                6373
            ],
            [
                6373,
                6412
            ],
            [
                6412,
                6451
            ],
            [
                6451,
                6543
            ],
            [
                6543,
                6620
            ],
            [
                6620,
                6762
            ],
            [
                6762,
                6924
            ],
            [
                6924,
                7025
            ],
            [
                7025,
                7168
            ],
            [
                7168,
                7325
            ],
            [
                7325,
                7406
            ],
            [
                7406,
                7468
            ],
            [
                7468,
                7536
            ],
            [
                7536,
                7628
            ],
            [
                7628,
                7711
            ],
            [
                7711,
                7808
            ],
            [
                7808,
                7891
            ],
            [
                7891,
                7953
            ],
            [
                7953,
                8042
            ],
            [
                8042,
                8123
            ],
            [
                8123,
                8148
            ],
            [
                8148,
                8197
            ],
            [
                8197,
                8225
            ],
            [
                8225,
                8252
            ],
            [
                8252,
                8322
            ],
            [
                8322,
                8355
            ],
            [
                8355,
                8419
            ],
            [
                8419,
                8460
            ],
            [
                8460,
                8481
            ],
            [
                8481,
                8606
            ],
            [
                8606,
                8630
            ],
            [
                8630,
                8662
            ],
            [
                8662,
                8697
            ],
            [
                8697,
                8749
            ],
            [
                8749,
                8805
            ],
            [
                8805,
                8818
            ],
            [
                8818,
                8859
            ],
            [
                8859,
                8962
            ],
            [
                8962,
                9013
            ],
            [
                9013,
                9061
            ],
            [
                9061,
                9075
            ],
            [
                9075,
                9105
            ],
            [
                9105,
                9137
            ],
            [
                9137,
                9155
            ],
            [
                9155,
                9239
            ],
            [
                9239,
                9264
            ],
            [
                9264,
                9295
            ],
            [
                9295,
                9320
            ],
            [
                9320,
                9366
            ],
            [
                9366,
                9371
            ],
            [
                9371,
                9397
            ],
            [
                9397,
                9435
            ],
            [
                9435,
                9445
            ],
            [
                9445,
                9511
            ],
            [
                9511,
                9567
            ],
            [
                9567,
                9664
            ],
            [
                9664,
                9720
            ],
            [
                9720,
                9775
            ],
            [
                9775,
                9815
            ],
            [
                9815,
                9843
            ],
            [
                9843,
                9872
            ],
            [
                9872,
                9946
            ],
            [
                9946,
                9979
            ],
            [
                9979,
                10021
            ],
            [
                10021,
                10076
            ],
            [
                10076,
                10128
            ],
            [
                10128,
                10133
            ],
            [
                10133,
                10149
            ],
            [
                10149,
                10244
            ],
            [
                10244,
                10359
            ],
            [
                10359,
                10446
            ],
            [
                10446,
                10467
            ],
            [
                10467,
                10508
            ],
            [
                10508,
                10526
            ],
            [
                10526,
                10604
            ],
            [
                10604,
                10629
            ],
            [
                10629,
                10646
            ],
            [
                10646,
                10676
            ],
            [
                10676,
                10708
            ],
            [
                10708,
                10922
            ],
            [
                10922,
                11012
            ],
            [
                11012,
                11095
            ],
            [
                11095,
                11243
            ],
            [
                11243,
                11288
            ],
            [
                11288,
                11332
            ],
            [
                11332,
                11416
            ],
            [
                11416,
                11529
            ],
            [
                11529,
                11617
            ],
            [
                11617,
                11666
            ],
            [
                11666,
                11709
            ],
            [
                11709,
                11783
            ],
            [
                11783,
                11817
            ],
            [
                11817,
                11840
            ],
            [
                11840,
                11873
            ],
            [
                11873,
                11965
            ],
            [
                11965,
                12041
            ],
            [
                12041,
                12137
            ],
            [
                12137,
                12173
            ],
            [
                12173,
                12215
            ],
            [
                12215,
                12263
            ],
            [
                12263,
                12349
            ],
            [
                12349,
                12416
            ],
            [
                12416,
                12488
            ],
            [
                12488,
                12504
            ],
            [
                12504,
                12537
            ],
            [
                12537,
                12545
            ],
            [
                12545,
                12596
            ],
            [
                12596,
                12723
            ],
            [
                12723,
                12794
            ],
            [
                12794,
                12923
            ],
            [
                12923,
                13005
            ],
            [
                13005,
                13063
            ],
            [
                13063,
                13152
            ],
            [
                13152,
                13229
            ],
            [
                13229,
                13265
            ],
            [
                13265,
                13411
            ],
            [
                13411,
                13559
            ],
            [
                13559,
                13606
            ],
            [
                13606,
                13766
            ],
            [
                13766,
                13799
            ],
            [
                13799,
                13868
            ],
            [
                13868,
                13891
            ],
            [
                13891,
                13949
            ],
            [
                13949,
                13976
            ],
            [
                13976,
                14032
            ],
            [
                14032,
                14046
            ],
            [
                14046,
                14093
            ],
            [
                14093,
                14140
            ],
            [
                14140,
                14282
            ],
            [
                14282,
                14358
            ],
            [
                14358,
                14435
            ],
            [
                14435,
                14560
            ],
            [
                14560,
                14792
            ],
            [
                14792,
                14887
            ],
            [
                14887,
                14954
            ],
            [
                14954,
                14979
            ],
            [
                14979,
                15010
            ],
            [
                15010,
                15048
            ],
            [
                15048,
                15054
            ],
            [
                15054,
                15108
            ],
            [
                15108,
                15148
            ],
            [
                15148,
                15162
            ],
            [
                15162,
                15197
            ],
            [
                15197,
                15243
            ],
            [
                15243,
                15267
            ],
            [
                15267,
                15338
            ],
            [
                15338,
                15350
            ],
            [
                15350,
                15385
            ],
            [
                15385,
                15405
            ],
            [
                15405,
                15513
            ],
            [
                15513,
                15543
            ],
            [
                15543,
                15576
            ],
            [
                15576,
                15599
            ],
            [
                15599,
                15664
            ],
            [
                15664,
                15711
            ],
            [
                15711,
                15819
            ],
            [
                15819,
                16010
            ],
            [
                16010,
                16214
            ],
            [
                16214,
                16277
            ],
            [
                16277,
                16362
            ],
            [
                16362,
                16431
            ],
            [
                16431,
                16484
            ],
            [
                16484,
                16524
            ],
            [
                16524,
                16541
            ],
            [
                16541,
                16613
            ]
        ],
        "overlap_chars": [
            [
                0,
                5
            ],
            [
                6,
                14
            ],
            [
                15,
                16
            ],
            [
                17,
                35
            ],
            [
                40,
                46
            ],
            [
                47,
                50
            ],
            [
                56,
                63
            ],
            [
                63,
                65
            ],
            [
                65,
                71
            ],
            [
                80,
                82
            ],
            [
                83,
                95
            ],
            [
                100,
                137
            ],
            [
                137,
                138
            ],
            [
                145,
                147
            ],
            [
                148,
                175
            ],
            [
                176,
                192
            ],
            [
                193,
                213
            ],
            [
                213,
                228
            ],
            [
                228,
                259
            ],
            [
                260,
                275
            ],
            [
                276,
                291
            ],
            [
                298,
                300
            ],
            [
                300,
                302
            ],
            [
                307,
                324
            ],
            [
                326,
                390
            ],
            [
                390,
                401
            ],
            [
                411,
                413
            ],
            [
                422,
                425
            ],
            [
                435,
                436
            ],
            [
                443,
                466
            ],
            [
                467,
                522
            ],
            [
                522,
                545
            ],
            [
                546,
                550
            ],
            [
                551,
                556
            ],
            [
                561,
                582
            ],
            [
                588,
                595
            ],
            [
                595,
                680
            ],
            [
                685,
                687
            ],
            [
                687,
                692
            ],
            [
                693,
                714
            ],
            [
                715,
                729
            ],
            [
                729,
                826
            ],
            [
                826,
                879
            ],
            [
                899,
                901
            ],
            [
                904,
                907
            ],
            [
                920,
                1019
            ],
            [
                1027,
                1029
            ],
            [
                1039,
                1047
            ],
            [
                1048,
                1056
            ],
            [
                1056,
                1060
            ],
            [
                1061,
                1065
            ],
            [
                1070,
                1105
            ],
            [
                1105,
                1116
            ],
            [
                1131,
                1158
            ],
            [
                1158,
                1208
            ],
            [
                1209,
                1274
            ],
            [
                1274,
                1275
            ],
            [
                1284,
                1356
            ],
            [
                1356,
                1358
            ],
            [
                1358,
                1415
            ],
            [
                1424,
                1487
            ],
            [
                1487,
                1621
            ],
            [
                1621,
                1643
            ],
            [
                1643,
                1644
            ],
            [
                1645,
                1670
            ],
            [
                1671,
                1687
            ],
            [
                1687,
                1782
            ],
            [
                1782,
                1878
            ],
            [
                1878,
                1954
            ],
            [
                1966,
                2066
            ],
            [
                2067,
                2078
            ],
            [
                2078,
                2080
            ],
            [
                2080,
                2086
            ],
            [
                2096,
                2104
            ],
            [
                2105,
                2109
            ],
            [
                2110,
                2128
            ],
            [
                2134,
                2136
            ],
            [
                2141,
                2151
            ],
            [
                2152,
                2155
            ],
            [
                2156,
                2189
            ],
            [
                2195,
                2213
            ],
            [
                2215,
                2250
            ],
            [
                2258,
                2269
            ],
            [
                2269,
                2271
            ],
            [
                2279,
                2311
            ],
            [
                2315,
                2320
            ],
            [
                2324,
                2347
            ],
            [
                2348,
                2355
            ],
            [
                2356,
                2373
            ],
            [
                2374,
                2383
            ],
            [
                2394,
                2406
            ],
            [
                2407,
                2441
            ],
            [
                2441,
                2561
            ],
            [
                2571,
                2578
            ],
            [
                2578,
                2645
            ],
            [
                2646,
                2653
            ],
            [
                2653,
                2807
            ],
            [
                2807,
                2826
            ],
            [
                2826,
                2849
            ],
            [
                2849,
                2855
            ],
            [
                2855,
                2964
            ],
            [
                2964,
                3035
            ],
            [
                3035,
                3061
            ],
            [
                3061,
                3089
            ],
            [
                3090,
                3103
            ],
            [
                3104,
                3114
            ],
            [
                3115,
                3131
            ],
            [
                3132,
                3150
            ],
            [
                3150,
                3184
            ],
            [
                3185,
                3232
            ],
            [
                3232,
                3273
            ],
            [
                3285,
                3302
            ],
            [
                3302,
                3331
            ],
            [
                3332,
                3355
            ],
            [
                3362,
                3365
            ],
            [
                3366,
                3375
            ],
            [
                3380,
                3383
            ],
            [
                3384,
                3406
            ],
            [
                3416,
                3430
            ],
            [
                3430,
                3431
            ],
            [
                3432,
                3470
            ],
            [
                3470,
                3481
            ],
            [
                3482,
                3484
            ],
            [
                3485,
                3514
            ],
            [
                3519,
                3546
            ],
            [
                3546,
                3548
            ],
            [
                3548,
                3610
            ],
            [
                3610,
                3612
            ],
            [
                3612,
                3650
            ],
            [
                3650,
                3669
            ],
            [
                3670,
                3673
            ],
            [
                3674,
                3679
            ],
            [
                3679,
                3717
            ],
            [
                3718,
                3743
            ],
            [
                3748,
                3757
            ],
            [
                3771,
                3775
            ],
            [
                3776,
                3781
            ],
            [
                3787,
                3789
            ],
            [
                3799,
                3803
            ],
            [
                3808,
                3820
            ],
            [
                3823,
                3825
            ],
            [
                3831,
                3841
            ],
            [
                3847,
                3871
            ],
            [
                3872,
                3961
            ],
            [
                3961,
                3981
            ],
            [
                3985,
                3987
            ],
            [
                3991,
                4001
            ],
            [
                4005,
                4007
            ],
            [
                4007,
                4013
            ],
            [
                4045,
                4077
            ],
            [
                4078,
                4112
            ],
            [
                4113,
                4121
            ],
            [
                4127,
                4139
            ],
            [
                4143,
                4146
            ],
            [
                4158,
                4160
            ],
            [
                4160,
                4183
            ],
            [
                4190,
                4203
            ],
            [
                4204,
                4210
            ],
            [
                4210,
                4276
            ],
            [
                4276,
                4312
            ],
            [
                4315,
                4321
            ],
            [
                4322,
                4331
            ],
            [
                4339,
                4359
            ],
            [
                4359,
                4415
            ],
            [
                4416,
                4420
            ],
            [
                4426,
                4427
            ],
            [
                4428,
                4435
            ],
            [
                4436,
                4439
            ],
            [
                4440,
                4445
            ],
            [
                4447,
                4450
            ],
            [
                4451,
                4456
            ],
            [
                4461,
                4494
            ],
            [
                4494,
                4519
            ],
            [
                4520,
                4572
            ],
            [
                4573,
                4614
            ],
            [
                4625,
                4627
            ],
            [
                4627,
                4648
            ],
            [
                4649,
                4659
            ],
            [
                4668,
                4698
            ],
            [
                4699,
                4703
            ],
            [
                4704,
                4710
            ],
            [
                4715,
                4717
            ],
            [
                4717,
                4744
            ],
            [
                4745,
                4754
            ],
            [
                4754,
                4866
            ],
            [
                4866,
                4868
            ],
            [
                4868,
                4898
            ],
            [
                4912,
                4925
            ],
            [
                4926,
                4957
            ],
            [
                4977,
                5005
            ],
            [
                5006,
                5145
            ],
            [
                5146,
                5176
            ],
            [
                5176,
                5178
            ],
            [
                5188,
                5226
            ],
            [
                5226,
                5262
            ],
            [
                5265,
                5300
            ],
            [
                5300,
                5345
            ],
            [
                5345,
                5372
            ],
            [
                5372,
                5390
            ],
            [
                5391,
                5411
            ],
            [
                5412,
                5415
            ],
            [
                5450,
                5465
            ],
            [
                5472,
                5508
            ],
            [
                5509,
                5512
            ],
            [
                5518,
                5523
            ],
            [
                5531,
                5533
            ],
            [
                5533,
                5539
            ],
            [
                5540,
                5544
            ],
            [
                5545,
                5597
            ],
            [
                5597,
                5612
            ],
            [
                5613,
                5688
            ],
            [
                5689,
                5695
            ],
            [
                5695,
                5729
            ],
            [
                5737,
                5755
            ],
            [
                5756,
                5801
            ],
            [
                5802,
                5810
            ],
            [
                5811,
                5816
            ],
            [
                5816,
                5817
            ],
            [
                5818,
                5821
            ],
            [
                5822,
                5828
            ],
            [
                5848,
                5851
            ],
            [
                5852,
                5863
            ],
            [
                5864,
                5871
            ],
            [
                5872,
                5877
            ],
            [
                5887,
                5895
            ],
            [
                5896,
                5902
            ],
            [
                5902,
                5903
            ],
            [
                5904,
                5921
            ],
            [
                5926,
                5938
            ],
            [
                5938,
                5945
            ],
            [
                5946,
                5965
            ],
            [
                5972,
                5982
            ],
            [
                5982,
                5984
            ],
            [
                5984,
                6026
            ],
            [
                6029,
                6032
            ],
            [
                6041,
                6044
            ],
            [
                6045,
                6059
            ],
            [
                6059,
                6088
            ],
            [
                6089,
                6098
            ],
            [
                6108,
                6194
            ],
            [
                6200,
                6202
            ],
            [
                6202,
                6213
            ],
            [
                6223,
                6256
            ],
            [
                6256,
                6298
            ],
            [
                6298,
                6302
            ],
            [
                6303,
                6314
            ],
            [
                6315,
                6356
            ],
            [
                6357,
                6373
            ],
            [
                6378,
                6391
            ],
            [
                6400,
                6404
            ],
            [
                6410,
                6412
            ],
            [
                6412,
                6451
            ],
            [
                6451,
                6468
            ],
            [
                6469,
                6482
            ],
            [
                6483,
                6491
            ],
            [
                6491,
                6543
            ],
            [
                6543,
                6558
            ],
            [
                6585,
                6620
            ],
            [
                6620,
                6687
            ],
            [
                6687,
                6688
            ],
            [
                6697,
                6700
            ],
            [
                6706,
                6717
            ],
            [
                6730,
                6734
            ],
            [
                6746,
                6749
            ],
            [
                6750,
                6760
            ],
            [
                6760,
                6762
            ],
            [
                6767,
                6772
            ],
            [
                6773,
                6776
            ],
            [
                6777,
                6794
            ],
            [
                6795,
                6800
            ],
            [
                6801,
                6808
            ],
            [
                6815,
                6817
            ],
            [
                6826,
                6827
            ],
            [
                6828,
                6834
            ],
            [
                6834,
                6835
            ],
            [
                6845,
                6854
            ],
            [
                6854,
                6855
            ],
            [
                6856,
                6859
            ],
            [
                6860,
                6888
            ],
            [
                6888,
                6893
            ],
            [
                6894,
                6898
            ],
            [
                6899,
                6910
            ],
            [
                6911,
                6924
            ],
            [
                6924,
                6956
            ],
            [
                6957,
                6981
            ],
            [
                6982,
                7025
            ],
            [
                7025,
                7032
            ],
            [
                7035,
                7083
            ],
            [
                7084,
                7107
            ],
            [
                7108,
                7109
            ],
            [
                7123,
                7129
            ],
            [
                7130,
                7134
            ],
            [
                7135,
                7168
            ],
            [
                7168,
                7228
            ],
            [
                7238,
                7251
            ],
            [
                7252,
                7260
            ],
            [
                7267,
                7286
            ],
            [
                7299,
                7323
            ],
            [
                7323,
                7325
            ],
            [
                7330,
                7342
            ],
            [
                7343,
                7380
            ],
            [
                7381,
                7384
            ],
            [
                7389,
                7406
            ],
            [
                7406,
                7423
            ],
            [
                7424,
                7467
            ],
            [
                7468,
                7534
            ],
            [
                7534,
                7536
            ],
            [
                7549,
                7589
            ],
            [
                7597,
                7628
            ],
            [
                7628,
                7710
            ],
            [
                7711,
                7713
            ],
            [
                7719,
                7766
            ],
            [
                7778,
                7779
            ],
            [
                7780,
                7805
            ],
            [
                7805,
                7808
            ],
            [
                7808,
                7891
            ],
            [
                7891,
                7953
            ],
            [
                7953,
                8042
            ],
            [
                8042,
                8123
            ],
            [
                8124,
                8128
            ],
            [
                8132,
                8141
            ],
            [
                8146,
                8148
            ],
            [
                8148,
                8197
            ],
            [
                8197,
                8225
            ],
            [
                8225,
                8252
            ],
            [
                8256,
                8283
            ],
            [
                8289,
                8319
            ],
            [
                8322,
                8355
            ],
            [
                8355,
                8399
            ],
            [
                8403,
                8419
            ],
            [
                8419,
                8458
            ],
            [
                8458,
                8460
            ],
            [
                8460,
                8478
            ],
            [
                8479,
                8481
            ],
            [
                8481,
                8525
            ],
            [
                8525,
                8530
            ],
            [
                8531,
                8569
            ],
            [
                8577,
                8606
            ],
            [
                8606,
                8630
            ],
            [
                8630,
                8662
            ],
            [
                8662,
                8697
            ],
            [
                8697,
                8749
            ],
            [
                8749,
                8805
            ],
            [
                8805,
                8818
            ],
            [
                8818,
                8859
            ],
            [
                8859,
                8867
            ],
            [
                8873,
                8895
            ],
            [
                8896,
                8902
            ],
            [
                8903,
                8905
            ],
            [
                8913,
                8931
            ],
            [
                8932,
                8940
            ],
            [
                8946,
                8948
            ],
            [
                8949,
                8954
            ],
            [
                8955,
                8961
            ],
            [
                8962,
                9010
            ],
            [
                9010,
                9013
            ],
            [
                9013,
                9061
            ],
            [
                9061,
                9073
            ],
            [
                9073,
                9075
            ],
            [
                9075,
                9105
            ],
            [
                9105,
                9137
            ],
            [
                9137,
                9141
            ],
            [
                9142,
                9153
            ],
            [
                9153,
                9155
            ],
            [
                9155,
                9213
            ],
            [
                9216,
                9239
            ],
            [
                9239,
                9264
            ],
            [
                9264,
                9269
            ],
            [
                9278,
                9282
            ],
            [
                9283,
                9286
            ],
            [
                9293,
                9295
            ],
            [
                9295,
                9296
            ],
            [
                9296,
                9320
            ],
            [
                9320,
                9350
            ],
            [
                9351,
                9358
            ],
            [
                9359,
                9363
            ],
            [
                9363,
                9366
            ],
            [
                9366,
                9371
            ],
            [
                9371,
                9397
            ],
            [
                9397,
                9435
            ],
            [
                9435,
                9436
            ],
            [
                9436,
                9439
            ],
            [
                9443,
                9444
            ],
            [
                9445,
                9472
            ],
            [
                9474,
                9511
            ],
            [
                9511,
                9567
            ],
            [
                9567,
                9597
            ],
            [
                9604,
                9664
            ],
            [
                9664,
                9669
            ],
            [
                9670,
                9719
            ],
            [
                9720,
                9775
            ],
            [
                9775,
                9808
            ],
            [
                9812,
                9815
            ],
            [
                9815,
                9843
            ],
            [
                9843,
                9872
            ],
            [
                9872,
                9881
            ],
            [
                9883,
                9926
            ],
            [
                9929,
                9943
            ],
            [
                9946,
                9968
            ],
            [
                9973,
                9976
            ],
            [
                9976,
                9979
            ],
            [
                9979,
                10001
            ],
            [
                10004,
                10008
            ],
            [
                10013,
                10021
            ],
            [
                10021,
                10065
            ],
            [
                10071,
                10076
            ],
            [
                10076,
                10096
            ],
            [
                10105,
                10128
            ],
            [
                10128,
                10133
            ],
            [
                10133,
                10149
            ],
            [
                10149,
                10244
            ],
            [
                10244,
                10307
            ],
            [
                10315,
                10335
            ],
            [
                10347,
                10352
            ],
            [
                10357,
                10359
            ],
            [
                10359,
                10403
            ],
            [
                10404,
                10446
            ],
            [
                10449,
                10450
            ],
            [
                10453,
                10455
            ],
            [
                10459,
                10467
            ],
            [
                10467,
                10487
            ],
            [
                10492,
                10508
            ],
            [
                10508,
                10521
            ],
            [
                10522,
                10526
            ],
            [
                10526,
                10604
            ],
            [
                10604,
                10629
            ],
            [
                10629,
                10646
            ],
            [
                10646,
                10674
            ],
            [
                10674,
                10676
            ],
            [
                10676,
                10706
            ],
            [
                10706,
                10708
            ],
            [
                10708,
                10713
            ],
            [
                10723,
                10808
            ],
            [
                10808,
                10809
            ],
            [
                10817,
                10821
            ],
            [
                10822,
                10825
            ],
            [
                10826,
                10922
            ],
            [
                10922,
                10938
            ],
            [
                10939,
                10942
            ],
            [
                10943,
                10945
            ],
            [
                10946,
                11010
            ],
            [
                11010,
                11011
            ],
            [
                11024,
                11029
            ],
            [
                11030,
                11032
            ],
            [
                11033,
                11041
            ],
            [
                11044,
                11046
            ],
            [
                11047,
                11053
            ],
            [
                11053,
                11054
            ],
            [
                11055,
                11095
            ],
            [
                11095,
                11111
            ],
            [
                11123,
                11144
            ],
            [
                11146,
                11166
            ],
            [
                11174,
                11242
            ],
            [
                11243,
                11271
            ],
            [
                11285,
                11288
            ],
            [
                11288,
                11332
            ],
            [
                11332,
                11416
            ],
            [
                11416,
                11529
            ],
            [
                11529,
                11614
            ],
            [
                11617,
                11629
            ],
            [
                11647,
                11648
            ],
            [
                11649,
                11666
            ],
            [
                11666,
                11667
            ],
            [
                11667,
                11709
            ],
            [
                11709,
                11783
            ],
            [
                11783,
                11796
            ],
            [
                11797,
                11806
            ],
            [
                11806,
                11817
            ],
            [
                11817,
                11840
            ],
            [
                11840,
                11850
            ],
            [
                11852,
                11853
            ],
            [
                11860,
                11873
            ],
            [
                11873,
                11921
            ],
            [
                11925,
                11946
            ],
            [
                11963,
                11965
            ],
            [
                11970,
                11971
            ],
            [
                11972,
                12001
            ],
            [
                12002,
                12027
            ],
            [
                12036,
                12041
            ],
            [
                12041,
                12093
            ],
            [
                12094,
                12097
            ],
            [
                12098,
                12137
            ],
            [
                12137,
                12173
            ],
            [
                12173,
                12215
            ],
            [
                12215,
                12216
            ],
            [
                12216,
                12263
            ],
            [
                12263,
                12331
            ],
            [
                12340,
                12347
            ],
            [
                12347,
                12349
            ],
            [
                12349,
                12416
            ],
            [
                12416,
                12488
            ],
            [
                12488,
                12504
            ],
            [
                12504,
                12537
            ],
            [
                12537,
                12543
            ],
            [
                12543,
                12545
            ],
            [
                12545,
                12596
            ],
            [
                12596,
                12701
            ],
            [
                12702,
                12723
            ],
            [
                12723,
                12735
            ],
            [
                12736,
                12749
            ],
            [
                12757,
                12794
            ],
            [
                12794,
                12872
            ],
            [
                12880,
                12890
            ],
            [
                12891,
                12900
            ],
            [
                12914,
                12917
            ],
            [
                12921,
                12922
            ],
            [
                12923,
                12927
            ],
            [
                12933,
                13005
            ],
            [
                13005,
                13012
            ],
            [
                13025,
                13063
            ],
            [
                13063,
                13070
            ],
            [
                13080,
                13119
            ],
            [
                13125,
                13139
            ],
            [
                13140,
                13152
            ],
            [
                13152,
                13161
            ],
            [
                13162,
                13175
            ],
            [
                13175,
                13176
            ],
            [
                13177,
                13179
            ],
            [
                13190,
                13196
            ],
            [
                13209,
                13228
            ],
            [
                13229,
                13231
            ],
            [
                13232,
                13235
            ],
            [
                13240,
                13244
            ],
            [
                13249,
                13252
            ],
            [
                13253,
                13258
            ],
            [
                13263,
                13265
            ],
            [
                13271,
                13307
            ],
            [
                13307,
                13308
            ],
            [
                13314,
                13317
            ],
            [
                13323,
                13333
            ],
            [
                13345,
                13355
            ],
            [
                13362,
                13393
            ],
            [
                13400,
                13411
            ],
            [
                13411,
                13559
            ],
            [
                13559,
                13604
            ],
            [
                13604,
                13606
            ],
            [
                13606,
                13660
            ],
            [
                13668,
                13764
            ],
            [
                13764,
                13766
            ],
            [
                13766,
                13784
            ],
            [
                13785,
                13797
            ],
            [
                13797,
                13798
            ],
            [
                13799,
                13868
            ],
            [
                13868,
                13891
            ],
            [
                13891,
                13931
            ],
            [
                13937,
                13949
            ],
            [
                13949,
                13976
            ],
            [
                13976,
                13977
            ],
            [
                13977,
                14032
            ],
            [
                14032,
                14046
            ],
            [
                14046,
                14093
            ],
            [
                14093,
                14137
            ],
            [
                14140,
                14282
            ],
            [
                14282,
                14328
            ],
            [
                14329,
                14332
            ],
            [
                14333,
                14358
            ],
            [
                14358,
                14392
            ],
            [
                14392,
                14427
            ],
            [
                14433,
                14435
            ],
            [
                14435,
                14469
            ],
            [
                14474,
                14512
            ],
            [
                14513,
                14526
            ],
            [
                14533,
                14560
            ],
            [
                14560,
                14602
            ],
            [
                14603,
                14615
            ],
            [
                14615,
                14616
            ],
            [
                14617,
                14620
            ],
            [
                14621,
                14627
            ],
            [
                14628,
                14633
            ],
            [
                14634,
                14637
            ],
            [
                14638,
                14644
            ],
            [
                14644,
                14645
            ],
            [
                14656,
                14664
            ],
            [
                14665,
                14696
            ],
            [
                14697,
                14728
            ],
            [
                14729,
                14792
            ],
            [
                14792,
                14885
            ],
            [
                14887,
                14951
            ],
            [
                14954,
                14979
            ],
            [
                14979,
                15010
            ],
            [
                15010,
                15048
            ],
            [
                15048,
                15054
            ],
            [
                15054,
                15108
            ],
            [
                15108,
                15112
            ],
            [
                15113,
                15148
            ],
            [
                15148,
                15162
            ],
            [
                15162,
                15195
            ],
            [
                15195,
                15197
            ],
            [
                15197,
                15243
            ],
            [
                15243,
                15256
            ],
            [
                15258,
                15265
            ],
            [
                15265,
                15266
            ],
            [
                15271,
                15300
            ],
            [
                15300,
                15338
            ],
            [
                15338,
                15350
            ],
            [
                15350,
                15385
            ],
            [
                15385,
                15405
            ],
            [
                15405,
                15513
            ],
            [
                15513,
                15543
            ],
            [
                15543,
                15576
            ],
            [
                15576,
                15599
            ],
            [
                15599,
                15664
            ],
            [
                15664,
                15679
            ],
            [
                15680,
                15691
            ],
            [
                15692,
                15705
            ],
            [
                15709,
                15711
            ],
            [
                15711,
                15806
            ],
            [
                15811,
                15819
            ],
            [
                15819,
                15854
            ],
            [
                15855,
                15900
            ],
            [
                15901,
                15990
            ],
            [
                15991,
                16009
            ],
            [
                16010,
                16039
            ],
            [
                16040,
                16042
            ],
            [
                16043,
                16053
            ],
            [
                16054,
                16068
            ],
            [
                16068,
                16089
            ],
            [
                16090,
                16179
            ],
            [
                16180,
                16214
            ],
            [
                16214,
                16277
            ],
            [
                16277,
                16309
            ],
            [
                16309,
                16362
            ],
            [
                16362,
                16429
            ],
            [
                16431,
                16455
            ],
            [
                16456,
                16484
            ],
            [
                16484,
                16524
            ],
            [
                16524,
                16538
            ],
            [
                16538,
                16541
            ],
            [
                16541,
                16613
            ]
        ],
        "row_chars": [
            [
                0,
                65
            ],
            [
                65,
                213
            ],
            [
                213,
                213
            ],
            [
                213,
                228
            ],
            [
                228,
                300
            ],
            [
                300,
                390
            ],
            [
                390,
                437
            ],
            [
                437,
                522
            ],
            [
                522,
                729
            ],
            [
                729,
                826
            ],
            [
                826,
                901
            ],
            [
                901,
                1105
            ],
            [
                1105,
                1158
            ],
            [
                1158,
                1158
            ],
            [
                1158,
                1274
            ],
            [
                1274,
                1358
            ],
            [
                1358,
                1358
            ],
            [
                1358,
                1487
            ],
            [
                1487,
                1621
            ],
            [
                1621,
                1687
            ],
            [
                1687,
                1782
            ],
            [
                1782,
                1878
            ],
            [
                1878,
                1954
            ],
            [
                1954,
                1954
            ],
            [
                1954,
                2080
            ],
            [
                2080,
                2189
            ],
            [
                2189,
                2271
            ],
            [
                2271,
                2407
            ],
            [
                2407,
                2407
            ],
            [
                2407,
                2441
            ],
            [
                2441,
                2441
            ],
            [
                2441,
                2578
            ],
            [
                2578,
                2807
            ],
            [
                2807,
                2826
            ],
            [
                2826,
                2849
            ],
            [
                2849,
                2855
            ],
            [
                2855,
                2964
            ],
            [
                2964,
                3061
            ],
            [
                3061,
                3132
            ],
            [
                3132,
                3232
            ],
            [
                3232,
                3302
            ],
            [
                3302,
                3432
            ],
            [
                3432,
                3548
            ],
            [
                3548,
                3612
            ],
            [
                3612,
                3650
            ],
            [
                3650,
                3679
            ],
            [
                3679,
                3757
            ],
            [
                3757,
                3757
            ],
            [
                3757,
                3820
            ],
            [
                3820,
                3961
            ],
            [
                3961,
                4007
            ],
            [
                4007,
                4113
            ],
            [
                4113,
                4160
            ],
            [
                4160,
                4210
            ],
            [
                4210,
                4210
            ],
            [
                4210,
                4276
            ],
            [
                4276,
                4331
            ],
            [
                4331,
                4359
            ],
            [
                4359,
                4359
            ],
            [
                4359,
                4359
            ],
            [
                4359,
                4447
            ],
            [
                4447,
                4494
            ],
            [
                4494,
                4494
            ],
            [
                4494,
                4627
            ],
            [
                4627,
                4659
            ],
            [
                4659,
                4699
            ],
            [
                4699,
                4717
            ],
            [
                4717,
                4754
            ],
            [
                4754,
                4868
            ],
            [
                4868,
                5006
            ],
            [
                5006,
                5006
            ],
            [
                5006,
                5178
            ],
            [
                5178,
                5178
            ],
            [
                5178,
                5226
            ],
            [
                5226,
                5300
            ],
            [
                5300,
                5345
            ],
            [
                5345,
                5372
            ],
            [
                5372,
                5465
            ],
            [
                5465,
                5533
            ],
            [
                5533,
                5597
            ],
            [
                5597,
                5695
            ],
            [
                5695,
                5818
            ],
            [
                5818,
                5938
            ],
            [
                5938,
                5984
            ],
            [
                5984,
                6059
            ],
            [
                6059,
                6202
            ],
            [
                6202,
                6256
            ],
            [
                6256,
                6298
            ],
            [
                6298,
                6373
            ],
            [
                6373,
                6412
            ],
            [
                6412,
                6451
            ],
            [
                6451,
                6543
            ],
            [
                6543,
                6620
            ],
            [
                6620,
                6620
            ],
            [
                6620,
                6762
            ],
            [
                6762,
                6924
            ],
            [
                6924,
                7025
            ],
            [
                7025,
                7168
            ],
            [
                7168,
                7325
            ],
            [
                7325,
                7406
            ],
            [
                7406,
                7468
            ],
            [
                7468,
                7536
            ],
            [
                7536,
                7628
            ],
            [
                7628,
                7711
            ],
            [
                7711,
                7808
            ],
            [
                7808,
                7891
            ],
            [
                7891,
                7953
            ],
            [
                7953,
                8042
            ],
            [
                8042,
                8123
            ],
            [
                8123,
                8123
            ],
            [
                8123,
                8123
            ],
            [
                8123,
                8123
            ],
            [
                8123,
                8123
            ],
            [
                8123,
                8123
            ],
            [
                8123,
                8123
            ],
            [
                8123,
                8123
            ],
            [
                8123,
                8123
            ],
            [
                8123,
                8148
            ],
            [
                8148,
                8197
            ],
            [
                8197,
                8225
            ],
            [
                8225,
                8252
            ],
            [
                8252,
                8322
            ],
            [
                8322,
                8355
            ],
            [
                8355,
                8419
            ],
            [
                8419,
                8460
            ],
            [
                8460,
                8481
            ],
            [
                8481,
                8606
            ],
            [
                8606,
                8630
            ],
            [
                8630,
                8662
            ],
            [
                8662,
                8662
            ],
            [
                8662,
                8662
            ],
            [
                8662,
                8697
            ],
            [
                8697,
                8749
            ],
            [
                8749,
                8805
            ],
            [
                8805,
                8818
            ],
            [
                8818,
                8859
            ],
            [
                8859,
                8962
            ],
            [
                8962,
                9013
            ],
            [
                9013,
                9061
            ],
            [
                9061,
                9075
            ],
            [
                9075,
                9105
            ],
            [
                9105,
                9137
            ],
            [
                9137,
                9137
            ],
            [
                9137,
                9155
            ],
            [
                9155,
                9239
            ],
            [
                9239,
                9264
            ],
            [
                9264,
                9295
            ],
            [
                9295,
                9320
            ],
            [
                9320,
                9366
            ],
            [
                9366,
                9371
            ],
            [
                9371,
                9397
            ],
            [
                9397,
                9435
            ],
            [
                9435,
                9511
            ],
            [
                9511,
                9511
            ],
            [
                9511,
                9511
            ],
            [
                9511,
                9567
            ],
            [
                9567,
                9664
            ],
            [
                9664,
                9664
            ],
            [
                9664,
                9720
            ],
            [
                9720,
                9775
            ],
            [
                9775,
                9815
            ],
            [
                9815,
                9843
            ],
            [
                9843,
                9872
            ],
            [
                9872,
                9946
            ],
            [
                9946,
                9946
            ],
            [
                9946,
                9979
            ],
            [
                9979,
                10021
            ],
            [
                10021,
                10076
            ],
            [
                10076,
                10128
            ],
            [
                10128,
                10133
            ],
            [
                10133,
                10149
            ],
            [
                10149,
                10244
            ],
            [
                10244,
                10359
            ],
            [
                10359,
                10446
            ],
            [
                10446,
                10467
            ],
            [
                10467,
                10508
            ],
            [
                10508,
                10526
            ],
            [
                10526,
                10604
            ],
            [
                10604,
                10629
            ],
            [
                10629,
                10646
            ],
            [
                10646,
                10676
            ],
            [
                10676,
                10708
            ],
            [
                10708,
                10922
            ],
            [
                10922,
                11095
            ],
            [
                11095,
                11243
            ],
            [
                11243,
                11288
            ],
            [
                11288,
                11332
            ],
            [
                11332,
                11416
            ],
            [
                11416,
                11529
            ],
            [
                11529,
                11617
            ],
            [
                11617,
                11617
            ],
            [
                11617,
                11666
            ],
            [
                11666,
                11666
            ],
            [
                11666,
                11666
            ],
            [
                11666,
                11666
            ],
            [
                11666,
                11666
            ],
            [
                11666,
                11709
            ],
            [
                11709,
                11783
            ],
            [
                11783,
                11817
            ],
            [
                11817,
                11840
            ],
            [
                11840,
                11873
            ],
            [
                11873,
                11873
            ],
            [
                11873,
                11965
            ],
            [
                11965,
                12041
            ],
            [
                12041,
                12137
            ],
            [
                12137,
                12173
            ],
            [
                12173,
                12215
            ],
            [
                12215,
                12263
            ],
            [
                12263,
                12349
            ],
            [
                12349,
                12416
            ],
            [
                12416,
                12488
            ],
            [
                12488,
                12504
            ],
            [
                12504,
                12537
            ],
            [
                12537,
                12545
            ],
            [
                12545,
                12545
            ],
            [
                12545,
                12596
            ],
            [
                12596,
                12723
            ],
            [
                12723,
                12794
            ],
            [
                12794,
                12923
            ],
            [
                12923,
                13005
            ],
            [
                13005,
                13063
            ],
            [
                13063,
                13152
            ],
            [
                13152,
                13229
            ],
            [
                13229,
                13265
            ],
            [
                13265,
                13411
            ],
            [
                13411,
                13559
            ],
            [
                13559,
                13559
            ],
            [
                13559,
                13606
            ],
            [
                13606,
                13766
            ],
            [
                13766,
                13799
            ],
            [
                13799,
                13868
            ],
            [
                13868,
                13891
            ],
            [
                13891,
                13949
            ],
            [
                13949,
                13976
            ],
            [
                13976,
                13976
            ],
            [
                13976,
                13976
            ],
            [
                13976,
                13976
            ],
            [
                13976,
                13976
            ],
            [
                13976,
                13976
            ],
            [
                13976,
                14032
            ],
            [
                14032,
                14046
            ],
            [
                14046,
                14093
            ],
            [
                14093,
                14140
            ],
            [
                14140,
                14140
            ],
            [
                14140,
                14282
            ],
            [
                14282,
                14358
            ],
            [
                14358,
                14435
            ],
            [
                14435,
                14560
            ],
            [
                14560,
                14560
            ],
            [
                14560,
                14792
            ],
            [
                14792,
                14887
            ],
            [
                14887,
                14887
            ],
            [
                14887,
                14887
            ],
            [
                14887,
                14887
            ],
            [
                14887,
                14887
            ],
            [
                14887,
                14887
            ],
            [
                14887,
                14887
            ],
            [
                14887,
                14954
            ],
            [
                14954,
                14979
            ],
            [
                14979,
                15010
            ],
            [
                15010,
                15048
            ],
            [
                15048,
                15054
            ],
            [
                15054,
                15108
            ],
            [
                15108,
                15148
            ],
            [
                15148,
                15162
            ],
            [
                15162,
                15197
            ],
            [
                15197,
                15197
            ],
            [
                15197,
                15197
            ],
            [
                15197,
                15243
            ],
            [
                15243,
                15267
            ],
            [
                15267,
                15267
            ],
            [
                15267,
                15338
            ],
            [
                15338,
                15350
            ],
            [
                15350,
                15385
            ],
            [
                15385,
                15405
            ],
            [
                15405,
                15513
            ],
            [
                15513,
                15543
            ],
            [
                15543,
                15576
            ],
            [
                15576,
                15599
            ],
            [
                15599,
                15664
            ],
            [
                15664,
                15711
            ],
            [
                15711,
                15819
            ],
            [
                15819,
                16010
            ],
            [
                16010,
                16214
            ],
            [
                16214,
                16277
            ],
            [
                16277,
                16362
            ],
            [
                16362,
                16431
            ],
            [
                16431,
                16431
            ],
            [
                16431,
                16431
            ],
            [
                16431,
                16484
            ],
            [
                16484,
                16524
            ],
            [
                16524,
                16541
            ],
            [
                16541,
                16613
            ]
        ]
    }
}