{
    "original": {
        "text": "Alice reached the Matching Road Station about three o'clock in the afternoon without adventure, and immediately on the stopping of the train became aware that all trouble was off her own hands. A servant in livery came to the open window, and touching his hat to her, inquired if she were Miss Vavasor. Then her dressing-bag and shawls and cloaks were taken from her, and she was conveyed through the station by the station-master on one side of her, the footman on the other, and by the railway porter behind. She instantly perceived that she had become possessed of great privileges by belonging even for a time to Matching Priory, and that she was essentially growing upwards towards the light.\nOutside, on the broad drive before the little station, she saw an omnibus that was going to the small town of Matching, intended for people who had not grown upwards as had been her lot; and she saw also a light stylish-looking cart which she would have called a Whitechapel had she been properly instructed in such matters, and a little low open carriage with two beautiful small horses, in which was sitting a lady enveloped in furs. Of course this was Lady Glencora. Another servant was standing on the ground, holding the horses of the carriage and the cart.\n\"Dear Alice, I'm so glad you've come,\" said a voice from the furs. \"Look here, dear; your maid can go in the dog-cart with your things,\"--it wasn't a dog-cart, but Lady Glencora knew no better;--\"she'll be quite comfortable there; and do you get in here. Are you very cold?\"\n\"Oh, no; not cold at all.\"\n\"But it is awfully cold. You've been in the stuffy carriage, but you'll find it cold enough out here, I can tell you.\"\n\"Oh! Lady Glencora, I am so sorry that I've brought you out on such a morning,\" said Alice, getting in and taking the place assigned her next to the charioteer.\n\"What nonsense! Sorry! Why I've looked forward to meeting you all alone, ever since I knew you were coming. If it had snowed all the morning I should have come just the same. I drive out almost every day when I'm down here,--that is, when the house is not too crowded, or I can make an excuse. Wrap these things over you; there are plenty of them. You shall drive if you like.\" Alice, however, declined the driving, expressing her gratitude in what prettiest words she could find.\n\"I like driving better than anything, I think. Mr. Palliser doesn't like ladies to hunt, and of course it wouldn't do as he does not hunt himself. I do ride, but he never gets on horseback. I almost fancy I should like to drive four-in-hand,--only I know I should be afraid.\"\n\"It would look very terrible,\" said Alice.\n\"Yes; wouldn't it? The look would be the worst of it; as it is all the world over. Sometimes I wish there were no such things as looks. I don't mean anything improper, you know; only one does get so hampered, right and left, for fear of Mrs. Grundy. I endeavour to go straight, and get along pretty well on the whole, I suppose. Baker, you must put Dandy in the bar; he pulls so, going home, that I can't hold him in the check.\" She stopped the horses, and Baker, a very completely-got-up groom of some forty years of age, who sat behind, got down and put the impetuous Dandy \"in the bar,\" thereby changing the rein, so that the curb was brought to bear on him. \"They're called Dandy and Flirt,\" continued Lady Glencora, speaking to Alice. \"Ain't they a beautiful match? The Duke gave them to me and named them himself. Did you ever see the Duke?\"\n[Illustration: \"Baker, you must put Dandy in the bar.\"]\n\"Never,\" said Alice.\n\"He won't be here before Christmas, but you shall be introduced some day in London. He's an excellent creature and I'm a great pet of his; though, after all, I never speak half a dozen words to him when I see him. He's one of those people who never talk. I'm one of those who like talking, as you'll find out. I think it runs in families; and the Pallisers are non-talkers. That doesn't mean that they are not speakers, for Mr. Palliser has plenty to say in the House, and they declare that he's one of the few public men who've got lungs enough to make a financial statement without breaking down.\"\nAlice was aware that she had as yet hardly spoken herself, and began to bethink herself that she didn't know what to say. Had Lady Glencora paused on the subject of Dandy and Flirt, she might have managed to be enthusiastic about the horses, but she could not discuss freely the general silence of the Palliser family, nor the excellent lungs, as regarded public purposes, of the one who was the husband of her present friend. So she asked how far it was to Matching Priory.\n\"You're not tired of me already, I hope,\" said Lady Glencora.\n\"I didn't mean that,\" said Alice. \"I delight in the drive. But somehow one expects Matching Station to be near Matching.\"\n\"Ah, yes; that's a great cheat. It's not Matching Station at all but Matching Road Station, and it's eight miles. It is a great bore, for though the omnibus brings our parcels, we have to be constantly sending over, and it's very expensive, I can assure you. I want Mr. Palliser to have a branch, but he says he would have to take all the shares himself, and that would cost more, I suppose.\"\n\"Is there a town at Matching?\"\n\"Oh, a little bit of a place. I'll go round by it if you like, and in at the further gate.\"\n\"Oh, no!\" said Alice.\n\"Ah, but I should like. It was a borough once, and belonged to the Duke; but they put it out at the Reform Bill. They made some kind of bargain;--he was to keep either Silverbridge or Matching, but not both. Mr. Palliser sits for Silverbridge, you know. The Duke chose Silverbridge,--or rather his father did, as he was then going to build his great place in Barsetshire;--that's near Silverbridge. But the Matching people haven't forgiven him yet. He was sitting for Matching himself when the Reform Bill passed. Then his father died, and he hasn't lived there much since. It's a great deal nicer place than Gatherum Castle, only not half so grand. I hate grandeur; don't you?\"\n\"I never tried much of it, as you have.\"\n\"Come now; that's not fair. There's no one in the world less grand than I am.\"\n\"I mean that I've not had grand people about me.\"\n\"Having cut all your cousins,--and Lady Midlothian in particular, like a naughty girl as you are. I was so angry with you when you accused me of selling you about that. You ought to have known that I was the last person in the world to have done such a thing.\"\n\"I did not think you meant to sell me, but I thought--\"\n\"Yes, you did, Alice. I know what you thought; you thought that Lady Midlothian was making a tool of me that I might bring you under her thumb, so that she might bully you into Mr. Grey's arms. That's what you thought. I don't know that I was at all entitled to your good opinion, but I was not entitled to that special bad opinion.\"\n\"I had no bad opinion;--but it was so necessary that I should guard myself.\"\n\"You shall be guarded. I'll take you under my shield. Mr. Grey shan't be named to you, except that I shall expect you to tell me all about it; and you must tell me all about that dangerous cousin, too, of whom they were saying such terrible things down in Scotland. I had heard of him before.\" These last words Lady Glencora spoke in a lower voice and in an altered tone,--slowly, as though she were thinking of something that pained her. It was from Burgo Fitzgerald that she had heard of George Vavasor.\nAlice did not know what to say. She found it impossible to discuss all the most secret and deepest of her feelings out in that open carriage, perhaps in the hearing of the servant behind, on this her first meeting with her cousin,--of whom, in fact, she knew very little. She had not intended to discuss these things at all, and certainly not in such a manner as this. So she remained silent. \"This is the beginning of the park,\" said Lady Glencora, pointing to a grand old ruin of an oak tree, which stood on the wide margin of the road, outside the rounded corner of the park palings, propped up with a skeleton of supporting sticks all round it. \"And that is Matching oak, under which Coeur de Lion or Edward the Third, I forget which, was met by Sir Guy de Palisere as he came from the war, or from hunting, or something of that kind. It was the king, you know, who had been fighting or whatever it was, and Sir Guy entertained him when he was very tired. Jeffrey Palliser, who is my husband's cousin, says that old Sir Guy luckily pulled out his brandy-flask. But the king immediately gave him all the lands of Matching,--only there was a priory then and a lot of monks, and I don't quite understand how that was. But I know one of the younger brothers always used to be abbot and sit in the House of Lords. And the king gave him Littlebury at the same time, which is about seven miles away from here. As Jeffrey Palliser says, it was a great deal of money for a pull at his flask. Jeffrey Palliser is here now, and I hope you'll like him. If I have no child, and Mr. Palliser were not to marry again, Jeffrey would be the heir.\" And here again her voice was low and slow, and altogether changed in its tone.\n\"I suppose that's the way most of the old families got their estates.\"\n\"Either so, or by robbery. Many of them were terrible thieves, my dear, and I dare say Sir Guy was no better than he should be. But since that they have always called some of the Pallisers Plantagenet. My husband's name is Plantagenet. The Duke is called George Plantagenet, and the king was his godfather. The queen is my godmother, I believe, but I don't know that I'm much the better for it. There's no use in godfathers and godmothers;--do you think there is?\"\n\"Not much as it's managed now.\"\n\"If I had a child,-- Oh, Alice, it's a dreadful thing not to have a child when so much depends on it!\"\n\"But you're such a short time married yet.\"\n\"Ah, well; I can see it in his eyes when he asks me questions; but I don't think he'd say an unkind word, not if his own position depended on it. Ah, well; this is Matching. That other gate we passed, where Dandy wanted to turn in,--that's where we usually go up, but I've brought you round to show you the town. That's the inn,--whoever can possibly come to stay there I don't know; I never saw anybody go in or out. That's the baker who bakes our bread,--we baked it at the house at first, but nobody could eat it; and I know that that man there mends Mr. Palliser's shoes. He's very particular about his shoes. We shall see the church as we go in at the other gate. It is in the park, and is very pretty,--but not half so pretty as the priory ruins close to the house. The ruins are our great lion. I do so love to wander about them at moonlight. I often think of you when I do; I don't know why.--But I do know why, and I'll tell you some day. Come, Miss Flirt!\"\nAs they drove up through the park, Lady Glencora pointed out first the church and then the ruins, through the midst of which the road ran, and then they were at once before the front door. The corner of the modern house came within two hundred yards of the gateway of the old priory. It was a large building, very pretty, with two long fronts; but it was no more than a house. It was not a palace, nor a castle, nor was it hardly to be called a mansion. It was built with gabled roofs, four of which formed the side from which the windows of the drawing-rooms opened out upon a lawn which separated the house from the old ruins, and which indeed surrounded the ruins, and went inside them, forming the present flooring of the old chapel, and the old refectory, and the old cloisters. Much of the cloisters indeed was standing, and there the stone pavement remained; but the square of the cloisters was all turfed, and in the middle of it stood a large modern stone vase, out of the broad basin of which hung flowering creepers and green tendrils.\nAs Lady Glencora drove up to the door, a gentleman, who had heard the sound of the wheels, came forth to meet them. \"There's Mr. Palliser,\" said she; \"that shows that you are an honoured guest, for you may be sure that he is hard at work and would not have come out for anybody else. Plantagenet, here is Miss Vavasor, perished. Alice, my husband.\" Then Mr. Palliser put forth his hand and helped her out of the carriage.\n\"I hope you've not found it very cold,\" said he. \"The winter has come upon us quite suddenly.\"\nHe said nothing more to her than this, till he met her again before dinner. He was a tall thin man, apparently not more than thirty years of age, looking in all respects like a gentleman, but with nothing in his appearance that was remarkable. It was a face that you might see and forget, and see again and forget again; and yet when you looked at it and pulled it to pieces, you found that it was a fairly good face, showing intellect in the forehead, and much character in the mouth. The eyes too, though not to be called bright, had always something to say for themselves, looking as though they had a real meaning. But the outline of the face was almost insignificant, being too thin; and he wore no beard to give it character. But, indeed, Mr. Palliser was a man who had never thought of assisting his position in the world by his outward appearance. Not to be looked at, but to be read about in the newspapers, was his ambition. Men said that he was to be Chancellor of the Exchequer, and no one thought of suggesting that the insignificance of his face would stand in his way.\n\"Are the people all out?\" his wife asked him.\n\"The men have not come in from shooting;--at least I think not;--and some of the ladies are driving, I suppose. But I haven't seen anybody since you went.\"\n\"Of course you haven't. He never has time, Alice, to see any one. But we'll go up-stairs, dear. I told them to let us have tea in my dressing-room, as I thought you'd like that better than going into the drawing-room before you had taken off your things. You must be famished, I know. Then you can come down, or if you want to avoid two dressings you can sit over the fire up-stairs till dinner-time.\" So saying she skipped up-stairs and Alice followed her. \"Here's my dressing-room, and here's your room all but opposite. You look out into the park. It's pretty, isn't it? But come into my dressing-room, and see the ruins out of the window.\"\nAlice followed Lady Glencora across the passage into what she called her dressing-room, and there found herself surrounded by an infinitude of feminine luxuries. The prettiest of tables were there;--the easiest of chairs;--the most costly of cabinets;--the quaintest of old china ornaments. It was bright with the gayest colours,--made pleasant to the eye with the binding of many books, having nymphs painted on the ceiling and little Cupids on the doors. \"Isn't it pretty?\" she said, turning quickly on Alice. \"I call it my dressing-room because in that way I can keep people out of it, but I have my brushes and soap in a little closet there, and my clothes,--my clothes are everywhere I suppose, only there are none of them here. Isn't it pretty?\"\n\"Very pretty.\"\n\"The Duke did it all. He understands such things thoroughly. Now to Mr. Palliser a dressing-room is a dressing-room, and a bedroom a bedroom. He cares for nothing being pretty; not even his wife, or he wouldn't have married me.\"\n\"You wouldn't say that if you meant it.\"\n\"Well, I don't know. Sometimes when I look at myself, when I simply am myself, with no making up or grimacing, you know, I think I'm the ugliest young woman the sun ever shone on. And in ten years' time I shall be the ugliest old woman. Only think,--my hair is beginning to get grey, and I'm not twenty-one yet. Look at it;\" and she lifted up the wavy locks just above her ear. \"But there's one comfort; he doesn't care about beauty. How old are you?\"\n\"Over five-and-twenty,\" said Alice.\n\"Nonsense;--then I oughtn't to have asked you. I am so sorry.\"\n\"That's nonsense at any rate. Why should you think I should be ashamed of my age?\"\n\"I don't know why, only somehow, people are; and I didn't think you were so old. Five-and-twenty seems so old to me. It would be nothing if you were married; only, you see, you won't get married.\"\n\"Perhaps I may yet; some day.\"\n\"Of course you will. You'll have to give way. You'll find that they'll get the better of you. Your father will storm at you, and Lady Macleod will preach at you, and Lady Midlothian will jump upon you.\"\n\"I'm not a bit afraid of Lady Midlothian.\"\n\"I know what it is, my dear, to be jumped upon. We talked with such horror of the French people giving their daughters in marriage, just as they might sell a house or a field, but we do exactly the same thing ourselves. When they all come upon you in earnest how are you to stand against them? How can any girl do it?\"\n\"I think I shall be able.\"\n\"To be sure you're older,--and you are not so heavily weighted. But never mind; I didn't mean to talk about that;--not yet at any rate. Well, now, my dear, I must go down. The Duchess of St. Bungay is here, and Mr. Palliser will be angry if I don't do pretty to her. The Duke is to be the new President of the Council, or rather, I believe he is President now. I try to remember it all, but it is so hard when one doesn't really care two pence how it goes. Not but what I'm very anxious that Mr. Palliser should be Chancellor of the Exchequer. And now, will you remain here, or will you come down with me, or will you go to your own room, and I'll call for you when I go down to dinner? We dine at eight.\"\nAlice decided that she would stay in her own room till dinner time, and was taken there by Lady Glencora. She found her maid unpacking her clothes, and for a while employed herself in assisting at the work; but that was soon done, and then she was left alone. \"I shall feel so strange, ma'am, among all those people down-stairs,\" said the girl. \"They all seem to look at me as though they didn't know who I was.\"\n\"You'll get over that soon, Jane.\"\n\"I suppose I shall; but you see, they're all like knowing each other, miss.\"\nAlice, when she sat down alone, felt herself to be very much in the same condition as her maid. What would the Duchess of St. Bungay or Mr. Jeffrey Palliser,--who himself might live to be a duke if things went well for him,--care for her? As to Mr. Palliser, the master of the house, it was already evident to her that he would not put himself out of his way for her. Had she not done wrong to come there? If it were possible for her to fly away, back to the dullness of Queen Anne Street, or even to the preachings of Lady Macleod, would she not do so immediately? What business had she,--she asked herself,--to come to such a house as that? Lady Glencora was very kind to her, but frightened her even by her kindness. Moreover, she was aware that Lady Glencora could not devote herself especially to any such guest as she was. Lady Glencora must of course look after her duchesses, and do pretty, as she called it, to her husband's important political alliances.\nAnd then she began to think about Lady Glencora herself. What a strange, weird nature she was,--with her round blue eyes and wavy hair, looking sometimes like a child and sometimes almost like an old woman! And how she talked! What things she said, and what terrible forebodings she uttered of stranger things that she meant to say! Why had she at their first meeting made that allusion to the mode of her own betrothal,--and then, checking herself for speaking of it so soon, almost declare that she meant to speak more of it hereafter? \"She should never mention it to any one,\" said Alice to herself. \"If her lot in life has not satisfied her, there is so much the more reason why she should not mention it.\" Then Alice protested to herself that no father, no aunt, no Lady Midlothian should persuade her into a marriage of which she feared the consequences. But Lady Glencora had made for herself excuses which were not altogether untrue. She had been very young, and had been terribly weighted with her wealth.\nAnd it seemed to Alice that her cousin had told her everything in that hour and a half that they had been together. She had given a whole history of her husband and of herself. She had said how indifferent he was to her pleasures, and how vainly she strove to interest herself in his pursuits. And then, as yet, she was childless and without prospect of a child, when, as she herself had said,--\"so much depended on it.\" It was very strange to Alice that all this should have been already told to her. And why should Lady Glencora think of Alice when she walked out among the priory ruins by moonlight?\nThe two hours seemed to her very long,--as though she were passing her time in absolute seclusion at Matching. Of course she did not dare to go down-stairs. But at last her maid came to dress her.\n\"How do you get on below, Jane?\" her mistress asked her.\n\"Why, miss, they are uncommon civil, and I don't think after all it will be so bad. We had our teas very comfortable in the housekeeper's room. There are five or six of us altogether, all ladies'-maids, miss; and there's nothing on earth to do all the day long, only sit and do a little needlework over the fire.\"\nA few minutes before eight Lady Glencora knocked at Alice's door, and took her arm to lead her to the drawing-room. Alice saw that she was magnificently dressed, with an enormous expanse of robe, and that her locks had been so managed that no one could suspect the presence of a grey hair. Indeed, with all her magnificence, she looked almost a child. \"Let me see,\" she said, as they went down-stairs together. \"I'll tell Jeffrey to take you in to dinner. He's about the easiest young man we have here. He rather turns up his nose at everything, but that doesn't make him the less agreeable; does it, dear?--unless he turns up his nose at you, you know.\"\n\"But perhaps he will.\"\n\"No; he won't do that. That would be uncourteous,--and he's the most courteous man in the world. There's nobody here, you see,\" she said as they entered the room, \"and I didn't suppose there would be. It's always proper to be first in one's own house. I do so try to be proper,--and it is such trouble. Talking of people earning their bread, Alice;--I'm sure I earn mine. Oh dear!--what fun it would be to be sitting somewhere in Asia, eating a chicken with one's fingers, and lighting a big fire outside one's tent to keep off the lions and tigers. Fancy your being on one side of the fire and the lions and tigers on the other, grinning at you through the flames!\" Then Lady Glencora strove to look like a lion, and grinned at herself in the glass.\n\"That sort of grin wouldn't frighten me,\" said Alice.\n\"I dare say not. I have been reading about it in that woman's travels. Oh, here they are, and I mustn't make any more faces. Duchess, do come to the fire. I hope you've got warm again. This is my cousin, Miss Vavasor.\"\nThe Duchess made a stiff little bow of condescension, and then declared that she was charmingly warm. \"I don't know how you manage in your house, but the staircases are so comfortable. Now at Longroyston we've taken all the trouble in the world,--put down hot-water pipes all over the house, and everything else that could be thought of, and yet, you can't move about the place without meeting with draughts at every corner of the passages.\" The Duchess spoke with an enormous emphasis on every other word, sometimes putting so great a stress on some special syllable, as almost to bring her voice to a whistle. This she had done with the word \"pipes\" to a great degree,--so that Alice never afterwards forgot the hot-water pipes of Longroyston. \"I was telling Lady Glencora, Miss Palliser, that I never knew a house so warm as this,--or, I'm sorry to say,\"--and here the emphasis was very strong on the word sorry,--\"so cold as Longroyston.\" And the tone in which Longroyston was uttered would almost have drawn tears from a critical audience in the pit of a playhouse. The Duchess was a woman of about forty, very handsome, but with no meaning in her beauty, carrying a good fixed colour in her face, which did not look like paint, but which probably had received some little assistance from art. She was a well-built, sizeable woman, with good proportions and fine health,--but a fool. She had addressed herself to one Miss Palliser; but two Miss Pallisers, cousins of Plantagenet Palliser, had entered the room at the same time, of whom I may say, whatever other traits of character they may have possessed, that at any rate they were not fools.\n\"It's always easy to warm a small house like this,\" said Miss Palliser, whose Christian names, unfortunately for her, were Iphigenia Theodata, and who by her cousin and sister was called Iphy--\"and I suppose equally difficult to warm a large one such as Longroyston.\" The other Miss Palliser had been christened Euphemia.\n\"We've got no pipes, Duchess, at any rate,\" said Lady Glencora; and Alice, as she sat listening, thought she discerned in Lady Glencora's pronunciation of the word pipes an almost hidden imitation of the Duchess's whistle. It must have been so, for at the moment Lady Glencora's eye met Alice's for an instant, and was then withdrawn, so that Alice was compelled to think that her friend and cousin was not always quite successful in those struggles she made to be proper.\nThen the gentlemen came in one after another, and other ladies, till about thirty people were assembled. Mr. Palliser came up and spoke another word to Alice in a kind voice,--meant to express some sense of connection if not cousinship. \"My wife has been thinking so much of your coming. I hope we shall be able to amuse you.\" Alice, who had already begun to feel desolate, was grateful, and made up her mind that she would try to like Mr. Palliser.\nJeffrey Palliser was almost the last in the room, but directly he entered Lady Glencora got up from her seat, and met him as he was coming into the crowd. \"You must take my cousin, Alice Vavasor, in to dinner,\" she said, \"and;--will you oblige me to-day?\"\n\"Yes;--as you ask me like that.\"\n\"Then try to make her comfortable.\" After that she introduced them, and Jeffrey Palliser stood opposite to Alice, talking to her, till dinner was announced.",
        "paragraph_chars": [
            [
                0,
                698
            ],
            [
                698,
                1261
            ],
            [
                1261,
                1536
            ],
            [
                1536,
                1563
            ],
            [
                1563,
                1682
            ],
            [
                1682,
                1843
            ],
            [
                1843,
                2324
            ],
            [
                2324,
                2600
            ],
            [
                2600,
                2643
            ],
            [
                2643,
                3491
            ],
            [
                3491,
                3547
            ],
            [
                3547,
                3568
            ],
            [
                3568,
                4168
            ],
            [
                4168,
                4643
            ],
            [
                4643,
                4705
            ],
            [
                4705,
                4827
            ],
            [
                4827,
                5220
            ],
            [
                5220,
                5251
            ],
            [
                5251,
                5343
            ],
            [
                5343,
                5365
            ],
            [
                5365,
                6044
            ],
            [
                6044,
                6085
            ],
            [
                6085,
                6164
            ],
            [
                6164,
                6214
            ],
            [
                6214,
                6475
            ],
            [
                6475,
                6531
            ],
            [
                6531,
                6865
            ],
            [
                6865,
                6942
            ],
            [
                6942,
                7448
            ],
            [
                7448,
                9162
            ],
            [
                9162,
                9233
            ],
            [
                9233,
                9698
            ],
            [
                9698,
                9730
            ],
            [
                9730,
                9833
            ],
            [
                9833,
                9877
            ],
            [
                9877,
                10844
            ],
            [
                10844,
                11891
            ],
            [
                11891,
                12313
            ],
            [
                12313,
                12408
            ],
            [
                12408,
                13492
            ],
            [
                13492,
                13538
            ],
            [
                13538,
                13694
            ],
            [
                13694,
                14338
            ],
            [
                14338,
                15090
            ],
            [
                15090,
                15105
            ],
            [
                15105,
                15334
            ],
            [
                15334,
                15375
            ],
            [
                15375,
                15827
            ],
            [
                15827,
                15863
            ],
            [
                15863,
                15926
            ],
            [
                15926,
                16009
            ],
            [
                16009,
                16206
            ],
            [
                16206,
                16237
            ],
            [
                16237,
                16440
            ],
            [
                16440,
                16483
            ],
            [
                16483,
                16802
            ],
            [
                16802,
                16829
            ],
            [
                16829,
                17535
            ],
            [
                17535,
                17948
            ],
            [
                17948,
                17983
            ],
            [
                17983,
                18060
            ],
            [
                18060,
                19025
            ],
            [
                19025,
                20040
            ],
            [
                20040,
                20643
            ],
            [
                20643,
                20840
            ],
            [
                20840,
                20897
            ],
            [
                20897,
                21211
            ],
            [
                21211,
                21866
            ],
            [
                21866,
                21889
            ],
            [
                21889,
                22640
            ],
            [
                22640,
                22694
            ],
            [
                22694,
                22913
            ],
            [
                22913,
                24563
            ],
            [
                24563,
                24885
            ],
            [
                24885,
                25358
            ],
            [
                25358,
                25808
            ],
            [
                25808,
                26064
            ],
            [
                26064,
                26097
            ],
            [
                26097,
                26253
            ]
        ],
        "segment_chars": [
            [
                0,
                194
            ],
            [
                194,
                303
            ],
            [
                303,
                511
            ],
            [
                511,
                698
            ],
            [
                698,
                1134
            ],
            [
                1134,
                1168
            ],
            [
                1168,
                1261
            ],
            [
                1261,
                1328
            ],
            [
                1328,
                1516
            ],
            [
                1516,
                1536
            ],
            [
                1536,
                1563
            ],
            [
                1563,
                1588
            ],
            [
                1588,
                1682
            ],
            [
                1682,
                1687
            ],
            [
                1687,
                1843
            ],
            [
                1843,
                1859
            ],
            [
                1859,
                1866
            ],
            [
                1866,
                1951
            ],
            [
                1951,
                2018
            ],
            [
                2018,
                2137
            ],
            [
                2137,
                2191
            ],
            [
                2191,
                2221
            ],
            [
                2221,
                2324
            ],
            [
                2324,
                2371
            ],
            [
                2371,
                2471
            ],
            [
                2471,
                2514
            ],
            [
                2514,
                2600
            ],
            [
                2600,
                2643
            ],
            [
                2643,
                2662
            ],
            [
                2662,
                2726
            ],
            [
                2726,
                2779
            ],
            [
                2779,
                2893
            ],
            [
                2893,
                2972
            ],
            [
                2972,
                3072
            ],
            [
                3072,
                3305
            ],
            [
                3305,
                3383
            ],
            [
                3383,
                3414
            ],
            [
                3414,
                3463
            ],
            [
                3463,
                3491
            ],
            [
                3491,
                3547
            ],
            [
                3547,
                3568
            ],
            [
                3568,
                3652
            ],
            [
                3652,
                3782
            ],
            [
                3782,
                3823
            ],
            [
                3823,
                3878
            ],
            [
                3878,
                3942
            ],
            [
                3942,
                4168
            ],
            [
                4168,
                4290
            ],
            [
                4290,
                4595
            ],
            [
                4595,
                4643
            ],
            [
                4643,
                4705
            ],
            [
                4705,
                4739
            ],
            [
                4739,
                4764
            ],
            [
                4764,
                4827
            ],
            [
                4827,
                4859
            ],
            [
                4859,
                4941
            ],
            [
                4941,
                5086
            ],
            [
                5086,
                5220
            ],
            [
                5220,
                5251
            ],
            [
                5251,
                5281
            ],
            [
                5281,
                5343
            ],
            [
                5343,
                5353
            ],
            [
                5353,
                5365
            ],
            [
                5365,
                5389
            ],
            [
                5389,
                5478
            ],
            [
                5478,
                5573
            ],
            [
                5573,
                5619
            ],
            [
                5619,
                5764
            ],
            [
                5764,
                5814
            ],
            [
                5814,
                5879
            ],
            [
                5879,
                5939
            ],
            [
                5939,
                6015
            ],
            [
                6015,
                6044
            ],
            [
                6044,
                6085
            ],
            [
                6085,
                6113
            ],
            [
                6113,
                6164
            ],
            [
                6164,
                6214
            ],
            [
                6214,
                6312
            ],
            [
                6312,
                6383
            ],
            [
                6383,
                6475
            ],
            [
                6475,
                6531
            ],
            [
                6531,
                6553
            ],
            [
                6553,
                6725
            ],
            [
                6725,
                6750
            ],
            [
                6750,
                6865
            ],
            [
                6865,
                6942
            ],
            [
                6942,
                6965
            ],
            [
                6965,
                6996
            ],
            [
                6996,
                7208
            ],
            [
                7208,
                7236
            ],
            [
                7236,
                7381
            ],
            [
                7381,
                7448
            ],
            [
                7448,
                7480
            ],
            [
                7480,
                7720
            ],
            [
                7720,
                7817
            ],
            [
                7817,
                7841
            ],
            [
                7841,
                8097
            ],
            [
                8097,
                8287
            ],
            [
                8287,
                8408
            ],
            [
                8408,
                8513
            ],
            [
                8513,
                8667
            ],
            [
                8667,
                8761
            ],
            [
                8761,
                8855
            ],
            [
                8855,
                8935
            ],
            [
                8935,
                8993
            ],
            [
                8993,
                9083
            ],
            [
                9083,
                9162
            ],
            [
                9162,
                9233
            ],
            [
                9233,
                9260
            ],
            [
                9260,
                9361
            ],
            [
                9361,
                9435
            ],
            [
                9435,
                9469
            ],
            [
                9469,
                9540
            ],
            [
                9540,
                9628
            ],
            [
                9628,
                9698
            ],
            [
                9698,
                9730
            ],
            [
                9730,
                9833
            ],
            [
                9833,
                9877
            ],
            [
                9877,
                10023
            ],
            [
                10023,
                10051
            ],
            [
                10051,
                10190
            ],
            [
                10190,
                10295
            ],
            [
                10295,
                10453
            ],
            [
                10453,
                10491
            ],
            [
                10491,
                10546
            ],
            [
                10546,
                10649
            ],
            [
                10649,
                10679
            ],
            [
                10679,
                10727
            ],
            [
                10727,
                10825
            ],
            [
                10825,
                10844
            ],
            [
                10844,
                11033
            ],
            [
                11033,
                11128
            ],
            [
                11128,
                11221
            ],
            [
                11221,
                11298
            ],
            [
                11298,
                11628
            ],
            [
                11628,
                11891
            ],
            [
                11891,
                12007
            ],
            [
                12007,
                12175
            ],
            [
                12175,
                12220
            ],
            [
                12220,
                12240
            ],
            [
                12240,
                12313
            ],
            [
                12313,
                12362
            ],
            [
                12362,
                12408
            ],
            [
                12408,
                12484
            ],
            [
                12484,
                12652
            ],
            [
                12652,
                12894
            ],
            [
                12894,
                13027
            ],
            [
                13027,
                13140
            ],
            [
                13140,
                13264
            ],
            [
                13264,
                13343
            ],
            [
                13343,
                13492
            ],
            [
                13492,
                13518
            ],
            [
                13518,
                13538
            ],
            [
                13538,
                13650
            ],
            [
                13650,
                13694
            ],
            [
                13694,
                13718
            ],
            [
                13718,
                13760
            ],
            [
                13760,
                13790
            ],
            [
                13790,
                13949
            ],
            [
                13949,
                13979
            ],
            [
                13979,
                14096
            ],
            [
                14096,
                14152
            ],
            [
                14152,
                14217
            ],
            [
                14217,
                14245
            ],
            [
                14245,
                14268
            ],
            [
                14268,
                14338
            ],
            [
                14338,
                14500
            ],
            [
                14500,
                14629
            ],
            [
                14629,
                14795
            ],
            [
                14795,
                14814
            ],
            [
                14814,
                14850
            ],
            [
                14850,
                15072
            ],
            [
                15072,
                15090
            ],
            [
                15090,
                15105
            ],
            [
                15105,
                15127
            ],
            [
                15127,
                15166
            ],
            [
                15166,
                15247
            ],
            [
                15247,
                15334
            ],
            [
                15334,
                15375
            ],
            [
                15375,
                15396
            ],
            [
                15396,
                15555
            ],
            [
                15555,
                15612
            ],
            [
                15612,
                15687
            ],
            [
                15687,
                15753
            ],
            [
                15753,
                15809
            ],
            [
                15809,
                15827
            ],
            [
                15827,
                15863
            ],
            [
                15863,
                15910
            ],
            [
                15910,
                15926
            ],
            [
                15926,
                15956
            ],
            [
                15956,
                16009
            ],
            [
                16009,
                16090
            ],
            [
                16090,
                16126
            ],
            [
                16126,
                16206
            ],
            [
                16206,
                16237
            ],
            [
                16237,
                16258
            ],
            [
                16258,
                16283
            ],
            [
                16283,
                16331
            ],
            [
                16331,
                16440
            ],
            [
                16440,
                16483
            ],
            [
                16483,
                16531
            ],
            [
                16531,
                16703
            ],
            [
                16703,
                16777
            ],
            [
                16777,
                16802
            ],
            [
                16802,
                16829
            ],
            [
                16829,
                16893
            ],
            [
                16893,
                16965
            ],
            [
                16965,
                17001
            ],
            [
                17001,
                17096
            ],
            [
                17096,
                17190
            ],
            [
                17190,
                17286
            ],
            [
                17286,
                17373
            ],
            [
                17373,
                17516
            ],
            [
                17516,
                17535
            ],
            [
                17535,
                17641
            ],
            [
                17641,
                17795
            ],
            [
                17795,
                17880
            ],
            [
                17880,
                17948
            ],
            [
                17948,
                17983
            ],
            [
                17983,
                18060
            ],
            [
                18060,
                18156
            ],
            [
                18156,
                18299
            ],
            [
                18299,
                18428
            ],
            [
                18428,
                18466
            ],
            [
                18466,
                18626
            ],
            [
                18626,
                18703
            ],
            [
                18703,
                18780
            ],
            [
                18780,
                18889
            ],
            [
                18889,
                19025
            ],
            [
                19025,
                19082
            ],
            [
                19082,
                19232
            ],
            [
                19232,
                19252
            ],
            [
                19252,
                19358
            ],
            [
                19358,
                19563
            ],
            [
                19563,
                19628
            ],
            [
                19628,
                19736
            ],
            [
                19736,
                19886
            ],
            [
                19886,
                19967
            ],
            [
                19967,
                20040
            ],
            [
                20040,
                20156
            ],
            [
                20156,
                20217
            ],
            [
                20217,
                20334
            ],
            [
                20334,
                20461
            ],
            [
                20461,
                20542
            ],
            [
                20542,
                20643
            ],
            [
                20643,
                20754
            ],
            [
                20754,
                20800
            ],
            [
                20800,
                20840
            ],
            [
                20840,
                20873
            ],
            [
                20873,
                20897
            ],
            [
                20897,
                20981
            ],
            [
                20981,
                21041
            ],
            [
                21041,
                21211
            ],
            [
                21211,
                21327
            ],
            [
                21327,
                21501
            ],
            [
                21501,
                21563
            ],
            [
                21563,
                21622
            ],
            [
                21622,
                21667
            ],
            [
                21667,
                21714
            ],
            [
                21714,
                21866
            ],
            [
                21866,
                21889
            ],
            [
                21889,
                21912
            ],
            [
                21912,
                21986
            ],
            [
                21986,
                22090
            ],
            [
                22090,
                22141
            ],
            [
                22141,
                22192
            ],
            [
                22192,
                22261
            ],
            [
                22261,
                22439
            ],
            [
                22439,
                22556
            ],
            [
                22556,
                22640
            ],
            [
                22640,
                22694
            ],
            [
                22694,
                22711
            ],
            [
                22711,
                22765
            ],
            [
                22765,
                22819
            ],
            [
                22819,
                22849
            ],
            [
                22849,
                22879
            ],
            [
                22879,
                22913
            ],
            [
                22913,
                23015
            ],
            [
                23015,
                23098
            ],
            [
                23098,
                23355
            ],
            [
                23355,
                23525
            ],
            [
                23525,
                23659
            ],
            [
                23659,
                23856
            ],
            [
                23856,
                23984
            ],
            [
                23984,
                24212
            ],
            [
                24212,
                24302
            ],
            [
                24302,
                24563
            ],
            [
                24563,
                24831
            ],
            [
                24831,
                24885
            ],
            [
                24885,
                25108
            ],
            [
                25108,
                25358
            ],
            [
                25358,
                25463
            ],
            [
                25463,
                25595
            ],
            [
                25595,
                25646
            ],
            [
                25646,
                25685
            ],
            [
                25685,
                25808
            ],
            [
                25808,
                25963
            ],
            [
                25963,
                26064
            ],
            [
                26064,
                26097
            ],
            [
                26097,
                26133
            ],
            [
                26133,
                26253
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                40,
                76
            ],
            [
                192,
                194
            ],
            [
                194,
                225
            ],
            [
                231,
                259
            ],
            [
                266,
                303
            ],
            [
                303,
                442
            ],
            [
                449,
                480
            ],
            [
                484,
                511
            ],
            [
                511,
                547
            ],
            [
                568,
                632
            ],
            [
                696,
                698
            ],
            [
                698,
                705
            ],
            [
                733,
                841
            ],
            [
                846,
                849
            ],
            [
                856,
                863
            ],
            [
                710,
                713
            ],
            [
                904,
                909
            ],
            [
                883,
                903
            ],
            [
                910,
                930
            ],
            [
                1021,
                1134
            ],
            [
                1134,
                1168
            ],
            [
                1168,
                1187
            ],
            [
                1212,
                1230
            ],
            [
                1259,
                1261
            ],
            [
                1261,
                1328
            ],
            [
                1328,
                1329
            ],
            [
                1346,
                1395
            ],
            [
                1338,
                1339
            ],
            [
                1492,
                1495
            ],
            [
                1499,
                1516
            ],
            [
                1516,
                1536
            ],
            [
                1536,
                1543
            ],
            [
                1560,
                1563
            ],
            [
                1563,
                1586
            ],
            [
                1655,
                1682
            ],
            [
                1682,
                1687
            ],
            [
                1687,
                1784
            ],
            [
                1841,
                1843
            ],
            [
                1843,
                1859
            ],
            [
                1866,
                1869
            ],
            [
                1870,
                1951
            ],
            [
                1951,
                1971
            ],
            [
                1976,
                2018
            ],
            [
                2137,
                2163
            ],
            [
                2189,
                2191
            ],
            [
                2191,
                2221
            ],
            [
                2221,
                2245
            ],
            [
                2322,
                2324
            ],
            [
                2324,
                2369
            ],
            [
                2369,
                2371
            ],
            [
                2371,
                2416
            ],
            [
                2445,
                2471
            ],
            [
                2471,
                2514
            ],
            [
                2514,
                2565
            ],
            [
                2567,
                2600
            ],
            [
                2600,
                2643
            ],
            [
                2643,
                2662
            ],
            [
                2893,
                2894
            ],
            [
                2925,
                2972
            ],
            [
                2972,
                3021
            ],
            [
                3035,
                3056
            ],
            [
                3069,
                3072
            ],
            [
                3072,
                3137
            ],
            [
                3164,
                3165
            ],
            [
                3195,
                3218
            ],
            [
                3220,
                3230
            ],
            [
                3289,
                3291
            ],
            [
                3272,
                3276
            ],
            [
                3300,
                3304
            ],
            [
                3305,
                3362
            ],
            [
                3373,
                3383
            ],
            [
                3383,
                3414
            ],
            [
                3414,
                3463
            ],
            [
                3463,
                3488
            ],
            [
                3569,
                3652
            ],
            [
                3652,
                3713
            ],
            [
                3726,
                3727
            ],
            [
                3734,
                3758
            ],
            [
                3766,
                3782
            ],
            [
                3782,
                3823
            ],
            [
                3823,
                3878
            ],
            [
                3878,
                3942
            ],
            [
                3942,
                4035
            ],
            [
                4165,
                4168
            ],
            [
                4168,
                4230
            ],
            [
                4272,
                4290
            ],
            [
                4595,
                4643
            ],
            [
                4643,
                4705
            ],
            [
                4705,
                4739
            ],
            [
                4739,
                4741
            ],
            [
                4753,
                4764
            ],
            [
                4764,
                4827
            ],
            [
                4827,
                4859
            ],
            [
                4923,
                4939
            ],
            [
                4917,
                4918
            ],
            [
                5004,
                5086
            ],
            [
                5086,
                5122
            ],
            [
                5122,
                5220
            ],
            [
                5220,
                5251
            ],
            [
                5251,
                5252
            ],
            [
                5256,
                5264
            ],
            [
                5279,
                5281
            ],
            [
                5281,
                5312
            ],
            [
                5340,
                5343
            ],
            [
                5343,
                5353
            ],
            [
                5353,
                5365
            ],
            [
                5365,
                5389
            ],
            [
                5389,
                5478
            ],
            [
                5478,
                5509
            ],
            [
                5511,
                5513
            ],
            [
                5521,
                5557
            ],
            [
                5557,
                5573
            ],
            [
                5573,
                5619
            ],
            [
                5619,
                5647
            ],
            [
                5649,
                5684
            ],
            [
                5690,
                5720
            ],
            [
                5721,
                5735
            ],
            [
                5762,
                5764
            ],
            [
                5879,
                5904
            ],
            [
                5908,
                5920
            ],
            [
                5927,
                5939
            ],
            [
                5939,
                6015
            ],
            [
                6015,
                6044
            ],
            [
                6044,
                6085
            ],
            [
                6085,
                6113
            ],
            [
                6113,
                6164
            ],
            [
                6164,
                6214
            ],
            [
                6214,
                6243
            ],
            [
                6245,
                6284
            ],
            [
                6287,
                6299
            ],
            [
                6303,
                6312
            ],
            [
                6312,
                6383
            ],
            [
                6383,
                6475
            ],
            [
                6475,
                6491
            ],
            [
                6531,
                6553
            ],
            [
                6578,
                6634
            ],
            [
                6675,
                6677
            ],
            [
                6635,
                6673
            ],
            [
                6865,
                6866
            ],
            [
                6889,
                6939
            ],
            [
                6942,
                6965
            ],
            [
                6965,
                6996
            ],
            [
                6996,
                7208
            ],
            [
                7208,
                7236
            ],
            [
                7236,
                7313
            ],
            [
                7323,
                7381
            ],
            [
                7415,
                7438
            ],
            [
                7388,
                7409
            ],
            [
                7446,
                7448
            ],
            [
                7448,
                7480
            ],
            [
                7480,
                7518
            ],
            [
                7550,
                7553
            ],
            [
                7523,
                7546
            ],
            [
                7554,
                7643
            ],
            [
                7648,
                7677
            ],
            [
                7680,
                7687
            ],
            [
                7698,
                7701
            ],
            [
                7702,
                7720
            ],
            [
                7720,
                7771
            ],
            [
                7815,
                7816
            ],
            [
                7841,
                7921
            ],
            [
                7933,
                7942
            ],
            [
                7958,
                7961
            ],
            [
                8007,
                8033
            ],
            [
                8095,
                8097
            ],
            [
                8097,
                8135
            ],
            [
                8142,
                8272
            ],
            [
                8285,
                8287
            ],
            [
                8408,
                8511
            ],
            [
                8622,
                8627
            ],
            [
                8517,
                8572
            ],
            [
                8575,
                8622
            ],
            [
                8665,
                8667
            ],
            [
                8761,
                8855
            ],
            [
                8855,
                8935
            ],
            [
                8935,
                8993
            ],
            [
                8993,
                9083
            ],
            [
                9083,
                9162
            ],
            [
                9162,
                9233
            ],
            [
                9233,
                9234
            ],
            [
                9243,
                9247
            ],
            [
                9248,
                9260
            ],
            [
                9260,
                9294
            ],
            [
                9303,
                9361
            ],
            [
                9361,
                9435
            ],
            [
                9435,
                9469
            ],
            [
                9469,
                9540
            ],
            [
                9628,
                9671
            ],
            [
                9693,
                9695
            ],
            [
                9687,
                9692
            ],
            [
                9695,
                9698
            ],
            [
                9698,
                9730
            ],
            [
                9730,
                9747
            ],
            [
                9751,
                9833
            ],
            [
                9833,
                9870
            ],
            [
                9874,
                9877
            ],
            [
                9877,
                9878
            ],
            [
                9888,
                9912
            ],
            [
                9938,
                10023
            ],
            [
                10023,
                10040
            ],
            [
                10180,
                10190
            ],
            [
                10190,
                10204
            ],
            [
                10293,
                10295
            ],
            [
                10295,
                10301
            ],
            [
                10322,
                10325
            ],
            [
                10306,
                10311
            ],
            [
                10392,
                10404
            ],
            [
                10410,
                10453
            ],
            [
                10453,
                10491
            ],
            [
                10491,
                10546
            ],
            [
                10546,
                10584
            ],
            [
                10586,
                10628
            ],
            [
                10638,
                10649
            ],
            [
                10679,
                10707
            ],
            [
                10713,
                10727
            ],
            [
                10727,
                10775
            ],
            [
                10823,
                10824
            ],
            [
                10782,
                10823
            ],
            [
                10844,
                10904
            ],
            [
                10911,
                10925
            ],
            [
                10931,
                11004
            ],
            [
                11017,
                11033
            ],
            [
                11047,
                11128
            ],
            [
                11128,
                11142
            ],
            [
                11214,
                11219
            ],
            [
                11151,
                11186
            ],
            [
                11186,
                11191
            ],
            [
                11221,
                11245
            ],
            [
                11287,
                11298
            ],
            [
                11371,
                11545
            ],
            [
                11554,
                11559
            ],
            [
                11563,
                11581
            ],
            [
                11594,
                11608
            ],
            [
                11617,
                11628
            ],
            [
                11762,
                11778
            ],
            [
                11636,
                11649
            ],
            [
                11782,
                11821
            ],
            [
                11826,
                11837
            ],
            [
                11847,
                11891
            ],
            [
                11891,
                11941
            ],
            [
                11982,
                12006
            ],
            [
                12007,
                12088
            ],
            [
                12110,
                12175
            ],
            [
                12175,
                12208
            ],
            [
                12218,
                12220
            ],
            [
                12220,
                12240
            ],
            [
                12247,
                12257
            ],
            [
                12281,
                12313
            ],
            [
                12313,
                12362
            ],
            [
                12362,
                12408
            ],
            [
                12408,
                12484
            ],
            [
                12484,
                12507
            ],
            [
                12533,
                12561
            ],
            [
                12578,
                12652
            ],
            [
                12652,
                12736
            ],
            [
                12799,
                12894
            ],
            [
                12894,
                12918
            ],
            [
                12932,
                13027
            ],
            [
                13027,
                13030
            ],
            [
                13050,
                13058
            ],
            [
                13087,
                13139
            ],
            [
                13151,
                13179
            ],
            [
                13264,
                13323
            ],
            [
                13341,
                13343
            ],
            [
                13343,
                13436
            ],
            [
                13459,
                13492
            ],
            [
                13492,
                13518
            ],
            [
                13518,
                13538
            ],
            [
                13538,
                13578
            ],
            [
                13603,
                13650
            ],
            [
                13650,
                13694
            ],
            [
                13694,
                13718
            ],
            [
                13718,
                13760
            ],
            [
                13760,
                13772
            ],
            [
                13782,
                13790
            ],
            [
                13790,
                13910
            ],
            [
                13947,
                13949
            ],
            [
                13949,
                13979
            ],
            [
                13979,
                14005
            ],
            [
                14041,
                14066
            ],
            [
                14077,
                14096
            ],
            [
                14096,
                14117
            ],
            [
                14128,
                14152
            ],
            [
                14152,
                14198
            ],
            [
                14207,
                14217
            ],
            [
                14217,
                14245
            ],
            [
                14245,
                14268
            ],
            [
                14268,
                14338
            ],
            [
                14338,
                14500
            ],
            [
                14500,
                14523
            ],
            [
                14537,
                14558
            ],
            [
                14561,
                14588
            ],
            [
                14627,
                14629
            ],
            [
                14629,
                14647
            ],
            [
                14666,
                14667
            ],
            [
                14694,
                14698
            ],
            [
                14719,
                14725
            ],
            [
                14733,
                14794
            ],
            [
                14850,
                14925
            ],
            [
                14925,
                14926
            ],
            [
                14927,
                14930
            ],
            [
                15070,
                15072
            ],
            [
                15072,
                15090
            ],
            [
                15090,
                15105
            ],
            [
                15105,
                15127
            ],
            [
                15127,
                15166
            ],
            [
                15166,
                15220
            ],
            [
                15245,
                15247
            ],
            [
                15247,
                15334
            ],
            [
                15334,
                15375
            ],
            [
                15375,
                15396
            ],
            [
                15396,
                15452
            ],
            [
                15494,
                15555
            ],
            [
                15555,
                15612
            ],
            [
                15612,
                15622
            ],
            [
                15625,
                15687
            ],
            [
                15687,
                15753
            ],
            [
                15753,
                15809
            ],
            [
                15809,
                15827
            ],
            [
                15827,
                15863
            ],
            [
                15863,
                15864
            ],
            [
                15880,
                15910
            ],
            [
                15910,
                15926
            ],
            [
                15926,
                15942
            ],
            [
                15954,
                15956
            ],
            [
                15956,
                15966
            ],
            [
                15977,
                15978
            ],
            [
                15986,
                16009
            ],
            [
                16009,
                16022
            ],
            [
                16026,
                16090
            ],
            [
                16090,
                16111
            ],
            [
                16115,
                16126
            ],
            [
                16126,
                16206
            ],
            [
                16206,
                16220
            ],
            [
                16226,
                16237
            ],
            [
                16237,
                16258
            ],
            [
                16258,
                16283
            ],
            [
                16300,
                16331
            ],
            [
                16331,
                16440
            ],
            [
                16440,
                16483
            ],
            [
                16483,
                16531
            ],
            [
                16703,
                16777
            ],
            [
                16777,
                16802
            ],
            [
                16802,
                16829
            ],
            [
                16829,
                16853
            ],
            [
                16856,
                16859
            ],
            [
                16868,
                16893
            ],
            [
                16893,
                16896
            ],
            [
                16909,
                16942
            ],
            [
                16944,
                16965
            ],
            [
                16965,
                17001
            ],
            [
                17001,
                17077
            ],
            [
                17088,
                17096
            ],
            [
                17096,
                17190
            ],
            [
                17190,
                17272
            ],
            [
                17284,
                17286
            ],
            [
                17299,
                17373
            ],
            [
                17373,
                17390
            ],
            [
                17398,
                17406
            ],
            [
                17416,
                17466
            ],
            [
                17508,
                17516
            ],
            [
                17516,
                17535
            ],
            [
                17535,
                17641
            ],
            [
                17641,
                17686
            ],
            [
                17740,
                17764
            ],
            [
                17793,
                17794
            ],
            [
                17795,
                17850
            ],
            [
                17862,
                17880
            ],
            [
                17880,
                17889
            ],
            [
                17898,
                17948
            ],
            [
                17948,
                17983
            ],
            [
                17983,
                18020
            ],
            [
                18024,
                18027
            ],
            [
                18041,
                18060
            ],
            [
                18060,
                18156
            ],
            [
                18156,
                18216
            ],
            [
                18285,
                18299
            ],
            [
                18299,
                18366
            ],
            [
                18374,
                18428
            ],
            [
                18428,
                18435
            ],
            [
                18440,
                18458
            ],
            [
                18464,
                18466
            ],
            [
                18703,
                18742
            ],
            [
                18790,
                18861
            ],
            [
                18754,
                18757
            ],
            [
                18887,
                18889
            ],
            [
                18889,
                18907
            ],
            [
                18918,
                18942
            ],
            [
                19023,
                19025
            ],
            [
                19025,
                19082
            ],
            [
                19082,
                19110
            ],
            [
                19118,
                19119
            ],
            [
                19121,
                19232
            ],
            [
                19232,
                19252
            ],
            [
                19252,
                19272
            ],
            [
                19356,
                19358
            ],
            [
                19358,
                19369
            ],
            [
                19393,
                19414
            ],
            [
                19427,
                19444
            ],
            [
                19447,
                19473
            ],
            [
                19500,
                19534
            ],
            [
                19541,
                19551
            ],
            [
                19561,
                19562
            ],
            [
                19563,
                19594
            ],
            [
                19602,
                19628
            ],
            [
                19768,
                19886
            ],
            [
                19886,
                19889
            ],
            [
                19890,
                19903
            ],
            [
                19971,
                20040
            ],
            [
                20044,
                20156
            ],
            [
                20156,
                20217
            ],
            [
                20217,
                20334
            ],
            [
                20334,
                20337
            ],
            [
                20352,
                20359
            ],
            [
                20360,
                20369
            ],
            [
                20403,
                20433
            ],
            [
                20435,
                20461
            ],
            [
                20461,
                20542
            ],
            [
                20542,
                20601
            ],
            [
                20606,
                20643
            ],
            [
                20643,
                20663
            ],
            [
                20671,
                20680
            ],
            [
                20800,
                20838
            ],
            [
                20838,
                20840
            ],
            [
                20840,
                20873
            ],
            [
                20886,
                20897
            ],
            [
                20897,
                20981
            ],
            [
                20981,
                21039
            ],
            [
                21211,
                21276
            ],
            [
                21294,
                21327
            ],
            [
                21327,
                21410
            ],
            [
                21416,
                21425
            ],
            [
                21435,
                21437
            ],
            [
                21446,
                21501
            ],
            [
                21514,
                21562
            ],
            [
                21622,
                21665
            ],
            [
                21665,
                21667
            ],
            [
                21667,
                21714
            ],
            [
                21714,
                21782
            ],
            [
                21787,
                21801
            ],
            [
                21819,
                21866
            ],
            [
                21866,
                21867
            ],
            [
                21871,
                21889
            ],
            [
                21889,
                21892
            ],
            [
                21894,
                21902
            ],
            [
                21910,
                21912
            ],
            [
                21944,
                21986
            ],
            [
                22005,
                22006
            ],
            [
                21986,
                22005
            ],
            [
                22014,
                22050
            ],
            [
                22088,
                22090
            ],
            [
                22090,
                22141
            ],
            [
                22141,
                22165
            ],
            [
                22168,
                22192
            ],
            [
                22261,
                22268
            ],
            [
                22271,
                22437
            ],
            [
                22556,
                22639
            ],
            [
                22711,
                22765
            ],
            [
                22765,
                22782
            ],
            [
                22788,
                22819
            ],
            [
                22819,
                22849
            ],
            [
                22879,
                22913
            ],
            [
                22913,
                22948
            ],
            [
                22965,
                22970
            ],
            [
                22976,
                23015
            ],
            [
                23015,
                23043
            ],
            [
                23057,
                23098
            ],
            [
                23098,
                23157
            ],
            [
                23160,
                23204
            ],
            [
                23255,
                23258
            ],
            [
                23312,
                23355
            ],
            [
                23355,
                23523
            ],
            [
                23630,
                23631
            ],
            [
                23530,
                23533
            ],
            [
                23637,
                23642
            ],
            [
                23657,
                23659
            ],
            [
                24212,
                24215
            ],
            [
                23996,
                24037
            ],
            [
                24226,
                24227
            ],
            [
                24290,
                24302
            ],
            [
                24354,
                24445
            ],
            [
                24542,
                24551
            ],
            [
                24552,
                24563
            ],
            [
                24563,
                24650
            ],
            [
                24656,
                24671
            ],
            [
                24679,
                24680
            ],
            [
                24739,
                24742
            ],
            [
                24686,
                24709
            ],
            [
                24717,
                24738
            ],
            [
                24743,
                24754
            ],
            [
                24756,
                24770
            ],
            [
                24779,
                24831
            ],
            [
                24831,
                24854
            ],
            [
                24875,
                24885
            ],
            [
                24885,
                25108
            ],
            [
                25153,
                25272
            ],
            [
                25284,
                25318
            ],
            [
                25325,
                25334
            ],
            [
                25344,
                25358
            ],
            [
                25358,
                25384
            ],
            [
                25402,
                25463
            ],
            [
                25463,
                25493
            ],
            [
                25519,
                25525
            ],
            [
                25502,
                25515
            ],
            [
                25593,
                25594
            ],
            [
                25595,
                25646
            ],
            [
                25646,
                25684
            ],
            [
                25685,
                25808
            ],
            [
                25808,
                25856
            ],
            [
                25961,
                25962
            ],
            [
                25882,
                25895
            ],
            [
                26055,
                26057
            ],
            [
                25926,
                25929
            ],
            [
                25856,
                25857
            ],
            [
                26027,
                26028
            ],
            [
                25963,
                26016
            ],
            [
                25916,
                25921
            ],
            [
                26103,
                26133
            ],
            [
                26144,
                26191
            ],
            [
                26211,
                26218
            ],
            [
                26201,
                26209
            ],
            [
                26227,
                26253
            ]
        ],
        "row_chars": [
            [
                0,
                194
            ],
            [
                194,
                303
            ],
            [
                303,
                511
            ],
            [
                511,
                698
            ],
            [
                698,
                1134
            ],
            [
                1134,
                1168
            ],
            [
                1168,
                1261
            ],
            [
                1261,
                1328
            ],
            [
                1328,
                1516
            ],
            [
                1516,
                1536
            ],
            [
                1536,
                1563
            ],
            [
                1563,
                1682
            ],
            [
                1682,
                1687
            ],
            [
                1687,
                1843
            ],
            [
                1843,
                1859
            ],
            [
                1859,
                1866
            ],
            [
                1866,
                1951
            ],
            [
                1951,
                2018
            ],
            [
                2018,
                2137
            ],
            [
                2137,
                2191
            ],
            [
                2191,
                2221
            ],
            [
                2221,
                2324
            ],
            [
                2324,
                2371
            ],
            [
                2371,
                2471
            ],
            [
                2471,
                2514
            ],
            [
                2514,
                2600
            ],
            [
                2600,
                2643
            ],
            [
                2643,
                2662
            ],
            [
                2662,
                2726
            ],
            [
                2726,
                2779
            ],
            [
                2779,
                2893
            ],
            [
                2893,
                2972
            ],
            [
                2972,
                3072
            ],
            [
                3072,
                3305
            ],
            [
                3305,
                3383
            ],
            [
                3383,
                3414
            ],
            [
                3414,
                3463
            ],
            [
                3463,
                3491
            ],
            [
                3491,
                3547
            ],
            [
                3547,
                3568
            ],
            [
                3568,
                3652
            ],
            [
                3652,
                3782
            ],
            [
                3782,
                3823
            ],
            [
                3823,
                3878
            ],
            [
                3878,
                3942
            ],
            [
                3942,
                4168
            ],
            [
                4168,
                4290
            ],
            [
                4290,
                4595
            ],
            [
                4595,
                4643
            ],
            [
                4643,
                4705
            ],
            [
                4705,
                4739
            ],
            [
                4739,
                4764
            ],
            [
                4764,
                4827
            ],
            [
                4827,
                4859
            ],
            [
                4859,
                5086
            ],
            [
                5086,
                5220
            ],
            [
                5220,
                5251
            ],
            [
                5251,
                5281
            ],
            [
                5281,
                5343
            ],
            [
                5343,
                5353
            ],
            [
                5353,
                5365
            ],
            [
                5365,
                5389
            ],
            [
                5389,
                5478
            ],
            [
                5478,
                5573
            ],
            [
                5573,
                5619
            ],
            [
                5619,
                5764
            ],
            [
                5764,
                5814
            ],
            [
                5814,
                5879
            ],
            [
                5879,
                5939
            ],
            [
                5939,
                6015
            ],
            [
                6015,
                6044
            ],
            [
                6044,
                6085
            ],
            [
                6085,
                6113
            ],
            [
                6113,
                6164
            ],
            [
                6164,
                6214
            ],
            [
                6214,
                6312
            ],
            [
                6312,
                6383
            ],
            [
                6383,
                6475
            ],
            [
                6475,
                6531
            ],
            [
                6531,
                6553
            ],
            [
                6553,
                6725
            ],
            [
                6725,
                6750
            ],
            [
                6750,
                6865
            ],
            [
                6865,
                6942
            ],
            [
                6942,
                6965
            ],
            [
                6965,
                6996
            ],
            [
                6996,
                7208
            ],
            [
                7208,
                7236
            ],
            [
                7236,
                7381
            ],
            [
                7381,
                7448
            ],
            [
                7448,
                7480
            ],
            [
                7480,
                7720
            ],
            [
                7720,
                7817
            ],
            [
                7817,
                7841
            ],
            [
                7841,
                8097
            ],
            [
                8097,
                8287
            ],
            [
                8287,
                8408
            ],
            [
                8408,
                8667
            ],
            [
                8667,
                8761
            ],
            [
                8761,
                8855
            ],
            [
                8855,
                8935
            ],
            [
                8935,
                8993
            ],
            [
                8993,
                9083
            ],
            [
                9083,
                9162
            ],
            [
                9162,
                9233
            ],
            [
                9233,
                9260
            ],
            [
                9260,
                9361
            ],
            [
                9361,
                9435
            ],
            [
                9435,
                9469
            ],
            [
                9469,
                9540
            ],
            [
                9540,
                9628
            ],
            [
                9628,
                9698
            ],
            [
                9698,
                9730
            ],
            [
                9730,
                9833
            ],
            [
                9833,
                9877
            ],
            [
                9877,
                10023
            ],
            [
                10023,
                10190
            ],
            [
                10190,
                10295
            ],
            [
                10295,
                10453
            ],
            [
                10453,
                10491
            ],
            [
                10491,
                10546
            ],
            [
                10546,
                10649
            ],
            [
                10649,
                10679
            ],
            [
                10679,
                10727
            ],
            [
                10727,
                10825
            ],
            [
                10825,
                10844
            ],
            [
                10844,
                11033
            ],
            [
                11033,
                11128
            ],
            [
                11128,
                11298
            ],
            [
                11298,
                11628
            ],
            [
                11628,
                11891
            ],
            [
                11891,
                12007
            ],
            [
                12007,
                12175
            ],
            [
                12175,
                12220
            ],
            [
                12220,
                12240
            ],
            [
                12240,
                12313
            ],
            [
                12313,
                12362
            ],
            [
                12362,
                12408
            ],
            [
                12408,
                12484
            ],
            [
                12484,
                12652
            ],
            [
                12652,
                12894
            ],
            [
                12894,
                13027
            ],
            [
                13027,
                13140
            ],
            [
                13140,
                13343
            ],
            [
                13343,
                13492
            ],
            [
                13492,
                13518
            ],
            [
                13518,
                13538
            ],
            [
                13538,
                13650
            ],
            [
                13650,
                13694
            ],
            [
                13694,
                13718
            ],
            [
                13718,
                13760
            ],
            [
                13760,
                13790
            ],
            [
                13790,
                13949
            ],
            [
                13949,
                13979
            ],
            [
                13979,
                14096
            ],
            [
                14096,
                14152
            ],
            [
                14152,
                14217
            ],
            [
                14217,
                14245
            ],
            [
                14245,
                14268
            ],
            [
                14268,
                14338
            ],
            [
                14338,
                14500
            ],
            [
                14500,
                14629
            ],
            [
                14629,
                14795
            ],
            [
                14795,
                14814
            ],
            [
                14814,
                14850
            ],
            [
                14850,
                15072
            ],
            [
                15072,
                15090
            ],
            [
                15090,
                15105
            ],
            [
                15105,
                15127
            ],
            [
                15127,
                15166
            ],
            [
                15166,
                15247
            ],
            [
                15247,
                15334
            ],
            [
                15334,
                15375
            ],
            [
                15375,
                15396
            ],
            [
                15396,
                15555
            ],
            [
                15555,
                15612
            ],
            [
                15612,
                15687
            ],
            [
                15687,
                15753
            ],
            [
                15753,
                15809
            ],
            [
                15809,
                15827
            ],
            [
                15827,
                15863
            ],
            [
                15863,
                15910
            ],
            [
                15910,
                15926
            ],
            [
                15926,
                15956
            ],
            [
                15956,
                16009
            ],
            [
                16009,
                16090
            ],
            [
                16090,
                16126
            ],
            [
                16126,
                16206
            ],
            [
                16206,
                16237
            ],
            [
                16237,
                16258
            ],
            [
                16258,
                16283
            ],
            [
                16283,
                16331
            ],
            [
                16331,
                16440
            ],
            [
                16440,
                16483
            ],
            [
                16483,
                16531
            ],
            [
                16531,
                16703
            ],
            [
                16703,
                16777
            ],
            [
                16777,
                16802
            ],
            [
                16802,
                16829
            ],
            [
                16829,
                16893
            ],
            [
                16893,
                16965
            ],
            [
                16965,
                17001
            ],
            [
                17001,
                17096
            ],
            [
                17096,
                17190
            ],
            [
                17190,
                17286
            ],
            [
                17286,
                17373
            ],
            [
                17373,
                17516
            ],
            [
                17516,
                17535
            ],
            [
                17535,
                17641
            ],
            [
                17641,
                17795
            ],
            [
                17795,
                17880
            ],
            [
                17880,
                17948
            ],
            [
                17948,
                17983
            ],
            [
                17983,
                18060
            ],
            [
                18060,
                18156
            ],
            [
                18156,
                18299
            ],
            [
                18299,
                18428
            ],
            [
                18428,
                18466
            ],
            [
                18466,
                18626
            ],
            [
                18626,
                18703
            ],
            [
                18703,
                18889
            ],
            [
                18889,
                19025
            ],
            [
                19025,
                19082
            ],
            [
                19082,
                19232
            ],
            [
                19232,
                19252
            ],
            [
                19252,
                19358
            ],
            [
                19358,
                19563
            ],
            [
                19563,
                19628
            ],
            [
                19628,
                19736
            ],
            [
                19736,
                19886
            ],
            [
                19886,
                20040
            ],
            [
                20040,
                20156
            ],
            [
                20156,
                20217
            ],
            [
                20217,
                20334
            ],
            [
                20334,
                20461
            ],
            [
                20461,
                20542
            ],
            [
                20542,
                20643
            ],
            [
                20643,
                20840
            ],
            [
                20840,
                20873
            ],
            [
                20873,
                20897
            ],
            [
                20897,
                20981
            ],
            [
                20981,
                21041
            ],
            [
                21041,
                21211
            ],
            [
                21211,
                21327
            ],
            [
                21327,
                21501
            ],
            [
                21501,
                21563
            ],
            [
                21563,
                21622
            ],
            [
                21622,
                21667
            ],
            [
                21667,
                21714
            ],
            [
                21714,
                21866
            ],
            [
                21866,
                21889
            ],
            [
                21889,
                21912
            ],
            [
                21912,
                21986
            ],
            [
                21986,
                22090
            ],
            [
                22090,
                22141
            ],
            [
                22141,
                22192
            ],
            [
                22192,
                22261
            ],
            [
                22261,
                22439
            ],
            [
                22439,
                22556
            ],
            [
                22556,
                22640
            ],
            [
                22640,
                22694
            ],
            [
                22694,
                22711
            ],
            [
                22711,
                22765
            ],
            [
                22765,
                22819
            ],
            [
                22819,
                22849
            ],
            [
                22849,
                22879
            ],
            [
                22879,
                22913
            ],
            [
                22913,
                23015
            ],
            [
                23015,
                23098
            ],
            [
                23098,
                23355
            ],
            [
                23355,
                23659
            ],
            [
                23659,
                23856
            ],
            [
                23856,
                23984
            ],
            [
                23984,
                24302
            ],
            [
                24302,
                24563
            ],
            [
                24563,
                24831
            ],
            [
                24831,
                24885
            ],
            [
                24885,
                25108
            ],
            [
                25108,
                25358
            ],
            [
                25358,
                25463
            ],
            [
                25463,
                25595
            ],
            [
                25595,
                25646
            ],
            [
                25646,
                25685
            ],
            [
                25685,
                25808
            ],
            [
                25808,
                26133
            ],
            [
                26133,
                26253
            ]
        ]
    },
    "abridged": {
        "text": "Alice reached the Matching Road Station at about three o'clock in the afternoon. A servant in livery came to the train window, and touching his hat, inquired if she were Miss Vavasor. Then her dressing-bag and shawls and cloaks were taken from her, and she was conveyed through the station by the station-master on one side, the footman on the other, and the railway porter behind. She instantly perceived that she had acquired great privileges by belonging even for a time to Matching Priory.\nOutside the little station, she saw an omnibus that was going to the small town of Matching, intended for people who were not growing upwards to the light; and she saw also a stylish-looking cart, and a little low open carriage with two beautiful small horses, in which was sitting a lady enveloped in furs. Of course this was Lady Glencora. Another servant was holding the horses.\n\"Dear Alice, I'm so glad you've come,\" said a voice from the furs. \"Your maid can go in the dog-cart with your things, and you get in here. Are you very cold?\"\n\"Oh, no.\"\n\"But it is awfully cold out here, I can tell you.\"\n\"Oh! Lady Glencora, I am so sorry that I've brought you out on such a morning,\" said Alice, getting in.\n\"What nonsense! Why, I've looked forward to meeting you all alone, ever since I knew you were coming. If it had snowed all morning I should have come just the same. Wrap these things over you. You shall drive if you like.\" Alice, however, declined with pretty thanks.\n\"I like driving better than anything, I think,\" said Lady Glencora. \"Mr. Palliser doesn't like ladies to hunt, and he does not hunt himself. I do ride, but he never gets on horseback. I almost fancy I should like to drive four-in-hand, only I know I should be afraid.\"\n\"It would look very terrible,\" said Alice.\n\"Yes; wouldn't it? I get along pretty well on the whole, I suppose. Baker, you must put Dandy in the bar; he pulls so that I can't hold him.\" She stopped the horses, and Baker, a very completely-got-up groom, put the impetuous Dandy in the bar to curb him.\n\"They're called Dandy and Flirt,\" continued Lady Glencora to Alice. \"Ain't they a beautiful match? The Duke gave them to me and named them himself. Did you ever see the Duke of Omnium? He won't be here before Christmas, but you shall be introduced some day in London. He's an excellent creature and I'm a great pet of his; though I hardly speak half a dozen words when I see him. He's one of those people who never talk. I'm one of those who like talking, as you'll find out. I think it runs in families; and the Pallisers are non-talkers. That doesn't mean that they are not speakers, for Mr. Palliser has plenty to say in the House.\"\nAlice was aware that she had as yet hardly spoken herself, and did not know what to say. So she asked how far it was to Matching Priory.\n\"You're not tired of me already, I hope,\" said Lady Glencora.\n\"I didn't mean that,\" said Alice. \"I'm enjoying the drive. But somehow one expects Matching Station to be near Matching.\"\n\"Ah, yes; that's a great cheat. It's eight miles, so we have to be constantly sending over, and it's very expensive, I can assure you. I want Mr. Palliser to have a branch line of the railway, but he says he would have to take all the shares himself, and that would cost more, I suppose.\"\n\"Is there a town at Matching?\"\n\"A little one. I'll go round by it if you like.\"\n\"Oh, no!\" said Alice.\n\"Ah, but I should like. It was a borough once, and belonged to the Duke; but they put it out at the Reform Bill. They made some kind of bargain; he could keep either Silverbridge or Matching constituency, but not both. Mr. Palliser sits for Silverbridge, you know. The Duke chose Silverbridge, or rather his father did, as he was going to build his great place there, in Barsetshire. Then his father died, and the Duke hasn't lived here much since. It's a great deal nicer place than Gatherum Castle, only not half so grand. I hate grandeur; don't you?\"\n\"I never tried much of it, as you have.\"\n\"Come now; that's not fair. There's no one in the world less grand than I am.\"\n\"I mean that I've not had grand people about me.\"\n\"Having cut all your cousins, and Lady Midlothian in particular, like the naughty girl you are. I was so angry with you when you accused me of selling you about that. You ought to have known that I was the last person in the world to have done such a thing.\"\n\"I did not think that-\"\n\"Yes, you did, Alice. You thought that Lady Midlothian was making a tool of me so that I might bring you under her thumb.\"\n\"But it was so necessary that I should guard myself,\" pleaded Alice.\n\"You shall be guarded. I'll take you under my shield. Mr. Grey shan't be named to you, except that I shall expect you to tell me all about it; and you must tell me all about that dangerous cousin, too, of whom they were saying such terrible things down in Scotland. I had heard of him before.\" These last words Lady Glencora spoke in a lower voice and in an altered tone, as though she were thinking of something that pained her. She had heard of George from Burgo Fitzgerald.\nAlice did not know what to say. She found it impossible to discuss all her most secret and deepest feelings out in that open carriage, perhaps in the hearing of the servant behind, on this first meeting with her cousin - of whom she actually knew very little. She had not intended to discuss these things at all.\n\"This is the beginning of the park,\" said Lady Glencora, pointing to a grand old oak tree, by the corner of the park palings. \"And that is Matching oak, under which Cur de Lion or Edward the Third, I forget which, was met by Sir Guy de Palisere as he came from the war, or from hunting, or something. Jeffrey Palliser, who is my husband's cousin, says that old Sir Guy luckily pulled out his brandy-flask for the king, and the king immediately gave him all the lands of Matching - only there was a priory then and a lot of monks. And the king gave him Littlebury at the same time, which is about seven miles away from here. As Jeffrey Palliser says, it was a great deal of money for a pull at his flask. Jeffrey Palliser is here now, and I hope you'll like him. If I have no child, and Mr. Palliser were not to marry again, Jeffrey would be the heir.\" And here again her voice was low and slow, and altogether changed in its tone.\n\"I suppose that's the way most of the old families got their estates.\"\n\"Yes, or else by robbery. Many of them were terrible thieves, and I dare say Sir Guy was no better than he should be. But since that they have always called some of the Pallisers Plantagenet. My husband's name is Plantagenet. The Duke is called George Plantagenet, and the king was his godfather. But there's no use in godfathers and godmothers, is there?\"\n\"Not much as it's managed now.\"\n\"If I had a child - oh, Alice, it's a dreadful thing not to have a child when so much depends on it!\"\n\"But you're such a short time married.\"\n\"I can see it in his eyes; but I don't think he'd say an unkind word, not if his own position depended on it. Ah, well; this is the town. That's the inn. That's our baker; and I know that man there mends Mr. Palliser's shoes. He's very particular about his shoes. We shall see the church as we go in at the other gate. It is in the park, and is very pretty, but not half so pretty as the priory ruins near the house. I do so love to wander about our ruins at moonlight. I often think of you when I do; I don't know why. No, I do know why, and I'll tell you some day.\"\nAs they drove up through the park, Lady Glencora pointed out the church and the ruins, through the midst of which the road ran, and then they were at the front door. The modern house came within two hundred yards of the gateway of the old priory. It was a large house, very pretty, with two long fronts and gabled roofs; but it was not a palace, nor even a mansion. The windows of the drawing-rooms opened out upon a lawn which separated the house from the old ruins, and which indeed surrounded the ruins, and went inside them, forming the floor of the old chapel, refectory, and cloisters. In the middle of the cloisters stood a large modern stone vase, out of whose broad basin hung flowering creepers and green tendrils.\nAs Lady Glencora drove up to the door, a gentleman came forth to meet them.\n\"There's Mr. Palliser,\" said she; \"that shows that you are an honoured guest, for he is hard at work and would not have come out for anybody else. Plantagenet, here is Miss Vavasor. Alice, my husband.\" Mr. Palliser helped her out of the carriage.\n\"I hope you've not found it very cold,\" said he. \"The winter has come upon us quite suddenly.\"\nHe said nothing more to her than this, till he met her again before dinner. He was a tall thin man, about thirty years of age, looking like a gentleman, but with nothing in his appearance that was remarkable. It was a face that you might see and forget, and see again and forget again; and yet it was a fairly good face, showing intellect in the forehead, and much character in the mouth. The eyes too, though not bright, had always something to say for themselves, looking as though they had a real meaning. But his face was perhaps too thin; and he wore no beard to give it character.\nIndeed, Mr. Palliser was a man who wished not to be looked at, but to be read about in the newspapers. Men said that he was to be Chancellor of the Exchequer, and no one thought of suggesting that his face would stand in his way.\n\"Are the people all out?\" his wife asked him.\n\"The men have not come in from shooting; and some of the ladies are driving, I suppose. But I haven't seen anybody since you went.\"\n\"Of course you haven't. He never has time, Alice, to see any one. But we'll go upstairs, dear. I told them to let us have tea in my dressing-room, as I thought you'd like that better than going into the drawing-room. You must be famished, I know. Then you can come down, or you can sit over the fire upstairs till dinner-time.\" So saying she skipped upstairs and Alice followed her. \"Here's my dressing-room, and here's your room opposite. You look out into the park. It's pretty, isn't it? But come into my dressing-room, and see the ruins out of the window.\"\nAlice followed Lady Glencora across the passage into what she called her dressing-room, and there found herself surrounded by an infinitude of feminine luxuries. The prettiest of tables - the easiest of chairs - the most costly of cabinets. It was bright with colour, with books, and with nymphs painted on the ceiling and little Cupids on the doors.\n\"I call it my dressing-room because in that way I can keep people out of it,\" said Lady Glencora, \"but it isn't really. Isn't it pretty?\"\n\"Very pretty.\"\n\"The Duke did it all. He understands such things thoroughly. Now to Mr. Palliser a dressing-room is a dressing-room. He cares for nothing being pretty; not even his wife, or he wouldn't have married me.\"\n\"You wouldn't say that if you meant it.\"\n\"Well, I don't know. Sometimes when I look at myself, when I simply am myself, I think I'm the ugliest young woman the sun ever shone on. And in ten years' time I shall be the ugliest old woman. Only think - my hair is beginning to get grey, and I'm not twenty-one yet. Look at it;\" and she lifted up the wavy locks just above her ear. \"But there's one comfort; he doesn't care about beauty. How old are you?\"\n\"Over five-and-twenty,\" said Alice.\n\"I oughtn't to have asked you. I am so sorry.\"\n\"That's nonsense. Why should I be ashamed of my age?\"\n\"I don't know, only somehow, people are; and I didn't think you were so old. Five-and-twenty seems old to me. It would be nothing if you were married; only, you see, you won't get married.\"\n\"Perhaps I may some day.\"\n\"Of course you will. You'll have to give way. They'll get the better of you. Your father will storm at you, and Lady Macleod will preach at you, and Lady Midlothian will jump upon you.\"\n\"I'm not a bit afraid of Lady Midlothian.\"\n\"I know what it is, my dear, to be jumped upon. When they all come upon you in earnest how are you to stand against them? How can any girl do it?\"\n\"I think I shall be able.\"\n\"To be sure you're older - and not so heavily weighted. But I didn't mean to talk about that; not yet at any rate. Well, now, my dear, I must go down. The Duchess of St. Bungay is here, and Mr. Palliser will be angry if I don't behave prettily to her. The Duke is to be the new President of the Council, or rather, I believe he is President now. I try to remember it all, but it is so hard when one doesn't really care two pence. Although I'm very anxious that Mr. Palliser should be Chancellor of the Exchequer. And now, will you stay here, or come down with me, or will you go to your own room until dinner? We dine at eight.\"\nAlice decided that she would stay in her own room till dinner time, and was taken there by Lady Glencora. She found her maid unpacking her clothes, and helped her; but that was soon done.\n\"I shall feel so strange, ma'am, among all those people downstairs,\" said the girl. \"They all look at me as though they didn't know who I was.\"\n\"You'll get over that soon, Jane.\"\n\"I suppose I shall; but you see, they all know each other, miss.\"\nAlice, when she sat down alone, felt herself to be very much in the same condition as her maid. What would the Duchess of St. Bungay or Mr. Jeffrey Palliser care for her? As to Mr. Palliser, the master of the house, it was already evident that he would not put himself out of his way for her. Had she done wrong to come? Lady Glencora was very kind to her, but she was aware that Lady Glencora could not devote herself especially to her. Lady Glencora must look after her duchesses.\nAnd then she began to think about Lady Glencora herself. What a strange, weird nature, with her round blue eyes and wavy hair, looking sometimes like a child and sometimes almost like an old woman! And how she talked! What things she said! Why had she made that allusion to her own betrothal - and then, checking herself, almost declare that she meant to say more of it later?\n\"She should never mention it to anyone,\" said Alice to herself. She vowed that no father, no aunt, no Lady Midlothian should persuade her into a marriage of which she feared the consequences. But then Lady Glencora had been very young, and had been terribly weighted with her wealth.\nIt seemed to Alice that her cousin had told her everything in that hour and a half that they had been together. She had given a whole history of her husband and of herself. She had said how indifferent he was to her pleasures, and how vainly she strove to interest herself in his pursuits. And she was still childless when, as she herself had said, \"so much depended on it.\" It was very strange to Alice that all this should have been already told to her. And why should Lady Glencora think of Alice when she walked among the priory ruins by moonlight?\nThe two hours seemed very long; but at last her maid came to dress her for dinner.\n\"How do you get on below, Jane?\" Alice asked her.\n\"Why, miss, they are uncommon civil, and I don't think after all it will be so bad. We had our teas very comfortable in the housekeeper's room.\"\nA few minutes before eight Lady Glencora knocked at Alice's door, to lead her to the drawing-room. Alice saw that she was magnificently dressed, with an enormous expanse of robe, and with her locks arranged so that no one could suspect the presence of a grey hair. For all her magnificence, she looked almost a child.\n\"I'll tell Jeffrey to take you in to dinner,\" she told Alice. \"He's about the easiest young man we have here. He rather turns up his nose at everything, but that doesn't make him less agreeable - unless he turns up his nose at you, you know.\"\n\"Perhaps he will.\"\n\"No, he won't. He's the most courteous man in the world. Good, there's nobody here,\" she said as they entered the room. \"It's always proper to be first in one's own house. I do so try to be proper - and it is such trouble. Oh dear! what fun it would be to be sitting somewhere in Asia, eating a chicken with one's fingers, and lighting a big fire outside one's tent to keep off the lions and tigers!\" Then Lady Glencora strove to look like a lion, and grinned at herself in the glass. \"I have been reading about it in that woman's travels. Oh, here they are; I mustn't make any more faces. Duchess, do come to the fire. This is my cousin, Miss Vavasor.\"\nThe Duchess made a stiff little bow, and declared that she was charmingly warm. \"I don't know how you manage it, but the staircases are so comfortable. Now at Longroyston we've taken all the trouble in the world - put down hot-water pipes all over the house, yet there are draughts at every corner of the passages.\" The Duchess spoke with an enormous emphasis on every other word, sometimes putting so great a stress on some special syllable, as almost to bring her voice to a whistle - especially when she said pipes. She was a woman of about forty, very handsome - but a fool. Two Miss Pallisers, cousins of Plantagenet Palliser, had entered the room at the same time, and they were certainly not fools.\n\"It's always easy to warm a small house like this,\" said Miss Palliser, whose Christian name, unfortunately, was Iphigenia Theodata, and whom her cousin and sister called Iphy; \"and I suppose it's difficult to warm a large one such as Longroyston.\" The other Miss Palliser was called Euphemia.\n\"We've got no pipes, Duchess, at any rate,\" said Lady Glencora; and Alice, as she sat listening, thought she discerned in Lady Glencora's pronunciation of the word pipes an almost hidden imitation of the Duchess's whistle. Lady Glencora's eye met Alice's for an instant, and was then withdrawn, so that Alice was compelled to think that her friend was not always quite successful in her struggles to be proper.\nThen the gentlemen came in, and other ladies, till about thirty people were assembled. Mr. Palliser came up and spoke a kind word to Alice.\n\"My wife has been thinking so much of your coming. I hope we shall be able to amuse you.\"\nAlice, who had already begun to feel desolate, was grateful, and made up her mind that she would try to like Mr. Palliser.\nJeffrey Palliser was almost the last in the room. Lady Glencora went to meet him, saying, \"You must take my cousin, Alice Vavasor, in to dinner, and try to make her comfortable.\" She introduced them, and Jeffrey Palliser stood talking to Alice till dinner was announced.",
        "paragraph_chars": [
            [
                0,
                494
            ],
            [
                494,
                876
            ],
            [
                876,
                1036
            ],
            [
                1036,
                1046
            ],
            [
                1046,
                1097
            ],
            [
                1097,
                1201
            ],
            [
                1201,
                1469
            ],
            [
                1469,
                1738
            ],
            [
                1738,
                1781
            ],
            [
                1781,
                2038
            ],
            [
                2038,
                2674
            ],
            [
                2674,
                2811
            ],
            [
                2811,
                2873
            ],
            [
                2873,
                2995
            ],
            [
                2995,
                3284
            ],
            [
                3284,
                3315
            ],
            [
                3315,
                3364
            ],
            [
                3364,
                3386
            ],
            [
                3386,
                3940
            ],
            [
                3940,
                3981
            ],
            [
                3981,
                4060
            ],
            [
                4060,
                4110
            ],
            [
                4110,
                4369
            ],
            [
                4369,
                4393
            ],
            [
                4393,
                4516
            ],
            [
                4516,
                4585
            ],
            [
                4585,
                5062
            ],
            [
                5062,
                5375
            ],
            [
                5375,
                6306
            ],
            [
                6306,
                6377
            ],
            [
                6377,
                6734
            ],
            [
                6734,
                6766
            ],
            [
                6766,
                6868
            ],
            [
                6868,
                6908
            ],
            [
                6908,
                7476
            ],
            [
                7476,
                8201
            ],
            [
                8201,
                8277
            ],
            [
                8277,
                8524
            ],
            [
                8524,
                8619
            ],
            [
                8619,
                9206
            ],
            [
                9206,
                9436
            ],
            [
                9436,
                9482
            ],
            [
                9482,
                9614
            ],
            [
                9614,
                10175
            ],
            [
                10175,
                10526
            ],
            [
                10526,
                10664
            ],
            [
                10664,
                10679
            ],
            [
                10679,
                10883
            ],
            [
                10883,
                10924
            ],
            [
                10924,
                11334
            ],
            [
                11334,
                11370
            ],
            [
                11370,
                11417
            ],
            [
                11417,
                11471
            ],
            [
                11471,
                11661
            ],
            [
                11661,
                11687
            ],
            [
                11687,
                11873
            ],
            [
                11873,
                11916
            ],
            [
                11916,
                12063
            ],
            [
                12063,
                12090
            ],
            [
                12090,
                12719
            ],
            [
                12719,
                12907
            ],
            [
                12907,
                13051
            ],
            [
                13051,
                13086
            ],
            [
                13086,
                13152
            ],
            [
                13152,
                13635
            ],
            [
                13635,
                14012
            ],
            [
                14012,
                14296
            ],
            [
                14296,
                14849
            ],
            [
                14849,
                14932
            ],
            [
                14932,
                14982
            ],
            [
                14982,
                15127
            ],
            [
                15127,
                15445
            ],
            [
                15445,
                15688
            ],
            [
                15688,
                15707
            ],
            [
                15707,
                16361
            ],
            [
                16361,
                17067
            ],
            [
                17067,
                17361
            ],
            [
                17361,
                17772
            ],
            [
                17772,
                17912
            ],
            [
                17912,
                18002
            ],
            [
                18002,
                18125
            ],
            [
                18125,
                18395
            ]
        ],
        "segment_chars": [
            [
                0,
                81
            ],
            [
                81,
                184
            ],
            [
                184,
                382
            ],
            [
                382,
                494
            ],
            [
                494,
                802
            ],
            [
                802,
                836
            ],
            [
                836,
                876
            ],
            [
                876,
                943
            ],
            [
                943,
                1016
            ],
            [
                1016,
                1036
            ],
            [
                1036,
                1046
            ],
            [
                1046,
                1097
            ],
            [
                1097,
                1102
            ],
            [
                1102,
                1201
            ],
            [
                1201,
                1217
            ],
            [
                1217,
                1303
            ],
            [
                1303,
                1366
            ],
            [
                1366,
                1394
            ],
            [
                1394,
                1424
            ],
            [
                1424,
                1469
            ],
            [
                1469,
                1537
            ],
            [
                1537,
                1610
            ],
            [
                1610,
                1653
            ],
            [
                1653,
                1738
            ],
            [
                1738,
                1781
            ],
            [
                1781,
                1800
            ],
            [
                1800,
                1849
            ],
            [
                1849,
                1923
            ],
            [
                1923,
                2038
            ],
            [
                2038,
                2106
            ],
            [
                2106,
                2137
            ],
            [
                2137,
                2186
            ],
            [
                2186,
                2223
            ],
            [
                2223,
                2306
            ],
            [
                2306,
                2418
            ],
            [
                2418,
                2459
            ],
            [
                2459,
                2514
            ],
            [
                2514,
                2578
            ],
            [
                2578,
                2674
            ],
            [
                2674,
                2763
            ],
            [
                2763,
                2811
            ],
            [
                2811,
                2873
            ],
            [
                2873,
                2907
            ],
            [
                2907,
                2932
            ],
            [
                2932,
                2995
            ],
            [
                2995,
                3027
            ],
            [
                3027,
                3130
            ],
            [
                3130,
                3284
            ],
            [
                3284,
                3315
            ],
            [
                3315,
                3330
            ],
            [
                3330,
                3364
            ],
            [
                3364,
                3374
            ],
            [
                3374,
                3386
            ],
            [
                3386,
                3410
            ],
            [
                3410,
                3499
            ],
            [
                3499,
                3605
            ],
            [
                3605,
                3651
            ],
            [
                3651,
                3770
            ],
            [
                3770,
                3835
            ],
            [
                3835,
                3911
            ],
            [
                3911,
                3940
            ],
            [
                3940,
                3981
            ],
            [
                3981,
                4009
            ],
            [
                4009,
                4060
            ],
            [
                4060,
                4110
            ],
            [
                4110,
                4206
            ],
            [
                4206,
                4277
            ],
            [
                4277,
                4369
            ],
            [
                4369,
                4393
            ],
            [
                4393,
                4415
            ],
            [
                4415,
                4516
            ],
            [
                4516,
                4585
            ],
            [
                4585,
                4608
            ],
            [
                4608,
                4639
            ],
            [
                4639,
                4851
            ],
            [
                4851,
                4879
            ],
            [
                4879,
                5015
            ],
            [
                5015,
                5062
            ],
            [
                5062,
                5094
            ],
            [
                5094,
                5322
            ],
            [
                5322,
                5375
            ],
            [
                5375,
                5501
            ],
            [
                5501,
                5676
            ],
            [
                5676,
                5905
            ],
            [
                5905,
                5999
            ],
            [
                5999,
                6079
            ],
            [
                6079,
                6137
            ],
            [
                6137,
                6227
            ],
            [
                6227,
                6306
            ],
            [
                6306,
                6377
            ],
            [
                6377,
                6403
            ],
            [
                6403,
                6495
            ],
            [
                6495,
                6569
            ],
            [
                6569,
                6603
            ],
            [
                6603,
                6674
            ],
            [
                6674,
                6734
            ],
            [
                6734,
                6766
            ],
            [
                6766,
                6868
            ],
            [
                6868,
                6908
            ],
            [
                6908,
                7018
            ],
            [
                7018,
                7046
            ],
            [
                7046,
                7062
            ],
            [
                7062,
                7134
            ],
            [
                7134,
                7172
            ],
            [
                7172,
                7227
            ],
            [
                7227,
                7325
            ],
            [
                7325,
                7378
            ],
            [
                7378,
                7428
            ],
            [
                7428,
                7476
            ],
            [
                7476,
                7642
            ],
            [
                7642,
                7723
            ],
            [
                7723,
                7842
            ],
            [
                7842,
                8068
            ],
            [
                8068,
                8201
            ],
            [
                8201,
                8277
            ],
            [
                8277,
                8424
            ],
            [
                8424,
                8459
            ],
            [
                8459,
                8479
            ],
            [
                8479,
                8524
            ],
            [
                8524,
                8573
            ],
            [
                8573,
                8619
            ],
            [
                8619,
                8695
            ],
            [
                8695,
                8828
            ],
            [
                8828,
                9008
            ],
            [
                9008,
                9128
            ],
            [
                9128,
                9206
            ],
            [
                9206,
                9309
            ],
            [
                9309,
                9436
            ],
            [
                9436,
                9462
            ],
            [
                9462,
                9482
            ],
            [
                9482,
                9570
            ],
            [
                9570,
                9614
            ],
            [
                9614,
                9638
            ],
            [
                9638,
                9680
            ],
            [
                9680,
                9709
            ],
            [
                9709,
                9831
            ],
            [
                9831,
                9861
            ],
            [
                9861,
                9942
            ],
            [
                9942,
                9997
            ],
            [
                9997,
                10054
            ],
            [
                10054,
                10082
            ],
            [
                10082,
                10105
            ],
            [
                10105,
                10175
            ],
            [
                10175,
                10337
            ],
            [
                10337,
                10416
            ],
            [
                10416,
                10526
            ],
            [
                10526,
                10646
            ],
            [
                10646,
                10664
            ],
            [
                10664,
                10679
            ],
            [
                10679,
                10701
            ],
            [
                10701,
                10740
            ],
            [
                10740,
                10796
            ],
            [
                10796,
                10883
            ],
            [
                10883,
                10924
            ],
            [
                10924,
                10945
            ],
            [
                10945,
                11062
            ],
            [
                11062,
                11119
            ],
            [
                11119,
                11194
            ],
            [
                11194,
                11260
            ],
            [
                11260,
                11316
            ],
            [
                11316,
                11334
            ],
            [
                11334,
                11370
            ],
            [
                11370,
                11401
            ],
            [
                11401,
                11417
            ],
            [
                11417,
                11435
            ],
            [
                11435,
                11471
            ],
            [
                11471,
                11548
            ],
            [
                11548,
                11581
            ],
            [
                11581,
                11661
            ],
            [
                11661,
                11687
            ],
            [
                11687,
                11708
            ],
            [
                11708,
                11733
            ],
            [
                11733,
                11764
            ],
            [
                11764,
                11873
            ],
            [
                11873,
                11916
            ],
            [
                11916,
                11964
            ],
            [
                11964,
                12038
            ],
            [
                12038,
                12063
            ],
            [
                12063,
                12090
            ],
            [
                12090,
                12146
            ],
            [
                12146,
                12205
            ],
            [
                12205,
                12241
            ],
            [
                12241,
                12342
            ],
            [
                12342,
                12436
            ],
            [
                12436,
                12520
            ],
            [
                12520,
                12603
            ],
            [
                12603,
                12700
            ],
            [
                12700,
                12719
            ],
            [
                12719,
                12825
            ],
            [
                12825,
                12907
            ],
            [
                12907,
                12991
            ],
            [
                12991,
                13051
            ],
            [
                13051,
                13086
            ],
            [
                13086,
                13152
            ],
            [
                13152,
                13248
            ],
            [
                13248,
                13323
            ],
            [
                13323,
                13445
            ],
            [
                13445,
                13473
            ],
            [
                13473,
                13590
            ],
            [
                13590,
                13635
            ],
            [
                13635,
                13692
            ],
            [
                13692,
                13833
            ],
            [
                13833,
                13853
            ],
            [
                13853,
                13875
            ],
            [
                13875,
                14012
            ],
            [
                14012,
                14076
            ],
            [
                14076,
                14204
            ],
            [
                14204,
                14296
            ],
            [
                14296,
                14408
            ],
            [
                14408,
                14469
            ],
            [
                14469,
                14586
            ],
            [
                14586,
                14671
            ],
            [
                14671,
                14752
            ],
            [
                14752,
                14849
            ],
            [
                14849,
                14932
            ],
            [
                14932,
                14965
            ],
            [
                14965,
                14982
            ],
            [
                14982,
                15066
            ],
            [
                15066,
                15127
            ],
            [
                15127,
                15226
            ],
            [
                15226,
                15392
            ],
            [
                15392,
                15445
            ],
            [
                15445,
                15507
            ],
            [
                15507,
                15555
            ],
            [
                15555,
                15688
            ],
            [
                15688,
                15707
            ],
            [
                15707,
                15722
            ],
            [
                15722,
                15764
            ],
            [
                15764,
                15827
            ],
            [
                15827,
                15879
            ],
            [
                15879,
                15930
            ],
            [
                15930,
                15939
            ],
            [
                15939,
                16108
            ],
            [
                16108,
                16192
            ],
            [
                16192,
                16247
            ],
            [
                16247,
                16297
            ],
            [
                16297,
                16327
            ],
            [
                16327,
                16361
            ],
            [
                16361,
                16441
            ],
            [
                16441,
                16513
            ],
            [
                16513,
                16677
            ],
            [
                16677,
                16880
            ],
            [
                16880,
                16940
            ],
            [
                16940,
                17067
            ],
            [
                17067,
                17316
            ],
            [
                17316,
                17361
            ],
            [
                17361,
                17584
            ],
            [
                17584,
                17772
            ],
            [
                17772,
                17859
            ],
            [
                17859,
                17912
            ],
            [
                17912,
                17963
            ],
            [
                17963,
                18002
            ],
            [
                18002,
                18125
            ],
            [
                18125,
                18175
            ],
            [
                18175,
                18304
            ],
            [
                18304,
                18395
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                43,
                79
            ],
            [
                79,
                81
            ],
            [
                81,
                112
            ],
            [
                119,
                147
            ],
            [
                147,
                184
            ],
            [
                184,
                323
            ],
            [
                323,
                354
            ],
            [
                355,
                382
            ],
            [
                382,
                418
            ],
            [
                428,
                492
            ],
            [
                492,
                494
            ],
            [
                494,
                501
            ],
            [
                502,
                610
            ],
            [
                616,
                619
            ],
            [
                628,
                635
            ],
            [
                639,
                642
            ],
            [
                643,
                648
            ],
            [
                648,
                668
            ],
            [
                669,
                689
            ],
            [
                689,
                802
            ],
            [
                802,
                836
            ],
            [
                836,
                855
            ],
            [
                856,
                874
            ],
            [
                874,
                876
            ],
            [
                876,
                943
            ],
            [
                943,
                944
            ],
            [
                944,
                993
            ],
            [
                993,
                994
            ],
            [
                995,
                998
            ],
            [
                999,
                1016
            ],
            [
                1016,
                1036
            ],
            [
                1036,
                1043
            ],
            [
                1043,
                1046
            ],
            [
                1046,
                1069
            ],
            [
                1070,
                1097
            ],
            [
                1097,
                1102
            ],
            [
                1102,
                1199
            ],
            [
                1199,
                1201
            ],
            [
                1201,
                1217
            ],
            [
                1217,
                1220
            ],
            [
                1222,
                1303
            ],
            [
                1303,
                1323
            ],
            [
                1324,
                1366
            ],
            [
                1366,
                1392
            ],
            [
                1392,
                1394
            ],
            [
                1394,
                1424
            ],
            [
                1424,
                1448
            ],
            [
                1467,
                1469
            ],
            [
                1469,
                1514
            ],
            [
                1535,
                1537
            ],
            [
                1538,
                1583
            ],
            [
                1584,
                1610
            ],
            [
                1610,
                1653
            ],
            [
                1653,
                1704
            ],
            [
                1705,
                1738
            ],
            [
                1738,
                1781
            ],
            [
                1781,
                1800
            ],
            [
                1800,
                1801
            ],
            [
                1802,
                1849
            ],
            [
                1849,
                1898
            ],
            [
                1899,
                1920
            ],
            [
                1920,
                1923
            ],
            [
                1923,
                1988
            ],
            [
                1988,
                1989
            ],
            [
                1990,
                2013
            ],
            [
                2014,
                2024
            ],
            [
                2025,
                2027
            ],
            [
                2028,
                2032
            ],
            [
                2033,
                2037
            ],
            [
                2038,
                2095
            ],
            [
                2096,
                2106
            ],
            [
                2106,
                2137
            ],
            [
                2137,
                2186
            ],
            [
                2186,
                2211
            ],
            [
                2223,
                2306
            ],
            [
                2306,
                2367
            ],
            [
                2368,
                2369
            ],
            [
                2377,
                2401
            ],
            [
                2402,
                2418
            ],
            [
                2418,
                2459
            ],
            [
                2459,
                2514
            ],
            [
                2514,
                2578
            ],
            [
                2578,
                2671
            ],
            [
                2671,
                2674
            ],
            [
                2674,
                2736
            ],
            [
                2745,
                2763
            ],
            [
                2763,
                2811
            ],
            [
                2811,
                2873
            ],
            [
                2873,
                2907
            ],
            [
                2907,
                2909
            ],
            [
                2921,
                2932
            ],
            [
                2932,
                2995
            ],
            [
                2995,
                3027
            ],
            [
                3027,
                3043
            ],
            [
                3043,
                3044
            ],
            [
                3048,
                3130
            ],
            [
                3130,
                3166
            ],
            [
                3186,
                3284
            ],
            [
                3284,
                3315
            ],
            [
                3315,
                3316
            ],
            [
                3316,
                3324
            ],
            [
                3328,
                3330
            ],
            [
                3330,
                3361
            ],
            [
                3361,
                3364
            ],
            [
                3364,
                3374
            ],
            [
                3374,
                3386
            ],
            [
                3386,
                3410
            ],
            [
                3410,
                3499
            ],
            [
                3499,
                3530
            ],
            [
                3531,
                3533
            ],
            [
                3540,
                3576
            ],
            [
                3589,
                3605
            ],
            [
                3605,
                3651
            ],
            [
                3651,
                3679
            ],
            [
                3680,
                3715
            ],
            [
                3716,
                3746
            ],
            [
                3754,
                3768
            ],
            [
                3768,
                3770
            ],
            [
                3770,
                3795
            ],
            [
                3805,
                3817
            ],
            [
                3823,
                3835
            ],
            [
                3835,
                3911
            ],
            [
                3911,
                3940
            ],
            [
                3940,
                3981
            ],
            [
                3981,
                4009
            ],
            [
                4009,
                4060
            ],
            [
                4060,
                4110
            ],
            [
                4110,
                4139
            ],
            [
                4140,
                4179
            ],
            [
                4184,
                4196
            ],
            [
                4197,
                4206
            ],
            [
                4206,
                4277
            ],
            [
                4277,
                4369
            ],
            [
                4369,
                4385
            ],
            [
                4393,
                4415
            ],
            [
                4415,
                4471
            ],
            [
                4472,
                4474
            ],
            [
                4475,
                4513
            ],
            [
                4516,
                4517
            ],
            [
                4517,
                4567
            ],
            [
                4585,
                4608
            ],
            [
                4608,
                4639
            ],
            [
                4639,
                4851
            ],
            [
                4851,
                4879
            ],
            [
                4879,
                4956
            ],
            [
                4957,
                5015
            ],
            [
                5015,
                5038
            ],
            [
                5039,
                5060
            ],
            [
                5060,
                5062
            ],
            [
                5062,
                5094
            ],
            [
                5094,
                5132
            ],
            [
                5133,
                5136
            ],
            [
                5137,
                5160
            ],
            [
                5161,
                5250
            ],
            [
                5251,
                5280
            ],
            [
                5283,
                5290
            ],
            [
                5291,
                5294
            ],
            [
                5304,
                5322
            ],
            [
                5322,
                5373
            ],
            [
                5373,
                5374
            ],
            [
                5375,
                5455
            ],
            [
                5456,
                5465
            ],
            [
                5469,
                5472
            ],
            [
                5473,
                5499
            ],
            [
                5499,
                5501
            ],
            [
                5501,
                5539
            ],
            [
                5544,
                5674
            ],
            [
                5674,
                5676
            ],
            [
                5676,
                5779
            ],
            [
                5792,
                5797
            ],
            [
                5798,
                5853
            ],
            [
                5856,
                5903
            ],
            [
                5903,
                5905
            ],
            [
                5905,
                5999
            ],
            [
                5999,
                6079
            ],
            [
                6079,
                6137
            ],
            [
                6137,
                6227
            ],
            [
                6227,
                6306
            ],
            [
                6306,
                6377
            ],
            [
                6377,
                6378
            ],
            [
                6381,
                6385
            ],
            [
                6391,
                6403
            ],
            [
                6403,
                6437
            ],
            [
                6437,
                6495
            ],
            [
                6495,
                6569
            ],
            [
                6569,
                6603
            ],
            [
                6603,
                6674
            ],
            [
                6678,
                6721
            ],
            [
                6723,
                6725
            ],
            [
                6726,
                6731
            ],
            [
                6731,
                6734
            ],
            [
                6734,
                6766
            ],
            [
                6766,
                6783
            ],
            [
                6786,
                6868
            ],
            [
                6868,
                6905
            ],
            [
                6905,
                6908
            ],
            [
                6908,
                6909
            ],
            [
                6909,
                6933
            ],
            [
                6933,
                7018
            ],
            [
                7018,
                7035
            ],
            [
                7036,
                7046
            ],
            [
                7046,
                7060
            ],
            [
                7060,
                7062
            ],
            [
                7062,
                7068
            ],
            [
                7069,
                7072
            ],
            [
                7073,
                7078
            ],
            [
                7078,
                7090
            ],
            [
                7091,
                7134
            ],
            [
                7134,
                7172
            ],
            [
                7172,
                7227
            ],
            [
                7227,
                7265
            ],
            [
                7266,
                7308
            ],
            [
                7314,
                7325
            ],
            [
                7325,
                7353
            ],
            [
                7364,
                7378
            ],
            [
                7378,
                7426
            ],
            [
                7426,
                7427
            ],
            [
                7432,
                7473
            ],
            [
                7476,
                7536
            ],
            [
                7537,
                7551
            ],
            [
                7552,
                7625
            ],
            [
                7626,
                7642
            ],
            [
                7642,
                7723
            ],
            [
                7723,
                7737
            ],
            [
                7738,
                7743
            ],
            [
                7743,
                7778
            ],
            [
                7795,
                7800
            ],
            [
                7801,
                7825
            ],
            [
                7831,
                7842
            ],
            [
                7842,
                8016
            ],
            [
                8017,
                8022
            ],
            [
                8023,
                8041
            ],
            [
                8042,
                8056
            ],
            [
                8057,
                8068
            ],
            [
                8068,
                8084
            ],
            [
                8085,
                8098
            ],
            [
                8099,
                8138
            ],
            [
                8145,
                8156
            ],
            [
                8157,
                8201
            ],
            [
                8201,
                8251
            ],
            [
                8252,
                8276
            ],
            [
                8277,
                8358
            ],
            [
                8359,
                8424
            ],
            [
                8424,
                8457
            ],
            [
                8457,
                8459
            ],
            [
                8459,
                8479
            ],
            [
                8481,
                8491
            ],
            [
                8492,
                8524
            ],
            [
                8524,
                8573
            ],
            [
                8573,
                8619
            ],
            [
                8619,
                8695
            ],
            [
                8695,
                8718
            ],
            [
                8725,
                8753
            ],
            [
                8754,
                8828
            ],
            [
                8828,
                8912
            ],
            [
                8913,
                9008
            ],
            [
                9008,
                9032
            ],
            [
                9033,
                9128
            ],
            [
                9128,
                9131
            ],
            [
                9136,
                9144
            ],
            [
                9153,
                9205
            ],
            [
                9212,
                9240
            ],
            [
                9248,
                9307
            ],
            [
                9307,
                9309
            ],
            [
                9309,
                9402
            ],
            [
                9403,
                9436
            ],
            [
                9436,
                9462
            ],
            [
                9462,
                9482
            ],
            [
                9482,
                9522
            ],
            [
                9523,
                9570
            ],
            [
                9570,
                9614
            ],
            [
                9614,
                9638
            ],
            [
                9638,
                9680
            ],
            [
                9680,
                9692
            ],
            [
                9701,
                9709
            ],
            [
                9709,
                9829
            ],
            [
                9829,
                9831
            ],
            [
                9831,
                9861
            ],
            [
                9861,
                9887
            ],
            [
                9888,
                9913
            ],
            [
                9923,
                9942
            ],
            [
                9942,
                9963
            ],
            [
                9973,
                9997
            ],
            [
                9997,
                10043
            ],
            [
                10044,
                10054
            ],
            [
                10054,
                10082
            ],
            [
                10082,
                10105
            ],
            [
                10105,
                10175
            ],
            [
                10175,
                10337
            ],
            [
                10337,
                10360
            ],
            [
                10363,
                10384
            ],
            [
                10387,
                10414
            ],
            [
                10414,
                10416
            ],
            [
                10416,
                10434
            ],
            [
                10441,
                10442
            ],
            [
                10443,
                10447
            ],
            [
                10448,
                10454
            ],
            [
                10464,
                10525
            ],
            [
                10526,
                10601
            ],
            [
                10622,
                10623
            ],
            [
                10625,
                10628
            ],
            [
                10644,
                10646
            ],
            [
                10646,
                10664
            ],
            [
                10664,
                10679
            ],
            [
                10679,
                10701
            ],
            [
                10701,
                10740
            ],
            [
                10740,
                10794
            ],
            [
                10794,
                10796
            ],
            [
                10796,
                10883
            ],
            [
                10883,
                10924
            ],
            [
                10924,
                10945
            ],
            [
                10945,
                11001
            ],
            [
                11001,
                11062
            ],
            [
                11062,
                11119
            ],
            [
                11119,
                11129
            ],
            [
                11132,
                11194
            ],
            [
                11194,
                11260
            ],
            [
                11260,
                11316
            ],
            [
                11316,
                11334
            ],
            [
                11334,
                11370
            ],
            [
                11370,
                11371
            ],
            [
                11371,
                11401
            ],
            [
                11401,
                11417
            ],
            [
                11417,
                11433
            ],
            [
                11433,
                11435
            ],
            [
                11435,
                11445
            ],
            [
                11446,
                11447
            ],
            [
                11448,
                11471
            ],
            [
                11471,
                11484
            ],
            [
                11484,
                11548
            ],
            [
                11548,
                11569
            ],
            [
                11570,
                11581
            ],
            [
                11581,
                11661
            ],
            [
                11661,
                11675
            ],
            [
                11676,
                11687
            ],
            [
                11687,
                11708
            ],
            [
                11708,
                11733
            ],
            [
                11733,
                11764
            ],
            [
                11764,
                11873
            ],
            [
                11873,
                11916
            ],
            [
                11916,
                11964
            ],
            [
                11964,
                12038
            ],
            [
                12038,
                12063
            ],
            [
                12063,
                12090
            ],
            [
                12090,
                12114
            ],
            [
                12117,
                12120
            ],
            [
                12121,
                12146
            ],
            [
                12146,
                12149
            ],
            [
                12150,
                12183
            ],
            [
                12184,
                12205
            ],
            [
                12205,
                12241
            ],
            [
                12241,
                12317
            ],
            [
                12334,
                12342
            ],
            [
                12342,
                12436
            ],
            [
                12436,
                12518
            ],
            [
                12518,
                12520
            ],
            [
                12529,
                12603
            ],
            [
                12603,
                12620
            ],
            [
                12626,
                12634
            ],
            [
                12635,
                12685
            ],
            [
                12692,
                12700
            ],
            [
                12700,
                12719
            ],
            [
                12719,
                12825
            ],
            [
                12825,
                12870
            ],
            [
                12881,
                12905
            ],
            [
                12905,
                12906
            ],
            [
                12907,
                12962
            ],
            [
                12973,
                12991
            ],
            [
                12991,
                13000
            ],
            [
                13001,
                13051
            ],
            [
                13051,
                13086
            ],
            [
                13086,
                13123
            ],
            [
                13124,
                13127
            ],
            [
                13133,
                13152
            ],
            [
                13152,
                13248
            ],
            [
                13248,
                13308
            ],
            [
                13309,
                13323
            ],
            [
                13323,
                13390
            ],
            [
                13391,
                13445
            ],
            [
                13445,
                13452
            ],
            [
                13453,
                13471
            ],
            [
                13471,
                13473
            ],
            [
                13473,
                13512
            ],
            [
                13513,
                13584
            ],
            [
                13585,
                13588
            ],
            [
                13588,
                13590
            ],
            [
                13590,
                13608
            ],
            [
                13609,
                13633
            ],
            [
                13633,
                13635
            ],
            [
                13635,
                13692
            ],
            [
                13692,
                13720
            ],
            [
                13720,
                13721
            ],
            [
                13722,
                13833
            ],
            [
                13833,
                13853
            ],
            [
                13853,
                13873
            ],
            [
                13873,
                13875
            ],
            [
                13875,
                13886
            ],
            [
                13887,
                13908
            ],
            [
                13909,
                13926
            ],
            [
                13929,
                13955
            ],
            [
                13955,
                13989
            ],
            [
                13994,
                14004
            ],
            [
                14010,
                14011
            ],
            [
                14012,
                14043
            ],
            [
                14050,
                14076
            ],
            [
                14086,
                14204
            ],
            [
                14204,
                14207
            ],
            [
                14213,
                14226
            ],
            [
                14227,
                14296
            ],
            [
                14296,
                14408
            ],
            [
                14408,
                14469
            ],
            [
                14469,
                14586
            ],
            [
                14586,
                14589
            ],
            [
                14590,
                14597
            ],
            [
                14604,
                14613
            ],
            [
                14614,
                14644
            ],
            [
                14645,
                14671
            ],
            [
                14671,
                14752
            ],
            [
                14752,
                14811
            ],
            [
                14812,
                14849
            ],
            [
                14849,
                14869
            ],
            [
                14870,
                14879
            ],
            [
                14881,
                14919
            ],
            [
                14930,
                14932
            ],
            [
                14932,
                14965
            ],
            [
                14971,
                14982
            ],
            [
                14982,
                15066
            ],
            [
                15066,
                15124
            ],
            [
                15127,
                15192
            ],
            [
                15193,
                15226
            ],
            [
                15226,
                15309
            ],
            [
                15315,
                15324
            ],
            [
                15334,
                15336
            ],
            [
                15337,
                15392
            ],
            [
                15396,
                15444
            ],
            [
                15445,
                15488
            ],
            [
                15505,
                15507
            ],
            [
                15508,
                15555
            ],
            [
                15555,
                15623
            ],
            [
                15624,
                15638
            ],
            [
                15641,
                15688
            ],
            [
                15688,
                15689
            ],
            [
                15689,
                15707
            ],
            [
                15707,
                15710
            ],
            [
                15712,
                15720
            ],
            [
                15720,
                15722
            ],
            [
                15722,
                15764
            ],
            [
                15768,
                15769
            ],
            [
                15770,
                15789
            ],
            [
                15789,
                15825
            ],
            [
                15825,
                15827
            ],
            [
                15828,
                15879
            ],
            [
                15879,
                15903
            ],
            [
                15906,
                15930
            ],
            [
                15930,
                15937
            ],
            [
                15939,
                16105
            ],
            [
                16108,
                16191
            ],
            [
                16193,
                16247
            ],
            [
                16247,
                16264
            ],
            [
                16266,
                16297
            ],
            [
                16297,
                16327
            ],
            [
                16327,
                16361
            ],
            [
                16361,
                16396
            ],
            [
                16396,
                16401
            ],
            [
                16402,
                16441
            ],
            [
                16441,
                16469
            ],
            [
                16472,
                16513
            ],
            [
                16513,
                16572
            ],
            [
                16575,
                16619
            ],
            [
                16620,
                16623
            ],
            [
                16634,
                16677
            ],
            [
                16677,
                16845
            ],
            [
                16846,
                16847
            ],
            [
                16864,
                16867
            ],
            [
                16873,
                16878
            ],
            [
                16878,
                16880
            ],
            [
                16880,
                16883
            ],
            [
                16884,
                16925
            ],
            [
                16926,
                16927
            ],
            [
                16928,
                16940
            ],
            [
                16940,
                17031
            ],
            [
                17036,
                17045
            ],
            [
                17056,
                17067
            ],
            [
                17067,
                17154
            ],
            [
                17159,
                17174
            ],
            [
                17174,
                17175
            ],
            [
                17176,
                17179
            ],
            [
                17180,
                17203
            ],
            [
                17209,
                17230
            ],
            [
                17231,
                17242
            ],
            [
                17244,
                17258
            ],
            [
                17264,
                17316
            ],
            [
                17316,
                17339
            ],
            [
                17351,
                17361
            ],
            [
                17361,
                17584
            ],
            [
                17589,
                17708
            ],
            [
                17709,
                17743
            ],
            [
                17748,
                17757
            ],
            [
                17758,
                17772
            ],
            [
                17772,
                17798
            ],
            [
                17798,
                17859
            ],
            [
                17859,
                17889
            ],
            [
                17890,
                17896
            ],
            [
                17897,
                17910
            ],
            [
                17910,
                17911
            ],
            [
                17912,
                17963
            ],
            [
                17963,
                18001
            ],
            [
                18002,
                18125
            ],
            [
                18125,
                18173
            ],
            [
                18173,
                18174
            ],
            [
                18175,
                18188
            ],
            [
                18194,
                18196
            ],
            [
                18202,
                18205
            ],
            [
                18205,
                18206
            ],
            [
                18213,
                18214
            ],
            [
                18215,
                18268
            ],
            [
                18268,
                18273
            ],
            [
                18274,
                18304
            ],
            [
                18304,
                18351
            ],
            [
                18352,
                18359
            ],
            [
                18360,
                18368
            ],
            [
                18369,
                18395
            ]
        ],
        "row_chars": [
            [
                0,
                81
            ],
            [
                81,
                184
            ],
            [
                184,
                382
            ],
            [
                382,
                494
            ],
            [
                494,
                802
            ],
            [
                802,
                836
            ],
            [
                836,
                876
            ],
            [
                876,
                943
            ],
            [
                943,
                1016
            ],
            [
                1016,
                1036
            ],
            [
                1036,
                1046
            ],
            [
                1046,
                1097
            ],
            [
                1097,
                1102
            ],
            [
                1102,
                1201
            ],
            [
                1201,
                1217
            ],
            [
                1217,
                1217
            ],
            [
                1217,
                1303
            ],
            [
                1303,
                1366
            ],
            [
                1366,
                1366
            ],
            [
                1366,
                1394
            ],
            [
                1394,
                1424
            ],
            [
                1424,
                1469
            ],
            [
                1469,
                1537
            ],
            [
                1537,
                1610
            ],
            [
                1610,
                1653
            ],
            [
                1653,
                1738
            ],
            [
                1738,
                1781
            ],
            [
                1781,
                1800
            ],
            [
                1800,
                1800
            ],
            [
                1800,
                1800
            ],
            [
                1800,
                1800
            ],
            [
                1800,
                1849
            ],
            [
                1849,
                1923
            ],
            [
                1923,
                2038
            ],
            [
                2038,
                2106
            ],
            [
                2106,
                2137
            ],
            [
                2137,
                2186
            ],
            [
                2186,
                2223
            ],
            [
                2223,
                2223
            ],
            [
                2223,
                2223
            ],
            [
                2223,
                2306
            ],
            [
                2306,
                2418
            ],
            [
                2418,
                2459
            ],
            [
                2459,
                2514
            ],
            [
                2514,
                2578
            ],
            [
                2578,
                2674
            ],
            [
                2674,
                2763
            ],
            [
                2763,
                2763
            ],
            [
                2763,
                2811
            ],
            [
                2811,
                2873
            ],
            [
                2873,
                2907
            ],
            [
                2907,
                2932
            ],
            [
                2932,
                2995
            ],
            [
                2995,
                3027
            ],
            [
                3027,
                3130
            ],
            [
                3130,
                3284
            ],
            [
                3284,
                3315
            ],
            [
                3315,
                3330
            ],
            [
                3330,
                3364
            ],
            [
                3364,
                3374
            ],
            [
                3374,
                3386
            ],
            [
                3386,
                3410
            ],
            [
                3410,
                3499
            ],
            [
                3499,
                3605
            ],
            [
                3605,
                3651
            ],
            [
                3651,
                3770
            ],
            [
                3770,
                3770
            ],
            [
                3770,
                3770
            ],
            [
                3770,
                3835
            ],
            [
                3835,
                3911
            ],
            [
                3911,
                3940
            ],
            [
                3940,
                3981
            ],
            [
                3981,
                4009
            ],
            [
                4009,
                4060
            ],
            [
                4060,
                4110
            ],
            [
                4110,
                4206
            ],
            [
                4206,
                4277
            ],
            [
                4277,
                4369
            ],
            [
                4369,
                4393
            ],
            [
                4393,
                4415
            ],
            [
                4415,
                4516
            ],
            [
                4516,
                4516
            ],
            [
                4516,
                4516
            ],
            [
                4516,
                4585
            ],
            [
                4585,
                4608
            ],
            [
                4608,
                4639
            ],
            [
                4639,
                4851
            ],
            [
                4851,
                4879
            ],
            [
                4879,
                5015
            ],
            [
                5015,
                5062
            ],
            [
                5062,
                5094
            ],
            [
                5094,
                5322
            ],
            [
                5322,
                5375
            ],
            [
                5375,
                5375
            ],
            [
                5375,
                5501
            ],
            [
                5501,
                5676
            ],
            [
                5676,
                5676
            ],
            [
                5676,
                5905
            ],
            [
                5905,
                5905
            ],
            [
                5905,
                5999
            ],
            [
                5999,
                6079
            ],
            [
                6079,
                6137
            ],
            [
                6137,
                6227
            ],
            [
                6227,
                6306
            ],
            [
                6306,
                6377
            ],
            [
                6377,
                6403
            ],
            [
                6403,
                6495
            ],
            [
                6495,
                6569
            ],
            [
                6569,
                6603
            ],
            [
                6603,
                6674
            ],
            [
                6674,
                6674
            ],
            [
                6674,
                6734
            ],
            [
                6734,
                6766
            ],
            [
                6766,
                6868
            ],
            [
                6868,
                6908
            ],
            [
                6908,
                7018
            ],
            [
                7018,
                7046
            ],
            [
                7046,
                7062
            ],
            [
                7062,
                7134
            ],
            [
                7134,
                7172
            ],
            [
                7172,
                7227
            ],
            [
                7227,
                7325
            ],
            [
                7325,
                7325
            ],
            [
                7325,
                7378
            ],
            [
                7378,
                7476
            ],
            [
                7476,
                7476
            ],
            [
                7476,
                7642
            ],
            [
                7642,
                7723
            ],
            [
                7723,
                7842
            ],
            [
                7842,
                8068
            ],
            [
                8068,
                8201
            ],
            [
                8201,
                8277
            ],
            [
                8277,
                8424
            ],
            [
                8424,
                8459
            ],
            [
                8459,
                8479
            ],
            [
                8479,
                8524
            ],
            [
                8524,
                8573
            ],
            [
                8573,
                8619
            ],
            [
                8619,
                8695
            ],
            [
                8695,
                8828
            ],
            [
                8828,
                9008
            ],
            [
                9008,
                9128
            ],
            [
                9128,
                9206
            ],
            [
                9206,
                9309
            ],
            [
                9309,
                9436
            ],
            [
                9436,
                9462
            ],
            [
                9462,
                9482
            ],
            [
                9482,
                9570
            ],
            [
                9570,
                9614
            ],
            [
                9614,
                9638
            ],
            [
                9638,
                9680
            ],
            [
                9680,
                9709
            ],
            [
                9709,
                9831
            ],
            [
                9831,
                9861
            ],
            [
                9861,
                9942
            ],
            [
                9942,
                9997
            ],
            [
                9997,
                10054
            ],
            [
                10054,
                10082
            ],
            [
                10082,
                10105
            ],
            [
                10105,
                10175
            ],
            [
                10175,
                10337
            ],
            [
                10337,
                10416
            ],
            [
                10416,
                10526
            ],
            [
                10526,
                10526
            ],
            [
                10526,
                10526
            ],
            [
                10526,
                10646
            ],
            [
                10646,
                10664
            ],
            [
                10664,
                10679
            ],
            [
                10679,
                10701
            ],
            [
                10701,
                10740
            ],
            [
                10740,
                10796
            ],
            [
                10796,
                10883
            ],
            [
                10883,
                10924
            ],
            [
                10924,
                10945
            ],
            [
                10945,
                11062
            ],
            [
                11062,
                11119
            ],
            [
                11119,
                11194
            ],
            [
                11194,
                11260
            ],
            [
                11260,
                11316
            ],
            [
                11316,
                11334
            ],
            [
                11334,
                11370
            ],
            [
                11370,
                11401
            ],
            [
                11401,
                11417
            ],
            [
                11417,
                11435
            ],
            [
                11435,
                11471
            ],
            [
                11471,
                11548
            ],
            [
                11548,
                11581
            ],
            [
                11581,
                11661
            ],
            [
                11661,
                11687
            ],
            [
                11687,
                11708
            ],
            [
                11708,
                11733
            ],
            [
                11733,
                11764
            ],
            [
                11764,
                11873
            ],
            [
                11873,
                11916
            ],
            [
                11916,
                11964
            ],
            [
                11964,
                11964
            ],
            [
                11964,
                12038
            ],
            [
                12038,
                12063
            ],
            [
                12063,
                12090
            ],
            [
                12090,
                12146
            ],
            [
                12146,
                12205
            ],
            [
                12205,
                12241
            ],
            [
                12241,
                12342
            ],
            [
                12342,
                12436
            ],
            [
                12436,
                12520
            ],
            [
                12520,
                12603
            ],
            [
                12603,
                12700
            ],
            [
                12700,
                12719
            ],
            [
                12719,
                12825
            ],
            [
                12825,
                12907
            ],
            [
                12907,
                12991
            ],
            [
                12991,
                13051
            ],
            [
                13051,
                13086
            ],
            [
                13086,
                13152
            ],
            [
                13152,
                13248
            ],
            [
                13248,
                13323
            ],
            [
                13323,
                13445
            ],
            [
                13445,
                13473
            ],
            [
                13473,
                13473
            ],
            [
                13473,
                13473
            ],
            [
                13473,
                13590
            ],
            [
                13590,
                13635
            ],
            [
                13635,
                13692
            ],
            [
                13692,
                13833
            ],
            [
                13833,
                13853
            ],
            [
                13853,
                13875
            ],
            [
                13875,
                14012
            ],
            [
                14012,
                14076
            ],
            [
                14076,
                14076
            ],
            [
                14076,
                14204
            ],
            [
                14204,
                14296
            ],
            [
                14296,
                14408
            ],
            [
                14408,
                14469
            ],
            [
                14469,
                14586
            ],
            [
                14586,
                14671
            ],
            [
                14671,
                14752
            ],
            [
                14752,
                14849
            ],
            [
                14849,
                14932
            ],
            [
                14932,
                14965
            ],
            [
                14965,
                14982
            ],
            [
                14982,
                15066
            ],
            [
                15066,
                15127
            ],
            [
                15127,
                15127
            ],
            [
                15127,
                15226
            ],
            [
                15226,
                15392
            ],
            [
                15392,
                15445
            ],
            [
                15445,
                15445
            ],
            [
                15445,
                15507
            ],
            [
                15507,
                15555
            ],
            [
                15555,
                15688
            ],
            [
                15688,
                15707
            ],
            [
                15707,
                15722
            ],
            [
                15722,
                15764
            ],
            [
                15764,
                15827
            ],
            [
                15827,
                15879
            ],
            [
                15879,
                15930
            ],
            [
                15930,
                15930
            ],
            [
                15930,
                16108
            ],
            [
                16108,
                16108
            ],
            [
                16108,
                16192
            ],
            [
                16192,
                16192
            ],
            [
                16192,
                16192
            ],
            [
                16192,
                16247
            ],
            [
                16247,
                16297
            ],
            [
                16297,
                16327
            ],
            [
                16327,
                16327
            ],
            [
                16327,
                16361
            ],
            [
                16361,
                16441
            ],
            [
                16441,
                16513
            ],
            [
                16513,
                16677
            ],
            [
                16677,
                16880
            ],
            [
                16880,
                16880
            ],
            [
                16880,
                16880
            ],
            [
                16880,
                16940
            ],
            [
                16940,
                17067
            ],
            [
                17067,
                17316
            ],
            [
                17316,
                17361
            ],
            [
                17361,
                17584
            ],
            [
                17584,
                17772
            ],
            [
                17772,
                17859
            ],
            [
                17859,
                17912
            ],
            [
                17912,
                17963
            ],
            [
                17963,
                18002
            ],
            [
                18002,
                18125
            ],
            [
                18125,
                18304
            ],
            [
                18304,
                18395
            ]
        ]
    }
}