{
    "original": {
        "text": "Alice found herself seated near to Lady Glencora's end of the table, and, in spite of her resolution to like Mr. Palliser, she was not sorry that such an arrangement had been made. Mr. Palliser had taken the Duchess out to dinner, and Alice wished to be as far removed as possible from her Grace. She found herself seated between her bespoken friend Jeffrey Palliser and the Duke, and as soon as she was seated Lady Glencora introduced her to her second neighbour. \"My cousin, Duke,\" Lady Glencora said, \"and a terrible Radical.\"\n\"Oh, indeed; I'm glad of that. We're sadly in want of a few leading Radicals, and perhaps I may be able to gain one now.\"\nAlice thought of her cousin George, and wished that he, instead of herself, was sitting next to the Duke of St. Bungay. \"But I'm afraid I never shall be a leading Radical,\" she said.\n\"You shall lead me at any rate, if you will,\" said he.\n\"As the little dogs lead the blind men,\" said Lady Glencora.\n\"No, Lady Glencora, not so. But as the pretty women lead the men who have eyes in their head. There is nothing I want so much, Miss Vavasor, as to become a Radical;--if I only knew how.\"\n\"I think it's very easy to know how,\" said Alice.\n\"Do you? I don't. I've voted for every liberal measure that has come seriously before Parliament since I had a seat in either House, and I've not been able to get beyond Whiggery yet.\"\n\"Have you voted for the ballot?\" asked Alice, almost trembling at her own audacity as she put the question.\n\"Well; no, I've not. And I suppose that is the crux. But the ballot has never been seriously brought before any House in which I have sat. I hate it with so keen a private hatred, that I doubt whether I could vote for it.\"\n\"But the Radicals love it,\" said Alice.\n\"Palliser,\" said the Duke, speaking loudly from his end of the table, \"I'm told you can never be entitled to call yourself a Radical till you've voted for the ballot.\"\n\"I don't want to be called a Radical,\" said Mr. Palliser,--\"or to be called anything at all.\"\n\"Except Chancellor of the Exchequer,\" said Lady Glencora in a low voice.\n\"And that's about the finest ambition by which a man can be moved,\" said the Duke. \"The man who can manage the purse-strings of this country can manage anything.\" Then that conversation dropped and the Duke ate his dinner.\n\"I was especially commissioned to amuse you,\" said Mr. Jeffrey Palliser to Alice. \"But when I undertook the task I had no conception that you would be calling Cabinet Ministers over the coals about their politics.\"\n\"I did nothing of the kind, surely, Mr. Palliser. I suppose all Radicals do vote for the ballot, and that's why I said it.\"\n\"Your definition was perfectly just, I dare say, only--\"\n\"Only what?\"\n\"Lady Glencora need not have been so anxious to provide specially for your amusement. Not but what I'm very much obliged to her,--of course. But Miss Vavasor, unfortunately I'm not a politician. I haven't a chance of a seat in the House, and so I despise politics.\"\n\"Women are not allowed to be politicians in this country.\"\n\"Thank God, they can't do much in that way;--not directly, I mean. Only think where we should be if we had a feminine House of Commons, with feminine debates, carried on, of course, with feminine courtesy. My cousins Iphy and Phemy there would of course be members. You don't know them yet?\"\n\"No; not yet. Are they politicians?\"\n\"Not especially. They have their tendencies, which are decidedly liberal. There has never been a Tory Palliser known, you know. But they are too clever to give themselves up to anything in which they can do nothing. Being women they live a depressed life, devoting themselves to literature, fine arts, social economy, and the abstract sciences. They write wonderful letters; but I believe their correspondence lists are quite full, so that you have no chance at present of getting on either of them.\"\n\"I haven't the slightest pretension to ask for such an honour.\"\n\"Oh! if you mean because you don't know them, that has nothing to do with it.\"\n\"But I have no claim either private or public.\"\n\"That has nothing to do with it either. They don't at all seek people of note as their correspondents. Free communication with all the world is their motto, and Rowland Hill is the god they worship. Only they have been forced to guard themselves against too great an accession of paper and ink. Are you fond of writing letters, Miss Vavasor?\"\n\"Yes, to my friends; but I like getting them better.\"\n\"I shrewdly suspect they don't read half what they get. Is it possible any one should go through two sheets of paper filled by our friend the Duchess there? No; their delight is in writing. They sit each at her desk after breakfast, and go on till lunch. There is a little rivalry between them, not expressed to each other, but visible to their friends. Iphy certainly does get off the greater number, and I'm told crosses quite as often as Phemy, but then she has the advantage of a bolder and larger hand.\"\n\"Do they write to you?\"\n\"Oh, dear no. I don't think they ever write to any relative. They don't discuss family affairs and such topics as that. Architecture goes a long way with them, and whether women ought to be clerks in public offices. Iphy has certain American correspondents that take up much of her time, but she acknowledges she does not read their letters.\"\n\"Then I certainly shall not write to her.\"\n\"But you are not American, I hope. I do hate the Americans. It's the only strong political feeling I have. I went there once, and found I couldn't live with them on any terms.\"\n\"But they please themselves. I don't see they are to be hated because they don't live after our fashion.\"\n\"Oh; it's jealousy of course. I know that. I didn't come across a cab-driver who wasn't a much better educated man than I am. And as for their women, they know everything. But I hated them, and I intend to hate them. You haven't been there?\"\n\"Oh no.\"\n\"Then I will make bold to say that any English lady who spent a month with them and didn't hate them would have very singular tastes. I begin to think they'll eat each other up, and then there'll come an entirely new set of people of a different sort. I always regarded the States as a Sodom and Gomorrah, prospering in wickedness, on which fire and brimstone were sure to fall sooner or later.\"\n\"I think that's wicked.\"\n\"I am wicked, as Topsy used to say. Do you hunt?\"\n\"No.\"\n\"Do you shoot?\"\n\"Shoot! What; with a gun?\"\n\"Yes. I was staying in a house last week with a lady who shot a good deal.\"\n\"No; I don't shoot.\"\n\"Do you ride?\"\n\"No; I wish I did. I have never ridden because I've no one to ride with me.\"\n\"Do you drive?\"\n\"No; I don't drive either.\"\n\"Then what do you do?\"\n\"I sit at home, and--\"\n\"Mend your stockings?\"\n\"No; I don't do that, because it's disagreeable; but I do work a good deal. Sometimes I have amused myself by reading.\"\n\"Ah; they never do that here. I have heard that there is a library, but the clue to it has been lost, and nobody now knows the way. I don't believe in libraries. Nobody ever goes into a library to read, any more than you would into a larder to eat. But there is this difference;--the food you consume does come out of the larders, but the books you read never come out of the libraries.\"\n\"Except Mudie's,\" said Alice.\n\"Ah, yes; he is the great librarian. And you mean to read all the time you are here, Miss Vavasor?\"\n\"I mean to walk about the priory ruins sometimes.\"\n\"Then you must go by moonlight, and I'll go with you. Only isn't it rather late in the year for that?\"\n\"I should think it is,--for you, Mr. Palliser.\"\nThen the Duke spoke to her again, and she found that she got on very well during dinner. But she could not but feel angry with herself in that she had any fear on the subject;--and yet she could not divest herself of that fear. She acknowledged to herself that she was conscious of a certain inferiority to Lady Glencora and to Mr. Jeffrey Palliser, which almost made her unhappy. As regarded the Duke on the other side of her, she had no such feeling. He was old enough to be her father, and was a Cabinet Minister; therefore he was entitled to her reverence. But how was it that she could not help accepting the other people round her as being indeed superior to herself? Was she really learning to believe that she could grow upwards by their sunlight?\n\"Jeffrey is a pleasant fellow, is he not?\" said Lady Glencora to her as they passed back through the billiard-room to the drawing-room.\n\"Very pleasant;--a little sarcastic, perhaps.\"\n\"I should think you would soon find yourself able to get the better of that if he tries it upon you,\" said Lady Glencora; and then the ladies were all in the drawing-room together.\n\"It is quite deliciously warm, coming from one room to another,\" said the Duchess, putting her emphasis on the \"one\" and the \"other.\"\n\"Then we had better keep continually moving,\" said a certain Mrs. Conway Sparkes, a literary lady, who had been very handsome, who was still very clever, who was not perhaps very good-natured, and of whom the Duchess of St. Bungay was rather afraid.\n\"I hope we may be warm here too,\" said Lady Glencora.\n\"But not deliciously warm,\" said Mrs. Conway Sparkes.\n\"It makes me tremble in every limb when Mrs. Sparkes attacks her,\" Lady Glencora said to Alice in Alice's own room that night, \"for I know she'll tell the Duke; and he'll tell that tall man with red hair whom you see standing about, and the tall man with red hair will tell Mr. Palliser, and then I shall catch it.\"\n\"And who is the tall man with red hair?\"\n\"He's a political link between the Duke and Mr. Palliser. His name is Bott, and he's a Member of Parliament.\"\n\"But why should he interfere?\"\n\"I suppose it's his business. I don't quite understand all the ins and outs of it. I believe he's to be one of Mr. Palliser's private secretaries if he becomes Chancellor of the Exchequer. Perhaps he doesn't tell;--only I think he does all the same. He always calls me Lady Glen-cowrer. He comes out of Lancashire, and made calico as long as he could get any cotton.\" But this happened in the bedroom, and we must go back for a while to the drawing-room.\nThe Duchess had made no answer to Mrs. Sparkes, and so nothing further was said about the warmth. Nor, indeed, was there any conversation that was comfortably general. The number of ladies in the room was too great for that, and ladies do not divide themselves nicely into small parties, as men and women do when they are mixed. Lady Glencora behaved pretty by telling the Duchess all about her pet pheasants; Mrs. Conway Sparkes told ill-natured tales of some one to Miss Euphemia Palliser; one of the Duchess's daughters walked off to a distant piano with an admiring friend and touched a few notes; while Iphigenia Palliser boldly took up a book, and placed herself at a table. Alice, who was sitting opposite to Lady Glencora, began to speculate whether she might do the same; but her courage failed her, and she sat on, telling herself that she was out of her element. \"Alice Vavasor,\" said Lady Glencora after a while, suddenly, and in a somewhat loud voice, \"can you play billiards?\"\n\"No,\" said Alice, rather startled.\n\"Then you shall learn to-night, and if nobody else will teach you, you shall be my pupil.\" Whereupon Lady Glencora rang the bell and ordered that the billiard-table might be got ready. \"You'll play, Duchess, of course,\" said Lady Glencora.\n\"It is so nice and warm, that I think I will,\" said the Duchess; but as she spoke she looked suspiciously to that part of the room where Mrs. Conway Sparkes was sitting.\n\"Let us all play,\" said Mrs. Conway Sparkes, \"and then it will be nicer,--and perhaps warmer, too.\"\nThe gentlemen joined them just as they were settling themselves round the table, and as many of them stayed there, the billiard-room became full. Alice had first a cue put into her hand, and making nothing of that was permitted to play with a mace. The duty of instructing her devolved on Jeffrey Palliser, and the next hour passed pleasantly;--not so pleasantly, she thought afterwards, as did some of those hours in Switzerland when her cousins were with her. After all, she could get more out of her life with such associates as them, than she could with any of these people at Matching. She felt quite sure of that;--though Jeffrey Palliser did take great trouble to teach her the game, and once or twice made her laugh heartily by quizzing the Duchess's attitude as she stood up to make her stroke.\n\"I wish I could play billiards,\" said Mrs. Sparkes, on one of these occasions; \"I do indeed.\"\n\"I thought you said you were coming to play,\" said the Duchess, almost majestically, and with a tone of triumph evidently produced by her own successes.\n\"Only to see your Grace,\" said Mrs. Sparkes.\n\"I don't know that there is anything more to see in me than in anybody else,\" said the Duchess. \"Mr. Palliser, that was a cannon. Will you mark that for our side?\"\n[Illustration: \"Mr. Palliser, that was a cannon.\"]\n\"Oh no, Duchess, you hit the same ball twice.\"\n\"Very well;--then I suppose Miss Vavasor plays now. That was a miss. Will you mark that, if you please?\" This latter demand was made with great stress, as though she had been defrauded in the matter of the cannon, and was obeyed. Before long, the Duchess, with her partner, Lady Glencora, won the game,--which fact, however, was, I think, owing rather to Alice's ignorance than to her Grace's skill. The Duchess, however, was very triumphant, and made her way back into the drawing-room with a step which seemed to declare loudly that she had trumped Mrs. Sparkes at last.\nNot long after this the ladies went up-stairs on their way to bed. Many of them, perhaps, did not go to their pillows at once, as it was as yet not eleven o'clock, and it was past ten when they all came down to breakfast. At any rate, Alice, who had been up at seven, did not go to bed then, nor for the next two hours. \"I'll come into your room just for one minute,\" Lady Glencora said as she passed on from the door to her own room; and in about five minutes she was back with her cousin. \"Would you mind going into my room--it's just there, and sitting with Ellen for a minute?\" This Lady Glencora said in the sweetest possible tone to the girl who was waiting on Alice; and then, when they were alone together, she got into a little chair by the fireside and prepared herself for conversation.\n\"I must keep you up for a quarter of an hour while I tell you something. But first of all, how do you like the people? Will you be able to be comfortable with them?\" Alice of course said that she thought she would; and then there came that little discussion in which the duties of Mr. Bott, the man with the red hair, were described.\n\"But I've got something to tell you,\" said Lady Glencora, when they had already been there some twenty minutes. \"Sit down opposite to me, and look at the fire while I look at you.\"\n\"Is it anything terrible?\"\n\"It's nothing wrong.\"\n\"Oh, Lady Glencora, if it's--\"\n\"I won't have you call me Lady Glencora. Don't I call you Alice? Why are you so unkind to me? I have not come to you now asking you to do for me anything that you ought not to do.\"\n\"But you are going to tell me something.\" Alice felt sure that the thing to be told would have some reference to Mr. Fitzgerald, and she did not wish to hear Mr. Fitzgerald's name from her cousin's lips.\n\"Tell you something;--of course I am. I'm going to tell you that,--that in writing to you the other day I wrote a fib. But it wasn't that I wished to deceive you;--only I couldn't say it all in a letter.\"\n\"Say all what?\"\n\"You know I confessed that I had been very bad in not coming to you in London last year.\"\n\"I never thought of it for a moment.\"\n\"You did not care whether I came or not: was that it? But never mind. Why should you have cared? But I cared. I told you in my letter that I didn't come because I had so many things on hand. Of course that was a fib.\"\n\"Everybody makes excuses of that kind,\" said Alice.\n\"But they don't make them to the very people of all others whom they want to know and love. I was longing to come to you every day. But I feared I could not come without speaking of him;--and I had determined never to speak of him again.\" This she said in that peculiar low voice which she assumed at times.\n\"Then why do it now, Lady Glencora?\"\n\"I won't be called Lady Glencora. Call me Cora. I had a sister once, older than I, and she used to call me Cora. If she had lived--. But never mind that now. She didn't live. I'll tell you why I do it now. Because I cannot help it. Besides, I've met him. I've been in the same room with him, and have spoken to him. What's the good of any such resolution now?\"\n\"And you have met him?\"\n\"Yes; he--Mr. Palliser--knew all about it. When he talked of taking me to the house, I whispered to him that I thought Burgo would be there.\"\n\"Do not call him by his Christian name,\" said Alice, almost with a shudder.\n\"Why not?--why not his Christian name? I did when I told my husband. Or perhaps I said Burgo Fitzgerald.\"\n\"Well.\"\n\"And he bade me go. He said it didn't signify, and that I had better learn to bear it. Bear it, indeed! If I am to meet him, and speak to him, and look at him, surely I may mention his name.\" And then she paused for an answer. \"May I not?\"\n\"What am I to say?\" exclaimed Alice.\n\"Anything you please, that's not a falsehood. But I've got you here because I don't think you will tell a falsehood. Oh, Alice, I do so want to go right, and it is so hard!\"\nHard, indeed, poor creature, for one so weighted as she had been, and sent out into the world with so small advantages of previous training or of present friendship! Alice began to feel now that she had been enticed to Matching Priory because her cousin wanted a friend, and of course she could not refuse to give the friendship that was asked from her. She got up from her chair, and kneeling down at the other's feet put up her face and kissed her.\n\"I knew you would be good to me,\" said Lady Glencora. \"I knew you would. And you may say whatever you like. But I could not bear that you should not know the real reason why I neither came to you nor sent for you after we went to London. You'll come to me now; won't you, dear?\"\n\"Yes;--and you'll come to me,\" said Alice, making in her mind a sort of bargain that she was not to be received into Mr. Palliser's house after the fashion in which Lady Midlothian had proposed to receive her. But it struck her at once that this was unworthy of her, and ungenerous. \"But I'll come to you,\" she added, \"whether you come to me or not.\"\n\"I will go to you,\" said Lady Glencora, \"of course,--why shouldn't I? But you know what I mean. We shall have dinners and parties and lots of people.\"\n\"And we shall have none,\" said Alice, smiling.\n\"And therefore there is so much more excuse for your coming to me;--or rather I mean so much more reason, for I don't want excuses. Well, dear, I'm so glad I've told you. I was afraid to see you in London. I should hardly have known how to look at you then. But I've got over that now.\" Then she smiled and returned the kiss which Alice had given her. It was singular to see her standing on the bedroom rug with all her magnificence of dress, but with her hair pushed back behind her ears, and her eyes red with tears,--as though the burden of the magnificence remained to her after its purpose was over.\n\"I declare it's ever so much past twelve. Good night, now, dear. I wonder whether he's come up. But I should have heard his step if he had. He never treads lightly. He seldom gives over work till after one, and sometimes goes on till three. It's the only thing he likes, I believe. God bless you! good night. I've such a deal more to say to you; and Alice, you must tell me something about yourself, too; won't you, dear?\" Then without waiting for an answer Lady Glencora went, leaving Alice in a maze of bewilderment. She could hardly believe that all she had heard, and all she had done, had happened since she left Queen Anne Street that morning.",
        "paragraph_chars": [
            [
                0,
                530
            ],
            [
                530,
                652
            ],
            [
                652,
                835
            ],
            [
                835,
                890
            ],
            [
                890,
                951
            ],
            [
                951,
                1138
            ],
            [
                1138,
                1188
            ],
            [
                1188,
                1373
            ],
            [
                1373,
                1481
            ],
            [
                1481,
                1704
            ],
            [
                1704,
                1744
            ],
            [
                1744,
                1912
            ],
            [
                1912,
                2006
            ],
            [
                2006,
                2079
            ],
            [
                2079,
                2302
            ],
            [
                2302,
                2517
            ],
            [
                2517,
                2641
            ],
            [
                2641,
                2698
            ],
            [
                2698,
                2711
            ],
            [
                2711,
                2977
            ],
            [
                2977,
                3036
            ],
            [
                3036,
                3328
            ],
            [
                3328,
                3365
            ],
            [
                3365,
                3866
            ],
            [
                3866,
                3930
            ],
            [
                3930,
                4009
            ],
            [
                4009,
                4057
            ],
            [
                4057,
                4400
            ],
            [
                4400,
                4454
            ],
            [
                4454,
                4963
            ],
            [
                4963,
                4987
            ],
            [
                4987,
                5330
            ],
            [
                5330,
                5373
            ],
            [
                5373,
                5550
            ],
            [
                5550,
                5656
            ],
            [
                5656,
                5898
            ],
            [
                5898,
                5907
            ],
            [
                5907,
                6303
            ],
            [
                6303,
                6328
            ],
            [
                6328,
                6378
            ],
            [
                6378,
                6384
            ],
            [
                6384,
                6400
            ],
            [
                6400,
                6427
            ],
            [
                6427,
                6503
            ],
            [
                6503,
                6524
            ],
            [
                6524,
                6539
            ],
            [
                6539,
                6616
            ],
            [
                6616,
                6632
            ],
            [
                6632,
                6660
            ],
            [
                6660,
                6683
            ],
            [
                6683,
                6706
            ],
            [
                6706,
                6729
            ],
            [
                6729,
                6849
            ],
            [
                6849,
                7237
            ],
            [
                7237,
                7267
            ],
            [
                7267,
                7367
            ],
            [
                7367,
                7418
            ],
            [
                7418,
                7521
            ],
            [
                7521,
                7569
            ],
            [
                7569,
                8325
            ],
            [
                8325,
                8461
            ],
            [
                8461,
                8508
            ],
            [
                8508,
                8689
            ],
            [
                8689,
                8823
            ],
            [
                8823,
                9073
            ],
            [
                9073,
                9127
            ],
            [
                9127,
                9181
            ],
            [
                9181,
                9497
            ],
            [
                9497,
                9538
            ],
            [
                9538,
                9648
            ],
            [
                9648,
                9679
            ],
            [
                9679,
                10134
            ],
            [
                10134,
                11125
            ],
            [
                11125,
                11160
            ],
            [
                11160,
                11400
            ],
            [
                11400,
                11570
            ],
            [
                11570,
                11670
            ],
            [
                11670,
                12474
            ],
            [
                12474,
                12568
            ],
            [
                12568,
                12721
            ],
            [
                12721,
                12766
            ],
            [
                12766,
                12930
            ],
            [
                12930,
                12981
            ],
            [
                12981,
                13028
            ],
            [
                13028,
                13601
            ],
            [
                13601,
                14399
            ],
            [
                14399,
                14733
            ],
            [
                14733,
                14914
            ],
            [
                14914,
                14941
            ],
            [
                14941,
                14963
            ],
            [
                14963,
                14994
            ],
            [
                14994,
                15175
            ],
            [
                15175,
                15379
            ],
            [
                15379,
                15584
            ],
            [
                15584,
                15600
            ],
            [
                15600,
                15690
            ],
            [
                15690,
                15728
            ],
            [
                15728,
                15946
            ],
            [
                15946,
                15998
            ],
            [
                15998,
                16306
            ],
            [
                16306,
                16343
            ],
            [
                16343,
                16704
            ],
            [
                16704,
                16728
            ],
            [
                16728,
                16870
            ],
            [
                16870,
                16946
            ],
            [
                16946,
                17052
            ],
            [
                17052,
                17060
            ],
            [
                17060,
                17300
            ],
            [
                17300,
                17337
            ],
            [
                17337,
                17511
            ],
            [
                17511,
                17962
            ],
            [
                17962,
                18241
            ],
            [
                18241,
                18592
            ],
            [
                18592,
                18743
            ],
            [
                18743,
                18790
            ],
            [
                18790,
                19395
            ],
            [
                19395,
                20044
            ]
        ],
        "segment_chars": [
            [
                0,
                181
            ],
            [
                181,
                297
            ],
            [
                297,
                465
            ],
            [
                465,
                530
            ],
            [
                530,
                561
            ],
            [
                561,
                652
            ],
            [
                652,
                772
            ],
            [
                772,
                835
            ],
            [
                835,
                890
            ],
            [
                890,
                951
            ],
            [
                951,
                979
            ],
            [
                979,
                1045
            ],
            [
                1045,
                1138
            ],
            [
                1138,
                1188
            ],
            [
                1188,
                1197
            ],
            [
                1197,
                1206
            ],
            [
                1206,
                1373
            ],
            [
                1373,
                1406
            ],
            [
                1406,
                1481
            ],
            [
                1481,
                1502
            ],
            [
                1502,
                1534
            ],
            [
                1534,
                1620
            ],
            [
                1620,
                1704
            ],
            [
                1704,
                1744
            ],
            [
                1744,
                1912
            ],
            [
                1912,
                2006
            ],
            [
                2006,
                2079
            ],
            [
                2079,
                2162
            ],
            [
                2162,
                2242
            ],
            [
                2242,
                2302
            ],
            [
                2302,
                2384
            ],
            [
                2384,
                2517
            ],
            [
                2517,
                2567
            ],
            [
                2567,
                2641
            ],
            [
                2641,
                2698
            ],
            [
                2698,
                2711
            ],
            [
                2711,
                2797
            ],
            [
                2797,
                2852
            ],
            [
                2852,
                2906
            ],
            [
                2906,
                2977
            ],
            [
                2977,
                3036
            ],
            [
                3036,
                3103
            ],
            [
                3103,
                3242
            ],
            [
                3242,
                3302
            ],
            [
                3302,
                3328
            ],
            [
                3328,
                3342
            ],
            [
                3342,
                3365
            ],
            [
                3365,
                3382
            ],
            [
                3382,
                3439
            ],
            [
                3439,
                3493
            ],
            [
                3493,
                3581
            ],
            [
                3581,
                3710
            ],
            [
                3710,
                3866
            ],
            [
                3866,
                3930
            ],
            [
                3930,
                3935
            ],
            [
                3935,
                4009
            ],
            [
                4009,
                4057
            ],
            [
                4057,
                4097
            ],
            [
                4097,
                4160
            ],
            [
                4160,
                4256
            ],
            [
                4256,
                4352
            ],
            [
                4352,
                4400
            ],
            [
                4400,
                4454
            ],
            [
                4454,
                4510
            ],
            [
                4510,
                4611
            ],
            [
                4611,
                4644
            ],
            [
                4644,
                4709
            ],
            [
                4709,
                4808
            ],
            [
                4808,
                4963
            ],
            [
                4963,
                4987
            ],
            [
                4987,
                5001
            ],
            [
                5001,
                5048
            ],
            [
                5048,
                5107
            ],
            [
                5107,
                5203
            ],
            [
                5203,
                5330
            ],
            [
                5330,
                5373
            ],
            [
                5373,
                5408
            ],
            [
                5408,
                5433
            ],
            [
                5433,
                5480
            ],
            [
                5480,
                5550
            ],
            [
                5550,
                5579
            ],
            [
                5579,
                5656
            ],
            [
                5656,
                5686
            ],
            [
                5686,
                5699
            ],
            [
                5699,
                5782
            ],
            [
                5782,
                5828
            ],
            [
                5828,
                5873
            ],
            [
                5873,
                5898
            ],
            [
                5898,
                5907
            ],
            [
                5907,
                6041
            ],
            [
                6041,
                6159
            ],
            [
                6159,
                6303
            ],
            [
                6303,
                6328
            ],
            [
                6328,
                6364
            ],
            [
                6364,
                6378
            ],
            [
                6378,
                6384
            ],
            [
                6384,
                6400
            ],
            [
                6400,
                6408
            ],
            [
                6408,
                6427
            ],
            [
                6427,
                6433
            ],
            [
                6433,
                6503
            ],
            [
                6503,
                6524
            ],
            [
                6524,
                6539
            ],
            [
                6539,
                6558
            ],
            [
                6558,
                6616
            ],
            [
                6616,
                6632
            ],
            [
                6632,
                6660
            ],
            [
                6660,
                6683
            ],
            [
                6683,
                6706
            ],
            [
                6706,
                6729
            ],
            [
                6729,
                6805
            ],
            [
                6805,
                6849
            ],
            [
                6849,
                6879
            ],
            [
                6879,
                6981
            ],
            [
                6981,
                7011
            ],
            [
                7011,
                7098
            ],
            [
                7098,
                7237
            ],
            [
                7237,
                7267
            ],
            [
                7267,
                7304
            ],
            [
                7304,
                7367
            ],
            [
                7367,
                7418
            ],
            [
                7418,
                7472
            ],
            [
                7472,
                7521
            ],
            [
                7521,
                7569
            ],
            [
                7569,
                7658
            ],
            [
                7658,
                7797
            ],
            [
                7797,
                7950
            ],
            [
                7950,
                8022
            ],
            [
                8022,
                8130
            ],
            [
                8130,
                8243
            ],
            [
                8243,
                8325
            ],
            [
                8325,
                8368
            ],
            [
                8368,
                8461
            ],
            [
                8461,
                8508
            ],
            [
                8508,
                8689
            ],
            [
                8689,
                8823
            ],
            [
                8823,
                9073
            ],
            [
                9073,
                9127
            ],
            [
                9127,
                9181
            ],
            [
                9181,
                9497
            ],
            [
                9497,
                9538
            ],
            [
                9538,
                9596
            ],
            [
                9596,
                9648
            ],
            [
                9648,
                9679
            ],
            [
                9679,
                9709
            ],
            [
                9709,
                9762
            ],
            [
                9762,
                9868
            ],
            [
                9868,
                9929
            ],
            [
                9929,
                9966
            ],
            [
                9966,
                10047
            ],
            [
                10047,
                10134
            ],
            [
                10134,
                10232
            ],
            [
                10232,
                10302
            ],
            [
                10302,
                10463
            ],
            [
                10463,
                10815
            ],
            [
                10815,
                11008
            ],
            [
                11008,
                11125
            ],
            [
                11125,
                11160
            ],
            [
                11160,
                11251
            ],
            [
                11251,
                11345
            ],
            [
                11345,
                11400
            ],
            [
                11400,
                11570
            ],
            [
                11570,
                11670
            ],
            [
                11670,
                11816
            ],
            [
                11816,
                11919
            ],
            [
                11919,
                12132
            ],
            [
                12132,
                12261
            ],
            [
                12261,
                12474
            ],
            [
                12474,
                12568
            ],
            [
                12568,
                12721
            ],
            [
                12721,
                12766
            ],
            [
                12766,
                12862
            ],
            [
                12862,
                12896
            ],
            [
                12896,
                12930
            ],
            [
                12930,
                12981
            ],
            [
                12981,
                13028
            ],
            [
                13028,
                13080
            ],
            [
                13080,
                13097
            ],
            [
                13097,
                13133
            ],
            [
                13133,
                13258
            ],
            [
                13258,
                13428
            ],
            [
                13428,
                13601
            ],
            [
                13601,
                13668
            ],
            [
                13668,
                13823
            ],
            [
                13823,
                13921
            ],
            [
                13921,
                14092
            ],
            [
                14092,
                14183
            ],
            [
                14183,
                14399
            ],
            [
                14399,
                14472
            ],
            [
                14472,
                14518
            ],
            [
                14518,
                14565
            ],
            [
                14565,
                14733
            ],
            [
                14733,
                14845
            ],
            [
                14845,
                14914
            ],
            [
                14914,
                14941
            ],
            [
                14941,
                14963
            ],
            [
                14963,
                14994
            ],
            [
                14994,
                15035
            ],
            [
                15035,
                15059
            ],
            [
                15059,
                15088
            ],
            [
                15088,
                15175
            ],
            [
                15175,
                15217
            ],
            [
                15217,
                15379
            ],
            [
                15379,
                15417
            ],
            [
                15417,
                15498
            ],
            [
                15498,
                15584
            ],
            [
                15584,
                15600
            ],
            [
                15600,
                15690
            ],
            [
                15690,
                15728
            ],
            [
                15728,
                15782
            ],
            [
                15782,
                15798
            ],
            [
                15798,
                15825
            ],
            [
                15825,
                15838
            ],
            [
                15838,
                15919
            ],
            [
                15919,
                15946
            ],
            [
                15946,
                15998
            ],
            [
                15998,
                16090
            ],
            [
                16090,
                16130
            ],
            [
                16130,
                16237
            ],
            [
                16237,
                16306
            ],
            [
                16306,
                16343
            ],
            [
                16343,
                16377
            ],
            [
                16377,
                16391
            ],
            [
                16391,
                16456
            ],
            [
                16456,
                16476
            ],
            [
                16476,
                16501
            ],
            [
                16501,
                16518
            ],
            [
                16518,
                16549
            ],
            [
                16549,
                16575
            ],
            [
                16575,
                16598
            ],
            [
                16598,
                16659
            ],
            [
                16659,
                16704
            ],
            [
                16704,
                16728
            ],
            [
                16728,
                16771
            ],
            [
                16771,
                16870
            ],
            [
                16870,
                16946
            ],
            [
                16946,
                16985
            ],
            [
                16985,
                17015
            ],
            [
                17015,
                17052
            ],
            [
                17052,
                17060
            ],
            [
                17060,
                17080
            ],
            [
                17080,
                17147
            ],
            [
                17147,
                17164
            ],
            [
                17164,
                17252
            ],
            [
                17252,
                17287
            ],
            [
                17287,
                17300
            ],
            [
                17300,
                17320
            ],
            [
                17320,
                17337
            ],
            [
                17337,
                17383
            ],
            [
                17383,
                17454
            ],
            [
                17454,
                17511
            ],
            [
                17511,
                17677
            ],
            [
                17677,
                17865
            ],
            [
                17865,
                17962
            ],
            [
                17962,
                18016
            ],
            [
                18016,
                18035
            ],
            [
                18035,
                18070
            ],
            [
                18070,
                18200
            ],
            [
                18200,
                18241
            ],
            [
                18241,
                18451
            ],
            [
                18451,
                18524
            ],
            [
                18524,
                18592
            ],
            [
                18592,
                18662
            ],
            [
                18662,
                18688
            ],
            [
                18688,
                18743
            ],
            [
                18743,
                18790
            ],
            [
                18790,
                18922
            ],
            [
                18922,
                18961
            ],
            [
                18961,
                18996
            ],
            [
                18996,
                19048
            ],
            [
                19048,
                19077
            ],
            [
                19077,
                19142
            ],
            [
                19142,
                19395
            ],
            [
                19395,
                19437
            ],
            [
                19437,
                19460
            ],
            [
                19460,
                19491
            ],
            [
                19491,
                19535
            ],
            [
                19535,
                19560
            ],
            [
                19560,
                19636
            ],
            [
                19636,
                19677
            ],
            [
                19677,
                19692
            ],
            [
                19692,
                19704
            ],
            [
                19704,
                19818
            ],
            [
                19818,
                19914
            ],
            [
                19914,
                20044
            ]
        ],
        "overlap_chars": [
            [
                0,
                31
            ],
            [
                35,
                68
            ],
            [
                322,
                329
            ],
            [
                350,
                379
            ],
            [
                83,
                85
            ],
            [
                111,
                112
            ],
            [
                72,
                73
            ],
            [
                32,
                34
            ],
            [
                411,
                439
            ],
            [
                179,
                180
            ],
            [
                465,
                530
            ],
            [
                530,
                561
            ],
            [
                561,
                606
            ],
            [
                649,
                652
            ],
            [
                652,
                706
            ],
            [
                728,
                739
            ],
            [
                770,
                772
            ],
            [
                772,
                835
            ],
            [
                835,
                839
            ],
            [
                846,
                865
            ],
            [
                878,
                890
            ],
            [
                890,
                893
            ],
            [
                898,
                914
            ],
            [
                919,
                951
            ],
            [
                951,
                970
            ],
            [
                983,
                1045
            ],
            [
                1045,
                1115
            ],
            [
                1117,
                1138
            ],
            [
                1138,
                1188
            ],
            [
                1188,
                1197
            ],
            [
                1197,
                1206
            ],
            [
                1206,
                1226
            ],
            [
                1227,
                1256
            ],
            [
                1267,
                1373
            ],
            [
                1373,
                1396
            ],
            [
                1397,
                1406
            ],
            [
                1406,
                1455
            ],
            [
                1479,
                1481
            ],
            [
                1481,
                1502
            ],
            [
                1502,
                1534
            ],
            [
                1620,
                1704
            ],
            [
                1704,
                1744
            ],
            [
                1744,
                1786
            ],
            [
                1803,
                1837
            ],
            [
                1853,
                1912
            ],
            [
                1912,
                1969
            ],
            [
                1971,
                2006
            ],
            [
                2006,
                2079
            ],
            [
                2079,
                2116
            ],
            [
                2126,
                2135
            ],
            [
                2144,
                2162
            ],
            [
                2162,
                2242
            ],
            [
                2242,
                2246
            ],
            [
                2277,
                2302
            ],
            [
                2302,
                2303
            ],
            [
                2389,
                2405
            ],
            [
                2333,
                2382
            ],
            [
                2384,
                2385
            ],
            [
                2415,
                2423
            ],
            [
                2435,
                2452
            ],
            [
                2461,
                2517
            ],
            [
                2517,
                2567
            ],
            [
                2567,
                2641
            ],
            [
                2641,
                2642
            ],
            [
                2852,
                2855
            ],
            [
                2870,
                2906
            ],
            [
                2906,
                2977
            ],
            [
                2977,
                3036
            ],
            [
                3103,
                3205
            ],
            [
                3218,
                3242
            ],
            [
                3242,
                3302
            ],
            [
                3302,
                3328
            ],
            [
                3328,
                3340
            ],
            [
                3382,
                3391
            ],
            [
                3420,
                3437
            ],
            [
                3398,
                3408
            ],
            [
                3437,
                3439
            ],
            [
                3439,
                3475
            ],
            [
                3481,
                3493
            ],
            [
                3493,
                3581
            ],
            [
                3581,
                3710
            ],
            [
                3710,
                3823
            ],
            [
                3835,
                3866
            ],
            [
                3866,
                3930
            ],
            [
                3930,
                3935
            ],
            [
                3955,
                3964
            ],
            [
                3993,
                3995
            ],
            [
                3965,
                3974
            ],
            [
                4160,
                4212
            ],
            [
                4254,
                4256
            ],
            [
                4352,
                4400
            ],
            [
                4400,
                4439
            ],
            [
                4445,
                4454
            ],
            [
                4454,
                4456
            ],
            [
                4466,
                4510
            ],
            [
                4543,
                4611
            ],
            [
                4611,
                4642
            ],
            [
                4685,
                4686
            ],
            [
                4707,
                4709
            ],
            [
                4709,
                4747
            ],
            [
                4806,
                4808
            ],
            [
                4808,
                4827
            ],
            [
                4832,
                4835
            ],
            [
                4960,
                4963
            ],
            [
                4963,
                4987
            ],
            [
                4987,
                5001
            ],
            [
                5001,
                5048
            ],
            [
                5048,
                5107
            ],
            [
                5203,
                5243
            ],
            [
                5273,
                5330
            ],
            [
                5330,
                5373
            ],
            [
                5373,
                5408
            ],
            [
                5408,
                5433
            ],
            [
                5433,
                5480
            ],
            [
                5480,
                5534
            ],
            [
                5547,
                5550
            ],
            [
                5579,
                5656
            ],
            [
                5656,
                5686
            ],
            [
                5686,
                5699
            ],
            [
                5699,
                5732
            ],
            [
                5733,
                5743
            ],
            [
                5751,
                5766
            ],
            [
                5771,
                5782
            ],
            [
                5782,
                5828
            ],
            [
                5828,
                5831
            ],
            [
                5850,
                5873
            ],
            [
                5873,
                5898
            ],
            [
                5898,
                5907
            ],
            [
                5907,
                6041
            ],
            [
                6364,
                6378
            ],
            [
                6378,
                6384
            ],
            [
                6384,
                6400
            ],
            [
                6400,
                6408
            ],
            [
                6504,
                6524
            ],
            [
                6524,
                6539
            ],
            [
                6539,
                6556
            ],
            [
                6616,
                6632
            ],
            [
                6632,
                6660
            ],
            [
                6660,
                6683
            ],
            [
                6683,
                6702
            ],
            [
                6706,
                6729
            ],
            [
                6729,
                6750
            ],
            [
                6778,
                6786
            ],
            [
                6787,
                6805
            ],
            [
                6805,
                6849
            ],
            [
                6849,
                6879
            ],
            [
                6879,
                6981
            ],
            [
                6981,
                7011
            ],
            [
                7308,
                7367
            ],
            [
                7367,
                7418
            ],
            [
                7418,
                7472
            ],
            [
                7472,
                7521
            ],
            [
                7521,
                7542
            ],
            [
                7545,
                7569
            ],
            [
                7569,
                7658
            ],
            [
                7662,
                7675
            ],
            [
                7680,
                7703
            ],
            [
                7720,
                7728
            ],
            [
                7743,
                7744
            ],
            [
                7746,
                7767
            ],
            [
                7786,
                7797
            ],
            [
                7830,
                7893
            ],
            [
                7897,
                7950
            ],
            [
                7950,
                7970
            ],
            [
                7995,
                8022
            ],
            [
                8022,
                8130
            ],
            [
                8130,
                8133
            ],
            [
                8150,
                8153
            ],
            [
                8145,
                8149
            ],
            [
                8179,
                8182
            ],
            [
                8189,
                8205
            ],
            [
                8215,
                8243
            ],
            [
                8243,
                8325
            ],
            [
                8325,
                8368
            ],
            [
                8368,
                8401
            ],
            [
                8440,
                8461
            ],
            [
                8461,
                8476
            ],
            [
                8478,
                8508
            ],
            [
                8508,
                8510
            ],
            [
                8518,
                8533
            ],
            [
                8553,
                8598
            ],
            [
                8604,
                8654
            ],
            [
                8659,
                8678
            ],
            [
                8687,
                8689
            ],
            [
                8689,
                8718
            ],
            [
                8796,
                8799
            ],
            [
                8751,
                8770
            ],
            [
                8823,
                8847
            ],
            [
                8860,
                8906
            ],
            [
                8964,
                8975
            ],
            [
                8907,
                8921
            ],
            [
                9020,
                9073
            ],
            [
                9073,
                9127
            ],
            [
                9127,
                9181
            ],
            [
                9181,
                9241
            ],
            [
                9418,
                9421
            ],
            [
                9245,
                9286
            ],
            [
                9291,
                9417
            ],
            [
                9445,
                9497
            ],
            [
                9497,
                9538
            ],
            [
                9538,
                9596
            ],
            [
                9596,
                9648
            ],
            [
                9648,
                9679
            ],
            [
                9679,
                9709
            ],
            [
                9762,
                9868
            ],
            [
                9868,
                9892
            ],
            [
                9894,
                9914
            ],
            [
                9927,
                9929
            ],
            [
                9929,
                9966
            ],
            [
                9966,
                9974
            ],
            [
                9982,
                9997
            ],
            [
                10003,
                10009
            ],
            [
                10044,
                10047
            ],
            [
                10047,
                10134
            ],
            [
                10249,
                10254
            ],
            [
                10245,
                10248
            ],
            [
                10293,
                10300
            ],
            [
                10259,
                10271
            ],
            [
                10300,
                10302
            ],
            [
                10302,
                10357
            ],
            [
                10461,
                10463
            ],
            [
                10463,
                10484
            ],
            [
                10495,
                10589
            ],
            [
                10599,
                10691
            ],
            [
                10704,
                10814
            ],
            [
                10815,
                10820
            ],
            [
                10884,
                10913
            ],
            [
                10820,
                10821
            ],
            [
                10915,
                10958
            ],
            [
                10988,
                11007
            ],
            [
                11008,
                11067
            ],
            [
                11069,
                11072
            ],
            [
                11097,
                11125
            ],
            [
                11125,
                11160
            ],
            [
                11160,
                11181
            ],
            [
                11248,
                11251
            ],
            [
                11251,
                11345
            ],
            [
                11345,
                11379
            ],
            [
                11380,
                11384
            ],
            [
                11398,
                11400
            ],
            [
                11400,
                11505
            ],
            [
                11537,
                11556
            ],
            [
                11568,
                11570
            ],
            [
                11570,
                11641
            ],
            [
                11644,
                11670
            ],
            [
                11670,
                11695
            ],
            [
                11701,
                11777
            ],
            [
                11783,
                11816
            ],
            [
                11919,
                11942
            ],
            [
                11959,
                12013
            ],
            [
                12015,
                12032
            ],
            [
                12058,
                12060
            ],
            [
                12065,
                12099
            ],
            [
                12122,
                12130
            ],
            [
                12109,
                12116
            ],
            [
                12130,
                12132
            ],
            [
                12298,
                12314
            ],
            [
                12324,
                12350
            ],
            [
                12359,
                12393
            ],
            [
                12403,
                12474
            ],
            [
                12474,
                12524
            ],
            [
                12568,
                12631
            ],
            [
                12657,
                12679
            ],
            [
                12702,
                12721
            ],
            [
                12721,
                12766
            ],
            [
                12766,
                12802
            ],
            [
                12808,
                12814
            ],
            [
                12841,
                12862
            ],
            [
                12862,
                12896
            ],
            [
                12896,
                12930
            ],
            [
                12981,
                13028
            ],
            [
                13028,
                13039
            ],
            [
                13041,
                13080
            ],
            [
                13097,
                13110
            ],
            [
                13089,
                13095
            ],
            [
                13115,
                13133
            ],
            [
                13258,
                13330
            ],
            [
                13471,
                13550
            ],
            [
                13558,
                13601
            ],
            [
                13601,
                13636
            ],
            [
                13660,
                13667
            ],
            [
                13921,
                13987
            ],
            [
                14019,
                14021
            ],
            [
                14268,
                14278
            ],
            [
                14010,
                14013
            ],
            [
                14314,
                14319
            ],
            [
                14344,
                14359
            ],
            [
                14397,
                14399
            ],
            [
                14399,
                14470
            ],
            [
                14470,
                14472
            ],
            [
                14472,
                14518
            ],
            [
                14518,
                14526
            ],
            [
                14538,
                14564
            ],
            [
                14565,
                14656
            ],
            [
                14680,
                14715
            ],
            [
                14731,
                14733
            ],
            [
                14733,
                14789
            ],
            [
                14843,
                14845
            ],
            [
                14845,
                14846
            ],
            [
                14875,
                14899
            ],
            [
                14911,
                14914
            ],
            [
                14914,
                14941
            ],
            [
                14941,
                14963
            ],
            [
                14963,
                14990
            ],
            [
                14994,
                14995
            ],
            [
                15000,
                15002
            ],
            [
                15012,
                15035
            ],
            [
                15035,
                15059
            ],
            [
                15059,
                15080
            ],
            [
                15086,
                15088
            ],
            [
                15088,
                15089
            ],
            [
                15095,
                15098
            ],
            [
                15115,
                15131
            ],
            [
                15139,
                15175
            ],
            [
                15175,
                15217
            ],
            [
                15217,
                15237
            ],
            [
                15259,
                15264
            ],
            [
                15251,
                15253
            ],
            [
                15288,
                15302
            ],
            [
                15377,
                15379
            ],
            [
                15379,
                15380
            ],
            [
                15401,
                15417
            ],
            [
                15417,
                15438
            ],
            [
                15446,
                15498
            ],
            [
                15502,
                15541
            ],
            [
                15543,
                15584
            ],
            [
                15584,
                15600
            ],
            [
                15600,
                15601
            ],
            [
                15610,
                15690
            ],
            [
                15690,
                15728
            ],
            [
                15728,
                15767
            ],
            [
                15780,
                15782
            ],
            [
                15782,
                15798
            ],
            [
                15798,
                15825
            ],
            [
                15825,
                15838
            ],
            [
                16090,
                16130
            ],
            [
                16130,
                16184
            ],
            [
                16186,
                16237
            ],
            [
                16237,
                16253
            ],
            [
                16259,
                16277
            ],
            [
                16304,
                16306
            ],
            [
                16306,
                16343
            ],
            [
                16377,
                16391
            ],
            [
                16391,
                16396
            ],
            [
                16412,
                16417
            ],
            [
                16399,
                16410
            ],
            [
                16424,
                16456
            ],
            [
                16456,
                16472
            ],
            [
                16476,
                16490
            ],
            [
                16499,
                16501
            ],
            [
                16501,
                16518
            ],
            [
                16518,
                16549
            ],
            [
                16549,
                16575
            ],
            [
                16575,
                16598
            ],
            [
                16598,
                16657
            ],
            [
                16704,
                16705
            ],
            [
                16709,
                16728
            ],
            [
                16728,
                16733
            ],
            [
                16740,
                16750
            ],
            [
                16757,
                16771
            ],
            [
                16771,
                16870
            ],
            [
                16870,
                16946
            ],
            [
                16946,
                16955
            ],
            [
                16985,
                17015
            ],
            [
                17015,
                17052
            ],
            [
                17052,
                17060
            ],
            [
                17060,
                17080
            ],
            [
                17080,
                17147
            ],
            [
                17147,
                17164
            ],
            [
                17164,
                17249
            ],
            [
                17300,
                17320
            ],
            [
                17320,
                17337
            ],
            [
                17337,
                17383
            ],
            [
                17383,
                17386
            ],
            [
                17413,
                17454
            ],
            [
                17454,
                17511
            ],
            [
                17511,
                17612
            ],
            [
                17630,
                17632
            ],
            [
                17642,
                17653
            ],
            [
                17665,
                17677
            ],
            [
                17677,
                17780
            ],
            [
                17863,
                17865
            ],
            [
                17865,
                17929
            ],
            [
                17950,
                17962
            ],
            [
                17962,
                18016
            ],
            [
                18035,
                18070
            ],
            [
                18070,
                18137
            ],
            [
                18154,
                18157
            ],
            [
                18167,
                18174
            ],
            [
                18192,
                18200
            ],
            [
                18200,
                18241
            ],
            [
                18241,
                18246
            ],
            [
                18248,
                18282
            ],
            [
                18360,
                18361
            ],
            [
                18592,
                18599
            ],
            [
                18609,
                18630
            ],
            [
                18688,
                18743
            ],
            [
                18743,
                18790
            ],
            [
                18790,
                18826
            ],
            [
                18888,
                18894
            ],
            [
                18834,
                18855
            ],
            [
                18920,
                18922
            ],
            [
                18922,
                18959
            ],
            [
                19077,
                19105
            ],
            [
                19121,
                19126
            ],
            [
                19110,
                19114
            ],
            [
                19140,
                19142
            ],
            [
                19142,
                19196
            ],
            [
                19206,
                19209
            ],
            [
                19226,
                19278
            ],
            [
                19280,
                19308
            ],
            [
                19310,
                19395
            ],
            [
                19395,
                19410
            ],
            [
                19424,
                19437
            ],
            [
                19437,
                19447
            ],
            [
                19452,
                19460
            ],
            [
                19460,
                19491
            ],
            [
                19491,
                19496
            ],
            [
                19504,
                19523
            ],
            [
                19533,
                19535
            ],
            [
                19560,
                19569
            ],
            [
                19581,
                19636
            ],
            [
                19636,
                19677
            ],
            [
                19677,
                19692
            ],
            [
                19692,
                19704
            ],
            [
                19704,
                19715
            ],
            [
                19721,
                19817
            ],
            [
                19818,
                19914
            ],
            [
                19914,
                19938
            ],
            [
                19944,
                19961
            ],
            [
                19963,
                19966
            ],
            [
                19979,
                19983
            ],
            [
                19998,
                20044
            ]
        ],
        "row_chars": [
            [
                0,
                465
            ],
            [
                465,
                530
            ],
            [
                530,
                561
            ],
            [
                561,
                652
            ],
            [
                652,
                772
            ],
            [
                772,
                835
            ],
            [
                835,
                890
            ],
            [
                890,
                951
            ],
            [
                951,
                1045
            ],
            [
                1045,
                1138
            ],
            [
                1138,
                1188
            ],
            [
                1188,
                1197
            ],
            [
                1197,
                1206
            ],
            [
                1206,
                1373
            ],
            [
                1373,
                1406
            ],
            [
                1406,
                1481
            ],
            [
                1481,
                1502
            ],
            [
                1502,
                1534
            ],
            [
                1534,
                1620
            ],
            [
                1620,
                1704
            ],
            [
                1704,
                1744
            ],
            [
                1744,
                1912
            ],
            [
                1912,
                2006
            ],
            [
                2006,
                2079
            ],
            [
                2079,
                2162
            ],
            [
                2162,
                2242
            ],
            [
                2242,
                2302
            ],
            [
                2302,
                2517
            ],
            [
                2517,
                2567
            ],
            [
                2567,
                2641
            ],
            [
                2641,
                2698
            ],
            [
                2698,
                2711
            ],
            [
                2711,
                2797
            ],
            [
                2797,
                2852
            ],
            [
                2852,
                2906
            ],
            [
                2906,
                2977
            ],
            [
                2977,
                3036
            ],
            [
                3036,
                3103
            ],
            [
                3103,
                3242
            ],
            [
                3242,
                3302
            ],
            [
                3302,
                3328
            ],
            [
                3328,
                3342
            ],
            [
                3342,
                3365
            ],
            [
                3365,
                3382
            ],
            [
                3382,
                3439
            ],
            [
                3439,
                3493
            ],
            [
                3493,
                3581
            ],
            [
                3581,
                3710
            ],
            [
                3710,
                3866
            ],
            [
                3866,
                3930
            ],
            [
                3930,
                3935
            ],
            [
                3935,
                4009
            ],
            [
                4009,
                4057
            ],
            [
                4057,
                4097
            ],
            [
                4097,
                4160
            ],
            [
                4160,
                4256
            ],
            [
                4256,
                4352
            ],
            [
                4352,
                4400
            ],
            [
                4400,
                4454
            ],
            [
                4454,
                4510
            ],
            [
                4510,
                4611
            ],
            [
                4611,
                4709
            ],
            [
                4709,
                4808
            ],
            [
                4808,
                4963
            ],
            [
                4963,
                4987
            ],
            [
                4987,
                5001
            ],
            [
                5001,
                5048
            ],
            [
                5048,
                5107
            ],
            [
                5107,
                5203
            ],
            [
                5203,
                5330
            ],
            [
                5330,
                5373
            ],
            [
                5373,
                5408
            ],
            [
                5408,
                5433
            ],
            [
                5433,
                5480
            ],
            [
                5480,
                5550
            ],
            [
                5550,
                5579
            ],
            [
                5579,
                5656
            ],
            [
                5656,
                5686
            ],
            [
                5686,
                5699
            ],
            [
                5699,
                5782
            ],
            [
                5782,
                5828
            ],
            [
                5828,
                5873
            ],
            [
                5873,
                5898
            ],
            [
                5898,
                5907
            ],
            [
                5907,
                6041
            ],
            [
                6041,
                6159
            ],
            [
                6159,
                6303
            ],
            [
                6303,
                6328
            ],
            [
                6328,
                6364
            ],
            [
                6364,
                6378
            ],
            [
                6378,
                6384
            ],
            [
                6384,
                6400
            ],
            [
                6400,
                6408
            ],
            [
                6408,
                6427
            ],
            [
                6427,
                6433
            ],
            [
                6433,
                6503
            ],
            [
                6503,
                6524
            ],
            [
                6524,
                6539
            ],
            [
                6539,
                6558
            ],
            [
                6558,
                6616
            ],
            [
                6616,
                6632
            ],
            [
                6632,
                6660
            ],
            [
                6660,
                6683
            ],
            [
                6683,
                6706
            ],
            [
                6706,
                6729
            ],
            [
                6729,
                6805
            ],
            [
                6805,
                6849
            ],
            [
                6849,
                6879
            ],
            [
                6879,
                6981
            ],
            [
                6981,
                7011
            ],
            [
                7011,
                7098
            ],
            [
                7098,
                7237
            ],
            [
                7237,
                7267
            ],
            [
                7267,
                7304
            ],
            [
                7304,
                7367
            ],
            [
                7367,
                7418
            ],
            [
                7418,
                7472
            ],
            [
                7472,
                7521
            ],
            [
                7521,
                7569
            ],
            [
                7569,
                7658
            ],
            [
                7658,
                7797
            ],
            [
                7797,
                7950
            ],
            [
                7950,
                8022
            ],
            [
                8022,
                8130
            ],
            [
                8130,
                8243
            ],
            [
                8243,
                8325
            ],
            [
                8325,
                8368
            ],
            [
                8368,
                8461
            ],
            [
                8461,
                8508
            ],
            [
                8508,
                8689
            ],
            [
                8689,
                8823
            ],
            [
                8823,
                9073
            ],
            [
                9073,
                9127
            ],
            [
                9127,
                9181
            ],
            [
                9181,
                9497
            ],
            [
                9497,
                9538
            ],
            [
                9538,
                9596
            ],
            [
                9596,
                9648
            ],
            [
                9648,
                9679
            ],
            [
                9679,
                9709
            ],
            [
                9709,
                9762
            ],
            [
                9762,
                9868
            ],
            [
                9868,
                9929
            ],
            [
                9929,
                9966
            ],
            [
                9966,
                10047
            ],
            [
                10047,
                10134
            ],
            [
                10134,
                10232
            ],
            [
                10232,
                10302
            ],
            [
                10302,
                10463
            ],
            [
                10463,
                10815
            ],
            [
                10815,
                11008
            ],
            [
                11008,
                11125
            ],
            [
                11125,
                11160
            ],
            [
                11160,
                11251
            ],
            [
                11251,
                11345
            ],
            [
                11345,
                11400
            ],
            [
                11400,
                11570
            ],
            [
                11570,
                11670
            ],
            [
                11670,
                11816
            ],
            [
                11816,
                11919
            ],
            [
                11919,
                12132
            ],
            [
                12132,
                12261
            ],
            [
                12261,
                12474
            ],
            [
                12474,
                12568
            ],
            [
                12568,
                12721
            ],
            [
                12721,
                12766
            ],
            [
                12766,
                12862
            ],
            [
                12862,
                12896
            ],
            [
                12896,
                12930
            ],
            [
                12930,
                12981
            ],
            [
                12981,
                13028
            ],
            [
                13028,
                13080
            ],
            [
                13080,
                13133
            ],
            [
                13133,
                13258
            ],
            [
                13258,
                13601
            ],
            [
                13601,
                13668
            ],
            [
                13668,
                13823
            ],
            [
                13823,
                13921
            ],
            [
                13921,
                14399
            ],
            [
                14399,
                14472
            ],
            [
                14472,
                14518
            ],
            [
                14518,
                14565
            ],
            [
                14565,
                14733
            ],
            [
                14733,
                14845
            ],
            [
                14845,
                14914
            ],
            [
                14914,
                14941
            ],
            [
                14941,
                14963
            ],
            [
                14963,
                14994
            ],
            [
                14994,
                15035
            ],
            [
                15035,
                15059
            ],
            [
                15059,
                15088
            ],
            [
                15088,
                15175
            ],
            [
                15175,
                15217
            ],
            [
                15217,
                15379
            ],
            [
                15379,
                15417
            ],
            [
                15417,
                15498
            ],
            [
                15498,
                15584
            ],
            [
                15584,
                15600
            ],
            [
                15600,
                15690
            ],
            [
                15690,
                15728
            ],
            [
                15728,
                15782
            ],
            [
                15782,
                15798
            ],
            [
                15798,
                15825
            ],
            [
                15825,
                15838
            ],
            [
                15838,
                15919
            ],
            [
                15919,
                15946
            ],
            [
                15946,
                15998
            ],
            [
                15998,
                16090
            ],
            [
                16090,
                16130
            ],
            [
                16130,
                16237
            ],
            [
                16237,
                16306
            ],
            [
                16306,
                16343
            ],
            [
                16343,
                16377
            ],
            [
                16377,
                16391
            ],
            [
                16391,
                16456
            ],
            [
                16456,
                16501
            ],
            [
                16501,
                16518
            ],
            [
                16518,
                16549
            ],
            [
                16549,
                16575
            ],
            [
                16575,
                16598
            ],
            [
                16598,
                16659
            ],
            [
                16659,
                16704
            ],
            [
                16704,
                16728
            ],
            [
                16728,
                16771
            ],
            [
                16771,
                16870
            ],
            [
                16870,
                16946
            ],
            [
                16946,
                16985
            ],
            [
                16985,
                17015
            ],
            [
                17015,
                17052
            ],
            [
                17052,
                17060
            ],
            [
                17060,
                17080
            ],
            [
                17080,
                17147
            ],
            [
                17147,
                17164
            ],
            [
                17164,
                17252
            ],
            [
                17252,
                17287
            ],
            [
                17287,
                17300
            ],
            [
                17300,
                17320
            ],
            [
                17320,
                17337
            ],
            [
                17337,
                17383
            ],
            [
                17383,
                17454
            ],
            [
                17454,
                17511
            ],
            [
                17511,
                17677
            ],
            [
                17677,
                17865
            ],
            [
                17865,
                17962
            ],
            [
                17962,
                18016
            ],
            [
                18016,
                18035
            ],
            [
                18035,
                18070
            ],
            [
                18070,
                18200
            ],
            [
                18200,
                18241
            ],
            [
                18241,
                18451
            ],
            [
                18451,
                18524
            ],
            [
                18524,
                18592
            ],
            [
                18592,
                18662
            ],
            [
                18662,
                18688
            ],
            [
                18688,
                18743
            ],
            [
                18743,
                18790
            ],
            [
                18790,
                18922
            ],
            [
                18922,
                18961
            ],
            [
                18961,
                18996
            ],
            [
                18996,
                19048
            ],
            [
                19048,
                19077
            ],
            [
                19077,
                19142
            ],
            [
                19142,
                19395
            ],
            [
                19395,
                19437
            ],
            [
                19437,
                19460
            ],
            [
                19460,
                19491
            ],
            [
                19491,
                19535
            ],
            [
                19535,
                19560
            ],
            [
                19560,
                19636
            ],
            [
                19636,
                19677
            ],
            [
                19677,
                19692
            ],
            [
                19692,
                19704
            ],
            [
                19704,
                19818
            ],
            [
                19818,
                19914
            ],
            [
                19914,
                20044
            ]
        ]
    },
    "abridged": {
        "text": "Alice found herself seated near Lady Glencora's end of the table, between Jeffrey Palliser and the Duke of St. Bungay, to whom Lady Glencora introduced her.\n\"My cousin, Duke,\" Lady Glencora said, \"and a terrible Radical.\"\n\"Oh, indeed; I'm glad of that. We're sadly in want of a few leading Radicals.\"\nAlice thought of her cousin George, and wished that he was sitting in her place. \"But I'm afraid I never shall be a leading Radical,\" she said.\n\"You may lead me at any rate,\" said he.\n\"As little dogs lead blind men,\" said Lady Glencora.\n\"No, Lady Glencora, as the pretty women lead the men who have eyes in their head. There is nothing I want so much, Miss Vavasor, as to become a Radical; if I only knew how.\"\n\"I think it's very easy to know how,\" said Alice.\n\"Do you? I don't. I've voted for every serious liberal measure that has come before Parliament since I had a seat in either House, and I've not been able to get beyond Whiggery yet.\"\n\"Have you voted for the secret ballot?\" asked Alice, almost trembling at her own audacity.\n\"Well; no, I've not. And I suppose that is the crux. But I hate it with so keen a private hatred, that I doubt whether I could vote for it.\"\n\"But the Radicals love it,\" said Alice.\n\"Palliser,\" said the Duke, speaking loudly down the table, \"I'm told you can never call yourself a Radical till you've voted for the ballot.\"\n\"I don't want to be called a Radical,\" said Mr. Palliser, \"or to be called anything at all.\"\n\"Except Chancellor of the Exchequer,\" said Lady Glencora in a low voice.\n\"And that's about the finest ambition a man can have,\" said the Duke. \"The man who can manage the purse-strings of this country can manage anything.\" Then the Duke ate his dinner.\n\"When I undertook to amuse you,\" said Mr. Jeffrey Palliser to Alice, \"I had no idea that you would be hauling Cabinet Ministers over the coals about their politics.\"\n\"I did nothing of the kind, surely, Mr. Palliser. I suppose all Radicals do vote for the ballot, and that's why I said it.\"\n\"You are quite right. But unfortunately I'm not a politician. I haven't a chance of a seat in the House, and so I despise politics.\"\n\"Women are not allowed to be politicians in this country.\"\n\"Thank God; only think where we should be if we had a feminine House of Commons, with feminine debates, carried on with feminine courtesy. My cousins Iphy and Phemy there would of course be members. You don't know them yet?\"\n\"No; not yet.\"\n\"They have decidedly liberal tendencies. There has never been a Tory Palliser, you know. But they are too clever to give themselves up to anything in which they can do nothing. Being women they live a depressed life, devoting themselves to literature, fine arts, social economy, and the abstract sciences. They write wonderful letters; but I believe their correspondence lists are quite full, so that you have no chance of getting on either of them.\"\n\"I haven't the slightest pretension to ask for such an honour.\"\n\"Oh! You don't need to know them. Free communication with all the world is their motto. Are you fond of writing letters, Miss Vavasor?\"\n\"Yes, to my friends; but I like getting letters better.\"\n\"I suspect they don't read half what they get. Could anyone get through two sheets of paper filled by our friend the Duchess there? No; their delight is in writing, every morning. There is a little rivalry between them. Iphy certainly does send off more.\"\n\"Do they write to you?\"\n\"Oh, dear no. I don't think they ever write to any relative. They don't discuss family affairs and such topics as that. Iphy has certain American correspondents, but she acknowledges she does not read their letters.\"\n\"Then I certainly shall not write to her.\"\n\"But you are not American, I hope. I do hate the Americans. It's the only strong political feeling I have. I went there once, and found I couldn't live with them.\"\n\"I don't see they are to be hated because they don't live after our fashion.\"\n\"Oh; it's jealousy of course. I know that. I didn't come across a cab-driver there who wasn't better educated than I am. And as for their women, they know everything. But I intend to hate them. You haven't been there?\"\n\"Oh no.\"\n\"Then I will make bold to say that any English lady who spent a month with them and didn't hate them would have very singular tastes. Do you hunt?\"\n\"No.\"\n\"Do you shoot?\"\n\"Shoot! No; I don't shoot.\"\n\"Do you ride?\"\n\"No; I wish I did.\"\n\"Do you drive?\"\n\"No; I don't drive either.\"\n\"Then what do you do?\"\n\"I sit at home, and-\"\n\"Mend your stockings?\"\n\"No; I don't do that, but I do needlework a good deal. Sometimes I have amused myself by reading.\"\n\"Ah; they never do that here. I have heard that there is a library, but the clue to it has been lost, and nobody now knows the way. I don't believe in libraries. Do you mean to read all the time you are here, Miss Vavasor?\"\n\"I mean to walk about the priory ruins sometimes.\"\n\"Then you must go by moonlight, and I'll go with you. Only isn't it rather late in the year for that?\"\n\"I should think it is for you, Mr. Palliser.\"\nThen the Duke spoke to her again, and she found that she got on very well during dinner. She could not help feel angry with herself for having any fear about it; and yet she could not dismiss that fear. She was conscious of a certain inferiority to Lady Glencora and Mr. Jeffrey Palliser, which almost made her unhappy. As regarded the Duke, she had no such feeling. He was old enough to be her father, and was a Cabinet Minister; therefore he was entitled to her reverence. But why did she accept that the people round her were indeed superior to herself? Was she really learning to believe that she could grow upwards by their sunlight?\n\"Jeffrey is a pleasant fellow, is he not?\" said Lady Glencora to her as they went to the drawing-room.\n\"Very pleasant; a little sarcastic, perhaps.\"\n\"I think you would be able to get the better of that if he tries it on you,\" said Lady Glencora; and then the ladies were in the drawing-room.\n\"It is quite deliciously warm in the corridor,\" said the Duchess.\n\"Then we had better keep moving,\" said a certain Mrs. Conway Sparkes, a very clever literary lady, of whom the Duchess of St. Bungay was rather afraid.\n\"I hope we may be warm here too,\" said Lady Glencora.\n\"But not deliciously warm,\" said Mrs. Conway Sparkes.\n\"It makes me tremble in every limb when Mrs. Sparkes attacks the Duchess,\" Lady Glencora said to Alice in Alice's room that night, \"for I know she'll tell the Duke; and he'll tell that tall man with red hair whom you see standing about, and he will tell Mr. Palliser, and then I shall catch it.\"\n\"And who is the tall man with red hair?\"\n\"He's a political link between the Duke and Mr. Palliser. His name is Bott, and he's a Member of Parliament.\"\n\"But why should he interfere?\"\n\"I suppose it's his business. I believe he's to be one of Mr. Palliser's private secretaries if he becomes Chancellor of the Exchequer. Perhaps he doesn't tell; only I think he does. He always calls me Lady Glen-cowrer. He comes from Lancashire, and used to make calico.\" But this happened in the bedroom, and we must go back for a while to the drawing-room.\nThere was no general conversation. The number of ladies in the room was too great for that. Lady Glencora behaved prettily, telling the Duchess all about her pet pheasants; Mrs. Conway Sparkes told ill-natured tales of someone to Miss Euphemia Palliser; one of the Duchess's daughters walked off to a distant piano with a friend and touched a few notes; while Iphigenia Palliser boldly took up a book, and placed herself at a table.\nAlice speculated whether she might do the same, but her courage failed her, and she sat on, feeling out of her element.\n\"Alice Vavasor,\" said Lady Glencora after a while, suddenly and loudly, \"can you play billiards?\"\n\"No,\" said Alice, rather startled.\n\"Then you shall learn tonight.\" Whereupon Lady Glencora rang the bell and ordered that the billiard-table might be got ready. \"You'll play, Duchess, of course,\" she said.\n\"It is so nice and warm, that I think I will,\" said the Duchess; but as she spoke she looked suspiciously at Mrs. Conway Sparkes.\n\"Let us all play,\" said Mrs. Conway Sparkes, \"and then it will be nicer - and perhaps warmer, too.\"\nThe gentlemen joined them as they were settling themselves round the table, and as many of them stayed, the billiard-room became full. The duty of instructing Alice fell to Jeffrey Palliser, and the next hour passed pleasantly; though not so pleasantly as some of those hours in Switzerland with her cousins. However, Jeffrey Palliser took great trouble to teach her, and once or twice made her laugh by quizzing the Duchess's attitude as she stood up to make her stroke.\n\"I wish I could play billiards,\" said Mrs. Sparkes.\n\"I thought you said you were coming to play,\" said the Duchess, with a tone of triumph at her own successes.\n\"Only to see your Grace,\" said Mrs. Sparkes.\n\"I don't know that there is anything to see,\" said the Duchess. \"Mr. Palliser, that was a cannon. Will you mark that for our side?\"\n\"Oh no, Duchess, you hit the same ball twice.\"\n\"Very well; then I suppose Miss Vavasor plays now. Will you mark a miss, if you please?\" Before long, the Duchess, with her partner, Lady Glencora, won the game, and made her way back into the drawing-room with a step which seemed to declare that she had trumped Mrs. Sparkes at last.\nNot long after this the ladies went upstairs to bed.\n\"I'll come into your room just for one minute,\" Lady Glencora said to Alice; and having dismissed the maid, she sat down by the fireside.\n\"I must keep you up for a quarter of an hour while I tell you something,\" she said. \"But first of all, how do you like the people? Will you be comfortable with them?\"\nAlice of course said that she thought she would; and then there came that little discussion about Mr. Bott, the man with the red hair.\n\"But I've got something to tell you,\" said Lady Glencora. \"Look at the fire while I say it.\"\n\"Is it anything terrible?\"\n\"It's nothing wrong.\"\n\"Oh, Lady Glencora, if it's-\"\n\"Don't call me Lady Glencora. Don't I call you Alice? Why are you so unkind? I am not asking you to do anything that you ought not to do.\"\n\"But you are going to tell me something.\" Alice felt sure that it would be about Mr. Fitzgerald.\n\"Of course I am. I'm going to tell you that in writing to you the other day I wrote a fib. It wasn't that I wished to deceive you; only I couldn't say it all in a letter.\"\n\"Say all what?\"\n\"I confessed that I had been very bad in not coming to you in London last year.\"\n\"I never thought of it for a moment.\"\n\"You did not care whether I came or not? But never mind. Why should you have cared? But I cared. I was longing to come to you every day. But I feared I could not come without speaking of him; - and I had determined never to speak of him again.\" This she said in a peculiar low voice.\n\"Then why do it now, Lady Glencora?\"\n\"Call me Cora. I had an older sister once, and she used to call me Cora. If she had lived- But never mind. She didn't live. I'll tell you why I do it now. Because I cannot help it. Besides, I've met him. I've been in the same room with him, and have spoken to him.\"\n\"You have met him?\"\n\"Yes; Mr. Palliser knew all about it. When he talked of taking me to the house, I whispered to him that I thought Burgo would be there.\"\n\"Do not call him by his Christian name,\" said Alice, almost with a shudder.\n\"Why not? I did when I told my husband. Or perhaps I said Burgo Fitzgerald.\"\n\"Well.\"\n\"And he bade me go. He said it didn't signify, and that I had better learn to bear it. Bear it, indeed! If I am to meet him, and speak to him, and look at him, surely I may mention his name?\"\n\"What am I to say?\" exclaimed Alice.\n\"Anything you please, that's not a falsehood. But I don't think you will tell a falsehood. Oh, Alice, I do so want to go right, and it is so hard!\"\nHard, indeed, poor creature, for one so weighted as she had been, and sent out into the world with so little in the way of training or friendship! Alice began to feel now that she had been enticed to Matching Priory because her cousin wanted a friend. She got up from her chair, and kneeling down at the other's feet she kissed her.\n\"I knew you would be good to me,\" said Lady Glencora. \"And you may say whatever you like. But I could not bear that you should not know the real reason why I did not visit you or send for you in London. You'll come to me now; won't you, dear?\"\n\"Yes; and you'll come to me,\" said Alice.\n\"I will,\" said Lady Glencora. \"We shall have dinners and parties and lots of people.\"\n\"And we shall have none,\" said Alice, smiling.\n\"And therefore there is so much more reason for your coming to me. Well, dear, I'm so glad I've told you.\" Then she smiled and returned Alice's kiss. It was singular to see her standing on the bedroom rug in her magnificent dress, but with her hair pushed back behind her ears and her eyes red with tears, as though the burden of the magnificence remained to her after its purpose was over.\n\"I declare it's long past twelve. Good night, dear. I wonder whether he's come up. But I would have heard his step. He seldom finishes work till after one, and sometimes goes on till three. It's the only thing he likes, I believe. God bless you! good night. I've such a lot more to say to you; and Alice, you must tell me something about yourself, too; won't you, dear?\"\nThen without waiting for an answer Lady Glencora went, leaving Alice in a maze of bewilderment. She could hardly believe all she had heard and done since she left Queen Anne Street that morning.",
        "paragraph_chars": [
            [
                0,
                157
            ],
            [
                157,
                222
            ],
            [
                222,
                301
            ],
            [
                301,
                445
            ],
            [
                445,
                485
            ],
            [
                485,
                538
            ],
            [
                538,
                712
            ],
            [
                712,
                762
            ],
            [
                762,
                945
            ],
            [
                945,
                1036
            ],
            [
                1036,
                1177
            ],
            [
                1177,
                1217
            ],
            [
                1217,
                1359
            ],
            [
                1359,
                1452
            ],
            [
                1452,
                1525
            ],
            [
                1525,
                1705
            ],
            [
                1705,
                1871
            ],
            [
                1871,
                1995
            ],
            [
                1995,
                2128
            ],
            [
                2128,
                2187
            ],
            [
                2187,
                2412
            ],
            [
                2412,
                2427
            ],
            [
                2427,
                2878
            ],
            [
                2878,
                2942
            ],
            [
                2942,
                3078
            ],
            [
                3078,
                3135
            ],
            [
                3135,
                3391
            ],
            [
                3391,
                3415
            ],
            [
                3415,
                3632
            ],
            [
                3632,
                3675
            ],
            [
                3675,
                3839
            ],
            [
                3839,
                3917
            ],
            [
                3917,
                4136
            ],
            [
                4136,
                4145
            ],
            [
                4145,
                4293
            ],
            [
                4293,
                4299
            ],
            [
                4299,
                4315
            ],
            [
                4315,
                4343
            ],
            [
                4343,
                4358
            ],
            [
                4358,
                4378
            ],
            [
                4378,
                4394
            ],
            [
                4394,
                4422
            ],
            [
                4422,
                4445
            ],
            [
                4445,
                4467
            ],
            [
                4467,
                4490
            ],
            [
                4490,
                4589
            ],
            [
                4589,
                4813
            ],
            [
                4813,
                4864
            ],
            [
                4864,
                4967
            ],
            [
                4967,
                5013
            ],
            [
                5013,
                5652
            ],
            [
                5652,
                5755
            ],
            [
                5755,
                5801
            ],
            [
                5801,
                5944
            ],
            [
                5944,
                6010
            ],
            [
                6010,
                6162
            ],
            [
                6162,
                6216
            ],
            [
                6216,
                6270
            ],
            [
                6270,
                6566
            ],
            [
                6566,
                6607
            ],
            [
                6607,
                6717
            ],
            [
                6717,
                6748
            ],
            [
                6748,
                7107
            ],
            [
                7107,
                7540
            ],
            [
                7540,
                7660
            ],
            [
                7660,
                7758
            ],
            [
                7758,
                7793
            ],
            [
                7793,
                7964
            ],
            [
                7964,
                8094
            ],
            [
                8094,
                8194
            ],
            [
                8194,
                8666
            ],
            [
                8666,
                8718
            ],
            [
                8718,
                8827
            ],
            [
                8827,
                8872
            ],
            [
                8872,
                9004
            ],
            [
                9004,
                9051
            ],
            [
                9051,
                9336
            ],
            [
                9336,
                9389
            ],
            [
                9389,
                9527
            ],
            [
                9527,
                9694
            ],
            [
                9694,
                9829
            ],
            [
                9829,
                9922
            ],
            [
                9922,
                9949
            ],
            [
                9949,
                9971
            ],
            [
                9971,
                10001
            ],
            [
                10001,
                10140
            ],
            [
                10140,
                10237
            ],
            [
                10237,
                10409
            ],
            [
                10409,
                10425
            ],
            [
                10425,
                10506
            ],
            [
                10506,
                10544
            ],
            [
                10544,
                10828
            ],
            [
                10828,
                10865
            ],
            [
                10865,
                11131
            ],
            [
                11131,
                11151
            ],
            [
                11151,
                11288
            ],
            [
                11288,
                11364
            ],
            [
                11364,
                11441
            ],
            [
                11441,
                11449
            ],
            [
                11449,
                11641
            ],
            [
                11641,
                11678
            ],
            [
                11678,
                11826
            ],
            [
                11826,
                12159
            ],
            [
                12159,
                12403
            ],
            [
                12403,
                12445
            ],
            [
                12445,
                12531
            ],
            [
                12531,
                12578
            ],
            [
                12578,
                12969
            ],
            [
                12969,
                13340
            ],
            [
                13340,
                13534
            ]
        ],
        "segment_chars": [
            [
                0,
                157
            ],
            [
                157,
                222
            ],
            [
                222,
                253
            ],
            [
                253,
                301
            ],
            [
                301,
                382
            ],
            [
                382,
                445
            ],
            [
                445,
                485
            ],
            [
                485,
                538
            ],
            [
                538,
                620
            ],
            [
                620,
                712
            ],
            [
                712,
                762
            ],
            [
                762,
                771
            ],
            [
                771,
                780
            ],
            [
                780,
                945
            ],
            [
                945,
                985
            ],
            [
                985,
                1036
            ],
            [
                1036,
                1057
            ],
            [
                1057,
                1089
            ],
            [
                1089,
                1177
            ],
            [
                1177,
                1217
            ],
            [
                1217,
                1359
            ],
            [
                1359,
                1452
            ],
            [
                1452,
                1525
            ],
            [
                1525,
                1595
            ],
            [
                1595,
                1675
            ],
            [
                1675,
                1705
            ],
            [
                1705,
                1871
            ],
            [
                1871,
                1921
            ],
            [
                1921,
                1995
            ],
            [
                1995,
                2017
            ],
            [
                2017,
                2057
            ],
            [
                2057,
                2128
            ],
            [
                2128,
                2187
            ],
            [
                2187,
                2326
            ],
            [
                2326,
                2386
            ],
            [
                2386,
                2412
            ],
            [
                2412,
                2427
            ],
            [
                2427,
                2468
            ],
            [
                2468,
                2516
            ],
            [
                2516,
                2604
            ],
            [
                2604,
                2733
            ],
            [
                2733,
                2878
            ],
            [
                2878,
                2942
            ],
            [
                2942,
                2947
            ],
            [
                2947,
                2976
            ],
            [
                2976,
                3030
            ],
            [
                3030,
                3078
            ],
            [
                3078,
                3135
            ],
            [
                3135,
                3182
            ],
            [
                3182,
                3267
            ],
            [
                3267,
                3315
            ],
            [
                3315,
                3355
            ],
            [
                3355,
                3391
            ],
            [
                3391,
                3415
            ],
            [
                3415,
                3429
            ],
            [
                3429,
                3476
            ],
            [
                3476,
                3535
            ],
            [
                3535,
                3632
            ],
            [
                3632,
                3675
            ],
            [
                3675,
                3710
            ],
            [
                3710,
                3735
            ],
            [
                3735,
                3782
            ],
            [
                3782,
                3839
            ],
            [
                3839,
                3917
            ],
            [
                3917,
                3947
            ],
            [
                3947,
                3960
            ],
            [
                3960,
                4038
            ],
            [
                4038,
                4084
            ],
            [
                4084,
                4111
            ],
            [
                4111,
                4136
            ],
            [
                4136,
                4145
            ],
            [
                4145,
                4279
            ],
            [
                4279,
                4293
            ],
            [
                4293,
                4299
            ],
            [
                4299,
                4315
            ],
            [
                4315,
                4323
            ],
            [
                4323,
                4343
            ],
            [
                4343,
                4358
            ],
            [
                4358,
                4378
            ],
            [
                4378,
                4394
            ],
            [
                4394,
                4422
            ],
            [
                4422,
                4445
            ],
            [
                4445,
                4467
            ],
            [
                4467,
                4490
            ],
            [
                4490,
                4545
            ],
            [
                4545,
                4589
            ],
            [
                4589,
                4619
            ],
            [
                4619,
                4721
            ],
            [
                4721,
                4751
            ],
            [
                4751,
                4813
            ],
            [
                4813,
                4864
            ],
            [
                4864,
                4918
            ],
            [
                4918,
                4967
            ],
            [
                4967,
                5013
            ],
            [
                5013,
                5102
            ],
            [
                5102,
                5216
            ],
            [
                5216,
                5333
            ],
            [
                5333,
                5380
            ],
            [
                5380,
                5488
            ],
            [
                5488,
                5570
            ],
            [
                5570,
                5652
            ],
            [
                5652,
                5695
            ],
            [
                5695,
                5755
            ],
            [
                5755,
                5801
            ],
            [
                5801,
                5944
            ],
            [
                5944,
                6010
            ],
            [
                6010,
                6162
            ],
            [
                6162,
                6216
            ],
            [
                6216,
                6270
            ],
            [
                6270,
                6566
            ],
            [
                6566,
                6607
            ],
            [
                6607,
                6665
            ],
            [
                6665,
                6717
            ],
            [
                6717,
                6748
            ],
            [
                6748,
                6778
            ],
            [
                6778,
                6884
            ],
            [
                6884,
                6931
            ],
            [
                6931,
                6968
            ],
            [
                6968,
                7020
            ],
            [
                7020,
                7107
            ],
            [
                7107,
                7142
            ],
            [
                7142,
                7199
            ],
            [
                7199,
                7540
            ],
            [
                7540,
                7660
            ],
            [
                7660,
                7758
            ],
            [
                7758,
                7793
            ],
            [
                7793,
                7825
            ],
            [
                7825,
                7919
            ],
            [
                7919,
                7964
            ],
            [
                7964,
                8094
            ],
            [
                8094,
                8194
            ],
            [
                8194,
                8329
            ],
            [
                8329,
                8503
            ],
            [
                8503,
                8666
            ],
            [
                8666,
                8718
            ],
            [
                8718,
                8827
            ],
            [
                8827,
                8872
            ],
            [
                8872,
                8936
            ],
            [
                8936,
                8970
            ],
            [
                8970,
                9004
            ],
            [
                9004,
                9051
            ],
            [
                9051,
                9102
            ],
            [
                9102,
                9140
            ],
            [
                9140,
                9336
            ],
            [
                9336,
                9389
            ],
            [
                9389,
                9527
            ],
            [
                9527,
                9611
            ],
            [
                9611,
                9658
            ],
            [
                9658,
                9694
            ],
            [
                9694,
                9829
            ],
            [
                9829,
                9887
            ],
            [
                9887,
                9922
            ],
            [
                9922,
                9949
            ],
            [
                9949,
                9971
            ],
            [
                9971,
                10001
            ],
            [
                10001,
                10031
            ],
            [
                10031,
                10055
            ],
            [
                10055,
                10078
            ],
            [
                10078,
                10140
            ],
            [
                10140,
                10182
            ],
            [
                10182,
                10237
            ],
            [
                10237,
                10254
            ],
            [
                10254,
                10328
            ],
            [
                10328,
                10409
            ],
            [
                10409,
                10425
            ],
            [
                10425,
                10506
            ],
            [
                10506,
                10544
            ],
            [
                10544,
                10585
            ],
            [
                10585,
                10601
            ],
            [
                10601,
                10628
            ],
            [
                10628,
                10641
            ],
            [
                10641,
                10681
            ],
            [
                10681,
                10789
            ],
            [
                10789,
                10828
            ],
            [
                10828,
                10865
            ],
            [
                10865,
                10880
            ],
            [
                10880,
                10938
            ],
            [
                10938,
                10972
            ],
            [
                10972,
                10989
            ],
            [
                10989,
                11020
            ],
            [
                11020,
                11046
            ],
            [
                11046,
                11069
            ],
            [
                11069,
                11131
            ],
            [
                11131,
                11151
            ],
            [
                11151,
                11189
            ],
            [
                11189,
                11288
            ],
            [
                11288,
                11364
            ],
            [
                11364,
                11374
            ],
            [
                11374,
                11404
            ],
            [
                11404,
                11441
            ],
            [
                11441,
                11449
            ],
            [
                11449,
                11469
            ],
            [
                11469,
                11536
            ],
            [
                11536,
                11553
            ],
            [
                11553,
                11641
            ],
            [
                11641,
                11661
            ],
            [
                11661,
                11678
            ],
            [
                11678,
                11724
            ],
            [
                11724,
                11769
            ],
            [
                11769,
                11826
            ],
            [
                11826,
                11973
            ],
            [
                11973,
                12078
            ],
            [
                12078,
                12159
            ],
            [
                12159,
                12213
            ],
            [
                12213,
                12249
            ],
            [
                12249,
                12362
            ],
            [
                12362,
                12403
            ],
            [
                12403,
                12445
            ],
            [
                12445,
                12475
            ],
            [
                12475,
                12531
            ],
            [
                12531,
                12578
            ],
            [
                12578,
                12645
            ],
            [
                12645,
                12685
            ],
            [
                12685,
                12728
            ],
            [
                12728,
                12969
            ],
            [
                12969,
                13003
            ],
            [
                13003,
                13021
            ],
            [
                13021,
                13052
            ],
            [
                13052,
                13085
            ],
            [
                13085,
                13159
            ],
            [
                13159,
                13200
            ],
            [
                13200,
                13215
            ],
            [
                13215,
                13227
            ],
            [
                13227,
                13340
            ],
            [
                13340,
                13436
            ],
            [
                13436,
                13534
            ]
        ],
        "overlap_chars": [
            [
                0,
                31
            ],
            [
                32,
                65
            ],
            [
                66,
                73
            ],
            [
                74,
                103
            ],
            [
                104,
                106
            ],
            [
                109,
                110
            ],
            [
                117,
                118
            ],
            [
                119,
                121
            ],
            [
                127,
                155
            ],
            [
                155,
                156
            ],
            [
                157,
                222
            ],
            [
                222,
                253
            ],
            [
                253,
                298
            ],
            [
                298,
                301
            ],
            [
                301,
                355
            ],
            [
                356,
                367
            ],
            [
                380,
                382
            ],
            [
                382,
                445
            ],
            [
                445,
                449
            ],
            [
                454,
                473
            ],
            [
                473,
                485
            ],
            [
                485,
                488
            ],
            [
                489,
                505
            ],
            [
                506,
                538
            ],
            [
                538,
                557
            ],
            [
                558,
                620
            ],
            [
                620,
                690
            ],
            [
                691,
                712
            ],
            [
                712,
                762
            ],
            [
                762,
                771
            ],
            [
                771,
                780
            ],
            [
                780,
                800
            ],
            [
                809,
                838
            ],
            [
                839,
                945
            ],
            [
                945,
                968
            ],
            [
                976,
                985
            ],
            [
                985,
                1034
            ],
            [
                1034,
                1036
            ],
            [
                1036,
                1057
            ],
            [
                1057,
                1089
            ],
            [
                1093,
                1177
            ],
            [
                1177,
                1217
            ],
            [
                1217,
                1259
            ],
            [
                1265,
                1299
            ],
            [
                1300,
                1359
            ],
            [
                1359,
                1416
            ],
            [
                1417,
                1452
            ],
            [
                1452,
                1525
            ],
            [
                1525,
                1562
            ],
            [
                1563,
                1572
            ],
            [
                1577,
                1595
            ],
            [
                1595,
                1675
            ],
            [
                1675,
                1679
            ],
            [
                1680,
                1705
            ],
            [
                1705,
                1706
            ],
            [
                1706,
                1722
            ],
            [
                1723,
                1772
            ],
            [
                1774,
                1775
            ],
            [
                1775,
                1783
            ],
            [
                1789,
                1806
            ],
            [
                1815,
                1871
            ],
            [
                1871,
                1921
            ],
            [
                1921,
                1995
            ],
            [
                1995,
                1996
            ],
            [
                2017,
                2020
            ],
            [
                2021,
                2057
            ],
            [
                2057,
                2128
            ],
            [
                2128,
                2187
            ],
            [
                2199,
                2301
            ],
            [
                2302,
                2326
            ],
            [
                2326,
                2386
            ],
            [
                2386,
                2412
            ],
            [
                2412,
                2424
            ],
            [
                2428,
                2437
            ],
            [
                2438,
                2455
            ],
            [
                2456,
                2466
            ],
            [
                2466,
                2468
            ],
            [
                2468,
                2504
            ],
            [
                2504,
                2516
            ],
            [
                2516,
                2604
            ],
            [
                2604,
                2733
            ],
            [
                2733,
                2846
            ],
            [
                2847,
                2878
            ],
            [
                2878,
                2942
            ],
            [
                2942,
                2947
            ],
            [
                2947,
                2956
            ],
            [
                2962,
                2964
            ],
            [
                2965,
                2974
            ],
            [
                2976,
                3028
            ],
            [
                3028,
                3030
            ],
            [
                3030,
                3078
            ],
            [
                3078,
                3117
            ],
            [
                3126,
                3135
            ],
            [
                3135,
                3137
            ],
            [
                3138,
                3182
            ],
            [
                3199,
                3267
            ],
            [
                3267,
                3298
            ],
            [
                3298,
                3299
            ],
            [
                3313,
                3315
            ],
            [
                3315,
                3353
            ],
            [
                3353,
                3355
            ],
            [
                3355,
                3374
            ],
            [
                3380,
                3383
            ],
            [
                3388,
                3391
            ],
            [
                3391,
                3415
            ],
            [
                3415,
                3429
            ],
            [
                3429,
                3476
            ],
            [
                3476,
                3535
            ],
            [
                3535,
                3575
            ],
            [
                3575,
                3632
            ],
            [
                3632,
                3675
            ],
            [
                3675,
                3710
            ],
            [
                3710,
                3735
            ],
            [
                3735,
                3782
            ],
            [
                3782,
                3836
            ],
            [
                3836,
                3839
            ],
            [
                3840,
                3917
            ],
            [
                3917,
                3947
            ],
            [
                3947,
                3960
            ],
            [
                3960,
                3993
            ],
            [
                4000,
                4010
            ],
            [
                4011,
                4026
            ],
            [
                4027,
                4038
            ],
            [
                4038,
                4084
            ],
            [
                4084,
                4087
            ],
            [
                4088,
                4111
            ],
            [
                4111,
                4136
            ],
            [
                4136,
                4145
            ],
            [
                4145,
                4279
            ],
            [
                4279,
                4293
            ],
            [
                4293,
                4299
            ],
            [
                4299,
                4315
            ],
            [
                4315,
                4323
            ],
            [
                4323,
                4343
            ],
            [
                4343,
                4358
            ],
            [
                4358,
                4375
            ],
            [
                4378,
                4394
            ],
            [
                4394,
                4422
            ],
            [
                4422,
                4445
            ],
            [
                4445,
                4464
            ],
            [
                4467,
                4490
            ],
            [
                4490,
                4511
            ],
            [
                4512,
                4520
            ],
            [
                4527,
                4545
            ],
            [
                4545,
                4589
            ],
            [
                4589,
                4619
            ],
            [
                4619,
                4721
            ],
            [
                4721,
                4751
            ],
            [
                4754,
                4813
            ],
            [
                4813,
                4864
            ],
            [
                4864,
                4918
            ],
            [
                4918,
                4967
            ],
            [
                4967,
                4988
            ],
            [
                4989,
                5013
            ],
            [
                5013,
                5102
            ],
            [
                5102,
                5115
            ],
            [
                5121,
                5144
            ],
            [
                5156,
                5164
            ],
            [
                5173,
                5174
            ],
            [
                5175,
                5196
            ],
            [
                5205,
                5216
            ],
            [
                5216,
                5279
            ],
            [
                5280,
                5333
            ],
            [
                5333,
                5353
            ],
            [
                5353,
                5380
            ],
            [
                5380,
                5488
            ],
            [
                5488,
                5491
            ],
            [
                5500,
                5503
            ],
            [
                5511,
                5515
            ],
            [
                5516,
                5519
            ],
            [
                5520,
                5536
            ],
            [
                5542,
                5570
            ],
            [
                5570,
                5652
            ],
            [
                5652,
                5695
            ],
            [
                5695,
                5728
            ],
            [
                5734,
                5755
            ],
            [
                5755,
                5770
            ],
            [
                5771,
                5801
            ],
            [
                5801,
                5803
            ],
            [
                5804,
                5819
            ],
            [
                5823,
                5868
            ],
            [
                5872,
                5922
            ],
            [
                5923,
                5942
            ],
            [
                5942,
                5944
            ],
            [
                5944,
                5973
            ],
            [
                5977,
                5980
            ],
            [
                5989,
                6008
            ],
            [
                6010,
                6034
            ],
            [
                6035,
                6081
            ],
            [
                6082,
                6093
            ],
            [
                6094,
                6108
            ],
            [
                6109,
                6162
            ],
            [
                6162,
                6216
            ],
            [
                6216,
                6270
            ],
            [
                6270,
                6330
            ],
            [
                6331,
                6334
            ],
            [
                6342,
                6383
            ],
            [
                6384,
                6510
            ],
            [
                6514,
                6566
            ],
            [
                6566,
                6607
            ],
            [
                6607,
                6665
            ],
            [
                6665,
                6717
            ],
            [
                6717,
                6748
            ],
            [
                6748,
                6778
            ],
            [
                6778,
                6884
            ],
            [
                6884,
                6908
            ],
            [
                6909,
                6929
            ],
            [
                6929,
                6931
            ],
            [
                6931,
                6968
            ],
            [
                6968,
                6976
            ],
            [
                6982,
                6997
            ],
            [
                7011,
                7017
            ],
            [
                7017,
                7020
            ],
            [
                7020,
                7107
            ],
            [
                7107,
                7112
            ],
            [
                7113,
                7116
            ],
            [
                7120,
                7127
            ],
            [
                7128,
                7140
            ],
            [
                7140,
                7142
            ],
            [
                7142,
                7197
            ],
            [
                7197,
                7199
            ],
            [
                7199,
                7220
            ],
            [
                7231,
                7325
            ],
            [
                7334,
                7426
            ],
            [
                7429,
                7539
            ],
            [
                7540,
                7545
            ],
            [
                7557,
                7586
            ],
            [
                7586,
                7587
            ],
            [
                7588,
                7631
            ],
            [
                7640,
                7659
            ],
            [
                7660,
                7719
            ],
            [
                7720,
                7723
            ],
            [
                7730,
                7758
            ],
            [
                7758,
                7793
            ],
            [
                7793,
                7814
            ],
            [
                7822,
                7825
            ],
            [
                7825,
                7919
            ],
            [
                7919,
                7953
            ],
            [
                7958,
                7962
            ],
            [
                7962,
                7964
            ],
            [
                7964,
                8069
            ],
            [
                8073,
                8092
            ],
            [
                8092,
                8094
            ],
            [
                8094,
                8165
            ],
            [
                8168,
                8194
            ],
            [
                8194,
                8219
            ],
            [
                8220,
                8296
            ],
            [
                8296,
                8329
            ],
            [
                8329,
                8352
            ],
            [
                8367,
                8421
            ],
            [
                8429,
                8446
            ],
            [
                8447,
                8449
            ],
            [
                8450,
                8484
            ],
            [
                8485,
                8493
            ],
            [
                8494,
                8501
            ],
            [
                8501,
                8503
            ],
            [
                8512,
                8528
            ],
            [
                8534,
                8560
            ],
            [
                8560,
                8594
            ],
            [
                8595,
                8666
            ],
            [
                8666,
                8716
            ],
            [
                8718,
                8781
            ],
            [
                8782,
                8804
            ],
            [
                8808,
                8827
            ],
            [
                8827,
                8872
            ],
            [
                8872,
                8908
            ],
            [
                8909,
                8915
            ],
            [
                8915,
                8936
            ],
            [
                8936,
                8970
            ],
            [
                8970,
                9004
            ],
            [
                9004,
                9051
            ],
            [
                9051,
                9062
            ],
            [
                9063,
                9102
            ],
            [
                9102,
                9115
            ],
            [
                9116,
                9122
            ],
            [
                9122,
                9140
            ],
            [
                9140,
                9212
            ],
            [
                9213,
                9292
            ],
            [
                9293,
                9336
            ],
            [
                9336,
                9371
            ],
            [
                9381,
                9388
            ],
            [
                9389,
                9455
            ],
            [
                9456,
                9458
            ],
            [
                9459,
                9469
            ],
            [
                9487,
                9490
            ],
            [
                9495,
                9500
            ],
            [
                9510,
                9525
            ],
            [
                9525,
                9527
            ],
            [
                9527,
                9598
            ],
            [
                9609,
                9611
            ],
            [
                9612,
                9658
            ],
            [
                9658,
                9666
            ],
            [
                9667,
                9693
            ],
            [
                9694,
                9785
            ],
            [
                9792,
                9827
            ],
            [
                9827,
                9829
            ],
            [
                9829,
                9885
            ],
            [
                9885,
                9887
            ],
            [
                9887,
                9888
            ],
            [
                9888,
                9912
            ],
            [
                9919,
                9922
            ],
            [
                9922,
                9949
            ],
            [
                9949,
                9971
            ],
            [
                9971,
                9998
            ],
            [
                10001,
                10002
            ],
            [
                10005,
                10007
            ],
            [
                10008,
                10031
            ],
            [
                10031,
                10055
            ],
            [
                10055,
                10076
            ],
            [
                10076,
                10078
            ],
            [
                10078,
                10079
            ],
            [
                10083,
                10086
            ],
            [
                10087,
                10103
            ],
            [
                10104,
                10140
            ],
            [
                10140,
                10182
            ],
            [
                10182,
                10202
            ],
            [
                10206,
                10211
            ],
            [
                10212,
                10214
            ],
            [
                10221,
                10235
            ],
            [
                10235,
                10237
            ],
            [
                10237,
                10238
            ],
            [
                10238,
                10254
            ],
            [
                10254,
                10275
            ],
            [
                10276,
                10328
            ],
            [
                10328,
                10367
            ],
            [
                10368,
                10409
            ],
            [
                10409,
                10425
            ],
            [
                10425,
                10426
            ],
            [
                10426,
                10506
            ],
            [
                10506,
                10544
            ],
            [
                10544,
                10583
            ],
            [
                10583,
                10585
            ],
            [
                10585,
                10601
            ],
            [
                10601,
                10628
            ],
            [
                10628,
                10641
            ],
            [
                10641,
                10681
            ],
            [
                10681,
                10735
            ],
            [
                10738,
                10789
            ],
            [
                10789,
                10805
            ],
            [
                10808,
                10826
            ],
            [
                10826,
                10828
            ],
            [
                10828,
                10865
            ],
            [
                10866,
                10880
            ],
            [
                10880,
                10885
            ],
            [
                10889,
                10894
            ],
            [
                10895,
                10906
            ],
            [
                10906,
                10938
            ],
            [
                10938,
                10954
            ],
            [
                10956,
                10970
            ],
            [
                10970,
                10972
            ],
            [
                10972,
                10989
            ],
            [
                10989,
                11020
            ],
            [
                11020,
                11046
            ],
            [
                11046,
                11069
            ],
            [
                11069,
                11128
            ],
            [
                11131,
                11132
            ],
            [
                11132,
                11151
            ],
            [
                11151,
                11156
            ],
            [
                11159,
                11169
            ],
            [
                11175,
                11189
            ],
            [
                11189,
                11288
            ],
            [
                11288,
                11364
            ],
            [
                11364,
                11373
            ],
            [
                11374,
                11404
            ],
            [
                11404,
                11441
            ],
            [
                11441,
                11449
            ],
            [
                11449,
                11469
            ],
            [
                11469,
                11536
            ],
            [
                11536,
                11553
            ],
            [
                11553,
                11638
            ],
            [
                11641,
                11661
            ],
            [
                11661,
                11678
            ],
            [
                11678,
                11724
            ],
            [
                11724,
                11727
            ],
            [
                11728,
                11769
            ],
            [
                11769,
                11826
            ],
            [
                11826,
                11927
            ],
            [
                11946,
                11948
            ],
            [
                11949,
                11960
            ],
            [
                11961,
                11973
            ],
            [
                11973,
                12076
            ],
            [
                12076,
                12078
            ],
            [
                12078,
                12142
            ],
            [
                12147,
                12159
            ],
            [
                12159,
                12213
            ],
            [
                12214,
                12249
            ],
            [
                12249,
                12316
            ],
            [
                12331,
                12334
            ],
            [
                12343,
                12350
            ],
            [
                12354,
                12362
            ],
            [
                12362,
                12403
            ],
            [
                12403,
                12408
            ],
            [
                12409,
                12443
            ],
            [
                12443,
                12444
            ],
            [
                12445,
                12452
            ],
            [
                12452,
                12473
            ],
            [
                12476,
                12531
            ],
            [
                12531,
                12578
            ],
            [
                12578,
                12614
            ],
            [
                12615,
                12621
            ],
            [
                12622,
                12643
            ],
            [
                12643,
                12645
            ],
            [
                12645,
                12682
            ],
            [
                12685,
                12713
            ],
            [
                12714,
                12719
            ],
            [
                12722,
                12726
            ],
            [
                12726,
                12728
            ],
            [
                12728,
                12782
            ],
            [
                12786,
                12789
            ],
            [
                12802,
                12854
            ],
            [
                12855,
                12883
            ],
            [
                12884,
                12969
            ],
            [
                12969,
                12984
            ],
            [
                12990,
                13003
            ],
            [
                13003,
                13013
            ],
            [
                13013,
                13021
            ],
            [
                13021,
                13052
            ],
            [
                13052,
                13057
            ],
            [
                13064,
                13083
            ],
            [
                13083,
                13085
            ],
            [
                13085,
                13094
            ],
            [
                13104,
                13159
            ],
            [
                13159,
                13200
            ],
            [
                13200,
                13215
            ],
            [
                13215,
                13227
            ],
            [
                13227,
                13238
            ],
            [
                13243,
                13339
            ],
            [
                13340,
                13436
            ],
            [
                13436,
                13460
            ],
            [
                13461,
                13478
            ],
            [
                13479,
                13482
            ],
            [
                13483,
                13487
            ],
            [
                13488,
                13534
            ]
        ],
        "row_chars": [
            [
                0,
                157
            ],
            [
                157,
                222
            ],
            [
                222,
                253
            ],
            [
                253,
                301
            ],
            [
                301,
                382
            ],
            [
                382,
                445
            ],
            [
                445,
                485
            ],
            [
                485,
                538
            ],
            [
                538,
                620
            ],
            [
                620,
                712
            ],
            [
                712,
                762
            ],
            [
                762,
                771
            ],
            [
                771,
                780
            ],
            [
                780,
                945
            ],
            [
                945,
                985
            ],
            [
                985,
                1036
            ],
            [
                1036,
                1057
            ],
            [
                1057,
                1089
            ],
            [
                1089,
                1089
            ],
            [
                1089,
                1177
            ],
            [
                1177,
                1217
            ],
            [
                1217,
                1359
            ],
            [
                1359,
                1452
            ],
            [
                1452,
                1525
            ],
            [
                1525,
                1595
            ],
            [
                1595,
                1675
            ],
            [
                1675,
                1705
            ],
            [
                1705,
                1871
            ],
            [
                1871,
                1921
            ],
            [
                1921,
                1995
            ],
            [
                1995,
                2017
            ],
            [
                2017,
                2017
            ],
            [
                2017,
                2017
            ],
            [
                2017,
                2017
            ],
            [
                2017,
                2057
            ],
            [
                2057,
                2128
            ],
            [
                2128,
                2187
            ],
            [
                2187,
                2187
            ],
            [
                2187,
                2326
            ],
            [
                2326,
                2386
            ],
            [
                2386,
                2412
            ],
            [
                2412,
                2427
            ],
            [
                2427,
                2427
            ],
            [
                2427,
                2427
            ],
            [
                2427,
                2468
            ],
            [
                2468,
                2516
            ],
            [
                2516,
                2604
            ],
            [
                2604,
                2733
            ],
            [
                2733,
                2878
            ],
            [
                2878,
                2942
            ],
            [
                2942,
                2947
            ],
            [
                2947,
                2976
            ],
            [
                2976,
                2976
            ],
            [
                2976,
                2976
            ],
            [
                2976,
                2976
            ],
            [
                2976,
                3030
            ],
            [
                3030,
                3030
            ],
            [
                3030,
                3078
            ],
            [
                3078,
                3135
            ],
            [
                3135,
                3182
            ],
            [
                3182,
                3267
            ],
            [
                3267,
                3315
            ],
            [
                3315,
                3355
            ],
            [
                3355,
                3391
            ],
            [
                3391,
                3415
            ],
            [
                3415,
                3429
            ],
            [
                3429,
                3476
            ],
            [
                3476,
                3535
            ],
            [
                3535,
                3535
            ],
            [
                3535,
                3632
            ],
            [
                3632,
                3675
            ],
            [
                3675,
                3710
            ],
            [
                3710,
                3735
            ],
            [
                3735,
                3782
            ],
            [
                3782,
                3839
            ],
            [
                3839,
                3839
            ],
            [
                3839,
                3917
            ],
            [
                3917,
                3947
            ],
            [
                3947,
                3960
            ],
            [
                3960,
                4038
            ],
            [
                4038,
                4084
            ],
            [
                4084,
                4111
            ],
            [
                4111,
                4136
            ],
            [
                4136,
                4145
            ],
            [
                4145,
                4279
            ],
            [
                4279,
                4279
            ],
            [
                4279,
                4279
            ],
            [
                4279,
                4279
            ],
            [
                4279,
                4279
            ],
            [
                4279,
                4293
            ],
            [
                4293,
                4299
            ],
            [
                4299,
                4315
            ],
            [
                4315,
                4323
            ],
            [
                4323,
                4323
            ],
            [
                4323,
                4323
            ],
            [
                4323,
                4323
            ],
            [
                4323,
                4343
            ],
            [
                4343,
                4358
            ],
            [
                4358,
                4378
            ],
            [
                4378,
                4378
            ],
            [
                4378,
                4394
            ],
            [
                4394,
                4422
            ],
            [
                4422,
                4445
            ],
            [
                4445,
                4467
            ],
            [
                4467,
                4490
            ],
            [
                4490,
                4545
            ],
            [
                4545,
                4589
            ],
            [
                4589,
                4619
            ],
            [
                4619,
                4721
            ],
            [
                4721,
                4751
            ],
            [
                4751,
                4751
            ],
            [
                4751,
                4751
            ],
            [
                4751,
                4751
            ],
            [
                4751,
                4751
            ],
            [
                4751,
                4813
            ],
            [
                4813,
                4864
            ],
            [
                4864,
                4918
            ],
            [
                4918,
                4967
            ],
            [
                4967,
                5013
            ],
            [
                5013,
                5102
            ],
            [
                5102,
                5216
            ],
            [
                5216,
                5333
            ],
            [
                5333,
                5380
            ],
            [
                5380,
                5488
            ],
            [
                5488,
                5570
            ],
            [
                5570,
                5652
            ],
            [
                5652,
                5695
            ],
            [
                5695,
                5755
            ],
            [
                5755,
                5801
            ],
            [
                5801,
                5944
            ],
            [
                5944,
                6010
            ],
            [
                6010,
                6162
            ],
            [
                6162,
                6216
            ],
            [
                6216,
                6270
            ],
            [
                6270,
                6566
            ],
            [
                6566,
                6607
            ],
            [
                6607,
                6665
            ],
            [
                6665,
                6717
            ],
            [
                6717,
                6748
            ],
            [
                6748,
                6778
            ],
            [
                6778,
                6778
            ],
            [
                6778,
                6884
            ],
            [
                6884,
                6931
            ],
            [
                6931,
                6968
            ],
            [
                6968,
                7020
            ],
            [
                7020,
                7107
            ],
            [
                7107,
                7107
            ],
            [
                7107,
                7142
            ],
            [
                7142,
                7199
            ],
            [
                7199,
                7540
            ],
            [
                7540,
                7660
            ],
            [
                7660,
                7758
            ],
            [
                7758,
                7793
            ],
            [
                7793,
                7825
            ],
            [
                7825,
                7919
            ],
            [
                7919,
                7964
            ],
            [
                7964,
                8094
            ],
            [
                8094,
                8194
            ],
            [
                8194,
                8329
            ],
            [
                8329,
                8329
            ],
            [
                8329,
                8503
            ],
            [
                8503,
                8503
            ],
            [
                8503,
                8666
            ],
            [
                8666,
                8718
            ],
            [
                8718,
                8827
            ],
            [
                8827,
                8872
            ],
            [
                8872,
                8936
            ],
            [
                8936,
                8970
            ],
            [
                8970,
                9004
            ],
            [
                9004,
                9004
            ],
            [
                9004,
                9051
            ],
            [
                9051,
                9102
            ],
            [
                9102,
                9140
            ],
            [
                9140,
                9140
            ],
            [
                9140,
                9336
            ],
            [
                9336,
                9389
            ],
            [
                9389,
                9389
            ],
            [
                9389,
                9389
            ],
            [
                9389,
                9527
            ],
            [
                9527,
                9611
            ],
            [
                9611,
                9658
            ],
            [
                9658,
                9694
            ],
            [
                9694,
                9829
            ],
            [
                9829,
                9887
            ],
            [
                9887,
                9922
            ],
            [
                9922,
                9949
            ],
            [
                9949,
                9971
            ],
            [
                9971,
                10001
            ],
            [
                10001,
                10031
            ],
            [
                10031,
                10055
            ],
            [
                10055,
                10078
            ],
            [
                10078,
                10140
            ],
            [
                10140,
                10182
            ],
            [
                10182,
                10237
            ],
            [
                10237,
                10254
            ],
            [
                10254,
                10328
            ],
            [
                10328,
                10409
            ],
            [
                10409,
                10425
            ],
            [
                10425,
                10506
            ],
            [
                10506,
                10544
            ],
            [
                10544,
                10585
            ],
            [
                10585,
                10601
            ],
            [
                10601,
                10628
            ],
            [
                10628,
                10641
            ],
            [
                10641,
                10641
            ],
            [
                10641,
                10641
            ],
            [
                10641,
                10641
            ],
            [
                10641,
                10641
            ],
            [
                10641,
                10681
            ],
            [
                10681,
                10789
            ],
            [
                10789,
                10828
            ],
            [
                10828,
                10865
            ],
            [
                10865,
                10865
            ],
            [
                10865,
                10880
            ],
            [
                10880,
                10938
            ],
            [
                10938,
                10972
            ],
            [
                10972,
                10989
            ],
            [
                10989,
                11020
            ],
            [
                11020,
                11046
            ],
            [
                11046,
                11069
            ],
            [
                11069,
                11131
            ],
            [
                11131,
                11131
            ],
            [
                11131,
                11151
            ],
            [
                11151,
                11189
            ],
            [
                11189,
                11288
            ],
            [
                11288,
                11364
            ],
            [
                11364,
                11374
            ],
            [
                11374,
                11404
            ],
            [
                11404,
                11441
            ],
            [
                11441,
                11449
            ],
            [
                11449,
                11469
            ],
            [
                11469,
                11536
            ],
            [
                11536,
                11553
            ],
            [
                11553,
                11641
            ],
            [
                11641,
                11641
            ],
            [
                11641,
                11641
            ],
            [
                11641,
                11661
            ],
            [
                11661,
                11678
            ],
            [
                11678,
                11724
            ],
            [
                11724,
                11769
            ],
            [
                11769,
                11826
            ],
            [
                11826,
                11973
            ],
            [
                11973,
                12078
            ],
            [
                12078,
                12159
            ],
            [
                12159,
                12213
            ],
            [
                12213,
                12213
            ],
            [
                12213,
                12249
            ],
            [
                12249,
                12362
            ],
            [
                12362,
                12403
            ],
            [
                12403,
                12445
            ],
            [
                12445,
                12445
            ],
            [
                12445,
                12445
            ],
            [
                12445,
                12475
            ],
            [
                12475,
                12475
            ],
            [
                12475,
                12531
            ],
            [
                12531,
                12578
            ],
            [
                12578,
                12645
            ],
            [
                12645,
                12685
            ],
            [
                12685,
                12685
            ],
            [
                12685,
                12685
            ],
            [
                12685,
                12685
            ],
            [
                12685,
                12728
            ],
            [
                12728,
                12969
            ],
            [
                12969,
                13003
            ],
            [
                13003,
                13021
            ],
            [
                13021,
                13052
            ],
            [
                13052,
                13085
            ],
            [
                13085,
                13085
            ],
            [
                13085,
                13159
            ],
            [
                13159,
                13200
            ],
            [
                13200,
                13215
            ],
            [
                13215,
                13227
            ],
            [
                13227,
                13340
            ],
            [
                13340,
                13436
            ],
            [
                13436,
                13534
            ]
        ]
    }
}