{
    "original": {
        "text": "Mr. Palliser was one of those politicians in possessing whom England has perhaps more reason to be proud than of any other of her resources, and who, as a body, give to her that exquisite combination of conservatism and progress which is her present strength and best security for the future. He could afford to learn to be a statesman, and had the industry wanted for such training. He was born in the purple, noble himself, and heir to the highest rank as well as one of the greatest fortunes of the country, already very rich, surrounded by all the temptations of luxury and pleasure; and yet he devoted himself to work with the grinding energy of a young penniless barrister labouring for a penniless wife, and did so without any motive more selfish than that of being counted in the roll of the public servants of England. He was not a brilliant man, and understood well that such was the case. He was now listened to in the House, as the phrase goes; but he was listened to as a laborious man, who was in earnest in what he did, who got up his facts with accuracy, and who, dull though he be, was worthy of confidence. And he was very dull. He rather prided himself on being dull, and on conquering in spite of his dullness. He never allowed himself a joke in his speeches, nor attempted even the smallest flourish of rhetoric. He was very careful in his language, labouring night and day to learn to express himself with accuracy, with no needless repetition of words, perspicuously with regard to the special object he might have in view. He had taught himself to believe that oratory, as oratory, was a sin against that honesty in politics by which he strove to guide himself. He desired to use words for the purpose of teaching things which he knew and which others did not know; and he desired also to be honoured for his knowledge. But he had no desire to be honoured for the language in which his knowledge was conveyed. He was an upright, thin, laborious man; who by his parts alone could have served no political party materially, but whose parts were sufficient to make his education, integrity, and industry useful in the highest degree. It is the trust which such men inspire which makes them so serviceable;--trust not only in their labour,--for any man rising from the mass of the people may be equally laborious; nor yet simply in their honesty and patriotism. The confidence is given to their labour, honesty, and patriotism joined to such a personal stake in the country as gives them a weight and ballast which no politician in England can possess without it.\nIf he was dull as a statesman he was more dull in private life, and it may be imagined that such a woman as his wife would find some difficulty in making his society the source of her happiness. Their marriage, in a point of view regarding business, had been a complete success,--and a success, too, when on the one side, that of Lady Glencora, there had been terrible dangers of shipwreck, and when on his side also there had been some little fears of a mishap. As regards her it has been told how near she went to throwing herself, with all her vast wealth, into the arms of a young man, whom no father, no guardian could have regarded as a well-chosen husband for any girl;--one who as yet had shown no good qualities, who had been a spendthrift, unprincipled, and debauched. Alas, she had loved him! It is possible that her love and her wealth might have turned him from evil to good. But who would have ventured to risk her,--I will not say her and her vast inheritances,--on such a chance? That evil, however, had been prevented, and those about her had managed to marry her to a young man, very steady by nature, with worldly prospects as brilliant as her own, and with a station than which the world offers nothing higher. His little threatened mischance,--a passing fancy for a married lady who was too wise to receive vows which were proffered not in the most ardent manner,--had, from special reasons, given some little alarm to his uncle, which had just sufficed at the time to make so very judicious a marriage doubly pleasant to that noble duke, So that all things and all people had conspired to shower substantial comforts on the heads of this couple, when they were joined together, and men and women had not yet ceased to declare how happy were both in the accumulated gifts of fortune.\nAnd as regards Mr. Palliser, I think that his married life, and the wife, whom he certainly had not chosen, but who had dropped upon him, suited him admirably. He wanted great wealth for that position at which he aimed. He had been rich before his marriage with his own wealth,--so rich that he could throw thousands away if he wished it; but for him and his career was needed that colossal wealth which would make men talk about it,--which would necessitate an expansive expenditure, reaching far and wide, doing nothing, or less than nothing, for his own personal comfort, but giving to him at once that rock-like solidity which is so necessary to our great aristocratic politicians. And his wife was, as far as he knew, all that he desired. He had not dabbled much in the fountains of Venus, though he had forgotten himself once, and sinned in coveting another man's wife. But his sin then had hardly polluted his natural character, and his desire had been of a kind which was almost more gratified in its disappointment than it would have been in its fruition. On the morning after the lady had frowned on him he had told himself that he was very well out of that trouble. He knew that it would never be for him to hang up on the walls of a temple a well-worn lute as a votive offering when leaving the pursuits of love. _Idoneus puellis_ he never could have been. So he married Lady Glencora and was satisfied. The story of Burgo Fitzgerald was told to him, and he supposed that most girls had some such story to tell. He thought little about it, and by no means understood her when she said to him, with all the impressiveness which she could throw into the words, \"You must know that I have really loved him.\" \"You must love me now,\" he had replied with a smile; and then as regarded his mind, the thing was over. And since his marriage he had thought that things matrimonial had gone well with him, and with her too. He gave her almost unlimited power of enjoying her money, and interfered but little in her way of life. Sometimes he would say a word of caution to her with reference to those childish ways which hardly became the dull dignity of his position; and his words then would have in them something of unintentional severity,--whether instigated or not by the red-haired Radical Member of Parliament, I will not pretend to say;--but on the whole he was contented and loved his wife, as he thought, very heartily, and at least better than he loved any one else. One cause of unhappiness, or rather one doubt as to his entire good fortune, was beginning to make itself felt, as his wife had to her sorrow already discovered. He had hoped that before this he might have heard that she would give him a child. But the days were young yet for that trouble, and the care had not become a sorrow.\nBut this judicious arrangement as to properties, this well-ordered alliance between families, had not perhaps suited her as well as it had suited him. I think that she might have learned to forget her early lover, or to look back upon it with a soft melancholy hardly amounting to regret, had her new lord been more tender in his ways with her. I do not know that Lady Glencora's heart was made of that stern stuff which refuses to change its impressions; but it was a heart, and it required food. To love and fondle someone,--to be loved and fondled, were absolutely necessary to her happiness. She wanted the little daily assurance of her supremacy in the man's feelings, the constant touch of love, half accidental half contrived, the passing glance of the eye telling perhaps of some little joke understood only between them two rather than of love, the softness of an occasional kiss given here and there when chance might bring them together, some half-pretended interest in her little doings, a nod, a wink, a shake of the head, or even a pout. It should have been given to her to feed upon such food as this daily, and then she would have forgotten Burgo Fitzgerald. But Mr. Palliser understood none of these things; and therefore the image of Burgo Fitzgerald in all his beauty was ever before her eyes.\nBut not the less was Mr. Palliser a prosperous man, as to the success of whose career few who knew him had much doubt. It might be written in the book of his destiny that he would have to pass through some violent domestic trouble, some ruin in the hopes of his home, of a nature to destroy then and for ever the worldly prospects of other men. But he was one who would pass through such violence, should it come upon him, without much scathe. To lose his influence with his party would be worse to him than to lose his wife, and public disgrace would hit him harder than private dishonour.\nAnd the present was the very moment in which success was, as was said, coming to him. He had already held laborious office under the Crown, but had never sat in the Cabinet. He had worked much harder than Cabinet Ministers generally work,--but hitherto had worked without any reward that was worth his having. For the stipend which he had received had been nothing to him,--as the great stipend which he would receive, if his hopes were true, would also be nothing to him. To have ascendancy over other men, to be known by his countrymen as one of their real rulers, to have an actual and acknowledged voice in the management of nations,--those were the rewards for which he looked; and now in truth it seemed as though they were coming to him. It was all but known that the existing Chancellor of the Exchequer would separate himself from the Government, carrying various others with him, either before or immediately consequent on the meeting of Parliament;--and it was all but known, also, that Mr. Palliser would fill his place, taking that high office at once, although he had never hitherto sat in that august assembly which men call the Cabinet. He could thus afford to put up with the small everyday calamity of having a wife who loved another man better than she loved him.\nThe presence of the Duke of St. Bungay at Matching was assumed to be a sure sign of Mr. Palliser's coming triumph. The Duke was a statesman of a very different class, but he also had been eminently successful as an aristocratic pillar of the British Constitutional Republic. He was a minister of very many years' standing, being as used to cabinet sittings as other men are to their own armchairs; but he had never been a hard-working man. Though a constant politician, he had ever taken politics easy whether in office or out. The world had said before now that the Duke might be Premier, only that he would not take the trouble. He had been consulted by a very distinguished person,--so the papers had said more than once,--as to the making of Prime Ministers. His voice in council was esteemed to be very great. He was regarded as a strong rock of support to the liberal cause, and yet nobody ever knew what he did; nor was there much record of what he said. The offices which he held, or had held, were generally those to which no very arduous duties were attached. In severe debates he never took upon himself the brunt of opposition oratory. What he said in the House was generally short and pleasant,--with some slight, drolling, undercurrent of uninjurious satire running through it. But he was a walking miracle of the wisdom of common sense. He never lost his temper. He never made mistakes. He never grew either hot or cold in a cause. He was never reckless in politics, and never cowardly. He snubbed no man, and took snubbings from no man. He was a Knight of the Garter, a Lord Lieutenant of his county, and at sixty-two had his digestion unimpaired and his estate in excellent order. He was a great buyer of pictures, which, perhaps, he did not understand, and a great collector of books which certainly he never read. All the world respected him, and he was a man to whom the respect of all the world was as the breath of his nostrils.\nBut even he was not without his peacock on the wall, his skeleton in the closet, his thorn in his side; though the peacock did not scream loud, the skeleton was not very terrible in his anatomical arrangement, nor was the thorn likely to fester to a gangrene. The Duke was always in awe about his wife.\nHe was ever uneasy about his wife, but it must not be supposed that he feared the machinations of any Burgo Fitzgerald as being destructive of his domestic comfort. The Duchess was and always had been all that is proper. Ladies in high rank, when gifted with excelling beauty, have often been made the marks of undeserved calumny;--but no breath of slander had ever touched her name. I doubt if any man alive had ever had the courage even to wink at her since the Duke had first called her his own. Nor was she a spendthrift, or a gambler. She was not fast in her tastes, or given to any pursuit that was objectionable. She was simply a fool, and as a fool was ever fearing that she was the mark of ridicule. In all such miseries she would complain sorrowfully, piteously, and occasionally very angrily, to her dear Duke and protector; till sometimes her dear Duke did not quite know what to do with her or how to protect her. It did not suit him, a Knight of the Garter and a Duke of St. Bungay, to beg mercy for that poor wife of his from such a one as Mrs. Conway Sparkes; nor would it be more in his way to lodge a formal complaint against that lady before his host or hostess,--as one boy at school may sometimes do as regards another. \"If you don't like the people, my dear, we will go away,\" he said to her late on that evening of which we have spoken. \"No,\" she replied, \"I do not wish to go away. I have said that we would stay till December, and Longroyston won't be ready before that. But I think that something ought to be done to silence that woman.\" And the accent came strong upon \"something,\" and then again with terrific violence upon \"woman.\"\nThe Duke did not know how to silence Mrs. Conway Sparkes. It was a great principle of his life never to be angry with any one. How could he get at Mrs. Conway Sparkes? \"I don't think she is worth your attention,\" said the husband. \"That's all very well, Duke,\" said the wife, \"and perhaps she is not. But I find her in this house, and I don't like to be laughed at. I think Lady Glencora should make her know her place.\"\n\"Lady Glencora is very young, my dear.\"\n\"I don't know about being so very young,\" said the Duchess, whose ear had perhaps caught some little hint of poor Lady Glencora's almost unintentional mimicry. Now as appeals of this kind were being made frequently to the Duke, and as he was often driven to say some word, of which he himself hardly approved, to some one in protection of his Duchess, he was aware that the matter was an annoyance, and at times almost wished that her Grace was at--Longroyston.\nAnd there was a third politician staying at Matching Priory who had never yet risen to the rank of a statesman, but who had his hopes. This was Mr. Bott, the member for St. Helens, whom Lady Glencora had described as a man who stood about, with red hair,--and perhaps told tales of her to her husband. Mr. Bott was a person who certainly had had some success in life and who had won it for himself. He was not very young, being at this time only just on the right side of fifty. He was now enjoying his second session in Parliament, having been returned as a pledged disciple of the Manchester school. Nor had he apparently been false to his pledges. At St. Helens he was still held to be a good man and true. But they who sat on the same side with him in the House and watched his political manoeuvres, knew that he was striving hard to get his finger into the public pie. He was not a rich man, though he had made calico and had got into Parliament. And though he claimed to be a thoroughgoing Radical, he was a man who liked to live with aristocrats, and was fond of listening to the whispers of such as the Duke of St. Bungay or Mr. Palliser. It was supposed that he did understand something of finance. He was at any rate great in figures; and as he was possessed of much industry, and was obedient withal, he was a man who might make himself useful to a Chancellor of the Exchequer ambitious of changes.\nThere are men who get into such houses as Matching Priory and whose presence there is a mystery to many;--as to whom the ladies of the house never quite understand why they are entertaining such a guest. \"And Mr. Bott is coming,\" Mr. Palliser had said to his wife. \"Mr. Bott!\" Lady Glencora had answered. \"Goodness me! who is Mr. Bott?\" \"He is member for St. Helens,\" said Mr. Palliser. \"A very serviceable man in his way.\" \"And what am I to do with him?\" asked Lady Glencora. \"I don't know that you can do anything with him. He is a man who has a great deal of business, and I dare say he will spend most of his time in the library.\" So Mr. Bott arrived. But though a huge pile of letters and papers came to him every morning by post, he unfortunately did not seem to spend much of his time in the library. Perhaps he had not found the clue to that lost apartment. Twice he went out shooting, but as on the first day he shot the keeper, and on the second very nearly shot the Duke, he gave that up. Hunting he declined, though much pressed to make an essay in that art by Jeffrey Palliser. He seemed to spend his time, as Lady Glencora said, in standing about,--except at certain times when he was closeted with Mr. Palliser, and when, it may be presumed, he made himself useful. On such days he would be seen at the hour of lunch with fingers much stained with ink, and it was generally supposed that on those occasions he had been counting up taxes and calculating the effect of great financial changes. He was a tall, wiry, strong man, with a bald head and bristly red beard, which, however, was cut off from his upper and under lip. This was unfortunate, as had he hidden his mouth he would not have been in so marked a degree an ugly man. His upper lip was very long, and his mouth was mean. But he had found that without the help of a razor to these parts he could not manage his soup to his satisfaction, and preferring cleanliness to beauty had shaved himself accordingly.\n\"I shouldn't dislike Mr. Bott so much,\" Lady Glencora said to her husband, \"if he didn't rub his hands and smile so often, and seem to be going to say something when he really is not going to say anything.\"\n\"I don't think you need trouble yourself about him, my dear,\" Mr. Palliser had answered.\n\"But when he looks at me in that way, I can't help stopping, as I think he is going to speak; and then he always says, 'Can I do anything for you, Lady Glen-cowrer?'\"\nShe instantly saw that her husband did not like this. \"Don't be angry with me, dear,\" she said. \"You must admit that he is rather a bore.\"\n\"I am not at all angry, Glencora,\" said the husband; \"and if you insist upon it, I will see that he leaves;--and in such case will of course never ask him again. But that might be prejudicial to me, as he is a man whom I trust in politics, and who may perhaps be serviceable to me.\"\nOf course Lady Glencora declared that Mr. Bott might remain as long as he and her husband desired, and of course she mentioned his name no more to Mr. Palliser; but from that time forth she regarded Mr. Bott as an enemy, and felt also that Mr. Bott regarded her in the same light.\nWhen it was known among outside politicians that the Duke of St. Bungay was staying at Matching Priory, outside politicians became more sure than ever that Mr. Palliser would be the new Chancellor of the Exchequer. The old minister and the young minister were of course arranging matters together. But I doubt whether Mr. Palliser and the Duke ever spoke on any such topic during the entire visit. Though Mr. Bott was occasionally closeted with Mr. Palliser, the Duke never troubled himself with such closetings. He went out shooting--on his pony, read his newspaper, wrote his notes, and looked with the eye of a connoisseur over all Mr. Palliser's farming apparatus. \"You seem to have a good man, I should say,\" said the Duke. \"What! Hubbings? Yes;--he was a legacy from my uncle when he gave me up the Priory.\" \"A very good man, I should say. Of course he won't make it pay; but he'll make it look as though it did;--which is the next best thing. I could never get rent out of land that I farmed myself,--never.\" \"I suppose not,\" said Mr. Palliser, who did not care much about it. The Duke would have talked to him by the hour together about farming had Mr. Palliser been so minded; but he talked to him very little about politics. Nor during the whole time of his stay at Matching did the Duke make any other allusion to Mr. Palliser's hopes as regarded the ministry, than that in which he had told Lady Glencora at the dinner-table that her husband's ambition was the highest by which any man could be moved.\nBut Mr. Bott was sometimes honoured by a few words with the Duke.\n\"We shall muster pretty strong, your Grace,\" Mr. Bott had said to him one day before dinner.\n\"That depends on how the changes go,\" said the Duke.\n\"I suppose there will be a change?\"\n\"Oh yes; there'll be a change,--certainly, I should say. And it will be in your direction.\"\n\"And in Palliser's?\"\n\"Yes; I should think so;--that is, if it suits him. By-the-by, Mr. Bott--\" Then there was a little whispered communication, in which perhaps Mr. Bott was undertaking some commission of that nature which Lady Glencora had called \"telling.\"",
        "paragraph_chars": [
            [
                0,
                2584
            ],
            [
                2584,
                4389
            ],
            [
                4389,
                7197
            ],
            [
                7197,
                8510
            ],
            [
                8510,
                9101
            ],
            [
                9101,
                10384
            ],
            [
                10384,
                12335
            ],
            [
                12335,
                12638
            ],
            [
                12638,
                14299
            ],
            [
                14299,
                14720
            ],
            [
                14720,
                14760
            ],
            [
                14760,
                15222
            ],
            [
                15222,
                16632
            ],
            [
                16632,
                18614
            ],
            [
                18614,
                18821
            ],
            [
                18821,
                18910
            ],
            [
                18910,
                19077
            ],
            [
                19077,
                19216
            ],
            [
                19216,
                19499
            ],
            [
                19499,
                19780
            ],
            [
                19780,
                21294
            ],
            [
                21294,
                21360
            ],
            [
                21360,
                21453
            ],
            [
                21453,
                21506
            ],
            [
                21506,
                21542
            ],
            [
                21542,
                21634
            ],
            [
                21634,
                21655
            ],
            [
                21655,
                21893
            ]
        ],
        "segment_chars": [
            [
                0,
                293
            ],
            [
                293,
                384
            ],
            [
                384,
                828
            ],
            [
                828,
                900
            ],
            [
                900,
                1125
            ],
            [
                1125,
                1147
            ],
            [
                1147,
                1231
            ],
            [
                1231,
                1334
            ],
            [
                1334,
                1547
            ],
            [
                1547,
                1686
            ],
            [
                1686,
                1844
            ],
            [
                1844,
                1934
            ],
            [
                1934,
                2155
            ],
            [
                2155,
                2382
            ],
            [
                2382,
                2584
            ],
            [
                2584,
                2779
            ],
            [
                2779,
                3047
            ],
            [
                3047,
                3363
            ],
            [
                3363,
                3388
            ],
            [
                3388,
                3473
            ],
            [
                3473,
                3580
            ],
            [
                3580,
                3815
            ],
            [
                3815,
                4389
            ],
            [
                4389,
                4549
            ],
            [
                4549,
                4609
            ],
            [
                4609,
                5075
            ],
            [
                5075,
                5133
            ],
            [
                5133,
                5265
            ],
            [
                5265,
                5454
            ],
            [
                5454,
                5566
            ],
            [
                5566,
                5714
            ],
            [
                5714,
                5758
            ],
            [
                5758,
                5805
            ],
            [
                5805,
                5913
            ],
            [
                5913,
                6106
            ],
            [
                6106,
                6210
            ],
            [
                6210,
                6314
            ],
            [
                6314,
                6418
            ],
            [
                6418,
                6868
            ],
            [
                6868,
                7030
            ],
            [
                7030,
                7113
            ],
            [
                7113,
                7197
            ],
            [
                7197,
                7348
            ],
            [
                7348,
                7542
            ],
            [
                7542,
                7695
            ],
            [
                7695,
                7793
            ],
            [
                7793,
                8249
            ],
            [
                8249,
                8372
            ],
            [
                8372,
                8510
            ],
            [
                8510,
                8629
            ],
            [
                8629,
                8855
            ],
            [
                8855,
                8954
            ],
            [
                8954,
                9101
            ],
            [
                9101,
                9187
            ],
            [
                9187,
                9275
            ],
            [
                9275,
                9411
            ],
            [
                9411,
                9574
            ],
            [
                9574,
                9846
            ],
            [
                9846,
                10254
            ],
            [
                10254,
                10384
            ],
            [
                10384,
                10499
            ],
            [
                10499,
                10659
            ],
            [
                10659,
                10824
            ],
            [
                10824,
                10912
            ],
            [
                10912,
                11015
            ],
            [
                11015,
                11147
            ],
            [
                11147,
                11199
            ],
            [
                11199,
                11346
            ],
            [
                11346,
                11454
            ],
            [
                11454,
                11532
            ],
            [
                11532,
                11676
            ],
            [
                11676,
                11736
            ],
            [
                11736,
                11762
            ],
            [
                11762,
                11786
            ],
            [
                11786,
                11831
            ],
            [
                11831,
                11886
            ],
            [
                11886,
                11937
            ],
            [
                11937,
                12082
            ],
            [
                12082,
                12217
            ],
            [
                12217,
                12335
            ],
            [
                12335,
                12595
            ],
            [
                12595,
                12638
            ],
            [
                12638,
                12803
            ],
            [
                12803,
                12859
            ],
            [
                12859,
                13022
            ],
            [
                13022,
                13137
            ],
            [
                13137,
                13178
            ],
            [
                13178,
                13258
            ],
            [
                13258,
                13347
            ],
            [
                13347,
                13565
            ],
            [
                13565,
                13879
            ],
            [
                13879,
                13998
            ],
            [
                13998,
                14044
            ],
            [
                14044,
                14134
            ],
            [
                14134,
                14202
            ],
            [
                14202,
                14299
            ],
            [
                14299,
                14357
            ],
            [
                14357,
                14426
            ],
            [
                14426,
                14467
            ],
            [
                14467,
                14530
            ],
            [
                14530,
                14600
            ],
            [
                14600,
                14665
            ],
            [
                14665,
                14720
            ],
            [
                14720,
                14760
            ],
            [
                14760,
                14920
            ],
            [
                14920,
                15222
            ],
            [
                15222,
                15357
            ],
            [
                15357,
                15524
            ],
            [
                15524,
                15621
            ],
            [
                15621,
                15701
            ],
            [
                15701,
                15824
            ],
            [
                15824,
                15873
            ],
            [
                15873,
                15932
            ],
            [
                15932,
                16096
            ],
            [
                16096,
                16174
            ],
            [
                16174,
                16369
            ],
            [
                16369,
                16430
            ],
            [
                16430,
                16632
            ],
            [
                16632,
                16836
            ],
            [
                16836,
                16897
            ],
            [
                16897,
                16902
            ],
            [
                16902,
                16909
            ],
            [
                16909,
                16937
            ],
            [
                16937,
                16951
            ],
            [
                16951,
                16969
            ],
            [
                16969,
                17019
            ],
            [
                17019,
                17056
            ],
            [
                17056,
                17088
            ],
            [
                17088,
                17109
            ],
            [
                17109,
                17158
            ],
            [
                17158,
                17267
            ],
            [
                17267,
                17288
            ],
            [
                17288,
                17440
            ],
            [
                17440,
                17498
            ],
            [
                17498,
                17632
            ],
            [
                17632,
                17723
            ],
            [
                17723,
                17913
            ],
            [
                17913,
                18139
            ],
            [
                18139,
                18270
            ],
            [
                18270,
                18377
            ],
            [
                18377,
                18430
            ],
            [
                18430,
                18614
            ],
            [
                18614,
                18821
            ],
            [
                18821,
                18910
            ],
            [
                18910,
                19077
            ],
            [
                19077,
                19131
            ],
            [
                19131,
                19173
            ],
            [
                19173,
                19216
            ],
            [
                19216,
                19378
            ],
            [
                19378,
                19499
            ],
            [
                19499,
                19780
            ],
            [
                19780,
                19995
            ],
            [
                19995,
                20078
            ],
            [
                20078,
                20178
            ],
            [
                20178,
                20293
            ],
            [
                20293,
                20449
            ],
            [
                20449,
                20509
            ],
            [
                20509,
                20516
            ],
            [
                20516,
                20526
            ],
            [
                20526,
                20594
            ],
            [
                20594,
                20626
            ],
            [
                20626,
                20730
            ],
            [
                20730,
                20796
            ],
            [
                20796,
                20864
            ],
            [
                20864,
                21015
            ],
            [
                21015,
                21294
            ],
            [
                21294,
                21360
            ],
            [
                21360,
                21453
            ],
            [
                21453,
                21506
            ],
            [
                21506,
                21542
            ],
            [
                21542,
                21599
            ],
            [
                21599,
                21634
            ],
            [
                21634,
                21655
            ],
            [
                21655,
                21707
            ],
            [
                21707,
                21893
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                56,
                68
            ],
            [
                96,
                98
            ],
            [
                105,
                140
            ],
            [
                169,
                177
            ],
            [
                188,
                292
            ],
            [
                293,
                295
            ],
            [
                341,
                344
            ],
            [
                337,
                340
            ],
            [
                345,
                357
            ],
            [
                324,
                335
            ],
            [
                382,
                384
            ],
            [
                384,
                395
            ],
            [
                399,
                402
            ],
            [
                424,
                454
            ],
            [
                509,
                528
            ],
            [
                586,
                678
            ],
            [
                709,
                721
            ],
            [
                409,
                410
            ],
            [
                502,
                509
            ],
            [
                826,
                828
            ],
            [
                828,
                859
            ],
            [
                898,
                900
            ],
            [
                900,
                906
            ],
            [
                911,
                935
            ],
            [
                980,
                994
            ],
            [
                935,
                936
            ],
            [
                1011,
                1018
            ],
            [
                995,
                1007
            ],
            [
                1008,
                1010
            ],
            [
                1046,
                1055
            ],
            [
                1069,
                1079
            ],
            [
                1085,
                1091
            ],
            [
                1080,
                1084
            ],
            [
                1097,
                1124
            ],
            [
                1125,
                1147
            ],
            [
                1147,
                1193
            ],
            [
                1205,
                1231
            ],
            [
                1231,
                1293
            ],
            [
                1299,
                1334
            ],
            [
                1334,
                1380
            ],
            [
                1395,
                1422
            ],
            [
                1436,
                1465
            ],
            [
                1545,
                1547
            ],
            [
                1547,
                1592
            ],
            [
                1606,
                1623
            ],
            [
                1629,
                1648
            ],
            [
                1684,
                1686
            ],
            [
                1686,
                1788
            ],
            [
                1842,
                1843
            ],
            [
                1934,
                1973
            ],
            [
                2046,
                2049
            ],
            [
                1981,
                1984
            ],
            [
                2056,
                2155
            ],
            [
                2155,
                2213
            ],
            [
                2380,
                2382
            ],
            [
                2409,
                2446
            ],
            [
                2497,
                2507
            ],
            [
                2510,
                2516
            ],
            [
                2479,
                2481
            ],
            [
                2582,
                2584
            ],
            [
                2584,
                2675
            ],
            [
                2914,
                2927
            ],
            [
                2701,
                2777
            ],
            [
                2689,
                2691
            ],
            [
                2681,
                2682
            ],
            [
                2824,
                2832
            ],
            [
                2793,
                2794
            ],
            [
                2779,
                2793
            ],
            [
                2834,
                2861
            ],
            [
                2864,
                2891
            ],
            [
                2900,
                2904
            ],
            [
                2929,
                2978
            ],
            [
                2984,
                3046
            ],
            [
                3062,
                3082
            ],
            [
                3092,
                3116
            ],
            [
                3348,
                3351
            ],
            [
                3127,
                3142
            ],
            [
                3144,
                3160
            ],
            [
                3163,
                3172
            ],
            [
                3361,
                3363
            ],
            [
                3819,
                3846
            ],
            [
                3849,
                3911
            ],
            [
                3815,
                3818
            ],
            [
                3912,
                3916
            ],
            [
                3970,
                3973
            ],
            [
                3997,
                4007
            ],
            [
                4015,
                4034
            ],
            [
                4071,
                4142
            ],
            [
                4387,
                4389
            ],
            [
                4389,
                4461
            ],
            [
                4463,
                4470
            ],
            [
                4481,
                4549
            ],
            [
                4549,
                4551
            ],
            [
                4559,
                4609
            ],
            [
                4609,
                4645
            ],
            [
                4726,
                4735
            ],
            [
                4744,
                4754
            ],
            [
                4681,
                4683
            ],
            [
                4759,
                4798
            ],
            [
                4736,
                4739
            ],
            [
                4995,
                5074
            ],
            [
                5075,
                5133
            ],
            [
                5133,
                5159
            ],
            [
                5182,
                5265
            ],
            [
                5265,
                5268
            ],
            [
                5329,
                5375
            ],
            [
                5394,
                5412
            ],
            [
                5452,
                5454
            ],
            [
                5469,
                5566
            ],
            [
                5758,
                5804
            ],
            [
                5805,
                5913
            ],
            [
                5913,
                5944
            ],
            [
                5957,
                5993
            ],
            [
                6007,
                6014
            ],
            [
                6028,
                6037
            ],
            [
                6058,
                6081
            ],
            [
                6087,
                6105
            ],
            [
                6106,
                6167
            ],
            [
                6208,
                6210
            ],
            [
                6214,
                6314
            ],
            [
                6314,
                6386
            ],
            [
                6391,
                6418
            ],
            [
                6418,
                6465
            ],
            [
                6490,
                6503
            ],
            [
                6556,
                6571
            ],
            [
                6577,
                6582
            ],
            [
                6609,
                6631
            ],
            [
                6634,
                6677
            ],
            [
                6686,
                6718
            ],
            [
                6730,
                6733
            ],
            [
                6736,
                6853
            ],
            [
                6862,
                6867
            ],
            [
                6868,
                6880
            ],
            [
                6945,
                6978
            ],
            [
                7030,
                7047
            ],
            [
                6983,
                6991
            ],
            [
                7063,
                7068
            ],
            [
                7095,
                7113
            ],
            [
                7113,
                7136
            ],
            [
                7157,
                7197
            ],
            [
                7197,
                7200
            ],
            [
                7246,
                7272
            ],
            [
                7291,
                7348
            ],
            [
                7361,
                7409
            ],
            [
                7490,
                7502
            ],
            [
                7486,
                7489
            ],
            [
                7503,
                7519
            ],
            [
                7540,
                7542
            ],
            [
                7695,
                7706
            ],
            [
                7714,
                7722
            ],
            [
                7724,
                7739
            ],
            [
                7747,
                7793
            ],
            [
                7793,
                7898
            ],
            [
                7931,
                7991
            ],
            [
                7992,
                7996
            ],
            [
                8049,
                8080
            ],
            [
                8112,
                8118
            ],
            [
                8081,
                8085
            ],
            [
                8144,
                8195
            ],
            [
                8247,
                8248
            ],
            [
                8295,
                8304
            ],
            [
                8252,
                8281
            ],
            [
                8313,
                8372
            ],
            [
                8372,
                8465
            ],
            [
                8484,
                8487
            ],
            [
                8493,
                8510
            ],
            [
                8695,
                8777
            ],
            [
                8629,
                8631
            ],
            [
                8684,
                8689
            ],
            [
                8793,
                8800
            ],
            [
                8844,
                8855
            ],
            [
                8954,
                9101
            ],
            [
                9101,
                9104
            ],
            [
                9146,
                9157
            ],
            [
                9172,
                9187
            ],
            [
                9187,
                9206
            ],
            [
                9217,
                9223
            ],
            [
                9239,
                9275
            ],
            [
                9275,
                9339
            ],
            [
                9365,
                9372
            ],
            [
                9377,
                9383
            ],
            [
                9409,
                9411
            ],
            [
                9411,
                9418
            ],
            [
                9427,
                9472
            ],
            [
                9572,
                9574
            ],
            [
                9574,
                9737
            ],
            [
                9740,
                9762
            ],
            [
                9773,
                9775
            ],
            [
                9763,
                9766
            ],
            [
                9782,
                9791
            ],
            [
                9801,
                9846
            ],
            [
                9846,
                9852
            ],
            [
                9861,
                9912
            ],
            [
                9919,
                9956
            ],
            [
                10134,
                10140
            ],
            [
                9974,
                9989
            ],
            [
                10059,
                10060
            ],
            [
                10062,
                10072
            ],
            [
                10094,
                10132
            ],
            [
                10252,
                10254
            ],
            [
                10254,
                10384
            ],
            [
                10384,
                10499
            ],
            [
                10499,
                10625
            ],
            [
                10657,
                10659
            ],
            [
                10659,
                10705
            ],
            [
                10780,
                10824
            ],
            [
                10912,
                10964
            ],
            [
                10972,
                10978
            ],
            [
                10984,
                11015
            ],
            [
                11199,
                11301
            ],
            [
                11344,
                11345
            ],
            [
                11545,
                11557
            ],
            [
                11562,
                11591
            ],
            [
                11593,
                11612
            ],
            [
                11621,
                11636
            ],
            [
                11649,
                11655
            ],
            [
                11674,
                11676
            ],
            [
                11676,
                11682
            ],
            [
                11687,
                11688
            ],
            [
                11719,
                11736
            ],
            [
                11736,
                11762
            ],
            [
                11762,
                11786
            ],
            [
                11831,
                11865
            ],
            [
                11876,
                11886
            ],
            [
                11886,
                11937
            ],
            [
                11937,
                12021
            ],
            [
                12047,
                12082
            ],
            [
                12082,
                12191
            ],
            [
                12202,
                12217
            ],
            [
                12217,
                12244
            ],
            [
                12333,
                12335
            ],
            [
                12335,
                12362
            ],
            [
                12388,
                12449
            ],
            [
                12483,
                12513
            ],
            [
                12543,
                12548
            ],
            [
                12553,
                12562
            ],
            [
                12593,
                12595
            ],
            [
                12595,
                12614
            ],
            [
                12622,
                12638
            ],
            [
                12677,
                12715
            ],
            [
                12736,
                12756
            ],
            [
                12781,
                12803
            ],
            [
                12803,
                12818
            ],
            [
                12839,
                12859
            ],
            [
                12974,
                13022
            ],
            [
                13137,
                13178
            ],
            [
                13258,
                13284
            ],
            [
                13304,
                13328
            ],
            [
                13334,
                13347
            ],
            [
                13347,
                13349
            ],
            [
                13354,
                13399
            ],
            [
                13411,
                13427
            ],
            [
                13433,
                13472
            ],
            [
                13409,
                13410
            ],
            [
                13503,
                13541
            ],
            [
                13563,
                13565
            ],
            [
                13565,
                13584
            ],
            [
                13635,
                13651
            ],
            [
                13670,
                13673
            ],
            [
                13657,
                13666
            ],
            [
                13674,
                13717
            ],
            [
                13749,
                13773
            ],
            [
                13799,
                13807
            ],
            [
                13625,
                13626
            ],
            [
                13879,
                13956
            ],
            [
                13960,
                13972
            ],
            [
                13996,
                13997
            ],
            [
                13998,
                14044
            ],
            [
                14044,
                14134
            ],
            [
                14134,
                14201
            ],
            [
                14299,
                14357
            ],
            [
                14467,
                14516
            ],
            [
                14528,
                14529
            ],
            [
                14530,
                14600
            ],
            [
                14600,
                14603
            ],
            [
                14634,
                14665
            ],
            [
                14665,
                14720
            ],
            [
                14720,
                14760
            ],
            [
                14760,
                14779
            ],
            [
                14799,
                14819
            ],
            [
                14830,
                14841
            ],
            [
                14869,
                14920
            ],
            [
                14924,
                14987
            ],
            [
                14995,
                14997
            ],
            [
                15125,
                15157
            ],
            [
                15220,
                15222
            ],
            [
                15222,
                15281
            ],
            [
                15366,
                15476
            ],
            [
                15478,
                15524
            ],
            [
                15524,
                15532
            ],
            [
                15642,
                15643
            ],
            [
                15650,
                15652
            ],
            [
                15694,
                15699
            ],
            [
                15753,
                15754
            ],
            [
                15704,
                15753
            ],
            [
                15932,
                15944
            ],
            [
                15992,
                16013
            ],
            [
                15805,
                15808
            ],
            [
                16021,
                16024
            ],
            [
                15975,
                15987
            ],
            [
                16026,
                16096
            ],
            [
                16178,
                16274
            ],
            [
                16367,
                16369
            ],
            [
                16430,
                16436
            ],
            [
                16526,
                16530
            ],
            [
                16458,
                16465
            ],
            [
                16507,
                16508
            ],
            [
                16467,
                16470
            ],
            [
                16517,
                16525
            ],
            [
                16465,
                16466
            ],
            [
                16541,
                16609
            ],
            [
                16630,
                16632
            ],
            [
                17299,
                17321
            ],
            [
                17345,
                17367
            ],
            [
                17288,
                17291
            ],
            [
                17371,
                17384
            ],
            [
                17368,
                17370
            ],
            [
                17385,
                17411
            ],
            [
                17419,
                17423
            ],
            [
                17338,
                17340
            ],
            [
                17438,
                17440
            ],
            [
                17498,
                17632
            ],
            [
                17632,
                17651
            ],
            [
                17721,
                17723
            ],
            [
                17723,
                17792
            ],
            [
                17795,
                17801
            ],
            [
                17819,
                17857
            ],
            [
                17911,
                17913
            ],
            [
                18139,
                18217
            ],
            [
                18328,
                18331
            ],
            [
                18245,
                18248
            ],
            [
                18313,
                18318
            ],
            [
                18268,
                18269
            ],
            [
                18614,
                18782
            ],
            [
                18790,
                18796
            ],
            [
                18818,
                18821
            ],
            [
                18821,
                18822
            ],
            [
                18824,
                18829
            ],
            [
                18845,
                18910
            ],
            [
                18910,
                19077
            ],
            [
                19077,
                19131
            ],
            [
                19131,
                19173
            ],
            [
                19173,
                19216
            ],
            [
                19216,
                19323
            ],
            [
                19325,
                19328
            ],
            [
                19342,
                19378
            ],
            [
                19378,
                19467
            ],
            [
                19476,
                19478
            ],
            [
                19496,
                19499
            ],
            [
                19499,
                19572
            ],
            [
                19589,
                19601
            ],
            [
                19616,
                19642
            ],
            [
                19648,
                19649
            ],
            [
                19660,
                19728
            ],
            [
                19734,
                19780
            ],
            [
                19780,
                19797
            ],
            [
                19824,
                19883
            ],
            [
                19904,
                19993
            ],
            [
                19995,
                20025
            ],
            [
                20035,
                20039
            ],
            [
                20050,
                20078
            ],
            [
                20078,
                20097
            ],
            [
                20115,
                20118
            ],
            [
                20124,
                20137
            ],
            [
                20147,
                20178
            ],
            [
                20381,
                20384
            ],
            [
                20296,
                20313
            ],
            [
                20326,
                20347
            ],
            [
                20365,
                20380
            ],
            [
                20392,
                20405
            ],
            [
                20385,
                20388
            ],
            [
                20406,
                20448
            ],
            [
                20449,
                20509
            ],
            [
                20626,
                20656
            ],
            [
                20658,
                20698
            ],
            [
                20700,
                20728
            ],
            [
                20796,
                20806
            ],
            [
                20810,
                20864
            ],
            [
                20864,
                20932
            ],
            [
                20964,
                20979
            ],
            [
                20987,
                21014
            ],
            [
                21300,
                21360
            ],
            [
                21360,
                21453
            ],
            [
                21453,
                21506
            ],
            [
                21506,
                21542
            ],
            [
                21542,
                21550
            ],
            [
                21597,
                21599
            ],
            [
                21599,
                21634
            ],
            [
                21634,
                21655
            ],
            [
                21655,
                21678
            ],
            [
                21688,
                21707
            ],
            [
                21707,
                21726
            ],
            [
                21730,
                21836
            ],
            [
                21858,
                21893
            ]
        ],
        "row_chars": [
            [
                0,
                293
            ],
            [
                293,
                384
            ],
            [
                384,
                828
            ],
            [
                828,
                900
            ],
            [
                900,
                1125
            ],
            [
                1125,
                1147
            ],
            [
                1147,
                1231
            ],
            [
                1231,
                1334
            ],
            [
                1334,
                1547
            ],
            [
                1547,
                1686
            ],
            [
                1686,
                1844
            ],
            [
                1844,
                1934
            ],
            [
                1934,
                2155
            ],
            [
                2155,
                2382
            ],
            [
                2382,
                2584
            ],
            [
                2584,
                3047
            ],
            [
                3047,
                3363
            ],
            [
                3363,
                3388
            ],
            [
                3388,
                3473
            ],
            [
                3473,
                3580
            ],
            [
                3580,
                3815
            ],
            [
                3815,
                4389
            ],
            [
                4389,
                4549
            ],
            [
                4549,
                4609
            ],
            [
                4609,
                5075
            ],
            [
                5075,
                5133
            ],
            [
                5133,
                5265
            ],
            [
                5265,
                5454
            ],
            [
                5454,
                5566
            ],
            [
                5566,
                5714
            ],
            [
                5714,
                5758
            ],
            [
                5758,
                5805
            ],
            [
                5805,
                5913
            ],
            [
                5913,
                6106
            ],
            [
                6106,
                6210
            ],
            [
                6210,
                6314
            ],
            [
                6314,
                6418
            ],
            [
                6418,
                6868
            ],
            [
                6868,
                7113
            ],
            [
                7113,
                7197
            ],
            [
                7197,
                7348
            ],
            [
                7348,
                7542
            ],
            [
                7542,
                7695
            ],
            [
                7695,
                7793
            ],
            [
                7793,
                8249
            ],
            [
                8249,
                8372
            ],
            [
                8372,
                8510
            ],
            [
                8510,
                8629
            ],
            [
                8629,
                8855
            ],
            [
                8855,
                8954
            ],
            [
                8954,
                9101
            ],
            [
                9101,
                9187
            ],
            [
                9187,
                9275
            ],
            [
                9275,
                9411
            ],
            [
                9411,
                9574
            ],
            [
                9574,
                9846
            ],
            [
                9846,
                10254
            ],
            [
                10254,
                10384
            ],
            [
                10384,
                10499
            ],
            [
                10499,
                10659
            ],
            [
                10659,
                10824
            ],
            [
                10824,
                10912
            ],
            [
                10912,
                11015
            ],
            [
                11015,
                11147
            ],
            [
                11147,
                11199
            ],
            [
                11199,
                11346
            ],
            [
                11346,
                11454
            ],
            [
                11454,
                11532
            ],
            [
                11532,
                11676
            ],
            [
                11676,
                11736
            ],
            [
                11736,
                11762
            ],
            [
                11762,
                11786
            ],
            [
                11786,
                11831
            ],
            [
                11831,
                11886
            ],
            [
                11886,
                11937
            ],
            [
                11937,
                12082
            ],
            [
                12082,
                12217
            ],
            [
                12217,
                12335
            ],
            [
                12335,
                12595
            ],
            [
                12595,
                12638
            ],
            [
                12638,
                12803
            ],
            [
                12803,
                12859
            ],
            [
                12859,
                13022
            ],
            [
                13022,
                13137
            ],
            [
                13137,
                13178
            ],
            [
                13178,
                13258
            ],
            [
                13258,
                13347
            ],
            [
                13347,
                13565
            ],
            [
                13565,
                13879
            ],
            [
                13879,
                13998
            ],
            [
                13998,
                14044
            ],
            [
                14044,
                14134
            ],
            [
                14134,
                14202
            ],
            [
                14202,
                14299
            ],
            [
                14299,
                14357
            ],
            [
                14357,
                14426
            ],
            [
                14426,
                14467
            ],
            [
                14467,
                14530
            ],
            [
                14530,
                14600
            ],
            [
                14600,
                14665
            ],
            [
                14665,
                14720
            ],
            [
                14720,
                14760
            ],
            [
                14760,
                14920
            ],
            [
                14920,
                15222
            ],
            [
                15222,
                15524
            ],
            [
                15524,
                16096
            ],
            [
                16096,
                16174
            ],
            [
                16174,
                16369
            ],
            [
                16369,
                16430
            ],
            [
                16430,
                16632
            ],
            [
                16632,
                16836
            ],
            [
                16836,
                16897
            ],
            [
                16897,
                16902
            ],
            [
                16902,
                16909
            ],
            [
                16909,
                16937
            ],
            [
                16937,
                16951
            ],
            [
                16951,
                16969
            ],
            [
                16969,
                17019
            ],
            [
                17019,
                17056
            ],
            [
                17056,
                17088
            ],
            [
                17088,
                17109
            ],
            [
                17109,
                17158
            ],
            [
                17158,
                17267
            ],
            [
                17267,
                17288
            ],
            [
                17288,
                17440
            ],
            [
                17440,
                17498
            ],
            [
                17498,
                17632
            ],
            [
                17632,
                17723
            ],
            [
                17723,
                17913
            ],
            [
                17913,
                18139
            ],
            [
                18139,
                18430
            ],
            [
                18430,
                18614
            ],
            [
                18614,
                18821
            ],
            [
                18821,
                18910
            ],
            [
                18910,
                19077
            ],
            [
                19077,
                19131
            ],
            [
                19131,
                19173
            ],
            [
                19173,
                19216
            ],
            [
                19216,
                19378
            ],
            [
                19378,
                19499
            ],
            [
                19499,
                19780
            ],
            [
                19780,
                20078
            ],
            [
                20078,
                20178
            ],
            [
                20178,
                20293
            ],
            [
                20293,
                20449
            ],
            [
                20449,
                20509
            ],
            [
                20509,
                20516
            ],
            [
                20516,
                20526
            ],
            [
                20526,
                20594
            ],
            [
                20594,
                20626
            ],
            [
                20626,
                20730
            ],
            [
                20730,
                20796
            ],
            [
                20796,
                20864
            ],
            [
                20864,
                21015
            ],
            [
                21015,
                21294
            ],
            [
                21294,
                21360
            ],
            [
                21360,
                21453
            ],
            [
                21453,
                21506
            ],
            [
                21506,
                21542
            ],
            [
                21542,
                21599
            ],
            [
                21599,
                21634
            ],
            [
                21634,
                21655
            ],
            [
                21655,
                21707
            ],
            [
                21707,
                21893
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Palliser was one of those politicians of whom England can be prouder than of any other of her resources, giving her that combination of conservatism and progress which is her present strength and best security for the future.\nHe had both the money and the industry needed by a statesman. He was born into the nobility, and heir to the highest rank, already very rich; and yet he devoted himself to work with the grinding energy of a young penniless barrister, and did so unselfishly, wishing only to serve his country. He was not a brilliant man, and he knew it. He was listened to in the House as a laborious, earnest man, who was accurate in his facts, and who, though dull, was worthy of confidence.\nAnd he was very dull. He rather prided himself on being dull, and on succeeding in spite of his dullness. He never allowed himself a joke in his speeches, nor attempted the smallest flourish of rhetoric. He was very careful in his language, labouring to learn to express himself accurately, with no needless repetition. He had taught himself to believe that oratory was a sin against honesty in politics. He desired to use words for the purpose of teaching things which he knew and which others did not know.\nHe was an upright, thin, laborious man; but his parts were sufficient to make his education, integrity, and industry useful in the highest degree. It is the trust which such men inspire which makes them so useful. Their labour, honesty, and patriotism gives them weight in politics.\nIf he was dull as a statesman he was more dull in private life, and it may be imagined that Lady Glencora would find some difficulty in making his society the source of her happiness., As a business arrangement, their marriage had been a complete success - and a success, too, when on Lady Glencora's side there had been terrible dangers of shipwreck, and on his side also there had been some little fears of a mishap.\nIt has been told how close Lady Glencora went to throwing herself and her vast wealth into the arms of an unsuitable young man. Mr. Palliser's little threatened mischance - a passing fancy for a married lady who was too wise to receive his vows - had given some alarm to his uncle, enough to make so very judicious a marriage doubly pleasant to that noble duke.\nAnd as regards Mr. Palliser, I think that his married life, and the wife whom he had not chosen, but who had dropped upon him, suited him admirably. He needed great wealth for that position at which he aimed. He had been rich before his marriage; but for his career he needed that colossal wealth which would give him the rock-like solidity which is so necessary to our great aristocratic politicians.\nAnd his wife was, as far as he knew, all that he desired. He had not dabbled much in love, though he had forgotten himself once, and sinned in coveting another man's wife. But his desire had been of a kind which was almost thankful for its disappointment. After the lady had frowned on him he had told himself that he was very well out of that trouble. So he married Lady Glencora and was satisfied.\nThe story of Burgo Fitzgerald was told to him, and he supposed that most girls had some such story to tell. He thought little about it, and did not understood her when she said to him, as impressively as she could, \"You must know that I really loved him.\"\n\"You must love me now,\" he had replied with a smile; and then he forgot about it. Since his marriage he had thought that things matrimonial had gone well with him, and with her too. He gave her almost unlimited power of enjoying her money, and interfered little in her way of life. Sometimes he would say a word of caution to her about her childish ways; and his words would hold some unintentional severity - whether instigated or not by the red-haired Member of Parliament, I will not say - but on the whole he was contented and loved his wife, as he thought, very heartily, and at least better than he loved anyone else.\nOne cause of care was beginning to make itself felt: he had hoped that his wife might soon give him a child. But the days were young, and the care had not become a sorrow.\nBut this well-ordered alliance had not perhaps suited her as well as it had suited him. She might have learned to forget her early lover if her new lord had been more tender. To love and caress someone, to be loved and caressed, were absolutely necessary to her happiness. She wanted the little daily assurance of her supremacy in the man's feelings, the constant touch of love, the passing glance of the eye telling perhaps of some little private joke, the softness of an occasional chance kiss, some half-pretended interest in her little doings.\nSuch food should have been given to her daily, and then she would have forgotten Burgo Fitzgerald. But Mr. Palliser understood none of these things; and therefore the image of Burgo Fitzgerald was always before her eyes.\nEven if Mr. Palliser were to pass through some violent domestic trouble, some ruin in the hopes of his home, it would not destroy him as it would other men. To lose his influence with his party would be worse to him than to lose his wife, and public disgrace would hit him harder than private dishonour.\nAnd now success was coming to him. He had already held office, but had never sat in the Cabinet. He had worked much harder than Cabinet Ministers generally work, without much reward. For the income which he had received had been nothing to him. To have ascendancy over other men, to be known by his countrymen as one of their real rulers, to have an actual and acknowledged voice in the management of nations - those were the rewards he wished for; and now it seemed as though they were coming to him. It was known that the existing Chancellor of the Exchequer was about to separate himself from the Government, taking others with him; and it was thought that Mr. Palliser would fill his place. He could thus afford to put up with the small everyday calamity of having a wife who loved another man better than she loved him.\nThe presence of the Duke of St. Bungay at Matching was assumed to be a sure sign of Mr. Palliser's coming triumph. The Duke was a statesman of a very different class, but he also had been eminently successful as an aristocratic pillar of the government. He was a minister of very many years' standing; but he had never been a hard-working man. The world had said before now that the Duke might be Prime Minister, only he would not take the trouble. He was regarded as a strong rock of support to the liberal cause, and yet nobody ever knew what he did.\nHis speeches in the House were generally short and pleasant, with some slight, droll undercurrent of satire. But he had a good deal of common sense. He never lost his temper. He never made mistakes. He was never reckless in politics, nor cowardly. He snubbed no man, and took snubbings from no man. He was a Knight of the Garter, a Lord Lieutenant of his county, and at sixty-two had good health and his estate in excellent order. He was a great buyer of pictures, which, perhaps, he did not understand, and a great collector of books which he never read. All the world respected him.\nBut even he was not without his skeleton in the closet, his thorn in his side; though the skeleton was not very terrible, nor the thorn very dangerous. The Duke was always uneasy about his wife.\nIt must not be supposed that he feared any Burgo Fitzgerald would destroy his domestic comfort. The Duchess was all that is proper. No breath of slander had ever touched her name. Nor was she a spendthrift, or a gambler. She was simply a fool, and always fearing that she was the object of ridicule. In such miseries she would complain sorrowfully, and occasionally angrily, to her dear Duke and protector, who did not quite know what to do with her. It did not suit him to beg mercy for his poor wife from such a one as Mrs. Conway Sparkes; nor could he lodge a formal complaint with his host.\n\"If you don't like the people, my dear, we will go away,\" he said to her late that evening.\n\"No,\" she replied, \"I do not wish to go away. I have said that we would stay till December, and Longroyston won't be ready before that. But I think that something ought to be done to silence that woman.\"\nThe Duke did not know how to silence Mrs. Conway Sparkes. \"I don't think she is worth your attention,\" said he.\n\"That's all very well, Duke,\" said the wife, \"and perhaps she is not. But I don't like to be laughed at. I think Lady Glencora should make her know her place.\"\n\"Lady Glencora is very young, my dear.\"\n\"I don't know about that,\" said the Duchess, who had perhaps heard poor Lady Glencora's almost unintentional mimicry. As appeals of this kind were being made frequently to the Duke, he felt that the matter was an annoyance.\nAnd there was a third politician staying at Matching Priory: Mr. Bott, the member for St. Helens, whom Lady Glencora had described as a man who stood about, with red hair, and perhaps told tales of her to her husband. Mr. Bott, at almost fifty, was now enjoying his second session in Parliament; but they who watched his political manuvres in the House knew that he was striving hard to get his finger into the public pie. Though he claimed to be a thoroughgoing Radical, he was a man who liked to live with aristocrats. He was good with figures, industrious and obedient; a man who might make himself useful to a Chancellor of the Exchequer.\nA huge pile of letters arrived for Mr. Bott every morning by post, but unfortunately he did not seem to spend much time attending to them. Twice he went out shooting, but as on the first day he shot the keeper, and on the second very nearly shot the Duke, he gave that up. Hunting he declined. He seemed to spend his time, as Lady Glencora said, in standing about - except when he was closeted with Mr. Palliser. He was a tall, wiry, strong man, with a bald head and bristly red beard, which unfortunately did not hide his thin mouth.\n\"I shouldn't dislike Mr. Bott so much,\" Lady Glencora said to her husband, \"if he didn't rub his hands and smile so often, and seem to be going to say something when he is not.\"\n\"Don't trouble yourself about him, my dear,\" Mr. Palliser had answered.\n\"But when he looks at me in that way, I can't help stopping, as I think he is going to speak; and then he always says, 'Can I do anything for you, Lady Glen-cowrer?'\"\nShe instantly saw that her husband did not like this. \"Don't be angry with me, dear,\" she said. \"You must admit that he is rather a bore.\"\n\"I am not at all angry, Glencora,\" said the husband; \"and if you insist upon it, I will see that he leaves; and will of course never ask him again. But that might be prejudicial to me, as he is a man whom I trust in politics, and who may be useful.\"\nOf course Lady Glencora declared that Mr. Bott might remain as long as he desired, and mentioned his name no more. But from that time forth she regarded Mr. Bott as an enemy, and felt that Mr. Bott regarded her in the same light.\nWhen it was known that the Duke of St. Bungay was staying at Matching Priory, people became more sure than ever that Mr. Palliser would be the new Chancellor of the Exchequer, and that the old minister and the young one were arranging matters together. But I doubt whether the two ever spoke on the topic during the entire visit. The Duke went out shooting, read his newspaper, and looked with a connoisseur's eye over all Mr. Palliser's farming apparatus.\n\"You seem to have a good man, I should say,\" said the Duke. \"Of course he won't make it pay, but he'll make it look as though it did; which is the next best thing.\"\n\"I suppose so,\" said Mr. Palliser, who did not care much about it. The Duke would have talked to him by the hour together about farming if he could; but he talked very little about politics.\nMr. Bott was sometimes honoured by a few words with the Duke.\n\"We shall muster pretty strong, your Grace,\" Mr. Bott had said to him one day before dinner.\n\"That depends on how the changes go,\" said the Duke.\n\"I suppose there will be a change?\"\n\"Oh yes; certainly. And it will be in your direction.\"\n\"And in Palliser's?\"\n\"Yes; I should think so, if it suits him. By-the-by, Mr. Bott-\"\nThen there was a little whispered communication, in which perhaps Mr. Bott was undertaking some commission in what Lady Glencora had called \"telling.\"",
        "paragraph_chars": [
            [
                0,
                230
            ],
            [
                230,
                707
            ],
            [
                707,
                1216
            ],
            [
                1216,
                1499
            ],
            [
                1499,
                1918
            ],
            [
                1918,
                2280
            ],
            [
                2280,
                2682
            ],
            [
                2682,
                3082
            ],
            [
                3082,
                3338
            ],
            [
                3338,
                3962
            ],
            [
                3962,
                4134
            ],
            [
                4134,
                4682
            ],
            [
                4682,
                4903
            ],
            [
                4903,
                5207
            ],
            [
                5207,
                6032
            ],
            [
                6032,
                6585
            ],
            [
                6585,
                7170
            ],
            [
                7170,
                7365
            ],
            [
                7365,
                7960
            ],
            [
                7960,
                8052
            ],
            [
                8052,
                8256
            ],
            [
                8256,
                8368
            ],
            [
                8368,
                8528
            ],
            [
                8528,
                8568
            ],
            [
                8568,
                8792
            ],
            [
                8792,
                9435
            ],
            [
                9435,
                9970
            ],
            [
                9970,
                10148
            ],
            [
                10148,
                10220
            ],
            [
                10220,
                10387
            ],
            [
                10387,
                10526
            ],
            [
                10526,
                10776
            ],
            [
                10776,
                11006
            ],
            [
                11006,
                11463
            ],
            [
                11463,
                11628
            ],
            [
                11628,
                11819
            ],
            [
                11819,
                11881
            ],
            [
                11881,
                11974
            ],
            [
                11974,
                12027
            ],
            [
                12027,
                12063
            ],
            [
                12063,
                12118
            ],
            [
                12118,
                12139
            ],
            [
                12139,
                12203
            ],
            [
                12203,
                12353
            ]
        ],
        "segment_chars": [
            [
                0,
                230
            ],
            [
                230,
                292
            ],
            [
                292,
                523
            ],
            [
                523,
                567
            ],
            [
                567,
                707
            ],
            [
                707,
                729
            ],
            [
                729,
                813
            ],
            [
                813,
                911
            ],
            [
                911,
                1027
            ],
            [
                1027,
                1112
            ],
            [
                1112,
                1216
            ],
            [
                1216,
                1363
            ],
            [
                1363,
                1430
            ],
            [
                1430,
                1499
            ],
            [
                1499,
                1918
            ],
            [
                1918,
                2046
            ],
            [
                2046,
                2280
            ],
            [
                2280,
                2429
            ],
            [
                2429,
                2489
            ],
            [
                2489,
                2682
            ],
            [
                2682,
                2740
            ],
            [
                2740,
                2854
            ],
            [
                2854,
                2938
            ],
            [
                2938,
                3035
            ],
            [
                3035,
                3082
            ],
            [
                3082,
                3190
            ],
            [
                3190,
                3338
            ],
            [
                3338,
                3420
            ],
            [
                3420,
                3520
            ],
            [
                3520,
                3620
            ],
            [
                3620,
                3962
            ],
            [
                3962,
                4071
            ],
            [
                4071,
                4134
            ],
            [
                4134,
                4222
            ],
            [
                4222,
                4309
            ],
            [
                4309,
                4407
            ],
            [
                4407,
                4682
            ],
            [
                4682,
                4781
            ],
            [
                4781,
                4903
            ],
            [
                4903,
                5060
            ],
            [
                5060,
                5207
            ],
            [
                5207,
                5242
            ],
            [
                5242,
                5304
            ],
            [
                5304,
                5390
            ],
            [
                5390,
                5452
            ],
            [
                5452,
                5709
            ],
            [
                5709,
                5902
            ],
            [
                5902,
                6032
            ],
            [
                6032,
                6147
            ],
            [
                6147,
                6286
            ],
            [
                6286,
                6376
            ],
            [
                6376,
                6481
            ],
            [
                6481,
                6585
            ],
            [
                6585,
                6694
            ],
            [
                6694,
                6734
            ],
            [
                6734,
                6760
            ],
            [
                6760,
                6784
            ],
            [
                6784,
                6833
            ],
            [
                6833,
                6884
            ],
            [
                6884,
                7016
            ],
            [
                7016,
                7141
            ],
            [
                7141,
                7170
            ],
            [
                7170,
                7322
            ],
            [
                7322,
                7365
            ],
            [
                7365,
                7461
            ],
            [
                7461,
                7497
            ],
            [
                7497,
                7545
            ],
            [
                7545,
                7586
            ],
            [
                7586,
                7665
            ],
            [
                7665,
                7816
            ],
            [
                7816,
                7960
            ],
            [
                7960,
                8052
            ],
            [
                8052,
                8098
            ],
            [
                8098,
                8188
            ],
            [
                8188,
                8256
            ],
            [
                8256,
                8314
            ],
            [
                8314,
                8368
            ],
            [
                8368,
                8438
            ],
            [
                8438,
                8473
            ],
            [
                8473,
                8528
            ],
            [
                8528,
                8568
            ],
            [
                8568,
                8686
            ],
            [
                8686,
                8792
            ],
            [
                8792,
                9010
            ],
            [
                9010,
                9215
            ],
            [
                9215,
                9313
            ],
            [
                9313,
                9435
            ],
            [
                9435,
                9574
            ],
            [
                9574,
                9708
            ],
            [
                9708,
                9729
            ],
            [
                9729,
                9848
            ],
            [
                9848,
                9970
            ],
            [
                9970,
                10148
            ],
            [
                10148,
                10220
            ],
            [
                10220,
                10387
            ],
            [
                10387,
                10441
            ],
            [
                10441,
                10483
            ],
            [
                10483,
                10526
            ],
            [
                10526,
                10674
            ],
            [
                10674,
                10776
            ],
            [
                10776,
                10891
            ],
            [
                10891,
                11006
            ],
            [
                11006,
                11259
            ],
            [
                11259,
                11336
            ],
            [
                11336,
                11463
            ],
            [
                11463,
                11523
            ],
            [
                11523,
                11628
            ],
            [
                11628,
                11695
            ],
            [
                11695,
                11819
            ],
            [
                11819,
                11881
            ],
            [
                11881,
                11974
            ],
            [
                11974,
                12027
            ],
            [
                12027,
                12063
            ],
            [
                12063,
                12083
            ],
            [
                12083,
                12118
            ],
            [
                12118,
                12139
            ],
            [
                12139,
                12181
            ],
            [
                12181,
                12203
            ],
            [
                12203,
                12353
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                45,
                57
            ],
            [
                62,
                64
            ],
            [
                73,
                108
            ],
            [
                116,
                124
            ],
            [
                125,
                229
            ],
            [
                230,
                232
            ],
            [
                233,
                236
            ],
            [
                252,
                255
            ],
            [
                256,
                268
            ],
            [
                279,
                290
            ],
            [
                290,
                292
            ],
            [
                292,
                303
            ],
            [
                309,
                312
            ],
            [
                321,
                351
            ],
            [
                351,
                370
            ],
            [
                370,
                462
            ],
            [
                462,
                474
            ],
            [
                486,
                487
            ],
            [
                514,
                521
            ],
            [
                521,
                523
            ],
            [
                523,
                554
            ],
            [
                565,
                567
            ],
            [
                567,
                573
            ],
            [
                574,
                598
            ],
            [
                599,
                613
            ],
            [
                613,
                614
            ],
            [
                615,
                622
            ],
            [
                623,
                635
            ],
            [
                645,
                647
            ],
            [
                648,
                657
            ],
            [
                657,
                667
            ],
            [
                668,
                674
            ],
            [
                675,
                679
            ],
            [
                679,
                706
            ],
            [
                707,
                729
            ],
            [
                729,
                775
            ],
            [
                787,
                813
            ],
            [
                813,
                875
            ],
            [
                876,
                911
            ],
            [
                911,
                957
            ],
            [
                958,
                985
            ],
            [
                996,
                1025
            ],
            [
                1025,
                1027
            ],
            [
                1027,
                1072
            ],
            [
                1073,
                1090
            ],
            [
                1091,
                1110
            ],
            [
                1110,
                1112
            ],
            [
                1112,
                1214
            ],
            [
                1214,
                1215
            ],
            [
                1216,
                1255
            ],
            [
                1256,
                1259
            ],
            [
                1260,
                1263
            ],
            [
                1264,
                1363
            ],
            [
                1363,
                1421
            ],
            [
                1428,
                1430
            ],
            [
                1430,
                1467
            ],
            [
                1468,
                1478
            ],
            [
                1479,
                1485
            ],
            [
                1486,
                1488
            ],
            [
                1497,
                1499
            ],
            [
                1499,
                1590
            ],
            [
                1591,
                1604
            ],
            [
                1605,
                1681
            ],
            [
                1684,
                1686
            ],
            [
                1687,
                1688
            ],
            [
                1689,
                1697
            ],
            [
                1709,
                1710
            ],
            [
                1711,
                1725
            ],
            [
                1726,
                1753
            ],
            [
                1756,
                1783
            ],
            [
                1800,
                1804
            ],
            [
                1805,
                1854
            ],
            [
                1855,
                1917
            ],
            [
                1918,
                1938
            ],
            [
                1959,
                1983
            ],
            [
                1984,
                1987
            ],
            [
                1988,
                2003
            ],
            [
                2004,
                2020
            ],
            [
                2035,
                2044
            ],
            [
                2044,
                2046
            ],
            [
                2061,
                2088
            ],
            [
                2091,
                2153
            ],
            [
                2154,
                2157
            ],
            [
                2158,
                2162
            ],
            [
                2165,
                2168
            ],
            [
                2169,
                2179
            ],
            [
                2180,
                2199
            ],
            [
                2207,
                2278
            ],
            [
                2278,
                2280
            ],
            [
                2280,
                2352
            ],
            [
                2353,
                2360
            ],
            [
                2361,
                2429
            ],
            [
                2429,
                2431
            ],
            [
                2439,
                2489
            ],
            [
                2489,
                2525
            ],
            [
                2525,
                2534
            ],
            [
                2535,
                2545
            ],
            [
                2546,
                2548
            ],
            [
                2549,
                2588
            ],
            [
                2594,
                2597
            ],
            [
                2602,
                2681
            ],
            [
                2682,
                2740
            ],
            [
                2740,
                2766
            ],
            [
                2771,
                2854
            ],
            [
                2854,
                2857
            ],
            [
                2858,
                2904
            ],
            [
                2918,
                2936
            ],
            [
                2936,
                2938
            ],
            [
                2938,
                3035
            ],
            [
                3035,
                3081
            ],
            [
                3082,
                3190
            ],
            [
                3190,
                3221
            ],
            [
                3230,
                3266
            ],
            [
                3270,
                3277
            ],
            [
                3286,
                3295
            ],
            [
                3295,
                3318
            ],
            [
                3319,
                3337
            ],
            [
                3338,
                3399
            ],
            [
                3418,
                3420
            ],
            [
                3420,
                3520
            ],
            [
                3520,
                3592
            ],
            [
                3593,
                3620
            ],
            [
                3620,
                3667
            ],
            [
                3678,
                3691
            ],
            [
                3691,
                3706
            ],
            [
                3707,
                3712
            ],
            [
                3723,
                3745
            ],
            [
                3748,
                3791
            ],
            [
                3792,
                3824
            ],
            [
                3825,
                3828
            ],
            [
                3831,
                3948
            ],
            [
                3956,
                3961
            ],
            [
                3962,
                3974
            ],
            [
                3980,
                4013
            ],
            [
                4015,
                4032
            ],
            [
                4033,
                4041
            ],
            [
                4042,
                4047
            ],
            [
                4053,
                4071
            ],
            [
                4071,
                4094
            ],
            [
                4094,
                4134
            ],
            [
                4134,
                4137
            ],
            [
                4138,
                4164
            ],
            [
                4165,
                4222
            ],
            [
                4222,
                4270
            ],
            [
                4274,
                4286
            ],
            [
                4287,
                4290
            ],
            [
                4291,
                4307
            ],
            [
                4307,
                4309
            ],
            [
                4309,
                4320
            ],
            [
                4328,
                4336
            ],
            [
                4337,
                4352
            ],
            [
                4361,
                4407
            ],
            [
                4407,
                4512
            ],
            [
                4513,
                4573
            ],
            [
                4582,
                4586
            ],
            [
                4586,
                4617
            ],
            [
                4618,
                4624
            ],
            [
                4625,
                4629
            ],
            [
                4629,
                4680
            ],
            [
                4680,
                4681
            ],
            [
                4682,
                4691
            ],
            [
                4692,
                4721
            ],
            [
                4722,
                4781
            ],
            [
                4781,
                4874
            ],
            [
                4875,
                4878
            ],
            [
                4886,
                4903
            ],
            [
                4929,
                5011
            ],
            [
                5012,
                5014
            ],
            [
                5015,
                5020
            ],
            [
                5025,
                5032
            ],
            [
                5049,
                5060
            ],
            [
                5060,
                5207
            ],
            [
                5207,
                5210
            ],
            [
                5215,
                5226
            ],
            [
                5227,
                5242
            ],
            [
                5242,
                5261
            ],
            [
                5262,
                5268
            ],
            [
                5268,
                5304
            ],
            [
                5304,
                5368
            ],
            [
                5369,
                5376
            ],
            [
                5382,
                5388
            ],
            [
                5388,
                5390
            ],
            [
                5390,
                5397
            ],
            [
                5405,
                5450
            ],
            [
                5450,
                5452
            ],
            [
                5452,
                5615
            ],
            [
                5618,
                5640
            ],
            [
                5641,
                5643
            ],
            [
                5651,
                5654
            ],
            [
                5654,
                5663
            ],
            [
                5664,
                5709
            ],
            [
                5709,
                5715
            ],
            [
                5716,
                5767
            ],
            [
                5781,
                5818
            ],
            [
                5819,
                5825
            ],
            [
                5826,
                5841
            ],
            [
                5841,
                5842
            ],
            [
                5843,
                5853
            ],
            [
                5862,
                5900
            ],
            [
                5900,
                5902
            ],
            [
                5902,
                6032
            ],
            [
                6032,
                6147
            ],
            [
                6147,
                6273
            ],
            [
                6284,
                6286
            ],
            [
                6286,
                6332
            ],
            [
                6332,
                6376
            ],
            [
                6376,
                6428
            ],
            [
                6443,
                6449
            ],
            [
                6450,
                6481
            ],
            [
                6481,
                6583
            ],
            [
                6583,
                6584
            ],
            [
                6598,
                6610
            ],
            [
                6616,
                6645
            ],
            [
                6646,
                6665
            ],
            [
                6670,
                6685
            ],
            [
                6686,
                6692
            ],
            [
                6692,
                6694
            ],
            [
                6694,
                6700
            ],
            [
                6705,
                6706
            ],
            [
                6717,
                6734
            ],
            [
                6734,
                6760
            ],
            [
                6760,
                6784
            ],
            [
                6784,
                6818
            ],
            [
                6823,
                6833
            ],
            [
                6833,
                6884
            ],
            [
                6884,
                6968
            ],
            [
                6981,
                7016
            ],
            [
                7016,
                7125
            ],
            [
                7126,
                7141
            ],
            [
                7141,
                7168
            ],
            [
                7168,
                7170
            ],
            [
                7170,
                7197
            ],
            [
                7198,
                7259
            ],
            [
                7260,
                7290
            ],
            [
                7290,
                7295
            ],
            [
                7296,
                7305
            ],
            [
                7320,
                7322
            ],
            [
                7322,
                7341
            ],
            [
                7349,
                7365
            ],
            [
                7365,
                7403
            ],
            [
                7404,
                7424
            ],
            [
                7439,
                7461
            ],
            [
                7461,
                7476
            ],
            [
                7477,
                7497
            ],
            [
                7497,
                7545
            ],
            [
                7545,
                7586
            ],
            [
                7586,
                7612
            ],
            [
                7620,
                7644
            ],
            [
                7652,
                7665
            ],
            [
                7665,
                7667
            ],
            [
                7668,
                7713
            ],
            [
                7714,
                7730
            ],
            [
                7731,
                7770
            ],
            [
                7770,
                7771
            ],
            [
                7776,
                7814
            ],
            [
                7814,
                7816
            ],
            [
                7816,
                7835
            ],
            [
                7836,
                7852
            ],
            [
                7853,
                7856
            ],
            [
                7857,
                7866
            ],
            [
                7867,
                7910
            ],
            [
                7920,
                7944
            ],
            [
                7950,
                7958
            ],
            [
                7958,
                7959
            ],
            [
                7960,
                8037
            ],
            [
                8038,
                8050
            ],
            [
                8050,
                8051
            ],
            [
                8052,
                8098
            ],
            [
                8098,
                8188
            ],
            [
                8188,
                8255
            ],
            [
                8256,
                8314
            ],
            [
                8314,
                8363
            ],
            [
                8366,
                8367
            ],
            [
                8368,
                8438
            ],
            [
                8438,
                8441
            ],
            [
                8442,
                8473
            ],
            [
                8473,
                8528
            ],
            [
                8528,
                8568
            ],
            [
                8568,
                8587
            ],
            [
                8592,
                8612
            ],
            [
                8617,
                8628
            ],
            [
                8635,
                8686
            ],
            [
                8686,
                8749
            ],
            [
                8750,
                8752
            ],
            [
                8758,
                8790
            ],
            [
                8790,
                8792
            ],
            [
                8792,
                8851
            ],
            [
                8853,
                8963
            ],
            [
                8964,
                9010
            ],
            [
                9010,
                9018
            ],
            [
                9018,
                9019
            ],
            [
                9020,
                9022
            ],
            [
                9030,
                9035
            ],
            [
                9035,
                9036
            ],
            [
                9037,
                9086
            ],
            [
                9088,
                9100
            ],
            [
                9101,
                9122
            ],
            [
                9123,
                9126
            ],
            [
                9128,
                9131
            ],
            [
                9132,
                9144
            ],
            [
                9145,
                9215
            ],
            [
                9215,
                9311
            ],
            [
                9311,
                9313
            ],
            [
                9313,
                9319
            ],
            [
                9325,
                9329
            ],
            [
                9330,
                9337
            ],
            [
                9337,
                9338
            ],
            [
                9351,
                9354
            ],
            [
                9355,
                9363
            ],
            [
                9363,
                9364
            ],
            [
                9365,
                9433
            ],
            [
                9433,
                9435
            ],
            [
                9435,
                9457
            ],
            [
                9479,
                9501
            ],
            [
                9502,
                9505
            ],
            [
                9506,
                9519
            ],
            [
                9520,
                9522
            ],
            [
                9523,
                9549
            ],
            [
                9550,
                9554
            ],
            [
                9565,
                9567
            ],
            [
                9572,
                9574
            ],
            [
                9574,
                9708
            ],
            [
                9708,
                9727
            ],
            [
                9727,
                9729
            ],
            [
                9729,
                9798
            ],
            [
                9801,
                9807
            ],
            [
                9808,
                9846
            ],
            [
                9846,
                9848
            ],
            [
                9848,
                9926
            ],
            [
                9945,
                9948
            ],
            [
                9954,
                9957
            ],
            [
                9963,
                9968
            ],
            [
                9968,
                9969
            ],
            [
                9970,
                10138
            ],
            [
                10139,
                10145
            ],
            [
                10145,
                10148
            ],
            [
                10148,
                10149
            ],
            [
                10149,
                10154
            ],
            [
                10155,
                10220
            ],
            [
                10220,
                10387
            ],
            [
                10387,
                10441
            ],
            [
                10441,
                10483
            ],
            [
                10483,
                10526
            ],
            [
                10526,
                10633
            ],
            [
                10634,
                10637
            ],
            [
                10638,
                10674
            ],
            [
                10674,
                10763
            ],
            [
                10764,
                10766
            ],
            [
                10773,
                10776
            ],
            [
                10776,
                10849
            ],
            [
                10850,
                10862
            ],
            [
                10863,
                10889
            ],
            [
                10889,
                10890
            ],
            [
                10891,
                10959
            ],
            [
                10960,
                11006
            ],
            [
                11006,
                11023
            ],
            [
                11024,
                11083
            ],
            [
                11091,
                11180
            ],
            [
                11191,
                11221
            ],
            [
                11226,
                11230
            ],
            [
                11231,
                11259
            ],
            [
                11259,
                11278
            ],
            [
                11279,
                11282
            ],
            [
                11287,
                11300
            ],
            [
                11305,
                11336
            ],
            [
                11336,
                11339
            ],
            [
                11345,
                11362
            ],
            [
                11362,
                11383
            ],
            [
                11384,
                11399
            ],
            [
                11400,
                11413
            ],
            [
                11416,
                11419
            ],
            [
                11420,
                11462
            ],
            [
                11463,
                11523
            ],
            [
                11524,
                11554
            ],
            [
                11556,
                11596
            ],
            [
                11597,
                11625
            ],
            [
                11628,
                11638
            ],
            [
                11641,
                11695
            ],
            [
                11695,
                11763
            ],
            [
                11775,
                11790
            ],
            [
                11791,
                11818
            ],
            [
                11821,
                11881
            ],
            [
                11881,
                11974
            ],
            [
                11974,
                12027
            ],
            [
                12027,
                12063
            ],
            [
                12063,
                12071
            ],
            [
                12081,
                12083
            ],
            [
                12083,
                12118
            ],
            [
                12118,
                12139
            ],
            [
                12139,
                12162
            ],
            [
                12162,
                12181
            ],
            [
                12181,
                12200
            ],
            [
                12203,
                12309
            ],
            [
                12318,
                12353
            ]
        ],
        "row_chars": [
            [
                0,
                230
            ],
            [
                230,
                292
            ],
            [
                292,
                523
            ],
            [
                523,
                567
            ],
            [
                567,
                707
            ],
            [
                707,
                729
            ],
            [
                729,
                813
            ],
            [
                813,
                911
            ],
            [
                911,
                1027
            ],
            [
                1027,
                1112
            ],
            [
                1112,
                1216
            ],
            [
                1216,
                1216
            ],
            [
                1216,
                1363
            ],
            [
                1363,
                1430
            ],
            [
                1430,
                1499
            ],
            [
                1499,
                1918
            ],
            [
                1918,
                2046
            ],
            [
                2046,
                2046
            ],
            [
                2046,
                2046
            ],
            [
                2046,
                2046
            ],
            [
                2046,
                2046
            ],
            [
                2046,
                2280
            ],
            [
                2280,
                2429
            ],
            [
                2429,
                2489
            ],
            [
                2489,
                2682
            ],
            [
                2682,
                2740
            ],
            [
                2740,
                2854
            ],
            [
                2854,
                2938
            ],
            [
                2938,
                3035
            ],
            [
                3035,
                3035
            ],
            [
                3035,
                3035
            ],
            [
                3035,
                3082
            ],
            [
                3082,
                3190
            ],
            [
                3190,
                3338
            ],
            [
                3338,
                3420
            ],
            [
                3420,
                3520
            ],
            [
                3520,
                3620
            ],
            [
                3620,
                3962
            ],
            [
                3962,
                4071
            ],
            [
                4071,
                4134
            ],
            [
                4134,
                4222
            ],
            [
                4222,
                4309
            ],
            [
                4309,
                4309
            ],
            [
                4309,
                4407
            ],
            [
                4407,
                4682
            ],
            [
                4682,
                4781
            ],
            [
                4781,
                4903
            ],
            [
                4903,
                4903
            ],
            [
                4903,
                5060
            ],
            [
                5060,
                5060
            ],
            [
                5060,
                5207
            ],
            [
                5207,
                5242
            ],
            [
                5242,
                5304
            ],
            [
                5304,
                5390
            ],
            [
                5390,
                5452
            ],
            [
                5452,
                5709
            ],
            [
                5709,
                5902
            ],
            [
                5902,
                6032
            ],
            [
                6032,
                6147
            ],
            [
                6147,
                6286
            ],
            [
                6286,
                6376
            ],
            [
                6376,
                6376
            ],
            [
                6376,
                6481
            ],
            [
                6481,
                6481
            ],
            [
                6481,
                6481
            ],
            [
                6481,
                6585
            ],
            [
                6585,
                6585
            ],
            [
                6585,
                6585
            ],
            [
                6585,
                6694
            ],
            [
                6694,
                6734
            ],
            [
                6734,
                6760
            ],
            [
                6760,
                6784
            ],
            [
                6784,
                6784
            ],
            [
                6784,
                6833
            ],
            [
                6833,
                6884
            ],
            [
                6884,
                7016
            ],
            [
                7016,
                7141
            ],
            [
                7141,
                7170
            ],
            [
                7170,
                7322
            ],
            [
                7322,
                7365
            ],
            [
                7365,
                7461
            ],
            [
                7461,
                7497
            ],
            [
                7497,
                7545
            ],
            [
                7545,
                7545
            ],
            [
                7545,
                7586
            ],
            [
                7586,
                7586
            ],
            [
                7586,
                7665
            ],
            [
                7665,
                7816
            ],
            [
                7816,
                7960
            ],
            [
                7960,
                8052
            ],
            [
                8052,
                8098
            ],
            [
                8098,
                8188
            ],
            [
                8188,
                8256
            ],
            [
                8256,
                8256
            ],
            [
                8256,
                8314
            ],
            [
                8314,
                8314
            ],
            [
                8314,
                8314
            ],
            [
                8314,
                8368
            ],
            [
                8368,
                8438
            ],
            [
                8438,
                8473
            ],
            [
                8473,
                8528
            ],
            [
                8528,
                8568
            ],
            [
                8568,
                8686
            ],
            [
                8686,
                8792
            ],
            [
                8792,
                9010
            ],
            [
                9010,
                9215
            ],
            [
                9215,
                9215
            ],
            [
                9215,
                9313
            ],
            [
                9313,
                9313
            ],
            [
                9313,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9435
            ],
            [
                9435,
                9574
            ],
            [
                9574,
                9574
            ],
            [
                9574,
                9708
            ],
            [
                9708,
                9729
            ],
            [
                9729,
                9848
            ],
            [
                9848,
                9848
            ],
            [
                9848,
                9970
            ],
            [
                9970,
                9970
            ],
            [
                9970,
                10148
            ],
            [
                10148,
                10220
            ],
            [
                10220,
                10387
            ],
            [
                10387,
                10441
            ],
            [
                10441,
                10483
            ],
            [
                10483,
                10526
            ],
            [
                10526,
                10674
            ],
            [
                10674,
                10776
            ],
            [
                10776,
                11006
            ],
            [
                11006,
                11259
            ],
            [
                11259,
                11336
            ],
            [
                11336,
                11336
            ],
            [
                11336,
                11463
            ],
            [
                11463,
                11523
            ],
            [
                11523,
                11523
            ],
            [
                11523,
                11523
            ],
            [
                11523,
                11523
            ],
            [
                11523,
                11523
            ],
            [
                11523,
                11628
            ],
            [
                11628,
                11628
            ],
            [
                11628,
                11695
            ],
            [
                11695,
                11819
            ],
            [
                11819,
                11819
            ],
            [
                11819,
                11881
            ],
            [
                11881,
                11974
            ],
            [
                11974,
                12027
            ],
            [
                12027,
                12063
            ],
            [
                12063,
                12083
            ],
            [
                12083,
                12118
            ],
            [
                12118,
                12139
            ],
            [
                12139,
                12181
            ],
            [
                12181,
                12353
            ]
        ]
    }
}