{
    "original": {
        "text": "Lady Midlothian went away on her road to London on the Wednesday morning, and Alice was to follow her on the next day. It was now December, and the weather was very clear and frosty, but at night there was bright moonlight. On this special night the moon would be full, and Lady Glencora had declared that she and Alice would go out amidst the ruins. It was no secret engagement, having been canvassed in public, and having been met with considerable discouragement by some of the party. Mr. Palliser had remarked that the night air would be very cold, and Mr. Bott had suggested all manner of evil consequences. Had Mr. Palliser alone objected, Lady Glencora might have given way, but Mr. Bott's word riveted her purpose.\n\"We are not going to be frightened,\" Lady Glencora said.\n\"People do not generally walk out at night in December,\" Mr. Palliser observed.\n\"That's just the reason why we want to do it,\" said Lady Glencora. \"But we shall wrap ourselves up, and nobody need be afraid. Jeffrey, we shall expect you to stand sentinel at the old gate, and guard us from the ghosts.\"\nJeffrey Palliser, bargaining that he might be allowed a cigar, promised that he would do as he was bidden.\nThe party at Matching Priory had by this time become very small. There were indeed no guests left, not counting those of the Palliser family, excepting Miss Vavasor, Mr. Bott, and an old lady who had been a great friend of Mr. Palliser's mother. It was past ten in the evening when Lady Glencora declared that the time had arrived for them to carry out their purpose. She invited the two Miss Pallisers to join her, but they declined, urging their fear of the night air, and showing by their manner that they thought the proposition a very imprudent one. Mr. Bott offered to accompany them, but Lady Glencora declined his attendance very stoutly.\n\"No, indeed, Mr. Bott; you were one of those who preached a sermon against my dissipation in the morning, and I'm not going to allow you to join it, now the time for its enjoyment has come.\"\n\"My dear Lady Glencora, if I were you, indeed I wouldn't,\" said the old lady, looking round towards Mr. Palliser.\n\"My dear Mrs. Marsham, if you were me, indeed you would,\" and Lady Glencora also looked at her husband.\n\"I think it a foolish thing to do,\" said Mr. Palliser, sternly.\n\"If you forbid it, of course we won't go,\" said Lady Glencora.\n\"Forbid it:--no; I shall not forbid it.\"\n\"Allons donc,\" said Lady Glencora.\nShe and Alice were already muffled in cloaks and thick shawls, and Alice now followed her out of the room. There was a door which opened from the billiard-room out on to the grand terrace, which ran in front of the house, and here they found Jeffrey Palliser already armed with his cigar. Alice, to tell the truth, would much have preferred to abandon the expedition, but she had felt that it would be cowardly in her to desert Lady Glencora. There had not arisen any very close intimacy between her and Mr. Palliser, but she entertained a certain feeling that Mr. Palliser trusted her, and liked her to be with his wife. She would have wished to justify this supposed confidence, and was almost sure that Mr. Palliser expected her to do so in this instance. She did say a word or two to her cousin up-stairs, urging that perhaps her husband would not like it.\n\"Let him say so plainly,\" said Lady Glencora, \"and I'll give it up instantly. But I'm not going to be lectured out of my purposes secondhand by Mr. Bott or old Mother Marsham. I understand all these people, my dear. And if you throw me over, Alice, I'll never forgive you,\" Lady Glencora added.\nAfter this Alice resolved that she would not throw her friend over. She was afraid to do so. But she was also becoming a little afraid of her friend,--afraid that she would be driven some day either to throw her over, or to say words to her that would be very unpalatable.\n\"Now, Jeffrey,\" said Lady Glencora as they walked abreast along the broad terrace towards the ruins, \"when we get under the old gateway you must let me and Alice go round the dormitory and the chapel alone. Then we'll come back by the cloisters, and we'll take another turn outside with you. The outside is the finest by this light,--only I want to show Alice something by ourselves.\"\n\"You're not afraid, I know, and if Miss Vavasor is not--\"\n\"Miss Vavasor,--who, I think, would have allowed you to call her by her other name on such an occasion as this,--is never afraid.\"\n\"Glencora, how dare you say so?\" said Alice. \"I really think we had better go back.\"\nShe felt herself to be very angry with her cousin. She almost began to fear that she had mistaken her, and had thought better of her than she had deserved. What she had now said struck Alice as being vulgar,--as being premeditated vulgarity, and her annoyance was excessive. Of course Mr. Palliser would think that she was a consenting party to the proposition made to him.\n\"Go back!\" said Glencora. \"No, indeed. We'll go on, and leave him here. Then he can call nobody anything. Don't be angry with me,\" she said, as soon as they were out of hearing. \"The truth is this;--if you choose to have him for your husband, you may.\"\n\"But if I do not choose.\"\n\"Then there can be no harm done, and I will tell him so. But, Alice,--think of this. Whom will you meet that would suit you better? And you need not decide now. You need not say a word, but leave me to tell him, that if it is to be thought of at all, it cannot be thought of till he meets you in London. Trust me, you will be safe with me.\"\n\"You shall tell him nothing of the kind,\" said Alice. \"I believe you to be joking throughout, and I think the joke is a bad one.\"\n\"No; there you wrong me. Indeed I am not joking. I know that in what I am saying I am telling you the simple truth. He has said enough to me to justify me in saying so. Alice, think of it all. It would reconcile me to much, and it would be something to be the mother of the future Duke of Omnium.\"\n\"To me it would be nothing,\" said Alice; \"less than nothing. I mean to say that the temptation is one so easily resisted that it acts in the other way. Don't say anything more about it, Glencora.\"\n\"If you don't wish it, I will not.\"\n\"No;--I do not wish it. I don't think I ever saw moonlight so bright as this. Look at the lines of that window against the light. They are clearer than you ever see them in the day.\"\nThey were now standing just within the gateway of the old cruciform chapel, having entered the transept from a ruined passage which was supposed to have connected the church with the dormitory. The church was altogether roofless, but the entire walls were standing. The small clerestory windows of the nave were perfect, and the large windows of the two transepts and of the west end were nearly so. Of the opposite window, which had formed the back of the choir, very little remained. The top of it, with all its tracery, was gone, and three broken upright mullions of uneven heights alone remained. This was all that remained of the old window, but a transom or cross-bar of stone had been added to protect the carved stone-work of the sides, and save the form of the aperture from further ruin. That this transom was modern was to be seen from the magnificent height and light grace of the workmanship in the other windows, in which the long slender mullions rose from the lower stage or foundation of the whole up into the middle tracery of the arch without protection or support, and then lost themselves among the curves, not running up into the roof or soffit, and there holding on as though unable to stand alone. Such weakness as that had not as yet shown itself in English church architecture when Matching Priory was built.\n[Illustration: The Priory Ruins.]\n\"Is it not beautiful!\" said Glencora. \"I do love it so! And there is a peculiar feeling of cold about the chill of the moon, different from any other cold. It makes you wrap yourself up tight, but it does not make your teeth chatter; and it seems to go into your senses rather than into your bones. But I suppose that's nonsense,\" she added, after a pause.\n\"Not more so than what people are supposed to talk by moonlight.\"\n\"That's unkind. I'd like what I say on such an occasion to be more poetical or else more nonsensical than what other people say under the same circumstances. And now I'll tell you why I always think of you when I come here by moonlight.\"\n\"But I suppose you don't often come.\"\n\"Yes, I do; that is to say, I did come very often when we had the full moon in August. The weather wasn't like this, and I used to run out through the open windows and nobody knew where I was gone. I made him come once, but he didn't seem to care about it. I told him that part of the refectory wall was falling; so he looked at that, and had a mason sent the next day. If anything is out of order he has it put to rights at once. There would have been no ruins if all the Pallisers had been like him.\"\n\"So much the better for the world.\"\n\"No;--I say no. Things may live too long. But now I'm going to tell you. Do you remember that night I brought you home from the play to Queen Anne Street?\"\n\"Indeed I do,--very well.\"\nAlice had occasion to remember it, for it had been in the carriage on that evening that she had positively refused to give any aid to her cousin in that matter relating to Burgo Fitzgerald.\n\"And do you remember how the moon shone then?\"\n\"Yes, I think I do.\"\n\"I know I do. As we came round the corner out of Cavendish Square he was standing there,--and a friend of yours was standing with him.\"\n\"What friend of mine?\"\n\"Never mind that; it does not matter now.\"\n\"Do you mean my cousin George?\"\n\"Yes, I do mean your cousin; and oh, Alice! dear Alice! I don't know why I should love you, for if you had not been hardhearted that night,--stony cruel in your hard propriety, I should have gone with him then, and all this icy coldness would have been prevented.\"\nShe was standing quite close to Alice, and as she spake she shook with shivering and wrapped her furs closer and still closer about her.\n\"You are very cold,\" said Alice. \"We had better go in.\"\n\"No, I am not cold,--not in that way. I won't go in yet. Jeffrey will come to us directly. Yes;--we should have escaped that night if you would have allowed him to come into your house. Ah, well! we didn't, and there's an end of it.\"\n\"But Glencora,--you cannot regret it.\"\n\"Not regret it! Alice, where can your heart be? Or have you a heart? Not regret it! I would give everything I have in the world to have been true to him. They told me that he would spend my money. Though he should have spent every farthing of it, I regret it; though he should have made me a beggar, I regret it. They told me that he would ill-use me, and desert me,--perhaps beat me. I do not believe it; but even though that should have been so, I regret it. It is better to have a false husband than to be a false wife.\"\n\"Glencora, do not speak like that. Do not try to make me think that anything could tempt you to be false to your vows.\"\n\"Tempt me to be false! Why, child, it has been all false throughout. I never loved him. How can you talk in that way, when you know that I never loved him? They browbeat me and frightened me till I did as I was told;--and now;--what am I now?\"\n\"You are his honest wife. Glencora, listen to me.\" And Alice took hold of her arm.\n\"No,\" she said, \"no; I am not honest. By law I am his wife; but the laws are liars! I am not his wife. I will not say the thing that I am. When I went to him at the altar, I knew that I did not love the man that was to be my husband. But him,--Burgo,--I love him with all my heart and soul. I could stoop at his feet and clean his shoes for him, and think it no disgrace!\"\n\"Oh, Cora, my friend, do not say such words as those! Remember what you owe your husband and yourself, and come away.\"\n\"I do know what I owe him, and I will pay it him. Alice, if I had a child I think I would be true to him. Think! I know I would;--though I had no hour of happiness left to me in my life. But what now is the only honest thing that I can do? Why, leave him;--so leave him that he may have another wife and be the father of a child. What injury shall I do him by leaving him? He does not love me; you know yourself that he does not love me.\"\n\"I know that he does.\"\n\"Alice, that is untrue. He does not; and you have seen clearly that it is so. It may be that he can love no woman. But another woman would give him a son, and he would be happy. I tell you that every day and every night,--every hour of every day and of every night,--I am thinking of the man I love. I have nothing else to think of. I have no occupation,--no friends,--no one to whom I care to say a word. But I am always talking to Burgo in my thoughts; and he listens to me. I dream that his arm is round me--\"\n\"Oh, Glencora!\"\n\"Well!--Do you begrudge me that I should tell you the truth? You have said that you would be my friend, and you must bear the burden of my friendship. And now,--this is what I want to tell you.--Immediately after Christmas, we are to go to Monkshade, and he will be there. Lady Monk is his aunt.\"\n\"You must not go. No power should take you there.\"\n\"That is easily said, child; but all the same I must go. I told Mr. Palliser that he would be there, and he said it did not signify. He actually said that it did not signify. I wonder whether he understands what it is for people to love each other;--whether he has ever thought about it.\"\n\"You must tell him plainly that you will not go.\"\n\"I did. I told him plainly as words could tell him. 'Glencora,' he said,--and you know the way he looks when he means to be lord and master, and put on the very husband indeed,--'This is an annoyance which you must bear and overcome. It suits me that we should go to Monkshade, and it does not suit me that there should be any one whom you are afraid to meet.' Could I tell him that he would lose his wife if I did go? Could I threaten him that I would throw myself into Burgo's arms if that opportunity were given to me? You are very wise, and very prudent. What would you have had me say?\"\n\"I would have you now tell him everything, rather than go to that house.\"\n\"Alice, look here. I know what I am, and what I am like to become. I loathe myself, and I loathe the thing that I am thinking of. I could have clung to the outside of a man's body, to his very trappings, and loved him ten times better than myself!--ay, even though he had ill-treated me,--if I had been allowed to choose a husband for myself. Burgo would have spent my money,--all that it would have been possible for me to give him. But there would have been something left, and I think that by that time I could have won even him to care for me. But with that man--! Alice you are very wise. What am I to do?\"\nAlice had no doubt as to what her cousin should do. She should be true to her marriage-vow, whether that vow when made were true or false. She should be true to it as far as truth would now carry her. And in order that she might be true, she should tell her husband as much as might be necessary to induce him to spare her the threatened visit to Monkshade. All that she said to Lady Glencora, as they walked slowly across the chapel. But Lady Glencora was more occupied with her own thoughts than with her friend's advice. \"Here's Jeffrey!\" she said. \"What an unconscionable time we have kept him!\"\n\"Don't mention it,\" he said. \"And I shouldn't have come to you now, only that I thought I should find you both freezing into marble.\"\n\"We are not such cold-blooded creatures as that,--are we, Alice?\" said Lady Glencora. \"And now we'll go round the outside; only we must not stay long, or we shall frighten those two delicious old duennas, Mrs. Marsham and Mr. Bott.\"\nThese last words were said as it were in a whisper to Alice; but they were so whispered that there was no real attempt to keep them from the ears of Mr. Jeffrey Palliser. Glencora, Alice thought, should not have allowed the word duenna to have passed her lips in speaking to any one; but, above all, she should not have done so in the hearing of Mr. Palliser's cousin.\nThey walked all round the ruin, on a raised gravel-path which had been made there; and Alice, who could hardly bring herself to speak,--so full was her mind of that which had just been said to her,--was surprised to find that Glencora could go on, in her usual light humour, chatting as though there were no weight within her to depress her spirits.",
        "paragraph_chars": [
            [
                0,
                723
            ],
            [
                723,
                780
            ],
            [
                780,
                860
            ],
            [
                860,
                1082
            ],
            [
                1082,
                1189
            ],
            [
                1189,
                1836
            ],
            [
                1836,
                2027
            ],
            [
                2027,
                2141
            ],
            [
                2141,
                2245
            ],
            [
                2245,
                2309
            ],
            [
                2309,
                2372
            ],
            [
                2372,
                2413
            ],
            [
                2413,
                2448
            ],
            [
                2448,
                3309
            ],
            [
                3309,
                3604
            ],
            [
                3604,
                3877
            ],
            [
                3877,
                4262
            ],
            [
                4262,
                4320
            ],
            [
                4320,
                4451
            ],
            [
                4451,
                4536
            ],
            [
                4536,
                4910
            ],
            [
                4910,
                5163
            ],
            [
                5163,
                5189
            ],
            [
                5189,
                5530
            ],
            [
                5530,
                5660
            ],
            [
                5660,
                5958
            ],
            [
                5958,
                6155
            ],
            [
                6155,
                6191
            ],
            [
                6191,
                6374
            ],
            [
                6374,
                7709
            ],
            [
                7709,
                7743
            ],
            [
                7743,
                8100
            ],
            [
                8100,
                8166
            ],
            [
                8166,
                8404
            ],
            [
                8404,
                8442
            ],
            [
                8442,
                8945
            ],
            [
                8945,
                8981
            ],
            [
                8981,
                9137
            ],
            [
                9137,
                9164
            ],
            [
                9164,
                9354
            ],
            [
                9354,
                9401
            ],
            [
                9401,
                9422
            ],
            [
                9422,
                9558
            ],
            [
                9558,
                9581
            ],
            [
                9581,
                9624
            ],
            [
                9624,
                9656
            ],
            [
                9656,
                9921
            ],
            [
                9921,
                10058
            ],
            [
                10058,
                10114
            ],
            [
                10114,
                10348
            ],
            [
                10348,
                10387
            ],
            [
                10387,
                10911
            ],
            [
                10911,
                11031
            ],
            [
                11031,
                11275
            ],
            [
                11275,
                11358
            ],
            [
                11358,
                11731
            ],
            [
                11731,
                11850
            ],
            [
                11850,
                12289
            ],
            [
                12289,
                12312
            ],
            [
                12312,
                12825
            ],
            [
                12825,
                12841
            ],
            [
                12841,
                13138
            ],
            [
                13138,
                13189
            ],
            [
                13189,
                13478
            ],
            [
                13478,
                13528
            ],
            [
                13528,
                14120
            ],
            [
                14120,
                14194
            ],
            [
                14194,
                14806
            ],
            [
                14806,
                15406
            ],
            [
                15406,
                15540
            ],
            [
                15540,
                15773
            ],
            [
                15773,
                16142
            ],
            [
                16142,
                16491
            ]
        ],
        "segment_chars": [
            [
                0,
                119
            ],
            [
                119,
                224
            ],
            [
                224,
                351
            ],
            [
                351,
                488
            ],
            [
                488,
                613
            ],
            [
                613,
                723
            ],
            [
                723,
                780
            ],
            [
                780,
                860
            ],
            [
                860,
                927
            ],
            [
                927,
                987
            ],
            [
                987,
                1082
            ],
            [
                1082,
                1189
            ],
            [
                1189,
                1254
            ],
            [
                1254,
                1435
            ],
            [
                1435,
                1557
            ],
            [
                1557,
                1744
            ],
            [
                1744,
                1836
            ],
            [
                1836,
                2027
            ],
            [
                2027,
                2141
            ],
            [
                2141,
                2245
            ],
            [
                2245,
                2309
            ],
            [
                2309,
                2372
            ],
            [
                2372,
                2413
            ],
            [
                2413,
                2448
            ],
            [
                2448,
                2555
            ],
            [
                2555,
                2737
            ],
            [
                2737,
                2891
            ],
            [
                2891,
                3070
            ],
            [
                3070,
                3207
            ],
            [
                3207,
                3309
            ],
            [
                3309,
                3387
            ],
            [
                3387,
                3485
            ],
            [
                3485,
                3525
            ],
            [
                3525,
                3604
            ],
            [
                3604,
                3672
            ],
            [
                3672,
                3697
            ],
            [
                3697,
                3877
            ],
            [
                3877,
                4084
            ],
            [
                4084,
                4169
            ],
            [
                4169,
                4262
            ],
            [
                4262,
                4320
            ],
            [
                4320,
                4451
            ],
            [
                4451,
                4484
            ],
            [
                4484,
                4496
            ],
            [
                4496,
                4536
            ],
            [
                4536,
                4587
            ],
            [
                4587,
                4692
            ],
            [
                4692,
                4811
            ],
            [
                4811,
                4910
            ],
            [
                4910,
                4921
            ],
            [
                4921,
                4936
            ],
            [
                4936,
                4949
            ],
            [
                4949,
                4982
            ],
            [
                4982,
                5016
            ],
            [
                5016,
                5088
            ],
            [
                5088,
                5163
            ],
            [
                5163,
                5189
            ],
            [
                5189,
                5246
            ],
            [
                5246,
                5274
            ],
            [
                5274,
                5321
            ],
            [
                5321,
                5350
            ],
            [
                5350,
                5493
            ],
            [
                5493,
                5530
            ],
            [
                5530,
                5584
            ],
            [
                5584,
                5660
            ],
            [
                5660,
                5685
            ],
            [
                5685,
                5709
            ],
            [
                5709,
                5776
            ],
            [
                5776,
                5829
            ],
            [
                5829,
                5853
            ],
            [
                5853,
                5958
            ],
            [
                5958,
                6019
            ],
            [
                6019,
                6110
            ],
            [
                6110,
                6155
            ],
            [
                6155,
                6191
            ],
            [
                6191,
                6215
            ],
            [
                6215,
                6269
            ],
            [
                6269,
                6321
            ],
            [
                6321,
                6374
            ],
            [
                6374,
                6568
            ],
            [
                6568,
                6640
            ],
            [
                6640,
                6774
            ],
            [
                6774,
                6860
            ],
            [
                6860,
                6975
            ],
            [
                6975,
                7172
            ],
            [
                7172,
                7596
            ],
            [
                7596,
                7709
            ],
            [
                7709,
                7743
            ],
            [
                7743,
                7766
            ],
            [
                7766,
                7781
            ],
            [
                7781,
                7799
            ],
            [
                7799,
                7899
            ],
            [
                7899,
                8042
            ],
            [
                8042,
                8100
            ],
            [
                8100,
                8166
            ],
            [
                8166,
                8182
            ],
            [
                8182,
                8324
            ],
            [
                8324,
                8404
            ],
            [
                8404,
                8442
            ],
            [
                8442,
                8529
            ],
            [
                8529,
                8640
            ],
            [
                8640,
                8699
            ],
            [
                8699,
                8812
            ],
            [
                8812,
                8873
            ],
            [
                8873,
                8945
            ],
            [
                8945,
                8981
            ],
            [
                8981,
                8997
            ],
            [
                8997,
                9023
            ],
            [
                9023,
                9054
            ],
            [
                9054,
                9137
            ],
            [
                9137,
                9164
            ],
            [
                9164,
                9354
            ],
            [
                9354,
                9401
            ],
            [
                9401,
                9422
            ],
            [
                9422,
                9436
            ],
            [
                9436,
                9558
            ],
            [
                9558,
                9581
            ],
            [
                9581,
                9624
            ],
            [
                9624,
                9656
            ],
            [
                9656,
                9700
            ],
            [
                9700,
                9712
            ],
            [
                9712,
                9921
            ],
            [
                9921,
                10058
            ],
            [
                10058,
                10091
            ],
            [
                10091,
                10114
            ],
            [
                10114,
                10152
            ],
            [
                10152,
                10171
            ],
            [
                10171,
                10205
            ],
            [
                10205,
                10300
            ],
            [
                10300,
                10310
            ],
            [
                10310,
                10348
            ],
            [
                10348,
                10387
            ],
            [
                10387,
                10403
            ],
            [
                10403,
                10435
            ],
            [
                10435,
                10456
            ],
            [
                10456,
                10471
            ],
            [
                10471,
                10541
            ],
            [
                10541,
                10584
            ],
            [
                10584,
                10700
            ],
            [
                10700,
                10772
            ],
            [
                10772,
                10848
            ],
            [
                10848,
                10911
            ],
            [
                10911,
                10946
            ],
            [
                10946,
                11031
            ],
            [
                11031,
                11054
            ],
            [
                11054,
                11100
            ],
            [
                11100,
                11119
            ],
            [
                11119,
                11187
            ],
            [
                11187,
                11275
            ],
            [
                11275,
                11301
            ],
            [
                11301,
                11326
            ],
            [
                11326,
                11358
            ],
            [
                11358,
                11396
            ],
            [
                11396,
                11442
            ],
            [
                11442,
                11461
            ],
            [
                11461,
                11497
            ],
            [
                11497,
                11592
            ],
            [
                11592,
                11649
            ],
            [
                11649,
                11731
            ],
            [
                11731,
                11785
            ],
            [
                11785,
                11850
            ],
            [
                11850,
                11900
            ],
            [
                11900,
                11956
            ],
            [
                11956,
                11963
            ],
            [
                11963,
                12037
            ],
            [
                12037,
                12090
            ],
            [
                12090,
                12180
            ],
            [
                12180,
                12223
            ],
            [
                12223,
                12289
            ],
            [
                12289,
                12312
            ],
            [
                12312,
                12336
            ],
            [
                12336,
                12390
            ],
            [
                12390,
                12427
            ],
            [
                12427,
                12490
            ],
            [
                12490,
                12612
            ],
            [
                12612,
                12645
            ],
            [
                12645,
                12718
            ],
            [
                12718,
                12789
            ],
            [
                12789,
                12825
            ],
            [
                12825,
                12841
            ],
            [
                12841,
                12902
            ],
            [
                12902,
                12992
            ],
            [
                12992,
                13114
            ],
            [
                13114,
                13138
            ],
            [
                13138,
                13156
            ],
            [
                13156,
                13189
            ],
            [
                13189,
                13246
            ],
            [
                13246,
                13322
            ],
            [
                13322,
                13364
            ],
            [
                13364,
                13478
            ],
            [
                13478,
                13528
            ],
            [
                13528,
                13536
            ],
            [
                13536,
                13580
            ],
            [
                13580,
                13762
            ],
            [
                13762,
                13889
            ],
            [
                13889,
                13947
            ],
            [
                13947,
                14050
            ],
            [
                14050,
                14087
            ],
            [
                14087,
                14120
            ],
            [
                14120,
                14194
            ],
            [
                14194,
                14213
            ],
            [
                14213,
                14261
            ],
            [
                14261,
                14324
            ],
            [
                14324,
                14537
            ],
            [
                14537,
                14628
            ],
            [
                14628,
                14742
            ],
            [
                14742,
                14763
            ],
            [
                14763,
                14788
            ],
            [
                14788,
                14806
            ],
            [
                14806,
                14858
            ],
            [
                14858,
                14945
            ],
            [
                14945,
                15007
            ],
            [
                15007,
                15164
            ],
            [
                15164,
                15241
            ],
            [
                15241,
                15330
            ],
            [
                15330,
                15348
            ],
            [
                15348,
                15358
            ],
            [
                15358,
                15406
            ],
            [
                15406,
                15435
            ],
            [
                15435,
                15540
            ],
            [
                15540,
                15606
            ],
            [
                15606,
                15626
            ],
            [
                15626,
                15773
            ],
            [
                15773,
                15944
            ],
            [
                15944,
                16142
            ],
            [
                16142,
                16491
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                55,
                90
            ],
            [
                105,
                119
            ],
            [
                119,
                159
            ],
            [
                165,
                224
            ],
            [
                224,
                231
            ],
            [
                240,
                351
            ],
            [
                488,
                613
            ],
            [
                613,
                701
            ],
            [
                710,
                723
            ],
            [
                927,
                928
            ],
            [
                932,
                958
            ],
            [
                958,
                959
            ],
            [
                960,
                987
            ],
            [
                987,
                1081
            ],
            [
                1082,
                1098
            ],
            [
                1145,
                1153
            ],
            [
                1168,
                1170
            ],
            [
                1187,
                1189
            ],
            [
                1189,
                1254
            ],
            [
                1254,
                1287
            ],
            [
                1331,
                1337
            ],
            [
                1341,
                1435
            ],
            [
                1435,
                1511
            ],
            [
                1529,
                1531
            ],
            [
                1538,
                1541
            ],
            [
                1555,
                1557
            ],
            [
                1557,
                1622
            ],
            [
                1742,
                1744
            ],
            [
                1744,
                1778
            ],
            [
                1834,
                1836
            ],
            [
                1836,
                1857
            ],
            [
                1859,
                1925
            ],
            [
                1940,
                1983
            ],
            [
                2024,
                2027
            ],
            [
                2027,
                2141
            ],
            [
                2141,
                2245
            ],
            [
                2245,
                2298
            ],
            [
                2300,
                2309
            ],
            [
                2309,
                2372
            ],
            [
                2372,
                2382
            ],
            [
                2385,
                2413
            ],
            [
                2413,
                2414
            ],
            [
                2425,
                2448
            ],
            [
                2448,
                2509
            ],
            [
                2553,
                2554
            ],
            [
                2515,
                2520
            ],
            [
                2525,
                2541
            ],
            [
                2618,
                2635
            ],
            [
                2637,
                2668
            ],
            [
                2674,
                2706
            ],
            [
                2715,
                2725
            ],
            [
                2565,
                2566
            ],
            [
                2730,
                2737
            ],
            [
                2737,
                2768
            ],
            [
                2774,
                2819
            ],
            [
                2869,
                2891
            ],
            [
                2970,
                2973
            ],
            [
                2897,
                2900
            ],
            [
                2986,
                2987
            ],
            [
                2996,
                3070
            ],
            [
                3070,
                3073
            ],
            [
                3085,
                3116
            ],
            [
                3127,
                3132
            ],
            [
                3219,
                3246
            ],
            [
                3256,
                3309
            ],
            [
                3309,
                3387
            ],
            [
                3387,
                3438
            ],
            [
                3450,
                3485
            ],
            [
                3485,
                3525
            ],
            [
                3525,
                3580
            ],
            [
                3604,
                3672
            ],
            [
                3697,
                3708
            ],
            [
                3714,
                3752
            ],
            [
                3762,
                3849
            ],
            [
                3850,
                3855
            ],
            [
                3875,
                3877
            ],
            [
                3877,
                3926
            ],
            [
                3959,
                4084
            ],
            [
                4084,
                4169
            ],
            [
                4216,
                4262
            ],
            [
                4262,
                4288
            ],
            [
                4294,
                4316
            ],
            [
                4320,
                4333
            ],
            [
                4336,
                4355
            ],
            [
                4369,
                4384
            ],
            [
                4433,
                4451
            ],
            [
                4451,
                4484
            ],
            [
                4484,
                4496
            ],
            [
                4496,
                4535
            ],
            [
                4536,
                4544
            ],
            [
                4559,
                4585
            ],
            [
                4553,
                4558
            ],
            [
                4585,
                4587
            ],
            [
                4811,
                4820
            ],
            [
                4834,
                4839
            ],
            [
                4855,
                4858
            ],
            [
                4861,
                4868
            ],
            [
                4908,
                4910
            ],
            [
                4910,
                4921
            ],
            [
                4921,
                4936
            ],
            [
                4936,
                4949
            ],
            [
                4949,
                4982
            ],
            [
                4982,
                5016
            ],
            [
                5016,
                5088
            ],
            [
                5088,
                5101
            ],
            [
                5109,
                5163
            ],
            [
                5163,
                5186
            ],
            [
                5189,
                5194
            ],
            [
                5208,
                5215
            ],
            [
                5216,
                5220
            ],
            [
                5244,
                5246
            ],
            [
                5246,
                5257
            ],
            [
                5279,
                5321
            ],
            [
                5321,
                5350
            ],
            [
                5385,
                5399
            ],
            [
                5415,
                5417
            ],
            [
                5469,
                5491
            ],
            [
                5530,
                5584
            ],
            [
                5584,
                5598
            ],
            [
                5605,
                5611
            ],
            [
                5622,
                5627
            ],
            [
                5636,
                5660
            ],
            [
                5660,
                5664
            ],
            [
                5685,
                5709
            ],
            [
                5776,
                5829
            ],
            [
                5829,
                5847
            ],
            [
                5851,
                5853
            ],
            [
                5853,
                5958
            ],
            [
                5958,
                5997
            ],
            [
                6017,
                6019
            ],
            [
                6110,
                6155
            ],
            [
                6155,
                6191
            ],
            [
                6191,
                6192
            ],
            [
                6197,
                6215
            ],
            [
                6215,
                6269
            ],
            [
                6269,
                6321
            ],
            [
                6321,
                6374
            ],
            [
                6374,
                6431
            ],
            [
                6442,
                6448
            ],
            [
                6566,
                6568
            ],
            [
                6568,
                6582
            ],
            [
                6594,
                6611
            ],
            [
                6619,
                6640
            ],
            [
                6640,
                6649
            ],
            [
                6661,
                6773
            ],
            [
                6774,
                6860
            ],
            [
                6860,
                6940
            ],
            [
                6959,
                6974
            ],
            [
                7743,
                7766
            ],
            [
                7766,
                7781
            ],
            [
                7781,
                7799
            ],
            [
                7799,
                7899
            ],
            [
                7981,
                8042
            ],
            [
                8042,
                8071
            ],
            [
                8100,
                8101
            ],
            [
                8105,
                8109
            ],
            [
                8113,
                8166
            ],
            [
                8166,
                8182
            ],
            [
                8324,
                8404
            ],
            [
                8404,
                8442
            ],
            [
                8442,
                8443
            ],
            [
                8470,
                8529
            ],
            [
                8563,
                8640
            ],
            [
                8640,
                8699
            ],
            [
                8699,
                8760
            ],
            [
                8781,
                8812
            ],
            [
                8812,
                8873
            ],
            [
                8873,
                8945
            ],
            [
                8945,
                8964
            ],
            [
                8978,
                8981
            ],
            [
                8981,
                8982
            ],
            [
                8987,
                8997
            ],
            [
                8997,
                9023
            ],
            [
                9023,
                9052
            ],
            [
                9054,
                9137
            ],
            [
                9137,
                9149
            ],
            [
                9161,
                9163
            ],
            [
                9203,
                9214
            ],
            [
                9231,
                9308
            ],
            [
                9336,
                9354
            ],
            [
                9354,
                9393
            ],
            [
                9436,
                9463
            ],
            [
                9471,
                9509
            ],
            [
                9512,
                9558
            ],
            [
                9624,
                9656
            ],
            [
                9656,
                9660
            ],
            [
                9683,
                9700
            ],
            [
                9700,
                9712
            ],
            [
                9712,
                9771
            ],
            [
                9797,
                9808
            ],
            [
                9784,
                9794
            ],
            [
                9831,
                9921
            ],
            [
                9921,
                9970
            ],
            [
                9977,
                9980
            ],
            [
                9992,
                9994
            ],
            [
                10002,
                10029
            ],
            [
                10047,
                10058
            ],
            [
                10058,
                10091
            ],
            [
                10091,
                10114
            ],
            [
                10114,
                10118
            ],
            [
                10124,
                10127
            ],
            [
                10166,
                10171
            ],
            [
                10171,
                10205
            ],
            [
                10211,
                10251
            ],
            [
                10263,
                10300
            ],
            [
                10300,
                10310
            ],
            [
                10310,
                10348
            ],
            [
                10348,
                10362
            ],
            [
                10364,
                10387
            ],
            [
                10387,
                10403
            ],
            [
                10403,
                10435
            ],
            [
                10471,
                10541
            ],
            [
                10647,
                10700
            ],
            [
                10700,
                10752
            ],
            [
                10770,
                10772
            ],
            [
                10772,
                10801
            ],
            [
                10809,
                10846
            ],
            [
                10911,
                10946
            ],
            [
                10946,
                11031
            ],
            [
                11031,
                11054
            ],
            [
                11054,
                11100
            ],
            [
                11100,
                11119
            ],
            [
                11119,
                11187
            ],
            [
                11187,
                11247
            ],
            [
                11249,
                11256
            ],
            [
                11259,
                11275
            ],
            [
                11275,
                11301
            ],
            [
                11301,
                11326
            ],
            [
                11330,
                11358
            ],
            [
                11374,
                11396
            ],
            [
                11396,
                11442
            ],
            [
                11497,
                11556
            ],
            [
                11590,
                11592
            ],
            [
                11592,
                11595
            ],
            [
                11602,
                11607
            ],
            [
                11610,
                11616
            ],
            [
                11621,
                11649
            ],
            [
                11649,
                11731
            ],
            [
                11731,
                11774
            ],
            [
                11783,
                11785
            ],
            [
                11785,
                11850
            ],
            [
                11850,
                11900
            ],
            [
                11900,
                11925
            ],
            [
                11934,
                11956
            ],
            [
                12037,
                12090
            ],
            [
                12090,
                12105
            ],
            [
                12107,
                12109
            ],
            [
                12120,
                12180
            ],
            [
                12180,
                12223
            ],
            [
                12223,
                12252
            ],
            [
                12262,
                12266
            ],
            [
                12286,
                12289
            ],
            [
                12289,
                12312
            ],
            [
                12312,
                12336
            ],
            [
                12336,
                12347
            ],
            [
                12388,
                12390
            ],
            [
                12405,
                12427
            ],
            [
                12427,
                12490
            ],
            [
                12534,
                12561
            ],
            [
                12520,
                12532
            ],
            [
                12579,
                12612
            ],
            [
                12612,
                12645
            ],
            [
                12645,
                12666
            ],
            [
                12668,
                12678
            ],
            [
                12688,
                12690
            ],
            [
                12703,
                12705
            ],
            [
                12716,
                12718
            ],
            [
                12718,
                12789
            ],
            [
                12789,
                12821
            ],
            [
                12825,
                12841
            ],
            [
                12841,
                12842
            ],
            [
                12849,
                12867
            ],
            [
                12887,
                12902
            ],
            [
                12902,
                12905
            ],
            [
                12911,
                12943
            ],
            [
                12990,
                12992
            ],
            [
                12992,
                12995
            ],
            [
                13002,
                13033
            ],
            [
                13048,
                13114
            ],
            [
                13114,
                13138
            ],
            [
                13138,
                13154
            ],
            [
                13189,
                13209
            ],
            [
                13216,
                13221
            ],
            [
                13235,
                13246
            ],
            [
                13246,
                13296
            ],
            [
                13325,
                13364
            ],
            [
                13364,
                13436
            ],
            [
                13475,
                13478
            ],
            [
                13478,
                13528
            ],
            [
                13528,
                13536
            ],
            [
                13536,
                13546
            ],
            [
                13547,
                13580
            ],
            [
                13580,
                13599
            ],
            [
                13602,
                13667
            ],
            [
                13706,
                13762
            ],
            [
                13762,
                13850
            ],
            [
                13859,
                13889
            ],
            [
                13889,
                13938
            ],
            [
                13945,
                13947
            ],
            [
                13947,
                13963
            ],
            [
                13968,
                14011
            ],
            [
                14048,
                14050
            ],
            [
                14087,
                14120
            ],
            [
                14120,
                14194
            ],
            [
                14194,
                14213
            ],
            [
                14213,
                14229
            ],
            [
                14259,
                14261
            ],
            [
                14261,
                14324
            ],
            [
                14324,
                14336
            ],
            [
                14402,
                14407
            ],
            [
                14361,
                14366
            ],
            [
                14412,
                14440
            ],
            [
                14447,
                14480
            ],
            [
                14483,
                14537
            ],
            [
                14537,
                14568
            ],
            [
                14626,
                14628
            ],
            [
                14628,
                14742
            ],
            [
                14742,
                14759
            ],
            [
                14761,
                14763
            ],
            [
                14763,
                14788
            ],
            [
                14788,
                14806
            ],
            [
                14806,
                14858
            ],
            [
                14858,
                14945
            ],
            [
                14945,
                14969
            ],
            [
                14992,
                14995
            ],
            [
                15005,
                15007
            ],
            [
                15007,
                15010
            ],
            [
                15044,
                15132
            ],
            [
                15144,
                15163
            ],
            [
                15164,
                15167
            ],
            [
                15173,
                15241
            ],
            [
                15241,
                15329
            ],
            [
                15330,
                15348
            ],
            [
                15348,
                15358
            ],
            [
                15626,
                15773
            ],
            [
                16142,
                16178
            ],
            [
                16186,
                16197
            ],
            [
                16223,
                16276
            ],
            [
                16341,
                16388
            ],
            [
                16390,
                16446
            ],
            [
                16468,
                16491
            ]
        ],
        "row_chars": [
            [
                0,
                119
            ],
            [
                119,
                224
            ],
            [
                224,
                351
            ],
            [
                351,
                488
            ],
            [
                488,
                613
            ],
            [
                613,
                723
            ],
            [
                723,
                780
            ],
            [
                780,
                860
            ],
            [
                860,
                927
            ],
            [
                927,
                987
            ],
            [
                987,
                1082
            ],
            [
                1082,
                1189
            ],
            [
                1189,
                1254
            ],
            [
                1254,
                1435
            ],
            [
                1435,
                1557
            ],
            [
                1557,
                1744
            ],
            [
                1744,
                1836
            ],
            [
                1836,
                2027
            ],
            [
                2027,
                2141
            ],
            [
                2141,
                2245
            ],
            [
                2245,
                2309
            ],
            [
                2309,
                2372
            ],
            [
                2372,
                2413
            ],
            [
                2413,
                2448
            ],
            [
                2448,
                2737
            ],
            [
                2737,
                2891
            ],
            [
                2891,
                3070
            ],
            [
                3070,
                3309
            ],
            [
                3309,
                3387
            ],
            [
                3387,
                3485
            ],
            [
                3485,
                3525
            ],
            [
                3525,
                3604
            ],
            [
                3604,
                3672
            ],
            [
                3672,
                3697
            ],
            [
                3697,
                3877
            ],
            [
                3877,
                4084
            ],
            [
                4084,
                4169
            ],
            [
                4169,
                4262
            ],
            [
                4262,
                4320
            ],
            [
                4320,
                4451
            ],
            [
                4451,
                4484
            ],
            [
                4484,
                4496
            ],
            [
                4496,
                4536
            ],
            [
                4536,
                4587
            ],
            [
                4587,
                4692
            ],
            [
                4692,
                4811
            ],
            [
                4811,
                4910
            ],
            [
                4910,
                4921
            ],
            [
                4921,
                4936
            ],
            [
                4936,
                4949
            ],
            [
                4949,
                4982
            ],
            [
                4982,
                5016
            ],
            [
                5016,
                5088
            ],
            [
                5088,
                5163
            ],
            [
                5163,
                5189
            ],
            [
                5189,
                5246
            ],
            [
                5246,
                5321
            ],
            [
                5321,
                5350
            ],
            [
                5350,
                5493
            ],
            [
                5493,
                5530
            ],
            [
                5530,
                5584
            ],
            [
                5584,
                5660
            ],
            [
                5660,
                5709
            ],
            [
                5709,
                5776
            ],
            [
                5776,
                5829
            ],
            [
                5829,
                5853
            ],
            [
                5853,
                5958
            ],
            [
                5958,
                6019
            ],
            [
                6019,
                6110
            ],
            [
                6110,
                6155
            ],
            [
                6155,
                6191
            ],
            [
                6191,
                6215
            ],
            [
                6215,
                6269
            ],
            [
                6269,
                6321
            ],
            [
                6321,
                6374
            ],
            [
                6374,
                6568
            ],
            [
                6568,
                6640
            ],
            [
                6640,
                6774
            ],
            [
                6774,
                6860
            ],
            [
                6860,
                6975
            ],
            [
                6975,
                7172
            ],
            [
                7172,
                7596
            ],
            [
                7596,
                7709
            ],
            [
                7709,
                7743
            ],
            [
                7743,
                7766
            ],
            [
                7766,
                7781
            ],
            [
                7781,
                7799
            ],
            [
                7799,
                7899
            ],
            [
                7899,
                8042
            ],
            [
                8042,
                8100
            ],
            [
                8100,
                8166
            ],
            [
                8166,
                8182
            ],
            [
                8182,
                8324
            ],
            [
                8324,
                8404
            ],
            [
                8404,
                8442
            ],
            [
                8442,
                8529
            ],
            [
                8529,
                8640
            ],
            [
                8640,
                8699
            ],
            [
                8699,
                8812
            ],
            [
                8812,
                8873
            ],
            [
                8873,
                8945
            ],
            [
                8945,
                8981
            ],
            [
                8981,
                8997
            ],
            [
                8997,
                9023
            ],
            [
                9023,
                9137
            ],
            [
                9137,
                9164
            ],
            [
                9164,
                9354
            ],
            [
                9354,
                9401
            ],
            [
                9401,
                9422
            ],
            [
                9422,
                9436
            ],
            [
                9436,
                9558
            ],
            [
                9558,
                9581
            ],
            [
                9581,
                9624
            ],
            [
                9624,
                9656
            ],
            [
                9656,
                9700
            ],
            [
                9700,
                9712
            ],
            [
                9712,
                9921
            ],
            [
                9921,
                10058
            ],
            [
                10058,
                10091
            ],
            [
                10091,
                10114
            ],
            [
                10114,
                10171
            ],
            [
                10171,
                10205
            ],
            [
                10205,
                10300
            ],
            [
                10300,
                10310
            ],
            [
                10310,
                10348
            ],
            [
                10348,
                10387
            ],
            [
                10387,
                10403
            ],
            [
                10403,
                10435
            ],
            [
                10435,
                10456
            ],
            [
                10456,
                10471
            ],
            [
                10471,
                10541
            ],
            [
                10541,
                10584
            ],
            [
                10584,
                10700
            ],
            [
                10700,
                10772
            ],
            [
                10772,
                10848
            ],
            [
                10848,
                10911
            ],
            [
                10911,
                10946
            ],
            [
                10946,
                11031
            ],
            [
                11031,
                11054
            ],
            [
                11054,
                11100
            ],
            [
                11100,
                11119
            ],
            [
                11119,
                11187
            ],
            [
                11187,
                11275
            ],
            [
                11275,
                11301
            ],
            [
                11301,
                11326
            ],
            [
                11326,
                11358
            ],
            [
                11358,
                11396
            ],
            [
                11396,
                11442
            ],
            [
                11442,
                11461
            ],
            [
                11461,
                11497
            ],
            [
                11497,
                11592
            ],
            [
                11592,
                11649
            ],
            [
                11649,
                11731
            ],
            [
                11731,
                11785
            ],
            [
                11785,
                11850
            ],
            [
                11850,
                11900
            ],
            [
                11900,
                11956
            ],
            [
                11956,
                11963
            ],
            [
                11963,
                12037
            ],
            [
                12037,
                12090
            ],
            [
                12090,
                12180
            ],
            [
                12180,
                12223
            ],
            [
                12223,
                12289
            ],
            [
                12289,
                12312
            ],
            [
                12312,
                12336
            ],
            [
                12336,
                12390
            ],
            [
                12390,
                12427
            ],
            [
                12427,
                12490
            ],
            [
                12490,
                12612
            ],
            [
                12612,
                12645
            ],
            [
                12645,
                12718
            ],
            [
                12718,
                12789
            ],
            [
                12789,
                12825
            ],
            [
                12825,
                12841
            ],
            [
                12841,
                12902
            ],
            [
                12902,
                12992
            ],
            [
                12992,
                13114
            ],
            [
                13114,
                13138
            ],
            [
                13138,
                13156
            ],
            [
                13156,
                13189
            ],
            [
                13189,
                13246
            ],
            [
                13246,
                13364
            ],
            [
                13364,
                13478
            ],
            [
                13478,
                13528
            ],
            [
                13528,
                13536
            ],
            [
                13536,
                13580
            ],
            [
                13580,
                13762
            ],
            [
                13762,
                13889
            ],
            [
                13889,
                13947
            ],
            [
                13947,
                14050
            ],
            [
                14050,
                14087
            ],
            [
                14087,
                14120
            ],
            [
                14120,
                14194
            ],
            [
                14194,
                14213
            ],
            [
                14213,
                14261
            ],
            [
                14261,
                14324
            ],
            [
                14324,
                14537
            ],
            [
                14537,
                14628
            ],
            [
                14628,
                14742
            ],
            [
                14742,
                14763
            ],
            [
                14763,
                14788
            ],
            [
                14788,
                14806
            ],
            [
                14806,
                14858
            ],
            [
                14858,
                14945
            ],
            [
                14945,
                15007
            ],
            [
                15007,
                15164
            ],
            [
                15164,
                15241
            ],
            [
                15241,
                15330
            ],
            [
                15330,
                15348
            ],
            [
                15348,
                15358
            ],
            [
                15358,
                15406
            ],
            [
                15406,
                15435
            ],
            [
                15435,
                15540
            ],
            [
                15540,
                15606
            ],
            [
                15606,
                15626
            ],
            [
                15626,
                15773
            ],
            [
                15773,
                15944
            ],
            [
                15944,
                16142
            ],
            [
                16142,
                16491
            ]
        ]
    },
    "abridged": {
        "text": "Lady Midlothian went away on Wednesday morning, and Alice was to leave the next day. It was now December, and the weather was clear and frosty, but at night there was bright moonlight. On this night the moon would be full, and Lady Glencora had declared that she and Alice would go out amidst the ruins. Mr. Palliser had remarked that the night air would be very cold, and Mr. Bott had suggested all manner of evil consequences. Had Mr. Palliser alone objected, Lady Glencora might have given way, but Mr. Bott's word strengthened her purpose.\n\"We shall wrap ourselves up warm,\" she said, \"and nobody need be afraid. Jeffrey, we shall expect you to stand sentinel at the old gate, and guard us from the ghosts.\" Jeffrey Palliser promised to do so.\nThe party at Matching Priory had by this time become very small. There were indeed no guests left, except Miss Vavasor, Mr. Bott, and an old lady who had been a great friend of Mr. Palliser's mother. It was past ten in the evening when Lady Glencora declared that the time had come to go out. She invited the two Miss Pallisers to join her, but they declined. Mr. Bott offered to accompany them.\n\"No, indeed, Mr. Bott,\" said Lady Glencora. \"You were one of those who preached a sermon against my dissipation, and I'm not going to allow you to join it.\"\n\"My dear Lady Glencora, if I were you, indeed I wouldn't,\" said the old lady, looking round towards Mr. Palliser.\n\"My dear Mrs. Marsham, if you were me, indeed you would,\" and Lady Glencora also looked at her husband.\n\"I think it a foolish thing to do,\" said Mr. Palliser sternly.\n\"If you forbid it, of course we won't go,\" said Lady Glencora.\n\"Forbid it - no; I shall not forbid it.\"\n\"Then let us go,\" said Lady Glencora.\nShe and Alice were already muffled in cloaks and thick shawls. Alice followed her out onto the grand terrace which ran in front of the house. Here they found Jeffrey Palliser armed with a cigar. Alice, to tell the truth, would have preferred to abandon the expedition, but could not desert Lady Glencora. She had a feeling that Mr. Palliser trusted her, and liked her to be with his wife. She wished to justify this supposed trust, and had said a word or two to her cousin upstairs, urging that perhaps her husband would not like it.\n\"Let him say so plainly,\" said Lady Glencora, \"and I'll give it up instantly. But I'm not going to be lectured out of my purposes by Mr. Bott or old Mother Marsham. I understand all these people, my dear. And if you throw me over, Alice, I'll never forgive you.\"\nAfter this Alice resolved that she would not throw her friend over. But she was becoming a little afraid of her friend - afraid that she would be driven some day either to throw her over, or to say words to her that she would not like.\n\"Now, Jeffrey,\" said Lady Glencora as they walked towards the ruins, \"when we get under the old gateway you must let me and Alice go round the dormitory and the chapel alone. Then we'll come back by the cloisters, and we'll take another turn outside with you. I want to show Alice something by ourselves.\"\n\"You're not afraid, I know. If Miss Vavasor is not-\"\n\"Miss Vavasor - who, I think, would allow you to call her Alice tonight - is never afraid.\"\n\"Glencora, how dare you say so?\" said Alice. \"I really think we had better go back.\" She felt very angry with her cousin for inviting Mr. Palliser to be familiar with her. Of course he would assume it was with Alice's consent.\n\"Go back!\" said Glencora. \"No, indeed. We'll go on, and leave him here. Then he can call nobody anything. Don't be angry with me,\" she said, as soon as they were out of hearing. \"The truth is, if you choose to have him for your husband, you may.\"\n\"But if I do not choose?\"\n\"Then no harm is done. But, Alice, who will you meet that would suit you better? And you need not decide now. Let me to tell him to wait until he meets you in London.\"\n\"You shall tell him nothing of the kind,\" said Alice. \"I believe you are joking, and the joke is a bad one.\"\n\"No; indeed I am not joking. He has said enough to me to justify me in saying so. Alice, think of it. It would reconcile me to much, and it would be something to be the mother of the future Duke of Omnium.\"\n\"To me it would be nothing,\" said Alice. \"Don't say anything more about it, Glencora.\"\n\"If you don't wish it, I will not.\"\n\"I do not wish it. I don't think I ever saw moonlight so bright as this. Look at the lines of that window against the light. They are clearer than you ever see them in the day.\"\nThey were now standing just within the gateway of the old chapel. The church was roofless, but the walls were standing. The small windows of the nave were perfect, and the large windows of the two transepts and of the west end were nearly so.\nOf the opposite window, which had formed the back of the choir, very little remained. The top of it, with all its tracery, was gone, and three broken upright mullions alone remained.\n\"Is it not beautiful!\" said Glencora. \"I do love it so! And there is a peculiar feeling of cold about the chill of the moon, different from any other cold. It seems to go into your senses rather than into your bones. But I suppose that's nonsense.\"\n\"No more than what people are supposed to talk by moonlight.\"\n\"That's unkind. And now I'll tell you why I always think of you when I come here by moonlight.\"\n\"But I suppose you don't often come.\"\n\"I did come very often when we had the full moon in August. I used to run out through the open windows and nobody knew where I was gone. I made him come once, but he didn't seem to care about it. I told him that part of the refectory wall was falling; so he had a mason sent the next day. If anything is out of order he has it put to rights at once. There would have been no ruins if all the Pallisers had been like him.\"\n\"So much the better.\"\n\"I say no. Things may live too long. But now I'm going to tell you: do you remember that night I brought you home from the play to Queen Anne Street?\"\n\"Indeed I do.\" It had been on that evening that she had positively refused to give any aid to her cousin about Burgo Fitzgerald.\n\"And do you remember how the moon shone? As we came round the corner from Cavendish Square he was standing there - and a friend of yours was standing with him.\"\n\"Do you mean my cousin George?\"\n\"Yes; and oh, Alice! dear Alice! I don't know why I should love you, for if you had not been stony cruel that night, I should have gone with him then, and all this icy coldness would have been prevented.\"\nShe was standing quite close to Alice, and as she spoke she shivered and wrapped her furs closer about her.\n\"You are very cold,\" said Alice. \"We had better go in.\"\n\"No, not yet. Jeffrey will come to us directly. We should have escaped that night if you had allowed him to come into your house. Ah, well! we didn't, and there's an end of it.\"\n\"But Glencora, you cannot regret it.\"\n\"Not regret it! Alice, where can your heart be? I would give everything I have in the world to have been true to him. Though he should have made me a beggar, I regret it. They told me that he would ill-use me, and desert me. I do not believe it; but even if that should have been so, I regret it.\"\n\"Glencora, do not speak like that. Do not try to make me think that anything could tempt you to be false to your vows.\"\n\"Tempt me to be false! Why, child, it has been all false throughout. I never loved him. How can you talk in that way, when you know that I never loved him? They browbeat me and frightened me till I did as I was told;- and now - what am I now?\"\n\"You are his honest wife. Glencora, listen to me.\" Alice took hold of her arm.\n\"No; I am not honest. By law I am his wife; but the laws are liars! When I went to him at the altar, I knew that I did not love him. But Burgo I love with all my heart and soul. I could stoop at his feet and clean his shoes for him, and think it no disgrace!\"\n\"Oh, Cora, my friend, do not say such words! Remember what you owe your husband and yourself, and come away.\"\n\"I do know what I owe him, and I will pay it him. Alice, if I had a child I would be true to him. But what now is the only honest thing that I can do? Why, leave him; so that he may have another wife and be the father of a child. What injury shall I do him by leaving him? He does not love me; you know that.\"\n\"I know that he does.\"\n\"Alice, that is untrue. He does not. Maybe he can love no woman. But another woman would give him a son, and he would be happy. Every hour of every day and every night, I am thinking of the man I love. I have nothing else to think of. I have no occupation, no friends to talk to. But I am always talking to Burgo in my thoughts; and he listens to me. I dream that his arm is round me-\"\n\"Oh, Glencora!\"\n\"Do you begrudge me telling you the truth? You said that you would be my friend. And this is what I want to tell you. Immediately after Christmas, we are to go to Monkshade, and he will be there. Lady Monk is his aunt.\"\n\"You must not go.\"\n\"That is easily said; but I must go. I told Mr. Palliser that he would be there, and he actually said that it did not signify. I wonder whether he understands what it is for people to love each other.\"\n\"You must tell him plainly that you will not go.\"\n\"I did. I told him as plainly as words could tell him. 'Glencora,' he said - and you know the way he looks when he means to be lord and master - 'This is an annoyance which you must bear and overcome. It suits me that we should go to Monkshade, and it does not suit me that there should be anyone whom you are afraid to meet.' Could I tell him that he would lose his wife if I went? Could I threaten that I would throw myself into Burgo's arms? What would you have had me say?\"\n\"I would have you now tell him everything, rather than go to that house.\"\n\"Alice, look here. I know what I am. I loathe myself, and I loathe the thing that I am thinking of. I could have loved a man ten times better than myself - even though he had ill-treated me - if I had been allowed to choose a husband for myself. Burgo would have spent my money. But there would have been something left, and I think that by that time I could have won even him to care for me. But with that man-! Alice you are very wise. What am I to do?\"\nAlice had no doubt as to what her cousin should do. She should be true to her marriage-vow, whether that vow when made were true or false. She should be true to it now. And therefore she should tell her husband as much as might be necessary to induce him to spare her the visit to Monkshade.\nAll this she said to Lady Glencora, as they walked slowly across the chapel. But Lady Glencora was more occupied with her own thoughts than with her friend's advice.\n\"Here's Jeffrey!\" she said. \"And now we'll go round the outside; only we must not stay long, or we shall frighten those two delicious old duennas, Mrs. Marsham and Mr. Bott.\"\nThey walked all round the ruin, on a gravel-path; and Alice, who could hardly bring herself to speak, was surprised to find that Glencora could go on in her usual light humour, chatting as though there were nothing to depress her spirits.",
        "paragraph_chars": [
            [
                0,
                544
            ],
            [
                544,
                748
            ],
            [
                748,
                1144
            ],
            [
                1144,
                1301
            ],
            [
                1301,
                1415
            ],
            [
                1415,
                1519
            ],
            [
                1519,
                1582
            ],
            [
                1582,
                1645
            ],
            [
                1645,
                1686
            ],
            [
                1686,
                1724
            ],
            [
                1724,
                2258
            ],
            [
                2258,
                2521
            ],
            [
                2521,
                2757
            ],
            [
                2757,
                3063
            ],
            [
                3063,
                3116
            ],
            [
                3116,
                3208
            ],
            [
                3208,
                3435
            ],
            [
                3435,
                3682
            ],
            [
                3682,
                3708
            ],
            [
                3708,
                3876
            ],
            [
                3876,
                3985
            ],
            [
                3985,
                4192
            ],
            [
                4192,
                4279
            ],
            [
                4279,
                4315
            ],
            [
                4315,
                4493
            ],
            [
                4493,
                4736
            ],
            [
                4736,
                4919
            ],
            [
                4919,
                5168
            ],
            [
                5168,
                5230
            ],
            [
                5230,
                5326
            ],
            [
                5326,
                5364
            ],
            [
                5364,
                5786
            ],
            [
                5786,
                5808
            ],
            [
                5808,
                5959
            ],
            [
                5959,
                6088
            ],
            [
                6088,
                6249
            ],
            [
                6249,
                6281
            ],
            [
                6281,
                6486
            ],
            [
                6486,
                6594
            ],
            [
                6594,
                6650
            ],
            [
                6650,
                6828
            ],
            [
                6828,
                6866
            ],
            [
                6866,
                7164
            ],
            [
                7164,
                7284
            ],
            [
                7284,
                7528
            ],
            [
                7528,
                7607
            ],
            [
                7607,
                7867
            ],
            [
                7867,
                7977
            ],
            [
                7977,
                8287
            ],
            [
                8287,
                8310
            ],
            [
                8310,
                8696
            ],
            [
                8696,
                8712
            ],
            [
                8712,
                8932
            ],
            [
                8932,
                8951
            ],
            [
                8951,
                9153
            ],
            [
                9153,
                9203
            ],
            [
                9203,
                9681
            ],
            [
                9681,
                9755
            ],
            [
                9755,
                10211
            ],
            [
                10211,
                10503
            ],
            [
                10503,
                10669
            ],
            [
                10669,
                10844
            ],
            [
                10844,
                11082
            ]
        ],
        "segment_chars": [
            [
                0,
                85
            ],
            [
                85,
                185
            ],
            [
                185,
                304
            ],
            [
                304,
                429
            ],
            [
                429,
                544
            ],
            [
                544,
                617
            ],
            [
                617,
                712
            ],
            [
                712,
                748
            ],
            [
                748,
                813
            ],
            [
                813,
                948
            ],
            [
                948,
                1041
            ],
            [
                1041,
                1108
            ],
            [
                1108,
                1144
            ],
            [
                1144,
                1188
            ],
            [
                1188,
                1301
            ],
            [
                1301,
                1415
            ],
            [
                1415,
                1519
            ],
            [
                1519,
                1582
            ],
            [
                1582,
                1645
            ],
            [
                1645,
                1686
            ],
            [
                1686,
                1724
            ],
            [
                1724,
                1787
            ],
            [
                1787,
                1866
            ],
            [
                1866,
                1919
            ],
            [
                1919,
                2029
            ],
            [
                2029,
                2113
            ],
            [
                2113,
                2258
            ],
            [
                2258,
                2336
            ],
            [
                2336,
                2423
            ],
            [
                2423,
                2463
            ],
            [
                2463,
                2521
            ],
            [
                2521,
                2589
            ],
            [
                2589,
                2757
            ],
            [
                2757,
                2932
            ],
            [
                2932,
                3017
            ],
            [
                3017,
                3063
            ],
            [
                3063,
                3091
            ],
            [
                3091,
                3116
            ],
            [
                3116,
                3208
            ],
            [
                3208,
                3241
            ],
            [
                3241,
                3253
            ],
            [
                3253,
                3293
            ],
            [
                3293,
                3380
            ],
            [
                3380,
                3435
            ],
            [
                3435,
                3446
            ],
            [
                3446,
                3461
            ],
            [
                3461,
                3474
            ],
            [
                3474,
                3507
            ],
            [
                3507,
                3541
            ],
            [
                3541,
                3613
            ],
            [
                3613,
                3682
            ],
            [
                3682,
                3708
            ],
            [
                3708,
                3731
            ],
            [
                3731,
                3789
            ],
            [
                3789,
                3818
            ],
            [
                3818,
                3876
            ],
            [
                3876,
                3930
            ],
            [
                3930,
                3985
            ],
            [
                3985,
                4014
            ],
            [
                4014,
                4067
            ],
            [
                4067,
                4087
            ],
            [
                4087,
                4192
            ],
            [
                4192,
                4233
            ],
            [
                4233,
                4279
            ],
            [
                4279,
                4315
            ],
            [
                4315,
                4334
            ],
            [
                4334,
                4388
            ],
            [
                4388,
                4440
            ],
            [
                4440,
                4493
            ],
            [
                4493,
                4559
            ],
            [
                4559,
                4613
            ],
            [
                4613,
                4736
            ],
            [
                4736,
                4822
            ],
            [
                4822,
                4919
            ],
            [
                4919,
                4942
            ],
            [
                4942,
                4957
            ],
            [
                4957,
                4975
            ],
            [
                4975,
                5075
            ],
            [
                5075,
                5136
            ],
            [
                5136,
                5168
            ],
            [
                5168,
                5230
            ],
            [
                5230,
                5246
            ],
            [
                5246,
                5326
            ],
            [
                5326,
                5364
            ],
            [
                5364,
                5424
            ],
            [
                5424,
                5501
            ],
            [
                5501,
                5560
            ],
            [
                5560,
                5653
            ],
            [
                5653,
                5714
            ],
            [
                5714,
                5786
            ],
            [
                5786,
                5808
            ],
            [
                5808,
                5819
            ],
            [
                5819,
                5845
            ],
            [
                5845,
                5959
            ],
            [
                5959,
                5974
            ],
            [
                5974,
                6088
            ],
            [
                6088,
                6129
            ],
            [
                6129,
                6249
            ],
            [
                6249,
                6281
            ],
            [
                6281,
                6302
            ],
            [
                6302,
                6314
            ],
            [
                6314,
                6486
            ],
            [
                6486,
                6594
            ],
            [
                6594,
                6627
            ],
            [
                6627,
                6650
            ],
            [
                6650,
                6664
            ],
            [
                6664,
                6698
            ],
            [
                6698,
                6780
            ],
            [
                6780,
                6790
            ],
            [
                6790,
                6828
            ],
            [
                6828,
                6866
            ],
            [
                6866,
                6882
            ],
            [
                6882,
                6914
            ],
            [
                6914,
                6984
            ],
            [
                6984,
                7037
            ],
            [
                7037,
                7091
            ],
            [
                7091,
                7164
            ],
            [
                7164,
                7199
            ],
            [
                7199,
                7284
            ],
            [
                7284,
                7307
            ],
            [
                7307,
                7353
            ],
            [
                7353,
                7372
            ],
            [
                7372,
                7440
            ],
            [
                7440,
                7528
            ],
            [
                7528,
                7554
            ],
            [
                7554,
                7579
            ],
            [
                7579,
                7607
            ],
            [
                7607,
                7629
            ],
            [
                7629,
                7675
            ],
            [
                7675,
                7740
            ],
            [
                7740,
                7785
            ],
            [
                7785,
                7867
            ],
            [
                7867,
                7912
            ],
            [
                7912,
                7977
            ],
            [
                7977,
                8027
            ],
            [
                8027,
                8075
            ],
            [
                8075,
                8128
            ],
            [
                8128,
                8207
            ],
            [
                8207,
                8250
            ],
            [
                8250,
                8287
            ],
            [
                8287,
                8310
            ],
            [
                8310,
                8334
            ],
            [
                8334,
                8347
            ],
            [
                8347,
                8375
            ],
            [
                8375,
                8438
            ],
            [
                8438,
                8512
            ],
            [
                8512,
                8545
            ],
            [
                8545,
                8590
            ],
            [
                8590,
                8661
            ],
            [
                8661,
                8696
            ],
            [
                8696,
                8712
            ],
            [
                8712,
                8755
            ],
            [
                8755,
                8793
            ],
            [
                8793,
                8830
            ],
            [
                8830,
                8908
            ],
            [
                8908,
                8932
            ],
            [
                8932,
                8951
            ],
            [
                8951,
                8988
            ],
            [
                8988,
                9078
            ],
            [
                9078,
                9153
            ],
            [
                9153,
                9203
            ],
            [
                9203,
                9211
            ],
            [
                9211,
                9258
            ],
            [
                9258,
                9404
            ],
            [
                9404,
                9530
            ],
            [
                9530,
                9586
            ],
            [
                9586,
                9648
            ],
            [
                9648,
                9681
            ],
            [
                9681,
                9755
            ],
            [
                9755,
                9774
            ],
            [
                9774,
                9792
            ],
            [
                9792,
                9855
            ],
            [
                9855,
                10001
            ],
            [
                10001,
                10034
            ],
            [
                10034,
                10148
            ],
            [
                10148,
                10168
            ],
            [
                10168,
                10193
            ],
            [
                10193,
                10211
            ],
            [
                10211,
                10263
            ],
            [
                10263,
                10350
            ],
            [
                10350,
                10380
            ],
            [
                10380,
                10503
            ],
            [
                10503,
                10580
            ],
            [
                10580,
                10669
            ],
            [
                10669,
                10687
            ],
            [
                10687,
                10697
            ],
            [
                10697,
                10844
            ],
            [
                10844,
                11082
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                29,
                64
            ],
            [
                71,
                85
            ],
            [
                85,
                125
            ],
            [
                126,
                185
            ],
            [
                185,
                192
            ],
            [
                193,
                304
            ],
            [
                304,
                429
            ],
            [
                429,
                517
            ],
            [
                531,
                544
            ],
            [
                544,
                545
            ],
            [
                545,
                571
            ],
            [
                587,
                588
            ],
            [
                590,
                617
            ],
            [
                617,
                711
            ],
            [
                712,
                728
            ],
            [
                729,
                737
            ],
            [
                741,
                743
            ],
            [
                746,
                748
            ],
            [
                748,
                813
            ],
            [
                813,
                846
            ],
            [
                847,
                853
            ],
            [
                854,
                948
            ],
            [
                948,
                1024
            ],
            [
                1030,
                1032
            ],
            [
                1036,
                1039
            ],
            [
                1039,
                1041
            ],
            [
                1041,
                1106
            ],
            [
                1106,
                1108
            ],
            [
                1108,
                1142
            ],
            [
                1142,
                1144
            ],
            [
                1144,
                1165
            ],
            [
                1189,
                1255
            ],
            [
                1255,
                1298
            ],
            [
                1298,
                1301
            ],
            [
                1301,
                1415
            ],
            [
                1415,
                1519
            ],
            [
                1519,
                1572
            ],
            [
                1573,
                1582
            ],
            [
                1582,
                1645
            ],
            [
                1645,
                1655
            ],
            [
                1658,
                1686
            ],
            [
                1686,
                1687
            ],
            [
                1701,
                1724
            ],
            [
                1724,
                1785
            ],
            [
                1785,
                1786
            ],
            [
                1787,
                1792
            ],
            [
                1793,
                1809
            ],
            [
                1815,
                1832
            ],
            [
                1833,
                1864
            ],
            [
                1866,
                1898
            ],
            [
                1899,
                1909
            ],
            [
                1910,
                1911
            ],
            [
                1912,
                1919
            ],
            [
                1919,
                1950
            ],
            [
                1951,
                1996
            ],
            [
                2007,
                2029
            ],
            [
                2029,
                2032
            ],
            [
                2033,
                2036
            ],
            [
                2037,
                2038
            ],
            [
                2039,
                2113
            ],
            [
                2113,
                2116
            ],
            [
                2117,
                2148
            ],
            [
                2154,
                2159
            ],
            [
                2169,
                2196
            ],
            [
                2205,
                2258
            ],
            [
                2258,
                2336
            ],
            [
                2336,
                2387
            ],
            [
                2388,
                2423
            ],
            [
                2423,
                2463
            ],
            [
                2463,
                2518
            ],
            [
                2521,
                2589
            ],
            [
                2589,
                2600
            ],
            [
                2601,
                2639
            ],
            [
                2649,
                2736
            ],
            [
                2741,
                2746
            ],
            [
                2755,
                2757
            ],
            [
                2757,
                2806
            ],
            [
                2807,
                2932
            ],
            [
                2932,
                3017
            ],
            [
                3017,
                3063
            ],
            [
                3063,
                3089
            ],
            [
                3091,
                3113
            ],
            [
                3116,
                3129
            ],
            [
                3132,
                3151
            ],
            [
                3158,
                3173
            ],
            [
                3190,
                3208
            ],
            [
                3208,
                3241
            ],
            [
                3241,
                3253
            ],
            [
                3253,
                3292
            ],
            [
                3293,
                3301
            ],
            [
                3302,
                3328
            ],
            [
                3355,
                3360
            ],
            [
                3378,
                3380
            ],
            [
                3380,
                3389
            ],
            [
                3393,
                3398
            ],
            [
                3409,
                3412
            ],
            [
                3426,
                3433
            ],
            [
                3433,
                3435
            ],
            [
                3435,
                3446
            ],
            [
                3446,
                3461
            ],
            [
                3461,
                3474
            ],
            [
                3474,
                3507
            ],
            [
                3507,
                3541
            ],
            [
                3541,
                3613
            ],
            [
                3613,
                3626
            ],
            [
                3628,
                3682
            ],
            [
                3682,
                3705
            ],
            [
                3708,
                3713
            ],
            [
                3714,
                3721
            ],
            [
                3725,
                3729
            ],
            [
                3729,
                3731
            ],
            [
                3731,
                3742
            ],
            [
                3747,
                3789
            ],
            [
                3789,
                3818
            ],
            [
                3822,
                3836
            ],
            [
                3837,
                3839
            ],
            [
                3851,
                3873
            ],
            [
                3876,
                3930
            ],
            [
                3930,
                3944
            ],
            [
                3949,
                3955
            ],
            [
                3955,
                3960
            ],
            [
                3961,
                3985
            ],
            [
                3985,
                3989
            ],
            [
                3990,
                4014
            ],
            [
                4014,
                4067
            ],
            [
                4067,
                4085
            ],
            [
                4085,
                4087
            ],
            [
                4087,
                4192
            ],
            [
                4192,
                4231
            ],
            [
                4231,
                4233
            ],
            [
                4234,
                4279
            ],
            [
                4279,
                4315
            ],
            [
                4315,
                4316
            ],
            [
                4316,
                4334
            ],
            [
                4334,
                4388
            ],
            [
                4388,
                4440
            ],
            [
                4440,
                4493
            ],
            [
                4493,
                4550
            ],
            [
                4551,
                4557
            ],
            [
                4557,
                4559
            ],
            [
                4559,
                4573
            ],
            [
                4574,
                4591
            ],
            [
                4592,
                4613
            ],
            [
                4613,
                4622
            ],
            [
                4623,
                4735
            ],
            [
                4736,
                4822
            ],
            [
                4822,
                4902
            ],
            [
                4903,
                4918
            ],
            [
                4919,
                4942
            ],
            [
                4942,
                4957
            ],
            [
                4957,
                4975
            ],
            [
                4975,
                5075
            ],
            [
                5075,
                5136
            ],
            [
                5136,
                5165
            ],
            [
                5168,
                5169
            ],
            [
                5172,
                5176
            ],
            [
                5177,
                5230
            ],
            [
                5230,
                5246
            ],
            [
                5246,
                5326
            ],
            [
                5326,
                5364
            ],
            [
                5364,
                5365
            ],
            [
                5365,
                5424
            ],
            [
                5424,
                5501
            ],
            [
                5501,
                5560
            ],
            [
                5560,
                5621
            ],
            [
                5622,
                5653
            ],
            [
                5653,
                5714
            ],
            [
                5714,
                5786
            ],
            [
                5786,
                5805
            ],
            [
                5805,
                5808
            ],
            [
                5808,
                5809
            ],
            [
                5809,
                5819
            ],
            [
                5819,
                5845
            ],
            [
                5845,
                5874
            ],
            [
                5876,
                5959
            ],
            [
                5959,
                5971
            ],
            [
                5971,
                5973
            ],
            [
                5974,
                5985
            ],
            [
                5986,
                6063
            ],
            [
                6070,
                6088
            ],
            [
                6088,
                6127
            ],
            [
                6129,
                6156
            ],
            [
                6162,
                6200
            ],
            [
                6203,
                6249
            ],
            [
                6249,
                6281
            ],
            [
                6281,
                6285
            ],
            [
                6285,
                6302
            ],
            [
                6302,
                6314
            ],
            [
                6314,
                6373
            ],
            [
                6374,
                6385
            ],
            [
                6386,
                6396
            ],
            [
                6396,
                6486
            ],
            [
                6486,
                6535
            ],
            [
                6542,
                6545
            ],
            [
                6546,
                6548
            ],
            [
                6555,
                6582
            ],
            [
                6583,
                6594
            ],
            [
                6594,
                6627
            ],
            [
                6627,
                6650
            ],
            [
                6650,
                6654
            ],
            [
                6655,
                6658
            ],
            [
                6659,
                6664
            ],
            [
                6664,
                6698
            ],
            [
                6698,
                6738
            ],
            [
                6743,
                6780
            ],
            [
                6780,
                6790
            ],
            [
                6790,
                6828
            ],
            [
                6828,
                6842
            ],
            [
                6843,
                6866
            ],
            [
                6866,
                6882
            ],
            [
                6882,
                6914
            ],
            [
                6914,
                6984
            ],
            [
                6984,
                7037
            ],
            [
                7037,
                7089
            ],
            [
                7089,
                7091
            ],
            [
                7091,
                7120
            ],
            [
                7124,
                7161
            ],
            [
                7164,
                7199
            ],
            [
                7199,
                7284
            ],
            [
                7284,
                7307
            ],
            [
                7307,
                7353
            ],
            [
                7353,
                7372
            ],
            [
                7372,
                7440
            ],
            [
                7440,
                7500
            ],
            [
                7502,
                7509
            ],
            [
                7512,
                7528
            ],
            [
                7528,
                7554
            ],
            [
                7554,
                7579
            ],
            [
                7579,
                7607
            ],
            [
                7607,
                7629
            ],
            [
                7629,
                7675
            ],
            [
                7675,
                7734
            ],
            [
                7738,
                7740
            ],
            [
                7740,
                7743
            ],
            [
                7744,
                7749
            ],
            [
                7750,
                7756
            ],
            [
                7757,
                7785
            ],
            [
                7785,
                7867
            ],
            [
                7867,
                7910
            ],
            [
                7910,
                7912
            ],
            [
                7912,
                7977
            ],
            [
                7977,
                8027
            ],
            [
                8027,
                8052
            ],
            [
                8053,
                8075
            ],
            [
                8075,
                8128
            ],
            [
                8128,
                8143
            ],
            [
                8144,
                8146
            ],
            [
                8147,
                8207
            ],
            [
                8207,
                8250
            ],
            [
                8250,
                8279
            ],
            [
                8280,
                8284
            ],
            [
                8284,
                8287
            ],
            [
                8287,
                8310
            ],
            [
                8310,
                8334
            ],
            [
                8334,
                8345
            ],
            [
                8345,
                8347
            ],
            [
                8353,
                8375
            ],
            [
                8375,
                8438
            ],
            [
                8438,
                8465
            ],
            [
                8466,
                8478
            ],
            [
                8479,
                8512
            ],
            [
                8512,
                8545
            ],
            [
                8545,
                8566
            ],
            [
                8567,
                8577
            ],
            [
                8578,
                8580
            ],
            [
                8586,
                8588
            ],
            [
                8588,
                8590
            ],
            [
                8590,
                8661
            ],
            [
                8661,
                8693
            ],
            [
                8696,
                8712
            ],
            [
                8712,
                8713
            ],
            [
                8713,
                8731
            ],
            [
                8740,
                8755
            ],
            [
                8755,
                8758
            ],
            [
                8759,
                8791
            ],
            [
                8791,
                8793
            ],
            [
                8793,
                8796
            ],
            [
                8797,
                8828
            ],
            [
                8842,
                8908
            ],
            [
                8908,
                8932
            ],
            [
                8932,
                8948
            ],
            [
                8951,
                8971
            ],
            [
                8971,
                8976
            ],
            [
                8977,
                8988
            ],
            [
                8988,
                9038
            ],
            [
                9039,
                9078
            ],
            [
                9078,
                9150
            ],
            [
                9150,
                9153
            ],
            [
                9153,
                9203
            ],
            [
                9203,
                9211
            ],
            [
                9211,
                9221
            ],
            [
                9225,
                9258
            ],
            [
                9258,
                9277
            ],
            [
                9280,
                9345
            ],
            [
                9348,
                9404
            ],
            [
                9404,
                9492
            ],
            [
                9500,
                9530
            ],
            [
                9530,
                9579
            ],
            [
                9584,
                9586
            ],
            [
                9586,
                9602
            ],
            [
                9603,
                9646
            ],
            [
                9646,
                9648
            ],
            [
                9648,
                9681
            ],
            [
                9681,
                9755
            ],
            [
                9755,
                9774
            ],
            [
                9774,
                9790
            ],
            [
                9790,
                9792
            ],
            [
                9792,
                9855
            ],
            [
                9855,
                9867
            ],
            [
                9868,
                9873
            ],
            [
                9874,
                9879
            ],
            [
                9880,
                9908
            ],
            [
                9911,
                9944
            ],
            [
                9947,
                10001
            ],
            [
                10001,
                10032
            ],
            [
                10032,
                10034
            ],
            [
                10034,
                10148
            ],
            [
                10148,
                10165
            ],
            [
                10166,
                10168
            ],
            [
                10168,
                10193
            ],
            [
                10193,
                10211
            ],
            [
                10211,
                10263
            ],
            [
                10263,
                10350
            ],
            [
                10350,
                10374
            ],
            [
                10375,
                10378
            ],
            [
                10378,
                10380
            ],
            [
                10380,
                10383
            ],
            [
                10394,
                10482
            ],
            [
                10483,
                10502
            ],
            [
                10503,
                10506
            ],
            [
                10512,
                10580
            ],
            [
                10580,
                10668
            ],
            [
                10669,
                10687
            ],
            [
                10687,
                10697
            ],
            [
                10697,
                10844
            ],
            [
                10844,
                10880
            ],
            [
                10881,
                10892
            ],
            [
                10892,
                10945
            ],
            [
                10946,
                10993
            ],
            [
                10994,
                11050
            ],
            [
                11059,
                11082
            ]
        ],
        "row_chars": [
            [
                0,
                85
            ],
            [
                85,
                185
            ],
            [
                185,
                304
            ],
            [
                304,
                304
            ],
            [
                304,
                429
            ],
            [
                429,
                544
            ],
            [
                544,
                544
            ],
            [
                544,
                544
            ],
            [
                544,
                544
            ],
            [
                544,
                617
            ],
            [
                617,
                712
            ],
            [
                712,
                748
            ],
            [
                748,
                813
            ],
            [
                813,
                948
            ],
            [
                948,
                1041
            ],
            [
                1041,
                1108
            ],
            [
                1108,
                1144
            ],
            [
                1144,
                1301
            ],
            [
                1301,
                1415
            ],
            [
                1415,
                1519
            ],
            [
                1519,
                1582
            ],
            [
                1582,
                1645
            ],
            [
                1645,
                1686
            ],
            [
                1686,
                1724
            ],
            [
                1724,
                1919
            ],
            [
                1919,
                2029
            ],
            [
                2029,
                2113
            ],
            [
                2113,
                2258
            ],
            [
                2258,
                2336
            ],
            [
                2336,
                2423
            ],
            [
                2423,
                2463
            ],
            [
                2463,
                2521
            ],
            [
                2521,
                2589
            ],
            [
                2589,
                2589
            ],
            [
                2589,
                2757
            ],
            [
                2757,
                2932
            ],
            [
                2932,
                3017
            ],
            [
                3017,
                3063
            ],
            [
                3063,
                3116
            ],
            [
                3116,
                3208
            ],
            [
                3208,
                3241
            ],
            [
                3241,
                3253
            ],
            [
                3253,
                3293
            ],
            [
                3293,
                3380
            ],
            [
                3380,
                3380
            ],
            [
                3380,
                3380
            ],
            [
                3380,
                3435
            ],
            [
                3435,
                3446
            ],
            [
                3446,
                3461
            ],
            [
                3461,
                3474
            ],
            [
                3474,
                3507
            ],
            [
                3507,
                3541
            ],
            [
                3541,
                3613
            ],
            [
                3613,
                3682
            ],
            [
                3682,
                3708
            ],
            [
                3708,
                3731
            ],
            [
                3731,
                3789
            ],
            [
                3789,
                3818
            ],
            [
                3818,
                3876
            ],
            [
                3876,
                3876
            ],
            [
                3876,
                3930
            ],
            [
                3930,
                3985
            ],
            [
                3985,
                4014
            ],
            [
                4014,
                4014
            ],
            [
                4014,
                4067
            ],
            [
                4067,
                4087
            ],
            [
                4087,
                4192
            ],
            [
                4192,
                4233
            ],
            [
                4233,
                4233
            ],
            [
                4233,
                4279
            ],
            [
                4279,
                4315
            ],
            [
                4315,
                4334
            ],
            [
                4334,
                4388
            ],
            [
                4388,
                4440
            ],
            [
                4440,
                4493
            ],
            [
                4493,
                4559
            ],
            [
                4559,
                4613
            ],
            [
                4613,
                4736
            ],
            [
                4736,
                4822
            ],
            [
                4822,
                4919
            ],
            [
                4919,
                4919
            ],
            [
                4919,
                4919
            ],
            [
                4919,
                4919
            ],
            [
                4919,
                4919
            ],
            [
                4919,
                4942
            ],
            [
                4942,
                4957
            ],
            [
                4957,
                4975
            ],
            [
                4975,
                5075
            ],
            [
                5075,
                5136
            ],
            [
                5136,
                5168
            ],
            [
                5168,
                5230
            ],
            [
                5230,
                5246
            ],
            [
                5246,
                5246
            ],
            [
                5246,
                5326
            ],
            [
                5326,
                5364
            ],
            [
                5364,
                5424
            ],
            [
                5424,
                5501
            ],
            [
                5501,
                5560
            ],
            [
                5560,
                5653
            ],
            [
                5653,
                5714
            ],
            [
                5714,
                5786
            ],
            [
                5786,
                5808
            ],
            [
                5808,
                5819
            ],
            [
                5819,
                5845
            ],
            [
                5845,
                5959
            ],
            [
                5959,
                5974
            ],
            [
                5974,
                6088
            ],
            [
                6088,
                6129
            ],
            [
                6129,
                6129
            ],
            [
                6129,
                6129
            ],
            [
                6129,
                6249
            ],
            [
                6249,
                6249
            ],
            [
                6249,
                6249
            ],
            [
                6249,
                6281
            ],
            [
                6281,
                6302
            ],
            [
                6302,
                6314
            ],
            [
                6314,
                6486
            ],
            [
                6486,
                6594
            ],
            [
                6594,
                6627
            ],
            [
                6627,
                6650
            ],
            [
                6650,
                6664
            ],
            [
                6664,
                6698
            ],
            [
                6698,
                6780
            ],
            [
                6780,
                6790
            ],
            [
                6790,
                6828
            ],
            [
                6828,
                6866
            ],
            [
                6866,
                6882
            ],
            [
                6882,
                6914
            ],
            [
                6914,
                6914
            ],
            [
                6914,
                6914
            ],
            [
                6914,
                6984
            ],
            [
                6984,
                6984
            ],
            [
                6984,
                7037
            ],
            [
                7037,
                7091
            ],
            [
                7091,
                7164
            ],
            [
                7164,
                7164
            ],
            [
                7164,
                7199
            ],
            [
                7199,
                7284
            ],
            [
                7284,
                7307
            ],
            [
                7307,
                7353
            ],
            [
                7353,
                7372
            ],
            [
                7372,
                7440
            ],
            [
                7440,
                7528
            ],
            [
                7528,
                7554
            ],
            [
                7554,
                7579
            ],
            [
                7579,
                7607
            ],
            [
                7607,
                7629
            ],
            [
                7629,
                7675
            ],
            [
                7675,
                7675
            ],
            [
                7675,
                7675
            ],
            [
                7675,
                7740
            ],
            [
                7740,
                7785
            ],
            [
                7785,
                7867
            ],
            [
                7867,
                7912
            ],
            [
                7912,
                7977
            ],
            [
                7977,
                8027
            ],
            [
                8027,
                8075
            ],
            [
                8075,
                8075
            ],
            [
                8075,
                8075
            ],
            [
                8075,
                8128
            ],
            [
                8128,
                8207
            ],
            [
                8207,
                8250
            ],
            [
                8250,
                8287
            ],
            [
                8287,
                8310
            ],
            [
                8310,
                8334
            ],
            [
                8334,
                8347
            ],
            [
                8347,
                8375
            ],
            [
                8375,
                8438
            ],
            [
                8438,
                8512
            ],
            [
                8512,
                8545
            ],
            [
                8545,
                8590
            ],
            [
                8590,
                8661
            ],
            [
                8661,
                8696
            ],
            [
                8696,
                8712
            ],
            [
                8712,
                8755
            ],
            [
                8755,
                8793
            ],
            [
                8793,
                8908
            ],
            [
                8908,
                8932
            ],
            [
                8932,
                8951
            ],
            [
                8951,
                8951
            ],
            [
                8951,
                8988
            ],
            [
                8988,
                9078
            ],
            [
                9078,
                9153
            ],
            [
                9153,
                9203
            ],
            [
                9203,
                9211
            ],
            [
                9211,
                9258
            ],
            [
                9258,
                9404
            ],
            [
                9404,
                9530
            ],
            [
                9530,
                9586
            ],
            [
                9586,
                9648
            ],
            [
                9648,
                9648
            ],
            [
                9648,
                9681
            ],
            [
                9681,
                9755
            ],
            [
                9755,
                9774
            ],
            [
                9774,
                9792
            ],
            [
                9792,
                9855
            ],
            [
                9855,
                10001
            ],
            [
                10001,
                10034
            ],
            [
                10034,
                10148
            ],
            [
                10148,
                10168
            ],
            [
                10168,
                10193
            ],
            [
                10193,
                10211
            ],
            [
                10211,
                10263
            ],
            [
                10263,
                10350
            ],
            [
                10350,
                10380
            ],
            [
                10380,
                10503
            ],
            [
                10503,
                10580
            ],
            [
                10580,
                10669
            ],
            [
                10669,
                10687
            ],
            [
                10687,
                10697
            ],
            [
                10697,
                10697
            ],
            [
                10697,
                10697
            ],
            [
                10697,
                10697
            ],
            [
                10697,
                10697
            ],
            [
                10697,
                10697
            ],
            [
                10697,
                10844
            ],
            [
                10844,
                10844
            ],
            [
                10844,
                10844
            ],
            [
                10844,
                11082
            ]
        ]
    }
}