{
    "original": {
        "text": "On the night before Christmas Eve two men were sitting together in George Vavasor's rooms in Cecil Street. It was past twelve o'clock, and they were both smoking; there were square bottles on the table containing spirits, with hot water and cold water in jugs, and one of the two men was using, and had been using, these materials for enjoyment. Vavasor had not been drinking, nor did it appear as though he intended to begin. There was a little weak brandy and water in a glass by his side, but there it had remained untouched for the last twenty minutes. His companion, however, had twice in that time replenished his beaker, and was now puffing out the smoke of his pipe with the fury of a steamer's funnel when she has not yet burned the black off her last instalment of fresh coals. This man was Burgo Fitzgerald. He was as handsome as ever;--a man whom neither man nor woman could help regarding as a thing beautiful to behold;--but not the less was there in his eyes and cheeks a look of haggard dissipation,--of riotous living, which had become wearisome, by its continuance, even to himself,--that told to all who saw him much of the history of his life. Most men who drink at nights, and are out till cockcrow doing deeds of darkness, become red in their faces, have pimpled cheeks and watery eyes, and are bloated and not comfortable to be seen. It is a kind dispensation of Providence who thus affords to such sinners a visible sign, to be seen day by day, of the injury which is being done. The first approach of a carbuncle on the nose, about the age of thirty, has stopped many a man from drinking. No one likes to have carbuncles on his nose, or to appear before his female friends with eyes which look as though they were swimming in grog. But to Burgo Fitzgerald Providence in her anger had not afforded this protection. He became at times pale, sallow, worn, and haggard. He grew thin, and still thinner. At times he had been ill to death's door. Among his intimate friends there were those who heard him declare frequently that his liver had become useless to him; and that, as for gastric juices, he had none left to him. But still his beauty remained. The perfect form of his almost god-like face was the same as ever, and the brightness of his bright blue eye was never quenched.\nOn the present occasion he had come to Vavasor's room with the object of asking from him certain assistance, and perhaps also some amount of advice. But as regarded the latter article he was, I think, in the state of most men when they seek for counsellors who shall counsel them to do evil. Advice administered in accordance with his own views would give him comfortable encouragement, but advice on the other side he was prepared to disregard altogether. These two men had known each other long, and a close intimacy had existed between them in the days past, previous to Lady Glencora's engagement with Mr. Palliser. When Lady Glencora endeavoured, vainly as we know, to obtain aid from Alice Vavasor, Burgo had been instigated to believe that Alice's cousin might assist him. Any such assistance George Vavasor would have been quite ready to give. Some pecuniary assistance he had given, he at that time having been in good funds. Perhaps he had for a moment induced Burgo to think that he could obtain for the pair the use of the house in Queen Anne Street as a point at which they might meet, and from whence they might start on their journey of love. All that was over. Those hopes had been frustrated, and Lady Glencora M'Cluskie had become Lady Glencora Palliser and not Lady Glencora Fitzgerald. But now other hopes had sprung up, and Burgo was again looking to his friend for assistance.\n\"I believe she would,\" Burgo said, as he lifted the glass to his mouth. \"It's a thing of that sort that a man can only believe,--perhaps only hope,--till he has tried. I know that she is not happy with him, and I have made up my mind that I will at least ask her.\"\n\"But he would have her fortune all the same?\"\n\"I don't know how that would be. I haven't inquired, and I don't mean to inquire. Of course I don't expect you or any one else to believe me, but her money has no bearing on the question now. Heaven knows I want money bad enough, but I wouldn't take away another man's wife for money.\"\n\"You don't mean to say you think it would be wicked. I supposed you to be above those prejudices.\"\n\"It's all very well for you to chaff.\"\n\"It's no chaff at all. I tell you fairly I wouldn't run away with any man's wife. I have an old-fashioned idea that when a man has got a wife he ought to be allowed to keep her. Public opinion, I know, is against me.\"\n\"I think he ran away with my wife,\" said Burgo, with emphasis; \"that's the way I look at it. She was engaged to me first; and she really loved me, while she never cared for him.\"\n\"Nevertheless, marriage is marriage, and the law is against you. But if I did go in for such a troublesome job at all, I certainly should keep an eye upon the money.\"\n\"It can make no difference.\"\n\"It did make a difference, I suppose, when you first thought of marrying her?\"\n\"Of course it did. My people brought us together because she had a large fortune and I had none. There's no doubt in the world about that. And I'll tell you what; I believe that old harridan of an aunt of mine is willing to do the same thing now again. Of course she doesn't say as much. She wouldn't dare do that, but I do believe she means it. I wonder where she expects to go to!\"\n\"That's grateful on your part.\"\n\"Upon my soul I hate her. I do indeed. It isn't love for me now so much as downright malice against Palliser, because he baulked her project before. She is a wicked old woman. Some of us fellows are wicked enough--you and I for instance--\"\n\"Thank you. I don't know, however, that I am qualified to run in a curricle with you.\"\n\"But we are angels to such an old she-devil as that. You may believe me or not, as you like.--I dare say you won't believe me.\"\n\"I'll say I do, at any rate.\"\n\"The truth is, I want to get her, partly because I love her; but chiefly because I do believe in my heart that she loves me.\"\n\"It's for her sake then! You are ready to sacrifice yourself to do her a good turn.\"\n\"As for sacrificing myself, that's done. I'm a man utterly ruined and would cut my throat to-morrow for the sake of my relations, if I cared enough about them. I know my own condition pretty well. I have made a shipwreck of everything, and have now only got to go down among the breakers.\"\n\"Only you would like to take Lady Glencora with you.\"\n\"No, by heavens! But sometimes, when I do think about it at all,--which I do as seldom as I can,--it seems to me that I might still become a different fellow if it were possible for me to marry her.\"\n\"Had you married her when she was free to marry any one and when her money was her own, it might have been so.\"\n\"I think it would be quite as much so now. I do, indeed. If I could get her once, say to Italy, or perhaps to Greece, I think I could treat her well, and live with her quietly. I know that I would try.\"\n\"Without the assistance of brandy and cigars.\"\n\"Yes.\"\n\"And without any money.\"\n\"With only a little. I know you'll laugh at me; but I make pictures to myself of a sort of life which I think would suit us, and be very different from this hideous way of living, with which I have become so sick that I loathe it.\"\n\"Something like Juan and Haide, with Planty Pall coming after you, like old Lambro.\" By the nickname of Planty Pall George Vavasor intended to designate Lady Glencora's present husband.\n\"He'd get a divorce, of course, and then we should be married. I really don't think he'd dislike it, when it was all done. They tell me he doesn't care for her.\"\n\"You have seen her since her marriage?\"\n\"Yes; twice.\"\n\"And have spoken to her?\"\n\"Once only,--so as to be able to do more than ask her if she were well. Once, for about two minutes, I did speak to her.\"\n\"And what did she say?\"\n\"She said it would be better that we should not meet. When she said that, I knew that she was still fond of me. I could have fallen at her feet that moment, only the room was full of people. I do think that she is fond of me.\"\nVavasor paused a few minutes. \"I dare say she is fond of you,\" he then said; \"but whether she has pluck for such a thing as this, is more than I can say. Probably she has not. And if she has, probably you would fail in carrying out your plan.\"\n\"I must get a little money first,\" said Burgo.\n\"And that's an operation which no doubt you find more difficult every day, as you grow older.\"\n\"It seems to be much the same sort of thing. I went to Magruin this morning.\"\n\"He's the fellow that lives out near Gray's Inn Lane?\"\n\"Just beyond the Foundling Hospital. I went to him, and he was quite civil about it. He says I owe him over three thousand pounds, but that doesn't seem to make any difference.\"\n\"How much did you ever have from him?\"\n\"I don't recollect that I ever absolutely had any money. He got a bill of mine from a tailor who went to smash, and he kept on renewing that till it grew to be ever so many bills. I think he did once let me have twenty-four pounds,--but certainly never more than that.\"\n\"And he says he'll give you money now? I suppose you told him why you wanted it.\"\n\"I didn't name her,--but I told him what would make him understand that I hoped to get off with a lady who had a lot of tin. I asked him for two hundred and fifty. He says he'll let me have one hundred and fifty on a bill at two months for five hundred,--with your name to it.\"\n\"With my name to it! That's kind on his part,--and on yours too.\"\n\"Of course I can't take it up at the end of two months.\"\n\"I dare say not,\" said Vavasor.\n\"But he won't come upon you then,--nor for a year or more afterwards. I did pay you what you lent me before.\"\n\"Yes, you did. I always thought that to be a special compliment on your part.\"\n\"And you'll find I'll pull you through now in some way. If I don't succeed in this I shall go off the hooks altogether soon; and if I were dead my people would pay my debts then.\"\nBefore the evening was over Vavasor promised the assistance asked of him. He knew that he was lending his name to a man who was utterly ruined, and putting it into the hands of another man who was absolutely without conscience in the use he would make of it. He knew that he was creating for himself trouble, and in all probability loss, which he was ill able to bear. But the thing was one which came within the pale of his laws. Such assistance as that he might ask of others, and had asked and received before now. It was a reckless deed on his part, but then all his doings were reckless. It was consonant with his mode of life.\n\"I thought you would, old fellow,\" said Burgo, as he got up to go away. \"Perhaps, you know, I shall pull through in this; and perhaps, after all, some part of her fortune will come with her. If so you'll be all right.\"\n\"Perhaps I may. But look here, Burgo,--don't you give that fellow up the bill till you've got the money into your fist.\"\n\"You may be quite easy about that. I know their tricks. He and I will go to the bank together, and we shall squabble there at the door about four or five odd sovereigns,--and at last I shall have to give him up two or three. Beastly old robber! I declare I think he's worse than I am myself.\" Then Burgo Fitzgerald took a little more brandy and water and went away.\nHe was living at this time in the house of one of his relatives in Cavendish Square, north of Oxford Street. His uncles and his aunts, and all those who were his natural friends, had clung to him with a tenacity that was surprising; for he had never been true to any of them, and did not even pretend to like them. His father, with whom for many years he had not been on speaking terms, was now dead; but he had sisters whose husbands would still open their houses to him, either in London or in the country;--would open their houses to him, and lend him their horses, and provide him with every luxury which the rich enjoy,--except ready money. When the uttermost stress of pecuniary embarrassment would come upon him, they would pay something to stave off the immediate evil. And so Burgo went on. Nobody now thought of saying much to reproach him. It was known to be waste of words, and trouble in vain. They were still fond of him because he was beautiful and never vain of his beauty;--because in the midst of his recklessness there was always about him a certain kindliness which made him pleasant to those around him. He was soft and gracious with children, and would be very courteous to his lady cousins. They knew that as a man he was worthless, but nevertheless they loved him. I think the secret of it was chiefly in this,--that he seemed to think so little of himself.\nBut now as he walked home in the middle of the night from Cecil Street to Cavendish Square he did think much of himself. Indeed such self-thoughts come naturally to all men, be their outward conduct ever so reckless. Every man to himself is the centre of the whole world;--the axle on which it all turns. All knowledge is but his own perception of the things around him. All love, and care for others, and solicitude for the world's welfare, are but his own feelings as to the world's wants and the world's merits.\nHe had played his part as a centre of all things very badly. Of that he was very well aware. He had sense enough to know that it should be a man's lot to earn his bread after some fashion, and he often told himself that never as yet had he earned so much as a penny roll. He had learned to comprehend that the world's progress depends on the way in which men do their duty by each other,--that the progress of one generation depends on the discharge of such duties by that which preceded it;--and he knew that he, in his generation, had done nothing to promote such progress. He thoroughly despised himself,--if there might be any good in that! But on such occasions as these, when the wine he had drunk was sufficient only to drive away from him the numbness of despair, when he was all alone with the cold night air upon his face, when the stars were bright above him and the world around him was almost quiet, he would still ask himself whether there might not yet be, even for him, some hope of a redemption, --some chance of a better life in store for him. He was still young,--wanting some years of thirty. Could there be, even for him, some mode of extrication from his misery?\nWe know what was the mode which now, at this moment, was suggesting itself to him. He was proposing to himself, as the best thing that he could do, to take away another man's wife and make himself happy with her! What he had said to Vavasor as to disregarding Lady Glencora's money had been perfectly true. That in the event of her going off with him, some portion of her enormous wealth would still cling to her, he did believe. Seeing that she had no children he could not understand where else it should all go. But he thought of this as it regarded her, not as it regarded him. When he had before made his suit to her,--a suit which was then honourable, however disadvantageous it might have seemed to be to her--he had made in his mind certain calculations as to the good things which would result to him if he were successful He would keep hounds, and have three or four horses every day for his own riding, and he would have no more interviews with Magruin, waiting in that rogue's dingy back parlour for many a weary wretched half-hour, till the rogue should be pleased to show himself. So far he had been mercenary; but he had learned to love the girl, and to care more for her than for her money, and when the day of disappointment came upon him,--the day on which she had told him that all between them was to be over for ever,--he had, for a few hours, felt the loss of his love more than the loss of his money.\nThen he had had no further hope. No such idea as that which now filled his mind had then come upon him. The girl had gone from him and married another man, and there was an end of it. But by degrees tidings had reached him that she was not happy,--reaching him through the mouths of people who were glad to exaggerate all that they had heard. A whole tribe of his female relatives had been anxious to promote his marriage with Lady Glencora M'Cluskie, declaring that, after all that was come and gone, Burgo would come forth from his troubles as a man of great wealth. So great was the wealth of the heiress that it might withstand even his propensities for spending. That whole tribe had been bitterly disappointed; and when they heard that Mr. Palliser's marriage had given him no child, and that Lady Glencora was unhappy,--they made their remarks in triumph rather than in sorrow. I will not say that they looked forward approvingly to such a step as that which Burgo now wished to take,--though as regarded his aunt, Lady Monk, he himself had accused her; but they whispered that such things had been done and must be expected, when marriages were made up as had been that marriage between Mr. Palliser and his bride.\nAs he walked on, thinking of his project, he strove hard to cheat himself into a belief that he would do a good thing in carrying Lady Glencora away from her husband. Bad as had been his life he had never before done aught so bad as that. The more fixed his intention became, the more thoroughly he came to perceive how great and grievous was the crime which he contemplated. To elope with another man's wife no longer appeared to him to be a joke at which such men as he might smile. But he tried to think that in this case there would be special circumstances which would almost justify him, and also her. They had loved each other and had sworn to love each other with constancy. There had been no change in the feelings or even in the wishes of either of them. But cold people had come between them with cold calculations, and had separated them. She had been, he told himself, made to marry a man she did not love. If they two loved each other truly, would it not still be better that they should come together? Would not the sin be forgiven on account of the injustice which had been done to them? Had Mr. Palliser a right to expect more from a wife who had been made to marry him without loving him? Then he reverted to those dreams of a life of love, in some sunny country, of which he had spoken to Vavasor, and he strove to nourish them. Vavasor had laughed at him, talking of Juan and Haide. But Vavasor, he said to himself, was a hard cold man, who had no touch of romance in his character. He would not be laughed out of his plan by such as he,--nor would he be frightened by the threat of any Lambro who might come after him, whether he might come in the guise of indignant uncle or injured husband.\nHe had crossed from Regent Street through Hanover Square, and as he came out by the iron gates into Oxford Street, a poor wretched girl, lightly clad in thin raiment, into whose bones the sharp freezing air was penetrating, asked him for money. Would he give her something to get drink, so that for a moment she might feel the warmth of her life renewed? Such midnight petitions were common enough in his ears, and he was passing on without thinking of her. But she was urgent, and took hold of him. \"For love of God,\" she said, \"if it's only a penny to get a glass of gin! Feel my hand,--how cold it is.\" And she strove to put it up against his face.\nHe looked round at her and saw that she was very young,--sixteen, perhaps, at the most, and that she had once,--nay very lately,--been exquisitely pretty. There still lingered about her eyes some remains of that look of perfect innocency and pure faith which had been hers not more than twelve months since. And now, at midnight, in the middle of the streets, she was praying for a pennyworth of gin, as the only comfort she knew, or could expect!\n\"You are cold!\" said he, trying to speak to her cheerily.\n\"Cold!\" said she, repeating the word, and striving to wrap herself closer in her rags, as she shivered--\"Oh God! if you knew what it was to be as cold as I am! I have nothing in the world,--not one penny,--not a hole to lie in!\"\n\"We are alike then,\" said Burgo, with a slight low laugh. \"I also have nothing. You cannot be poorer than I am.\"\n\"You poor!\" she said. And then she looked up into his face. \"Gracious; how beautiful you are! Such as you are never poor.\"\nHe laughed again,--in a different tone. He always laughed when any one told him of his beauty. \"I am a deal poorer than you, my girl,\" he said. \"You have nothing. I have thirty thousand pounds worse than nothing. But come along, and I will get you something to eat.\"\n\"Will you?\" said she, eagerly. Then looking up at him again, she exclaimed--\"Oh, you are so handsome!\"\nHe took her to a public-house and gave her bread and meat and beer, and stood by her while she ate it. She was shy with him then, and would fain have taken it to a corner by herself, had he allowed her. He perceived this, and turned his back to her, but still spoke to her a word or two as she ate. The woman at the bar who served him looked at him wonderingly, staring into his face; and the pot-boy woke himself thoroughly that he might look at Burgo; and the waterman from the cab-stand stared at him; and women who came in for gin looked almost lovingly up into his eyes. He regarded them all not at all, showing no feeling of disgrace at his position, and no desire to carry himself as a ruffler. He quietly paid what was due when the girl had finished her meal, and then walked with her out of the shop. \"And now,\" said he, \"what must I do with you? If I give you a shilling can you get a bed?\" She told him that she could get a bed for sixpence. \"Then keep the other sixpence for your breakfast,\" said he. \"But you must promise me that you will buy no gin to-night.\" She promised him, and then he gave her his hand as he wished her good night;--his hand, which it had been the dearest wish of Lady Glencora to call her own. She took it and pressed it to her lips. \"I wish I might once see you again,\" she said, \"because you are so good and so beautiful.\" He laughed again cheerily, and walked on, crossing the street towards Cavendish Square. She stood looking at him till he was out of sight, and then as she moved away,--let us hope to the bed which his bounty had provided, and not to a gin-shop,--she exclaimed to herself again and again--\"Gracious, how beautiful he was!\" \"He's a good un,\" the woman at the public-house had said as soon as he left it; \"but, my! did you ever see a man's face handsome as that fellow's?\"\n[Illustration: Burgo Fitzgerald.]\nPoor Burgo! All who had seen him since life had begun with him had loved him and striven to cherish him. And with it all, to what a state had he come! Poor Burgo! had his eyes been less brightly blue, and his face less godlike in form, it may be that things would have gone better with him. A sweeter-tempered man than he never lived,--nor one who was of a kinder nature. At this moment he had barely money about him to take him down to his aunt's house at Monkshade, and as he had promised to be there before Christmas Day, he was bound to start on the next morning, before help from Mr. Magruin was possible. Nevertheless, out of his very narrow funds he had given half a crown to comfort the poor creature who had spoken to him in the street.",
        "paragraph_chars": [
            [
                0,
                2303
            ],
            [
                2303,
                3702
            ],
            [
                3702,
                3967
            ],
            [
                3967,
                4013
            ],
            [
                4013,
                4299
            ],
            [
                4299,
                4398
            ],
            [
                4398,
                4437
            ],
            [
                4437,
                4655
            ],
            [
                4655,
                4834
            ],
            [
                4834,
                5001
            ],
            [
                5001,
                5030
            ],
            [
                5030,
                5109
            ],
            [
                5109,
                5493
            ],
            [
                5493,
                5525
            ],
            [
                5525,
                5765
            ],
            [
                5765,
                5852
            ],
            [
                5852,
                5980
            ],
            [
                5980,
                6010
            ],
            [
                6010,
                6136
            ],
            [
                6136,
                6221
            ],
            [
                6221,
                6511
            ],
            [
                6511,
                6565
            ],
            [
                6565,
                6765
            ],
            [
                6765,
                6877
            ],
            [
                6877,
                7080
            ],
            [
                7080,
                7127
            ],
            [
                7127,
                7134
            ],
            [
                7134,
                7159
            ],
            [
                7159,
                7391
            ],
            [
                7391,
                7577
            ],
            [
                7577,
                7739
            ],
            [
                7739,
                7779
            ],
            [
                7779,
                7793
            ],
            [
                7793,
                7819
            ],
            [
                7819,
                7941
            ],
            [
                7941,
                7965
            ],
            [
                7965,
                8192
            ],
            [
                8192,
                8436
            ],
            [
                8436,
                8483
            ],
            [
                8483,
                8578
            ],
            [
                8578,
                8656
            ],
            [
                8656,
                8711
            ],
            [
                8711,
                8889
            ],
            [
                8889,
                8928
            ],
            [
                8928,
                9198
            ],
            [
                9198,
                9280
            ],
            [
                9280,
                9558
            ],
            [
                9558,
                9624
            ],
            [
                9624,
                9681
            ],
            [
                9681,
                9713
            ],
            [
                9713,
                9823
            ],
            [
                9823,
                9902
            ],
            [
                9902,
                10082
            ],
            [
                10082,
                10715
            ],
            [
                10715,
                10934
            ],
            [
                10934,
                11055
            ],
            [
                11055,
                11421
            ],
            [
                11421,
                12803
            ],
            [
                12803,
                13318
            ],
            [
                13318,
                14503
            ],
            [
                14503,
                15927
            ],
            [
                15927,
                17150
            ],
            [
                17150,
                18864
            ],
            [
                18864,
                19516
            ],
            [
                19516,
                19964
            ],
            [
                19964,
                20022
            ],
            [
                20022,
                20251
            ],
            [
                20251,
                20364
            ],
            [
                20364,
                20487
            ],
            [
                20487,
                20754
            ],
            [
                20754,
                20857
            ],
            [
                20857,
                22689
            ],
            [
                22689,
                22723
            ],
            [
                22723,
                23468
            ]
        ],
        "segment_chars": [
            [
                0,
                107
            ],
            [
                107,
                346
            ],
            [
                346,
                427
            ],
            [
                427,
                557
            ],
            [
                557,
                788
            ],
            [
                788,
                819
            ],
            [
                819,
                1164
            ],
            [
                1164,
                1357
            ],
            [
                1357,
                1504
            ],
            [
                1504,
                1614
            ],
            [
                1614,
                1757
            ],
            [
                1757,
                1839
            ],
            [
                1839,
                1891
            ],
            [
                1891,
                1924
            ],
            [
                1924,
                1966
            ],
            [
                1966,
                2143
            ],
            [
                2143,
                2174
            ],
            [
                2174,
                2303
            ],
            [
                2303,
                2452
            ],
            [
                2452,
                2595
            ],
            [
                2595,
                2760
            ],
            [
                2760,
                2923
            ],
            [
                2923,
                3083
            ],
            [
                3083,
                3155
            ],
            [
                3155,
                3238
            ],
            [
                3238,
                3461
            ],
            [
                3461,
                3480
            ],
            [
                3480,
                3609
            ],
            [
                3609,
                3702
            ],
            [
                3702,
                3774
            ],
            [
                3774,
                3870
            ],
            [
                3870,
                3967
            ],
            [
                3967,
                4013
            ],
            [
                4013,
                4046
            ],
            [
                4046,
                4095
            ],
            [
                4095,
                4205
            ],
            [
                4205,
                4299
            ],
            [
                4299,
                4352
            ],
            [
                4352,
                4398
            ],
            [
                4398,
                4437
            ],
            [
                4437,
                4460
            ],
            [
                4460,
                4519
            ],
            [
                4519,
                4615
            ],
            [
                4615,
                4655
            ],
            [
                4655,
                4748
            ],
            [
                4748,
                4834
            ],
            [
                4834,
                4899
            ],
            [
                4899,
                5001
            ],
            [
                5001,
                5030
            ],
            [
                5030,
                5109
            ],
            [
                5109,
                5128
            ],
            [
                5128,
                5206
            ],
            [
                5206,
                5248
            ],
            [
                5248,
                5362
            ],
            [
                5362,
                5397
            ],
            [
                5397,
                5455
            ],
            [
                5455,
                5493
            ],
            [
                5493,
                5525
            ],
            [
                5525,
                5551
            ],
            [
                5551,
                5564
            ],
            [
                5564,
                5674
            ],
            [
                5674,
                5701
            ],
            [
                5701,
                5765
            ],
            [
                5765,
                5777
            ],
            [
                5777,
                5852
            ],
            [
                5852,
                5905
            ],
            [
                5905,
                5980
            ],
            [
                5980,
                6010
            ],
            [
                6010,
                6136
            ],
            [
                6136,
                6161
            ],
            [
                6161,
                6221
            ],
            [
                6221,
                6262
            ],
            [
                6262,
                6381
            ],
            [
                6381,
                6418
            ],
            [
                6418,
                6511
            ],
            [
                6511,
                6565
            ],
            [
                6565,
                6582
            ],
            [
                6582,
                6765
            ],
            [
                6765,
                6877
            ],
            [
                6877,
                6920
            ],
            [
                6920,
                6934
            ],
            [
                6934,
                7054
            ],
            [
                7054,
                7080
            ],
            [
                7080,
                7127
            ],
            [
                7127,
                7134
            ],
            [
                7134,
                7159
            ],
            [
                7159,
                7180
            ],
            [
                7180,
                7391
            ],
            [
                7391,
                7476
            ],
            [
                7476,
                7577
            ],
            [
                7577,
                7640
            ],
            [
                7640,
                7700
            ],
            [
                7700,
                7739
            ],
            [
                7739,
                7779
            ],
            [
                7779,
                7793
            ],
            [
                7793,
                7819
            ],
            [
                7819,
                7891
            ],
            [
                7891,
                7941
            ],
            [
                7941,
                7965
            ],
            [
                7965,
                8019
            ],
            [
                8019,
                8077
            ],
            [
                8077,
                8156
            ],
            [
                8156,
                8192
            ],
            [
                8192,
                8222
            ],
            [
                8222,
                8346
            ],
            [
                8346,
                8368
            ],
            [
                8368,
                8436
            ],
            [
                8436,
                8483
            ],
            [
                8483,
                8578
            ],
            [
                8578,
                8623
            ],
            [
                8623,
                8656
            ],
            [
                8656,
                8711
            ],
            [
                8711,
                8748
            ],
            [
                8748,
                8796
            ],
            [
                8796,
                8889
            ],
            [
                8889,
                8928
            ],
            [
                8928,
                8985
            ],
            [
                8985,
                9108
            ],
            [
                9108,
                9198
            ],
            [
                9198,
                9237
            ],
            [
                9237,
                9280
            ],
            [
                9280,
                9405
            ],
            [
                9405,
                9444
            ],
            [
                9444,
                9558
            ],
            [
                9558,
                9579
            ],
            [
                9579,
                9624
            ],
            [
                9624,
                9681
            ],
            [
                9681,
                9713
            ],
            [
                9713,
                9783
            ],
            [
                9783,
                9823
            ],
            [
                9823,
                9838
            ],
            [
                9838,
                9902
            ],
            [
                9902,
                9958
            ],
            [
                9958,
                10082
            ],
            [
                10082,
                10156
            ],
            [
                10156,
                10341
            ],
            [
                10341,
                10451
            ],
            [
                10451,
                10513
            ],
            [
                10513,
                10600
            ],
            [
                10600,
                10675
            ],
            [
                10675,
                10715
            ],
            [
                10715,
                10787
            ],
            [
                10787,
                10906
            ],
            [
                10906,
                10934
            ],
            [
                10934,
                10950
            ],
            [
                10950,
                11055
            ],
            [
                11055,
                11090
            ],
            [
                11090,
                11111
            ],
            [
                11111,
                11280
            ],
            [
                11280,
                11300
            ],
            [
                11300,
                11348
            ],
            [
                11348,
                11421
            ],
            [
                11421,
                11530
            ],
            [
                11530,
                11736
            ],
            [
                11736,
                12067
            ],
            [
                12067,
                12199
            ],
            [
                12199,
                12221
            ],
            [
                12221,
                12272
            ],
            [
                12272,
                12328
            ],
            [
                12328,
                12546
            ],
            [
                12546,
                12635
            ],
            [
                12635,
                12710
            ],
            [
                12710,
                12803
            ],
            [
                12803,
                12924
            ],
            [
                12924,
                13020
            ],
            [
                13020,
                13108
            ],
            [
                13108,
                13174
            ],
            [
                13174,
                13318
            ],
            [
                13318,
                13379
            ],
            [
                13379,
                13411
            ],
            [
                13411,
                13590
            ],
            [
                13590,
                13894
            ],
            [
                13894,
                13963
            ],
            [
                13963,
                14380
            ],
            [
                14380,
                14431
            ],
            [
                14431,
                14503
            ],
            [
                14503,
                14586
            ],
            [
                14586,
                14716
            ],
            [
                14716,
                14810
            ],
            [
                14810,
                14933
            ],
            [
                14933,
                15018
            ],
            [
                15018,
                15085
            ],
            [
                15085,
                15598
            ],
            [
                15598,
                15927
            ],
            [
                15927,
                15960
            ],
            [
                15960,
                16031
            ],
            [
                16031,
                16111
            ],
            [
                16111,
                16270
            ],
            [
                16270,
                16496
            ],
            [
                16496,
                16595
            ],
            [
                16595,
                16812
            ],
            [
                16812,
                17150
            ],
            [
                17150,
                17317
            ],
            [
                17317,
                17389
            ],
            [
                17389,
                17526
            ],
            [
                17526,
                17635
            ],
            [
                17635,
                17758
            ],
            [
                17758,
                17833
            ],
            [
                17833,
                17915
            ],
            [
                17915,
                18001
            ],
            [
                18001,
                18070
            ],
            [
                18070,
                18167
            ],
            [
                18167,
                18254
            ],
            [
                18254,
                18357
            ],
            [
                18357,
                18498
            ],
            [
                18498,
                18553
            ],
            [
                18553,
                18653
            ],
            [
                18653,
                18864
            ],
            [
                18864,
                19109
            ],
            [
                19109,
                19219
            ],
            [
                19219,
                19322
            ],
            [
                19322,
                19364
            ],
            [
                19364,
                19438
            ],
            [
                19438,
                19470
            ],
            [
                19470,
                19516
            ],
            [
                19516,
                19671
            ],
            [
                19671,
                19824
            ],
            [
                19824,
                19964
            ],
            [
                19964,
                19980
            ],
            [
                19980,
                20022
            ],
            [
                20022,
                20030
            ],
            [
                20030,
                20135
            ],
            [
                20135,
                20182
            ],
            [
                20182,
                20251
            ],
            [
                20251,
                20309
            ],
            [
                20309,
                20331
            ],
            [
                20331,
                20364
            ],
            [
                20364,
                20376
            ],
            [
                20376,
                20386
            ],
            [
                20386,
                20424
            ],
            [
                20424,
                20458
            ],
            [
                20458,
                20487
            ],
            [
                20487,
                20527
            ],
            [
                20527,
                20582
            ],
            [
                20582,
                20631
            ],
            [
                20631,
                20650
            ],
            [
                20650,
                20700
            ],
            [
                20700,
                20754
            ],
            [
                20754,
                20766
            ],
            [
                20766,
                20785
            ],
            [
                20785,
                20857
            ],
            [
                20857,
                20960
            ],
            [
                20960,
                21060
            ],
            [
                21060,
                21156
            ],
            [
                21156,
                21433
            ],
            [
                21433,
                21559
            ],
            [
                21559,
                21667
            ],
            [
                21667,
                21713
            ],
            [
                21713,
                21758
            ],
            [
                21758,
                21810
            ],
            [
                21810,
                21870
            ],
            [
                21870,
                21931
            ],
            [
                21931,
                22088
            ],
            [
                22088,
                22128
            ],
            [
                22128,
                22219
            ],
            [
                22219,
                22307
            ],
            [
                22307,
                22541
            ],
            [
                22541,
                22631
            ],
            [
                22631,
                22689
            ],
            [
                22689,
                22723
            ],
            [
                22723,
                22735
            ],
            [
                22735,
                22828
            ],
            [
                22828,
                22874
            ],
            [
                22874,
                22886
            ],
            [
                22886,
                23014
            ],
            [
                23014,
                23095
            ],
            [
                23095,
                23334
            ],
            [
                23334,
                23468
            ]
        ],
        "overlap_chars": [
            [
                0,
                107
            ],
            [
                107,
                173
            ],
            [
                181,
                188
            ],
            [
                269,
                271
            ],
            [
                213,
                220
            ],
            [
                237,
                240
            ],
            [
                255,
                259
            ],
            [
                231,
                236
            ],
            [
                189,
                201
            ],
            [
                344,
                345
            ],
            [
                375,
                376
            ],
            [
                346,
                353
            ],
            [
                358,
                361
            ],
            [
                367,
                375
            ],
            [
                425,
                427
            ],
            [
                427,
                495
            ],
            [
                502,
                557
            ],
            [
                591,
                603
            ],
            [
                557,
                570
            ],
            [
                581,
                590
            ],
            [
                616,
                619
            ],
            [
                626,
                651
            ],
            [
                656,
                661
            ],
            [
                665,
                709
            ],
            [
                786,
                787
            ],
            [
                788,
                819
            ],
            [
                819,
                846
            ],
            [
                935,
                938
            ],
            [
                962,
                984
            ],
            [
                956,
                961
            ],
            [
                952,
                955
            ],
            [
                985,
                1014
            ],
            [
                848,
                849
            ],
            [
                1017,
                1034
            ],
            [
                1036,
                1062
            ],
            [
                1084,
                1099
            ],
            [
                1162,
                1164
            ],
            [
                1177,
                1182
            ],
            [
                1329,
                1332
            ],
            [
                1252,
                1255
            ],
            [
                1194,
                1197
            ],
            [
                1317,
                1324
            ],
            [
                1192,
                1193
            ],
            [
                1757,
                1760
            ],
            [
                1858,
                1862
            ],
            [
                1870,
                1891
            ],
            [
                1891,
                1908
            ],
            [
                1924,
                1966
            ],
            [
                2118,
                2120
            ],
            [
                2077,
                2079
            ],
            [
                1972,
                1975
            ],
            [
                1985,
                1992
            ],
            [
                2089,
                2093
            ],
            [
                2043,
                2076
            ],
            [
                2141,
                2143
            ],
            [
                2143,
                2173
            ],
            [
                2327,
                2356
            ],
            [
                2388,
                2391
            ],
            [
                2400,
                2428
            ],
            [
                2444,
                2452
            ],
            [
                2760,
                2804
            ],
            [
                2822,
                2825
            ],
            [
                2807,
                2812
            ],
            [
                2921,
                2923
            ],
            [
                2923,
                2941
            ],
            [
                2953,
                3022
            ],
            [
                3034,
                3070
            ],
            [
                3078,
                3083
            ],
            [
                3103,
                3117
            ],
            [
                3184,
                3187
            ],
            [
                3129,
                3148
            ],
            [
                3274,
                3279
            ],
            [
                3486,
                3574
            ],
            [
                3153,
                3154
            ],
            [
                3609,
                3702
            ],
            [
                3702,
                3774
            ],
            [
                3870,
                3914
            ],
            [
                3943,
                3967
            ],
            [
                3967,
                3980
            ],
            [
                3986,
                4013
            ],
            [
                4013,
                4026
            ],
            [
                4064,
                4085
            ],
            [
                4093,
                4095
            ],
            [
                4095,
                4119
            ],
            [
                4140,
                4205
            ],
            [
                4205,
                4290
            ],
            [
                4296,
                4299
            ],
            [
                4460,
                4461
            ],
            [
                4462,
                4470
            ],
            [
                4478,
                4519
            ],
            [
                4519,
                4613
            ],
            [
                4655,
                4716
            ],
            [
                4746,
                4748
            ],
            [
                4748,
                4834
            ],
            [
                4834,
                4899
            ],
            [
                4899,
                4944
            ],
            [
                4951,
                5001
            ],
            [
                5001,
                5030
            ],
            [
                5030,
                5109
            ],
            [
                5109,
                5128
            ],
            [
                5128,
                5175
            ],
            [
                5182,
                5206
            ],
            [
                5248,
                5350
            ],
            [
                5355,
                5362
            ],
            [
                5362,
                5383
            ],
            [
                5410,
                5414
            ],
            [
                5384,
                5387
            ],
            [
                5422,
                5455
            ],
            [
                5526,
                5551
            ],
            [
                5551,
                5564
            ],
            [
                5674,
                5701
            ],
            [
                5701,
                5737
            ],
            [
                5739,
                5761
            ],
            [
                5765,
                5777
            ],
            [
                5777,
                5826
            ],
            [
                5846,
                5852
            ],
            [
                5852,
                5873
            ],
            [
                5899,
                5903
            ],
            [
                5882,
                5895
            ],
            [
                5903,
                5905
            ],
            [
                6011,
                6031
            ],
            [
                6042,
                6092
            ],
            [
                6096,
                6103
            ],
            [
                6116,
                6136
            ],
            [
                6136,
                6161
            ],
            [
                6161,
                6221
            ],
            [
                6221,
                6248
            ],
            [
                6262,
                6265
            ],
            [
                6272,
                6286
            ],
            [
                6379,
                6381
            ],
            [
                6418,
                6499
            ],
            [
                6508,
                6511
            ],
            [
                6511,
                6565
            ],
            [
                6565,
                6582
            ],
            [
                6582,
                6595
            ],
            [
                6602,
                6603
            ],
            [
                6607,
                6612
            ],
            [
                6678,
                6725
            ],
            [
                6637,
                6638
            ],
            [
                6753,
                6765
            ],
            [
                6765,
                6766
            ],
            [
                6766,
                6803
            ],
            [
                6851,
                6877
            ],
            [
                6877,
                6897
            ],
            [
                6912,
                6920
            ],
            [
                6920,
                6934
            ],
            [
                6934,
                6952
            ],
            [
                6963,
                6975
            ],
            [
                6987,
                7054
            ],
            [
                7054,
                7080
            ],
            [
                7080,
                7127
            ],
            [
                7127,
                7134
            ],
            [
                7134,
                7159
            ],
            [
                7159,
                7180
            ],
            [
                7180,
                7212
            ],
            [
                7240,
                7337
            ],
            [
                7578,
                7640
            ],
            [
                7640,
                7676
            ],
            [
                7698,
                7700
            ],
            [
                7700,
                7739
            ],
            [
                7739,
                7779
            ],
            [
                7779,
                7793
            ],
            [
                7793,
                7819
            ],
            [
                7891,
                7918
            ],
            [
                7938,
                7941
            ],
            [
                7941,
                7942
            ],
            [
                7946,
                7965
            ],
            [
                7965,
                8019
            ],
            [
                8019,
                8075
            ],
            [
                8192,
                8222
            ],
            [
                8222,
                8257
            ],
            [
                8263,
                8273
            ],
            [
                8335,
                8336
            ],
            [
                8282,
                8289
            ],
            [
                8296,
                8312
            ],
            [
                8344,
                8346
            ],
            [
                8368,
                8371
            ],
            [
                8372,
                8383
            ],
            [
                8393,
                8396
            ],
            [
                8403,
                8436
            ],
            [
                8436,
                8482
            ],
            [
                8656,
                8657
            ],
            [
                8623,
                8653
            ],
            [
                8662,
                8672
            ],
            [
                8688,
                8692
            ],
            [
                8724,
                8748
            ],
            [
                8767,
                8796
            ],
            [
                8796,
                8840
            ],
            [
                8886,
                8889
            ],
            [
                8889,
                8928
            ],
            [
                8928,
                8946
            ],
            [
                8983,
                8985
            ],
            [
                8985,
                9106
            ],
            [
                9198,
                9237
            ],
            [
                9237,
                9280
            ],
            [
                9280,
                9282
            ],
            [
                9332,
                9405
            ],
            [
                9444,
                9532
            ],
            [
                9535,
                9558
            ],
            [
                9558,
                9579
            ],
            [
                9579,
                9590
            ],
            [
                9621,
                9624
            ],
            [
                9624,
                9642
            ],
            [
                9651,
                9681
            ],
            [
                9681,
                9713
            ],
            [
                9713,
                9740
            ],
            [
                9752,
                9783
            ],
            [
                9783,
                9823
            ],
            [
                10082,
                10147
            ],
            [
                10154,
                10156
            ],
            [
                10341,
                10369
            ],
            [
                10382,
                10389
            ],
            [
                10370,
                10381
            ],
            [
                10449,
                10451
            ],
            [
                10537,
                10539
            ],
            [
                10569,
                10574
            ],
            [
                10513,
                10528
            ],
            [
                10553,
                10559
            ],
            [
                10588,
                10598
            ],
            [
                10559,
                10568
            ],
            [
                10579,
                10587
            ],
            [
                10598,
                10600
            ],
            [
                10600,
                10674
            ],
            [
                10715,
                10787
            ],
            [
                10787,
                10827
            ],
            [
                10835,
                10848
            ],
            [
                10861,
                10865
            ],
            [
                10871,
                10906
            ],
            [
                10906,
                10934
            ],
            [
                10934,
                10950
            ],
            [
                10950,
                10953
            ],
            [
                10963,
                10971
            ],
            [
                10973,
                10999
            ],
            [
                11003,
                11037
            ],
            [
                11043,
                11055
            ],
            [
                11055,
                11056
            ],
            [
                11088,
                11090
            ],
            [
                11090,
                11109
            ],
            [
                11348,
                11421
            ],
            [
                11421,
                11504
            ],
            [
                11528,
                11530
            ],
            [
                11530,
                11554
            ],
            [
                11600,
                11621
            ],
            [
                11642,
                11652
            ],
            [
                11624,
                11632
            ],
            [
                11652,
                11660
            ],
            [
                11701,
                11736
            ],
            [
                11736,
                11757
            ],
            [
                11773,
                11893
            ],
            [
                11963,
                11975
            ],
            [
                11982,
                12023
            ],
            [
                12047,
                12067
            ],
            [
                12221,
                12227
            ],
            [
                12232,
                12242
            ],
            [
                12267,
                12272
            ],
            [
                12272,
                12278
            ],
            [
                12291,
                12299
            ],
            [
                12326,
                12328
            ],
            [
                12328,
                12380
            ],
            [
                12385,
                12395
            ],
            [
                12409,
                12410
            ],
            [
                12381,
                12384
            ],
            [
                12412,
                12419
            ],
            [
                12480,
                12524
            ],
            [
                12544,
                12546
            ],
            [
                12546,
                12589
            ],
            [
                12599,
                12635
            ],
            [
                12635,
                12644
            ],
            [
                12659,
                12708
            ],
            [
                12739,
                12746
            ],
            [
                12754,
                12755
            ],
            [
                12710,
                12717
            ],
            [
                12762,
                12803
            ],
            [
                12803,
                12855
            ],
            [
                12894,
                12924
            ],
            [
                13020,
                13074
            ],
            [
                13076,
                13108
            ],
            [
                13108,
                13173
            ],
            [
                13318,
                13340
            ],
            [
                13367,
                13377
            ],
            [
                13379,
                13393
            ],
            [
                13399,
                13411
            ],
            [
                13411,
                13443
            ],
            [
                13511,
                13513
            ],
            [
                13447,
                13453
            ],
            [
                13472,
                13486
            ],
            [
                13493,
                13497
            ],
            [
                13505,
                13510
            ],
            [
                13551,
                13554
            ],
            [
                13538,
                13543
            ],
            [
                13547,
                13550
            ],
            [
                13558,
                13590
            ],
            [
                13590,
                13604
            ],
            [
                13619,
                13655
            ],
            [
                13673,
                13676
            ],
            [
                13680,
                13704
            ],
            [
                13808,
                13809
            ],
            [
                13811,
                13830
            ],
            [
                13851,
                13894
            ],
            [
                13894,
                13924
            ],
            [
                13963,
                13966
            ],
            [
                14090,
                14101
            ],
            [
                14106,
                14201
            ],
            [
                14213,
                14239
            ],
            [
                14246,
                14277
            ],
            [
                14240,
                14245
            ],
            [
                14286,
                14288
            ],
            [
                14304,
                14316
            ],
            [
                14319,
                14329
            ],
            [
                14333,
                14361
            ],
            [
                14378,
                14379
            ],
            [
                14618,
                14621
            ],
            [
                14603,
                14605
            ],
            [
                14589,
                14592
            ],
            [
                14651,
                14716
            ],
            [
                14716,
                14743
            ],
            [
                14750,
                14810
            ],
            [
                14917,
                14919
            ],
            [
                14810,
                14814
            ],
            [
                14841,
                14915
            ],
            [
                14931,
                14933
            ],
            [
                15628,
                15631
            ],
            [
                15885,
                15888
            ],
            [
                15608,
                15626
            ],
            [
                15708,
                15709
            ],
            [
                15632,
                15708
            ],
            [
                15925,
                15927
            ],
            [
                16031,
                16043
            ],
            [
                16062,
                16111
            ],
            [
                16111,
                16114
            ],
            [
                16134,
                16172
            ],
            [
                16210,
                16244
            ],
            [
                16254,
                16270
            ],
            [
                16270,
                16377
            ],
            [
                16479,
                16481
            ],
            [
                16482,
                16496
            ],
            [
                16595,
                16599
            ],
            [
                16606,
                16752
            ],
            [
                16754,
                16758
            ],
            [
                16810,
                16812
            ],
            [
                16812,
                16836
            ],
            [
                16874,
                16878
            ],
            [
                16887,
                16917
            ],
            [
                16920,
                16926
            ],
            [
                16960,
                16962
            ],
            [
                16975,
                16982
            ],
            [
                16939,
                16959
            ],
            [
                16986,
                17023
            ],
            [
                17042,
                17064
            ],
            [
                16867,
                16871
            ],
            [
                17065,
                17084
            ],
            [
                17148,
                17150
            ],
            [
                17150,
                17152
            ],
            [
                17156,
                17166
            ],
            [
                17153,
                17155
            ],
            [
                17202,
                17317
            ],
            [
                17342,
                17354
            ],
            [
                17362,
                17366
            ],
            [
                17373,
                17379
            ],
            [
                17333,
                17336
            ],
            [
                17317,
                17320
            ],
            [
                17337,
                17341
            ],
            [
                17476,
                17479
            ],
            [
                17389,
                17397
            ],
            [
                17424,
                17448
            ],
            [
                17466,
                17475
            ],
            [
                17489,
                17525
            ],
            [
                17639,
                17661
            ],
            [
                17675,
                17680
            ],
            [
                17690,
                17723
            ],
            [
                17731,
                17742
            ],
            [
                17756,
                17758
            ],
            [
                17758,
                17797
            ],
            [
                17822,
                17833
            ],
            [
                17833,
                17860
            ],
            [
                17865,
                17873
            ],
            [
                17915,
                17918
            ],
            [
                18001,
                18013
            ],
            [
                18032,
                18070
            ],
            [
                18106,
                18118
            ],
            [
                18125,
                18166
            ],
            [
                18357,
                18430
            ],
            [
                18496,
                18498
            ],
            [
                18498,
                18524
            ],
            [
                18551,
                18553
            ],
            [
                18553,
                18606
            ],
            [
                18615,
                18617
            ],
            [
                18627,
                18652
            ],
            [
                18864,
                18940
            ],
            [
                18959,
                18999
            ],
            [
                19014,
                19021
            ],
            [
                19088,
                19109
            ],
            [
                19109,
                19186
            ],
            [
                19217,
                19218
            ],
            [
                19219,
                19254
            ],
            [
                19273,
                19296
            ],
            [
                19326,
                19329
            ],
            [
                19346,
                19363
            ],
            [
                19364,
                19394
            ],
            [
                19397,
                19438
            ],
            [
                19438,
                19451
            ],
            [
                19453,
                19470
            ],
            [
                19470,
                19477
            ],
            [
                19488,
                19516
            ],
            [
                19516,
                19570
            ],
            [
                19580,
                19625
            ],
            [
                19646,
                19671
            ],
            [
                19671,
                19735
            ],
            [
                19769,
                19788
            ],
            [
                19803,
                19824
            ],
            [
                19824,
                19848
            ],
            [
                19863,
                19940
            ],
            [
                19950,
                19964
            ],
            [
                19964,
                19980
            ],
            [
                19980,
                20004
            ],
            [
                20012,
                20022
            ],
            [
                20022,
                20030
            ],
            [
                20030,
                20039
            ],
            [
                20064,
                20124
            ],
            [
                20126,
                20135
            ],
            [
                20135,
                20182
            ],
            [
                20182,
                20209
            ],
            [
                20228,
                20251
            ],
            [
                20251,
                20290
            ],
            [
                20298,
                20309
            ],
            [
                20309,
                20329
            ],
            [
                20364,
                20368
            ],
            [
                20369,
                20375
            ],
            [
                20376,
                20384
            ],
            [
                20406,
                20424
            ],
            [
                20424,
                20458
            ],
            [
                20458,
                20487
            ],
            [
                20487,
                20503
            ],
            [
                20506,
                20527
            ],
            [
                20527,
                20549
            ],
            [
                20558,
                20581
            ],
            [
                20582,
                20631
            ],
            [
                20631,
                20650
            ],
            [
                20650,
                20700
            ],
            [
                20700,
                20754
            ],
            [
                20754,
                20766
            ],
            [
                20766,
                20784
            ],
            [
                20857,
                20960
            ],
            [
                20960,
                20986
            ],
            [
                21044,
                21046
            ],
            [
                21083,
                21156
            ],
            [
                21156,
                21217
            ],
            [
                21240,
                21257
            ],
            [
                21347,
                21360
            ],
            [
                21217,
                21218
            ],
            [
                21311,
                21314
            ],
            [
                21315,
                21346
            ],
            [
                21362,
                21365
            ],
            [
                21366,
                21391
            ],
            [
                21431,
                21433
            ],
            [
                21433,
                21435
            ],
            [
                21580,
                21583
            ],
            [
                21445,
                21449
            ],
            [
                21559,
                21561
            ],
            [
                21570,
                21574
            ],
            [
                21593,
                21601
            ],
            [
                21619,
                21623
            ],
            [
                21625,
                21666
            ],
            [
                21667,
                21713
            ],
            [
                21713,
                21758
            ],
            [
                21758,
                21810
            ],
            [
                21810,
                21870
            ],
            [
                21870,
                21919
            ],
            [
                21928,
                21931
            ],
            [
                21931,
                21957
            ],
            [
                22088,
                22096
            ],
            [
                21970,
                21978
            ],
            [
                22100,
                22127
            ],
            [
                22128,
                22219
            ],
            [
                22219,
                22259
            ],
            [
                22305,
                22307
            ],
            [
                22307,
                22361
            ],
            [
                22367,
                22384
            ],
            [
                22465,
                22495
            ],
            [
                22507,
                22540
            ],
            [
                22723,
                22735
            ],
            [
                22735,
                22738
            ],
            [
                22762,
                22766
            ],
            [
                22786,
                22803
            ],
            [
                22812,
                22828
            ],
            [
                22845,
                22874
            ],
            [
                22874,
                22886
            ],
            [
                22928,
                22936
            ],
            [
                22886,
                22889
            ],
            [
                22899,
                22903
            ],
            [
                22937,
                22949
            ],
            [
                22922,
                22923
            ],
            [
                22974,
                23014
            ],
            [
                23014,
                23036
            ],
            [
                23045,
                23056
            ],
            [
                23093,
                23095
            ],
            [
                23110,
                23123
            ],
            [
                23124,
                23129
            ],
            [
                23140,
                23151
            ],
            [
                23157,
                23189
            ],
            [
                23273,
                23289
            ],
            [
                23332,
                23334
            ],
            [
                23334,
                23347
            ],
            [
                23377,
                23468
            ]
        ],
        "row_chars": [
            [
                0,
                107
            ],
            [
                107,
                346
            ],
            [
                346,
                427
            ],
            [
                427,
                557
            ],
            [
                557,
                788
            ],
            [
                788,
                819
            ],
            [
                819,
                1164
            ],
            [
                1164,
                1891
            ],
            [
                1891,
                1966
            ],
            [
                1966,
                2143
            ],
            [
                2143,
                2174
            ],
            [
                2174,
                2303
            ],
            [
                2303,
                2452
            ],
            [
                2452,
                2595
            ],
            [
                2595,
                2760
            ],
            [
                2760,
                2923
            ],
            [
                2923,
                3083
            ],
            [
                3083,
                3609
            ],
            [
                3609,
                3702
            ],
            [
                3702,
                3774
            ],
            [
                3774,
                3870
            ],
            [
                3870,
                3967
            ],
            [
                3967,
                4013
            ],
            [
                4013,
                4095
            ],
            [
                4095,
                4205
            ],
            [
                4205,
                4299
            ],
            [
                4299,
                4352
            ],
            [
                4352,
                4398
            ],
            [
                4398,
                4437
            ],
            [
                4437,
                4460
            ],
            [
                4460,
                4519
            ],
            [
                4519,
                4615
            ],
            [
                4615,
                4655
            ],
            [
                4655,
                4748
            ],
            [
                4748,
                4834
            ],
            [
                4834,
                4899
            ],
            [
                4899,
                5001
            ],
            [
                5001,
                5030
            ],
            [
                5030,
                5109
            ],
            [
                5109,
                5128
            ],
            [
                5128,
                5206
            ],
            [
                5206,
                5248
            ],
            [
                5248,
                5362
            ],
            [
                5362,
                5455
            ],
            [
                5455,
                5493
            ],
            [
                5493,
                5525
            ],
            [
                5525,
                5551
            ],
            [
                5551,
                5564
            ],
            [
                5564,
                5674
            ],
            [
                5674,
                5701
            ],
            [
                5701,
                5765
            ],
            [
                5765,
                5777
            ],
            [
                5777,
                5852
            ],
            [
                5852,
                5905
            ],
            [
                5905,
                5980
            ],
            [
                5980,
                6010
            ],
            [
                6010,
                6136
            ],
            [
                6136,
                6161
            ],
            [
                6161,
                6221
            ],
            [
                6221,
                6381
            ],
            [
                6381,
                6418
            ],
            [
                6418,
                6511
            ],
            [
                6511,
                6565
            ],
            [
                6565,
                6582
            ],
            [
                6582,
                6765
            ],
            [
                6765,
                6877
            ],
            [
                6877,
                6920
            ],
            [
                6920,
                6934
            ],
            [
                6934,
                7054
            ],
            [
                7054,
                7080
            ],
            [
                7080,
                7127
            ],
            [
                7127,
                7134
            ],
            [
                7134,
                7159
            ],
            [
                7159,
                7180
            ],
            [
                7180,
                7391
            ],
            [
                7391,
                7476
            ],
            [
                7476,
                7577
            ],
            [
                7577,
                7640
            ],
            [
                7640,
                7700
            ],
            [
                7700,
                7739
            ],
            [
                7739,
                7779
            ],
            [
                7779,
                7793
            ],
            [
                7793,
                7819
            ],
            [
                7819,
                7891
            ],
            [
                7891,
                7941
            ],
            [
                7941,
                7965
            ],
            [
                7965,
                8019
            ],
            [
                8019,
                8077
            ],
            [
                8077,
                8156
            ],
            [
                8156,
                8192
            ],
            [
                8192,
                8222
            ],
            [
                8222,
                8346
            ],
            [
                8346,
                8368
            ],
            [
                8368,
                8436
            ],
            [
                8436,
                8483
            ],
            [
                8483,
                8578
            ],
            [
                8578,
                8623
            ],
            [
                8623,
                8748
            ],
            [
                8748,
                8796
            ],
            [
                8796,
                8889
            ],
            [
                8889,
                8928
            ],
            [
                8928,
                8985
            ],
            [
                8985,
                9108
            ],
            [
                9108,
                9198
            ],
            [
                9198,
                9237
            ],
            [
                9237,
                9280
            ],
            [
                9280,
                9405
            ],
            [
                9405,
                9444
            ],
            [
                9444,
                9558
            ],
            [
                9558,
                9579
            ],
            [
                9579,
                9624
            ],
            [
                9624,
                9681
            ],
            [
                9681,
                9713
            ],
            [
                9713,
                9783
            ],
            [
                9783,
                9823
            ],
            [
                9823,
                9838
            ],
            [
                9838,
                9902
            ],
            [
                9902,
                9958
            ],
            [
                9958,
                10082
            ],
            [
                10082,
                10156
            ],
            [
                10156,
                10341
            ],
            [
                10341,
                10451
            ],
            [
                10451,
                10513
            ],
            [
                10513,
                10600
            ],
            [
                10600,
                10675
            ],
            [
                10675,
                10715
            ],
            [
                10715,
                10787
            ],
            [
                10787,
                10906
            ],
            [
                10906,
                10934
            ],
            [
                10934,
                10950
            ],
            [
                10950,
                11055
            ],
            [
                11055,
                11090
            ],
            [
                11090,
                11111
            ],
            [
                11111,
                11280
            ],
            [
                11280,
                11300
            ],
            [
                11300,
                11348
            ],
            [
                11348,
                11421
            ],
            [
                11421,
                11530
            ],
            [
                11530,
                11736
            ],
            [
                11736,
                12067
            ],
            [
                12067,
                12199
            ],
            [
                12199,
                12221
            ],
            [
                12221,
                12272
            ],
            [
                12272,
                12328
            ],
            [
                12328,
                12546
            ],
            [
                12546,
                12635
            ],
            [
                12635,
                12803
            ],
            [
                12803,
                12924
            ],
            [
                12924,
                13020
            ],
            [
                13020,
                13108
            ],
            [
                13108,
                13174
            ],
            [
                13174,
                13318
            ],
            [
                13318,
                13411
            ],
            [
                13411,
                13590
            ],
            [
                13590,
                13894
            ],
            [
                13894,
                13963
            ],
            [
                13963,
                14380
            ],
            [
                14380,
                14431
            ],
            [
                14431,
                14503
            ],
            [
                14503,
                14586
            ],
            [
                14586,
                14716
            ],
            [
                14716,
                14810
            ],
            [
                14810,
                14933
            ],
            [
                14933,
                15018
            ],
            [
                15018,
                15085
            ],
            [
                15085,
                15598
            ],
            [
                15598,
                15927
            ],
            [
                15927,
                15960
            ],
            [
                15960,
                16031
            ],
            [
                16031,
                16111
            ],
            [
                16111,
                16270
            ],
            [
                16270,
                16496
            ],
            [
                16496,
                16595
            ],
            [
                16595,
                16812
            ],
            [
                16812,
                17150
            ],
            [
                17150,
                17317
            ],
            [
                17317,
                17526
            ],
            [
                17526,
                17635
            ],
            [
                17635,
                17758
            ],
            [
                17758,
                17833
            ],
            [
                17833,
                18070
            ],
            [
                18070,
                18167
            ],
            [
                18167,
                18254
            ],
            [
                18254,
                18357
            ],
            [
                18357,
                18498
            ],
            [
                18498,
                18553
            ],
            [
                18553,
                18653
            ],
            [
                18653,
                18864
            ],
            [
                18864,
                19109
            ],
            [
                19109,
                19219
            ],
            [
                19219,
                19364
            ],
            [
                19364,
                19438
            ],
            [
                19438,
                19470
            ],
            [
                19470,
                19516
            ],
            [
                19516,
                19671
            ],
            [
                19671,
                19824
            ],
            [
                19824,
                19964
            ],
            [
                19964,
                19980
            ],
            [
                19980,
                20022
            ],
            [
                20022,
                20030
            ],
            [
                20030,
                20135
            ],
            [
                20135,
                20182
            ],
            [
                20182,
                20251
            ],
            [
                20251,
                20309
            ],
            [
                20309,
                20331
            ],
            [
                20331,
                20364
            ],
            [
                20364,
                20424
            ],
            [
                20424,
                20458
            ],
            [
                20458,
                20487
            ],
            [
                20487,
                20527
            ],
            [
                20527,
                20582
            ],
            [
                20582,
                20631
            ],
            [
                20631,
                20650
            ],
            [
                20650,
                20700
            ],
            [
                20700,
                20754
            ],
            [
                20754,
                20766
            ],
            [
                20766,
                20785
            ],
            [
                20785,
                20857
            ],
            [
                20857,
                20960
            ],
            [
                20960,
                21156
            ],
            [
                21156,
                21433
            ],
            [
                21433,
                21667
            ],
            [
                21667,
                21713
            ],
            [
                21713,
                21758
            ],
            [
                21758,
                21810
            ],
            [
                21810,
                21870
            ],
            [
                21870,
                21931
            ],
            [
                21931,
                22128
            ],
            [
                22128,
                22219
            ],
            [
                22219,
                22307
            ],
            [
                22307,
                22541
            ],
            [
                22541,
                22631
            ],
            [
                22631,
                22689
            ],
            [
                22689,
                22723
            ],
            [
                22723,
                22735
            ],
            [
                22735,
                22828
            ],
            [
                22828,
                22874
            ],
            [
                22874,
                22886
            ],
            [
                22886,
                23014
            ],
            [
                23014,
                23095
            ],
            [
                23095,
                23334
            ],
            [
                23334,
                23468
            ]
        ]
    },
    "abridged": {
        "text": "On the night before Christmas Eve two men were sitting together in George Vavasor's rooms in Cecil Street. It was past twelve o'clock, and they were both smoking; there were bottles of spirits and jugs of water on the table.\nHowever, Vavasor was not drinking. There was a little weak brandy and water in a glass by his side, but it had remained untouched for the last twenty minutes. In that time his companion had twice refilled his glass, and was now puffing out smoke from his pipe with the fury of a steamer's funnel.\nThis man was Burgo Fitzgerald. He was as handsome as ever; but in his eyes and cheeks there was a look of haggard dissipation - a sign of riotous living which had become wearisome even to himself. Habitual drink did not make him red-faced and bloated, but pale, worn, and haggard. He grew thin, and at times he had been ill to death's door. He declared to his friends that that his liver had become useless. But still his beauty remained.\nHe had come to Vavasor's room to ask him for assistance, and perhaps also for advice. These two men had known each other long, and had been close friends. When Lady Glencora tried, vainly as we know, to obtain aid from Alice Vavasor, Burgo had been led to believe that Alice's cousin might help him. George Vavasor had been quite ready to help; but Burgo's hopes had been frustrated, and Lady Glencora M'Cluskie had become Lady Glencora Palliser.\nBut now other hopes had sprung up, and Burgo was again looking to his friend for assistance.\n\"I believe she would,\" Burgo said, as he lifted the glass to his mouth. \"I know that she is not happy with him, and I will at least ask her.\"\n\"But he would keep her fortune all the same?\"\n\"I don't know, and I don't mean to ask. Of course I don't expect anyone to believe me, but her money has no bearing on the question now. Heaven knows I want money bad enough, but I wouldn't take away another man's wife for it.\"\n\"I must tell you that I wouldn't run away with any man's wife. I have an old-fashioned idea that when a man has got a wife he ought to be allowed to keep her.\"\n\"I think he ran away with my wife,\" said Burgo, with emphasis. \"She was engaged to me first; and she really loved me, while she never cared for him.\"\n\"Nevertheless, marriage is marriage, and the law is against you. But if I did go in for such a troublesome job, I certainly should keep an eye upon the money.\"\n\"It can make no difference.\"\n\"It did make a difference, I suppose, when you first thought of marrying her?\"\n\"Of course it did. My people brought us together because she had a fortune and I had none. And I'll tell you what; I believe that old harridan of an aunt of mine is willing to do the same thing again. Of course she doesn't dare say so, but I do believe she means it. Upon my soul I hate her. I do indeed. She is a wicked old woman. Some of us fellows are wicked enough - you and I for instance-\"\n\"Thank you. I don't know, however, that I am qualified to run alongside you.\"\n\"But we are angels to that old she-devil. The truth is, I want Lady Glencora, partly because I love her; but chiefly because I believe that she loves me.\"\n\"It's for her sake then! You are ready to sacrifice yourself to do her a good turn.\"\n\"As for sacrificing myself, I'm utterly ruined in any case. I have made a shipwreck of everything, and have now only got to go down among the waves.\"\n\"Only you would like to take Lady Glencora with you.\"\n\"No, by heavens! But sometimes I think that I might still become a different fellow if I could marry her.\"\n\"If you had you married her when she was free, it might have been so.\"\n\"I think it would be so now. I do, indeed. If I could get her to Italy, or Greece, I think I could treat her well, and live with her quietly. I know that I would try.\"\n\"Without the assistance of brandy and cigars.\"\n\"Yes.\"\n\"And without any money.\"\n\"With only a little. I know you'll laugh at me; but I imagine a sort of life which I think would suit us, and be very different from this hideous way of living. He'd get a divorce, of course, and then we should be married. I really don't think he'd dislike it. They tell me he doesn't care for her.\"\n\"You have seen her since her marriage?\"\n\"Yes; twice.\"\n\"And have spoken to her?\"\n\"Once, for about two minutes.\"\n\"What did she say?\"\n\"She said it would be better that we should not meet. When she said that, I knew that she was still fond of me.\"\nVavasor paused a few minutes. \"I dare say she is fond of you,\" he said; \"but I doubt if she has courage for such a thing. And even if she has, you might fail in carrying out your plan.\"\n\"I must get a little money first,\" said Burgo. \"I went to Magruin this morning, the fellow near the Foundling Hospital. He was quite civil about it. He says I owe him over three thousand pounds.\"\n\"How much did you ever have from him?\"\n\"I don't recollect. He got a bill of mine from a tailor who went to smash, and he kept on renewing that till it grew to be ever so many bills.\"\n\"And he says he'll give you money now? I suppose you told him why you wanted it.\"\n\"I let him understand that I hoped to get off with a lady who had a lot of tin. He says he'll let me have one hundred and fifty on a bill at two months for five hundred - with your name to it.\"\n\"With my name to it! That's kind of you.\"\n\"Of course I can't pay up at the end of two months.\"\n\"I dare say not,\" said Vavasor.\n\"But he won't come upon you for a year or more afterwards. I did pay you what you lent me before.\"\nBefore the evening was over Vavasor promised the assistance asked. He knew that he was creating trouble for himself. But he had asked for such assistance from others himself before now, and had received it. It was a reckless deed on his part, but then all his doings were reckless.\n\"I thought you would, old fellow,\" said Burgo, as he got up to go away. \"Perhaps, you know, I shall pull through; and perhaps some of her fortune will come with her. If so you'll be all right.\"\n\"Perhaps I may. But, Burgo, don't you give that fellow the bill till you've got the money in your fist.\"\n\"Don't worry. I know their tricks.\" Then Burgo Fitzgerald took a little more brandy and water and went away.\nHe was living at this time in the house of one of his relatives in Cavendish Square. His uncles and his aunts had clung to him with surprising tenacity; for he did not even pretend to like them. His father, with whom he had not been on speaking terms, was now dead; but he had sisters whose husbands would still open their houses to him, and lend him horses, and provide him with every luxury - except ready money. Nobody thought of reproaching him. They knew it was a waste of time. They were still fond of him because he was beautiful, yet never vain; and because he had a certain kindliness which made him pleasant. He was soft and gracious with children, and very courteous to his lady cousins. They knew he was worthless, but nevertheless they loved him - chiefly, I think, because he seemed to think so little of himself.\nBut now as he walked home in the middle of the night he did think much of himself. Every man to himself is the centre of the whole world; the axle on which it all turns. All knowledge is but his own perception of the things around him.\nHe had played his part very badly; of that he was well aware. He had sense enough to know that he should earn his bread in some way, and had never yet earned so much as a penny roll. He had learned that the world's progress depends on men doing their duty by each other; and he knew that he had done nothing to promote such progress. He thoroughly despised himself. But when he was alone with the cold night air upon his face, when the stars were bright above him and the world was almost quiet, he would ask himself whether there might still be some hope of redemption - some chance of a better life.\nAnd the way to this better life was to take away another man's wife and make himself happy with her! What he had said to Vavasor about disregarding Lady Glencora's money had been perfectly true. He believed that if she went off with him, some portion of her enormous wealth would still cling to her. But whereas his previous advances had been mercenary, he had learned to love the girl, and to care more for her than for her money.\nThe girl had married another man, and there was an end of it. But gradually reports had reached him that she was not happy - reports from people who were glad to exaggerate what they had heard. A whole tribe of his female relatives had been anxious to promote his marriage with Lady Glencora M'Cluskie on account of her great wealth. That tribe had been bitterly disappointed; and when they heard that Mr. Palliser's marriage had given him no child, and that Lady Glencora was unhappy, they triumphed. I will not say that they approved of the step which Burgo now wished to take - though he accused his aunt, Lady Monk, of wanting it; but they whispered that such things must be expected, when such marriages were made.\nAs Burgo walked on, he tried hard to cheat himself into a belief that he would do a good thing in carrying Lady Glencora away from her husband. But he had never done anything so bad in his bad life; and the more he thought about it, the more thoroughly he saw how great was the crime which he contemplated.\nHe tried to think that there were special circumstances which would justify him. They had loved each other and had sworn constancy. There had been no change in their feelings; but she had been made to marry a man she did not love. Would it not be better that they should come together?\nThen he reverted to those dreams of a life of love, in some sunny country. Vavasor had laughed at him. But Vavasor, he said to himself, was a hard cold man, with no romance in his character.\nHe had crossed from Regent Street through Hanover Square, and as he came out into Oxford Street, a poor wretched girl in thin clothing asked him for money. Would he give her something to get drink, so that for a moment she might feel warm?\nSuch midnight petitions were common, and he was passing on when she took hold of him.\n\"For love of God,\" she said, \"it's only a penny to get a glass of gin! Feel my hand, how cold it is.\" And she put it up against his face.\nHe looked round at her and saw that she was very young - sixteen, perhaps, at the most, and that she had once been exquisitely pretty. There still lingered about her eyes some remains of that look of innocence which had been hers twelve months since. And now, at midnight, in the streets, she was praying for a pennyworth of gin, as the only comfort she could expect!\n\"You are cold!\" said he, trying to speak cheerily.\n\"Cold!\" said she, striving to wrap herself closer in her rags, as she shivered. \"Oh God! if you knew what it was to be as cold as I am! I have nothing in the world - not a hole to lie in!\"\n\"We are alike then,\" said Burgo, with a low laugh. \"I also have nothing.\"\n\"You, poor!\" she said, looking up into his face. \"Gracious; how beautiful you are! Such as you are never poor.\"\nHe laughed again - in a different tone. He always laughed when anyone told him of his beauty.\n\"I am a deal poorer than you, my girl,\" he said. \"You have nothing. I have thirty thousand pounds worse than nothing. But come along, and I will get you something to eat.\"\n\"Will you?\" said she, eagerly.\nHe took her to a public-house and gave her bread and meat and beer, and stood by her while she ate it. She was shy with him then, so he turned his back to her, but still spoke to her a word or two as she ate. The woman at the bar who served him looked at him wonderingly; and the pot-boy stared at him, and so did the waterman from the cab-stand, and the women who came in for gin. He was untroubled by them; he paid for the girl's meal and then walked with her out of the shop.\n\"And now,\" said he, \"what must I do with you? If I give you a shilling can you get a bed?\" She told him that she could get a bed for sixpence. \"Then keep the other sixpence for your breakfast,\" said he. \"But you must promise me that you will buy no gin tonight.\" She promised him, and then she took his hand and pressed it to her lips.\n\"I wish I might once see you again,\" she said, \"because you are so good and so beautiful.\" He laughed again cheerily, and walked on. She stood looking at him till he was out of sight, and as she moved away she exclaimed to herself again: \"Gracious, how beautiful he was!\"\nPoor Burgo! All his life, people had loved him and tried to cherish him. Yet to what a state had he come! Poor Burgo! If his face had been less godlike, maybe things would have gone better with him. A sweeter-tempered man never lived. He had barely enough money to take him to his aunt's house at Monkshade the next morning. Nevertheless, he had given half a crown to comfort the poor creature who had spoken to him in the street.",
        "paragraph_chars": [
            [
                0,
                225
            ],
            [
                225,
                522
            ],
            [
                522,
                961
            ],
            [
                961,
                1408
            ],
            [
                1408,
                1501
            ],
            [
                1501,
                1643
            ],
            [
                1643,
                1689
            ],
            [
                1689,
                1917
            ],
            [
                1917,
                2077
            ],
            [
                2077,
                2227
            ],
            [
                2227,
                2387
            ],
            [
                2387,
                2416
            ],
            [
                2416,
                2495
            ],
            [
                2495,
                2891
            ],
            [
                2891,
                2969
            ],
            [
                2969,
                3124
            ],
            [
                3124,
                3209
            ],
            [
                3209,
                3359
            ],
            [
                3359,
                3413
            ],
            [
                3413,
                3520
            ],
            [
                3520,
                3591
            ],
            [
                3591,
                3759
            ],
            [
                3759,
                3806
            ],
            [
                3806,
                3813
            ],
            [
                3813,
                3838
            ],
            [
                3838,
                4138
            ],
            [
                4138,
                4178
            ],
            [
                4178,
                4192
            ],
            [
                4192,
                4218
            ],
            [
                4218,
                4249
            ],
            [
                4249,
                4269
            ],
            [
                4269,
                4382
            ],
            [
                4382,
                4568
            ],
            [
                4568,
                4764
            ],
            [
                4764,
                4803
            ],
            [
                4803,
                4947
            ],
            [
                4947,
                5029
            ],
            [
                5029,
                5223
            ],
            [
                5223,
                5265
            ],
            [
                5265,
                5318
            ],
            [
                5318,
                5350
            ],
            [
                5350,
                5449
            ],
            [
                5449,
                5731
            ],
            [
                5731,
                5925
            ],
            [
                5925,
                6030
            ],
            [
                6030,
                6139
            ],
            [
                6139,
                6967
            ],
            [
                6967,
                7203
            ],
            [
                7203,
                7805
            ],
            [
                7805,
                8237
            ],
            [
                8237,
                8957
            ],
            [
                8957,
                9264
            ],
            [
                9264,
                9550
            ],
            [
                9550,
                9741
            ],
            [
                9741,
                9981
            ],
            [
                9981,
                10067
            ],
            [
                10067,
                10205
            ],
            [
                10205,
                10573
            ],
            [
                10573,
                10624
            ],
            [
                10624,
                10813
            ],
            [
                10813,
                10887
            ],
            [
                10887,
                10999
            ],
            [
                10999,
                11093
            ],
            [
                11093,
                11265
            ],
            [
                11265,
                11296
            ],
            [
                11296,
                11775
            ],
            [
                11775,
                12111
            ],
            [
                12111,
                12383
            ],
            [
                12383,
                12813
            ]
        ],
        "segment_chars": [
            [
                0,
                107
            ],
            [
                107,
                225
            ],
            [
                225,
                260
            ],
            [
                260,
                384
            ],
            [
                384,
                522
            ],
            [
                522,
                553
            ],
            [
                553,
                719
            ],
            [
                719,
                803
            ],
            [
                803,
                863
            ],
            [
                863,
                930
            ],
            [
                930,
                961
            ],
            [
                961,
                1047
            ],
            [
                1047,
                1116
            ],
            [
                1116,
                1261
            ],
            [
                1261,
                1408
            ],
            [
                1408,
                1501
            ],
            [
                1501,
                1573
            ],
            [
                1573,
                1643
            ],
            [
                1643,
                1689
            ],
            [
                1689,
                1729
            ],
            [
                1729,
                1826
            ],
            [
                1826,
                1917
            ],
            [
                1917,
                1980
            ],
            [
                1980,
                2077
            ],
            [
                2077,
                2140
            ],
            [
                2140,
                2227
            ],
            [
                2227,
                2292
            ],
            [
                2292,
                2387
            ],
            [
                2387,
                2416
            ],
            [
                2416,
                2495
            ],
            [
                2495,
                2514
            ],
            [
                2514,
                2586
            ],
            [
                2586,
                2696
            ],
            [
                2696,
                2762
            ],
            [
                2762,
                2787
            ],
            [
                2787,
                2800
            ],
            [
                2800,
                2827
            ],
            [
                2827,
                2891
            ],
            [
                2891,
                2903
            ],
            [
                2903,
                2969
            ],
            [
                2969,
                3011
            ],
            [
                3011,
                3124
            ],
            [
                3124,
                3149
            ],
            [
                3149,
                3209
            ],
            [
                3209,
                3269
            ],
            [
                3269,
                3359
            ],
            [
                3359,
                3413
            ],
            [
                3413,
                3430
            ],
            [
                3430,
                3520
            ],
            [
                3520,
                3591
            ],
            [
                3591,
                3620
            ],
            [
                3620,
                3634
            ],
            [
                3634,
                3733
            ],
            [
                3733,
                3759
            ],
            [
                3759,
                3806
            ],
            [
                3806,
                3813
            ],
            [
                3813,
                3838
            ],
            [
                3838,
                3859
            ],
            [
                3859,
                3999
            ],
            [
                3999,
                4061
            ],
            [
                4061,
                4099
            ],
            [
                4099,
                4138
            ],
            [
                4138,
                4178
            ],
            [
                4178,
                4192
            ],
            [
                4192,
                4218
            ],
            [
                4218,
                4249
            ],
            [
                4249,
                4269
            ],
            [
                4269,
                4323
            ],
            [
                4323,
                4382
            ],
            [
                4382,
                4412
            ],
            [
                4412,
                4504
            ],
            [
                4504,
                4568
            ],
            [
                4568,
                4615
            ],
            [
                4615,
                4688
            ],
            [
                4688,
                4717
            ],
            [
                4717,
                4764
            ],
            [
                4764,
                4803
            ],
            [
                4803,
                4823
            ],
            [
                4823,
                4947
            ],
            [
                4947,
                4986
            ],
            [
                4986,
                5029
            ],
            [
                5029,
                5109
            ],
            [
                5109,
                5223
            ],
            [
                5223,
                5244
            ],
            [
                5244,
                5265
            ],
            [
                5265,
                5318
            ],
            [
                5318,
                5350
            ],
            [
                5350,
                5409
            ],
            [
                5409,
                5449
            ],
            [
                5449,
                5516
            ],
            [
                5516,
                5566
            ],
            [
                5566,
                5656
            ],
            [
                5656,
                5731
            ],
            [
                5731,
                5803
            ],
            [
                5803,
                5897
            ],
            [
                5897,
                5925
            ],
            [
                5925,
                5941
            ],
            [
                5941,
                6030
            ],
            [
                6030,
                6044
            ],
            [
                6044,
                6066
            ],
            [
                6066,
                6139
            ],
            [
                6139,
                6224
            ],
            [
                6224,
                6334
            ],
            [
                6334,
                6554
            ],
            [
                6554,
                6589
            ],
            [
                6589,
                6623
            ],
            [
                6623,
                6758
            ],
            [
                6758,
                6838
            ],
            [
                6838,
                6967
            ],
            [
                6967,
                7050
            ],
            [
                7050,
                7137
            ],
            [
                7137,
                7203
            ],
            [
                7203,
                7265
            ],
            [
                7265,
                7386
            ],
            [
                7386,
                7537
            ],
            [
                7537,
                7569
            ],
            [
                7569,
                7805
            ],
            [
                7805,
                7906
            ],
            [
                7906,
                8000
            ],
            [
                8000,
                8105
            ],
            [
                8105,
                8237
            ],
            [
                8237,
                8299
            ],
            [
                8299,
                8431
            ],
            [
                8431,
                8571
            ],
            [
                8571,
                8739
            ],
            [
                8739,
                8957
            ],
            [
                8957,
                9101
            ],
            [
                9101,
                9264
            ],
            [
                9264,
                9345
            ],
            [
                9345,
                9396
            ],
            [
                9396,
                9495
            ],
            [
                9495,
                9550
            ],
            [
                9550,
                9625
            ],
            [
                9625,
                9653
            ],
            [
                9653,
                9741
            ],
            [
                9741,
                9897
            ],
            [
                9897,
                9981
            ],
            [
                9981,
                10067
            ],
            [
                10067,
                10138
            ],
            [
                10138,
                10169
            ],
            [
                10169,
                10205
            ],
            [
                10205,
                10340
            ],
            [
                10340,
                10456
            ],
            [
                10456,
                10573
            ],
            [
                10573,
                10589
            ],
            [
                10589,
                10624
            ],
            [
                10624,
                10632
            ],
            [
                10632,
                10704
            ],
            [
                10704,
                10713
            ],
            [
                10713,
                10760
            ],
            [
                10760,
                10813
            ],
            [
                10813,
                10864
            ],
            [
                10864,
                10887
            ],
            [
                10887,
                10900
            ],
            [
                10900,
                10936
            ],
            [
                10936,
                10970
            ],
            [
                10970,
                10999
            ],
            [
                10999,
                11039
            ],
            [
                11039,
                11093
            ],
            [
                11093,
                11142
            ],
            [
                11142,
                11161
            ],
            [
                11161,
                11211
            ],
            [
                11211,
                11265
            ],
            [
                11265,
                11277
            ],
            [
                11277,
                11296
            ],
            [
                11296,
                11399
            ],
            [
                11399,
                11505
            ],
            [
                11505,
                11678
            ],
            [
                11678,
                11775
            ],
            [
                11775,
                11821
            ],
            [
                11821,
                11866
            ],
            [
                11866,
                11918
            ],
            [
                11918,
                11978
            ],
            [
                11978,
                12038
            ],
            [
                12038,
                12111
            ],
            [
                12111,
                12202
            ],
            [
                12202,
                12244
            ],
            [
                12244,
                12383
            ],
            [
                12383,
                12395
            ],
            [
                12395,
                12456
            ],
            [
                12456,
                12489
            ],
            [
                12489,
                12501
            ],
            [
                12501,
                12582
            ],
            [
                12582,
                12618
            ],
            [
                12618,
                12708
            ],
            [
                12708,
                12813
            ]
        ],
        "overlap_chars": [
            [
                0,
                107
            ],
            [
                107,
                173
            ],
            [
                174,
                181
            ],
            [
                182,
                184
            ],
            [
                185,
                192
            ],
            [
                193,
                196
            ],
            [
                197,
                201
            ],
            [
                205,
                210
            ],
            [
                211,
                223
            ],
            [
                223,
                224
            ],
            [
                232,
                233
            ],
            [
                234,
                241
            ],
            [
                246,
                249
            ],
            [
                250,
                258
            ],
            [
                258,
                260
            ],
            [
                260,
                328
            ],
            [
                329,
                384
            ],
            [
                384,
                396
            ],
            [
                397,
                410
            ],
            [
                411,
                420
            ],
            [
                430,
                433
            ],
            [
                439,
                464
            ],
            [
                465,
                470
            ],
            [
                476,
                520
            ],
            [
                520,
                521
            ],
            [
                522,
                553
            ],
            [
                553,
                580
            ],
            [
                581,
                584
            ],
            [
                585,
                607
            ],
            [
                608,
                613
            ],
            [
                614,
                617
            ],
            [
                618,
                647
            ],
            [
                650,
                651
            ],
            [
                657,
                674
            ],
            [
                675,
                701
            ],
            [
                702,
                717
            ],
            [
                717,
                719
            ],
            [
                728,
                733
            ],
            [
                738,
                741
            ],
            [
                751,
                754
            ],
            [
                761,
                764
            ],
            [
                765,
                772
            ],
            [
                772,
                773
            ],
            [
                774,
                777
            ],
            [
                778,
                782
            ],
            [
                782,
                803
            ],
            [
                803,
                820
            ],
            [
                821,
                863
            ],
            [
                863,
                865
            ],
            [
                875,
                877
            ],
            [
                878,
                881
            ],
            [
                882,
                889
            ],
            [
                890,
                894
            ],
            [
                895,
                928
            ],
            [
                928,
                930
            ],
            [
                930,
                960
            ],
            [
                961,
                990
            ],
            [
                998,
                1001
            ],
            [
                1006,
                1034
            ],
            [
                1039,
                1047
            ],
            [
                1047,
                1091
            ],
            [
                1092,
                1095
            ],
            [
                1101,
                1106
            ],
            [
                1114,
                1116
            ],
            [
                1116,
                1134
            ],
            [
                1140,
                1209
            ],
            [
                1214,
                1250
            ],
            [
                1256,
                1261
            ],
            [
                1261,
                1275
            ],
            [
                1276,
                1279
            ],
            [
                1280,
                1299
            ],
            [
                1310,
                1315
            ],
            [
                1318,
                1406
            ],
            [
                1406,
                1407
            ],
            [
                1408,
                1501
            ],
            [
                1501,
                1573
            ],
            [
                1574,
                1618
            ],
            [
                1619,
                1643
            ],
            [
                1643,
                1656
            ],
            [
                1662,
                1689
            ],
            [
                1689,
                1702
            ],
            [
                1702,
                1723
            ],
            [
                1727,
                1729
            ],
            [
                1729,
                1753
            ],
            [
                1761,
                1826
            ],
            [
                1826,
                1911
            ],
            [
                1914,
                1917
            ],
            [
                1918,
                1919
            ],
            [
                1925,
                1933
            ],
            [
                1939,
                1980
            ],
            [
                1980,
                2074
            ],
            [
                2077,
                2138
            ],
            [
                2138,
                2140
            ],
            [
                2141,
                2227
            ],
            [
                2227,
                2292
            ],
            [
                2292,
                2337
            ],
            [
                2337,
                2387
            ],
            [
                2387,
                2416
            ],
            [
                2416,
                2495
            ],
            [
                2495,
                2514
            ],
            [
                2514,
                2561
            ],
            [
                2562,
                2586
            ],
            [
                2586,
                2688
            ],
            [
                2689,
                2696
            ],
            [
                2696,
                2717
            ],
            [
                2718,
                2722
            ],
            [
                2723,
                2726
            ],
            [
                2729,
                2762
            ],
            [
                2762,
                2787
            ],
            [
                2787,
                2800
            ],
            [
                2800,
                2827
            ],
            [
                2827,
                2863
            ],
            [
                2866,
                2888
            ],
            [
                2891,
                2903
            ],
            [
                2903,
                2952
            ],
            [
                2963,
                2969
            ],
            [
                2969,
                2990
            ],
            [
                2991,
                2995
            ],
            [
                2996,
                3009
            ],
            [
                3009,
                3011
            ],
            [
                3011,
                3031
            ],
            [
                3045,
                3095
            ],
            [
                3096,
                3103
            ],
            [
                3104,
                3124
            ],
            [
                3124,
                3149
            ],
            [
                3149,
                3209
            ],
            [
                3209,
                3236
            ],
            [
                3237,
                3240
            ],
            [
                3241,
                3255
            ],
            [
                3267,
                3269
            ],
            [
                3269,
                3350
            ],
            [
                3356,
                3359
            ],
            [
                3359,
                3413
            ],
            [
                3413,
                3430
            ],
            [
                3430,
                3443
            ],
            [
                3444,
                3445
            ],
            [
                3446,
                3451
            ],
            [
                3452,
                3499
            ],
            [
                3500,
                3501
            ],
            [
                3508,
                3520
            ],
            [
                3520,
                3521
            ],
            [
                3528,
                3565
            ],
            [
                3565,
                3591
            ],
            [
                3591,
                3611
            ],
            [
                3612,
                3620
            ],
            [
                3620,
                3634
            ],
            [
                3634,
                3652
            ],
            [
                3653,
                3665
            ],
            [
                3666,
                3733
            ],
            [
                3733,
                3759
            ],
            [
                3759,
                3806
            ],
            [
                3806,
                3813
            ],
            [
                3813,
                3838
            ],
            [
                3838,
                3859
            ],
            [
                3859,
                3891
            ],
            [
                3900,
                3997
            ],
            [
                3999,
                4061
            ],
            [
                4061,
                4097
            ],
            [
                4097,
                4099
            ],
            [
                4099,
                4138
            ],
            [
                4138,
                4178
            ],
            [
                4178,
                4192
            ],
            [
                4192,
                4218
            ],
            [
                4219,
                4246
            ],
            [
                4246,
                4249
            ],
            [
                4249,
                4250
            ],
            [
                4250,
                4269
            ],
            [
                4269,
                4323
            ],
            [
                4323,
                4379
            ],
            [
                4382,
                4412
            ],
            [
                4412,
                4447
            ],
            [
                4448,
                4458
            ],
            [
                4459,
                4460
            ],
            [
                4470,
                4477
            ],
            [
                4486,
                4502
            ],
            [
                4502,
                4504
            ],
            [
                4504,
                4507
            ],
            [
                4513,
                4524
            ],
            [
                4525,
                4528
            ],
            [
                4535,
                4568
            ],
            [
                4568,
                4614
            ],
            [
                4615,
                4616
            ],
            [
                4616,
                4646
            ],
            [
                4648,
                4658
            ],
            [
                4659,
                4663
            ],
            [
                4664,
                4688
            ],
            [
                4688,
                4717
            ],
            [
                4717,
                4761
            ],
            [
                4761,
                4764
            ],
            [
                4764,
                4803
            ],
            [
                4803,
                4821
            ],
            [
                4821,
                4823
            ],
            [
                4823,
                4944
            ],
            [
                4947,
                4986
            ],
            [
                4986,
                5029
            ],
            [
                5029,
                5031
            ],
            [
                5036,
                5109
            ],
            [
                5109,
                5197
            ],
            [
                5200,
                5223
            ],
            [
                5223,
                5244
            ],
            [
                5244,
                5255
            ],
            [
                5262,
                5265
            ],
            [
                5265,
                5283
            ],
            [
                5288,
                5318
            ],
            [
                5318,
                5350
            ],
            [
                5350,
                5377
            ],
            [
                5378,
                5409
            ],
            [
                5409,
                5449
            ],
            [
                5449,
                5514
            ],
            [
                5514,
                5516
            ],
            [
                5516,
                5544
            ],
            [
                5545,
                5552
            ],
            [
                5553,
                5564
            ],
            [
                5564,
                5566
            ],
            [
                5570,
                5572
            ],
            [
                5577,
                5582
            ],
            [
                5587,
                5602
            ],
            [
                5608,
                5614
            ],
            [
                5623,
                5633
            ],
            [
                5633,
                5642
            ],
            [
                5643,
                5651
            ],
            [
                5654,
                5656
            ],
            [
                5656,
                5730
            ],
            [
                5731,
                5803
            ],
            [
                5803,
                5843
            ],
            [
                5843,
                5856
            ],
            [
                5857,
                5861
            ],
            [
                5862,
                5897
            ],
            [
                5897,
                5925
            ],
            [
                5925,
                5941
            ],
            [
                5941,
                5944
            ],
            [
                5944,
                5952
            ],
            [
                5953,
                5979
            ],
            [
                5980,
                6014
            ],
            [
                6018,
                6030
            ],
            [
                6030,
                6031
            ],
            [
                6042,
                6044
            ],
            [
                6044,
                6063
            ],
            [
                6066,
                6139
            ],
            [
                6139,
                6222
            ],
            [
                6222,
                6224
            ],
            [
                6224,
                6248
            ],
            [
                6249,
                6270
            ],
            [
                6271,
                6281
            ],
            [
                6282,
                6290
            ],
            [
                6290,
                6298
            ],
            [
                6299,
                6334
            ],
            [
                6334,
                6355
            ],
            [
                6356,
                6476
            ],
            [
                6477,
                6489
            ],
            [
                6490,
                6531
            ],
            [
                6534,
                6554
            ],
            [
                6554,
                6560
            ],
            [
                6561,
                6571
            ],
            [
                6584,
                6589
            ],
            [
                6599,
                6605
            ],
            [
                6608,
                6616
            ],
            [
                6621,
                6623
            ],
            [
                6623,
                6675
            ],
            [
                6681,
                6691
            ],
            [
                6691,
                6692
            ],
            [
                6693,
                6696
            ],
            [
                6697,
                6704
            ],
            [
                6712,
                6756
            ],
            [
                6756,
                6758
            ],
            [
                6758,
                6801
            ],
            [
                6802,
                6838
            ],
            [
                6838,
                6847
            ],
            [
                6848,
                6897
            ],
            [
                6900,
                6907
            ],
            [
                6907,
                6908
            ],
            [
                6909,
                6916
            ],
            [
                6926,
                6967
            ],
            [
                6967,
                7019
            ],
            [
                7020,
                7050
            ],
            [
                7050,
                7104
            ],
            [
                7105,
                7137
            ],
            [
                7137,
                7202
            ],
            [
                7203,
                7225
            ],
            [
                7226,
                7236
            ],
            [
                7238,
                7252
            ],
            [
                7253,
                7265
            ],
            [
                7265,
                7297
            ],
            [
                7298,
                7300
            ],
            [
                7301,
                7307
            ],
            [
                7308,
                7322
            ],
            [
                7326,
                7330
            ],
            [
                7334,
                7339
            ],
            [
                7340,
                7343
            ],
            [
                7344,
                7349
            ],
            [
                7350,
                7353
            ],
            [
                7354,
                7386
            ],
            [
                7386,
                7400
            ],
            [
                7401,
                7437
            ],
            [
                7438,
                7441
            ],
            [
                7448,
                7472
            ],
            [
                7472,
                7473
            ],
            [
                7474,
                7493
            ],
            [
                7494,
                7537
            ],
            [
                7537,
                7567
            ],
            [
                7569,
                7572
            ],
            [
                7573,
                7584
            ],
            [
                7585,
                7680
            ],
            [
                7681,
                7707
            ],
            [
                7708,
                7739
            ],
            [
                7740,
                7745
            ],
            [
                7746,
                7748
            ],
            [
                7749,
                7761
            ],
            [
                7762,
                7772
            ],
            [
                7775,
                7803
            ],
            [
                7803,
                7804
            ],
            [
                7809,
                7812
            ],
            [
                7817,
                7819
            ],
            [
                7837,
                7840
            ],
            [
                7841,
                7906
            ],
            [
                7906,
                7933
            ],
            [
                7940,
                8000
            ],
            [
                8000,
                8002
            ],
            [
                8012,
                8016
            ],
            [
                8029,
                8103
            ],
            [
                8103,
                8105
            ],
            [
                8105,
                8108
            ],
            [
                8117,
                8120
            ],
            [
                8139,
                8157
            ],
            [
                8157,
                8158
            ],
            [
                8159,
                8235
            ],
            [
                8235,
                8237
            ],
            [
                8237,
                8249
            ],
            [
                8250,
                8299
            ],
            [
                8299,
                8302
            ],
            [
                8321,
                8359
            ],
            [
                8375,
                8409
            ],
            [
                8415,
                8431
            ],
            [
                8431,
                8538
            ],
            [
                8550,
                8552
            ],
            [
                8557,
                8571
            ],
            [
                8571,
                8575
            ],
            [
                8576,
                8722
            ],
            [
                8723,
                8727
            ],
            [
                8737,
                8739
            ],
            [
                8739,
                8763
            ],
            [
                8780,
                8784
            ],
            [
                8785,
                8815
            ],
            [
                8818,
                8824
            ],
            [
                8825,
                8827
            ],
            [
                8828,
                8835
            ],
            [
                8836,
                8856
            ],
            [
                8870,
                8907
            ],
            [
                8908,
                8930
            ],
            [
                8931,
                8935
            ],
            [
                8936,
                8955
            ],
            [
                8955,
                8957
            ],
            [
                8957,
                8959
            ],
            [
                8966,
                8976
            ],
            [
                8977,
                8979
            ],
            [
                8986,
                9101
            ],
            [
                9105,
                9117
            ],
            [
                9118,
                9122
            ],
            [
                9132,
                9138
            ],
            [
                9142,
                9145
            ],
            [
                9146,
                9149
            ],
            [
                9150,
                9154
            ],
            [
                9156,
                9159
            ],
            [
                9160,
                9168
            ],
            [
                9188,
                9212
            ],
            [
                9217,
                9226
            ],
            [
                9227,
                9263
            ],
            [
                9264,
                9286
            ],
            [
                9287,
                9292
            ],
            [
                9298,
                9331
            ],
            [
                9332,
                9343
            ],
            [
                9343,
                9345
            ],
            [
                9345,
                9384
            ],
            [
                9385,
                9396
            ],
            [
                9396,
                9423
            ],
            [
                9430,
                9438
            ],
            [
                9440,
                9443
            ],
            [
                9444,
                9456
            ],
            [
                9457,
                9495
            ],
            [
                9495,
                9507
            ],
            [
                9508,
                9549
            ],
            [
                9550,
                9623
            ],
            [
                9623,
                9625
            ],
            [
                9625,
                9651
            ],
            [
                9651,
                9653
            ],
            [
                9653,
                9706
            ],
            [
                9712,
                9714
            ],
            [
                9715,
                9740
            ],
            [
                9741,
                9817
            ],
            [
                9818,
                9858
            ],
            [
                9859,
                9866
            ],
            [
                9876,
                9897
            ],
            [
                9897,
                9974
            ],
            [
                9979,
                9980
            ],
            [
                9981,
                10016
            ],
            [
                10016,
                10039
            ],
            [
                10045,
                10048
            ],
            [
                10049,
                10066
            ],
            [
                10067,
                10097
            ],
            [
                10097,
                10138
            ],
            [
                10138,
                10151
            ],
            [
                10152,
                10169
            ],
            [
                10169,
                10176
            ],
            [
                10177,
                10205
            ],
            [
                10205,
                10259
            ],
            [
                10269,
                10314
            ],
            [
                10315,
                10340
            ],
            [
                10340,
                10404
            ],
            [
                10415,
                10434
            ],
            [
                10435,
                10456
            ],
            [
                10456,
                10480
            ],
            [
                10481,
                10558
            ],
            [
                10559,
                10573
            ],
            [
                10573,
                10589
            ],
            [
                10589,
                10613
            ],
            [
                10614,
                10624
            ],
            [
                10624,
                10632
            ],
            [
                10632,
                10641
            ],
            [
                10642,
                10702
            ],
            [
                10704,
                10713
            ],
            [
                10713,
                10760
            ],
            [
                10760,
                10787
            ],
            [
                10790,
                10813
            ],
            [
                10813,
                10852
            ],
            [
                10853,
                10864
            ],
            [
                10864,
                10884
            ],
            [
                10887,
                10891
            ],
            [
                10893,
                10899
            ],
            [
                10900,
                10908
            ],
            [
                10918,
                10936
            ],
            [
                10936,
                10970
            ],
            [
                10970,
                10999
            ],
            [
                10999,
                11015
            ],
            [
                11018,
                11039
            ],
            [
                11039,
                11061
            ],
            [
                11069,
                11092
            ],
            [
                11093,
                11142
            ],
            [
                11142,
                11161
            ],
            [
                11161,
                11211
            ],
            [
                11211,
                11265
            ],
            [
                11265,
                11277
            ],
            [
                11277,
                11295
            ],
            [
                11296,
                11399
            ],
            [
                11399,
                11425
            ],
            [
                11429,
                11431
            ],
            [
                11432,
                11505
            ],
            [
                11505,
                11566
            ],
            [
                11566,
                11583
            ],
            [
                11584,
                11597
            ],
            [
                11597,
                11598
            ],
            [
                11599,
                11602
            ],
            [
                11610,
                11641
            ],
            [
                11643,
                11646
            ],
            [
                11651,
                11676
            ],
            [
                11676,
                11678
            ],
            [
                11678,
                11680
            ],
            [
                11681,
                11684
            ],
            [
                11699,
                11703
            ],
            [
                11705,
                11707
            ],
            [
                11708,
                11712
            ],
            [
                11717,
                11725
            ],
            [
                11728,
                11732
            ],
            [
                11733,
                11774
            ],
            [
                11775,
                11821
            ],
            [
                11821,
                11866
            ],
            [
                11866,
                11918
            ],
            [
                11918,
                11978
            ],
            [
                11978,
                12027
            ],
            [
                12035,
                12038
            ],
            [
                12038,
                12064
            ],
            [
                12065,
                12073
            ],
            [
                12074,
                12082
            ],
            [
                12083,
                12110
            ],
            [
                12111,
                12202
            ],
            [
                12202,
                12242
            ],
            [
                12242,
                12244
            ],
            [
                12244,
                12298
            ],
            [
                12299,
                12316
            ],
            [
                12317,
                12347
            ],
            [
                12349,
                12382
            ],
            [
                12383,
                12395
            ],
            [
                12395,
                12398
            ],
            [
                12403,
                12407
            ],
            [
                12416,
                12433
            ],
            [
                12440,
                12456
            ],
            [
                12460,
                12489
            ],
            [
                12489,
                12501
            ],
            [
                12504,
                12512
            ],
            [
                12513,
                12516
            ],
            [
                12517,
                12521
            ],
            [
                12522,
                12534
            ],
            [
                12534,
                12535
            ],
            [
                12542,
                12582
            ],
            [
                12582,
                12604
            ],
            [
                12605,
                12616
            ],
            [
                12616,
                12618
            ],
            [
                12618,
                12631
            ],
            [
                12639,
                12644
            ],
            [
                12645,
                12656
            ],
            [
                12657,
                12689
            ],
            [
                12690,
                12706
            ],
            [
                12706,
                12708
            ],
            [
                12708,
                12721
            ],
            [
                12722,
                12813
            ]
        ],
        "row_chars": [
            [
                0,
                107
            ],
            [
                107,
                225
            ],
            [
                225,
                260
            ],
            [
                260,
                384
            ],
            [
                384,
                522
            ],
            [
                522,
                553
            ],
            [
                553,
                719
            ],
            [
                719,
                803
            ],
            [
                803,
                863
            ],
            [
                863,
                930
            ],
            [
                930,
                961
            ],
            [
                961,
                961
            ],
            [
                961,
                1047
            ],
            [
                1047,
                1047
            ],
            [
                1047,
                1047
            ],
            [
                1047,
                1116
            ],
            [
                1116,
                1261
            ],
            [
                1261,
                1408
            ],
            [
                1408,
                1501
            ],
            [
                1501,
                1573
            ],
            [
                1573,
                1573
            ],
            [
                1573,
                1643
            ],
            [
                1643,
                1689
            ],
            [
                1689,
                1729
            ],
            [
                1729,
                1826
            ],
            [
                1826,
                1917
            ],
            [
                1917,
                1917
            ],
            [
                1917,
                1917
            ],
            [
                1917,
                1917
            ],
            [
                1917,
                1917
            ],
            [
                1917,
                1980
            ],
            [
                1980,
                2077
            ],
            [
                2077,
                2077
            ],
            [
                2077,
                2140
            ],
            [
                2140,
                2227
            ],
            [
                2227,
                2292
            ],
            [
                2292,
                2387
            ],
            [
                2387,
                2416
            ],
            [
                2416,
                2495
            ],
            [
                2495,
                2514
            ],
            [
                2514,
                2586
            ],
            [
                2586,
                2586
            ],
            [
                2586,
                2696
            ],
            [
                2696,
                2762
            ],
            [
                2762,
                2762
            ],
            [
                2762,
                2762
            ],
            [
                2762,
                2787
            ],
            [
                2787,
                2800
            ],
            [
                2800,
                2800
            ],
            [
                2800,
                2827
            ],
            [
                2827,
                2891
            ],
            [
                2891,
                2903
            ],
            [
                2903,
                2969
            ],
            [
                2969,
                3011
            ],
            [
                3011,
                3011
            ],
            [
                3011,
                3011
            ],
            [
                3011,
                3124
            ],
            [
                3124,
                3149
            ],
            [
                3149,
                3209
            ],
            [
                3209,
                3269
            ],
            [
                3269,
                3269
            ],
            [
                3269,
                3359
            ],
            [
                3359,
                3413
            ],
            [
                3413,
                3430
            ],
            [
                3430,
                3520
            ],
            [
                3520,
                3591
            ],
            [
                3591,
                3620
            ],
            [
                3620,
                3634
            ],
            [
                3634,
                3733
            ],
            [
                3733,
                3759
            ],
            [
                3759,
                3806
            ],
            [
                3806,
                3813
            ],
            [
                3813,
                3838
            ],
            [
                3838,
                3859
            ],
            [
                3859,
                3999
            ],
            [
                3999,
                3999
            ],
            [
                3999,
                3999
            ],
            [
                3999,
                4061
            ],
            [
                4061,
                4099
            ],
            [
                4099,
                4138
            ],
            [
                4138,
                4178
            ],
            [
                4178,
                4192
            ],
            [
                4192,
                4218
            ],
            [
                4218,
                4218
            ],
            [
                4218,
                4249
            ],
            [
                4249,
                4269
            ],
            [
                4269,
                4323
            ],
            [
                4323,
                4382
            ],
            [
                4382,
                4382
            ],
            [
                4382,
                4382
            ],
            [
                4382,
                4412
            ],
            [
                4412,
                4504
            ],
            [
                4504,
                4504
            ],
            [
                4504,
                4568
            ],
            [
                4568,
                4615
            ],
            [
                4615,
                4615
            ],
            [
                4615,
                4615
            ],
            [
                4615,
                4688
            ],
            [
                4688,
                4717
            ],
            [
                4717,
                4764
            ],
            [
                4764,
                4803
            ],
            [
                4803,
                4823
            ],
            [
                4823,
                4947
            ],
            [
                4947,
                4947
            ],
            [
                4947,
                4986
            ],
            [
                4986,
                5029
            ],
            [
                5029,
                5109
            ],
            [
                5109,
                5109
            ],
            [
                5109,
                5223
            ],
            [
                5223,
                5244
            ],
            [
                5244,
                5265
            ],
            [
                5265,
                5318
            ],
            [
                5318,
                5350
            ],
            [
                5350,
                5409
            ],
            [
                5409,
                5449
            ],
            [
                5449,
                5449
            ],
            [
                5449,
                5449
            ],
            [
                5449,
                5449
            ],
            [
                5449,
                5449
            ],
            [
                5449,
                5516
            ],
            [
                5516,
                5516
            ],
            [
                5516,
                5566
            ],
            [
                5566,
                5566
            ],
            [
                5566,
                5656
            ],
            [
                5656,
                5731
            ],
            [
                5731,
                5731
            ],
            [
                5731,
                5803
            ],
            [
                5803,
                5897
            ],
            [
                5897,
                5925
            ],
            [
                5925,
                5941
            ],
            [
                5941,
                6030
            ],
            [
                6030,
                6044
            ],
            [
                6044,
                6066
            ],
            [
                6066,
                6066
            ],
            [
                6066,
                6066
            ],
            [
                6066,
                6066
            ],
            [
                6066,
                6139
            ],
            [
                6139,
                6224
            ],
            [
                6224,
                6334
            ],
            [
                6334,
                6554
            ],
            [
                6554,
                6554
            ],
            [
                6554,
                6554
            ],
            [
                6554,
                6589
            ],
            [
                6589,
                6623
            ],
            [
                6623,
                6758
            ],
            [
                6758,
                6838
            ],
            [
                6838,
                6967
            ],
            [
                6967,
                7050
            ],
            [
                7050,
                7050
            ],
            [
                7050,
                7137
            ],
            [
                7137,
                7203
            ],
            [
                7203,
                7203
            ],
            [
                7203,
                7265
            ],
            [
                7265,
                7386
            ],
            [
                7386,
                7537
            ],
            [
                7537,
                7569
            ],
            [
                7569,
                7805
            ],
            [
                7805,
                7805
            ],
            [
                7805,
                7805
            ],
            [
                7805,
                7805
            ],
            [
                7805,
                7906
            ],
            [
                7906,
                8000
            ],
            [
                8000,
                8105
            ],
            [
                8105,
                8105
            ],
            [
                8105,
                8105
            ],
            [
                8105,
                8105
            ],
            [
                8105,
                8237
            ],
            [
                8237,
                8237
            ],
            [
                8237,
                8237
            ],
            [
                8237,
                8299
            ],
            [
                8299,
                8431
            ],
            [
                8431,
                8571
            ],
            [
                8571,
                8571
            ],
            [
                8571,
                8739
            ],
            [
                8739,
                8957
            ],
            [
                8957,
                9101
            ],
            [
                9101,
                9264
            ],
            [
                9264,
                9264
            ],
            [
                9264,
                9345
            ],
            [
                9345,
                9396
            ],
            [
                9396,
                9495
            ],
            [
                9495,
                9550
            ],
            [
                9550,
                9550
            ],
            [
                9550,
                9550
            ],
            [
                9550,
                9625
            ],
            [
                9625,
                9653
            ],
            [
                9653,
                9741
            ],
            [
                9741,
                9741
            ],
            [
                9741,
                9897
            ],
            [
                9897,
                9981
            ],
            [
                9981,
                10067
            ],
            [
                10067,
                10138
            ],
            [
                10138,
                10169
            ],
            [
                10169,
                10205
            ],
            [
                10205,
                10340
            ],
            [
                10340,
                10456
            ],
            [
                10456,
                10573
            ],
            [
                10573,
                10589
            ],
            [
                10589,
                10624
            ],
            [
                10624,
                10632
            ],
            [
                10632,
                10713
            ],
            [
                10713,
                10760
            ],
            [
                10760,
                10813
            ],
            [
                10813,
                10864
            ],
            [
                10864,
                10887
            ],
            [
                10887,
                10887
            ],
            [
                10887,
                10936
            ],
            [
                10936,
                10970
            ],
            [
                10970,
                10999
            ],
            [
                10999,
                11039
            ],
            [
                11039,
                11093
            ],
            [
                11093,
                11142
            ],
            [
                11142,
                11161
            ],
            [
                11161,
                11211
            ],
            [
                11211,
                11265
            ],
            [
                11265,
                11277
            ],
            [
                11277,
                11296
            ],
            [
                11296,
                11296
            ],
            [
                11296,
                11399
            ],
            [
                11399,
                11505
            ],
            [
                11505,
                11678
            ],
            [
                11678,
                11775
            ],
            [
                11775,
                11821
            ],
            [
                11821,
                11866
            ],
            [
                11866,
                11918
            ],
            [
                11918,
                11978
            ],
            [
                11978,
                12038
            ],
            [
                12038,
                12111
            ],
            [
                12111,
                12202
            ],
            [
                12202,
                12244
            ],
            [
                12244,
                12383
            ],
            [
                12383,
                12383
            ],
            [
                12383,
                12383
            ],
            [
                12383,
                12383
            ],
            [
                12383,
                12395
            ],
            [
                12395,
                12456
            ],
            [
                12456,
                12489
            ],
            [
                12489,
                12501
            ],
            [
                12501,
                12582
            ],
            [
                12582,
                12618
            ],
            [
                12618,
                12708
            ],
            [
                12708,
                12813
            ]
        ]
    }
}