{
    "original": {
        "text": "Vavasor, as he sat alone in his room, after Fitzgerald had left him, began to think of the days in which he had before wished to assist his friend in his views with reference to Lady Glencora;--or rather he began to think of Alice's behaviour then, and of Alice's words. Alice had steadfastly refused to give any aid. No less likely assistant for such a purpose could have been selected. But she had been very earnest in declaring that it was Glencora's duty to stand by her promise to Burgo. \"He is a desperate spendthrift,\" Kate Vavasor had said to her. \"Then let her teach him to be otherwise,\" Alice had answered. \"That might have been a good reason for refusing his offer when he first made it; but it can be no excuse for untruth, now that she has told him that she loves him!\" \"If a woman,\" she had said again, \"won't venture her fortune for the man she loves, her love is not worth having.\" All this George Vavasor remembered now; and as he remembered it he asked himself whether the woman that had once loved him would venture her fortune for him still.\nThough his sister had pressed him on the subject with all the vehemence that she could use, he had hardly hitherto made up his mind that he really desired to marry Alice. There had grown upon him lately certain Bohemian propensities,--a love of absolute independence in his thoughts as well as actions,--which were antagonistic to marriage. He was almost inclined to think that marriage was an old-fashioned custom, fitted indeed well enough for the usual dull life of the world at large,--as many men both in heathen and in Christian ages have taught themselves to think of religion,--but which was not adapted to his advanced intelligence. If he loved any woman he loved his cousin Alice. If he thoroughly respected any woman he respected her. But that idea of tying himself down to a household was in itself distasteful to him. \"It is a thing terrible to think of,\" he once said to a congenial friend in these days of his life, \"that a man should give permission to a priest to tie him to another human being like a Siamese twin, so that all power of separate and solitary action should be taken from him for ever! The beasts of the field do not treat each other so badly. They neither drink themselves drunk, nor eat themselves stupid;--nor do they bind themselves together in a union which both would have to hate.\" In this way George Vavasor, trying to imitate the wisdom of the brutes, had taught himself some theories of a peculiar nature. But, nevertheless, as he thought of Alice Vavasor on this occasion, he began to feel that if a Siamese twin were necessary for him, she of all others was the woman to whom he would wish to be so bound.\nAnd if he did it at all, he must do it now. Under the joint instigation of himself and his sister,--as he thought, and perhaps not altogether without reason,--she had broken her engagement with Mr. Grey. That she would renew it again if left to herself, he believed probable. And then, despite that advanced intelligence which had taught him to regard all forms and ceremonies with the eye of a philosopher, he had still enough of human frailty about him to feel keenly alive to the pleasure of taking from John Grey the prize which John Grey had so nearly taken from him. If Alice could have been taught to think as he did as to the absurdity of those indissoluble ties, that would have been better. But nothing would have been more impossible than the teaching of such a lesson to his cousin Alice. George Vavasor was a man of courage, and dared do most things;--but he would not have dared to commence the teaching of such a lesson to her.\nAnd now, at this moment, what was his outlook into life generally? He had very high ambition, and a fair hope of gratifying it if he could only provide that things should go well with him for a year or so. He was still a poor man, having been once nearly a rich man; but still so much of the result of his nearly acquired riches remained to him, that on the strength of them he might probably find his way into Parliament. He had paid the cost of the last attempt, and might, in a great degree, carry on this present attempt on credit. If he succeeded there would be open to him a mode of life, agreeable in itself, and honourable among men. But how was he to bear the cost of this for the next year, or the next two years? His grandfather was still alive, and would probably live over that period. If he married Alice he would do so with no idea of cheating her out of her money. She should learn,--nay, she had already learned from his own lips,--how perilous was his enterprise. But he knew her to be a woman who would boldly risk all in money, though no consideration would induce her to stir a hair's breadth towards danger in reputation. Towards teaching her that doctrine at which I have hinted, he would not have dared to make an attempt; but he felt that he should have no repugnance to telling her that he wanted to spend all her money in the first year or two of their married life!\nHe was still in his arm-chair, thinking of all this, with that small untasted modicum of brandy and water beside him, when he heard some distant Lambeth clock strike three from over the river. Then he rose from his seat, and taking the candles in his hand, sat himself down at a writing-desk on the other side of the room. \"I needn't send it when it's written,\" he said to himself, \"and the chances are that I won't.\" Then he took his paper, and wrote as follows:--\nDEAR ALICE,\nThe time was when the privilege was mine of beginning my letters to you with a warmer show of love than the above word contains,--when I might and did call you dearest; but I lost that privilege through my own folly, and since that it has been accorded to another. But you have found,--with a thorough honesty of purpose than which I know nothing greater,--that it has behoved you to withdraw that privilege also. I need hardly say that I should not have written as I now write, had you not found it expedient to do as you have done. I now once again ask you to be my wife. In spite of all that passed in those old days,--of all the selfish folly of which I was then guilty, I think you know, and at the time knew, that I ever loved you. I claim to say for myself that my love to you was true from first to last, and I claim from you belief for that statement. Indeed I do not think that you ever doubted my love.\nNevertheless, when you told me that I might no longer hope to make you my wife, I had no word of remonstrance that I could utter. You acted as any woman would act whom love had not made a fool. Then came the episode of Mr. Grey; and bitter as have been my feelings whilst that engagement lasted, I never made any attempt to come between you and the life you had chosen. In saying this I do not forget the words which I spoke last summer at Basle, when, as far as I knew, you still intended that he should be your husband. But what I said then was nothing to that which, with much violence, I refrained from saying. Whether you remember those few words I cannot tell; but certainly you would not have remembered them,--would not even have noticed them,--had your heart been at Nethercoats.\nBut all this is nothing. You are now again a free woman; and once again I ask you to be my wife. We are both older than we were when we loved before, and will both be prone to think of marriage in a somewhat different light. Then personal love for each other was most in our thoughts. God forbid that it should not be much in our thoughts now! Perhaps I am deceiving myself in saying that it is not even now stronger in mine than any other consideration. But we have both reached that time of life, when it is probable that in any proposition of marriage we should think more of our adaptability to each other than we did before. For myself I know that there is much in my character and disposition to make me unfit to marry a woman of the common stamp. You know my mode of life, and what are my hopes and my chances of success. I run great risk of failing. It may be that I shall encounter ruin where I look for reputation and a career of honour. The chances are perhaps more in favour of ruin than of success. But, whatever may be the chances, I shall go on as long as any means of carrying on the fight are at my disposal. If you were my wife to-morrow I should expect to use your money, if it were needed, in struggling to obtain a seat in Parliament and a hearing there. I will hardly stoop to tell you that I do not ask you to be my wife for the sake of this aid;--but if you were to become my wife I should expect all your cooperation;--with your money, possibly, but certainly with your warmest spirit.\nAnd now, once again, Alice,--dearest Alice, will you be my wife? I have been punished, and I have kissed the rod,--as I never kissed any other rod. You cannot accuse my love. Since the time in which I might sit with my arm round your waist, I have sat with it round no other waist. Since your lips were mine, no other lips have been dear to me. Since you were my counsellor, I have had no other counsellor,--unless it be poor Kate, whose wish that we may at length be married is second in earnestness only to my own. Nor do I think you will doubt my repentance. Such repentance indeed claims no merit, as it has been the natural result of the loss which I have suffered. Providence has hitherto been very good to me in not having made that loss irremediable by your marriage with Mr. Grey. I wish you now to consider the matter well, and to tell me whether you can pardon me and still love me. Do I flatter myself when I feel that I doubt your pardon almost more than I doubt your love?\nThink of this thing in all its bearings before you answer me. I am so anxious that you should think of it that I will not expect your reply till this day week. It can hardly be your desire to go through life unmarried. I should say that it must be essential to your ambition that you should join your lot to that of some man the nature of whose aspirations would be like to your own. It is because this was not so as regarded him whose suit you had accepted, that you found yourself at last obliged to part from him. May I not say that with us there would be no such difference? It is because I believe that in this respect we are fitted for each other, as man and woman seldom are fitted, that I once again ask you to be my wife.\nThis will reach you at Vavasor, where you will now be with the old squire and Kate. I have told her nothing of my purpose in writing this letter. If it should be that your answer is such as I desire, I should use the opportunity of our re-engagement to endeavour to be reconciled to my grandfather. He has misunderstood me and has ill-used me. But I am ready to forgive that, if he will allow me to do so. In such case you and Kate would arrange that, and I would, if possible, go down to Vavasor while you are there. But I am galloping on a-head foolishly in thinking of this, and am counting up my wealth while the crockery in my basket is so very fragile. One word from you will decide whether or no I shall ever bring it into market.\nIf that word is to be adverse do not say anything of a meeting between me and the Squire. Under such circumstances it would be impossible. But, oh, Alice! do not let it be adverse. I think you love me. Your woman's pride towards me has been great and good and womanly; but it has had its way; and, if you love me, might now be taught to succumb.\nDear Alice, will you be my wife?\nYours, in any event, most affectionately,\nGEORGE VAVASOR.\nVavasor, when he had finished his letter, went back to his seat over the fire, and there he sat with it close at his hand for nearly an hour. Once or twice he took it up with fingers almost itching to throw it into the fire. He took it up and held the corners between his forefinger and thumb, throwing forward his hand towards the flame, as though willing that the letter should escape from him and perish if chance should so decide. But chance did not so decide, and the letter was put back upon the table at his elbow. Then when the hour was nearly over he read it again. \"I'll bet two to one that she gives way,\" he said to himself, as he put the sheet of paper back into the envelope. \"Women are such out-and-out fools.\" Then he took his candle, and carrying his letter with him, went into his bedroom.\nThe next morning was the morning of Christmas Eve. At about nine o'clock a boy came into his room who was accustomed to call for orders for the day. \"Jem,\" he said to the boy, \"there's half a crown lying there on the looking-glass.\" Jem looked and acknowledged the presence of the half-crown. \"Is it a head or a tail, Jem?\" asked the boy's master. Jem scrutinized the coin, and declared that the uppermost surface showed a tail. \"Then take that letter and post it,\" said George Vavasor. Whereupon Jem, asking no question and thinking but little of the circumstances under which the command was given, did take the letter and did post it. In due accordance with postal regulations it reached Vavasor Hall and was delivered to Alice on the Christmas morning.\nA merry Christmas did not fall to the lot of George Vavasor on the present occasion. An early Christmas-box he did receive in the shape of a very hurried note from his friend Burgo. \"This will be brought to you by Stickling,\" the note said; but who Stickling was Vavasor did not know. \"I send the bill. Couldn't you get the money and send it me, as I don't want to go up to town again before the thing comes off? You're a trump; and will do the best you can. Don't let that rogue off for less than a hundred and twenty.--Yours, B. F.\" Vavasor, therefore, having nothing better to do, spent his Christmas morning in calling on Mr. Magruin.\n\"Oh, Mr. Vavasor,\" said Magruin; \"really this is no morning for business!\"\n\"Time and tide wait for no man, Mr. Magruin, and my friend wants his money to-morrow.\"\n\"Oh, Mr. Vavasor,--to-morrow!\"\n\"Yes, to-morrow. If time and tide won't wait, neither will love. Come, Mr. Magruin, out with your cheque-book, and don't let's have any nonsense.\"\n\"But is the lady sure, Mr. Vavasor?\" asked Mr. Magruin, anxiously.\n\"Ladies never are sure,\" said Vavasor; \"hardly more sure than bills made over to money-lenders. I'm not going to wait here all day. Are you going to give him the money?\"\n\"Christmas-day, Mr. Vavasor! There's no getting money in the city to-day.\"\nBut Vavasor before he left did get the money from Mr. Magruin,--122 10s.--for which an acceptance at two months for 500 was given in exchange,--and carried it off in triumph. \"Do tell him to be punctual,\" said Mr. Magruin, when Vavasor took his leave. \"I do so like young men to be punctual. But I really think Mr. Fitzgerald is the most unpunctual young man I ever did know yet.\"\n\"I think he is,\" said George Vavasor, as he went away.\nHe ate his Christmas dinner in absolute solitude at an eating-house near his lodgings. It may be supposed that no man dares to dine at his club on a Christmas Day. He at any rate did not so dare;--and after dinner he wandered about through the streets, wondering within his mind how he would endure the restraints of married life. And the same dull monotony of his days was continued for a week, during which he waited, not impatiently, for an answer to his letter. And before the end of the week the answer came.",
        "paragraph_chars": [
            [
                0,
                1063
            ],
            [
                1063,
                2713
            ],
            [
                2713,
                3656
            ],
            [
                3656,
                5050
            ],
            [
                5050,
                5516
            ],
            [
                5516,
                5528
            ],
            [
                5528,
                6442
            ],
            [
                6442,
                7231
            ],
            [
                7231,
                8742
            ],
            [
                8742,
                9729
            ],
            [
                9729,
                10460
            ],
            [
                10460,
                11198
            ],
            [
                11198,
                11544
            ],
            [
                11544,
                11577
            ],
            [
                11577,
                11619
            ],
            [
                11619,
                11635
            ],
            [
                11635,
                12443
            ],
            [
                12443,
                13200
            ],
            [
                13200,
                13839
            ],
            [
                13839,
                13914
            ],
            [
                13914,
                14001
            ],
            [
                14001,
                14032
            ],
            [
                14032,
                14179
            ],
            [
                14179,
                14246
            ],
            [
                14246,
                14416
            ],
            [
                14416,
                14491
            ],
            [
                14491,
                14872
            ],
            [
                14872,
                14927
            ],
            [
                14927,
                15440
            ]
        ],
        "segment_chars": [
            [
                0,
                271
            ],
            [
                271,
                318
            ],
            [
                318,
                388
            ],
            [
                388,
                493
            ],
            [
                493,
                556
            ],
            [
                556,
                618
            ],
            [
                618,
                784
            ],
            [
                784,
                899
            ],
            [
                899,
                1063
            ],
            [
                1063,
                1234
            ],
            [
                1234,
                1404
            ],
            [
                1404,
                1705
            ],
            [
                1705,
                1754
            ],
            [
                1754,
                1809
            ],
            [
                1809,
                1894
            ],
            [
                1894,
                2181
            ],
            [
                2181,
                2239
            ],
            [
                2239,
                2384
            ],
            [
                2384,
                2511
            ],
            [
                2511,
                2713
            ],
            [
                2713,
                2757
            ],
            [
                2757,
                2917
            ],
            [
                2917,
                2989
            ],
            [
                2989,
                3286
            ],
            [
                3286,
                3414
            ],
            [
                3414,
                3514
            ],
            [
                3514,
                3656
            ],
            [
                3656,
                3723
            ],
            [
                3723,
                3862
            ],
            [
                3862,
                4079
            ],
            [
                4079,
                4192
            ],
            [
                4192,
                4298
            ],
            [
                4298,
                4380
            ],
            [
                4380,
                4455
            ],
            [
                4455,
                4537
            ],
            [
                4537,
                4638
            ],
            [
                4638,
                4800
            ],
            [
                4800,
                5050
            ],
            [
                5050,
                5243
            ],
            [
                5243,
                5373
            ],
            [
                5373,
                5468
            ],
            [
                5468,
                5516
            ],
            [
                5516,
                5528
            ],
            [
                5528,
                5793
            ],
            [
                5793,
                5942
            ],
            [
                5942,
                6062
            ],
            [
                6062,
                6102
            ],
            [
                6102,
                6266
            ],
            [
                6266,
                6389
            ],
            [
                6389,
                6442
            ],
            [
                6442,
                6572
            ],
            [
                6572,
                6636
            ],
            [
                6636,
                6812
            ],
            [
                6812,
                6964
            ],
            [
                6964,
                7057
            ],
            [
                7057,
                7231
            ],
            [
                7231,
                7256
            ],
            [
                7256,
                7328
            ],
            [
                7328,
                7456
            ],
            [
                7456,
                7516
            ],
            [
                7516,
                7575
            ],
            [
                7575,
                7686
            ],
            [
                7686,
                7861
            ],
            [
                7861,
                7985
            ],
            [
                7985,
                8060
            ],
            [
                8060,
                8089
            ],
            [
                8089,
                8179
            ],
            [
                8179,
                8243
            ],
            [
                8243,
                8357
            ],
            [
                8357,
                8507
            ],
            [
                8507,
                8742
            ],
            [
                8742,
                8807
            ],
            [
                8807,
                8890
            ],
            [
                8890,
                8917
            ],
            [
                8917,
                9024
            ],
            [
                9024,
                9087
            ],
            [
                9087,
                9259
            ],
            [
                9259,
                9304
            ],
            [
                9304,
                9413
            ],
            [
                9413,
                9532
            ],
            [
                9532,
                9636
            ],
            [
                9636,
                9729
            ],
            [
                9729,
                9791
            ],
            [
                9791,
                9889
            ],
            [
                9889,
                9948
            ],
            [
                9948,
                10113
            ],
            [
                10113,
                10246
            ],
            [
                10246,
                10308
            ],
            [
                10308,
                10460
            ],
            [
                10460,
                10544
            ],
            [
                10544,
                10606
            ],
            [
                10606,
                10759
            ],
            [
                10759,
                10804
            ],
            [
                10804,
                10866
            ],
            [
                10866,
                10978
            ],
            [
                10978,
                11119
            ],
            [
                11119,
                11198
            ],
            [
                11198,
                11288
            ],
            [
                11288,
                11337
            ],
            [
                11337,
                11353
            ],
            [
                11353,
                11379
            ],
            [
                11379,
                11400
            ],
            [
                11400,
                11544
            ],
            [
                11544,
                11577
            ],
            [
                11577,
                11619
            ],
            [
                11619,
                11635
            ],
            [
                11635,
                11777
            ],
            [
                11777,
                11860
            ],
            [
                11860,
                12070
            ],
            [
                12070,
                12157
            ],
            [
                12157,
                12210
            ],
            [
                12210,
                12325
            ],
            [
                12325,
                12361
            ],
            [
                12361,
                12443
            ],
            [
                12443,
                12494
            ],
            [
                12494,
                12592
            ],
            [
                12592,
                12676
            ],
            [
                12676,
                12736
            ],
            [
                12736,
                12767
            ],
            [
                12767,
                12791
            ],
            [
                12791,
                12872
            ],
            [
                12872,
                12930
            ],
            [
                12930,
                13081
            ],
            [
                13081,
                13200
            ],
            [
                13200,
                13285
            ],
            [
                13285,
                13382
            ],
            [
                13382,
                13485
            ],
            [
                13485,
                13503
            ],
            [
                13503,
                13613
            ],
            [
                13613,
                13659
            ],
            [
                13659,
                13839
            ],
            [
                13839,
                13914
            ],
            [
                13914,
                14001
            ],
            [
                14001,
                14032
            ],
            [
                14032,
                14049
            ],
            [
                14049,
                14097
            ],
            [
                14097,
                14179
            ],
            [
                14179,
                14216
            ],
            [
                14216,
                14246
            ],
            [
                14246,
                14342
            ],
            [
                14342,
                14378
            ],
            [
                14378,
                14416
            ],
            [
                14416,
                14445
            ],
            [
                14445,
                14491
            ],
            [
                14491,
                14666
            ],
            [
                14666,
                14743
            ],
            [
                14743,
                14783
            ],
            [
                14783,
                14872
            ],
            [
                14872,
                14927
            ],
            [
                14927,
                15014
            ],
            [
                15014,
                15091
            ],
            [
                15091,
                15258
            ],
            [
                15258,
                15393
            ],
            [
                15393,
                15440
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                36,
                95
            ],
            [
                105,
                111
            ],
            [
                136,
                146
            ],
            [
                191,
                192
            ],
            [
                249,
                252
            ],
            [
                12,
                14
            ],
            [
                222,
                247
            ],
            [
                269,
                271
            ],
            [
                271,
                318
            ],
            [
                388,
                492
            ],
            [
                493,
                555
            ],
            [
                556,
                618
            ],
            [
                784,
                795
            ],
            [
                819,
                899
            ],
            [
                899,
                942
            ],
            [
                963,
                1063
            ],
            [
                1155,
                1161
            ],
            [
                1162,
                1168
            ],
            [
                1178,
                1209
            ],
            [
                1218,
                1234
            ],
            [
                1240,
                1249
            ],
            [
                1391,
                1393
            ],
            [
                1300,
                1304
            ],
            [
                1333,
                1336
            ],
            [
                1317,
                1329
            ],
            [
                1581,
                1584
            ],
            [
                1404,
                1410
            ],
            [
                1418,
                1478
            ],
            [
                1663,
                1705
            ],
            [
                1705,
                1716
            ],
            [
                1717,
                1726
            ],
            [
                1736,
                1754
            ],
            [
                1809,
                1844
            ],
            [
                1860,
                1863
            ],
            [
                1874,
                1885
            ],
            [
                1892,
                1894
            ],
            [
                2528,
                2543
            ],
            [
                2544,
                2560
            ],
            [
                2577,
                2702
            ],
            [
                2706,
                2713
            ],
            [
                2713,
                2757
            ],
            [
                2816,
                2818
            ],
            [
                2796,
                2811
            ],
            [
                2813,
                2815
            ],
            [
                2819,
                2827
            ],
            [
                2876,
                2879
            ],
            [
                2887,
                2917
            ],
            [
                2967,
                2978
            ],
            [
                2917,
                2921
            ],
            [
                2947,
                2966
            ],
            [
                2926,
                2931
            ],
            [
                2932,
                2946
            ],
            [
                2987,
                2989
            ],
            [
                2989,
                3033
            ],
            [
                3103,
                3105
            ],
            [
                3119,
                3123
            ],
            [
                3128,
                3133
            ],
            [
                3040,
                3043
            ],
            [
                3134,
                3140
            ],
            [
                3144,
                3157
            ],
            [
                3168,
                3175
            ],
            [
                3196,
                3204
            ],
            [
                3095,
                3098
            ],
            [
                3205,
                3214
            ],
            [
                3220,
                3229
            ],
            [
                3234,
                3239
            ],
            [
                3276,
                3285
            ],
            [
                3726,
                3785
            ],
            [
                3795,
                3799
            ],
            [
                3813,
                3819
            ],
            [
                3827,
                3862
            ],
            [
                3862,
                3886
            ],
            [
                3923,
                3926
            ],
            [
                4192,
                4207
            ],
            [
                4132,
                4134
            ],
            [
                4062,
                4077
            ],
            [
                4031,
                4033
            ],
            [
                4214,
                4222
            ],
            [
                3994,
                3996
            ],
            [
                4251,
                4260
            ],
            [
                4272,
                4286
            ],
            [
                4237,
                4249
            ],
            [
                4077,
                4078
            ],
            [
                4298,
                4355
            ],
            [
                4357,
                4359
            ],
            [
                4369,
                4372
            ],
            [
                4378,
                4380
            ],
            [
                4380,
                4395
            ],
            [
                4417,
                4431
            ],
            [
                4453,
                4455
            ],
            [
                4455,
                4537
            ],
            [
                4537,
                4540
            ],
            [
                4569,
                4576
            ],
            [
                4605,
                4638
            ],
            [
                4642,
                4702
            ],
            [
                4901,
                4906
            ],
            [
                4859,
                4861
            ],
            [
                4960,
                4995
            ],
            [
                5002,
                5050
            ],
            [
                5050,
                5102
            ],
            [
                5168,
                5181
            ],
            [
                5187,
                5194
            ],
            [
                5203,
                5221
            ],
            [
                5241,
                5243
            ],
            [
                5243,
                5274
            ],
            [
                5307,
                5310
            ],
            [
                5319,
                5341
            ],
            [
                5371,
                5372
            ],
            [
                5373,
                5468
            ],
            [
                5473,
                5475
            ],
            [
                5496,
                5513
            ],
            [
                5516,
                5528
            ],
            [
                5546,
                5559
            ],
            [
                5569,
                5631
            ],
            [
                5658,
                5664
            ],
            [
                5679,
                5754
            ],
            [
                5760,
                5771
            ],
            [
                5781,
                5793
            ],
            [
                5793,
                5812
            ],
            [
                5814,
                5837
            ],
            [
                5882,
                5883
            ],
            [
                5885,
                5896
            ],
            [
                5905,
                5942
            ],
            [
                5965,
                5977
            ],
            [
                6060,
                6061
            ],
            [
                6062,
                6102
            ],
            [
                6102,
                6147
            ],
            [
                6153,
                6156
            ],
            [
                6161,
                6174
            ],
            [
                6203,
                6219
            ],
            [
                6243,
                6249
            ],
            [
                6255,
                6266
            ],
            [
                6297,
                6346
            ],
            [
                6398,
                6410
            ],
            [
                6416,
                6432
            ],
            [
                6440,
                6442
            ],
            [
                6442,
                6530
            ],
            [
                6570,
                6572
            ],
            [
                6572,
                6588
            ],
            [
                6589,
                6600
            ],
            [
                6634,
                6636
            ],
            [
                6636,
                6706
            ],
            [
                6714,
                6729
            ],
            [
                6736,
                6745
            ],
            [
                6763,
                6812
            ],
            [
                6827,
                6893
            ],
            [
                6913,
                6931
            ],
            [
                6962,
                6964
            ],
            [
                6964,
                6999
            ],
            [
                7032,
                7057
            ],
            [
                7057,
                7107
            ],
            [
                7229,
                7231
            ],
            [
                7256,
                7328
            ],
            [
                7328,
                7394
            ],
            [
                7407,
                7456
            ],
            [
                7456,
                7516
            ],
            [
                7516,
                7531
            ],
            [
                7535,
                7548
            ],
            [
                7554,
                7573
            ],
            [
                7623,
                7625
            ],
            [
                7639,
                7647
            ],
            [
                7656,
                7686
            ],
            [
                7686,
                7728
            ],
            [
                7730,
                7734
            ],
            [
                7786,
                7860
            ],
            [
                7872,
                7913
            ],
            [
                7930,
                7955
            ],
            [
                7958,
                7963
            ],
            [
                7983,
                7985
            ],
            [
                7985,
                8014
            ],
            [
                8024,
                8060
            ],
            [
                8060,
                8089
            ],
            [
                8089,
                8143
            ],
            [
                8159,
                8179
            ],
            [
                8179,
                8243
            ],
            [
                8243,
                8256
            ],
            [
                8344,
                8346
            ],
            [
                8268,
                8301
            ],
            [
                8355,
                8357
            ],
            [
                8357,
                8376
            ],
            [
                8387,
                8485
            ],
            [
                8505,
                8507
            ],
            [
                8544,
                8600
            ],
            [
                8602,
                8672
            ],
            [
                8675,
                8742
            ],
            [
                8742,
                8762
            ],
            [
                8771,
                8807
            ],
            [
                8807,
                8832
            ],
            [
                9008,
                9016
            ],
            [
                8875,
                8878
            ],
            [
                8932,
                8934
            ],
            [
                8908,
                8910
            ],
            [
                9257,
                9259
            ],
            [
                9413,
                9427
            ],
            [
                9437,
                9460
            ],
            [
                9530,
                9532
            ],
            [
                9583,
                9635
            ],
            [
                9729,
                9734
            ],
            [
                9769,
                9791
            ],
            [
                9840,
                9868
            ],
            [
                9883,
                9889
            ],
            [
                9889,
                9948
            ],
            [
                9948,
                10053
            ],
            [
                10074,
                10085
            ],
            [
                10095,
                10099
            ],
            [
                10103,
                10113
            ],
            [
                10113,
                10126
            ],
            [
                10127,
                10131
            ],
            [
                10188,
                10211
            ],
            [
                10220,
                10240
            ],
            [
                10244,
                10246
            ],
            [
                10246,
                10308
            ],
            [
                10322,
                10381
            ],
            [
                10458,
                10460
            ],
            [
                10460,
                10490
            ],
            [
                10490,
                10544
            ],
            [
                10544,
                10606
            ],
            [
                10606,
                10608
            ],
            [
                10612,
                10618
            ],
            [
                10658,
                10661
            ],
            [
                10723,
                10759
            ],
            [
                10759,
                10779
            ],
            [
                10783,
                10786
            ],
            [
                10791,
                10804
            ],
            [
                10804,
                10858
            ],
            [
                10864,
                10866
            ],
            [
                10866,
                10868
            ],
            [
                10906,
                10910
            ],
            [
                10874,
                10878
            ],
            [
                10916,
                10978
            ],
            [
                10978,
                10999
            ],
            [
                11007,
                11016
            ],
            [
                11117,
                11118
            ],
            [
                11198,
                11200
            ],
            [
                11211,
                11227
            ],
            [
                11251,
                11286
            ],
            [
                11316,
                11337
            ],
            [
                11337,
                11353
            ],
            [
                11353,
                11379
            ],
            [
                11379,
                11400
            ],
            [
                11400,
                11521
            ],
            [
                11535,
                11544
            ],
            [
                11544,
                11577
            ],
            [
                11577,
                11619
            ],
            [
                11619,
                11635
            ],
            [
                11635,
                11738
            ],
            [
                11748,
                11777
            ],
            [
                11777,
                11804
            ],
            [
                11818,
                11824
            ],
            [
                11842,
                11844
            ],
            [
                11850,
                11860
            ],
            [
                12070,
                12073
            ],
            [
                12104,
                12142
            ],
            [
                12155,
                12157
            ],
            [
                12157,
                12209
            ],
            [
                12210,
                12300
            ],
            [
                12306,
                12325
            ],
            [
                12325,
                12340
            ],
            [
                12353,
                12361
            ],
            [
                12361,
                12389
            ],
            [
                12420,
                12424
            ],
            [
                12441,
                12443
            ],
            [
                12443,
                12451
            ],
            [
                12460,
                12463
            ],
            [
                12479,
                12494
            ],
            [
                12494,
                12515
            ],
            [
                12516,
                12540
            ],
            [
                12560,
                12562
            ],
            [
                12568,
                12591
            ],
            [
                12592,
                12673
            ],
            [
                12737,
                12759
            ],
            [
                12764,
                12766
            ],
            [
                12791,
                12871
            ],
            [
                12872,
                12930
            ],
            [
                12940,
                12943
            ],
            [
                12964,
                12967
            ],
            [
                13077,
                13081
            ],
            [
                13123,
                13176
            ],
            [
                13181,
                13200
            ],
            [
                13245,
                13259
            ],
            [
                13218,
                13225
            ],
            [
                13200,
                13217
            ],
            [
                13283,
                13285
            ],
            [
                13308,
                13310
            ],
            [
                13285,
                13293
            ],
            [
                13323,
                13381
            ],
            [
                13485,
                13487
            ],
            [
                13493,
                13503
            ],
            [
                13503,
                13508
            ],
            [
                13512,
                13584
            ],
            [
                13611,
                13613
            ],
            [
                13659,
                13718
            ],
            [
                13726,
                13734
            ],
            [
                13735,
                13753
            ],
            [
                13782,
                13839
            ],
            [
                13839,
                13870
            ],
            [
                13872,
                13873
            ],
            [
                13880,
                13914
            ],
            [
                13914,
                13998
            ],
            [
                14097,
                14179
            ],
            [
                14179,
                14216
            ],
            [
                14216,
                14246
            ],
            [
                14246,
                14283
            ],
            [
                14340,
                14342
            ],
            [
                14342,
                14378
            ],
            [
                14378,
                14416
            ],
            [
                14510,
                14512
            ],
            [
                14518,
                14552
            ],
            [
                14555,
                14562
            ],
            [
                14664,
                14665
            ],
            [
                14621,
                14632
            ],
            [
                14565,
                14568
            ],
            [
                14607,
                14610
            ],
            [
                14654,
                14656
            ],
            [
                14592,
                14602
            ],
            [
                14666,
                14712
            ],
            [
                14741,
                14743
            ],
            [
                14787,
                14856
            ],
            [
                14869,
                14872
            ],
            [
                14872,
                14927
            ],
            [
                14927,
                14957
            ],
            [
                14967,
                15014
            ],
            [
                15128,
                15152
            ],
            [
                15159,
                15189
            ],
            [
                15206,
                15258
            ],
            [
                15262,
                15322
            ],
            [
                15336,
                15345
            ],
            [
                15364,
                15393
            ],
            [
                15393,
                15440
            ]
        ],
        "row_chars": [
            [
                0,
                271
            ],
            [
                271,
                318
            ],
            [
                318,
                388
            ],
            [
                388,
                493
            ],
            [
                493,
                556
            ],
            [
                556,
                618
            ],
            [
                618,
                784
            ],
            [
                784,
                899
            ],
            [
                899,
                1063
            ],
            [
                1063,
                1234
            ],
            [
                1234,
                1705
            ],
            [
                1705,
                1754
            ],
            [
                1754,
                1809
            ],
            [
                1809,
                1894
            ],
            [
                1894,
                2181
            ],
            [
                2181,
                2239
            ],
            [
                2239,
                2384
            ],
            [
                2384,
                2511
            ],
            [
                2511,
                2713
            ],
            [
                2713,
                2757
            ],
            [
                2757,
                2917
            ],
            [
                2917,
                2989
            ],
            [
                2989,
                3286
            ],
            [
                3286,
                3414
            ],
            [
                3414,
                3514
            ],
            [
                3514,
                3656
            ],
            [
                3656,
                3723
            ],
            [
                3723,
                3862
            ],
            [
                3862,
                4298
            ],
            [
                4298,
                4380
            ],
            [
                4380,
                4455
            ],
            [
                4455,
                4537
            ],
            [
                4537,
                4638
            ],
            [
                4638,
                5050
            ],
            [
                5050,
                5243
            ],
            [
                5243,
                5373
            ],
            [
                5373,
                5468
            ],
            [
                5468,
                5516
            ],
            [
                5516,
                5528
            ],
            [
                5528,
                5793
            ],
            [
                5793,
                5942
            ],
            [
                5942,
                6062
            ],
            [
                6062,
                6102
            ],
            [
                6102,
                6266
            ],
            [
                6266,
                6442
            ],
            [
                6442,
                6572
            ],
            [
                6572,
                6636
            ],
            [
                6636,
                6812
            ],
            [
                6812,
                6964
            ],
            [
                6964,
                7057
            ],
            [
                7057,
                7231
            ],
            [
                7231,
                7256
            ],
            [
                7256,
                7328
            ],
            [
                7328,
                7456
            ],
            [
                7456,
                7516
            ],
            [
                7516,
                7686
            ],
            [
                7686,
                7861
            ],
            [
                7861,
                7985
            ],
            [
                7985,
                8060
            ],
            [
                8060,
                8089
            ],
            [
                8089,
                8179
            ],
            [
                8179,
                8243
            ],
            [
                8243,
                8357
            ],
            [
                8357,
                8507
            ],
            [
                8507,
                8742
            ],
            [
                8742,
                8807
            ],
            [
                8807,
                9259
            ],
            [
                9259,
                9304
            ],
            [
                9304,
                9413
            ],
            [
                9413,
                9532
            ],
            [
                9532,
                9636
            ],
            [
                9636,
                9729
            ],
            [
                9729,
                9791
            ],
            [
                9791,
                9889
            ],
            [
                9889,
                9948
            ],
            [
                9948,
                10113
            ],
            [
                10113,
                10246
            ],
            [
                10246,
                10308
            ],
            [
                10308,
                10460
            ],
            [
                10460,
                10544
            ],
            [
                10544,
                10606
            ],
            [
                10606,
                10759
            ],
            [
                10759,
                10804
            ],
            [
                10804,
                10866
            ],
            [
                10866,
                10978
            ],
            [
                10978,
                11119
            ],
            [
                11119,
                11198
            ],
            [
                11198,
                11337
            ],
            [
                11337,
                11353
            ],
            [
                11353,
                11379
            ],
            [
                11379,
                11400
            ],
            [
                11400,
                11544
            ],
            [
                11544,
                11577
            ],
            [
                11577,
                11619
            ],
            [
                11619,
                11635
            ],
            [
                11635,
                11777
            ],
            [
                11777,
                11860
            ],
            [
                11860,
                12070
            ],
            [
                12070,
                12157
            ],
            [
                12157,
                12210
            ],
            [
                12210,
                12325
            ],
            [
                12325,
                12361
            ],
            [
                12361,
                12443
            ],
            [
                12443,
                12494
            ],
            [
                12494,
                12592
            ],
            [
                12592,
                12676
            ],
            [
                12676,
                12736
            ],
            [
                12736,
                12767
            ],
            [
                12767,
                12791
            ],
            [
                12791,
                12872
            ],
            [
                12872,
                12930
            ],
            [
                12930,
                13081
            ],
            [
                13081,
                13200
            ],
            [
                13200,
                13285
            ],
            [
                13285,
                13382
            ],
            [
                13382,
                13485
            ],
            [
                13485,
                13503
            ],
            [
                13503,
                13613
            ],
            [
                13613,
                13659
            ],
            [
                13659,
                13839
            ],
            [
                13839,
                13914
            ],
            [
                13914,
                14001
            ],
            [
                14001,
                14032
            ],
            [
                14032,
                14049
            ],
            [
                14049,
                14097
            ],
            [
                14097,
                14179
            ],
            [
                14179,
                14216
            ],
            [
                14216,
                14246
            ],
            [
                14246,
                14342
            ],
            [
                14342,
                14378
            ],
            [
                14378,
                14416
            ],
            [
                14416,
                14445
            ],
            [
                14445,
                14491
            ],
            [
                14491,
                14666
            ],
            [
                14666,
                14743
            ],
            [
                14743,
                14783
            ],
            [
                14783,
                14872
            ],
            [
                14872,
                14927
            ],
            [
                14927,
                15014
            ],
            [
                15014,
                15091
            ],
            [
                15091,
                15258
            ],
            [
                15258,
                15393
            ],
            [
                15393,
                15440
            ]
        ]
    },
    "abridged": {
        "text": "Vavasor, after Fitzgerald had left him, began to think of the days past when he had helped his friend; and he thought of Alice's behaviour then. Alice had steadfastly refused to give any aid. But she had been very earnest in declaring that it was Glencora's duty to stand by her promise to Burgo.\n\"He is a desperate spendthrift,\" Kate Vavasor had said to her.\n\"Then let her teach him to be otherwise,\" Alice had answered. \"If a woman won't venture her fortune for the man she loves, her love is not worth having.\" All this George Vavasor remembered now; and he asked himself whether the woman that had once loved him would venture her fortune for him still.\nHe had until now hardly made up his mind that he really wanted to marry Alice. He had grown to love his independence; and he was inclined to think that marriage was an old-fashioned custom, not adapted to his advanced intelligence. If he loved and respected any woman, it was his cousin Alice. But that idea of tying himself down was distasteful. Nevertheless, as he thought now of Alice Vavasor, he began to feel that if a Siamese twin were necessary for him, she of all others was the woman to whom he would wish to be bound.\nAnd if he did it at all, he must do it now. He and his sister, as Kate thought, had induced Alice to break her engagement with Mr. Grey. But he believed that if left to herself, Alice would probably renew it again. And then, despite that advanced intelligence of his, he still had enough human frailty to feel pleasure at the idea of taking John Grey's prize from him.\nGeorge Vavasor had very high ambition, and a fair hope of gratifying it if only things would go well with him for a year or so. He was still a poor man, but if he succeeded in getting into Parliament he would be able to live an agreeable and honourable mode of life.\nBut how was he to bear the cost of this for the next year or two? His grandfather would probably not die soon. If he married Alice he would do so with no idea of cheating her out of her money. She already knew how perilous was his enterprise. He knew her to be a woman who would boldly risk all in money; but could he tell her that he wanted to spend all her fortune in the first year or two of their married life!\nHe was still in his arm-chair, thinking of all this, when he heard a distant clock strike three. Then he rose from his seat, and sat down at a writing-desk.\n\"I needn't send it when it's written,\" he said to himself, \"and the chances are that I won't.\" He wrote as follows:\nDear Alice,\nOnce I had the privilege of beginning my letters to you with a warmer show of love than 'dear' - when I could call you dearest; but I lost that privilege through my own folly, and since then it has been granted to another. But you have found, with a thorough honesty, that it has been best for you to withdraw that privilege also. Otherwise I should not be writing this.\nI now once again ask you to be my wife. In spite of all that passed in those old days - all my selfish folly - I think you know that I always loved you. Indeed my love to you was true from first to last, and I do not think you ever doubted it.\nNevertheless, when you told me that I might no longer hope to make you my wife, I had no answer. You acted as any sensible woman would. Then came the episode of Mr. Grey; and bitter as have been my feelings during that engagement, I never tried to come between you and the life you had chosen. I do not forget the words which I spoke last summer at Basle, when you still intended to marry him. But what I said then was nothing to what I refrained from saying. Whether you remember those few words I cannot tell.\nBut you are now again a free woman; and once again I ask you to be my wife. We are both older than we were when we loved before, and will both think of marriage in a somewhat different light. Then personal love for each other was most in our thoughts. God forbid that love should not be in our thoughts now - and my love for you is stronger than any other consideration. But we have both reached that time of life when we should think more of our adaptability to each other than we did before.\nI know that there is much in my character to make me unfit to marry an ordinary woman. You know my mode of life, and my hopes and my chances of success. I run great risk of failing. It may be that I shall encounter ruin where I look for a career of honour. The chances are perhaps more in favour of ruin than of success. But, whatever my chances, I shall go on as long as I can. If you were my wife tomorrow I should expect to use your money, if it were needed, in struggling to obtain a seat in Parliament. I do not ask you to be my wife for the sake of this aid; but if you were to become my wife I should expect all your cooperation - with your money, possibly, but certainly with your warmest spirit.\nAnd now, once again, dearest Alice, will you be my wife? I have been punished, and no other woman has held any place in my heart. Providence has been very good to me in giving me another chance. Tell me whether you can pardon me and still love me.\nThink well before you answer me. I will not expect your reply for a week. It can hardly be your desire to go through life unmarried. I should say that it must be essential to your ambition that you should join your lot to that of some man with aspirations like your own. It is because of this that you found yourself obliged to part from Mr. Grey. May I not say that with us there would be no such difference? I believe that in this respect we are fitted for each other.\nThis will reach you at Vavasor Hall, where you will now be with the old squire and Kate. I have told her nothing of my purpose in writing this letter. If you should accept me, I would try to be reconciled to my grandfather. He has misunderstood and ill-used me. But I am ready to forgive that, if he will allow me to. In that case I would, if possible, go down to Vavasor while you are there. But I am galloping on ahead foolishly.\nIf your answer is to be adverse, a meeting between me and the Squire would be impossible. But, oh, Alice! do not let it be adverse. I think you love me. Your woman's pride towards me has been great and good and womanly; but it has had its way; and, if you love me, might now succumb.\nDear Alice, will you be my wife?\nYours, in any event, most affectionately,\nGeorge Vavasor.\nVavasor, when he had finished his letter, went back to his seat over the fire, and there he sat with it by his hand for nearly an hour. Once or twice he took it up and almost threw it in the fire. But the letter was put back upon the table. Then when the hour was nearly over he read it again.\n\"I'll bet two to one that she gives way,\" he said to himself, as he put the sheet of paper into the envelope. \"Women are such fools.\" Then he took his candle, and went to bed.\nThe next day was Christmas Eve. At about nine o'clock in the morning a boy came into his room to ask for orders for the day.\n\"Jem,\" he said to the boy, \"there's half a crown lying there on the looking-glass. Is it a head or a tail?\"\nJem scrutinized the coin, and declared that the uppermost surface showed a tail.\n\"Then take that letter and post it,\" said George Vavasor. So Jem took it and posted it. It reached Vavasor Hall and was delivered to Alice on Christmas morning.\nGeorge Vavasor did not have a merry Christmas. He received an early gift in the shape of a very hurried note from his friend Burgo.\n\"I am sending the bill. Could you get the money and send it me, as I don't want to go up to town again? Don't let that rogue off for less than a hundred and twenty. Yours, B. F.\"\nVavasor, therefore, spent his Christmas morning in calling on Mr. Magruin.\n\"Oh, Mr. Vavasor,\" said Magruin, \"this is no morning for business!\"\n\"Time and tide wait for no man, Mr. Magruin, and my friend wants his money to-morrow. Come, Mr. Magruin, out with your cheque-book, and don't let's have any nonsense.\"\n\"But is the lady sure, Mr. Vavasor?\" asked Mr. Magruin, anxiously.\n\"Ladies never are sure,\" said Vavasor. \"I'm not going to wait here all day. Are you going to give him the money?\"\nHe did get the money from Mr. Magruin - 122 10s. - in exchange for a promise of 500 in two months.\n\"Do tell him to be punctual,\" said Mr. Magruin. \"I really think Mr. Fitzgerald is the most unpunctual young man I ever knew.\"\n\"I think he is,\" said George Vavasor, as he went away.\nHe ate his Christmas dinner in solitude at an eating-house near his lodgings. After dinner he wandered through the streets, wondering how he would endure the restraints of married life. The same dull monotony of his days was continued for a week, while he waited for an answer to his letter. And before the end of the week the answer came.",
        "paragraph_chars": [
            [
                0,
                297
            ],
            [
                297,
                360
            ],
            [
                360,
                658
            ],
            [
                658,
                1186
            ],
            [
                1186,
                1555
            ],
            [
                1555,
                1822
            ],
            [
                1822,
                2237
            ],
            [
                2237,
                2394
            ],
            [
                2394,
                2510
            ],
            [
                2510,
                2522
            ],
            [
                2522,
                2893
            ],
            [
                2893,
                3137
            ],
            [
                3137,
                3649
            ],
            [
                3649,
                4143
            ],
            [
                4143,
                4848
            ],
            [
                4848,
                5096
            ],
            [
                5096,
                5567
            ],
            [
                5567,
                5999
            ],
            [
                5999,
                6283
            ],
            [
                6283,
                6316
            ],
            [
                6316,
                6358
            ],
            [
                6358,
                6374
            ],
            [
                6374,
                6668
            ],
            [
                6668,
                6844
            ],
            [
                6844,
                6969
            ],
            [
                6969,
                7077
            ],
            [
                7077,
                7158
            ],
            [
                7158,
                7319
            ],
            [
                7319,
                7451
            ],
            [
                7451,
                7630
            ],
            [
                7630,
                7705
            ],
            [
                7705,
                7773
            ],
            [
                7773,
                7941
            ],
            [
                7941,
                8008
            ],
            [
                8008,
                8122
            ],
            [
                8122,
                8221
            ],
            [
                8221,
                8347
            ],
            [
                8347,
                8402
            ],
            [
                8402,
                8741
            ]
        ],
        "segment_chars": [
            [
                0,
                145
            ],
            [
                145,
                192
            ],
            [
                192,
                297
            ],
            [
                297,
                360
            ],
            [
                360,
                422
            ],
            [
                422,
                514
            ],
            [
                514,
                658
            ],
            [
                658,
                737
            ],
            [
                737,
                890
            ],
            [
                890,
                952
            ],
            [
                952,
                1005
            ],
            [
                1005,
                1186
            ],
            [
                1186,
                1230
            ],
            [
                1230,
                1323
            ],
            [
                1323,
                1401
            ],
            [
                1401,
                1555
            ],
            [
                1555,
                1683
            ],
            [
                1683,
                1822
            ],
            [
                1822,
                1888
            ],
            [
                1888,
                1933
            ],
            [
                1933,
                2015
            ],
            [
                2015,
                2065
            ],
            [
                2065,
                2237
            ],
            [
                2237,
                2334
            ],
            [
                2334,
                2394
            ],
            [
                2394,
                2489
            ],
            [
                2489,
                2510
            ],
            [
                2510,
                2522
            ],
            [
                2522,
                2745
            ],
            [
                2745,
                2853
            ],
            [
                2853,
                2893
            ],
            [
                2893,
                2933
            ],
            [
                2933,
                3046
            ],
            [
                3046,
                3137
            ],
            [
                3137,
                3234
            ],
            [
                3234,
                3273
            ],
            [
                3273,
                3431
            ],
            [
                3431,
                3531
            ],
            [
                3531,
                3597
            ],
            [
                3597,
                3649
            ],
            [
                3649,
                3725
            ],
            [
                3725,
                3841
            ],
            [
                3841,
                3901
            ],
            [
                3901,
                4020
            ],
            [
                4020,
                4143
            ],
            [
                4143,
                4230
            ],
            [
                4230,
                4296
            ],
            [
                4296,
                4325
            ],
            [
                4325,
                4400
            ],
            [
                4400,
                4464
            ],
            [
                4464,
                4522
            ],
            [
                4522,
                4651
            ],
            [
                4651,
                4848
            ],
            [
                4848,
                4905
            ],
            [
                4905,
                4978
            ],
            [
                4978,
                5043
            ],
            [
                5043,
                5096
            ],
            [
                5096,
                5129
            ],
            [
                5129,
                5170
            ],
            [
                5170,
                5229
            ],
            [
                5229,
                5367
            ],
            [
                5367,
                5444
            ],
            [
                5444,
                5506
            ],
            [
                5506,
                5567
            ],
            [
                5567,
                5656
            ],
            [
                5656,
                5718
            ],
            [
                5718,
                5791
            ],
            [
                5791,
                5829
            ],
            [
                5829,
                5885
            ],
            [
                5885,
                5960
            ],
            [
                5960,
                5999
            ],
            [
                5999,
                6089
            ],
            [
                6089,
                6105
            ],
            [
                6105,
                6131
            ],
            [
                6131,
                6152
            ],
            [
                6152,
                6283
            ],
            [
                6283,
                6316
            ],
            [
                6316,
                6358
            ],
            [
                6358,
                6374
            ],
            [
                6374,
                6510
            ],
            [
                6510,
                6571
            ],
            [
                6571,
                6615
            ],
            [
                6615,
                6668
            ],
            [
                6668,
                6778
            ],
            [
                6778,
                6802
            ],
            [
                6802,
                6844
            ],
            [
                6844,
                6876
            ],
            [
                6876,
                6969
            ],
            [
                6969,
                7052
            ],
            [
                7052,
                7077
            ],
            [
                7077,
                7158
            ],
            [
                7158,
                7216
            ],
            [
                7216,
                7246
            ],
            [
                7246,
                7319
            ],
            [
                7319,
                7366
            ],
            [
                7366,
                7451
            ],
            [
                7451,
                7475
            ],
            [
                7475,
                7555
            ],
            [
                7555,
                7616
            ],
            [
                7616,
                7630
            ],
            [
                7630,
                7705
            ],
            [
                7705,
                7773
            ],
            [
                7773,
                7859
            ],
            [
                7859,
                7941
            ],
            [
                7941,
                7978
            ],
            [
                7978,
                8008
            ],
            [
                8008,
                8047
            ],
            [
                8047,
                8084
            ],
            [
                8084,
                8122
            ],
            [
                8122,
                8171
            ],
            [
                8171,
                8221
            ],
            [
                8221,
                8269
            ],
            [
                8269,
                8347
            ],
            [
                8347,
                8402
            ],
            [
                8402,
                8480
            ],
            [
                8480,
                8588
            ],
            [
                8588,
                8694
            ],
            [
                8694,
                8741
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                7,
                66
            ],
            [
                77,
                83
            ],
            [
                91,
                101
            ],
            [
                101,
                102
            ],
            [
                103,
                106
            ],
            [
                107,
                109
            ],
            [
                118,
                143
            ],
            [
                143,
                145
            ],
            [
                145,
                192
            ],
            [
                192,
                296
            ],
            [
                297,
                359
            ],
            [
                360,
                422
            ],
            [
                422,
                433
            ],
            [
                434,
                514
            ],
            [
                514,
                557
            ],
            [
                558,
                658
            ],
            [
                658,
                664
            ],
            [
                675,
                681
            ],
            [
                682,
                713
            ],
            [
                721,
                737
            ],
            [
                740,
                749
            ],
            [
                750,
                752
            ],
            [
                753,
                757
            ],
            [
                758,
                761
            ],
            [
                762,
                774
            ],
            [
                776,
                779
            ],
            [
                780,
                786
            ],
            [
                787,
                847
            ],
            [
                848,
                890
            ],
            [
                890,
                901
            ],
            [
                916,
                925
            ],
            [
                934,
                952
            ],
            [
                952,
                987
            ],
            [
                988,
                991
            ],
            [
                992,
                1003
            ],
            [
                1003,
                1005
            ],
            [
                1017,
                1032
            ],
            [
                1037,
                1053
            ],
            [
                1053,
                1178
            ],
            [
                1179,
                1186
            ],
            [
                1186,
                1230
            ],
            [
                1230,
                1232
            ],
            [
                1233,
                1248
            ],
            [
                1249,
                1251
            ],
            [
                1257,
                1265
            ],
            [
                1266,
                1269
            ],
            [
                1293,
                1323
            ],
            [
                1327,
                1338
            ],
            [
                1339,
                1343
            ],
            [
                1344,
                1363
            ],
            [
                1370,
                1375
            ],
            [
                1385,
                1399
            ],
            [
                1399,
                1401
            ],
            [
                1401,
                1445
            ],
            [
                1446,
                1448
            ],
            [
                1452,
                1456
            ],
            [
                1457,
                1462
            ],
            [
                1463,
                1466
            ],
            [
                1467,
                1473
            ],
            [
                1474,
                1487
            ],
            [
                1488,
                1495
            ],
            [
                1496,
                1504
            ],
            [
                1508,
                1511
            ],
            [
                1517,
                1526
            ],
            [
                1527,
                1536
            ],
            [
                1539,
                1544
            ],
            [
                1545,
                1554
            ],
            [
                1570,
                1629
            ],
            [
                1630,
                1634
            ],
            [
                1635,
                1641
            ],
            [
                1648,
                1683
            ],
            [
                1683,
                1707
            ],
            [
                1708,
                1711
            ],
            [
                1712,
                1727
            ],
            [
                1728,
                1730
            ],
            [
                1739,
                1754
            ],
            [
                1755,
                1757
            ],
            [
                1758,
                1766
            ],
            [
                1772,
                1774
            ],
            [
                1783,
                1792
            ],
            [
                1793,
                1807
            ],
            [
                1808,
                1820
            ],
            [
                1820,
                1821
            ],
            [
                1822,
                1879
            ],
            [
                1880,
                1882
            ],
            [
                1883,
                1886
            ],
            [
                1886,
                1888
            ],
            [
                1888,
                1903
            ],
            [
                1904,
                1918
            ],
            [
                1931,
                1933
            ],
            [
                1933,
                2015
            ],
            [
                2015,
                2018
            ],
            [
                2019,
                2026
            ],
            [
                2032,
                2065
            ],
            [
                2065,
                2125
            ],
            [
                2125,
                2130
            ],
            [
                2137,
                2139
            ],
            [
                2145,
                2180
            ],
            [
                2189,
                2237
            ],
            [
                2237,
                2289
            ],
            [
                2290,
                2303
            ],
            [
                2306,
                2313
            ],
            [
                2314,
                2332
            ],
            [
                2332,
                2334
            ],
            [
                2334,
                2365
            ],
            [
                2366,
                2369
            ],
            [
                2370,
                2392
            ],
            [
                2392,
                2393
            ],
            [
                2394,
                2489
            ],
            [
                2489,
                2491
            ],
            [
                2492,
                2509
            ],
            [
                2510,
                2522
            ],
            [
                2533,
                2546
            ],
            [
                2547,
                2609
            ],
            [
                2619,
                2625
            ],
            [
                2632,
                2707
            ],
            [
                2713,
                2724
            ],
            [
                2733,
                2745
            ],
            [
                2745,
                2764
            ],
            [
                2765,
                2788
            ],
            [
                2788,
                2789
            ],
            [
                2790,
                2801
            ],
            [
                2816,
                2853
            ],
            [
                2863,
                2875
            ],
            [
                2891,
                2892
            ],
            [
                2893,
                2933
            ],
            [
                2933,
                2978
            ],
            [
                2981,
                2984
            ],
            [
                2988,
                3001
            ],
            [
                3004,
                3020
            ],
            [
                3021,
                3027
            ],
            [
                3035,
                3046
            ],
            [
                3053,
                3102
            ],
            [
                3103,
                3115
            ],
            [
                3116,
                3132
            ],
            [
                3135,
                3137
            ],
            [
                3137,
                3225
            ],
            [
                3232,
                3234
            ],
            [
                3234,
                3250
            ],
            [
                3260,
                3271
            ],
            [
                3271,
                3273
            ],
            [
                3273,
                3343
            ],
            [
                3351,
                3366
            ],
            [
                3366,
                3375
            ],
            [
                3382,
                3431
            ],
            [
                3431,
                3497
            ],
            [
                3498,
                3516
            ],
            [
                3529,
                3531
            ],
            [
                3531,
                3566
            ],
            [
                3572,
                3597
            ],
            [
                3597,
                3647
            ],
            [
                3647,
                3649
            ],
            [
                3653,
                3725
            ],
            [
                3725,
                3791
            ],
            [
                3792,
                3841
            ],
            [
                3841,
                3901
            ],
            [
                3901,
                3916
            ],
            [
                3922,
                3935
            ],
            [
                3936,
                3955
            ],
            [
                3978,
                3980
            ],
            [
                3981,
                3989
            ],
            [
                3990,
                4020
            ],
            [
                4020,
                4062
            ],
            [
                4063,
                4067
            ],
            [
                4068,
                4142
            ],
            [
                4143,
                4184
            ],
            [
                4185,
                4210
            ],
            [
                4223,
                4228
            ],
            [
                4228,
                4230
            ],
            [
                4230,
                4259
            ],
            [
                4260,
                4296
            ],
            [
                4296,
                4325
            ],
            [
                4325,
                4379
            ],
            [
                4380,
                4400
            ],
            [
                4400,
                4464
            ],
            [
                4464,
                4477
            ],
            [
                4478,
                4480
            ],
            [
                4481,
                4514
            ],
            [
                4520,
                4522
            ],
            [
                4522,
                4541
            ],
            [
                4551,
                4649
            ],
            [
                4649,
                4651
            ],
            [
                4651,
                4707
            ],
            [
                4708,
                4778
            ],
            [
                4781,
                4848
            ],
            [
                4848,
                4868
            ],
            [
                4869,
                4905
            ],
            [
                4905,
                4930
            ],
            [
                4931,
                4939
            ],
            [
                4955,
                4958
            ],
            [
                4965,
                4967
            ],
            [
                4968,
                4970
            ],
            [
                4976,
                4978
            ],
            [
                4978,
                4992
            ],
            [
                4993,
                5016
            ],
            [
                5041,
                5043
            ],
            [
                5043,
                5095
            ],
            [
                5096,
                5101
            ],
            [
                5107,
                5129
            ],
            [
                5129,
                5157
            ],
            [
                5164,
                5170
            ],
            [
                5170,
                5229
            ],
            [
                5229,
                5334
            ],
            [
                5340,
                5351
            ],
            [
                5352,
                5356
            ],
            [
                5357,
                5367
            ],
            [
                5367,
                5380
            ],
            [
                5384,
                5388
            ],
            [
                5389,
                5412
            ],
            [
                5413,
                5433
            ],
            [
                5442,
                5444
            ],
            [
                5444,
                5506
            ],
            [
                5506,
                5565
            ],
            [
                5565,
                5567
            ],
            [
                5567,
                5597
            ],
            [
                5602,
                5656
            ],
            [
                5656,
                5718
            ],
            [
                5718,
                5720
            ],
            [
                5725,
                5731
            ],
            [
                5741,
                5744
            ],
            [
                5755,
                5791
            ],
            [
                5791,
                5811
            ],
            [
                5812,
                5815
            ],
            [
                5816,
                5829
            ],
            [
                5829,
                5883
            ],
            [
                5883,
                5885
            ],
            [
                5885,
                5887
            ],
            [
                5888,
                5892
            ],
            [
                5893,
                5897
            ],
            [
                5898,
                5960
            ],
            [
                5960,
                5981
            ],
            [
                5988,
                5997
            ],
            [
                5997,
                5998
            ],
            [
                5999,
                6001
            ],
            [
                6014,
                6030
            ],
            [
                6032,
                6067
            ],
            [
                6068,
                6089
            ],
            [
                6089,
                6105
            ],
            [
                6105,
                6131
            ],
            [
                6131,
                6152
            ],
            [
                6152,
                6273
            ],
            [
                6274,
                6283
            ],
            [
                6283,
                6316
            ],
            [
                6316,
                6358
            ],
            [
                6358,
                6374
            ],
            [
                6374,
                6477
            ],
            [
                6481,
                6510
            ],
            [
                6510,
                6537
            ],
            [
                6542,
                6548
            ],
            [
                6555,
                6557
            ],
            [
                6561,
                6571
            ],
            [
                6571,
                6574
            ],
            [
                6575,
                6613
            ],
            [
                6613,
                6615
            ],
            [
                6615,
                6667
            ],
            [
                6668,
                6758
            ],
            [
                6759,
                6778
            ],
            [
                6778,
                6793
            ],
            [
                6794,
                6802
            ],
            [
                6802,
                6830
            ],
            [
                6831,
                6835
            ],
            [
                6842,
                6844
            ],
            [
                6844,
                6852
            ],
            [
                6857,
                6860
            ],
            [
                6861,
                6876
            ],
            [
                6876,
                6897
            ],
            [
                6913,
                6937
            ],
            [
                6938,
                6940
            ],
            [
                6945,
                6968
            ],
            [
                6969,
                7050
            ],
            [
                7052,
                7074
            ],
            [
                7074,
                7076
            ],
            [
                7077,
                7157
            ],
            [
                7158,
                7216
            ],
            [
                7219,
                7222
            ],
            [
                7231,
                7234
            ],
            [
                7242,
                7246
            ],
            [
                7246,
                7299
            ],
            [
                7300,
                7319
            ],
            [
                7319,
                7333
            ],
            [
                7334,
                7341
            ],
            [
                7347,
                7364
            ],
            [
                7364,
                7366
            ],
            [
                7366,
                7368
            ],
            [
                7378,
                7386
            ],
            [
                7392,
                7450
            ],
            [
                7451,
                7453
            ],
            [
                7465,
                7475
            ],
            [
                7475,
                7480
            ],
            [
                7481,
                7553
            ],
            [
                7553,
                7555
            ],
            [
                7555,
                7614
            ],
            [
                7621,
                7629
            ],
            [
                7630,
                7648
            ],
            [
                7648,
                7705
            ],
            [
                7705,
                7736
            ],
            [
                7738,
                7739
            ],
            [
                7739,
                7773
            ],
            [
                7773,
                7857
            ],
            [
                7859,
                7941
            ],
            [
                7941,
                7978
            ],
            [
                7978,
                8008
            ],
            [
                8008,
                8045
            ],
            [
                8045,
                8047
            ],
            [
                8048,
                8084
            ],
            [
                8084,
                8122
            ],
            [
                8122,
                8124
            ],
            [
                8125,
                8159
            ],
            [
                8162,
                8169
            ],
            [
                8169,
                8170
            ],
            [
                8173,
                8184
            ],
            [
                8185,
                8188
            ],
            [
                8202,
                8205
            ],
            [
                8206,
                8208
            ],
            [
                8209,
                8219
            ],
            [
                8221,
                8267
            ],
            [
                8267,
                8269
            ],
            [
                8270,
                8339
            ],
            [
                8344,
                8347
            ],
            [
                8347,
                8402
            ],
            [
                8402,
                8432
            ],
            [
                8433,
                8480
            ],
            [
                8480,
                8504
            ],
            [
                8505,
                8535
            ],
            [
                8536,
                8588
            ],
            [
                8588,
                8648
            ],
            [
                8655,
                8664
            ],
            [
                8665,
                8694
            ],
            [
                8694,
                8741
            ]
        ],
        "row_chars": [
            [
                0,
                145
            ],
            [
                145,
                192
            ],
            [
                192,
                192
            ],
            [
                192,
                297
            ],
            [
                297,
                360
            ],
            [
                360,
                422
            ],
            [
                422,
                422
            ],
            [
                422,
                514
            ],
            [
                514,
                658
            ],
            [
                658,
                737
            ],
            [
                737,
                890
            ],
            [
                890,
                952
            ],
            [
                952,
                952
            ],
            [
                952,
                1005
            ],
            [
                1005,
                1005
            ],
            [
                1005,
                1005
            ],
            [
                1005,
                1005
            ],
            [
                1005,
                1005
            ],
            [
                1005,
                1186
            ],
            [
                1186,
                1230
            ],
            [
                1230,
                1323
            ],
            [
                1323,
                1401
            ],
            [
                1401,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1555
            ],
            [
                1555,
                1683
            ],
            [
                1683,
                1822
            ],
            [
                1822,
                1888
            ],
            [
                1888,
                1933
            ],
            [
                1933,
                2015
            ],
            [
                2015,
                2065
            ],
            [
                2065,
                2237
            ],
            [
                2237,
                2334
            ],
            [
                2334,
                2394
            ],
            [
                2394,
                2489
            ],
            [
                2489,
                2510
            ],
            [
                2510,
                2522
            ],
            [
                2522,
                2745
            ],
            [
                2745,
                2853
            ],
            [
                2853,
                2893
            ],
            [
                2893,
                2933
            ],
            [
                2933,
                3046
            ],
            [
                3046,
                3137
            ],
            [
                3137,
                3234
            ],
            [
                3234,
                3273
            ],
            [
                3273,
                3431
            ],
            [
                3431,
                3531
            ],
            [
                3531,
                3597
            ],
            [
                3597,
                3649
            ],
            [
                3649,
                3649
            ],
            [
                3649,
                3725
            ],
            [
                3725,
                3841
            ],
            [
                3841,
                3901
            ],
            [
                3901,
                4020
            ],
            [
                4020,
                4143
            ],
            [
                4143,
                4230
            ],
            [
                4230,
                4296
            ],
            [
                4296,
                4325
            ],
            [
                4325,
                4400
            ],
            [
                4400,
                4464
            ],
            [
                4464,
                4522
            ],
            [
                4522,
                4651
            ],
            [
                4651,
                4848
            ],
            [
                4848,
                4905
            ],
            [
                4905,
                4978
            ],
            [
                4978,
                4978
            ],
            [
                4978,
                4978
            ],
            [
                4978,
                5043
            ],
            [
                5043,
                5096
            ],
            [
                5096,
                5096
            ],
            [
                5096,
                5129
            ],
            [
                5129,
                5170
            ],
            [
                5170,
                5229
            ],
            [
                5229,
                5367
            ],
            [
                5367,
                5444
            ],
            [
                5444,
                5506
            ],
            [
                5506,
                5567
            ],
            [
                5567,
                5656
            ],
            [
                5656,
                5718
            ],
            [
                5718,
                5791
            ],
            [
                5791,
                5829
            ],
            [
                5829,
                5885
            ],
            [
                5885,
                5960
            ],
            [
                5960,
                5999
            ],
            [
                5999,
                5999
            ],
            [
                5999,
                6089
            ],
            [
                6089,
                6105
            ],
            [
                6105,
                6131
            ],
            [
                6131,
                6152
            ],
            [
                6152,
                6283
            ],
            [
                6283,
                6316
            ],
            [
                6316,
                6358
            ],
            [
                6358,
                6374
            ],
            [
                6374,
                6510
            ],
            [
                6510,
                6571
            ],
            [
                6571,
                6571
            ],
            [
                6571,
                6615
            ],
            [
                6615,
                6668
            ],
            [
                6668,
                6778
            ],
            [
                6778,
                6802
            ],
            [
                6802,
                6844
            ],
            [
                6844,
                6876
            ],
            [
                6876,
                6969
            ],
            [
                6969,
                7052
            ],
            [
                7052,
                7052
            ],
            [
                7052,
                7077
            ],
            [
                7077,
                7077
            ],
            [
                7077,
                7158
            ],
            [
                7158,
                7216
            ],
            [
                7216,
                7246
            ],
            [
                7246,
                7319
            ],
            [
                7319,
                7366
            ],
            [
                7366,
                7451
            ],
            [
                7451,
                7451
            ],
            [
                7451,
                7475
            ],
            [
                7475,
                7555
            ],
            [
                7555,
                7555
            ],
            [
                7555,
                7705
            ],
            [
                7705,
                7773
            ],
            [
                7773,
                7859
            ],
            [
                7859,
                7859
            ],
            [
                7859,
                7859
            ],
            [
                7859,
                7859
            ],
            [
                7859,
                7941
            ],
            [
                7941,
                7978
            ],
            [
                7978,
                8008
            ],
            [
                8008,
                8047
            ],
            [
                8047,
                8084
            ],
            [
                8084,
                8122
            ],
            [
                8122,
                8122
            ],
            [
                8122,
                8122
            ],
            [
                8122,
                8221
            ],
            [
                8221,
                8269
            ],
            [
                8269,
                8269
            ],
            [
                8269,
                8347
            ],
            [
                8347,
                8402
            ],
            [
                8402,
                8480
            ],
            [
                8480,
                8480
            ],
            [
                8480,
                8588
            ],
            [
                8588,
                8694
            ],
            [
                8694,
                8741
            ]
        ]
    }
}