{
    "original": {
        "text": "It will no doubt be understood that George Vavasor did not roam about in the woods unshorn, or wear leathern trappings and sandals, like Robinson Crusoe, instead of coats and trousers. His wildness was of another kind. Indeed, I don't know that he was in truth at all wild, though Lady Macleod had called him so, and Alice had assented to her use of the word.\nGeorge Vavasor had lived in London since he was twenty, and now, at the time of the beginning of my story, he was a year or two over thirty. He was and ever had been the heir to his grandfather's estate; but that estate was small, and when George first came to London his father was a strong man of forty, with as much promise of life in him as his son had. A profession had therefore been absolutely necessary to him; and he had, at his uncle John's instance, been placed in the office of a parliamentary land agent. With this parliamentary land agent he had quarrelled to the knife, but not before he had by his talents made himself so useful that he had before him the prospects of a lucrative partnership in the business. George Vavasor had many faults, but idleness--absolute idleness--was not one of them. He would occasionally postpone his work to pleasure. He would be at Newmarket when he should have been at Whitehall. But it was not usual with him to be in bed when he should be at his desk, and when he was at his desk he did not whittle his ruler, or pick his teeth, or clip his nails. Upon the whole his friends were pleased with the first five years of his life in London--in spite of his having been found to be in debt on more than one occasion. But his debts had been paid; and all was going on swimmingly, when one day he knocked down the parliamentary agent with a blow between the eyes, and then there was an end of that. He himself was wont to say that he had known very well what he was about, that it had behoved him to knock down the man who was to have been his partner, and that he regretted nothing in the matter. At any rate the deed was looked upon with approving eyes by many men of good standing,--or, at any rate, sufficient standing to help George to another position; and within six weeks of the time of his leaving the office at Whitehall, he had become a partner in an established firm of wine merchants. A great-aunt had just then left him a couple of thousand pounds, which no doubt assisted him in his views with the wine merchants.\nIn this employment he remained for another period of five years, and was supposed by all his friends to be doing very well. And indeed he did not do badly, only that he did not do well enough to satisfy himself. He was ambitious of making the house to which he belonged the first house in the trade in London, and scared his partners by the boldness and extent of his views. He himself declared that if they would only have gone along with him he would have made them princes in the wine market. But they were men either of more prudence or of less audacity than he, and they declined to walk in his courses. At the end of the five years Vavasor left the house, not having knocked any one down on this occasion, and taking with him a very nice sum of money.\nThe two last of these five years had certainly been the best period of his life, for he had really worked very hard, like a man, giving up all pleasure that took time from him,--and giving up also most pleasures which were dangerous on account of their costliness. He went to no races, played no billiards, and spoke of Cremorne as a childish thing, which he had abandoned now that he was no longer a child. It was during these two years that he had had his love passages with his cousin; and it must be presumed that he had, at any rate, intended at one time to settle himself respectably as a married man. He had, however, behaved very badly to Alice, and the match had been broken off.\nHe had also during the last two years quarrelled with his grandfather. He had wished to raise a sum of money on the Vavasor estate, which, as it was unentailed, he could only do with his grandfather's concurrence. The old gentleman would not hear of it,--would listen with no patience to the proposition. It was in vain that George attempted to make the squire understand that the wine business was going on very well, that he himself owed no man anything, that everything with him was flourishing;--but that his trade might be extended indefinitely by the use of a few thousand pounds at moderate interest. Old Mr. Vavasor was furious. No documents and no assurances could make him lay aside a belief that the wine merchants, and the business, and his grandson were all ruined and ruinous together. No one but a ruined man would attempt to raise money on the family estate! So they had quarrelled, and had never spoken or seen each other since. \"He shall have the estate for his life,\" the squire said to his son John. \"I don't think I have a right to leave it away from him. It never has been left away from the heir. But I'll tie it up so that he shan't cut a tree on it.\" John Vavasor perhaps thought that the old rule of primogeniture might under such circumstances have been judiciously abandoned--in this one instance, in his own favour. But he did not say so. Nor would he have said it had there been a chance of his doing so with success. He was a man from whom no very noble deed could be expected; but he was also one who would do no ignoble deed.\nAfter that George Vavasor had become a stockbroker, and a stockbroker he was now. In the first twelve months after his leaving the wine business,--the same being the first year after his breach with Alice,--he had gone back greatly in the estimation of men. He had lived in open defiance of decency. He had spent much money and had apparently made none, and had been, as all his friends declared, on the high road to ruin. Aunt Macleod had taken her judgement from this period of his life when she had spoken of him as a man who never did anything. But he had come forth again suddenly as a working man; and now they who professed to know, declared that he was by no means poor. He was in the City every day; and during the last two years had earned the character of a shrewd fellow who knew what he was about, who might not perhaps be very mealy-mouthed in affairs of business, but who was fairly and decently honourable in his money transactions. In fact, he stood well on 'Change.\nAnd during these two years he had stood a contest for a seat in Parliament, having striven to represent the metropolitan borough of Chelsea, on the extremely Radical interest. It is true that he had failed, and that he had spent a considerable sum of money in the contest. \"Where on earth does your nephew get his money?\" men said to John Vavasor at his club. \"Upon my word I don't know,\" said Vavasor. \"He doesn't get it from me, and I'm sure he doesn't get it from my father.\" But George Vavasor, though he failed at Chelsea, did not spend his money altogether fruitlessly. He gained reputation by the struggle, and men came to speak of him as though he were one who would do something. He was a stockbroker, a thorough-going Radical, and yet he was the heir to a fine estate, which had come down from father to son for four hundred years! There was something captivating about his history and adventures, especially as just at the time of the election he became engaged to an heiress, who died a month before the marriage should have taken place. She died without a will, and her money all went to some third cousins.\nGeorge Vavasor bore this last disappointment like a man, and it was at this time that he again became fully reconciled to his cousin. Previous to this they had met; and Alice, at her cousin Kate's instigation, had induced her father to meet him. But at first there had been no renewal of real friendship. Alice had given her cordial assent to her cousin's marriage with the heiress, Miss Grant, telling Kate that such an engagement was the very thing to put him thoroughly on his feet. And then she had been much pleased by his spirit at that Chelsea election. \"It was grand of him, wasn't it?\" said Kate, her eyes brimming full of tears. \"It was very spirited,\" said Alice. \"If you knew all, you would say so. They could get no one else to stand but that Mr. Travers, and he wouldn't come forward, unless they would guarantee all his expenses.\" \"I hope it didn't cost George much,\" said Alice. \"It did, though; nearly all he had got. But what matters? Money's nothing to him, except for its uses. My own little mite is my own now, and he shall have every farthing of it for the next election, even though I should go out as a housemaid the next day.\" There must have been something great about George Vavasor, or he would not have been so idolized by such a girl as his sister Kate.\nEarly in the present spring, before the arrangements for the Swiss journey were made, George Vavasor had spoken to Alice about that intended marriage which had been broken off by the lady's death. He was sitting one evening with his cousin in the drawing-room in Queen Anne Street, waiting for Kate, who was to join him there before going to some party. I wonder whether Kate had had a hint from her brother to be late! At any rate, the two were together for an hour, and the talk had been all about himself. He had congratulated her on her engagement with Mr. Grey, which had just become known to him, and had then spoken of his own last intended marriage.\n\"I grieved for her,\" he said, \"greatly.\"\n\"I'm sure you did, George.\"\n\"Yes, I did;--for her, herself. Of course the world has given me credit for lamenting the loss of her money. But the truth is, that as regards both herself and her money, it is much better for me that we were never married.\"\n\"Do you mean even though she should have lived?\"\n\"Yes;--even had she lived.\"\n\"And why so? If you liked her, her money was surely no drawback.\"\n\"No; not if I had liked her.\"\n\"And did you not like her?\"\n\"No.\"\n\"Oh, George!\"\n\"I did not love her as a man should love his wife, if you mean that. As for my liking her, I did like her. I liked her very much.\"\n\"But you would have loved her?\"\n\"I don't know. I don't find that task of loving so very easy. It might have been that I should have learned to hate her.\"\n\"If so, it is better for you, and better for her, that she has gone.\"\n\"It is better. I am sure of it. And yet I grieve for her, and in thinking of her I almost feel as though I were guilty of her death.\"\n\"But she never suspected that you did not love her?\"\n\"Oh no. But she was not given to think much of such things. She took all that for granted. Poor girl! she is at rest now, and her money has gone, where it should go, among her own relatives.\"\n\"Yes; with such feelings as yours are about her, her money would have been a burden to you.\"\n\"I would not have taken it. I hope, at least, that I would not have taken it. Money is a sore temptation, especially to a poor man like me. It is well for me that the trial did not come in my way.\"\n\"But you are not such a very poor man now, are you, George? I thought your business was a good one.\"\n\"It is, and I have no right to be a poor man. But a man will be poor who does such mad things as I do. I had three or four thousand pounds clear, and I spent every shilling of it on the Chelsea election. Goodness knows whether I shall have a shilling at all when another chance comes round; but if I have I shall certainly spend it, and if I have not, I shall go in debt wherever I can raise a hundred pounds.\"\n\"I hope you will be successful at last.\"\n\"I feel sure that I shall. But, in the mean time, I cannot but know that my career is perfectly reckless. No woman ought to join her lot to mine unless she has within her courage to be as reckless as I am. You know what men do when they toss up for shillings?\"\n\"Yes, I suppose I do.\"\n\"I am tossing up every day of my life for every shilling that I have.\"\n\"Do you mean that you're--gambling?\"\n\"No. I have given that up altogether. I used to gamble, but I never do that now, and never shall again. What I mean is this,--that I hold myself in readiness to risk everything at any moment, in order to gain any object that may serve my turn. I am always ready to lead a forlorn hope. That's what I mean by tossing up every day for every shilling that I have.\"\nAlice did not quite understand him, and perhaps he did not intend that she should. Perhaps his object was to mystify her imagination. She did not understand him, but I fear that she admired the kind of courage which he professed. And he had not only professed it: in that matter of the past election he had certainly practised it.\nIn talking of beauty to his sister he had spoken of himself as being ugly. He would not generally have been called ugly by women, had not one side of his face been dreadfully scarred by a cicatrice, which in healing, had left a dark indented line down from his left eye to his lower jaw. That black ravine running through his cheek was certainly ugly. On some occasions, when he was angry or disappointed, it was very hideous; for he would so contort his face that the scar would, as it were, stretch itself out, revealing all its horrors, and his countenance would become all scar. \"He looked at me like the devil himself--making the hole in his face gape at me,\" the old squire had said to John Vavasor in describing the interview in which the grandson had tried to bully his grandfather into assenting to his own views about the mortgage. But in other respects George's face was not ugly, and might have been thought handsome by many women. His hair was black, and was parted in the front. His forehead, though low, was broad. His eyes were dark and bright, and his eyebrows were very full, and perfectly black. At those periods of his anger, all his face which was not scar, was eye and eyebrow. He wore a thick black moustache, which covered his mouth, but no whiskers. People said of him that he was so proud of his wound that he would not grow a hair to cover it. The fact, however, was that no whisker could be made to come sufficiently forward to be of service, and therefore he wore none.\nThe story of that wound should be told. When he was yet hardly more than a boy, before he had come up to London, he was living in a house in the country which his father then occupied. At the time his father was absent, and he and his sister only were in the house with the maid-servants. His sister had a few jewels in her room, and an exaggerated report of them having come to the ears of certain enterprising burglars, a little plan was arranged for obtaining them. A small boy was hidden in the house, a window was opened, and at the proper witching hour of night a stout individual crept up-stairs in his stocking-feet, and was already at Kate Vavasor's door,--when, in the dark, dressed only in his nightshirt, wholly unarmed, George Vavasor flew at the fellow's throat. Two hours elapsed before the horror-stricken women of the house could bring men to the place. George's face had then been ripped open from the eye downwards, with some chisel, or house-breaking instrument. But the man was dead. George had wrenched from him his own tool, and having first jabbed him all over with insufficient wounds, had at last driven the steel through his windpipe. The small boy escaped, carrying with him two shillings and threepence which Kate had left upon the drawing-room mantelpiece.\nGeorge Vavasor was rather low in stature, but well made, with small hands and feet, but broad in the chest and strong in the loins. He was a fine horseman and a hard rider; and men who had known him well said that he could fence and shoot with a pistol as few men care to do in these peaceable days. Since volunteering had come up, he had become a captain of Volunteers, and had won prizes with his rifle at Wimbledon.\nSuch had been the life of George Vavasor, and such was his character, and such his appearance. He had always lived alone in London, and did so at present; but just now his sister was much with him, as she was staying up in town with an aunt, another Vavasor by birth, with whom the reader will, if he persevere, become acquainted in course of time. I hope he will persevere a little, for of all the Vavasors Mrs. Greenow was perhaps the best worth knowing. But Kate Vavasor's home was understood to be in her grandfather's house in Westmoreland.\nOn the evening before they started for Switzerland, George and Kate walked from Queen Anne Street, where they had been dining with Alice, to Mrs. Greenow's house. Everything had been settled about luggage, hours of starting, and routes as regarded their few first days; and the common purse had been made over to George. That portion of Mr. Grey's letter had been read which alluded to the Paynims and the glasses of water, and everything had passed in the best of good-humour. \"I'll endeavour to get the cold water for you,\" George had said; \"but as to the breakfasts, I can only hope you won't put me to severe trials by any very early hours. When people go out for pleasure it should be pleasure.\"\nThe brother and sister walked through two or three streets in silence, and then Kate asked a question.\n\"George, I wonder what your wishes really are about Alice?\"\n\"That she shouldn't want her breakfast too early while we are away.\"\n\"That means that I'm to hold my tongue, of course.\"\n\"No, it doesn't.\"\n\"Then it means that you intend to hold yours.\"\n\"No; not that either.\"\n\"Then what does it mean?\"\n\"That I have no fixed wishes on the subject. Of course she'll marry this man John Grey, and then no one will hear another word about her.\"\n\"She will no doubt, if you don't interfere. Probably she will whether you interfere or not. But if you wish to interfere--\"\n\"She's got four hundred a year, and is not so good-looking as she was.\"\n\"Yes; she has got four hundred a year, and she is more handsome now than ever she was. I know that you think so;--and that you love her and love no one else--unless you have a sneaking fondness for me.\"\n\"I'll leave you to judge of that last.\"\n\"And as for me,--I only love two people in the world; her and you. If ever you mean to try, you should try now.\"",
        "paragraph_chars": [
            [
                0,
                360
            ],
            [
                360,
                2433
            ],
            [
                2433,
                3191
            ],
            [
                3191,
                3880
            ],
            [
                3880,
                5439
            ],
            [
                5439,
                6423
            ],
            [
                6423,
                7544
            ],
            [
                7544,
                8828
            ],
            [
                8828,
                9486
            ],
            [
                9486,
                9527
            ],
            [
                9527,
                9555
            ],
            [
                9555,
                9780
            ],
            [
                9780,
                9829
            ],
            [
                9829,
                9857
            ],
            [
                9857,
                9923
            ],
            [
                9923,
                9953
            ],
            [
                9953,
                9981
            ],
            [
                9981,
                9987
            ],
            [
                9987,
                10001
            ],
            [
                10001,
                10132
            ],
            [
                10132,
                10164
            ],
            [
                10164,
                10286
            ],
            [
                10286,
                10356
            ],
            [
                10356,
                10490
            ],
            [
                10490,
                10543
            ],
            [
                10543,
                10735
            ],
            [
                10735,
                10828
            ],
            [
                10828,
                11026
            ],
            [
                11026,
                11127
            ],
            [
                11127,
                11538
            ],
            [
                11538,
                11579
            ],
            [
                11579,
                11840
            ],
            [
                11840,
                11863
            ],
            [
                11863,
                11934
            ],
            [
                11934,
                11971
            ],
            [
                11971,
                12333
            ],
            [
                12333,
                12664
            ],
            [
                12664,
                14163
            ],
            [
                14163,
                15450
            ],
            [
                15450,
                15869
            ],
            [
                15869,
                16415
            ],
            [
                16415,
                17116
            ],
            [
                17116,
                17219
            ],
            [
                17219,
                17279
            ],
            [
                17279,
                17348
            ],
            [
                17348,
                17400
            ],
            [
                17400,
                17418
            ],
            [
                17418,
                17465
            ],
            [
                17465,
                17488
            ],
            [
                17488,
                17514
            ],
            [
                17514,
                17653
            ],
            [
                17653,
                17777
            ],
            [
                17777,
                17849
            ],
            [
                17849,
                18052
            ],
            [
                18052,
                18092
            ],
            [
                18092,
                18204
            ]
        ],
        "segment_chars": [
            [
                0,
                185
            ],
            [
                185,
                219
            ],
            [
                219,
                360
            ],
            [
                360,
                501
            ],
            [
                501,
                718
            ],
            [
                718,
                878
            ],
            [
                878,
                1086
            ],
            [
                1086,
                1172
            ],
            [
                1172,
                1225
            ],
            [
                1225,
                1289
            ],
            [
                1289,
                1459
            ],
            [
                1459,
                1623
            ],
            [
                1623,
                1803
            ],
            [
                1803,
                2002
            ],
            [
                2002,
                2302
            ],
            [
                2302,
                2433
            ],
            [
                2433,
                2557
            ],
            [
                2557,
                2645
            ],
            [
                2645,
                2808
            ],
            [
                2808,
                2929
            ],
            [
                2929,
                3042
            ],
            [
                3042,
                3191
            ],
            [
                3191,
                3456
            ],
            [
                3456,
                3599
            ],
            [
                3599,
                3799
            ],
            [
                3799,
                3880
            ],
            [
                3880,
                3951
            ],
            [
                3951,
                4094
            ],
            [
                4094,
                4185
            ],
            [
                4185,
                4488
            ],
            [
                4488,
                4517
            ],
            [
                4517,
                4680
            ],
            [
                4680,
                4755
            ],
            [
                4755,
                4826
            ],
            [
                4826,
                4900
            ],
            [
                4900,
                4957
            ],
            [
                4957,
                5000
            ],
            [
                5000,
                5056
            ],
            [
                5056,
                5225
            ],
            [
                5225,
                5248
            ],
            [
                5248,
                5328
            ],
            [
                5328,
                5439
            ],
            [
                5439,
                5521
            ],
            [
                5521,
                5697
            ],
            [
                5697,
                5739
            ],
            [
                5739,
                5862
            ],
            [
                5862,
                5988
            ],
            [
                5988,
                6118
            ],
            [
                6118,
                6388
            ],
            [
                6388,
                6423
            ],
            [
                6423,
                6599
            ],
            [
                6599,
                6696
            ],
            [
                6696,
                6745
            ],
            [
                6745,
                6783
            ],
            [
                6783,
                6826
            ],
            [
                6826,
                6902
            ],
            [
                6902,
                6999
            ],
            [
                6999,
                7112
            ],
            [
                7112,
                7265
            ],
            [
                7265,
                7473
            ],
            [
                7473,
                7544
            ],
            [
                7544,
                7678
            ],
            [
                7678,
                7790
            ],
            [
                7790,
                7849
            ],
            [
                7849,
                8030
            ],
            [
                8030,
                8105
            ],
            [
                8105,
                8139
            ],
            [
                8139,
                8183
            ],
            [
                8183,
                8219
            ],
            [
                8219,
                8255
            ],
            [
                8255,
                8390
            ],
            [
                8390,
                8439
            ],
            [
                8439,
                8479
            ],
            [
                8479,
                8497
            ],
            [
                8497,
                8542
            ],
            [
                8542,
                8696
            ],
            [
                8696,
                8828
            ],
            [
                8828,
                9025
            ],
            [
                9025,
                9182
            ],
            [
                9182,
                9248
            ],
            [
                9248,
                9337
            ],
            [
                9337,
                9486
            ],
            [
                9486,
                9527
            ],
            [
                9527,
                9555
            ],
            [
                9555,
                9587
            ],
            [
                9587,
                9664
            ],
            [
                9664,
                9780
            ],
            [
                9780,
                9829
            ],
            [
                9829,
                9857
            ],
            [
                9857,
                9870
            ],
            [
                9870,
                9923
            ],
            [
                9923,
                9953
            ],
            [
                9953,
                9981
            ],
            [
                9981,
                9987
            ],
            [
                9987,
                10001
            ],
            [
                10001,
                10070
            ],
            [
                10070,
                10108
            ],
            [
                10108,
                10132
            ],
            [
                10132,
                10164
            ],
            [
                10164,
                10179
            ],
            [
                10179,
                10226
            ],
            [
                10226,
                10286
            ],
            [
                10286,
                10356
            ],
            [
                10356,
                10371
            ],
            [
                10371,
                10388
            ],
            [
                10388,
                10490
            ],
            [
                10490,
                10543
            ],
            [
                10543,
                10551
            ],
            [
                10551,
                10603
            ],
            [
                10603,
                10634
            ],
            [
                10634,
                10645
            ],
            [
                10645,
                10735
            ],
            [
                10735,
                10828
            ],
            [
                10828,
                10856
            ],
            [
                10856,
                10906
            ],
            [
                10906,
                10968
            ],
            [
                10968,
                11026
            ],
            [
                11026,
                11086
            ],
            [
                11086,
                11127
            ],
            [
                11127,
                11173
            ],
            [
                11173,
                11230
            ],
            [
                11230,
                11331
            ],
            [
                11331,
                11538
            ],
            [
                11538,
                11579
            ],
            [
                11579,
                11606
            ],
            [
                11606,
                11685
            ],
            [
                11685,
                11785
            ],
            [
                11785,
                11840
            ],
            [
                11840,
                11863
            ],
            [
                11863,
                11934
            ],
            [
                11934,
                11971
            ],
            [
                11971,
                11976
            ],
            [
                11976,
                12009
            ],
            [
                12009,
                12075
            ],
            [
                12075,
                12215
            ],
            [
                12215,
                12257
            ],
            [
                12257,
                12333
            ],
            [
                12333,
                12416
            ],
            [
                12416,
                12467
            ],
            [
                12467,
                12563
            ],
            [
                12563,
                12664
            ],
            [
                12664,
                12739
            ],
            [
                12739,
                12952
            ],
            [
                12952,
                13016
            ],
            [
                13016,
                13247
            ],
            [
                13247,
                13506
            ],
            [
                13506,
                13608
            ],
            [
                13608,
                13657
            ],
            [
                13657,
                13694
            ],
            [
                13694,
                13779
            ],
            [
                13779,
                13864
            ],
            [
                13864,
                13939
            ],
            [
                13939,
                14035
            ],
            [
                14035,
                14163
            ],
            [
                14163,
                14203
            ],
            [
                14203,
                14348
            ],
            [
                14348,
                14452
            ],
            [
                14452,
                14632
            ],
            [
                14632,
                14940
            ],
            [
                14940,
                15034
            ],
            [
                15034,
                15146
            ],
            [
                15146,
                15168
            ],
            [
                15168,
                15325
            ],
            [
                15325,
                15450
            ],
            [
                15450,
                15582
            ],
            [
                15582,
                15750
            ],
            [
                15750,
                15869
            ],
            [
                15869,
                15964
            ],
            [
                15964,
                16218
            ],
            [
                16218,
                16326
            ],
            [
                16326,
                16415
            ],
            [
                16415,
                16578
            ],
            [
                16578,
                16736
            ],
            [
                16736,
                16893
            ],
            [
                16893,
                17060
            ],
            [
                17060,
                17116
            ],
            [
                17116,
                17219
            ],
            [
                17219,
                17279
            ],
            [
                17279,
                17348
            ],
            [
                17348,
                17400
            ],
            [
                17400,
                17418
            ],
            [
                17418,
                17465
            ],
            [
                17465,
                17488
            ],
            [
                17488,
                17514
            ],
            [
                17514,
                17559
            ],
            [
                17559,
                17653
            ],
            [
                17653,
                17697
            ],
            [
                17697,
                17745
            ],
            [
                17745,
                17777
            ],
            [
                17777,
                17849
            ],
            [
                17849,
                17936
            ],
            [
                17936,
                18052
            ],
            [
                18052,
                18092
            ],
            [
                18092,
                18159
            ],
            [
                18159,
                18204
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                17,
                82
            ],
            [
                100,
                107
            ],
            [
                119,
                152
            ],
            [
                183,
                185
            ],
            [
                185,
                219
            ],
            [
                219,
                251
            ],
            [
                268,
                272
            ],
            [
                261,
                267
            ],
            [
                358,
                360
            ],
            [
                360,
                419
            ],
            [
                470,
                473
            ],
            [
                420,
                423
            ],
            [
                488,
                501
            ],
            [
                501,
                507
            ],
            [
                526,
                589
            ],
            [
                716,
                718
            ],
            [
                783,
                789
            ],
            [
                735,
                744
            ],
            [
                718,
                730
            ],
            [
                777,
                782
            ],
            [
                794,
                810
            ],
            [
                789,
                790
            ],
            [
                731,
                734
            ],
            [
                821,
                878
            ],
            [
                913,
                930
            ],
            [
                878,
                887
            ],
            [
                902,
                912
            ],
            [
                943,
                959
            ],
            [
                970,
                981
            ],
            [
                963,
                966
            ],
            [
                982,
                986
            ],
            [
                1024,
                1027
            ],
            [
                998,
                1004
            ],
            [
                1084,
                1086
            ],
            [
                1086,
                1130
            ],
            [
                1151,
                1172
            ],
            [
                1172,
                1211
            ],
            [
                1215,
                1225
            ],
            [
                1225,
                1249
            ],
            [
                1250,
                1289
            ],
            [
                1289,
                1292
            ],
            [
                1367,
                1401
            ],
            [
                1457,
                1458
            ],
            [
                1459,
                1546
            ],
            [
                1548,
                1559
            ],
            [
                1621,
                1623
            ],
            [
                1623,
                1636
            ],
            [
                1646,
                1737
            ],
            [
                1766,
                1771
            ],
            [
                1783,
                1786
            ],
            [
                1758,
                1761
            ],
            [
                1790,
                1803
            ],
            [
                2234,
                2242
            ],
            [
                2142,
                2161
            ],
            [
                2087,
                2088
            ],
            [
                2250,
                2302
            ],
            [
                2302,
                2381
            ],
            [
                2391,
                2397
            ],
            [
                2413,
                2431
            ],
            [
                2431,
                2433
            ],
            [
                2433,
                2475
            ],
            [
                2486,
                2501
            ],
            [
                2571,
                2588
            ],
            [
                2602,
                2645
            ],
            [
                2645,
                2661
            ],
            [
                2672,
                2675
            ],
            [
                2741,
                2782
            ],
            [
                2794,
                2808
            ],
            [
                3042,
                3070
            ],
            [
                3071,
                3087
            ],
            [
                3088,
                3113
            ],
            [
                3122,
                3191
            ],
            [
                3191,
                3306
            ],
            [
                3454,
                3456
            ],
            [
                3599,
                3683
            ],
            [
                3712,
                3715
            ],
            [
                3730,
                3738
            ],
            [
                3751,
                3753
            ],
            [
                3784,
                3785
            ],
            [
                3786,
                3799
            ],
            [
                3799,
                3880
            ],
            [
                3880,
                3891
            ],
            [
                3918,
                3951
            ],
            [
                3951,
                4017
            ],
            [
                4041,
                4080
            ],
            [
                4092,
                4094
            ],
            [
                4094,
                4132
            ],
            [
                4183,
                4185
            ],
            [
                4192,
                4199
            ],
            [
                4205,
                4211
            ],
            [
                4222,
                4278
            ],
            [
                4366,
                4377
            ],
            [
                4297,
                4298
            ],
            [
                4380,
                4407
            ],
            [
                4408,
                4416
            ],
            [
                4430,
                4465
            ],
            [
                4486,
                4487
            ],
            [
                4488,
                4517
            ],
            [
                4582,
                4605
            ],
            [
                4625,
                4657
            ],
            [
                4678,
                4680
            ],
            [
                4680,
                4755
            ],
            [
                4755,
                4825
            ],
            [
                4826,
                4851
            ],
            [
                4864,
                4889
            ],
            [
                4890,
                4900
            ],
            [
                4957,
                5000
            ],
            [
                5000,
                5056
            ],
            [
                5056,
                5125
            ],
            [
                5151,
                5182
            ],
            [
                5184,
                5191
            ],
            [
                5204,
                5225
            ],
            [
                5225,
                5247
            ],
            [
                5439,
                5521
            ],
            [
                5521,
                5584
            ],
            [
                5616,
                5644
            ],
            [
                5646,
                5657
            ],
            [
                5671,
                5673
            ],
            [
                5692,
                5695
            ],
            [
                5695,
                5697
            ],
            [
                5739,
                5741
            ],
            [
                5797,
                5806
            ],
            [
                5834,
                5842
            ],
            [
                5848,
                5862
            ],
            [
                5862,
                5874
            ],
            [
                5948,
                5950
            ],
            [
                5904,
                5936
            ],
            [
                5958,
                5988
            ],
            [
                5988,
                5991
            ],
            [
                6047,
                6050
            ],
            [
                6093,
                6099
            ],
            [
                6030,
                6037
            ],
            [
                6125,
                6146
            ],
            [
                6116,
                6117
            ],
            [
                6152,
                6177
            ],
            [
                5992,
                5998
            ],
            [
                6182,
                6188
            ],
            [
                6028,
                6029
            ],
            [
                6025,
                6027
            ],
            [
                6206,
                6225
            ],
            [
                6121,
                6124
            ],
            [
                6350,
                6387
            ],
            [
                6423,
                6462
            ],
            [
                6473,
                6526
            ],
            [
                6555,
                6562
            ],
            [
                6463,
                6464
            ],
            [
                6581,
                6588
            ],
            [
                6597,
                6599
            ],
            [
                6599,
                6629
            ],
            [
                6652,
                6653
            ],
            [
                6667,
                6696
            ],
            [
                6902,
                6905
            ],
            [
                6922,
                6938
            ],
            [
                6920,
                6921
            ],
            [
                6951,
                6974
            ],
            [
                6986,
                6999
            ],
            [
                7041,
                7044
            ],
            [
                7050,
                7068
            ],
            [
                7088,
                7112
            ],
            [
                7112,
                7135
            ],
            [
                7151,
                7167
            ],
            [
                7175,
                7193
            ],
            [
                7194,
                7200
            ],
            [
                7263,
                7265
            ],
            [
                7265,
                7344
            ],
            [
                7350,
                7434
            ],
            [
                7439,
                7447
            ],
            [
                7471,
                7473
            ],
            [
                7473,
                7544
            ],
            [
                7544,
                7662
            ],
            [
                7666,
                7678
            ],
            [
                7803,
                7847
            ],
            [
                7937,
                7938
            ],
            [
                7849,
                7926
            ],
            [
                7939,
                8001
            ],
            [
                8017,
                8030
            ],
            [
                8030,
                8033
            ],
            [
                8039,
                8051
            ],
            [
                8057,
                8081
            ],
            [
                8087,
                8104
            ],
            [
                8105,
                8139
            ],
            [
                8139,
                8167
            ],
            [
                8176,
                8182
            ],
            [
                8183,
                8219
            ],
            [
                8390,
                8412
            ],
            [
                8420,
                8424
            ],
            [
                8439,
                8479
            ],
            [
                8497,
                8542
            ],
            [
                8580,
                8611
            ],
            [
                8542,
                8548
            ],
            [
                8615,
                8642
            ],
            [
                8650,
                8651
            ],
            [
                8659,
                8680
            ],
            [
                8693,
                8696
            ],
            [
                8696,
                8780
            ],
            [
                8784,
                8828
            ],
            [
                8828,
                8840
            ],
            [
                8849,
                9025
            ],
            [
                9032,
                9051
            ],
            [
                9068,
                9070
            ],
            [
                9075,
                9087
            ],
            [
                9108,
                9126
            ],
            [
                9136,
                9143
            ],
            [
                9180,
                9182
            ],
            [
                9182,
                9248
            ],
            [
                9248,
                9337
            ],
            [
                9337,
                9394
            ],
            [
                9431,
                9461
            ],
            [
                9467,
                9486
            ],
            [
                9486,
                9527
            ],
            [
                9527,
                9555
            ],
            [
                9587,
                9606
            ],
            [
                9631,
                9664
            ],
            [
                9664,
                9780
            ],
            [
                9780,
                9797
            ],
            [
                9805,
                9808
            ],
            [
                9821,
                9829
            ],
            [
                9829,
                9833
            ],
            [
                9854,
                9857
            ],
            [
                9857,
                9858
            ],
            [
                9862,
                9865
            ],
            [
                9868,
                9870
            ],
            [
                9870,
                9923
            ],
            [
                9923,
                9953
            ],
            [
                9953,
                9981
            ],
            [
                10001,
                10002
            ],
            [
                10108,
                10129
            ],
            [
                10068,
                10069
            ],
            [
                10002,
                10050
            ],
            [
                10129,
                10132
            ],
            [
                10132,
                10151
            ],
            [
                10158,
                10164
            ],
            [
                10164,
                10179
            ],
            [
                10179,
                10211
            ],
            [
                10215,
                10226
            ],
            [
                10250,
                10251
            ],
            [
                10229,
                10234
            ],
            [
                10259,
                10283
            ],
            [
                10388,
                10417
            ],
            [
                10446,
                10450
            ],
            [
                10439,
                10445
            ],
            [
                10468,
                10490
            ],
            [
                10490,
                10543
            ],
            [
                10543,
                10551
            ],
            [
                10603,
                10634
            ],
            [
                10634,
                10645
            ],
            [
                10645,
                10732
            ],
            [
                10829,
                10854
            ],
            [
                10856,
                10862
            ],
            [
                10862,
                10872
            ],
            [
                10904,
                10906
            ],
            [
                10906,
                10932
            ],
            [
                11026,
                11042
            ],
            [
                11048,
                11049
            ],
            [
                11055,
                11063
            ],
            [
                11067,
                11086
            ],
            [
                11086,
                11127
            ],
            [
                11127,
                11173
            ],
            [
                11230,
                11272
            ],
            [
                11277,
                11299
            ],
            [
                11306,
                11331
            ],
            [
                11331,
                11459
            ],
            [
                11487,
                11497
            ],
            [
                11513,
                11518
            ],
            [
                11535,
                11538
            ],
            [
                11538,
                11568
            ],
            [
                11576,
                11579
            ],
            [
                11579,
                11606
            ],
            [
                11606,
                11609
            ],
            [
                11609,
                11610
            ],
            [
                11685,
                11734
            ],
            [
                11662,
                11664
            ],
            [
                11758,
                11785
            ],
            [
                12080,
                12081
            ],
            [
                12109,
                12115
            ],
            [
                12129,
                12213
            ],
            [
                12333,
                12383
            ],
            [
                12439,
                12453
            ],
            [
                12465,
                12467
            ],
            [
                12499,
                12562
            ],
            [
                12716,
                12726
            ],
            [
                12733,
                12739
            ],
            [
                12802,
                12846
            ],
            [
                12792,
                12793
            ],
            [
                12890,
                12896
            ],
            [
                12906,
                12910
            ],
            [
                12911,
                12952
            ],
            [
                12952,
                12969
            ],
            [
                12978,
                13014
            ],
            [
                13143,
                13144
            ],
            [
                13033,
                13039
            ],
            [
                13115,
                13123
            ],
            [
                13043,
                13046
            ],
            [
                13053,
                13055
            ],
            [
                13068,
                13076
            ],
            [
                13082,
                13094
            ],
            [
                13148,
                13150
            ],
            [
                13157,
                13175
            ],
            [
                13202,
                13246
            ],
            [
                13506,
                13534
            ],
            [
                13542,
                13554
            ],
            [
                13606,
                13608
            ],
            [
                13608,
                13626
            ],
            [
                13657,
                13694
            ],
            [
                13694,
                13732
            ],
            [
                13772,
                13777
            ],
            [
                13733,
                13756
            ],
            [
                13777,
                13779
            ],
            [
                13864,
                13896
            ],
            [
                13922,
                13928
            ],
            [
                13937,
                13939
            ],
            [
                13939,
                13950
            ],
            [
                13958,
                14035
            ],
            [
                14035,
                14090
            ],
            [
                14133,
                14163
            ],
            [
                14163,
                14203
            ],
            [
                14203,
                14214
            ],
            [
                14236,
                14237
            ],
            [
                14274,
                14278
            ],
            [
                14290,
                14292
            ],
            [
                14322,
                14332
            ],
            [
                14295,
                14315
            ],
            [
                14346,
                14348
            ],
            [
                14348,
                14386
            ],
            [
                14405,
                14409
            ],
            [
                14387,
                14404
            ],
            [
                14410,
                14452
            ],
            [
                14452,
                14496
            ],
            [
                14497,
                14526
            ],
            [
                14542,
                14553
            ],
            [
                14562,
                14584
            ],
            [
                14585,
                14598
            ],
            [
                14630,
                14632
            ],
            [
                14632,
                14693
            ],
            [
                14835,
                14841
            ],
            [
                14722,
                14732
            ],
            [
                14750,
                14755
            ],
            [
                14766,
                14826
            ],
            [
                14758,
                14759
            ],
            [
                14829,
                14833
            ],
            [
                14896,
                14902
            ],
            [
                14826,
                14827
            ],
            [
                14861,
                14895
            ],
            [
                14911,
                14940
            ],
            [
                15034,
                15047
            ],
            [
                15062,
                15102
            ],
            [
                15108,
                15114
            ],
            [
                15119,
                15146
            ],
            [
                15146,
                15168
            ],
            [
                15168,
                15187
            ],
            [
                15197,
                15209
            ],
            [
                15188,
                15196
            ],
            [
                15209,
                15214
            ],
            [
                15272,
                15325
            ],
            [
                15325,
                15346
            ],
            [
                15448,
                15450
            ],
            [
                15450,
                15468
            ],
            [
                15490,
                15506
            ],
            [
                15538,
                15543
            ],
            [
                15557,
                15567
            ],
            [
                15580,
                15582
            ],
            [
                15582,
                15604
            ],
            [
                15605,
                15608
            ],
            [
                15667,
                15672
            ],
            [
                15683,
                15688
            ],
            [
                15623,
                15626
            ],
            [
                15673,
                15678
            ],
            [
                15654,
                15658
            ],
            [
                15627,
                15630
            ],
            [
                15748,
                15749
            ],
            [
                15964,
                15999
            ],
            [
                16022,
                16047
            ],
            [
                16048,
                16109
            ],
            [
                16111,
                16136
            ],
            [
                16277,
                16289
            ],
            [
                16324,
                16326
            ],
            [
                16326,
                16353
            ],
            [
                16374,
                16405
            ],
            [
                16409,
                16415
            ],
            [
                16415,
                16578
            ],
            [
                16578,
                16619
            ],
            [
                16640,
                16650
            ],
            [
                16663,
                16688
            ],
            [
                16736,
                16740
            ],
            [
                16749,
                16838
            ],
            [
                16865,
                16892
            ],
            [
                17116,
                17145
            ],
            [
                17175,
                17186
            ],
            [
                17196,
                17206
            ],
            [
                17219,
                17279
            ],
            [
                17514,
                17515
            ],
            [
                17520,
                17529
            ],
            [
                17536,
                17559
            ],
            [
                17559,
                17653
            ],
            [
                17653,
                17662
            ],
            [
                17663,
                17697
            ],
            [
                17745,
                17773
            ],
            [
                17777,
                17849
            ],
            [
                17849,
                17936
            ],
            [
                17936,
                17961
            ],
            [
                17963,
                17988
            ],
            [
                17994,
                17996
            ],
            [
                17997,
                18005
            ],
            [
                18007,
                18052
            ],
            [
                18052,
                18076
            ],
            [
                18080,
                18084
            ],
            [
                18089,
                18092
            ],
            [
                18092,
                18093
            ],
            [
                18097,
                18107
            ],
            [
                18109,
                18159
            ],
            [
                18159,
                18204
            ]
        ],
        "row_chars": [
            [
                0,
                185
            ],
            [
                185,
                219
            ],
            [
                219,
                360
            ],
            [
                360,
                501
            ],
            [
                501,
                718
            ],
            [
                718,
                878
            ],
            [
                878,
                1086
            ],
            [
                1086,
                1172
            ],
            [
                1172,
                1225
            ],
            [
                1225,
                1289
            ],
            [
                1289,
                1459
            ],
            [
                1459,
                1623
            ],
            [
                1623,
                1803
            ],
            [
                1803,
                2002
            ],
            [
                2002,
                2302
            ],
            [
                2302,
                2433
            ],
            [
                2433,
                2645
            ],
            [
                2645,
                2808
            ],
            [
                2808,
                2929
            ],
            [
                2929,
                3042
            ],
            [
                3042,
                3191
            ],
            [
                3191,
                3456
            ],
            [
                3456,
                3599
            ],
            [
                3599,
                3799
            ],
            [
                3799,
                3880
            ],
            [
                3880,
                3951
            ],
            [
                3951,
                4094
            ],
            [
                4094,
                4185
            ],
            [
                4185,
                4488
            ],
            [
                4488,
                4517
            ],
            [
                4517,
                4680
            ],
            [
                4680,
                4755
            ],
            [
                4755,
                4826
            ],
            [
                4826,
                4900
            ],
            [
                4900,
                4957
            ],
            [
                4957,
                5000
            ],
            [
                5000,
                5056
            ],
            [
                5056,
                5225
            ],
            [
                5225,
                5248
            ],
            [
                5248,
                5328
            ],
            [
                5328,
                5439
            ],
            [
                5439,
                5521
            ],
            [
                5521,
                5697
            ],
            [
                5697,
                5739
            ],
            [
                5739,
                5862
            ],
            [
                5862,
                5988
            ],
            [
                5988,
                6388
            ],
            [
                6388,
                6423
            ],
            [
                6423,
                6599
            ],
            [
                6599,
                6696
            ],
            [
                6696,
                6745
            ],
            [
                6745,
                6783
            ],
            [
                6783,
                6826
            ],
            [
                6826,
                6902
            ],
            [
                6902,
                6999
            ],
            [
                6999,
                7112
            ],
            [
                7112,
                7265
            ],
            [
                7265,
                7473
            ],
            [
                7473,
                7544
            ],
            [
                7544,
                7678
            ],
            [
                7678,
                7790
            ],
            [
                7790,
                8030
            ],
            [
                8030,
                8105
            ],
            [
                8105,
                8139
            ],
            [
                8139,
                8183
            ],
            [
                8183,
                8219
            ],
            [
                8219,
                8255
            ],
            [
                8255,
                8390
            ],
            [
                8390,
                8439
            ],
            [
                8439,
                8479
            ],
            [
                8479,
                8497
            ],
            [
                8497,
                8542
            ],
            [
                8542,
                8696
            ],
            [
                8696,
                8828
            ],
            [
                8828,
                9025
            ],
            [
                9025,
                9182
            ],
            [
                9182,
                9248
            ],
            [
                9248,
                9337
            ],
            [
                9337,
                9486
            ],
            [
                9486,
                9527
            ],
            [
                9527,
                9555
            ],
            [
                9555,
                9587
            ],
            [
                9587,
                9664
            ],
            [
                9664,
                9780
            ],
            [
                9780,
                9829
            ],
            [
                9829,
                9857
            ],
            [
                9857,
                9870
            ],
            [
                9870,
                9923
            ],
            [
                9923,
                9953
            ],
            [
                9953,
                9981
            ],
            [
                9981,
                9987
            ],
            [
                9987,
                10001
            ],
            [
                10001,
                10132
            ],
            [
                10132,
                10164
            ],
            [
                10164,
                10179
            ],
            [
                10179,
                10226
            ],
            [
                10226,
                10286
            ],
            [
                10286,
                10356
            ],
            [
                10356,
                10371
            ],
            [
                10371,
                10388
            ],
            [
                10388,
                10490
            ],
            [
                10490,
                10543
            ],
            [
                10543,
                10551
            ],
            [
                10551,
                10603
            ],
            [
                10603,
                10634
            ],
            [
                10634,
                10645
            ],
            [
                10645,
                10735
            ],
            [
                10735,
                10828
            ],
            [
                10828,
                10906
            ],
            [
                10906,
                10968
            ],
            [
                10968,
                11026
            ],
            [
                11026,
                11086
            ],
            [
                11086,
                11127
            ],
            [
                11127,
                11173
            ],
            [
                11173,
                11230
            ],
            [
                11230,
                11331
            ],
            [
                11331,
                11538
            ],
            [
                11538,
                11579
            ],
            [
                11579,
                11606
            ],
            [
                11606,
                11785
            ],
            [
                11785,
                11840
            ],
            [
                11840,
                11863
            ],
            [
                11863,
                11934
            ],
            [
                11934,
                11971
            ],
            [
                11971,
                11976
            ],
            [
                11976,
                12009
            ],
            [
                12009,
                12075
            ],
            [
                12075,
                12215
            ],
            [
                12215,
                12257
            ],
            [
                12257,
                12333
            ],
            [
                12333,
                12467
            ],
            [
                12467,
                12563
            ],
            [
                12563,
                12664
            ],
            [
                12664,
                12739
            ],
            [
                12739,
                12952
            ],
            [
                12952,
                13247
            ],
            [
                13247,
                13506
            ],
            [
                13506,
                13608
            ],
            [
                13608,
                13694
            ],
            [
                13694,
                13779
            ],
            [
                13779,
                13864
            ],
            [
                13864,
                13939
            ],
            [
                13939,
                14035
            ],
            [
                14035,
                14163
            ],
            [
                14163,
                14203
            ],
            [
                14203,
                14348
            ],
            [
                14348,
                14452
            ],
            [
                14452,
                14632
            ],
            [
                14632,
                14940
            ],
            [
                14940,
                15034
            ],
            [
                15034,
                15146
            ],
            [
                15146,
                15168
            ],
            [
                15168,
                15325
            ],
            [
                15325,
                15450
            ],
            [
                15450,
                15582
            ],
            [
                15582,
                15750
            ],
            [
                15750,
                15869
            ],
            [
                15869,
                15964
            ],
            [
                15964,
                16326
            ],
            [
                16326,
                16415
            ],
            [
                16415,
                16578
            ],
            [
                16578,
                16893
            ],
            [
                16893,
                17060
            ],
            [
                17060,
                17116
            ],
            [
                17116,
                17279
            ],
            [
                17279,
                17348
            ],
            [
                17348,
                17400
            ],
            [
                17400,
                17418
            ],
            [
                17418,
                17465
            ],
            [
                17465,
                17488
            ],
            [
                17488,
                17514
            ],
            [
                17514,
                17559
            ],
            [
                17559,
                17653
            ],
            [
                17653,
                17697
            ],
            [
                17697,
                17745
            ],
            [
                17745,
                17777
            ],
            [
                17777,
                17849
            ],
            [
                17849,
                17936
            ],
            [
                17936,
                18052
            ],
            [
                18052,
                18092
            ],
            [
                18092,
                18159
            ],
            [
                18159,
                18204
            ]
        ]
    },
    "abridged": {
        "text": "It will be understood that George Vavasor did not roam about in the woods in leather clothes and sandals, like Robinson Crusoe. His wildness was of another kind. Indeed, I don't know that he was truly wild at all.\nGeorge Vavasor had lived in London since he was twenty, and was now just over thirty. He was the heir to his grandfather's estate; but that estate was small. He had therefore needed a profession; and with his uncle John's help, he had been placed in the office of a parliamentary land agent. He had quarrelled with this land agent, but not before his talents had made him useful. George Vavasor had many faults, but idleness was not one of them. He would occasionally postpone his work for pleasure. He would be at Newmarket races when he should have been at Whitehall. But when he was at his desk he did not waste time.\nUpon the whole his friends were pleased with the first five years of his life in London - in spite of the debts he ran up. But his debts were paid; and all was going on swimmingly, when one day he knocked down the parliamentary agent, and that was the end of that. However, he had friends who helped him to another position, as a partner in an established firm of wine merchants. A great-aunt had just then left him a couple of thousand pounds, which no doubt helped him in the wine merchants' eyes.\nIn this employment he remained for another five years, and did not do badly, but did not do well enough to satisfy himself. He was ambitious for the company, and scared his partners by the boldness of his views. So at the end of the five years George Vavasor left the wine house, not having knocked anyone down on this occasion, and taking with him a very nice sum of money.\nThe two last of these five years had certainly been the best period of his life, for he had really worked very hard. It was during these two years that he had had his love passages with his cousin; and presumably had intended to become a respectable married man. He had, however, behaved very badly to Alice, and the match had been broken off.\nHe had also quarrelled with his grandfather. He had wished to raise a sum of money on the Vavasor estate, which he could only do with his grandfather's agreement. The old gentleman would not hear of it. In vain George tried to make the squire understand that the wine business was flourishing, but that his trade might be greatly extended by the use of a few thousand pounds.\nOld Mr. Vavasor was furious. He was convinced that the wine merchants and his grandson were all ruined. No one but a ruined man would attempt to raise money on the family estate! So they had quarrelled, and had never spoken or seen each other since.\n\"He shall have the estate once I'm gone,\" the squire said to his younger son John. \"It never has been left away from the heir. But I'll tie it up so that he shan't cut a tree on it.\" John Vavasor perhaps thought that the old rule of primogeniture might have been judiciously abandoned in this case, in his own favour. But he did not say so.\nAfter that George Vavasor had become a stockbroker, and a stockbroker he was now. In the first twelve months after his leaving the wine business, and after his breach with Alice, he had gone backwards in men's esteem. He had been, it seemed, on the road to ruin. Aunt Macleod was thinking of this period of his life when she said he was a man who never did anything. But now he was working in the City every day. During the last two years he had earned a reputation as a shrewd fellow who was honourable in his money transactions.\nAnd during these two years he had stood for a seat in Parliament, having striven to represent Chelsea as a Radical candidate. It is true that he had failed, after spending a large sum of money in the contest. But though he failed, he did not spend his money fruitlessly. Men began to speak of him as a man who would do something. He was a stockbroker, a Radical, and yet the heir to a fine old estate! There was something captivating about his history and adventures, especially as at the time of the election he became engaged to an heiress, who died a month before their marriage. She died without a will, and her money all went to some third cousins.\nGeorge Vavasor bore this last disappointment like a man, and it was at this time that he again became fully reconciled with his cousin. Before this there had been no renewal of real friendship, although Alice had given her cordial assent to her cousin's marriage with the heiress, telling Kate that such an engagement was the very thing to put George on his feet. And she had been pleased by his spirit at the Chelsea election.\n\"It was grand of him, wasn't it?\" said Kate, her eyes brimming with tears.\n\"It was very spirited,\" said Alice. \"I hope it didn't cost him much.\"\n\"It did, though; nearly all he had got. But money's nothing to him, except for its uses. He shall have every farthing of my own money for the next election, even if I have go out as a housemaid.\" There must have been something great about George Vavasor, or he would not have been idolized by such a girl as his sister Kate.\nEarly in the spring, before the arrangements for the Swiss journey were made, George Vavasor had spoken to Alice about that intended marriage which had been broken off by the lady's death. They were sitting one evening in her drawing-room, waiting for Kate to join them. I wonder whether Kate had had a hint from her brother to be late! At any rate, the two were together for an hour, and the talk had been all about himself. He had congratulated her on her engagement with Mr. Grey, and had then spoken of his own intended marriage.\n\"I grieved for her,\" he said, \"greatly.\"\n\"I'm sure you did, George.\"\n\"Of course the world thinks I was lamenting the loss of her money. But the truth is, that as regards both herself and her money, it is much better for me that we were never married.\"\n\"Do you mean even if she had lived?\"\n\"Yes.\"\n\"Why? If you liked her, her money was surely no drawback.\"\n\"No; not if I had liked her.\"\n\"And did you not like her?\"\n\"I liked her very much. But I did not love her as a man should love his wife.\"\n\"But you would have come to love her?\"\n\"I don't know. I don't find that task of loving very easy. I might have learned to hate her. And yet I grieve for her, and feel almost guilty of her death.\"\n\"But she never suspected that you did not love her?\"\n\"Oh no. She took all that for granted. Poor girl! she is at rest now, and her money has gone, where it should go, among her own relatives. I would not have taken it - I hope so, at least. Money is a sore temptation.\"\n\"But you are not a poor man, are you, George? I thought your business was a good one.\"\n\"It is, and I have no right to be a poor man. I had three or four thousand pounds clear, but I spent every shilling on the Chelsea election. Goodness knows whether I shall have a shilling at all when another chance comes round; but if I have I shall certainly spend it, or else go in debt to raise the money.\"\n\"I hope you will be successful.\"\n\"I feel sure that I shall. But meamwhile, no woman ought to join her lot to mine unless she is brave enough to be as reckless as I am. I keep myself ready to risk everything at any moment, in order to gain any object that may serve my turn.\"\nAlice did not quite understand him, and perhaps he intended to mystify her. I fear that she admired the kind of courage which he professed.\nGeorge described himself as ugly. One side of his face been dreadfully scarred, with a dark line running down from his left eye to his lower jaw. That black ravine through his cheek was certainly ugly, and sometimes, when his face was distorted by anger or disappointment, it was hideous; for it seemed to stretch itself out, and his countenance would become all scar.\nBut in other respects George was not ugly. His hair was black; his forehead, though low, was broad. His eyes were dark and bright, and his black eyebrows were very full. He wore a thick black moustache, but no sideburns. People said that he was so proud of his wound that he would not grow a hair to cover it. The fact, however, was that no whisker could be made to fully cover it, and therefore he wore none.\nThe story of that wound should be told. When he was a youth, he lived in his father's house in the country. At the time his father was absent, and only he and his sister were in the house with the maid-servants. His sister had a few jewels in her room, and when an exaggerated report of them reached the ears of some enterprising burglars, they hatched a little plan. A small boy was hidden in the house, a window was opened, and in the dead of night a man crept upstairs in his stocking-feet, and was already at Kate Vavasor's door - when George, in his nightshirt, wholly unarmed, flew at the fellow's throat. George's face was ripped open from the eye downwards, with a chisel used as a house-breaking instrument. But the man was dead. George had wrenched his own tool from him, and after several vain jabs, had at last driven the steel through his windpipe. The small boy escaped.\nGeorge Vavasor was not tall, but well made, broad-chested and strong. He was a fine horseman, and could shoot and fence, it was said, better than most men.\nHe had always lived alone in London; but just now his sister Kate was much with him, as she was staying up in town with an aunt - another Vavasor by birth, now called Mrs. Greenow. But Kate Vavasor's home was her grandfather's house in Westmorland.\nOn the evening before they started for Switzerland, George and Kate walked from Queen Anne Street, where they had been dining with Alice, to Mrs. Greenow's house. Everything had been settled about luggage and routes for their few first days; and that part of Mr. Grey's letter had been read which alluded to the Paynims and the glasses of water, in the best of good-humour.\nNow the brother and sister walked in silence, before Kate asked, \"George, I wonder what your wishes really are about Alice?\"\n\"I have no wishes on the subject. Of course she'll marry this man John Grey, and then no one will hear another word about her.\"\n\"She will, no doubt, if you don't interfere. But if you wish to interfere-\"\n\"She's got four hundred a year, and is not so good-looking as she was.\"\n\"Yes; she has got four hundred a year, and she is more handsome now than ever she was. I know that you think so; and that you love her and no-one else - unless you have a sneaking fondness for me.\"\n\"I'll leave you to judge that.\"\n\"As for me, I only love two people in the world; her and you. If ever you mean to try, you should try now.\"",
        "paragraph_chars": [
            [
                0,
                214
            ],
            [
                214,
                835
            ],
            [
                835,
                1335
            ],
            [
                1335,
                1710
            ],
            [
                1710,
                2054
            ],
            [
                2054,
                2430
            ],
            [
                2430,
                2680
            ],
            [
                2680,
                3021
            ],
            [
                3021,
                3552
            ],
            [
                3552,
                4206
            ],
            [
                4206,
                4634
            ],
            [
                4634,
                4709
            ],
            [
                4709,
                4779
            ],
            [
                4779,
                5104
            ],
            [
                5104,
                5638
            ],
            [
                5638,
                5679
            ],
            [
                5679,
                5707
            ],
            [
                5707,
                5890
            ],
            [
                5890,
                5927
            ],
            [
                5927,
                5934
            ],
            [
                5934,
                5993
            ],
            [
                5993,
                6023
            ],
            [
                6023,
                6051
            ],
            [
                6051,
                6130
            ],
            [
                6130,
                6169
            ],
            [
                6169,
                6326
            ],
            [
                6326,
                6379
            ],
            [
                6379,
                6596
            ],
            [
                6596,
                6683
            ],
            [
                6683,
                6993
            ],
            [
                6993,
                7026
            ],
            [
                7026,
                7268
            ],
            [
                7268,
                7408
            ],
            [
                7408,
                7777
            ],
            [
                7777,
                8187
            ],
            [
                8187,
                9072
            ],
            [
                9072,
                9228
            ],
            [
                9228,
                9477
            ],
            [
                9477,
                9851
            ],
            [
                9851,
                9976
            ],
            [
                9976,
                10104
            ],
            [
                10104,
                10180
            ],
            [
                10180,
                10252
            ],
            [
                10252,
                10450
            ],
            [
                10450,
                10482
            ],
            [
                10482,
                10589
            ]
        ],
        "segment_chars": [
            [
                0,
                128
            ],
            [
                128,
                162
            ],
            [
                162,
                214
            ],
            [
                214,
                300
            ],
            [
                300,
                372
            ],
            [
                372,
                506
            ],
            [
                506,
                594
            ],
            [
                594,
                660
            ],
            [
                660,
                714
            ],
            [
                714,
                784
            ],
            [
                784,
                835
            ],
            [
                835,
                958
            ],
            [
                958,
                1100
            ],
            [
                1100,
                1215
            ],
            [
                1215,
                1335
            ],
            [
                1335,
                1459
            ],
            [
                1459,
                1547
            ],
            [
                1547,
                1710
            ],
            [
                1710,
                1827
            ],
            [
                1827,
                1973
            ],
            [
                1973,
                2054
            ],
            [
                2054,
                2099
            ],
            [
                2099,
                2217
            ],
            [
                2217,
                2257
            ],
            [
                2257,
                2430
            ],
            [
                2430,
                2459
            ],
            [
                2459,
                2534
            ],
            [
                2534,
                2609
            ],
            [
                2609,
                2680
            ],
            [
                2680,
                2763
            ],
            [
                2763,
                2807
            ],
            [
                2807,
                2863
            ],
            [
                2863,
                2998
            ],
            [
                2998,
                3021
            ],
            [
                3021,
                3103
            ],
            [
                3103,
                3239
            ],
            [
                3239,
                3284
            ],
            [
                3284,
                3388
            ],
            [
                3388,
                3434
            ],
            [
                3434,
                3552
            ],
            [
                3552,
                3678
            ],
            [
                3678,
                3761
            ],
            [
                3761,
                3823
            ],
            [
                3823,
                3882
            ],
            [
                3882,
                3954
            ],
            [
                3954,
                4135
            ],
            [
                4135,
                4206
            ],
            [
                4206,
                4342
            ],
            [
                4342,
                4570
            ],
            [
                4570,
                4634
            ],
            [
                4634,
                4668
            ],
            [
                4668,
                4709
            ],
            [
                4709,
                4745
            ],
            [
                4745,
                4779
            ],
            [
                4779,
                4819
            ],
            [
                4819,
                4868
            ],
            [
                4868,
                4975
            ],
            [
                4975,
                5104
            ],
            [
                5104,
                5293
            ],
            [
                5293,
                5375
            ],
            [
                5375,
                5441
            ],
            [
                5441,
                5530
            ],
            [
                5530,
                5638
            ],
            [
                5638,
                5679
            ],
            [
                5679,
                5707
            ],
            [
                5707,
                5774
            ],
            [
                5774,
                5890
            ],
            [
                5890,
                5927
            ],
            [
                5927,
                5934
            ],
            [
                5934,
                5940
            ],
            [
                5940,
                5993
            ],
            [
                5993,
                6023
            ],
            [
                6023,
                6051
            ],
            [
                6051,
                6075
            ],
            [
                6075,
                6130
            ],
            [
                6130,
                6169
            ],
            [
                6169,
                6184
            ],
            [
                6184,
                6228
            ],
            [
                6228,
                6262
            ],
            [
                6262,
                6326
            ],
            [
                6326,
                6379
            ],
            [
                6379,
                6387
            ],
            [
                6387,
                6418
            ],
            [
                6418,
                6429
            ],
            [
                6429,
                6518
            ],
            [
                6518,
                6567
            ],
            [
                6567,
                6596
            ],
            [
                6596,
                6642
            ],
            [
                6642,
                6683
            ],
            [
                6683,
                6729
            ],
            [
                6729,
                6824
            ],
            [
                6824,
                6993
            ],
            [
                6993,
                7026
            ],
            [
                7026,
                7053
            ],
            [
                7053,
                7161
            ],
            [
                7161,
                7268
            ],
            [
                7268,
                7344
            ],
            [
                7344,
                7408
            ],
            [
                7408,
                7442
            ],
            [
                7442,
                7554
            ],
            [
                7554,
                7777
            ],
            [
                7777,
                7820
            ],
            [
                7820,
                7877
            ],
            [
                7877,
                7947
            ],
            [
                7947,
                7998
            ],
            [
                7998,
                8087
            ],
            [
                8087,
                8187
            ],
            [
                8187,
                8227
            ],
            [
                8227,
                8295
            ],
            [
                8295,
                8399
            ],
            [
                8399,
                8555
            ],
            [
                8555,
                8799
            ],
            [
                8799,
                8904
            ],
            [
                8904,
                8926
            ],
            [
                8926,
                9049
            ],
            [
                9049,
                9072
            ],
            [
                9072,
                9142
            ],
            [
                9142,
                9228
            ],
            [
                9228,
                9409
            ],
            [
                9409,
                9477
            ],
            [
                9477,
                9640
            ],
            [
                9640,
                9851
            ],
            [
                9851,
                9976
            ],
            [
                9976,
                10010
            ],
            [
                10010,
                10104
            ],
            [
                10104,
                10149
            ],
            [
                10149,
                10180
            ],
            [
                10180,
                10252
            ],
            [
                10252,
                10339
            ],
            [
                10339,
                10450
            ],
            [
                10450,
                10482
            ],
            [
                10482,
                10544
            ],
            [
                10544,
                10589
            ]
        ],
        "overlap_chars": [
            [
                0,
                7
            ],
            [
                8,
                73
            ],
            [
                77,
                84
            ],
            [
                93,
                126
            ],
            [
                126,
                128
            ],
            [
                128,
                162
            ],
            [
                162,
                194
            ],
            [
                201,
                205
            ],
            [
                206,
                212
            ],
            [
                212,
                214
            ],
            [
                214,
                273
            ],
            [
                274,
                277
            ],
            [
                278,
                281
            ],
            [
                287,
                300
            ],
            [
                300,
                306
            ],
            [
                307,
                370
            ],
            [
                370,
                372
            ],
            [
                372,
                378
            ],
            [
                379,
                388
            ],
            [
                396,
                408
            ],
            [
                408,
                413
            ],
            [
                419,
                435
            ],
            [
                440,
                441
            ],
            [
                445,
                448
            ],
            [
                449,
                506
            ],
            [
                506,
                523
            ],
            [
                524,
                533
            ],
            [
                534,
                544
            ],
            [
                544,
                560
            ],
            [
                561,
                572
            ],
            [
                573,
                576
            ],
            [
                577,
                581
            ],
            [
                582,
                585
            ],
            [
                586,
                592
            ],
            [
                592,
                594
            ],
            [
                594,
                638
            ],
            [
                639,
                660
            ],
            [
                660,
                699
            ],
            [
                704,
                714
            ],
            [
                714,
                738
            ],
            [
                745,
                784
            ],
            [
                784,
                787
            ],
            [
                788,
                822
            ],
            [
                833,
                834
            ],
            [
                835,
                922
            ],
            [
                925,
                936
            ],
            [
                956,
                958
            ],
            [
                958,
                971
            ],
            [
                977,
                1068
            ],
            [
                1068,
                1073
            ],
            [
                1079,
                1082
            ],
            [
                1083,
                1086
            ],
            [
                1087,
                1100
            ],
            [
                1107,
                1115
            ],
            [
                1139,
                1158
            ],
            [
                1158,
                1159
            ],
            [
                1163,
                1215
            ],
            [
                1215,
                1294
            ],
            [
                1302,
                1308
            ],
            [
                1309,
                1327
            ],
            [
                1333,
                1335
            ],
            [
                1335,
                1377
            ],
            [
                1378,
                1393
            ],
            [
                1394,
                1411
            ],
            [
                1416,
                1459
            ],
            [
                1459,
                1475
            ],
            [
                1480,
                1483
            ],
            [
                1491,
                1532
            ],
            [
                1533,
                1547
            ],
            [
                1550,
                1578
            ],
            [
                1586,
                1602
            ],
            [
                1608,
                1633
            ],
            [
                1641,
                1710
            ],
            [
                1710,
                1825
            ],
            [
                1825,
                1827
            ],
            [
                1827,
                1911
            ],
            [
                1923,
                1926
            ],
            [
                1927,
                1935
            ],
            [
                1936,
                1938
            ],
            [
                1946,
                1947
            ],
            [
                1960,
                1973
            ],
            [
                1973,
                2054
            ],
            [
                2054,
                2065
            ],
            [
                2066,
                2099
            ],
            [
                2099,
                2165
            ],
            [
                2166,
                2205
            ],
            [
                2215,
                2217
            ],
            [
                2217,
                2255
            ],
            [
                2255,
                2257
            ],
            [
                2257,
                2264
            ],
            [
                2265,
                2271
            ],
            [
                2278,
                2334
            ],
            [
                2335,
                2346
            ],
            [
                2346,
                2347
            ],
            [
                2348,
                2375
            ],
            [
                2384,
                2392
            ],
            [
                2393,
                2428
            ],
            [
                2428,
                2429
            ],
            [
                2430,
                2459
            ],
            [
                2476,
                2499
            ],
            [
                2500,
                2532
            ],
            [
                2532,
                2534
            ],
            [
                2534,
                2609
            ],
            [
                2609,
                2679
            ],
            [
                2680,
                2705
            ],
            [
                2719,
                2744
            ],
            [
                2753,
                2763
            ],
            [
                2764,
                2807
            ],
            [
                2807,
                2863
            ],
            [
                2863,
                2932
            ],
            [
                2933,
                2964
            ],
            [
                2965,
                2972
            ],
            [
                2977,
                2998
            ],
            [
                2998,
                3020
            ],
            [
                3021,
                3103
            ],
            [
                3103,
                3166
            ],
            [
                3171,
                3199
            ],
            [
                3200,
                3211
            ],
            [
                3222,
                3224
            ],
            [
                3225,
                3228
            ],
            [
                3237,
                3239
            ],
            [
                3239,
                3241
            ],
            [
                3242,
                3251
            ],
            [
                3261,
                3269
            ],
            [
                3270,
                3284
            ],
            [
                3284,
                3296
            ],
            [
                3310,
                3312
            ],
            [
                3313,
                3345
            ],
            [
                3358,
                3388
            ],
            [
                3388,
                3391
            ],
            [
                3392,
                3395
            ],
            [
                3396,
                3402
            ],
            [
                3403,
                3410
            ],
            [
                3411,
                3432
            ],
            [
                3432,
                3433
            ],
            [
                3434,
                3459
            ],
            [
                3460,
                3466
            ],
            [
                3467,
                3473
            ],
            [
                3474,
                3475
            ],
            [
                3487,
                3489
            ],
            [
                3490,
                3509
            ],
            [
                3510,
                3513
            ],
            [
                3514,
                3551
            ],
            [
                3552,
                3591
            ],
            [
                3592,
                3645
            ],
            [
                3646,
                3653
            ],
            [
                3657,
                3658
            ],
            [
                3659,
                3666
            ],
            [
                3676,
                3678
            ],
            [
                3678,
                3708
            ],
            [
                3724,
                3725
            ],
            [
                3732,
                3761
            ],
            [
                3761,
                3764
            ],
            [
                3765,
                3781
            ],
            [
                3781,
                3782
            ],
            [
                3786,
                3809
            ],
            [
                3810,
                3823
            ],
            [
                3823,
                3826
            ],
            [
                3833,
                3851
            ],
            [
                3858,
                3882
            ],
            [
                3882,
                3905
            ],
            [
                3906,
                3922
            ],
            [
                3923,
                3941
            ],
            [
                3946,
                3952
            ],
            [
                3952,
                3954
            ],
            [
                3954,
                4033
            ],
            [
                4034,
                4118
            ],
            [
                4125,
                4133
            ],
            [
                4133,
                4135
            ],
            [
                4135,
                4206
            ],
            [
                4206,
                4324
            ],
            [
                4330,
                4342
            ],
            [
                4354,
                4398
            ],
            [
                4398,
                4399
            ],
            [
                4409,
                4486
            ],
            [
                4487,
                4549
            ],
            [
                4557,
                4570
            ],
            [
                4570,
                4573
            ],
            [
                4574,
                4586
            ],
            [
                4587,
                4611
            ],
            [
                4616,
                4633
            ],
            [
                4634,
                4668
            ],
            [
                4668,
                4696
            ],
            [
                4702,
                4708
            ],
            [
                4709,
                4745
            ],
            [
                4745,
                4767
            ],
            [
                4772,
                4776
            ],
            [
                4779,
                4819
            ],
            [
                4823,
                4868
            ],
            [
                4868,
                4899
            ],
            [
                4900,
                4906
            ],
            [
                4913,
                4940
            ],
            [
                4944,
                4945
            ],
            [
                4951,
                4972
            ],
            [
                4972,
                4975
            ],
            [
                4975,
                5059
            ],
            [
                5060,
                5104
            ],
            [
                5104,
                5116
            ],
            [
                5117,
                5293
            ],
            [
                5303,
                5322
            ],
            [
                5323,
                5325
            ],
            [
                5330,
                5342
            ],
            [
                5342,
                5360
            ],
            [
                5361,
                5368
            ],
            [
                5373,
                5375
            ],
            [
                5375,
                5441
            ],
            [
                5441,
                5530
            ],
            [
                5530,
                5587
            ],
            [
                5588,
                5618
            ],
            [
                5619,
                5638
            ],
            [
                5638,
                5679
            ],
            [
                5679,
                5707
            ],
            [
                5708,
                5727
            ],
            [
                5741,
                5774
            ],
            [
                5774,
                5890
            ],
            [
                5890,
                5907
            ],
            [
                5911,
                5914
            ],
            [
                5919,
                5927
            ],
            [
                5927,
                5931
            ],
            [
                5931,
                5934
            ],
            [
                5934,
                5935
            ],
            [
                5935,
                5938
            ],
            [
                5938,
                5940
            ],
            [
                5940,
                5993
            ],
            [
                5993,
                6023
            ],
            [
                6023,
                6051
            ],
            [
                6051,
                6052
            ],
            [
                6052,
                6073
            ],
            [
                6073,
                6074
            ],
            [
                6079,
                6127
            ],
            [
                6127,
                6130
            ],
            [
                6130,
                6149
            ],
            [
                6163,
                6169
            ],
            [
                6169,
                6184
            ],
            [
                6184,
                6216
            ],
            [
                6217,
                6228
            ],
            [
                6228,
                6229
            ],
            [
                6230,
                6235
            ],
            [
                6236,
                6260
            ],
            [
                6262,
                6291
            ],
            [
                6292,
                6296
            ],
            [
                6297,
                6303
            ],
            [
                6304,
                6326
            ],
            [
                6326,
                6379
            ],
            [
                6379,
                6387
            ],
            [
                6387,
                6418
            ],
            [
                6418,
                6429
            ],
            [
                6429,
                6516
            ],
            [
                6518,
                6543
            ],
            [
                6546,
                6552
            ],
            [
                6555,
                6565
            ],
            [
                6565,
                6567
            ],
            [
                6567,
                6593
            ],
            [
                6596,
                6612
            ],
            [
                6613,
                6614
            ],
            [
                6615,
                6623
            ],
            [
                6623,
                6642
            ],
            [
                6642,
                6683
            ],
            [
                6683,
                6729
            ],
            [
                6729,
                6771
            ],
            [
                6776,
                6798
            ],
            [
                6799,
                6824
            ],
            [
                6824,
                6952
            ],
            [
                6961,
                6971
            ],
            [
                6975,
                6980
            ],
            [
                6990,
                6993
            ],
            [
                6993,
                7023
            ],
            [
                7023,
                7026
            ],
            [
                7026,
                7053
            ],
            [
                7053,
                7056
            ],
            [
                7066,
                7067
            ],
            [
                7068,
                7117
            ],
            [
                7118,
                7120
            ],
            [
                7134,
                7161
            ],
            [
                7161,
                7162
            ],
            [
                7168,
                7174
            ],
            [
                7181,
                7265
            ],
            [
                7268,
                7318
            ],
            [
                7328,
                7342
            ],
            [
                7342,
                7344
            ],
            [
                7344,
                7407
            ],
            [
                7425,
                7435
            ],
            [
                7436,
                7442
            ],
            [
                7442,
                7486
            ],
            [
                7486,
                7487
            ],
            [
                7493,
                7499
            ],
            [
                7500,
                7504
            ],
            [
                7513,
                7554
            ],
            [
                7554,
                7571
            ],
            [
                7572,
                7608
            ],
            [
                7608,
                7609
            ],
            [
                7623,
                7629
            ],
            [
                7630,
                7638
            ],
            [
                7639,
                7642
            ],
            [
                7662,
                7664
            ],
            [
                7679,
                7687
            ],
            [
                7688,
                7700
            ],
            [
                7701,
                7703
            ],
            [
                7714,
                7732
            ],
            [
                7732,
                7776
            ],
            [
                7777,
                7805
            ],
            [
                7806,
                7818
            ],
            [
                7818,
                7820
            ],
            [
                7820,
                7838
            ],
            [
                7840,
                7877
            ],
            [
                7877,
                7915
            ],
            [
                7916,
                7921
            ],
            [
                7922,
                7945
            ],
            [
                7945,
                7947
            ],
            [
                7947,
                7979
            ],
            [
                7980,
                7986
            ],
            [
                7996,
                7998
            ],
            [
                7998,
                8009
            ],
            [
                8010,
                8087
            ],
            [
                8087,
                8142
            ],
            [
                8157,
                8187
            ],
            [
                8187,
                8227
            ],
            [
                8227,
                8238
            ],
            [
                8239,
                8240
            ],
            [
                8246,
                8250
            ],
            [
                8257,
                8259
            ],
            [
                8260,
                8270
            ],
            [
                8273,
                8293
            ],
            [
                8293,
                8295
            ],
            [
                8295,
                8333
            ],
            [
                8334,
                8338
            ],
            [
                8339,
                8356
            ],
            [
                8357,
                8399
            ],
            [
                8399,
                8443
            ],
            [
                8449,
                8478
            ],
            [
                8487,
                8498
            ],
            [
                8504,
                8526
            ],
            [
                8540,
                8553
            ],
            [
                8553,
                8555
            ],
            [
                8555,
                8616
            ],
            [
                8617,
                8623
            ],
            [
                8629,
                8639
            ],
            [
                8644,
                8649
            ],
            [
                8659,
                8719
            ],
            [
                8720,
                8721
            ],
            [
                8722,
                8726
            ],
            [
                8727,
                8733
            ],
            [
                8733,
                8734
            ],
            [
                8735,
                8769
            ],
            [
                8770,
                8799
            ],
            [
                8799,
                8812
            ],
            [
                8817,
                8857
            ],
            [
                8860,
                8866
            ],
            [
                8877,
                8904
            ],
            [
                8904,
                8926
            ],
            [
                8926,
                8945
            ],
            [
                8946,
                8958
            ],
            [
                8959,
                8967
            ],
            [
                8967,
                8972
            ],
            [
                8996,
                9049
            ],
            [
                9049,
                9070
            ],
            [
                9070,
                9072
            ],
            [
                9072,
                9090
            ],
            [
                9099,
                9115
            ],
            [
                9116,
                9121
            ],
            [
                9130,
                9140
            ],
            [
                9140,
                9142
            ],
            [
                9142,
                9164
            ],
            [
                9166,
                9169
            ],
            [
                9170,
                9175
            ],
            [
                9176,
                9181
            ],
            [
                9182,
                9185
            ],
            [
                9186,
                9191
            ],
            [
                9200,
                9204
            ],
            [
                9223,
                9226
            ],
            [
                9226,
                9227
            ],
            [
                9228,
                9263
            ],
            [
                9263,
                9288
            ],
            [
                9294,
                9355
            ],
            [
                9358,
                9383
            ],
            [
                9395,
                9407
            ],
            [
                9407,
                9409
            ],
            [
                9409,
                9436
            ],
            [
                9437,
                9468
            ],
            [
                9471,
                9477
            ],
            [
                9477,
                9640
            ],
            [
                9640,
                9681
            ],
            [
                9682,
                9692
            ],
            [
                9697,
                9722
            ],
            [
                9723,
                9727
            ],
            [
                9733,
                9822
            ],
            [
                9823,
                9850
            ],
            [
                9855,
                9884
            ],
            [
                9885,
                9896
            ],
            [
                9904,
                9914
            ],
            [
                9916,
                9976
            ],
            [
                9976,
                9977
            ],
            [
                9977,
                9986
            ],
            [
                9987,
                10010
            ],
            [
                10010,
                10104
            ],
            [
                10104,
                10113
            ],
            [
                10115,
                10149
            ],
            [
                10149,
                10177
            ],
            [
                10180,
                10252
            ],
            [
                10252,
                10339
            ],
            [
                10339,
                10364
            ],
            [
                10365,
                10390
            ],
            [
                10391,
                10393
            ],
            [
                10394,
                10402
            ],
            [
                10405,
                10450
            ],
            [
                10450,
                10474
            ],
            [
                10475,
                10479
            ],
            [
                10479,
                10482
            ],
            [
                10482,
                10483
            ],
            [
                10483,
                10493
            ],
            [
                10494,
                10544
            ],
            [
                10544,
                10589
            ]
        ],
        "row_chars": [
            [
                0,
                128
            ],
            [
                128,
                162
            ],
            [
                162,
                214
            ],
            [
                214,
                300
            ],
            [
                300,
                372
            ],
            [
                372,
                506
            ],
            [
                506,
                594
            ],
            [
                594,
                660
            ],
            [
                660,
                714
            ],
            [
                714,
                784
            ],
            [
                784,
                835
            ],
            [
                835,
                958
            ],
            [
                958,
                1100
            ],
            [
                1100,
                1100
            ],
            [
                1100,
                1215
            ],
            [
                1215,
                1335
            ],
            [
                1335,
                1459
            ],
            [
                1459,
                1547
            ],
            [
                1547,
                1547
            ],
            [
                1547,
                1547
            ],
            [
                1547,
                1710
            ],
            [
                1710,
                1827
            ],
            [
                1827,
                1827
            ],
            [
                1827,
                1973
            ],
            [
                1973,
                2054
            ],
            [
                2054,
                2099
            ],
            [
                2099,
                2217
            ],
            [
                2217,
                2257
            ],
            [
                2257,
                2430
            ],
            [
                2430,
                2459
            ],
            [
                2459,
                2534
            ],
            [
                2534,
                2609
            ],
            [
                2609,
                2680
            ],
            [
                2680,
                2763
            ],
            [
                2763,
                2763
            ],
            [
                2763,
                2807
            ],
            [
                2807,
                2863
            ],
            [
                2863,
                2998
            ],
            [
                2998,
                3021
            ],
            [
                3021,
                3021
            ],
            [
                3021,
                3021
            ],
            [
                3021,
                3103
            ],
            [
                3103,
                3239
            ],
            [
                3239,
                3239
            ],
            [
                3239,
                3284
            ],
            [
                3284,
                3388
            ],
            [
                3388,
                3552
            ],
            [
                3552,
                3552
            ],
            [
                3552,
                3678
            ],
            [
                3678,
                3761
            ],
            [
                3761,
                3761
            ],
            [
                3761,
                3761
            ],
            [
                3761,
                3761
            ],
            [
                3761,
                3761
            ],
            [
                3761,
                3823
            ],
            [
                3823,
                3882
            ],
            [
                3882,
                3954
            ],
            [
                3954,
                4135
            ],
            [
                4135,
                4206
            ],
            [
                4206,
                4342
            ],
            [
                4342,
                4342
            ],
            [
                4342,
                4570
            ],
            [
                4570,
                4634
            ],
            [
                4634,
                4668
            ],
            [
                4668,
                4709
            ],
            [
                4709,
                4745
            ],
            [
                4745,
                4745
            ],
            [
                4745,
                4745
            ],
            [
                4745,
                4779
            ],
            [
                4779,
                4819
            ],
            [
                4819,
                4819
            ],
            [
                4819,
                4868
            ],
            [
                4868,
                4975
            ],
            [
                4975,
                5104
            ],
            [
                5104,
                5293
            ],
            [
                5293,
                5375
            ],
            [
                5375,
                5441
            ],
            [
                5441,
                5530
            ],
            [
                5530,
                5638
            ],
            [
                5638,
                5679
            ],
            [
                5679,
                5707
            ],
            [
                5707,
                5707
            ],
            [
                5707,
                5774
            ],
            [
                5774,
                5890
            ],
            [
                5890,
                5927
            ],
            [
                5927,
                5934
            ],
            [
                5934,
                5940
            ],
            [
                5940,
                5993
            ],
            [
                5993,
                6023
            ],
            [
                6023,
                6051
            ],
            [
                6051,
                6051
            ],
            [
                6051,
                6051
            ],
            [
                6051,
                6130
            ],
            [
                6130,
                6169
            ],
            [
                6169,
                6184
            ],
            [
                6184,
                6228
            ],
            [
                6228,
                6262
            ],
            [
                6262,
                6262
            ],
            [
                6262,
                6262
            ],
            [
                6262,
                6262
            ],
            [
                6262,
                6326
            ],
            [
                6326,
                6379
            ],
            [
                6379,
                6387
            ],
            [
                6387,
                6387
            ],
            [
                6387,
                6418
            ],
            [
                6418,
                6429
            ],
            [
                6429,
                6518
            ],
            [
                6518,
                6518
            ],
            [
                6518,
                6567
            ],
            [
                6567,
                6596
            ],
            [
                6596,
                6596
            ],
            [
                6596,
                6642
            ],
            [
                6642,
                6683
            ],
            [
                6683,
                6729
            ],
            [
                6729,
                6729
            ],
            [
                6729,
                6824
            ],
            [
                6824,
                6993
            ],
            [
                6993,
                7026
            ],
            [
                7026,
                7053
            ],
            [
                7053,
                7161
            ],
            [
                7161,
                7161
            ],
            [
                7161,
                7161
            ],
            [
                7161,
                7161
            ],
            [
                7161,
                7161
            ],
            [
                7161,
                7161
            ],
            [
                7161,
                7161
            ],
            [
                7161,
                7161
            ],
            [
                7161,
                7268
            ],
            [
                7268,
                7268
            ],
            [
                7268,
                7268
            ],
            [
                7268,
                7344
            ],
            [
                7344,
                7408
            ],
            [
                7408,
                7408
            ],
            [
                7408,
                7442
            ],
            [
                7442,
                7554
            ],
            [
                7554,
                7777
            ],
            [
                7777,
                7777
            ],
            [
                7777,
                7820
            ],
            [
                7820,
                7877
            ],
            [
                7877,
                7947
            ],
            [
                7947,
                7947
            ],
            [
                7947,
                7998
            ],
            [
                7998,
                8087
            ],
            [
                8087,
                8187
            ],
            [
                8187,
                8227
            ],
            [
                8227,
                8295
            ],
            [
                8295,
                8399
            ],
            [
                8399,
                8555
            ],
            [
                8555,
                8799
            ],
            [
                8799,
                8799
            ],
            [
                8799,
                8904
            ],
            [
                8904,
                8926
            ],
            [
                8926,
                9049
            ],
            [
                9049,
                9072
            ],
            [
                9072,
                9142
            ],
            [
                9142,
                9228
            ],
            [
                9228,
                9228
            ],
            [
                9228,
                9228
            ],
            [
                9228,
                9409
            ],
            [
                9409,
                9477
            ],
            [
                9477,
                9640
            ],
            [
                9640,
                9851
            ],
            [
                9851,
                9851
            ],
            [
                9851,
                9851
            ],
            [
                9851,
                9976
            ],
            [
                9976,
                9976
            ],
            [
                9976,
                9976
            ],
            [
                9976,
                9976
            ],
            [
                9976,
                9976
            ],
            [
                9976,
                9976
            ],
            [
                9976,
                9976
            ],
            [
                9976,
                10010
            ],
            [
                10010,
                10104
            ],
            [
                10104,
                10149
            ],
            [
                10149,
                10149
            ],
            [
                10149,
                10180
            ],
            [
                10180,
                10252
            ],
            [
                10252,
                10339
            ],
            [
                10339,
                10450
            ],
            [
                10450,
                10482
            ],
            [
                10482,
                10544
            ],
            [
                10544,
                10589
            ]
        ]
    }
}