{
    "original": {
        "text": "Alice came down to breakfast on that Christmas morning at Vavasor Hall without making any sign as to the letter she had received. The party there consisted of her grandfather, her father, her cousin Kate, and herself. They all made their Christmas salutations as is usual, and Alice received and made hers as did the others, without showing that anything had occurred to disturb her tranquillity. Kate remarked that she had heard that morning from Aunt Greenow, and promised to show Alice the letter after breakfast. But Alice said no word of her own letter.\n\"Why didn't your aunt come here to eat her Christmas dinner?\" said the Squire.\n\"Perhaps, sir, because you didn't ask her,\" said Kate, standing close to her grandfather,--for the old man was somewhat deaf.\n\"And why didn't you ask her;--that is, if she stands upon asking to come to her old home?\"\n\"Nay, sir, but I couldn't do that without your bidding. We Vavasors are not always fond of meeting each other.\"\n\"Hold your tongue, Kate. I know what you mean, and you should be the last to speak of it. Alice, my dear, come and sit next to me. I am much obliged to you for coming down all this way to see your old grandfather at Christmas. I am indeed. I only wish you had brought better news about your sweetheart.\"\n\"She'll think better of it before long, sir,\" said her father.\n\"Papa, you shouldn't say that. You would not wish me to marry against my own judgement.\"\n\"I don't know much about ladies' judgements,\" said the old man. \"It does seem to me that when a lady makes a promise she ought to keep it.\"\n\"According to that,\" said Kate, \"if I were engaged to a man, and found that he was a murderer, I still ought to marry him.\"\n\"But Mr. Grey is not a murderer,\" said the Squire.\n\"Pray,--pray, don't talk about it,\" said Alice. \"If you do I really cannot sit and hear it.\"\n\"I have given over saying anything on the subject,\" said John Vavasor, speaking as though he had already expended upon it a vast amount of paternal eloquence. He had, however, never said more than has been recorded in these pages. Alice during this conversation, sat with her cousin's letter in her pocket, and as yet had not even begun to think what should be the nature of her reply.\nThe Squire of Vavasor Hall was a stout old man, with a red face and grey eyes, which looked fiercely at you, and with long grey hair, and a rough grey beard, which gave him something of the appearance of an old lion. He was passionate, unreasoning, and specially impatient of all opposition; but he was affectionate, prone to forgive when asked to do so, unselfish, and hospitable. He was, moreover, guided strictly by rules, which he believed to be rules of right. His grandson George had offended him very deeply,--had offended him and never asked his pardon. He was determined that such pardon should never be given, unless it were asked for with almost bended knees; but, nevertheless, this grandson should be his heir. That was his present intention. The right of primogeniture could not, in accordance with his theory, be abrogated by the fact that it was, in George Vavasor's case, protected by no law. The Squire could leave Vavasor Hall to whom he pleased, but he could not have hoped to rest quietly in his grave should it be found that he had left it to any one but the eldest son of his own eldest son. Though violent, and even stern, he was more prone to love than to anger; and though none of those around him dared to speak to him of his grandson, yet he longed in his heart for some opportunity of being reconciled to him.\nThe whole party went to church on this Christmas morning. The small parish church of Vavasor, an unpretending wooden structure, with a single bell which might be heard tinkling for a mile or two over the fells, stood all alone about half a mile from the Squire's gate. Vavasor was a parish situated on the intermediate ground between the mountains of the lake country and the plains. Its land was unproductive, ill-drained, and poor, and yet it possessed little or none of the beauty which tourists go to see. It was all amidst the fells, and very dreary. There were long skirtings of dark pines around a portion of the Squire's property, and at the back of the house there was a thick wood of firs running up to the top of what was there called the Beacon Hill. Through this there was a wild steep walk which came out upon the moorland, and from thence there was a track across the mountain to Hawes Water and Naddale, and on over many miles to the further beauties of Bowness and Windermere. They who knew the country, and whose legs were of use to them, could find some of the grandest scenery in England within reach of a walk from Vavasor Hall; but to others the place was very desolate. For myself, I can find I know not what of charm in wandering over open, unadorned moorland. It must be more in the softness of the grass to the feet, and the freshness of the air to the lungs, than in anything that meets the eye. You might walk for miles and miles to the north-east, or east, or south-east of Vavasor without meeting any object to arrest the view. The great road from Lancaster to Carlisle crossed the outskirts of the small parish about a mile from the church, and beyond that the fell seemed to be interminable. Towards the north it rose, and towards the south it fell, and it rose and fell very gradually. Here and there some slight appearance of a valley might be traced which had been formed by the action of the waters; but such breakings of ground were inconsiderable, and did not suffice to interrupt the stern sameness of the everlasting moorland.\nThe daily life at Vavasor was melancholy enough for such a one as the Squire's son, who regarded London as the only place on the earth's surface in which a man could live with comfort. The moors offered no charms to him. Nor did he much appreciate the homely comforts of the Hall; for the house, though warm, was old-fashioned and small, and the Squire's cook was nearly as old as the Squire himself. John Vavasor's visits to Vavasor were always visits of duty rather than of pleasure. But it was not so with Alice. She could be very happy there with Kate; for, like herself, Kate was a good walker and loved the mountains. Their regard for each other had grown and become strong because they had gone together o'er river and moor, and because they had together disregarded those impediments of mud and wet which frighten so many girls away from the beauties of nature.\nOn this Christmas Day they all went to church, the Squire being accompanied by Alice in a vehicle which in Ireland is called an inside jaunting-car, and which is perhaps the most uncomfortable kind of vehicle yet invented; while John Vavasor walked with his niece. But the girls had arranged that immediately after church they would start for a walk up the Beacon Hill, across the fells, towards Hawes Water. They always dined at the Hall at the vexatious hour of five; but as their church service, with the sacrament included, would be completed soon after twelve, and as lunch was a meal which the Squire did not himself attend, they could have full four hours for their excursion. This had all been planned before Alice received her letter; but there was nothing in that to make her change her mind about the walk.\n\"Alice, my dear,\" said the old man to her when they were together in the jaunting-car, \"you ought to get married.\" The Squire was hard of hearing, and under any circumstances an inside jaunting-car is a bad place for conversation, as your teeth are nearly shaken out of your head by every movement which the horse makes. Alice therefore said nothing, but smiled faintly, in reply to her grandfather. On returning from church he insisted that Alice should again accompany him, telling her specially that he desired to speak to her. \"My dear child,\" he said, \"I have been thinking a great deal about you, and you ought to get married.\"\n\"Well, sir, perhaps I shall some day.\"\n\"Not if you quarrel with all your suitors,\" said the old man. \"You quarrelled with your cousin George, and now you have quarrelled with Mr. Grey. You'll never get married, my dear, if you go on in that way.\"\n\"Why should I be married more than Kate?\"\n\"Oh, Kate! I don't know that anybody wants to marry Kate. I wish you'd think of what I say. If you don't get married before long, perhaps you'll never get married at all. Gentlemen won't stand that kind of thing for ever.\"\nThe two girls took a slice of cake each in her hand, and started on their walk. \"We shan't be able to get to the lake,\" said Kate.\n\"No,\" said Alice; \"but we can go as far as the big stone on Swindale Fell, where we can sit down and see it.\"\n\"Do you remember the last time we sat there?\" said Kate. \"It is nearly three years ago, and it was then that you told me that all was to be over between you and George. Do you remember what a fool I was, and how I screamed in my sorrow? I sometimes wonder at myself and my own folly. How is it that I can never get up any interest about my own belongings? And then we got soaking wet through coming home.\"\n\"I remember that very well.\"\n\"And how dark it was! That was in September, but we had dined early. If we go as far as Swindale we shall have it very dark coming home to-day;--but I don't mind that through the Beacon Wood, because I know my way so well. You won't be afraid of half an hour's dark?\"\n\"Oh, no,\" said Alice.\n\"Yes; I do remember that day. Well; it's all for the best, I suppose. And now I must read you my aunt's letter.\" Then, while they were still in the wood, Kate took out the letter from her aunt and read it, while they still walked slowly up the hill. It seemed that hitherto neither of her two suitors had brought the widow to terms. Indeed, she continued to write of Mr. Cheesacre as though that gentleman were inconsolable for the loss of Kate, and gave her niece much serious advice as to the expedience of returning to Norfolk, in order that she might secure so eligible a husband. \"You must understand all the time, Alice,\" said Kate, pausing as she read the letter, \"that the dear man has never given me the slightest ground for the faintest hope, and that I know to a certainty that he makes an offer to her twice a week,--that is, on every market day. You can't enjoy half the joke if you won't bear that in mind.\" Alice promised that she would bear it all in mind, and then Kate went on with her reading. Poor Bellfield was working very hard at his drill, Mrs. Greenow went on to say; so hard that sometimes she really thought the fatigue would be too much for his strength. He would come in sometimes of an evening and just take a cup of tea;--generally on Mondays and Thursdays. \"These are not market days at Norwich,\" said Kate; \"and thus unpleasant meetings are avoided.\" \"He comes in,\" said Mrs. Greenow, \"and takes a little tea; and sometimes I think that he will faint at my feet.\" \"That he kneels there on every occasion,\" said Kate, \"and repeats his offer also twice a week, I have not the least doubt in the world.\"\n\"And will she accept him at last?\"\n\"Really I don't know what to think of it. Sometimes I fancy that she likes the fun of the thing, but that she is too wide-awake to put herself in any man's power. I have no doubt she lends him money, because he wants it sadly and she is very generous. She gives him money, I feel sure, but takes his receipt on stamped paper for every shilling. That's her character all over.\"\nThe letter then went on to say that the writer had made up her mind to remain at Norwich certainly through the winter and spring, and that she was anxiously desirous that her dear Kate should go back to her. \"Come and have one other look at Oileymead,\" said the letter, \"and then, if you make up your mind that you don't like it or him, I won't ask you to think of them ever again. I believe him to be a very honest fellow.\" \"Did you ever know such a woman?\" said Kate; \"with all her faults I believe she would go through fire and water to serve me. I think she'd lend me money without any stamped paper.\" Then Aunt Greenow's letter was put up, and the two girls had come out upon the open fell.\nIt was a delicious afternoon for a winter's walk. The air was clear and cold, but not actually frosty. The ground beneath their feet was dry, and the sky, though not bright, had that appearance of enduring weather which gives no foreboding of rain. There is a special winter's light, which is very clear though devoid of all brilliancy,--through which every object strikes upon the eye with well-marked lines, and under which almost all forms of nature seem graceful to the sight if not actually beautiful. But there is a certain melancholy which ever accompanies it. It is the light of the afternoon, and gives token of the speedy coming of the early twilight. It tells of the shortness of the day, and contains even in its clearness a promise of the gloom of night. It is absolute light, but it seems to contain the darkness which is to follow it. I do not know that it is ever to be seen and felt so plainly as on the wide moorland, where the eye stretches away over miles, and sees at the world's end the faint low lines of distant clouds settling themselves upon the horizon. Such was the light of this Christmas afternoon, and both the girls had felt the effects of it before they reached the big stone on Swindale Fell, from which they intended to look down upon the loveliness of Hawes Water. As they went up through the wood there had been some laughter between them over Aunt Greenow's letter; and they had discussed almost with mirth the merits of Oileymead and Mr. Cheesacre; but as they got further on to the fell, and as the half-melancholy wildness of the place struck them, their words became less light, and after a while they almost ceased to speak.\nAlice had still her letter in her pocket. She had placed it there when she came down to breakfast, and had carried it with her since. She had come to no resolution as yet as to her answer to it, nor had she resolved whether or no she would show it to Kate. Kate had ever been regarded by her as her steadfast friend. In all these affairs she had spoken openly to Kate. We know that Kate had in part betrayed her, but Alice suspected no such treason. She had often quarrelled with Kate; but she had quarrelled with her not on account of any sin against the faith of their friendship. She believed in her cousin perfectly, though she found herself often called upon to disagree with her almost violently. Why should she not show this letter to Kate, and discuss it in all its bearings before she replied to it? This was in her mind as she walked silently along over the fell.\nThe reader will surmise from this that she was already half inclined to give way, and to join her lot to that of her cousin George. Alas, yes! The reader will be right in his surmise. And yet it was not her love for the man that prompted her to run so terrible a risk. Had it been so, I think that it would be easier to forgive her. She was beginning to think that love,--the love of which she had once thought so much,--did not matter. Of what use was it, and to what had it led? What had love done for her friend Glencora? What had love done for her? Had she not loved John Grey, and had she not felt that with all her love life with him would have been distasteful to her? It would have been impossible for her to marry a man whom personally she disliked; but she liked her cousin George,--well enough, as she said to herself almost indifferently.\nUpon the whole it was a grievous task to her in these days,--this having to do something with her life. Was it not all vain and futile? As for that girl's dream of the joys of love which she had once dreamed,--that had gone from her slumbers, never to return. How might she best make herself useful,--useful in some sort that might gratify her ambition;--that was now the question which seemed to her to be of most importance.\nHer cousin's letter to her had been very crafty. He had studied the whole of her character accurately as he wrote it. When he had sat down to write it he had been indifferent to the result; but he had written it with that care to attain success which a man uses when he is anxious not to fail in an attempt. Whether or no he cared to marry his cousin was a point so little interesting to him that chance might decide it for him; but when chance had decided that he did wish it, it was necessary for his honour that he should have that for which he condescended to ask.\nHis letter to her had been clever and very crafty. \"At any rate he does me justice,\" she said to herself, when she read those words about her money, and the use which he proposed to make of it. \"He is welcome to it all if it will help him in his career, whether he has it as my friend or as my husband.\" Then she thought of Kate's promise of her little mite, and declared to herself that she would not be less noble than her cousin Kate. And would it not be well that she should be the means of reconciling George to his grandfather? George was the representative of the family,--of a family so old that no one now knew which had first taken the ancient titular name of some old Saxon landowner,--the parish, or the man. There had been in old days some worthy Vavaseurs, as Chaucer calls them, whose rank and bearing had been adopted on the moorland side. Of these things Alice thought much, and felt that it should be her duty so to act, that future Vavasors might at any rate not be less in the world than they who had passed away. In a few years at furthest, George Vavasor must be Vavasor of Vavasor. Would it not be right that she should help him to make that position honourable?\nThey walked on, exchanging now and again a word or two, till the distant Cumberland mountains began to form themselves in groups of beauty before their eyes. \"There's Helvellyn at last,\" said Kate. \"I'm always happy when I see that.\" \"And isn't that Kidsty Pike?\" asked Alice. \"No; you don't see Kidsty yet. But you will when you get up to the bank there. That's Scaw Fell on the left;--the round distant top. I can distinguish it, though I doubt whether you can.\" Then they went on again, and were soon at the bank from whence the sharp top of the mountain which Alice had named was visible. \"And now we are on Swindale, and in five minutes we shall get to the stone.\"\nIn less than five minutes they were there; and then, but not till then, the beauty of the little lake, lying down below them in the quiet bosom of the hills, disclosed itself. A lake should, I think, be small, and should be seen from above, to be seen in all its glory. The distance should be such that the shadows of the mountains on its surface may just be traced, and that some faint idea of the ripple on the waters may be present to the eye. And the form of the lakes should be irregular, curving round from its base among the lower hills, deeper and still deeper into some close nook up among the mountains from which its head waters spring. It is thus that a lake should be seen, and it was thus that Hawes Water was seen by them from the flat stone on the side of Swindale Fell. The basin of the lake has formed itself into the shape of the figure of 3, and the top section of the figure lies embosomed among the very wildest of the Westmoreland mountains. Altogether it is not above three miles long, and every point of it was to be seen from the spot on which the girls sat themselves down. The water beneath was still as death, and as dark,--and looked almost as cold. But the slow clouds were passing over it, and the shades of darkness on its surface changed themselves with gradual changes. And though no movement was visible, there was ever and again in places a slight sheen upon the lake, which indicated the ripple made by the breeze.\n\"I'm so glad I've come here,\" said Alice, seating herself. \"I cannot bear the idea of coming to Vavasor without seeing one of the lakes at least.\"\n\"We'll get over to Windermere one day,\" said Kate.\n\"I don't think we shall. I don't think it possible that I should stay long. Kate, I've got a letter to show you.\" And there was that in the tone of her voice which instantly put Kate upon her mettle.\nKate seated herself also, and put up her hand for the letter. \"Is it from Mr. Grey?\" she asked.\n\"No,\" said Alice; \"it is not from Mr. Grey.\" And she gave her companion the paper. Kate before she had touched it had seen that it was from her brother George; and as she opened it looked anxiously into Alice's face. \"Has he offended you?\" Kate asked.\n[Illustration: Swindale Fell.]\n\"Read it,\" said Alice, \"and then we'll talk of it afterwards,--as we go home.\" Then she got up from the stone and walked a step or two towards the brow of the fell, and stood there looking down upon the lake, while Kate read the letter. \"Well!\" she said, when she returned to her place.\n\"Well,\" said Kate. \"Alice, Alice, it will, indeed, be well if you listen to him. Oh, Alice, may I hope? Alice, my own Alice, my darling, my friend! Say that it shall be so.\" And Kate knelt at her friend's feet upon the heather, and looked up into her face with eyes full of tears. What shall we say of a woman who could be as false as she had been, and yet could be so true?\nAlice made no immediate answer, but still continued to gaze down over her friend upon the lake. \"Alice,\" continued Kate, \"I did not think I should be made so happy this Christmas Day. You could not have the heart to bring me here and show me this letter in this way, and bid me read it so calmly, and then tell me that it is all for nothing. No; you could not do that? Alice, I am so happy. I will so love this place. I hated it before.\" And then she put her face down upon the boulder-stone and kissed it. Still Alice said nothing, but she began to feel that she had gone further than she had intended. It was almost impossible for her now to say that her answer to George must be a refusal.\nThen Kate again went on speaking. \"But is it not a beautiful letter? Say, Alice,--is it not a letter of which if you were his brother you would feel proud if another girl had shown it to you? I do feel proud of him. I know that he is a man with a manly heart and manly courage, who will yet do manly things. Here out on the mountain, with nobody near us, with Nature all round us, I ask you on your solemn word as a woman, do you love him?\"\n\"Love him!\" said Alice.\n\"Yes;--love him: as a woman should love her husband. Is not your heart his? Alice, there need be no lies now. If it be so, it should be your glory to say so, here, to me, as you hold that letter in your hand.\"\n\"I can have no such glory, Kate. I have ever loved my cousin; but not so passionately as you seem to think.\"\n\"Then there can be no passion in you.\"\n\"Perhaps not, Kate. I would sometimes hope that it is so. But come; we shall be late; and you will be cold sitting there.\"\n\"I would sit here all night to be sure that your answer would be as I would have it. But, Alice, at any rate you shall tell me before I move what your answer is to be. I know you will not refuse him; but make me happy by saying so with your own lips.\"\n\"I cannot tell you before you move, Kate.\"\n\"And why not?\"\n\"Because I have not as yet resolved.\"\n\"Ah, that is impossible. That is quite impossible. On such a subject and under such circumstances a woman must resolve at the first moment. You had resolved, I know, before you had half read the letter;--though, perhaps, it may not suit you to say so.\"\n\"You are quite mistaken. Come along and let us walk, and I will tell you all.\" Then Kate arose, and they turned their back to the lake, and began to make their way homewards. \"I have not made up my mind as to what answer I will give him; but I have shown you his letter in order that I might have some one with whom I might speak openly. I knew well how it would be, and that you would strive to hurry me into an immediate promise.\"\n\"No;--no; I want nothing of the kind.\"\n\"But yet I could not deny myself the comfort of your friendship.\"\n\"No, Alice, I will not hurry you. I will do nothing that you do not wish. But you cannot be surprised that I should be very eager. Has it not been the longing of all my life? Have I not passed my time plotting and planning and thinking of it till I have had time to think of nothing else? Do you know what I suffered when, through George's fault, the engagement was broken off? Was it not martyrdom to me,--that horrid time in which your Crichton from Cambridgeshire was in the ascendant? Did I not suffer the tortures of purgatory while that went on;--and yet, on the whole, did I not bear them with patience? And, now, can you be surprised that I am wild with joy when I begin to see that everything will be as I wish;--for it will be as I wish, Alice. It may be that you have not resolved to accept him. But you would have resolved to refuse him instantly had that been your destined answer to his letter.\" There was but little more said between them on the subject as they were passing over the fell, but when they were going down the path through the Beacon Wood, Kate again spoke: \"You will not answer him without speaking to me first?\" said Kate.\n\"I will, at any rate, not send my answer without telling you,\" said Alice.\n\"And you will let me see it?\"\n\"Nay,\" said Alice; \"I will not promise that. But if it is unfavourable I will show it you.\"\n\"Then I shall never see it,\" said Kate, laughing. \"But that is quite enough for me. I by no means wish to criticise the love-sweet words in which you tell him that his offences are all forgiven. I know how sweet they will be. Oh, heavens! how I envy him!\"\nThen they were at home; and the old man met them at the front door, glowering at them angrily from out his old leonine eyes, because the roast beef was already roasted. He had his great uncouth silver watch in his hand, which was always a quarter of an hour too fast, and he pointed at it fiercely, showing them the minute hand at ten minutes past the hour.\n\"But, grandpapa, you are always too fast,\" said Kate.\n\"And you are always too slow, miss,\" said the hungry old squire.\n\"Indeed, it is not five yet. Is it, Alice?\"\n\"And how long are you going to be dressing?\"\n\"Not ten minutes;--are we, Alice? And, grandpapa, pray don't wait.\"\n\"Don't wait! That's what they always say,\" he muttered, peevishly. \"As if one would be any better waiting for them after the meat is on the table.\" But neither Kate nor Alice heard this, as they were already in their rooms.\nNothing more was said that evening between Alice and Kate about the letter; but Kate, as she wished her cousin good night inside her bedroom door, spoke to her just one word--\"Pray for him to-night,\" she said, \"as you pray for those you love best.\" Alice made no answer, but we may believe that she did as she was desired to do.",
        "paragraph_chars": [
            [
                0,
                559
            ],
            [
                559,
                638
            ],
            [
                638,
                764
            ],
            [
                764,
                855
            ],
            [
                855,
                967
            ],
            [
                967,
                1271
            ],
            [
                1271,
                1334
            ],
            [
                1334,
                1423
            ],
            [
                1423,
                1563
            ],
            [
                1563,
                1687
            ],
            [
                1687,
                1738
            ],
            [
                1738,
                1831
            ],
            [
                1831,
                2217
            ],
            [
                2217,
                3556
            ],
            [
                3556,
                5623
            ],
            [
                5623,
                6493
            ],
            [
                6493,
                7311
            ],
            [
                7311,
                7945
            ],
            [
                7945,
                7984
            ],
            [
                7984,
                8192
            ],
            [
                8192,
                8234
            ],
            [
                8234,
                8457
            ],
            [
                8457,
                8588
            ],
            [
                8588,
                8698
            ],
            [
                8698,
                9104
            ],
            [
                9104,
                9133
            ],
            [
                9133,
                9401
            ],
            [
                9401,
                9423
            ],
            [
                9423,
                11057
            ],
            [
                11057,
                11092
            ],
            [
                11092,
                11469
            ],
            [
                11469,
                12165
            ],
            [
                12165,
                13833
            ],
            [
                13833,
                14707
            ],
            [
                14707,
                15558
            ],
            [
                15558,
                15985
            ],
            [
                15985,
                16554
            ],
            [
                16554,
                17740
            ],
            [
                17740,
                18410
            ],
            [
                18410,
                19863
            ],
            [
                19863,
                20010
            ],
            [
                20010,
                20061
            ],
            [
                20061,
                20261
            ],
            [
                20261,
                20357
            ],
            [
                20357,
                20609
            ],
            [
                20609,
                20640
            ],
            [
                20640,
                20927
            ],
            [
                20927,
                21302
            ],
            [
                21302,
                21995
            ],
            [
                21995,
                22436
            ],
            [
                22436,
                22460
            ],
            [
                22460,
                22670
            ],
            [
                22670,
                22779
            ],
            [
                22779,
                22818
            ],
            [
                22818,
                22941
            ],
            [
                22941,
                23193
            ],
            [
                23193,
                23236
            ],
            [
                23236,
                23251
            ],
            [
                23251,
                23289
            ],
            [
                23289,
                23542
            ],
            [
                23542,
                23975
            ],
            [
                23975,
                24014
            ],
            [
                24014,
                24080
            ],
            [
                24080,
                25234
            ],
            [
                25234,
                25309
            ],
            [
                25309,
                25339
            ],
            [
                25339,
                25431
            ],
            [
                25431,
                25687
            ],
            [
                25687,
                26045
            ],
            [
                26045,
                26099
            ],
            [
                26099,
                26164
            ],
            [
                26164,
                26208
            ],
            [
                26208,
                26253
            ],
            [
                26253,
                26321
            ],
            [
                26321,
                26545
            ],
            [
                26545,
                26873
            ]
        ],
        "segment_chars": [
            [
                0,
                130
            ],
            [
                130,
                218
            ],
            [
                218,
                397
            ],
            [
                397,
                517
            ],
            [
                517,
                559
            ],
            [
                559,
                621
            ],
            [
                621,
                638
            ],
            [
                638,
                764
            ],
            [
                764,
                855
            ],
            [
                855,
                911
            ],
            [
                911,
                967
            ],
            [
                967,
                992
            ],
            [
                992,
                1057
            ],
            [
                1057,
                1098
            ],
            [
                1098,
                1194
            ],
            [
                1194,
                1207
            ],
            [
                1207,
                1271
            ],
            [
                1271,
                1334
            ],
            [
                1334,
                1365
            ],
            [
                1365,
                1423
            ],
            [
                1423,
                1487
            ],
            [
                1487,
                1563
            ],
            [
                1563,
                1687
            ],
            [
                1687,
                1738
            ],
            [
                1738,
                1786
            ],
            [
                1786,
                1831
            ],
            [
                1831,
                1990
            ],
            [
                1990,
                2062
            ],
            [
                2062,
                2217
            ],
            [
                2217,
                2434
            ],
            [
                2434,
                2599
            ],
            [
                2599,
                2683
            ],
            [
                2683,
                2779
            ],
            [
                2779,
                2941
            ],
            [
                2941,
                2973
            ],
            [
                2973,
                3127
            ],
            [
                3127,
                3332
            ],
            [
                3332,
                3556
            ],
            [
                3556,
                3614
            ],
            [
                3614,
                3825
            ],
            [
                3825,
                3940
            ],
            [
                3940,
                4066
            ],
            [
                4066,
                4112
            ],
            [
                4112,
                4319
            ],
            [
                4319,
                4550
            ],
            [
                4550,
                4749
            ],
            [
                4749,
                4841
            ],
            [
                4841,
                4979
            ],
            [
                4979,
                5114
            ],
            [
                5114,
                5280
            ],
            [
                5280,
                5375
            ],
            [
                5375,
                5623
            ],
            [
                5623,
                5808
            ],
            [
                5808,
                5844
            ],
            [
                5844,
                6024
            ],
            [
                6024,
                6109
            ],
            [
                6109,
                6139
            ],
            [
                6139,
                6247
            ],
            [
                6247,
                6493
            ],
            [
                6493,
                6758
            ],
            [
                6758,
                6902
            ],
            [
                6902,
                7177
            ],
            [
                7177,
                7311
            ],
            [
                7311,
                7426
            ],
            [
                7426,
                7632
            ],
            [
                7632,
                7711
            ],
            [
                7711,
                7842
            ],
            [
                7842,
                7945
            ],
            [
                7945,
                7984
            ],
            [
                7984,
                8046
            ],
            [
                8046,
                8130
            ],
            [
                8130,
                8192
            ],
            [
                8192,
                8234
            ],
            [
                8234,
                8245
            ],
            [
                8245,
                8292
            ],
            [
                8292,
                8326
            ],
            [
                8326,
                8405
            ],
            [
                8405,
                8457
            ],
            [
                8457,
                8537
            ],
            [
                8537,
                8588
            ],
            [
                8588,
                8698
            ],
            [
                8698,
                8744
            ],
            [
                8744,
                8755
            ],
            [
                8755,
                8867
            ],
            [
                8867,
                8935
            ],
            [
                8935,
                8982
            ],
            [
                8982,
                9054
            ],
            [
                9054,
                9104
            ],
            [
                9104,
                9133
            ],
            [
                9133,
                9155
            ],
            [
                9155,
                9202
            ],
            [
                9202,
                9356
            ],
            [
                9356,
                9401
            ],
            [
                9401,
                9423
            ],
            [
                9423,
                9453
            ],
            [
                9453,
                9493
            ],
            [
                9493,
                9536
            ],
            [
                9536,
                9673
            ],
            [
                9673,
                9756
            ],
            [
                9756,
                10008
            ],
            [
                10008,
                10282
            ],
            [
                10282,
                10345
            ],
            [
                10345,
                10436
            ],
            [
                10436,
                10606
            ],
            [
                10606,
                10712
            ],
            [
                10712,
                10807
            ],
            [
                10807,
                10920
            ],
            [
                10920,
                11057
            ],
            [
                11057,
                11092
            ],
            [
                11092,
                11134
            ],
            [
                11134,
                11255
            ],
            [
                11255,
                11344
            ],
            [
                11344,
                11437
            ],
            [
                11437,
                11469
            ],
            [
                11469,
                11677
            ],
            [
                11677,
                11851
            ],
            [
                11851,
                11894
            ],
            [
                11894,
                11928
            ],
            [
                11928,
                12019
            ],
            [
                12019,
                12075
            ],
            [
                12075,
                12165
            ],
            [
                12165,
                12215
            ],
            [
                12215,
                12268
            ],
            [
                12268,
                12414
            ],
            [
                12414,
                12672
            ],
            [
                12672,
                12733
            ],
            [
                12733,
                12827
            ],
            [
                12827,
                12933
            ],
            [
                12933,
                13015
            ],
            [
                13015,
                13246
            ],
            [
                13246,
                13466
            ],
            [
                13466,
                13833
            ],
            [
                13833,
                13875
            ],
            [
                13875,
                13967
            ],
            [
                13967,
                14090
            ],
            [
                14090,
                14150
            ],
            [
                14150,
                14202
            ],
            [
                14202,
                14283
            ],
            [
                14283,
                14416
            ],
            [
                14416,
                14536
            ],
            [
                14536,
                14642
            ],
            [
                14642,
                14707
            ],
            [
                14707,
                14839
            ],
            [
                14839,
                14850
            ],
            [
                14850,
                14891
            ],
            [
                14891,
                14976
            ],
            [
                14976,
                15040
            ],
            [
                15040,
                15144
            ],
            [
                15144,
                15188
            ],
            [
                15188,
                15232
            ],
            [
                15232,
                15260
            ],
            [
                15260,
                15383
            ],
            [
                15383,
                15558
            ],
            [
                15558,
                15662
            ],
            [
                15662,
                15694
            ],
            [
                15694,
                15818
            ],
            [
                15818,
                15985
            ],
            [
                15985,
                16034
            ],
            [
                16034,
                16103
            ],
            [
                16103,
                16293
            ],
            [
                16293,
                16554
            ],
            [
                16554,
                16605
            ],
            [
                16605,
                16748
            ],
            [
                16748,
                16858
            ],
            [
                16858,
                16992
            ],
            [
                16992,
                17088
            ],
            [
                17088,
                17275
            ],
            [
                17275,
                17410
            ],
            [
                17410,
                17588
            ],
            [
                17588,
                17659
            ],
            [
                17659,
                17740
            ],
            [
                17740,
                17898
            ],
            [
                17898,
                17938
            ],
            [
                17938,
                17974
            ],
            [
                17974,
                18004
            ],
            [
                18004,
                18017
            ],
            [
                18017,
                18048
            ],
            [
                18048,
                18096
            ],
            [
                18096,
                18150
            ],
            [
                18150,
                18205
            ],
            [
                18205,
                18333
            ],
            [
                18333,
                18410
            ],
            [
                18410,
                18586
            ],
            [
                18586,
                18680
            ],
            [
                18680,
                18857
            ],
            [
                18857,
                19058
            ],
            [
                19058,
                19197
            ],
            [
                19197,
                19375
            ],
            [
                19375,
                19511
            ],
            [
                19511,
                19590
            ],
            [
                19590,
                19715
            ],
            [
                19715,
                19863
            ],
            [
                19863,
                19922
            ],
            [
                19922,
                20010
            ],
            [
                20010,
                20061
            ],
            [
                20061,
                20086
            ],
            [
                20086,
                20137
            ],
            [
                20137,
                20175
            ],
            [
                20175,
                20261
            ],
            [
                20261,
                20323
            ],
            [
                20323,
                20346
            ],
            [
                20346,
                20357
            ],
            [
                20357,
                20402
            ],
            [
                20402,
                20440
            ],
            [
                20440,
                20574
            ],
            [
                20574,
                20597
            ],
            [
                20597,
                20609
            ],
            [
                20609,
                20640
            ],
            [
                20640,
                20719
            ],
            [
                20719,
                20877
            ],
            [
                20877,
                20885
            ],
            [
                20885,
                20927
            ],
            [
                20927,
                20946
            ],
            [
                20946,
                21008
            ],
            [
                21008,
                21031
            ],
            [
                21031,
                21075
            ],
            [
                21075,
                21101
            ],
            [
                21101,
                21208
            ],
            [
                21208,
                21302
            ],
            [
                21302,
                21398
            ],
            [
                21398,
                21486
            ],
            [
                21486,
                21644
            ],
            [
                21644,
                21671
            ],
            [
                21671,
                21693
            ],
            [
                21693,
                21720
            ],
            [
                21720,
                21740
            ],
            [
                21740,
                21809
            ],
            [
                21809,
                21906
            ],
            [
                21906,
                21995
            ],
            [
                21995,
                22029
            ],
            [
                22029,
                22064
            ],
            [
                22064,
                22187
            ],
            [
                22187,
                22211
            ],
            [
                22211,
                22303
            ],
            [
                22303,
                22436
            ],
            [
                22436,
                22448
            ],
            [
                22448,
                22460
            ],
            [
                22460,
                22513
            ],
            [
                22513,
                22536
            ],
            [
                22536,
                22570
            ],
            [
                22570,
                22670
            ],
            [
                22670,
                22703
            ],
            [
                22703,
                22779
            ],
            [
                22779,
                22818
            ],
            [
                22818,
                22838
            ],
            [
                22838,
                22876
            ],
            [
                22876,
                22941
            ],
            [
                22941,
                23026
            ],
            [
                23026,
                23109
            ],
            [
                23109,
                23193
            ],
            [
                23193,
                23236
            ],
            [
                23236,
                23251
            ],
            [
                23251,
                23289
            ],
            [
                23289,
                23314
            ],
            [
                23314,
                23340
            ],
            [
                23340,
                23429
            ],
            [
                23429,
                23542
            ],
            [
                23542,
                23567
            ],
            [
                23567,
                23621
            ],
            [
                23621,
                23717
            ],
            [
                23717,
                23880
            ],
            [
                23880,
                23975
            ],
            [
                23975,
                24014
            ],
            [
                24014,
                24080
            ],
            [
                24080,
                24114
            ],
            [
                24114,
                24154
            ],
            [
                24154,
                24211
            ],
            [
                24211,
                24255
            ],
            [
                24255,
                24369
            ],
            [
                24369,
                24458
            ],
            [
                24458,
                24569
            ],
            [
                24569,
                24691
            ],
            [
                24691,
                24835
            ],
            [
                24835,
                24887
            ],
            [
                24887,
                24990
            ],
            [
                24990,
                25223
            ],
            [
                25223,
                25234
            ],
            [
                25234,
                25309
            ],
            [
                25309,
                25339
            ],
            [
                25339,
                25384
            ],
            [
                25384,
                25431
            ],
            [
                25431,
                25481
            ],
            [
                25481,
                25515
            ],
            [
                25515,
                25626
            ],
            [
                25626,
                25657
            ],
            [
                25657,
                25670
            ],
            [
                25670,
                25687
            ],
            [
                25687,
                25856
            ],
            [
                25856,
                26045
            ],
            [
                26045,
                26099
            ],
            [
                26099,
                26164
            ],
            [
                26164,
                26193
            ],
            [
                26193,
                26208
            ],
            [
                26208,
                26253
            ],
            [
                26253,
                26287
            ],
            [
                26287,
                26321
            ],
            [
                26321,
                26334
            ],
            [
                26334,
                26388
            ],
            [
                26388,
                26469
            ],
            [
                26469,
                26545
            ],
            [
                26545,
                26794
            ],
            [
                26794,
                26873
            ]
        ],
        "overlap_chars": [
            [
                0,
                31
            ],
            [
                37,
                70
            ],
            [
                98,
                100
            ],
            [
                159,
                187
            ],
            [
                205,
                208
            ],
            [
                188,
                203
            ],
            [
                216,
                218
            ],
            [
                397,
                423
            ],
            [
                493,
                499
            ],
            [
                443,
                482
            ],
            [
                483,
                488
            ],
            [
                500,
                517
            ],
            [
                517,
                559
            ],
            [
                559,
                590
            ],
            [
                602,
                621
            ],
            [
                621,
                638
            ],
            [
                638,
                710
            ],
            [
                733,
                744
            ],
            [
                726,
                727
            ],
            [
                745,
                764
            ],
            [
                764,
                791
            ],
            [
                852,
                855
            ],
            [
                855,
                856
            ],
            [
                870,
                909
            ],
            [
                859,
                864
            ],
            [
                909,
                911
            ],
            [
                911,
                967
            ],
            [
                967,
                992
            ],
            [
                1057,
                1098
            ],
            [
                1098,
                1133
            ],
            [
                1139,
                1194
            ],
            [
                1207,
                1271
            ],
            [
                1271,
                1334
            ],
            [
                1334,
                1365
            ],
            [
                1365,
                1423
            ],
            [
                1423,
                1487
            ],
            [
                1487,
                1563
            ],
            [
                1563,
                1687
            ],
            [
                1687,
                1738
            ],
            [
                1738,
                1739
            ],
            [
                1752,
                1785
            ],
            [
                1831,
                1833
            ],
            [
                1866,
                1900
            ],
            [
                1988,
                1990
            ],
            [
                2062,
                2067
            ],
            [
                2094,
                2141
            ],
            [
                2149,
                2176
            ],
            [
                2182,
                2188
            ],
            [
                2210,
                2217
            ],
            [
                2217,
                2284
            ],
            [
                2285,
                2294
            ],
            [
                2335,
                2349
            ],
            [
                2326,
                2329
            ],
            [
                2368,
                2373
            ],
            [
                2381,
                2389
            ],
            [
                2403,
                2434
            ],
            [
                2434,
                2440
            ],
            [
                2451,
                2469
            ],
            [
                2480,
                2519
            ],
            [
                2520,
                2533
            ],
            [
                2540,
                2550
            ],
            [
                2570,
                2599
            ],
            [
                2599,
                2605
            ],
            [
                2617,
                2635
            ],
            [
                2649,
                2682
            ],
            [
                2683,
                2732
            ],
            [
                2751,
                2754
            ],
            [
                2734,
                2737
            ],
            [
                2755,
                2779
            ],
            [
                2779,
                2866
            ],
            [
                2874,
                2941
            ],
            [
                3127,
                3143
            ],
            [
                3196,
                3204
            ],
            [
                3219,
                3239
            ],
            [
                3264,
                3275
            ],
            [
                3163,
                3165
            ],
            [
                3290,
                3315
            ],
            [
                3320,
                3332
            ],
            [
                3332,
                3346
            ],
            [
                3362,
                3394
            ],
            [
                3398,
                3408
            ],
            [
                3484,
                3550
            ],
            [
                3554,
                3556
            ],
            [
                3556,
                3589
            ],
            [
                3595,
                3614
            ],
            [
                3614,
                3672
            ],
            [
                3765,
                3782
            ],
            [
                3789,
                3825
            ],
            [
                3825,
                3845
            ],
            [
                3882,
                3915
            ],
            [
                3924,
                3940
            ],
            [
                3940,
                3989
            ],
            [
                4011,
                4017
            ],
            [
                4026,
                4066
            ],
            [
                4066,
                4072
            ],
            [
                4099,
                4112
            ],
            [
                4112,
                4122
            ],
            [
                4141,
                4158
            ],
            [
                4138,
                4140
            ],
            [
                4193,
                4279
            ],
            [
                4159,
                4160
            ],
            [
                4313,
                4319
            ],
            [
                4319,
                4402
            ],
            [
                4410,
                4415
            ],
            [
                4420,
                4427
            ],
            [
                4428,
                4462
            ],
            [
                4474,
                4505
            ],
            [
                4514,
                4525
            ],
            [
                4538,
                4550
            ],
            [
                5492,
                5495
            ],
            [
                5298,
                5300
            ],
            [
                5204,
                5205
            ],
            [
                5490,
                5491
            ],
            [
                5228,
                5231
            ],
            [
                4979,
                5013
            ],
            [
                5067,
                5074
            ],
            [
                5575,
                5584
            ],
            [
                5031,
                5032
            ],
            [
                5601,
                5623
            ],
            [
                5623,
                5663
            ],
            [
                5671,
                5674
            ],
            [
                5686,
                5688
            ],
            [
                5705,
                5744
            ],
            [
                5777,
                5808
            ],
            [
                5808,
                5842
            ],
            [
                5902,
                5903
            ],
            [
                5844,
                5851
            ],
            [
                5871,
                5897
            ],
            [
                5936,
                5949
            ],
            [
                5898,
                5902
            ],
            [
                6022,
                6024
            ],
            [
                6109,
                6112
            ],
            [
                6132,
                6137
            ],
            [
                6143,
                6183
            ],
            [
                6210,
                6219
            ],
            [
                6222,
                6247
            ],
            [
                6247,
                6284
            ],
            [
                6311,
                6319
            ],
            [
                6325,
                6333
            ],
            [
                6339,
                6354
            ],
            [
                6385,
                6391
            ],
            [
                6418,
                6493
            ],
            [
                6493,
                6514
            ],
            [
                6572,
                6577
            ],
            [
                6557,
                6568
            ],
            [
                6540,
                6550
            ],
            [
                6529,
                6538
            ],
            [
                6578,
                6617
            ],
            [
                6628,
                6685
            ],
            [
                6694,
                6714
            ],
            [
                6722,
                6746
            ],
            [
                6756,
                6758
            ],
            [
                6758,
                6842
            ],
            [
                6863,
                6879
            ],
            [
                6881,
                6902
            ],
            [
                6902,
                6906
            ],
            [
                7021,
                7026
            ],
            [
                7135,
                7139
            ],
            [
                7145,
                7175
            ],
            [
                6920,
                6922
            ],
            [
                6957,
                6961
            ],
            [
                7175,
                7177
            ],
            [
                7177,
                7235
            ],
            [
                7309,
                7311
            ],
            [
                7311,
                7352
            ],
            [
                7377,
                7396
            ],
            [
                7396,
                7426
            ],
            [
                7426,
                7461
            ],
            [
                7496,
                7608
            ],
            [
                7615,
                7624
            ],
            [
                7630,
                7631
            ],
            [
                7945,
                7984
            ],
            [
                7984,
                8046
            ],
            [
                8130,
                8192
            ],
            [
                8192,
                8234
            ],
            [
                8245,
                8292
            ],
            [
                8292,
                8310
            ],
            [
                8324,
                8326
            ],
            [
                8326,
                8375
            ],
            [
                8379,
                8384
            ],
            [
                8397,
                8403
            ],
            [
                8457,
                8470
            ],
            [
                8492,
                8496
            ],
            [
                8471,
                8491
            ],
            [
                8508,
                8536
            ],
            [
                8537,
                8547
            ],
            [
                8559,
                8588
            ],
            [
                8588,
                8698
            ],
            [
                8698,
                8744
            ],
            [
                8744,
                8755
            ],
            [
                8755,
                8758
            ],
            [
                8762,
                8831
            ],
            [
                8838,
                8867
            ],
            [
                8867,
                8935
            ],
            [
                9054,
                9081
            ],
            [
                9090,
                9104
            ],
            [
                9104,
                9133
            ],
            [
                9133,
                9155
            ],
            [
                9202,
                9268
            ],
            [
                9275,
                9276
            ],
            [
                9278,
                9294
            ],
            [
                9323,
                9356
            ],
            [
                9356,
                9401
            ],
            [
                9401,
                9423
            ],
            [
                9453,
                9493
            ],
            [
                9493,
                9536
            ],
            [
                9577,
                9601
            ],
            [
                9616,
                9627
            ],
            [
                9542,
                9552
            ],
            [
                9646,
                9673
            ],
            [
                9673,
                9687
            ],
            [
                9697,
                9727
            ],
            [
                9736,
                9745
            ],
            [
                9754,
                9756
            ],
            [
                9756,
                9767
            ],
            [
                9787,
                9813
            ],
            [
                9829,
                9872
            ],
            [
                9878,
                9881
            ],
            [
                9778,
                9780
            ],
            [
                9942,
                9952
            ],
            [
                9985,
                9987
            ],
            [
                9963,
                9984
            ],
            [
                10006,
                10007
            ],
            [
                10008,
                10028
            ],
            [
                10041,
                10069
            ],
            [
                10092,
                10156
            ],
            [
                10170,
                10191
            ],
            [
                10207,
                10249
            ],
            [
                10261,
                10280
            ],
            [
                10400,
                10404
            ],
            [
                10365,
                10368
            ],
            [
                10410,
                10417
            ],
            [
                10427,
                10436
            ],
            [
                10436,
                10499
            ],
            [
                10514,
                10515
            ],
            [
                10529,
                10606
            ],
            [
                10606,
                10614
            ],
            [
                10623,
                10632
            ],
            [
                10615,
                10619
            ],
            [
                10647,
                10673
            ],
            [
                10686,
                10712
            ],
            [
                10712,
                10738
            ],
            [
                10749,
                10804
            ],
            [
                11015,
                11029
            ],
            [
                11036,
                11041
            ],
            [
                10921,
                10928
            ],
            [
                10996,
                11000
            ],
            [
                11001,
                11013
            ],
            [
                11054,
                11057
            ],
            [
                11057,
                11092
            ],
            [
                11092,
                11099
            ],
            [
                11100,
                11112
            ],
            [
                11132,
                11134
            ],
            [
                11134,
                11255
            ],
            [
                11255,
                11299
            ],
            [
                11322,
                11342
            ],
            [
                11469,
                11479
            ],
            [
                11485,
                11504
            ],
            [
                11528,
                11531
            ],
            [
                11516,
                11519
            ],
            [
                11537,
                11557
            ],
            [
                11568,
                11611
            ],
            [
                11644,
                11653
            ],
            [
                11661,
                11677
            ],
            [
                11677,
                11691
            ],
            [
                11702,
                11752
            ],
            [
                11780,
                11851
            ],
            [
                11851,
                11893
            ],
            [
                11894,
                11928
            ],
            [
                11928,
                11937
            ],
            [
                12017,
                12019
            ],
            [
                12075,
                12109
            ],
            [
                12112,
                12140
            ],
            [
                12150,
                12165
            ],
            [
                12165,
                12215
            ],
            [
                12215,
                12250
            ],
            [
                12260,
                12268
            ],
            [
                12268,
                12278
            ],
            [
                12298,
                12318
            ],
            [
                12391,
                12393
            ],
            [
                12405,
                12414
            ],
            [
                12414,
                12447
            ],
            [
                12449,
                12468
            ],
            [
                12447,
                12448
            ],
            [
                12672,
                12675
            ],
            [
                12695,
                12705
            ],
            [
                12827,
                12863
            ],
            [
                12575,
                12578
            ],
            [
                12543,
                12546
            ],
            [
                12797,
                12826
            ],
            [
                13034,
                13039
            ],
            [
                13051,
                13055
            ],
            [
                13065,
                13140
            ],
            [
                13045,
                13047
            ],
            [
                13170,
                13245
            ],
            [
                13246,
                13390
            ],
            [
                13464,
                13466
            ],
            [
                13573,
                13692
            ],
            [
                13700,
                13754
            ],
            [
                13569,
                13572
            ],
            [
                13469,
                13473
            ],
            [
                13816,
                13833
            ],
            [
                13833,
                13875
            ],
            [
                13967,
                13985
            ],
            [
                14000,
                14020
            ],
            [
                14028,
                14039
            ],
            [
                14049,
                14056
            ],
            [
                14021,
                14023
            ],
            [
                14073,
                14090
            ],
            [
                14171,
                14174
            ],
            [
                14109,
                14117
            ],
            [
                14090,
                14094
            ],
            [
                14125,
                14148
            ],
            [
                14244,
                14245
            ],
            [
                14256,
                14268
            ],
            [
                14274,
                14281
            ],
            [
                14118,
                14124
            ],
            [
                14281,
                14283
            ],
            [
                14283,
                14322
            ],
            [
                14351,
                14354
            ],
            [
                14323,
                14326
            ],
            [
                14347,
                14350
            ],
            [
                14414,
                14416
            ],
            [
                14536,
                14595
            ],
            [
                14616,
                14642
            ],
            [
                14642,
                14707
            ],
            [
                14707,
                14795
            ],
            [
                14820,
                14839
            ],
            [
                14839,
                14850
            ],
            [
                14850,
                14874
            ],
            [
                14889,
                14890
            ],
            [
                14891,
                14922
            ],
            [
                14931,
                14976
            ],
            [
                15000,
                15004
            ],
            [
                15008,
                15013
            ],
            [
                14983,
                14987
            ],
            [
                15017,
                15034
            ],
            [
                15038,
                15040
            ],
            [
                15040,
                15071
            ],
            [
                15079,
                15125
            ],
            [
                15128,
                15144
            ],
            [
                15144,
                15188
            ],
            [
                15188,
                15232
            ],
            [
                15232,
                15260
            ],
            [
                15260,
                15314
            ],
            [
                15333,
                15383
            ],
            [
                15424,
                15440
            ],
            [
                15452,
                15464
            ],
            [
                15497,
                15498
            ],
            [
                15466,
                15497
            ],
            [
                15500,
                15558
            ],
            [
                15573,
                15602
            ],
            [
                15606,
                15616
            ],
            [
                15619,
                15662
            ],
            [
                15662,
                15676
            ],
            [
                15686,
                15694
            ],
            [
                15694,
                15700
            ],
            [
                15787,
                15790
            ],
            [
                15713,
                15738
            ],
            [
                15768,
                15781
            ],
            [
                15799,
                15818
            ],
            [
                15818,
                15821
            ],
            [
                15828,
                15831
            ],
            [
                15837,
                15856
            ],
            [
                15866,
                15873
            ],
            [
                15879,
                15911
            ],
            [
                15913,
                15951
            ],
            [
                15968,
                15972
            ],
            [
                15983,
                15985
            ],
            [
                15985,
                16034
            ],
            [
                16034,
                16040
            ],
            [
                16062,
                16075
            ],
            [
                16182,
                16201
            ],
            [
                16207,
                16211
            ],
            [
                16291,
                16293
            ],
            [
                16293,
                16300
            ],
            [
                16307,
                16347
            ],
            [
                16348,
                16357
            ],
            [
                16370,
                16381
            ],
            [
                16530,
                16532
            ],
            [
                16402,
                16404
            ],
            [
                16546,
                16548
            ],
            [
                16382,
                16388
            ],
            [
                16412,
                16417
            ],
            [
                16423,
                16509
            ],
            [
                16552,
                16554
            ],
            [
                16605,
                16638
            ],
            [
                16643,
                16673
            ],
            [
                16680,
                16701
            ],
            [
                16746,
                16748
            ],
            [
                16748,
                16815
            ],
            [
                16826,
                16858
            ],
            [
                16992,
                17088
            ],
            [
                17088,
                17102
            ],
            [
                17134,
                17157
            ],
            [
                17121,
                17124
            ],
            [
                17273,
                17275
            ],
            [
                17426,
                17444
            ],
            [
                17444,
                17481
            ],
            [
                17485,
                17487
            ],
            [
                17697,
                17701
            ],
            [
                17616,
                17622
            ],
            [
                17728,
                17734
            ],
            [
                17544,
                17546
            ],
            [
                17719,
                17727
            ],
            [
                17586,
                17587
            ],
            [
                17740,
                17766
            ],
            [
                17781,
                17842
            ],
            [
                17896,
                17897
            ],
            [
                17898,
                17938
            ],
            [
                17938,
                17971
            ],
            [
                18096,
                18125
            ],
            [
                18127,
                18148
            ],
            [
                18239,
                18243
            ],
            [
                18436,
                18445
            ],
            [
                18244,
                18250
            ],
            [
                18278,
                18288
            ],
            [
                18251,
                18255
            ],
            [
                18451,
                18461
            ],
            [
                18482,
                18511
            ],
            [
                18554,
                18556
            ],
            [
                18513,
                18534
            ],
            [
                18568,
                18586
            ],
            [
                18586,
                18609
            ],
            [
                18631,
                18680
            ],
            [
                19511,
                19528
            ],
            [
                19529,
                19560
            ],
            [
                19588,
                19590
            ],
            [
                19590,
                19681
            ],
            [
                19749,
                19750
            ],
            [
                19786,
                19800
            ],
            [
                19738,
                19741
            ],
            [
                19801,
                19805
            ],
            [
                19848,
                19863
            ],
            [
                19863,
                19922
            ],
            [
                19922,
                20010
            ],
            [
                20010,
                20061
            ],
            [
                20061,
                20075
            ],
            [
                20084,
                20086
            ],
            [
                20086,
                20099
            ],
            [
                20117,
                20118
            ],
            [
                20126,
                20137
            ],
            [
                20137,
                20175
            ],
            [
                20175,
                20178
            ],
            [
                20197,
                20218
            ],
            [
                20225,
                20261
            ],
            [
                20323,
                20346
            ],
            [
                20346,
                20357
            ],
            [
                20357,
                20373
            ],
            [
                20393,
                20394
            ],
            [
                20406,
                20438
            ],
            [
                20402,
                20405
            ],
            [
                20440,
                20444
            ],
            [
                20485,
                20508
            ],
            [
                20438,
                20439
            ],
            [
                20521,
                20554
            ],
            [
                20560,
                20565
            ],
            [
                20572,
                20573
            ],
            [
                20574,
                20597
            ],
            [
                20602,
                20609
            ],
            [
                20640,
                20689
            ],
            [
                20703,
                20719
            ],
            [
                20719,
                20734
            ],
            [
                20805,
                20814
            ],
            [
                20821,
                20847
            ],
            [
                20849,
                20864
            ],
            [
                20875,
                20876
            ],
            [
                20927,
                20944
            ],
            [
                20944,
                20946
            ],
            [
                21008,
                21031
            ],
            [
                21038,
                21062
            ],
            [
                21073,
                21075
            ],
            [
                21075,
                21101
            ],
            [
                21101,
                21168
            ],
            [
                21174,
                21177
            ],
            [
                21183,
                21208
            ],
            [
                21208,
                21302
            ],
            [
                21302,
                21315
            ],
            [
                21326,
                21337
            ],
            [
                21344,
                21366
            ],
            [
                21383,
                21397
            ],
            [
                21398,
                21486
            ],
            [
                21486,
                21555
            ],
            [
                21597,
                21644
            ],
            [
                21671,
                21693
            ],
            [
                21693,
                21718
            ],
            [
                21815,
                21906
            ],
            [
                21906,
                21954
            ],
            [
                21976,
                21980
            ],
            [
                21969,
                21975
            ],
            [
                21993,
                21995
            ],
            [
                22000,
                22004
            ],
            [
                22011,
                22018
            ],
            [
                22027,
                22029
            ],
            [
                22029,
                22030
            ],
            [
                22034,
                22064
            ],
            [
                22187,
                22211
            ],
            [
                22211,
                22253
            ],
            [
                22271,
                22281
            ],
            [
                22286,
                22303
            ],
            [
                22418,
                22436
            ],
            [
                22436,
                22448
            ],
            [
                22448,
                22460
            ],
            [
                22460,
                22464
            ],
            [
                22511,
                22513
            ],
            [
                22513,
                22535
            ],
            [
                22703,
                22709
            ],
            [
                22715,
                22730
            ],
            [
                22730,
                22779
            ],
            [
                22779,
                22818
            ],
            [
                22818,
                22838
            ],
            [
                22838,
                22839
            ],
            [
                22846,
                22876
            ],
            [
                22876,
                22916
            ],
            [
                22920,
                22941
            ],
            [
                22941,
                23002
            ],
            [
                23024,
                23026
            ],
            [
                23026,
                23037
            ],
            [
                23060,
                23067
            ],
            [
                23082,
                23109
            ],
            [
                23109,
                23171
            ],
            [
                23190,
                23193
            ],
            [
                23193,
                23211
            ],
            [
                23227,
                23233
            ],
            [
                23260,
                23270
            ],
            [
                23274,
                23277
            ],
            [
                23286,
                23289
            ],
            [
                23289,
                23314
            ],
            [
                23340,
                23357
            ],
            [
                23387,
                23399
            ],
            [
                23408,
                23429
            ],
            [
                23429,
                23490
            ],
            [
                23539,
                23542
            ],
            [
                23542,
                23567
            ],
            [
                23582,
                23621
            ],
            [
                23642,
                23659
            ],
            [
                23665,
                23717
            ],
            [
                23717,
                23718
            ],
            [
                23784,
                23811
            ],
            [
                23821,
                23838
            ],
            [
                23848,
                23859
            ],
            [
                23866,
                23880
            ],
            [
                23880,
                23886
            ],
            [
                23892,
                23927
            ],
            [
                23935,
                23975
            ],
            [
                24080,
                24114
            ],
            [
                24114,
                24154
            ],
            [
                24154,
                24211
            ],
            [
                24211,
                24241
            ],
            [
                24246,
                24255
            ],
            [
                24255,
                24280
            ],
            [
                24294,
                24321
            ],
            [
                24367,
                24369
            ],
            [
                24369,
                24401
            ],
            [
                24427,
                24458
            ],
            [
                24691,
                24745
            ],
            [
                24802,
                24835
            ],
            [
                24891,
                24905
            ],
            [
                24915,
                24957
            ],
            [
                24987,
                24989
            ],
            [
                24990,
                24999
            ],
            [
                25004,
                25020
            ],
            [
                25094,
                25147
            ],
            [
                25149,
                25166
            ],
            [
                25167,
                25222
            ],
            [
                25234,
                25309
            ],
            [
                25309,
                25339
            ],
            [
                25339,
                25340
            ],
            [
                25343,
                25356
            ],
            [
                25382,
                25384
            ],
            [
                25384,
                25431
            ],
            [
                25431,
                25481
            ],
            [
                25481,
                25482
            ],
            [
                25486,
                25493
            ],
            [
                25500,
                25515
            ],
            [
                25626,
                25642
            ],
            [
                25562,
                25567
            ],
            [
                25648,
                25657
            ],
            [
                25657,
                25670
            ],
            [
                25670,
                25687
            ],
            [
                25687,
                25764
            ],
            [
                25773,
                25780
            ],
            [
                25810,
                25838
            ],
            [
                25854,
                25856
            ],
            [
                25856,
                25984
            ],
            [
                26043,
                26045
            ],
            [
                26045,
                26099
            ],
            [
                26099,
                26164
            ],
            [
                26164,
                26165
            ],
            [
                26173,
                26191
            ],
            [
                26532,
                26543
            ],
            [
                26543,
                26545
            ],
            [
                26545,
                26579
            ],
            [
                26603,
                26666
            ],
            [
                26690,
                26691
            ],
            [
                26749,
                26754
            ],
            [
                26720,
                26733
            ],
            [
                26756,
                26793
            ],
            [
                26794,
                26834
            ],
            [
                26840,
                26850
            ],
            [
                26859,
                26866
            ],
            [
                26872,
                26873
            ]
        ],
        "row_chars": [
            [
                0,
                218
            ],
            [
                218,
                397
            ],
            [
                397,
                517
            ],
            [
                517,
                559
            ],
            [
                559,
                621
            ],
            [
                621,
                638
            ],
            [
                638,
                764
            ],
            [
                764,
                855
            ],
            [
                855,
                911
            ],
            [
                911,
                967
            ],
            [
                967,
                992
            ],
            [
                992,
                1057
            ],
            [
                1057,
                1098
            ],
            [
                1098,
                1194
            ],
            [
                1194,
                1207
            ],
            [
                1207,
                1271
            ],
            [
                1271,
                1334
            ],
            [
                1334,
                1365
            ],
            [
                1365,
                1423
            ],
            [
                1423,
                1487
            ],
            [
                1487,
                1563
            ],
            [
                1563,
                1687
            ],
            [
                1687,
                1738
            ],
            [
                1738,
                1786
            ],
            [
                1786,
                1831
            ],
            [
                1831,
                1990
            ],
            [
                1990,
                2062
            ],
            [
                2062,
                2217
            ],
            [
                2217,
                2434
            ],
            [
                2434,
                2599
            ],
            [
                2599,
                2683
            ],
            [
                2683,
                2779
            ],
            [
                2779,
                2941
            ],
            [
                2941,
                2973
            ],
            [
                2973,
                3127
            ],
            [
                3127,
                3332
            ],
            [
                3332,
                3556
            ],
            [
                3556,
                3614
            ],
            [
                3614,
                3825
            ],
            [
                3825,
                3940
            ],
            [
                3940,
                4066
            ],
            [
                4066,
                4112
            ],
            [
                4112,
                4319
            ],
            [
                4319,
                4550
            ],
            [
                4550,
                4749
            ],
            [
                4749,
                4841
            ],
            [
                4841,
                4979
            ],
            [
                4979,
                5623
            ],
            [
                5623,
                5808
            ],
            [
                5808,
                6024
            ],
            [
                6024,
                6109
            ],
            [
                6109,
                6247
            ],
            [
                6247,
                6493
            ],
            [
                6493,
                6758
            ],
            [
                6758,
                6902
            ],
            [
                6902,
                7177
            ],
            [
                7177,
                7311
            ],
            [
                7311,
                7426
            ],
            [
                7426,
                7632
            ],
            [
                7632,
                7711
            ],
            [
                7711,
                7842
            ],
            [
                7842,
                7945
            ],
            [
                7945,
                7984
            ],
            [
                7984,
                8046
            ],
            [
                8046,
                8130
            ],
            [
                8130,
                8192
            ],
            [
                8192,
                8234
            ],
            [
                8234,
                8245
            ],
            [
                8245,
                8292
            ],
            [
                8292,
                8326
            ],
            [
                8326,
                8405
            ],
            [
                8405,
                8457
            ],
            [
                8457,
                8537
            ],
            [
                8537,
                8588
            ],
            [
                8588,
                8698
            ],
            [
                8698,
                8744
            ],
            [
                8744,
                8755
            ],
            [
                8755,
                8867
            ],
            [
                8867,
                8935
            ],
            [
                8935,
                8982
            ],
            [
                8982,
                9054
            ],
            [
                9054,
                9104
            ],
            [
                9104,
                9133
            ],
            [
                9133,
                9155
            ],
            [
                9155,
                9202
            ],
            [
                9202,
                9356
            ],
            [
                9356,
                9401
            ],
            [
                9401,
                9423
            ],
            [
                9423,
                9453
            ],
            [
                9453,
                9493
            ],
            [
                9493,
                9536
            ],
            [
                9536,
                9673
            ],
            [
                9673,
                9756
            ],
            [
                9756,
                10008
            ],
            [
                10008,
                10282
            ],
            [
                10282,
                10345
            ],
            [
                10345,
                10436
            ],
            [
                10436,
                10606
            ],
            [
                10606,
                10712
            ],
            [
                10712,
                10807
            ],
            [
                10807,
                10920
            ],
            [
                10920,
                11057
            ],
            [
                11057,
                11092
            ],
            [
                11092,
                11134
            ],
            [
                11134,
                11255
            ],
            [
                11255,
                11344
            ],
            [
                11344,
                11437
            ],
            [
                11437,
                11469
            ],
            [
                11469,
                11677
            ],
            [
                11677,
                11851
            ],
            [
                11851,
                11894
            ],
            [
                11894,
                11928
            ],
            [
                11928,
                12019
            ],
            [
                12019,
                12075
            ],
            [
                12075,
                12165
            ],
            [
                12165,
                12215
            ],
            [
                12215,
                12268
            ],
            [
                12268,
                12414
            ],
            [
                12414,
                12933
            ],
            [
                12933,
                13015
            ],
            [
                13015,
                13246
            ],
            [
                13246,
                13466
            ],
            [
                13466,
                13833
            ],
            [
                13833,
                13875
            ],
            [
                13875,
                13967
            ],
            [
                13967,
                14090
            ],
            [
                14090,
                14283
            ],
            [
                14283,
                14416
            ],
            [
                14416,
                14536
            ],
            [
                14536,
                14642
            ],
            [
                14642,
                14707
            ],
            [
                14707,
                14839
            ],
            [
                14839,
                14850
            ],
            [
                14850,
                14891
            ],
            [
                14891,
                14976
            ],
            [
                14976,
                15040
            ],
            [
                15040,
                15144
            ],
            [
                15144,
                15188
            ],
            [
                15188,
                15232
            ],
            [
                15232,
                15260
            ],
            [
                15260,
                15383
            ],
            [
                15383,
                15558
            ],
            [
                15558,
                15662
            ],
            [
                15662,
                15694
            ],
            [
                15694,
                15818
            ],
            [
                15818,
                15985
            ],
            [
                15985,
                16034
            ],
            [
                16034,
                16293
            ],
            [
                16293,
                16554
            ],
            [
                16554,
                16605
            ],
            [
                16605,
                16748
            ],
            [
                16748,
                16858
            ],
            [
                16858,
                16992
            ],
            [
                16992,
                17088
            ],
            [
                17088,
                17275
            ],
            [
                17275,
                17410
            ],
            [
                17410,
                17740
            ],
            [
                17740,
                17898
            ],
            [
                17898,
                17938
            ],
            [
                17938,
                17974
            ],
            [
                17974,
                18004
            ],
            [
                18004,
                18017
            ],
            [
                18017,
                18048
            ],
            [
                18048,
                18096
            ],
            [
                18096,
                18150
            ],
            [
                18150,
                18205
            ],
            [
                18205,
                18586
            ],
            [
                18586,
                18680
            ],
            [
                18680,
                18857
            ],
            [
                18857,
                19058
            ],
            [
                19058,
                19197
            ],
            [
                19197,
                19375
            ],
            [
                19375,
                19511
            ],
            [
                19511,
                19590
            ],
            [
                19590,
                19863
            ],
            [
                19863,
                19922
            ],
            [
                19922,
                20010
            ],
            [
                20010,
                20061
            ],
            [
                20061,
                20086
            ],
            [
                20086,
                20137
            ],
            [
                20137,
                20175
            ],
            [
                20175,
                20261
            ],
            [
                20261,
                20323
            ],
            [
                20323,
                20346
            ],
            [
                20346,
                20357
            ],
            [
                20357,
                20402
            ],
            [
                20402,
                20574
            ],
            [
                20574,
                20597
            ],
            [
                20597,
                20609
            ],
            [
                20609,
                20640
            ],
            [
                20640,
                20719
            ],
            [
                20719,
                20877
            ],
            [
                20877,
                20885
            ],
            [
                20885,
                20927
            ],
            [
                20927,
                20946
            ],
            [
                20946,
                21008
            ],
            [
                21008,
                21031
            ],
            [
                21031,
                21075
            ],
            [
                21075,
                21101
            ],
            [
                21101,
                21208
            ],
            [
                21208,
                21302
            ],
            [
                21302,
                21398
            ],
            [
                21398,
                21486
            ],
            [
                21486,
                21644
            ],
            [
                21644,
                21671
            ],
            [
                21671,
                21693
            ],
            [
                21693,
                21720
            ],
            [
                21720,
                21740
            ],
            [
                21740,
                21809
            ],
            [
                21809,
                21906
            ],
            [
                21906,
                21995
            ],
            [
                21995,
                22029
            ],
            [
                22029,
                22064
            ],
            [
                22064,
                22187
            ],
            [
                22187,
                22211
            ],
            [
                22211,
                22303
            ],
            [
                22303,
                22436
            ],
            [
                22436,
                22448
            ],
            [
                22448,
                22460
            ],
            [
                22460,
                22513
            ],
            [
                22513,
                22536
            ],
            [
                22536,
                22570
            ],
            [
                22570,
                22670
            ],
            [
                22670,
                22703
            ],
            [
                22703,
                22779
            ],
            [
                22779,
                22818
            ],
            [
                22818,
                22838
            ],
            [
                22838,
                22876
            ],
            [
                22876,
                22941
            ],
            [
                22941,
                23026
            ],
            [
                23026,
                23109
            ],
            [
                23109,
                23193
            ],
            [
                23193,
                23236
            ],
            [
                23236,
                23251
            ],
            [
                23251,
                23289
            ],
            [
                23289,
                23314
            ],
            [
                23314,
                23340
            ],
            [
                23340,
                23429
            ],
            [
                23429,
                23542
            ],
            [
                23542,
                23567
            ],
            [
                23567,
                23621
            ],
            [
                23621,
                23717
            ],
            [
                23717,
                23880
            ],
            [
                23880,
                23975
            ],
            [
                23975,
                24014
            ],
            [
                24014,
                24080
            ],
            [
                24080,
                24114
            ],
            [
                24114,
                24154
            ],
            [
                24154,
                24211
            ],
            [
                24211,
                24255
            ],
            [
                24255,
                24369
            ],
            [
                24369,
                24458
            ],
            [
                24458,
                24569
            ],
            [
                24569,
                24691
            ],
            [
                24691,
                24835
            ],
            [
                24835,
                24887
            ],
            [
                24887,
                24990
            ],
            [
                24990,
                25223
            ],
            [
                25223,
                25234
            ],
            [
                25234,
                25309
            ],
            [
                25309,
                25339
            ],
            [
                25339,
                25384
            ],
            [
                25384,
                25431
            ],
            [
                25431,
                25481
            ],
            [
                25481,
                25515
            ],
            [
                25515,
                25657
            ],
            [
                25657,
                25670
            ],
            [
                25670,
                25687
            ],
            [
                25687,
                25856
            ],
            [
                25856,
                26045
            ],
            [
                26045,
                26099
            ],
            [
                26099,
                26164
            ],
            [
                26164,
                26193
            ],
            [
                26193,
                26208
            ],
            [
                26208,
                26253
            ],
            [
                26253,
                26287
            ],
            [
                26287,
                26321
            ],
            [
                26321,
                26334
            ],
            [
                26334,
                26388
            ],
            [
                26388,
                26469
            ],
            [
                26469,
                26545
            ],
            [
                26545,
                26794
            ],
            [
                26794,
                26873
            ]
        ]
    },
    "abridged": {
        "text": "Alice came down to breakfast on Christmas morning at Vavasor Hall to greet her grandfather, her father, and her cousin Kate. Kate remarked that she had received a letter from Aunt Greenow, and promised to show it to Alice after breakfast. But Alice said no word of her own letter.\n\"Why didn't your aunt come here for Christmas dinner?\" said the Squire.\n\"Perhaps, sir, because you didn't ask her,\" said Kate, standing close to the old man, who was somewhat deaf.\n\"And why didn't you ask her?\"\n\"I couldn't do that without your bidding, sir. We Vavasors are not always fond of meeting each other.\"\n\"Hold your tongue, Kate. Alice, my dear, come and sit next to me. I am much obliged to you for coming all this way to see your old grandfather at Christmas. I only wish you had brought better news about your sweetheart.\"\n\"She'll think better of it before long, sir,\" said her father.\n\"Papa, you shouldn't say that. You would not wish me to marry against my own judgement.\"\n\"I don't know much about ladies' judgements,\" said the old man. \"It does seem to me that when a lady makes a promise she ought to keep it.\"\n\"According to that,\" said Kate, \"if I were engaged to a man, and found that he was a murderer, I still ought to marry him.\"\n\"But Mr. Grey is not a murderer,\" said the Squire.\n\"Please don't talk about it,\" said Alice.\n\"I will say nothing more on the subject,\" said John Vavasor. Alice meanwhile sat with her cousin's letter in her pocket, and had not even begun to think how she should reply.\nThe Squire of Vavasor Hall was a stout old man, with a red face and fierce grey eyes; his long grey hair and beard gave him the appearance of an old lion. He was excitable, unreasoning, and impatient of all opposition; but he was also affectionate, ready to forgive, unselfish, and hospitable. He was guided strictly by what he believed to be rules of right.\nHis grandson George had offended him very deeply, and had never asked his pardon. He was determined that such pardon should never be given, unless it were asked for with bended knees; but, nevertheless, this grandson should be his heir. The Squire could not have rested quietly in his grave if he had left his estate to anyone but the eldest son of his eldest son. Though violent, he was more prone to love than anger; and he longed in his heart for some opportunity of being reconciled to George.\nThe whole party went to church on Christmas morning. The small parish church of Vavasor, an unpretending wooden building, stood all alone half a mile from the Squire's gate. Vavasor was a parish between the mountains of the lake district and the plains. Its land was unproductive, ill-drained, and poor, with little of the beauty which tourists go to see. It was very dreary. There were dark pines around part of it, and at the back of the house there was a thick wood of firs running up to the top of a hill. Through this there was a wild steep walk which came out upon the moorland, and from there a track led across the mountain to Hawes Water, and on over many miles to the beauties of Windermere. But it was a long walk; and you might walk for miles and miles in other directions without seeing anything but the stern, everlasting moorland.\nThe daily life at Vavasor was melancholy for John Vavasor, who regarded London as the only place where a man could live with comfort. The moors offered no charms to him; nor did the homely comforts of the old-fashioned Hall. But Alice could be very happy there with Kate; for both were good walkers and loved the mountains. Their regard for each other had grown as they had walked together over river and moor, disregarding the mud and wet which frighten so many girls away from the beauties of nature.\nOn this Christmas Day Alice accompanied the Squire to church in a vehicle which in Ireland is called a jaunting-car, and which is perhaps the most uncomfortable vehicle yet invented. John Vavasor walked with Kate. But the girls had arranged that immediately after church they would start for a walk across the fells towards Hawes Water. They would have four hours for their excursion before dinner at five. This had all been planned before Alice received her letter.\n\"Alice, my dear,\" said the old man to her in the jaunting-car after church, \"you ought to get married.\" The Squire was hard of hearing, and a jaunting-car is a bad place for conversation, as your teeth are nearly shaken out of your head by every movement of the horse.\n\"Well, sir, perhaps I shall some day.\"\n\"Not if you quarrel with all your suitors,\" said the old man. \"You'll never get married, my dear, if you go on in that way.\"\n\"Why should I be married more than Kate?\"\n\"I don't know that anybody wants to marry Kate. I wish you'd think about it. If you don't get married before long, perhaps you never will at all.\"\nOn returning home the two girls each took a slice of cake, and started on their walk.\n\"We shan't get to the lake,\" said Kate.\n\"No,\" said Alice; \"but we can go as far as the big stone on Swindale Fell, where we can sit down and see it.\"\n\"Do you remember the last time we sat there?\" said Kate. \"It was nearly three years ago, and it was then that you told me that all was over between you and George. Do you remember what a fool I was, and how I screamed in my sorrow? And then we got soaking wet coming home.\"\n\"I remember that very well.\"\n\"And how dark it was! If we go as far as Swindale we shall have it very dark coming home today; but I don't mind, because I know my way so well. You won't be afraid of half an hour's dark?\"\n\"Oh, no,\" said Alice.\n\"Well; it's all for the best, I suppose. And now I must read you my aunt's letter.\" Kate took out the letter and read it while they walked slowly up the hill. It seemed that neither of her two suitors had succeeded with the widow. Indeed, she wrote of Mr. Cheesacre as though he were inconsolable for the loss of Kate, and advised her to return to Norfolk so that she might secure him.\n\"You must understand, Alice,\" said Kate, pausing, \"that the dear man has never given me the slightest ground for hope, and that I know that he makes an offer to her twice a week - on every market day.\" Then she went on reading. Poor Bellfield was working very hard at his drill, Mrs. Greenow wrote; sometimes she really thought the fatigue would be too much for his strength. He would sometimes come and just take a cup of tea - generally on Mondays and Thursdays. \"These are not market days,\" said Kate; \"and thus unpleasant meetings are avoided. I have not the slightest doubt that he also offers for her twice a week.\"\n\"And will she accept him at last?\"\n\"Really, I don't know. Sometimes I fancy that she likes the fun of the thing, but that she is too wide-awake to put herself in any man's power. I have no doubt she lends him money, because she is very generous.\"\nThe letter went on to say that her aunt had decided to remain at Norwich through the winter and spring, and that she hoped dear Kate would go back to her. \"Come and have another look at Oileymead,\" said the letter, \"and then, if you don't like it or him, I won't ask you to think of them ever again. I believe him to be a very honest fellow.\"\n\"Did you ever know such a woman?\" said Kate. Then Aunt Greenow's letter was put away, and the two girls had come to the open fell.\nIt was a delicious afternoon for a winter's walk. The air was clear and cold, but not frosty. The ground was dry, and the sky gave no sign of rain. There is a special winter's light which is very clear, but melancholy; it tells of the shortness of the day and the coming of the early twilight. It is never seen so plainly as on the wide moorland, where the eye stretches away over miles to the faint low lines of distant clouds settling themselves upon the horizon.\nSuch was the light of this Christmas afternoon, and both the girls had felt the effects of it before they reached the big stone on Swindale Fell. At first they had discussed almost with mirth the merits of Oileymead and Mr. Cheesacre; but as they got further on to the fell, the half-melancholy wildness of the place struck them, and they ceased to speak.\nAlice had still her letter in her pocket. She had come to no decision yet as to her answer; nor had she decided whether to show it to Kate. She regarded Kate as her steadfast friend, and suspected no treason by her. She had often quarrelled with Kate; but not because she did not trust her. Why should she not show this letter to Kate, and discuss it before she replied to it? This was in her mind as she walked silently along over the fell.\nThe reader will surmise from this that she was already half inclined to give way, and to accept her cousin George. Alas, yes! The reader will be right.\nAnd yet it was not her love for him that prompted her to run so terrible a risk. That would have been easier to forgive. She was beginning to think that the love of which she had once thought so much did not matter. Of what use was it, and to what had it led? What had love done for her friend Glencora? What had love done for her? Had she not loved John Grey, and had she not felt that life with him would have been distasteful to her? She could not marry a man whom she disliked, but she liked her cousin George well enough, as she said to herself almost indifferently.\nIt was a grievous task to her these days - this having to do something with her life. Was it not all futile? As for her earlier dream of the joys of love - that had gone, never to return. How she could make herself useful in some way that might gratify her ambition; that was now the question which seemed most important.\nHer cousin's letter to her had been very crafty. He had considered her character, and had written it with care. Whether he cared to marry his cousin was a point of so little interest to him that he left it to chance; but once chance had decided that he did wish it, it was necessary for his honour that he should get what he wanted.\n\"At any rate he does me justice,\" Alice said to herself, when she read his words about her money. \"He is welcome to it all if it will help him in his career, whether as my friend or as my husband.\" And would it not be well that she should be the means of reconciling George to his grandfather? George was the heir of a family so old that it went back to the Saxons. Alice thought much about this, and felt that it should be her duty to help George attain honour in his position.\nThey walked on, exchanging a word or two, till the distant Cumberland mountains began to appear.\n\"There's Helvellyn at last,\" said Kate. \"I'm always happy when I see that. That's Scaw Fell on the left; the round distant top.\"\nSoon they were at the top of the bank; and then the beauty of the little lake of Haweswater lying down below them disclosed itself. A lake should, I think, be seen from above, to be seen in all its glory. The water beneath them was still as death, and as dark. But the slow clouds were passing over it, and the shades of darkness on its surface changed, as now a then a slight sheen was laid upon it by the breeze.\n\"I'm so glad I've come here,\" said Alice, seating herself. \"I cannot bear the idea of coming to Vavasor without seeing one of the lakes at least.\"\n\"We'll get over to Windermere one day,\" said Kate.\n\"I don't think so. I don't think I can stay long. Kate, I've got a letter to show you.\" And the tone of her voice instantly put Kate upon her mettle.\n\"Is it from Mr. Grey?\" she asked.\n\"No,\" said Alice. She gave her companion the paper, and Kate saw it was from her brother. As she opened it looked anxiously at Alice.\n\"Has he offended you?\" she asked.\n\"Read it,\" said Alice, \"and then we'll talk of it as we go home.\" Then she got up and stood looking down upon the lake while Kate read.\n\"Well,\" said Kate at last. \"Alice, oh, Alice, may I hope? My own Alice, my darling! Say that it shall be so.\" And Kate knelt at her friend's feet upon the heather, and looked up at her with eyes full of tears. What shall we say of a woman who could be as false as she had been, and yet could be so true?\nAlice made no answer, but continued to gaze down upon the lake.\n\"Alice,\" continued Kate, \"I did not think I should be made so happy this Christmas Day. You could not have the heart to bring me here and show me this letter, and then tell me that it is all for nothing. Alice, I am so happy. I will so love this place.\"\nAlice said nothing, but she began to feel that she had gone further than she had intended. It was almost impossible for her now to say that she must refuse George.\nKate went on. \"Is it not a beautiful letter? I do feel proud of him. I know that he is a man with a manly heart, who will do manly things. Do you love him?\"\n\"Love him!\" said Alice.\n\"Yes. Is not your heart his?.\"\n\"I have always loved my cousin. Kate; but not so passionately as you seem to think.\"\n\"Then there can be no passion in you.\"\n\"Perhaps not, Kate. I sometimes hope that it is so. But come; we shall be late; and you will get cold sitting there.\"\n\"I would sit here all night to be sure that your answer would a yes. But, Alice, tell me what your answer is to be. I know you will not refuse him; but make me happy by saying so.\"\n\"I cannot tell you, Kate. I have not yet decided.\"\n\"Ah, that is impossible. On such a subject a woman must decide at the first moment. You had resolved, I know, before you had half read the letter.\"\n\"You are quite mistaken. Let us walk, and I will tell you all.\" They turned their backs to the lake, and began to make their way homewards. \"I have shown you his letter so that I might have someone with whom I could speak openly. I knew how it would be, and that you would try to hurry me into an immediate promise.\"\n\"No, Alice, I will not hurry you. I will do nothing that you do not wish. But you cannot be surprised that I should be very eager. Has it not been the longing of my life? Have I not passed my time planning and thinking of it? Do you know what I suffered when the engagement was broken off? And, now, can you be surprised that I am wild with joy? - for it will be as I wish, Alice. You would have decided to refuse him instantly had that been your destiny.\"\nThere was little more said until they were going down the path through the Beacon Wood. Then Kate again spoke:\n\"You will not answer him without speaking to me first?\"\n\"I will, at any rate, not send my answer without telling you,\" said Alice.\n\"And you will let me see it?\"\n\"No,\" said Alice. \"But if it is unfavourable I will show it you.\"\n\"Then I shall never see it,\" said Kate, laughing. \"That is enough for me. I know how sweet your words of forgiveness will be. Oh, heavens! how I envy him!\"\nThen they were at home; and the old man met them at the front door, glowering angrily, because the roast beef was ready. He had his great uncouth silver watch in his hand, which was always a quarter of an hour too fast, and he pointed at it fiercely.\n\"But, grandpapa, you are always too fast,\" said Kate.\n\"And you are always too slow, miss,\" said the hungry old squire.\n\"It is not five yet.\" And the two girls hurried to their rooms to change.\nNothing more was said that evening about the letter; but Kate, as she wished her cousin good night, said, \"Pray for him tonight, as you pray for those you love best.\"\nAlice made no answer, but we may believe she did as Kate desired.",
        "paragraph_chars": [
            [
                0,
                281
            ],
            [
                281,
                353
            ],
            [
                353,
                462
            ],
            [
                462,
                492
            ],
            [
                492,
                595
            ],
            [
                595,
                816
            ],
            [
                816,
                879
            ],
            [
                879,
                968
            ],
            [
                968,
                1108
            ],
            [
                1108,
                1232
            ],
            [
                1232,
                1283
            ],
            [
                1283,
                1325
            ],
            [
                1325,
                1500
            ],
            [
                1500,
                1859
            ],
            [
                1859,
                2357
            ],
            [
                2357,
                3203
            ],
            [
                3203,
                3706
            ],
            [
                3706,
                4173
            ],
            [
                4173,
                4442
            ],
            [
                4442,
                4481
            ],
            [
                4481,
                4606
            ],
            [
                4606,
                4648
            ],
            [
                4648,
                4795
            ],
            [
                4795,
                4881
            ],
            [
                4881,
                4921
            ],
            [
                4921,
                5031
            ],
            [
                5031,
                5305
            ],
            [
                5305,
                5334
            ],
            [
                5334,
                5524
            ],
            [
                5524,
                5546
            ],
            [
                5546,
                5932
            ],
            [
                5932,
                6554
            ],
            [
                6554,
                6589
            ],
            [
                6589,
                6801
            ],
            [
                6801,
                7144
            ],
            [
                7144,
                7275
            ],
            [
                7275,
                7741
            ],
            [
                7741,
                8097
            ],
            [
                8097,
                8539
            ],
            [
                8539,
                8691
            ],
            [
                8691,
                9263
            ],
            [
                9263,
                9585
            ],
            [
                9585,
                9918
            ],
            [
                9918,
                10397
            ],
            [
                10397,
                10494
            ],
            [
                10494,
                10623
            ],
            [
                10623,
                11038
            ],
            [
                11038,
                11185
            ],
            [
                11185,
                11236
            ],
            [
                11236,
                11386
            ],
            [
                11386,
                11420
            ],
            [
                11420,
                11554
            ],
            [
                11554,
                11588
            ],
            [
                11588,
                11724
            ],
            [
                11724,
                12028
            ],
            [
                12028,
                12092
            ],
            [
                12092,
                12346
            ],
            [
                12346,
                12510
            ],
            [
                12510,
                12667
            ],
            [
                12667,
                12691
            ],
            [
                12691,
                12722
            ],
            [
                12722,
                12807
            ],
            [
                12807,
                12846
            ],
            [
                12846,
                12964
            ],
            [
                12964,
                13145
            ],
            [
                13145,
                13196
            ],
            [
                13196,
                13344
            ],
            [
                13344,
                13661
            ],
            [
                13661,
                14118
            ],
            [
                14118,
                14229
            ],
            [
                14229,
                14285
            ],
            [
                14285,
                14360
            ],
            [
                14360,
                14390
            ],
            [
                14390,
                14456
            ],
            [
                14456,
                14612
            ],
            [
                14612,
                14863
            ],
            [
                14863,
                14917
            ],
            [
                14917,
                14982
            ],
            [
                14982,
                15056
            ],
            [
                15056,
                15223
            ],
            [
                15223,
                15288
            ]
        ],
        "segment_chars": [
            [
                0,
                125
            ],
            [
                125,
                239
            ],
            [
                239,
                281
            ],
            [
                281,
                336
            ],
            [
                336,
                353
            ],
            [
                353,
                462
            ],
            [
                462,
                492
            ],
            [
                492,
                539
            ],
            [
                539,
                595
            ],
            [
                595,
                620
            ],
            [
                620,
                661
            ],
            [
                661,
                752
            ],
            [
                752,
                816
            ],
            [
                816,
                879
            ],
            [
                879,
                910
            ],
            [
                910,
                968
            ],
            [
                968,
                1032
            ],
            [
                1032,
                1108
            ],
            [
                1108,
                1232
            ],
            [
                1232,
                1283
            ],
            [
                1283,
                1325
            ],
            [
                1325,
                1386
            ],
            [
                1386,
                1500
            ],
            [
                1500,
                1655
            ],
            [
                1655,
                1794
            ],
            [
                1794,
                1859
            ],
            [
                1859,
                1941
            ],
            [
                1941,
                2096
            ],
            [
                2096,
                2224
            ],
            [
                2224,
                2357
            ],
            [
                2357,
                2410
            ],
            [
                2410,
                2531
            ],
            [
                2531,
                2611
            ],
            [
                2611,
                2713
            ],
            [
                2713,
                2733
            ],
            [
                2733,
                2867
            ],
            [
                2867,
                3059
            ],
            [
                3059,
                3203
            ],
            [
                3203,
                3337
            ],
            [
                3337,
                3428
            ],
            [
                3428,
                3527
            ],
            [
                3527,
                3706
            ],
            [
                3706,
                3889
            ],
            [
                3889,
                3920
            ],
            [
                3920,
                4043
            ],
            [
                4043,
                4113
            ],
            [
                4113,
                4173
            ],
            [
                4173,
                4277
            ],
            [
                4277,
                4442
            ],
            [
                4442,
                4481
            ],
            [
                4481,
                4543
            ],
            [
                4543,
                4606
            ],
            [
                4606,
                4648
            ],
            [
                4648,
                4696
            ],
            [
                4696,
                4725
            ],
            [
                4725,
                4795
            ],
            [
                4795,
                4881
            ],
            [
                4881,
                4921
            ],
            [
                4921,
                5031
            ],
            [
                5031,
                5077
            ],
            [
                5077,
                5088
            ],
            [
                5088,
                5195
            ],
            [
                5195,
                5263
            ],
            [
                5263,
                5305
            ],
            [
                5305,
                5334
            ],
            [
                5334,
                5356
            ],
            [
                5356,
                5479
            ],
            [
                5479,
                5524
            ],
            [
                5524,
                5546
            ],
            [
                5546,
                5587
            ],
            [
                5587,
                5630
            ],
            [
                5630,
                5705
            ],
            [
                5705,
                5777
            ],
            [
                5777,
                5932
            ],
            [
                5932,
                6134
            ],
            [
                6134,
                6160
            ],
            [
                6160,
                6308
            ],
            [
                6308,
                6397
            ],
            [
                6397,
                6480
            ],
            [
                6480,
                6554
            ],
            [
                6554,
                6589
            ],
            [
                6589,
                6612
            ],
            [
                6612,
                6733
            ],
            [
                6733,
                6801
            ],
            [
                6801,
                6956
            ],
            [
                6956,
                7101
            ],
            [
                7101,
                7144
            ],
            [
                7144,
                7178
            ],
            [
                7178,
                7189
            ],
            [
                7189,
                7275
            ],
            [
                7275,
                7325
            ],
            [
                7325,
                7369
            ],
            [
                7369,
                7423
            ],
            [
                7423,
                7569
            ],
            [
                7569,
                7741
            ],
            [
                7741,
                7887
            ],
            [
                7887,
                8097
            ],
            [
                8097,
                8139
            ],
            [
                8139,
                8237
            ],
            [
                8237,
                8313
            ],
            [
                8313,
                8388
            ],
            [
                8388,
                8474
            ],
            [
                8474,
                8539
            ],
            [
                8539,
                8654
            ],
            [
                8654,
                8665
            ],
            [
                8665,
                8691
            ],
            [
                8691,
                8772
            ],
            [
                8772,
                8812
            ],
            [
                8812,
                8907
            ],
            [
                8907,
                8951
            ],
            [
                8951,
                8995
            ],
            [
                8995,
                9023
            ],
            [
                9023,
                9128
            ],
            [
                9128,
                9263
            ],
            [
                9263,
                9349
            ],
            [
                9349,
                9372
            ],
            [
                9372,
                9451
            ],
            [
                9451,
                9585
            ],
            [
                9585,
                9634
            ],
            [
                9634,
                9697
            ],
            [
                9697,
                9918
            ],
            [
                9918,
                10016
            ],
            [
                10016,
                10116
            ],
            [
                10116,
                10212
            ],
            [
                10212,
                10284
            ],
            [
                10284,
                10397
            ],
            [
                10397,
                10494
            ],
            [
                10494,
                10534
            ],
            [
                10534,
                10569
            ],
            [
                10569,
                10623
            ],
            [
                10623,
                10755
            ],
            [
                10755,
                10828
            ],
            [
                10828,
                10884
            ],
            [
                10884,
                11038
            ],
            [
                11038,
                11097
            ],
            [
                11097,
                11185
            ],
            [
                11185,
                11236
            ],
            [
                11236,
                11255
            ],
            [
                11255,
                11286
            ],
            [
                11286,
                11324
            ],
            [
                11324,
                11386
            ],
            [
                11386,
                11409
            ],
            [
                11409,
                11420
            ],
            [
                11420,
                11438
            ],
            [
                11438,
                11510
            ],
            [
                11510,
                11554
            ],
            [
                11554,
                11577
            ],
            [
                11577,
                11588
            ],
            [
                11588,
                11654
            ],
            [
                11654,
                11724
            ],
            [
                11724,
                11751
            ],
            [
                11751,
                11782
            ],
            [
                11782,
                11808
            ],
            [
                11808,
                11834
            ],
            [
                11834,
                11934
            ],
            [
                11934,
                12028
            ],
            [
                12028,
                12092
            ],
            [
                12092,
                12180
            ],
            [
                12180,
                12296
            ],
            [
                12296,
                12318
            ],
            [
                12318,
                12346
            ],
            [
                12346,
                12437
            ],
            [
                12437,
                12510
            ],
            [
                12510,
                12524
            ],
            [
                12524,
                12555
            ],
            [
                12555,
                12579
            ],
            [
                12579,
                12649
            ],
            [
                12649,
                12667
            ],
            [
                12667,
                12679
            ],
            [
                12679,
                12691
            ],
            [
                12691,
                12697
            ],
            [
                12697,
                12722
            ],
            [
                12722,
                12754
            ],
            [
                12754,
                12807
            ],
            [
                12807,
                12846
            ],
            [
                12846,
                12866
            ],
            [
                12866,
                12898
            ],
            [
                12898,
                12964
            ],
            [
                12964,
                13033
            ],
            [
                13033,
                13080
            ],
            [
                13080,
                13145
            ],
            [
                13145,
                13171
            ],
            [
                13171,
                13196
            ],
            [
                13196,
                13221
            ],
            [
                13221,
                13280
            ],
            [
                13280,
                13344
            ],
            [
                13344,
                13369
            ],
            [
                13369,
                13408
            ],
            [
                13408,
                13484
            ],
            [
                13484,
                13574
            ],
            [
                13574,
                13661
            ],
            [
                13661,
                13695
            ],
            [
                13695,
                13735
            ],
            [
                13735,
                13792
            ],
            [
                13792,
                13832
            ],
            [
                13832,
                13887
            ],
            [
                13887,
                13951
            ],
            [
                13951,
                14007
            ],
            [
                14007,
                14042
            ],
            [
                14042,
                14118
            ],
            [
                14118,
                14206
            ],
            [
                14206,
                14229
            ],
            [
                14229,
                14285
            ],
            [
                14285,
                14360
            ],
            [
                14360,
                14390
            ],
            [
                14390,
                14408
            ],
            [
                14408,
                14456
            ],
            [
                14456,
                14506
            ],
            [
                14506,
                14530
            ],
            [
                14530,
                14582
            ],
            [
                14582,
                14595
            ],
            [
                14595,
                14612
            ],
            [
                14612,
                14733
            ],
            [
                14733,
                14863
            ],
            [
                14863,
                14917
            ],
            [
                14917,
                14982
            ],
            [
                14982,
                15004
            ],
            [
                15004,
                15056
            ],
            [
                15056,
                15223
            ],
            [
                15223,
                15288
            ]
        ],
        "overlap_chars": [
            [
                0,
                31
            ],
            [
                32,
                65
            ],
            [
                66,
                68
            ],
            [
                75,
                103
            ],
            [
                104,
                107
            ],
            [
                108,
                123
            ],
            [
                123,
                125
            ],
            [
                125,
                151
            ],
            [
                163,
                169
            ],
            [
                170,
                209
            ],
            [
                216,
                221
            ],
            [
                222,
                239
            ],
            [
                239,
                281
            ],
            [
                281,
                312
            ],
            [
                317,
                336
            ],
            [
                336,
                353
            ],
            [
                353,
                425
            ],
            [
                426,
                437
            ],
            [
                437,
                438
            ],
            [
                443,
                462
            ],
            [
                462,
                489
            ],
            [
                489,
                492
            ],
            [
                492,
                493
            ],
            [
                493,
                532
            ],
            [
                532,
                537
            ],
            [
                537,
                539
            ],
            [
                539,
                595
            ],
            [
                595,
                620
            ],
            [
                620,
                661
            ],
            [
                661,
                696
            ],
            [
                697,
                752
            ],
            [
                752,
                816
            ],
            [
                816,
                879
            ],
            [
                879,
                910
            ],
            [
                910,
                968
            ],
            [
                968,
                1032
            ],
            [
                1032,
                1108
            ],
            [
                1108,
                1232
            ],
            [
                1232,
                1283
            ],
            [
                1283,
                1284
            ],
            [
                1291,
                1324
            ],
            [
                1325,
                1327
            ],
            [
                1350,
                1384
            ],
            [
                1384,
                1386
            ],
            [
                1386,
                1391
            ],
            [
                1402,
                1449
            ],
            [
                1450,
                1477
            ],
            [
                1486,
                1492
            ],
            [
                1493,
                1500
            ],
            [
                1500,
                1567
            ],
            [
                1575,
                1584
            ],
            [
                1590,
                1604
            ],
            [
                1605,
                1608
            ],
            [
                1609,
                1614
            ],
            [
                1615,
                1623
            ],
            [
                1624,
                1655
            ],
            [
                1655,
                1661
            ],
            [
                1671,
                1689
            ],
            [
                1690,
                1729
            ],
            [
                1735,
                1748
            ],
            [
                1755,
                1765
            ],
            [
                1765,
                1794
            ],
            [
                1794,
                1800
            ],
            [
                1801,
                1819
            ],
            [
                1825,
                1858
            ],
            [
                1859,
                1908
            ],
            [
                1909,
                1912
            ],
            [
                1913,
                1916
            ],
            [
                1917,
                1941
            ],
            [
                1941,
                2028
            ],
            [
                2029,
                2096
            ],
            [
                2096,
                2112
            ],
            [
                2113,
                2121
            ],
            [
                2129,
                2149
            ],
            [
                2153,
                2164
            ],
            [
                2176,
                2178
            ],
            [
                2186,
                2211
            ],
            [
                2212,
                2224
            ],
            [
                2224,
                2238
            ],
            [
                2238,
                2270
            ],
            [
                2271,
                2281
            ],
            [
                2282,
                2348
            ],
            [
                2355,
                2357
            ],
            [
                2357,
                2390
            ],
            [
                2391,
                2410
            ],
            [
                2410,
                2468
            ],
            [
                2477,
                2494
            ],
            [
                2495,
                2531
            ],
            [
                2531,
                2551
            ],
            [
                2552,
                2585
            ],
            [
                2595,
                2611
            ],
            [
                2611,
                2660
            ],
            [
                2666,
                2672
            ],
            [
                2673,
                2713
            ],
            [
                2713,
                2719
            ],
            [
                2720,
                2733
            ],
            [
                2733,
                2743
            ],
            [
                2744,
                2761
            ],
            [
                2767,
                2769
            ],
            [
                2772,
                2858
            ],
            [
                2859,
                2860
            ],
            [
                2861,
                2867
            ],
            [
                2867,
                2950
            ],
            [
                2951,
                2956
            ],
            [
                2957,
                2964
            ],
            [
                2969,
                3003
            ],
            [
                3003,
                3034
            ],
            [
                3035,
                3046
            ],
            [
                3047,
                3059
            ],
            [
                3059,
                3062
            ],
            [
                3063,
                3065
            ],
            [
                3070,
                3071
            ],
            [
                3081,
                3082
            ],
            [
                3083,
                3086
            ],
            [
                3087,
                3121
            ],
            [
                3142,
                3149
            ],
            [
                3170,
                3179
            ],
            [
                3179,
                3180
            ],
            [
                3181,
                3203
            ],
            [
                3203,
                3243
            ],
            [
                3244,
                3247
            ],
            [
                3256,
                3258
            ],
            [
                3260,
                3299
            ],
            [
                3306,
                3337
            ],
            [
                3337,
                3371
            ],
            [
                3371,
                3372
            ],
            [
                3373,
                3380
            ],
            [
                3381,
                3407
            ],
            [
                3408,
                3421
            ],
            [
                3422,
                3426
            ],
            [
                3426,
                3428
            ],
            [
                3428,
                3431
            ],
            [
                3432,
                3437
            ],
            [
                3438,
                3478
            ],
            [
                3489,
                3498
            ],
            [
                3502,
                3527
            ],
            [
                3527,
                3564
            ],
            [
                3568,
                3576
            ],
            [
                3584,
                3592
            ],
            [
                3598,
                3613
            ],
            [
                3614,
                3620
            ],
            [
                3631,
                3706
            ],
            [
                3706,
                3727
            ],
            [
                3728,
                3733
            ],
            [
                3734,
                3745
            ],
            [
                3746,
                3756
            ],
            [
                3757,
                3766
            ],
            [
                3767,
                3806
            ],
            [
                3809,
                3866
            ],
            [
                3867,
                3887
            ],
            [
                3889,
                3913
            ],
            [
                3918,
                3920
            ],
            [
                3920,
                4004
            ],
            [
                4005,
                4021
            ],
            [
                4022,
                4043
            ],
            [
                4043,
                4047
            ],
            [
                4048,
                4053
            ],
            [
                4054,
                4058
            ],
            [
                4059,
                4089
            ],
            [
                4104,
                4106
            ],
            [
                4107,
                4111
            ],
            [
                4111,
                4113
            ],
            [
                4113,
                4171
            ],
            [
                4171,
                4173
            ],
            [
                4173,
                4214
            ],
            [
                4215,
                4234
            ],
            [
                4247,
                4277
            ],
            [
                4277,
                4312
            ],
            [
                4315,
                4427
            ],
            [
                4431,
                4440
            ],
            [
                4440,
                4441
            ],
            [
                4442,
                4481
            ],
            [
                4481,
                4543
            ],
            [
                4544,
                4606
            ],
            [
                4606,
                4648
            ],
            [
                4649,
                4696
            ],
            [
                4696,
                4714
            ],
            [
                4723,
                4725
            ],
            [
                4725,
                4774
            ],
            [
                4775,
                4780
            ],
            [
                4786,
                4792
            ],
            [
                4813,
                4826
            ],
            [
                4827,
                4831
            ],
            [
                4832,
                4852
            ],
            [
                4852,
                4880
            ],
            [
                4881,
                4891
            ],
            [
                4892,
                4921
            ],
            [
                4921,
                5031
            ],
            [
                5031,
                5077
            ],
            [
                5077,
                5088
            ],
            [
                5088,
                5091
            ],
            [
                5096,
                5165
            ],
            [
                5166,
                5195
            ],
            [
                5195,
                5263
            ],
            [
                5263,
                5290
            ],
            [
                5291,
                5305
            ],
            [
                5305,
                5334
            ],
            [
                5334,
                5356
            ],
            [
                5356,
                5422
            ],
            [
                5428,
                5429
            ],
            [
                5430,
                5446
            ],
            [
                5446,
                5479
            ],
            [
                5479,
                5524
            ],
            [
                5524,
                5546
            ],
            [
                5547,
                5587
            ],
            [
                5587,
                5630
            ],
            [
                5630,
                5654
            ],
            [
                5655,
                5666
            ],
            [
                5667,
                5677
            ],
            [
                5678,
                5705
            ],
            [
                5705,
                5719
            ],
            [
                5720,
                5750
            ],
            [
                5766,
                5775
            ],
            [
                5775,
                5777
            ],
            [
                5777,
                5788
            ],
            [
                5795,
                5821
            ],
            [
                5825,
                5868
            ],
            [
                5877,
                5880
            ],
            [
                5881,
                5883
            ],
            [
                5891,
                5901
            ],
            [
                5902,
                5904
            ],
            [
                5905,
                5926
            ],
            [
                5930,
                5931
            ],
            [
                5932,
                5952
            ],
            [
                5952,
                5980
            ],
            [
                5980,
                6044
            ],
            [
                6045,
                6066
            ],
            [
                6067,
                6109
            ],
            [
                6112,
                6131
            ],
            [
                6134,
                6138
            ],
            [
                6139,
                6142
            ],
            [
                6143,
                6150
            ],
            [
                6151,
                6160
            ],
            [
                6160,
                6223
            ],
            [
                6229,
                6230
            ],
            [
                6231,
                6308
            ],
            [
                6308,
                6316
            ],
            [
                6317,
                6326
            ],
            [
                6327,
                6331
            ],
            [
                6332,
                6358
            ],
            [
                6371,
                6397
            ],
            [
                6397,
                6423
            ],
            [
                6423,
                6478
            ],
            [
                6480,
                6494
            ],
            [
                6505,
                6510
            ],
            [
                6511,
                6518
            ],
            [
                6519,
                6523
            ],
            [
                6539,
                6551
            ],
            [
                6551,
                6554
            ],
            [
                6554,
                6589
            ],
            [
                6589,
                6596
            ],
            [
                6598,
                6610
            ],
            [
                6610,
                6612
            ],
            [
                6612,
                6733
            ],
            [
                6733,
                6777
            ],
            [
                6778,
                6798
            ],
            [
                6801,
                6811
            ],
            [
                6812,
                6831
            ],
            [
                6832,
                6835
            ],
            [
                6841,
                6844
            ],
            [
                6853,
                6873
            ],
            [
                6874,
                6917
            ],
            [
                6924,
                6933
            ],
            [
                6940,
                6956
            ],
            [
                6956,
                6970
            ],
            [
                6979,
                7029
            ],
            [
                7030,
                7101
            ],
            [
                7101,
                7143
            ],
            [
                7144,
                7178
            ],
            [
                7178,
                7187
            ],
            [
                7187,
                7189
            ],
            [
                7189,
                7223
            ],
            [
                7228,
                7256
            ],
            [
                7260,
                7275
            ],
            [
                7275,
                7325
            ],
            [
                7325,
                7360
            ],
            [
                7361,
                7369
            ],
            [
                7369,
                7379
            ],
            [
                7380,
                7400
            ],
            [
                7406,
                7408
            ],
            [
                7414,
                7423
            ],
            [
                7423,
                7456
            ],
            [
                7457,
                7476
            ],
            [
                7476,
                7477
            ],
            [
                7478,
                7481
            ],
            [
                7482,
                7492
            ],
            [
                7494,
                7530
            ],
            [
                7531,
                7534
            ],
            [
                7535,
                7538
            ],
            [
                7539,
                7568
            ],
            [
                7569,
                7574
            ],
            [
                7581,
                7585
            ],
            [
                7586,
                7661
            ],
            [
                7662,
                7664
            ],
            [
                7665,
                7740
            ],
            [
                7741,
                7885
            ],
            [
                7885,
                7887
            ],
            [
                7896,
                8015
            ],
            [
                8016,
                8070
            ],
            [
                8071,
                8074
            ],
            [
                8075,
                8079
            ],
            [
                8080,
                8097
            ],
            [
                8097,
                8139
            ],
            [
                8139,
                8157
            ],
            [
                8167,
                8187
            ],
            [
                8189,
                8200
            ],
            [
                8209,
                8216
            ],
            [
                8217,
                8219
            ],
            [
                8220,
                8237
            ],
            [
                8237,
                8240
            ],
            [
                8241,
                8249
            ],
            [
                8250,
                8254
            ],
            [
                8255,
                8278
            ],
            [
                8278,
                8279
            ],
            [
                8284,
                8296
            ],
            [
                8297,
                8304
            ],
            [
                8305,
                8311
            ],
            [
                8311,
                8313
            ],
            [
                8313,
                8352
            ],
            [
                8353,
                8356
            ],
            [
                8365,
                8368
            ],
            [
                8383,
                8386
            ],
            [
                8386,
                8388
            ],
            [
                8388,
                8447
            ],
            [
                8448,
                8474
            ],
            [
                8474,
                8539
            ],
            [
                8539,
                8627
            ],
            [
                8635,
                8654
            ],
            [
                8654,
                8665
            ],
            [
                8665,
                8689
            ],
            [
                8689,
                8690
            ],
            [
                8691,
                8722
            ],
            [
                8727,
                8772
            ],
            [
                8772,
                8776
            ],
            [
                8777,
                8782
            ],
            [
                8788,
                8792
            ],
            [
                8793,
                8810
            ],
            [
                8810,
                8812
            ],
            [
                8812,
                8843
            ],
            [
                8844,
                8890
            ],
            [
                8891,
                8907
            ],
            [
                8907,
                8951
            ],
            [
                8951,
                8995
            ],
            [
                8995,
                9023
            ],
            [
                9023,
                9077
            ],
            [
                9078,
                9128
            ],
            [
                9142,
                9158
            ],
            [
                9159,
                9171
            ],
            [
                9171,
                9172
            ],
            [
                9173,
                9204
            ],
            [
                9205,
                9263
            ],
            [
                9263,
                9292
            ],
            [
                9293,
                9303
            ],
            [
                9306,
                9349
            ],
            [
                9349,
                9363
            ],
            [
                9364,
                9372
            ],
            [
                9372,
                9378
            ],
            [
                9379,
                9382
            ],
            [
                9391,
                9416
            ],
            [
                9419,
                9432
            ],
            [
                9432,
                9451
            ],
            [
                9451,
                9454
            ],
            [
                9455,
                9458
            ],
            [
                9465,
                9484
            ],
            [
                9485,
                9492
            ],
            [
                9497,
                9529
            ],
            [
                9530,
                9568
            ],
            [
                9569,
                9573
            ],
            [
                9583,
                9585
            ],
            [
                9585,
                9634
            ],
            [
                9634,
                9640
            ],
            [
                9652,
                9665
            ],
            [
                9671,
                9690
            ],
            [
                9691,
                9695
            ],
            [
                9695,
                9697
            ],
            [
                9697,
                9704
            ],
            [
                9705,
                9745
            ],
            [
                9749,
                9758
            ],
            [
                9768,
                9779
            ],
            [
                9780,
                9782
            ],
            [
                9788,
                9790
            ],
            [
                9791,
                9793
            ],
            [
                9794,
                9800
            ],
            [
                9800,
                9805
            ],
            [
                9811,
                9897
            ],
            [
                9916,
                9918
            ],
            [
                9918,
                9951
            ],
            [
                9958,
                9988
            ],
            [
                9993,
                10014
            ],
            [
                10014,
                10016
            ],
            [
                10016,
                10083
            ],
            [
                10084,
                10116
            ],
            [
                10116,
                10212
            ],
            [
                10212,
                10226
            ],
            [
                10232,
                10255
            ],
            [
                10272,
                10275
            ],
            [
                10282,
                10284
            ],
            [
                10284,
                10302
            ],
            [
                10313,
                10350
            ],
            [
                10351,
                10353
            ],
            [
                10354,
                10358
            ],
            [
                10359,
                10365
            ],
            [
                10373,
                10379
            ],
            [
                10380,
                10382
            ],
            [
                10387,
                10395
            ],
            [
                10395,
                10396
            ],
            [
                10397,
                10423
            ],
            [
                10424,
                10485
            ],
            [
                10492,
                10493
            ],
            [
                10494,
                10534
            ],
            [
                10534,
                10567
            ],
            [
                10569,
                10598
            ],
            [
                10599,
                10620
            ],
            [
                10623,
                10627
            ],
            [
                10628,
                10637
            ],
            [
                10638,
                10644
            ],
            [
                10645,
                10655
            ],
            [
                10656,
                10660
            ],
            [
                10660,
                10670
            ],
            [
                10671,
                10700
            ],
            [
                10701,
                10703
            ],
            [
                10715,
                10736
            ],
            [
                10737,
                10755
            ],
            [
                10755,
                10778
            ],
            [
                10779,
                10828
            ],
            [
                10828,
                10845
            ],
            [
                10851,
                10882
            ],
            [
                10882,
                10884
            ],
            [
                10884,
                10975
            ],
            [
                10975,
                10976
            ],
            [
                10991,
                11005
            ],
            [
                11006,
                11009
            ],
            [
                11015,
                11019
            ],
            [
                11023,
                11038
            ],
            [
                11038,
                11097
            ],
            [
                11097,
                11185
            ],
            [
                11185,
                11236
            ],
            [
                11236,
                11250
            ],
            [
                11253,
                11255
            ],
            [
                11255,
                11268
            ],
            [
                11269,
                11270
            ],
            [
                11275,
                11286
            ],
            [
                11286,
                11324
            ],
            [
                11324,
                11327
            ],
            [
                11328,
                11349
            ],
            [
                11350,
                11386
            ],
            [
                11386,
                11409
            ],
            [
                11409,
                11420
            ],
            [
                11420,
                11436
            ],
            [
                11436,
                11437
            ],
            [
                11438,
                11470
            ],
            [
                11472,
                11475
            ],
            [
                11476,
                11480
            ],
            [
                11485,
                11508
            ],
            [
                11508,
                11509
            ],
            [
                11510,
                11543
            ],
            [
                11547,
                11552
            ],
            [
                11552,
                11553
            ],
            [
                11554,
                11577
            ],
            [
                11581,
                11588
            ],
            [
                11588,
                11637
            ],
            [
                11638,
                11654
            ],
            [
                11654,
                11669
            ],
            [
                11670,
                11679
            ],
            [
                11680,
                11706
            ],
            [
                11707,
                11722
            ],
            [
                11722,
                11723
            ],
            [
                11724,
                11741
            ],
            [
                11749,
                11751
            ],
            [
                11759,
                11782
            ],
            [
                11782,
                11806
            ],
            [
                11806,
                11808
            ],
            [
                11808,
                11834
            ],
            [
                11834,
                11901
            ],
            [
                11905,
                11908
            ],
            [
                11909,
                11934
            ],
            [
                11934,
                12028
            ],
            [
                12028,
                12041
            ],
            [
                12042,
                12053
            ],
            [
                12054,
                12076
            ],
            [
                12077,
                12091
            ],
            [
                12092,
                12180
            ],
            [
                12180,
                12249
            ],
            [
                12249,
                12296
            ],
            [
                12296,
                12318
            ],
            [
                12318,
                12343
            ],
            [
                12346,
                12437
            ],
            [
                12437,
                12485
            ],
            [
                12490,
                12494
            ],
            [
                12502,
                12508
            ],
            [
                12508,
                12510
            ],
            [
                12510,
                12514
            ],
            [
                12515,
                12522
            ],
            [
                12522,
                12524
            ],
            [
                12524,
                12525
            ],
            [
                12525,
                12555
            ],
            [
                12555,
                12579
            ],
            [
                12579,
                12621
            ],
            [
                12621,
                12631
            ],
            [
                12632,
                12649
            ],
            [
                12649,
                12667
            ],
            [
                12667,
                12679
            ],
            [
                12679,
                12691
            ],
            [
                12691,
                12695
            ],
            [
                12695,
                12697
            ],
            [
                12697,
                12719
            ],
            [
                12723,
                12729
            ],
            [
                12737,
                12752
            ],
            [
                12758,
                12807
            ],
            [
                12807,
                12846
            ],
            [
                12846,
                12866
            ],
            [
                12866,
                12867
            ],
            [
                12868,
                12898
            ],
            [
                12898,
                12938
            ],
            [
                12943,
                12964
            ],
            [
                12964,
                13025
            ],
            [
                13031,
                13033
            ],
            [
                13033,
                13044
            ],
            [
                13045,
                13052
            ],
            [
                13053,
                13080
            ],
            [
                13080,
                13142
            ],
            [
                13142,
                13145
            ],
            [
                13145,
                13163
            ],
            [
                13163,
                13169
            ],
            [
                13171,
                13181
            ],
            [
                13182,
                13185
            ],
            [
                13193,
                13196
            ],
            [
                13196,
                13221
            ],
            [
                13221,
                13238
            ],
            [
                13239,
                13251
            ],
            [
                13259,
                13280
            ],
            [
                13280,
                13341
            ],
            [
                13341,
                13344
            ],
            [
                13344,
                13369
            ],
            [
                13369,
                13408
            ],
            [
                13408,
                13425
            ],
            [
                13432,
                13484
            ],
            [
                13484,
                13485
            ],
            [
                13485,
                13512
            ],
            [
                13516,
                13533
            ],
            [
                13542,
                13553
            ],
            [
                13560,
                13574
            ],
            [
                13574,
                13580
            ],
            [
                13581,
                13616
            ],
            [
                13621,
                13661
            ],
            [
                13661,
                13695
            ],
            [
                13695,
                13735
            ],
            [
                13735,
                13792
            ],
            [
                13792,
                13822
            ],
            [
                13823,
                13832
            ],
            [
                13832,
                13857
            ],
            [
                13858,
                13885
            ],
            [
                13885,
                13887
            ],
            [
                13887,
                13919
            ],
            [
                13920,
                13951
            ],
            [
                13951,
                14005
            ],
            [
                14009,
                14042
            ],
            [
                14042,
                14056
            ],
            [
                14065,
                14107
            ],
            [
                14115,
                14117
            ],
            [
                14118,
                14127
            ],
            [
                14128,
                14144
            ],
            [
                14151,
                14204
            ],
            [
                14211,
                14228
            ],
            [
                14229,
                14284
            ],
            [
                14285,
                14360
            ],
            [
                14360,
                14390
            ],
            [
                14390,
                14391
            ],
            [
                14393,
                14406
            ],
            [
                14406,
                14408
            ],
            [
                14409,
                14456
            ],
            [
                14456,
                14506
            ],
            [
                14506,
                14507
            ],
            [
                14507,
                14514
            ],
            [
                14515,
                14530
            ],
            [
                14530,
                14546
            ],
            [
                14552,
                14557
            ],
            [
                14573,
                14582
            ],
            [
                14582,
                14595
            ],
            [
                14595,
                14612
            ],
            [
                14612,
                14689
            ],
            [
                14690,
                14697
            ],
            [
                14697,
                14725
            ],
            [
                14731,
                14733
            ],
            [
                14733,
                14861
            ],
            [
                14861,
                14863
            ],
            [
                14863,
                14917
            ],
            [
                14917,
                14982
            ],
            [
                14982,
                14983
            ],
            [
                14983,
                15001
            ],
            [
                15033,
                15044
            ],
            [
                15054,
                15056
            ],
            [
                15056,
                15090
            ],
            [
                15091,
                15154
            ],
            [
                15154,
                15155
            ],
            [
                15156,
                15161
            ],
            [
                15162,
                15175
            ],
            [
                15185,
                15222
            ],
            [
                15223,
                15263
            ],
            [
                15264,
                15274
            ],
            [
                15280,
                15287
            ],
            [
                15287,
                15288
            ]
        ],
        "row_chars": [
            [
                0,
                125
            ],
            [
                125,
                125
            ],
            [
                125,
                239
            ],
            [
                239,
                281
            ],
            [
                281,
                336
            ],
            [
                336,
                353
            ],
            [
                353,
                462
            ],
            [
                462,
                492
            ],
            [
                492,
                539
            ],
            [
                539,
                595
            ],
            [
                595,
                620
            ],
            [
                620,
                620
            ],
            [
                620,
                661
            ],
            [
                661,
                752
            ],
            [
                752,
                752
            ],
            [
                752,
                816
            ],
            [
                816,
                879
            ],
            [
                879,
                910
            ],
            [
                910,
                968
            ],
            [
                968,
                1032
            ],
            [
                1032,
                1108
            ],
            [
                1108,
                1232
            ],
            [
                1232,
                1283
            ],
            [
                1283,
                1325
            ],
            [
                1325,
                1325
            ],
            [
                1325,
                1386
            ],
            [
                1386,
                1386
            ],
            [
                1386,
                1500
            ],
            [
                1500,
                1655
            ],
            [
                1655,
                1794
            ],
            [
                1794,
                1859
            ],
            [
                1859,
                1941
            ],
            [
                1941,
                2096
            ],
            [
                2096,
                2096
            ],
            [
                2096,
                2096
            ],
            [
                2096,
                2224
            ],
            [
                2224,
                2357
            ],
            [
                2357,
                2410
            ],
            [
                2410,
                2531
            ],
            [
                2531,
                2611
            ],
            [
                2611,
                2713
            ],
            [
                2713,
                2733
            ],
            [
                2733,
                2867
            ],
            [
                2867,
                3059
            ],
            [
                3059,
                3059
            ],
            [
                3059,
                3059
            ],
            [
                3059,
                3059
            ],
            [
                3059,
                3203
            ],
            [
                3203,
                3337
            ],
            [
                3337,
                3428
            ],
            [
                3428,
                3428
            ],
            [
                3428,
                3527
            ],
            [
                3527,
                3706
            ],
            [
                3706,
                3920
            ],
            [
                3920,
                4043
            ],
            [
                4043,
                4113
            ],
            [
                4113,
                4173
            ],
            [
                4173,
                4277
            ],
            [
                4277,
                4442
            ],
            [
                4442,
                4442
            ],
            [
                4442,
                4442
            ],
            [
                4442,
                4442
            ],
            [
                4442,
                4481
            ],
            [
                4481,
                4543
            ],
            [
                4543,
                4543
            ],
            [
                4543,
                4606
            ],
            [
                4606,
                4648
            ],
            [
                4648,
                4648
            ],
            [
                4648,
                4696
            ],
            [
                4696,
                4725
            ],
            [
                4725,
                4795
            ],
            [
                4795,
                4795
            ],
            [
                4795,
                4881
            ],
            [
                4881,
                4921
            ],
            [
                4921,
                5031
            ],
            [
                5031,
                5077
            ],
            [
                5077,
                5088
            ],
            [
                5088,
                5195
            ],
            [
                5195,
                5263
            ],
            [
                5263,
                5263
            ],
            [
                5263,
                5263
            ],
            [
                5263,
                5305
            ],
            [
                5305,
                5334
            ],
            [
                5334,
                5356
            ],
            [
                5356,
                5356
            ],
            [
                5356,
                5479
            ],
            [
                5479,
                5524
            ],
            [
                5524,
                5546
            ],
            [
                5546,
                5546
            ],
            [
                5546,
                5587
            ],
            [
                5587,
                5630
            ],
            [
                5630,
                5705
            ],
            [
                5705,
                5777
            ],
            [
                5777,
                5932
            ],
            [
                5932,
                6134
            ],
            [
                6134,
                6134
            ],
            [
                6134,
                6160
            ],
            [
                6160,
                6308
            ],
            [
                6308,
                6397
            ],
            [
                6397,
                6480
            ],
            [
                6480,
                6480
            ],
            [
                6480,
                6554
            ],
            [
                6554,
                6589
            ],
            [
                6589,
                6612
            ],
            [
                6612,
                6733
            ],
            [
                6733,
                6801
            ],
            [
                6801,
                6801
            ],
            [
                6801,
                6801
            ],
            [
                6801,
                6956
            ],
            [
                6956,
                7101
            ],
            [
                7101,
                7144
            ],
            [
                7144,
                7178
            ],
            [
                7178,
                7189
            ],
            [
                7189,
                7189
            ],
            [
                7189,
                7275
            ],
            [
                7275,
                7325
            ],
            [
                7325,
                7369
            ],
            [
                7369,
                7423
            ],
            [
                7423,
                7569
            ],
            [
                7569,
                7569
            ],
            [
                7569,
                7741
            ],
            [
                7741,
                7887
            ],
            [
                7887,
                8097
            ],
            [
                8097,
                8139
            ],
            [
                8139,
                8139
            ],
            [
                8139,
                8237
            ],
            [
                8237,
                8313
            ],
            [
                8313,
                8388
            ],
            [
                8388,
                8388
            ],
            [
                8388,
                8474
            ],
            [
                8474,
                8539
            ],
            [
                8539,
                8654
            ],
            [
                8654,
                8665
            ],
            [
                8665,
                8691
            ],
            [
                8691,
                8772
            ],
            [
                8772,
                8812
            ],
            [
                8812,
                8907
            ],
            [
                8907,
                8951
            ],
            [
                8951,
                8995
            ],
            [
                8995,
                9023
            ],
            [
                9023,
                9128
            ],
            [
                9128,
                9263
            ],
            [
                9263,
                9349
            ],
            [
                9349,
                9372
            ],
            [
                9372,
                9451
            ],
            [
                9451,
                9585
            ],
            [
                9585,
                9634
            ],
            [
                9634,
                9697
            ],
            [
                9697,
                9918
            ],
            [
                9918,
                9918
            ],
            [
                9918,
                10016
            ],
            [
                10016,
                10116
            ],
            [
                10116,
                10116
            ],
            [
                10116,
                10212
            ],
            [
                10212,
                10284
            ],
            [
                10284,
                10284
            ],
            [
                10284,
                10397
            ],
            [
                10397,
                10494
            ],
            [
                10494,
                10534
            ],
            [
                10534,
                10569
            ],
            [
                10569,
                10569
            ],
            [
                10569,
                10569
            ],
            [
                10569,
                10569
            ],
            [
                10569,
                10569
            ],
            [
                10569,
                10623
            ],
            [
                10623,
                10623
            ],
            [
                10623,
                10755
            ],
            [
                10755,
                10828
            ],
            [
                10828,
                10828
            ],
            [
                10828,
                10828
            ],
            [
                10828,
                10828
            ],
            [
                10828,
                10828
            ],
            [
                10828,
                10828
            ],
            [
                10828,
                10884
            ],
            [
                10884,
                11038
            ],
            [
                11038,
                11097
            ],
            [
                11097,
                11185
            ],
            [
                11185,
                11236
            ],
            [
                11236,
                11255
            ],
            [
                11255,
                11286
            ],
            [
                11286,
                11324
            ],
            [
                11324,
                11386
            ],
            [
                11386,
                11386
            ],
            [
                11386,
                11409
            ],
            [
                11409,
                11420
            ],
            [
                11420,
                11438
            ],
            [
                11438,
                11554
            ],
            [
                11554,
                11577
            ],
            [
                11577,
                11588
            ],
            [
                11588,
                11588
            ],
            [
                11588,
                11654
            ],
            [
                11654,
                11724
            ],
            [
                11724,
                11724
            ],
            [
                11724,
                11724
            ],
            [
                11724,
                11751
            ],
            [
                11751,
                11751
            ],
            [
                11751,
                11782
            ],
            [
                11782,
                11808
            ],
            [
                11808,
                11834
            ],
            [
                11834,
                11934
            ],
            [
                11934,
                12028
            ],
            [
                12028,
                12092
            ],
            [
                12092,
                12180
            ],
            [
                12180,
                12296
            ],
            [
                12296,
                12296
            ],
            [
                12296,
                12318
            ],
            [
                12318,
                12346
            ],
            [
                12346,
                12346
            ],
            [
                12346,
                12346
            ],
            [
                12346,
                12437
            ],
            [
                12437,
                12510
            ],
            [
                12510,
                12524
            ],
            [
                12524,
                12555
            ],
            [
                12555,
                12555
            ],
            [
                12555,
                12579
            ],
            [
                12579,
                12649
            ],
            [
                12649,
                12667
            ],
            [
                12667,
                12679
            ],
            [
                12679,
                12691
            ],
            [
                12691,
                12697
            ],
            [
                12697,
                12722
            ],
            [
                12722,
                12722
            ],
            [
                12722,
                12722
            ],
            [
                12722,
                12722
            ],
            [
                12722,
                12807
            ],
            [
                12807,
                12846
            ],
            [
                12846,
                12866
            ],
            [
                12866,
                12898
            ],
            [
                12898,
                12964
            ],
            [
                12964,
                13033
            ],
            [
                13033,
                13080
            ],
            [
                13080,
                13145
            ],
            [
                13145,
                13171
            ],
            [
                13171,
                13171
            ],
            [
                13171,
                13196
            ],
            [
                13196,
                13221
            ],
            [
                13221,
                13221
            ],
            [
                13221,
                13280
            ],
            [
                13280,
                13344
            ],
            [
                13344,
                13369
            ],
            [
                13369,
                13408
            ],
            [
                13408,
                13484
            ],
            [
                13484,
                13574
            ],
            [
                13574,
                13661
            ],
            [
                13661,
                13661
            ],
            [
                13661,
                13661
            ],
            [
                13661,
                13695
            ],
            [
                13695,
                13735
            ],
            [
                13735,
                13792
            ],
            [
                13792,
                13832
            ],
            [
                13832,
                13887
            ],
            [
                13887,
                13951
            ],
            [
                13951,
                13951
            ],
            [
                13951,
                13951
            ],
            [
                13951,
                14042
            ],
            [
                14042,
                14042
            ],
            [
                14042,
                14118
            ],
            [
                14118,
                14285
            ],
            [
                14285,
                14285
            ],
            [
                14285,
                14360
            ],
            [
                14360,
                14390
            ],
            [
                14390,
                14408
            ],
            [
                14408,
                14456
            ],
            [
                14456,
                14506
            ],
            [
                14506,
                14530
            ],
            [
                14530,
                14582
            ],
            [
                14582,
                14595
            ],
            [
                14595,
                14612
            ],
            [
                14612,
                14733
            ],
            [
                14733,
                14863
            ],
            [
                14863,
                14917
            ],
            [
                14917,
                14982
            ],
            [
                14982,
                15004
            ],
            [
                15004,
                15004
            ],
            [
                15004,
                15004
            ],
            [
                15004,
                15004
            ],
            [
                15004,
                15004
            ],
            [
                15004,
                15004
            ],
            [
                15004,
                15004
            ],
            [
                15004,
                15004
            ],
            [
                15004,
                15056
            ],
            [
                15056,
                15223
            ],
            [
                15223,
                15288
            ]
        ]
    }
}