{
    "original": {
        "text": "When the first of the new year came round Lady Glencora was not keeping her appointment at Lady Monk's house. She went to Gatherum Castle, and let us hope that she enjoyed the magnificent Christmas hospitality of the Duke; but when the time came for moving on to Monkshade, she was indisposed, and Mr. Palliser went thither alone. Lady Glencora returned to Matching and remained at home, while her husband was away, in company with the two Miss Pallisers.\nWhen the tidings reached Monkshade that Lady Glencora was not to be expected, Burgo Fitzgerald was already there, armed with such pecuniary assistance as George Vavasor had been able to wrench out of the hands of Mr. Magruin. \"Burgo,\" said his aunt, catching him one morning near his bedroom door as he was about to go down-stairs in hunting trim, \"Burgo, your old flame, Lady Glencora, is not coming here.\"\n\"Lady Glencora not coming!\" said Burgo, betraying by his look and the tone of his voice too clearly that this change in the purpose of a married lady was to him of more importance than it should have been. Such betrayal, however, to Lady Monk was not perhaps matter of much moment.\n\"No; she is not coming. It can't be matter of any moment to you now.\"\n\"But, by heavens, it is,\" said he, putting his hand up to his forehead, and leaning back against the wall of the passage as though in despair. \"It is matter of moment to me. I am the most unfortunate devil that ever lived.\"\n\"Fie, Burgo, fie! You must not speak in that way of a married woman. I begin to think it is better that she should not come.\" At this moment another man booted and spurred came down the passage, upon whom Lady Monk smiled sweetly, speaking some pretty little word as he passed. Burgo spoke never a word, but still stood leaning against the wall, with his hand to his forehead, showing that he had heard something which had moved him greatly. \"Come back into your room, Burgo,\" said his aunt; and they both went in at the door that was nearest to them, for Lady Monk had been on the look-out for him, and had caught him as soon as he appeared in the passage. \"If this does annoy you, you should keep it to yourself! What will people say?\"\n\"How can I help what they say?\"\n\"But you would not wish to injure her, I suppose? I thought it best to tell you, for fear you should show any special sign of surprise if you heard of it first in public. It is very weak in you to allow yourself to feel that sort of regard for a married woman. If you cannot constrain yourself I shall be afraid to let you meet her in Brook Street.\"\nBurgo looked for a moment into his aunt's face without answering her, and then turned away towards the door. \"You can do as you please about that,\" said he; \"but you know as well as I do what I have made up my mind to do.\"\n\"Nonsense, Burgo; I know nothing of the kind. But do you go down-stairs to breakfast, and don't look like that when you go among the people there.\"\nLady Monk was a woman now about fifty years of age, who had been a great beauty, and who was still handsome in her advanced age. Her figure was very good. She was tall and of fine proportion, though by no means verging to that state of body which our excellent American friend and critic Mr. Hawthorne has described as beefy and has declared to be the general condition of English ladies of Lady Monk's age. Lady Monk was not beefy. She was a comely, handsome, upright, dame,--one of whom, as regards her outward appearance, England might be proud,--and of whom Sir Cosmo Monk was very proud. She had come of the family of the Worcestershire Fitzgeralds, of whom it used to be said that there never was one who was not beautiful and worthless. Looking at Lady Monk you would hardly think that she could be a worthless woman; but there were one or two who professed to know her, and who declared that she was a true scion of the family to which she belonged;--that even her husband's ample fortune had suffered from her extravagance, that she had quarrelled with her only son, and had succeeded in marrying her daughter to the greatest fool in the peerage. She had striven very hard to bring about a marriage between her nephew and the great heiress, and was a woman not likely to pardon those who had foiled her.\nAt this moment Burgo felt very certain that his aunt was aware of his purpose, and could not forgive her for pretending to be innocent of it. In this he was most ungrateful, as well as unreasonable,--and very indiscreet also. Had he been a man who ever reflected he must have known that such a woman as his aunt could only assist him as long as she might be presumed to be ignorant of his intention. But Burgo never reflected. The Fitzgeralds never reflected till they were nearer forty than thirty, and then people began to think worse of them than they had thought before.\nWhen Burgo reached the dining-room there were many men there, but no ladies. Sir Cosmo Monk, a fine bald-headed hale man of about sixty, was standing up at the sideboard, cutting a huge game pie. He was a man also who did not reflect much, but who contrived to keep straight in his course through the world without much reflection. \"Palliser is coming without her,\" he said in his loud clear voice, thinking nothing of his wife's nephew. \"She's ill, she says.\"\n\"I'm sorry for it,\" said one man. \"She's a deal the better fellow of the two.\"\n\"She has twice more go in her than Planty Pall,\" said another.\n\"Planty is no fool, I can tell you,\" said Sir Cosmo, coming to the table with his plate full of pie. \"We think he's about the most rising man we have.\" Sir Cosmo was the member for his county, and was a Liberal. He had once, when a much younger man, been at the Treasury, and had since always spoken of the Whig Government as though he himself were in some sort a part of it.\n\"Burgo, do you hear that Palliser is coming without his wife?\" said one man,--a very young man, who hardly knew what had been the circumstances of the case. The others, when they saw Burgo enter, had been silent on the subject of Lady Glencora.\n\"I have heard,--and be d----d to him,\" said Burgo. Then there was suddenly a silence in the room, and everyone seemed to attend assiduously to his breakfast. It was very terrible, this clear expression of a guilty meaning with reference to the wife of another man! Burgo regarded neither his plate nor his cup, but thrusting his hands into his breeches pockets, sat back in his chair with the blackness as of a thunder cloud upon his brow.\n[Illustration: \"I have heard,\" said Burgo.]\n\"Burgo, you had better eat your breakfast,\" said Sir Cosmo.\n\"I don't want any breakfast.\" He took, however, a bit of toast, and crumbling it up in his hand as he put a morsel into his mouth, went away to the sideboard and filled for himself a glass of cherry brandy.\n\"If you don't eat any breakfast the less of that you take the better,\" said Sir Cosmo.\n\"I'm all right now,\" said he, and coming back to the table, went through some form of making a meal with a roll and a cup of tea.\nThey who were then present used afterwards to say that they should never forget that breakfast. There had been something, they declared, in the tone of Burgo's voice when he uttered his curse against Mr. Palliser, which had struck them all with dread. There had, too, they said, been a blackness in his face, so terrible to be seen, that it had taken from them all the power of conversation. Sir Cosmo, when he had broken the ominous silence, had done so with a manifest struggle. The loud clatter of glasses with which Burgo had swallowed his dram, as though resolved to show that he was regardless who might know that he was drinking, added to the feeling. It may easily be understood that there was no further word spoken at that breakfast-table about Planty Pall or his wife.\nOn that day Burgo Fitzgerald startled all those who saw him by the mad way in which he rode. Early in the day there was no excuse for any such rashness. The hounds went from wood to wood, and men went in troops along the forest sides as they do on such occasions. But Burgo was seen to cram his horse at impracticable places, and to ride at gates and rails as though resolved to do himself and his uncle's steed a mischief. This was so apparent that some friend spoke to Sir Cosmo Monk about it. \"I can do nothing,\" said Sir Cosmo. \"He is a man whom no one's words will control. Something has ruffled him this morning, and he must run his chance till he becomes quiet.\" In the afternoon there was a good run, and Burgo again rode as hard as he could make his horse carry him;--but then there was the usual excuse for hard riding; and such riding in a straight run is not dangerous, as it is when the circumstances of the occasion do not warrant it, But, be that as it may, Burgo went on to the end of the day without accident, and as he went home, assured Sir Cosmo, in a voice which was almost cheery, that his mare Spinster was by far the best thing in the Monkshade stables. Indeed Spinster made quite a character that day, and was sold at the end of the season for three hundred guineas on the strength of it. I am, however, inclined to believe that there was nothing particular about the mare. Horses always catch the temperament of their riders, and when a man wishes to break his neck, he will generally find a horse willing to assist him in appearance, but able to save him in the performance. Burgo, at any rate, did not break his neck, and appeared at the dinner-table in a better humour than that which he had displayed in the morning.\nOn the day appointed Mr. Palliser reached Monkshade. He was, in a manner, canvassing for the support of the Liberal party, and it would not have suited him to show any indifference to the invitation of so influential a man as Sir Cosmo. Sir Cosmo had a little party of his own in the House, consisting of four or five other respectable country gentlemen, who troubled themselves little with thinking, and who mostly had bald heads. Sir Cosmo was a man with whom it was quite necessary that such an aspirant as Mr. Palliser should stand well, and therefore Mr. Palliser came to Monkshade, although Lady Glencora was unable to accompany him.\n\"We are so sorry,\" said Lady Monk. \"We have been looking forward to having Lady Glencora with us beyond everything.\"\nMr. Palliser declared that Lady Glencora herself was overwhelmed with grief in that she should have been debarred from making this special visit. She had, however, been so unwell at Gatherum, the anxious husband declared, as to make it unsafe for her to go again away from home.\n\"I hope it is nothing serious,\" said Lady Monk, with a look of grief so well arranged that any stranger would have thought that all the Pallisers must have been very dear to her heart. Then Mr. Palliser went on to explain that Lady Glencora had unfortunately been foolish. During one of those nights of hard frost she had gone out among the ruins at Matching, to show them by moonlight to a friend. The friend had thoughtlessly, foolishly, and in a manner which Mr. Palliser declared to be very reprehensible, allowed Lady Glencora to remain among the ruins till she had caught cold.\n\"How very wrong!\" said Lady Monk with considerable emphasis.\n\"It was very wrong,\" said Mr. Palliser, speaking of poor Alice almost maliciously. \"However, she caught a cold which, unfortunately, has become worse at my uncle's, and so I was obliged to take her home.\"\nLady Monk perceived that Mr. Palliser had in truth left his wife behind because he believed her to be ill, and not because he was afraid of Burgo Fitzgerald. So accomplished a woman as Lady Monk felt no doubt that the wife's absence was caused by fear of the lover, and not by any cold caught in viewing ruins by moonlight. She was not to be deceived in such a matter. But she became aware that Mr. Palliser had been deceived. As she was right in this we must go back for a moment, and say a word of things as they went on at Matching after Alice Vavasor had left that place.\nAlice had told Miss Palliser that steps ought to be taken, whatever might be their cost, to save Lady Glencora from the peril of a visit to Monkshade. To this Miss Palliser had assented, and, when she left Alice, was determined to tell Mr. Palliser the whole story. But when the time for doing so had come, her courage failed her. She could not find words in which to warn the husband that his wife would not be safe in the company of her old lover. The task with Lady Glencora herself, bad as that would be, might be easier, and this task she at last undertook,--not without success.\n\"Glencora,\" she said, when she found a fitting opportunity, \"you won't be angry, I hope, if I say a word to you?\"\n\"That depends very much upon what the word is,\" said Lady Glencora. And here it must be acknowledged that Mr. Palliser's wife had not done much to ingratiate herself with Mr. Palliser's cousins;--not perhaps so much as she should have done, seeing that she found them in her husband's house. She had taught herself to think that they were hard, stiff, and too proud of bearing the name of Palliser. Perhaps some little attempt may have been made by one or both of them to teach her something, and it need hardly be said that such an attempt on the part of a husband's unmarried female relations would not be forgiven by a young bride. She had undoubtedly been ungracious, and of this Miss Palliser was well aware.\n\"Well,--the word shall be as little unpleasant as I can make it,\" said Miss Palliser, already appreciating fully the difficulty of her task.\n\"But why say anything that is unpleasant? However, if it is to be said, let us have it over at once.\"\n\"You are going to Monkshade, I believe, with Plantagenet.\"\n\"Well;--and what of that?\"\n\"Dear Glencora, I think you had better not go. Do you not think so yourself?\"\n\"Who has been talking to you?\" said Lady Glencora, turning upon her very sharply.\n\"Nobody has been talking to me;--not in the sense you mean.\"\n\"Plantagenet has spoken to you?\"\n\"Not a word,\" said Miss Palliser. \"You may be sure that he would not utter a word on such a subject to anyone unless it were to yourself. But, dear Glencora, you should not go there;--I mean it in all kindness and love,--I do indeed.\" Saying this she offered her hand to Glencora, and Glencora took it.\n\"Perhaps you do,\" said she in a low voice.\n\"Indeed I do. The world is so hard and cruel in what it says.\"\n\"I do not care two straws for what the world says.\"\n\"But he might care.\"\n\"It is not my fault. I do not want to go to Monkshade. Lady Monk was my friend once, but I do not care if I never see her again. I did not arrange this visit. It was Plantagenet who did it.\"\n\"But he will not take you there if you say you do not wish it.\"\n\"I have said so, and he told me that I must go. You will hardly believe me,--but I condescended even to tell him why I thought it better to remain away. He told me, in answer, that it was a silly folly which I must live down, and that it did not become me to be afraid of any man.\"\n\"Of course you are not afraid, but--\"\n\"I am afraid. That is just the truth. I am afraid;--but what can I do more than I have done?\"\nThis was very terrible to Miss Palliser. She had not thought that Lady Glencora would say so much, and she felt a true regret in having been made to hear words which so nearly amounted to a confession. But for this there was no help now. There were not many more words between them, and we already know the result of the conversation. Lady Glencora became so ill from the effects of her imprudent lingering among the ruins that she was unable to go to Monkshade.\nMr. Palliser remained three days at Monkshade, and cemented his political alliance with Sir Cosmo much in the same way as he had before done with the Duke of St. Bungay. There was little or nothing said about politics, and certainly not a word that could be taken as any definite party understanding between the men; but they sat at dinner together at the same table, drank a glass of wine or two out of the same decanters, and dropped a chance word now and again about the next session of Parliament. I do not know that anything more had been expected either by Mr. Palliser or by Sir Cosmo; but it seemed to be understood when Mr. Palliser went away that Sir Cosmo was of opinion that that young scion of a ducal house ought to become the future Chancellor of the Exchequer in the Whig Government.\n\"I can't see that there's so much in him,\" said one young member of Parliament to Sir Cosmo.\n\"I rather think that there is, all the same,\" said the baronet. \"There's a good deal in him, I believe! I dare say he's not very bright, but I don't know that we want brightness. A bright financier is the most dangerous man in the world. We've had enough of that already. Give me sound common sense, with just enough of the gab in a man to enable him to say what he's got to say! We don't want more than that nowadays.\" From which it became evident that Sir Cosmo was satisfied with the new political candidate for high place.\nLady Monk took an occasion to introduce Mr. Palliser to Burgo Fitzgerald; with what object it is difficult to say, unless she was anxious to make mischief between the men. Burgo scowled at him; but Mr. Palliser did not notice the scowl, and put out his hand to his late rival most affably. Burgo was forced to take it, and as he did so made a little speech. \"I'm sorry that we have not the pleasure of seeing Lady Glencora with you,\" said he.\n\"She is unfortunately indisposed,\" said Mr. Palliser.\n\"I am sorry for it,\" said Burgo--\"very sorry indeed.\" Then he turned his back and walked away. The few words he had spoken, and the manner in which he had carried himself, had been such as to make all those around them notice it. Each of them knew that Lady Glencora's name should not have been in Burgo's mouth, and all felt a fear not easily to be defined that something terrible would come of it. But Mr. Palliser himself did not seem to notice anything, or to fear anything; and nothing terrible did come of it during that visit of his to Monkshade.",
        "paragraph_chars": [
            [
                0,
                456
            ],
            [
                456,
                864
            ],
            [
                864,
                1146
            ],
            [
                1146,
                1216
            ],
            [
                1216,
                1440
            ],
            [
                1440,
                2178
            ],
            [
                2178,
                2210
            ],
            [
                2210,
                2560
            ],
            [
                2560,
                2783
            ],
            [
                2783,
                2931
            ],
            [
                2931,
                4244
            ],
            [
                4244,
                4819
            ],
            [
                4819,
                5280
            ],
            [
                5280,
                5359
            ],
            [
                5359,
                5422
            ],
            [
                5422,
                5798
            ],
            [
                5798,
                6043
            ],
            [
                6043,
                6483
            ],
            [
                6483,
                6527
            ],
            [
                6527,
                6587
            ],
            [
                6587,
                6794
            ],
            [
                6794,
                6881
            ],
            [
                6881,
                7011
            ],
            [
                7011,
                7791
            ],
            [
                7791,
                9538
            ],
            [
                9538,
                10178
            ],
            [
                10178,
                10295
            ],
            [
                10295,
                10574
            ],
            [
                10574,
                11158
            ],
            [
                11158,
                11219
            ],
            [
                11219,
                11424
            ],
            [
                11424,
                12000
            ],
            [
                12000,
                12585
            ],
            [
                12585,
                12699
            ],
            [
                12699,
                13413
            ],
            [
                13413,
                13554
            ],
            [
                13554,
                13656
            ],
            [
                13656,
                13715
            ],
            [
                13715,
                13742
            ],
            [
                13742,
                13820
            ],
            [
                13820,
                13902
            ],
            [
                13902,
                13963
            ],
            [
                13963,
                13996
            ],
            [
                13996,
                14299
            ],
            [
                14299,
                14342
            ],
            [
                14342,
                14405
            ],
            [
                14405,
                14457
            ],
            [
                14457,
                14478
            ],
            [
                14478,
                14669
            ],
            [
                14669,
                14733
            ],
            [
                14733,
                15015
            ],
            [
                15015,
                15053
            ],
            [
                15053,
                15147
            ],
            [
                15147,
                15610
            ],
            [
                15610,
                16410
            ],
            [
                16410,
                16503
            ],
            [
                16503,
                17030
            ],
            [
                17030,
                17473
            ],
            [
                17473,
                17527
            ],
            [
                17527,
                18080
            ]
        ],
        "segment_chars": [
            [
                0,
                110
            ],
            [
                110,
                331
            ],
            [
                331,
                456
            ],
            [
                456,
                682
            ],
            [
                682,
                864
            ],
            [
                864,
                892
            ],
            [
                892,
                1070
            ],
            [
                1070,
                1146
            ],
            [
                1146,
                1170
            ],
            [
                1170,
                1216
            ],
            [
                1216,
                1359
            ],
            [
                1359,
                1390
            ],
            [
                1390,
                1440
            ],
            [
                1440,
                1458
            ],
            [
                1458,
                1509
            ],
            [
                1509,
                1566
            ],
            [
                1566,
                1718
            ],
            [
                1718,
                1882
            ],
            [
                1882,
                2098
            ],
            [
                2098,
                2155
            ],
            [
                2155,
                2178
            ],
            [
                2178,
                2210
            ],
            [
                2210,
                2260
            ],
            [
                2260,
                2381
            ],
            [
                2381,
                2471
            ],
            [
                2471,
                2560
            ],
            [
                2560,
                2669
            ],
            [
                2669,
                2783
            ],
            [
                2783,
                2829
            ],
            [
                2829,
                2931
            ],
            [
                2931,
                3060
            ],
            [
                3060,
                3086
            ],
            [
                3086,
                3339
            ],
            [
                3339,
                3364
            ],
            [
                3364,
                3524
            ],
            [
                3524,
                3675
            ],
            [
                3675,
                4087
            ],
            [
                4087,
                4244
            ],
            [
                4244,
                4386
            ],
            [
                4386,
                4470
            ],
            [
                4470,
                4644
            ],
            [
                4644,
                4671
            ],
            [
                4671,
                4819
            ],
            [
                4819,
                4896
            ],
            [
                4896,
                5015
            ],
            [
                5015,
                5151
            ],
            [
                5151,
                5257
            ],
            [
                5257,
                5280
            ],
            [
                5280,
                5314
            ],
            [
                5314,
                5359
            ],
            [
                5359,
                5422
            ],
            [
                5422,
                5523
            ],
            [
                5523,
                5574
            ],
            [
                5574,
                5634
            ],
            [
                5634,
                5798
            ],
            [
                5798,
                5861
            ],
            [
                5861,
                5955
            ],
            [
                5955,
                6043
            ],
            [
                6043,
                6094
            ],
            [
                6094,
                6201
            ],
            [
                6201,
                6308
            ],
            [
                6308,
                6483
            ],
            [
                6483,
                6527
            ],
            [
                6527,
                6587
            ],
            [
                6587,
                6617
            ],
            [
                6617,
                6794
            ],
            [
                6794,
                6881
            ],
            [
                6881,
                7011
            ],
            [
                7011,
                7107
            ],
            [
                7107,
                7263
            ],
            [
                7263,
                7403
            ],
            [
                7403,
                7492
            ],
            [
                7492,
                7670
            ],
            [
                7670,
                7791
            ],
            [
                7791,
                7884
            ],
            [
                7884,
                7944
            ],
            [
                7944,
                8055
            ],
            [
                8055,
                8215
            ],
            [
                8215,
                8287
            ],
            [
                8287,
                8323
            ],
            [
                8323,
                8370
            ],
            [
                8370,
                8461
            ],
            [
                8461,
                8969
            ],
            [
                8969,
                9105
            ],
            [
                9105,
                9190
            ],
            [
                9190,
                9393
            ],
            [
                9393,
                9538
            ],
            [
                9538,
                9591
            ],
            [
                9591,
                9775
            ],
            [
                9775,
                9970
            ],
            [
                9970,
                10178
            ],
            [
                10178,
                10213
            ],
            [
                10213,
                10295
            ],
            [
                10295,
                10441
            ],
            [
                10441,
                10574
            ],
            [
                10574,
                10759
            ],
            [
                10759,
                10847
            ],
            [
                10847,
                10973
            ],
            [
                10973,
                11158
            ],
            [
                11158,
                11176
            ],
            [
                11176,
                11219
            ],
            [
                11219,
                11302
            ],
            [
                11302,
                11424
            ],
            [
                11424,
                11582
            ],
            [
                11582,
                11748
            ],
            [
                11748,
                11793
            ],
            [
                11793,
                11851
            ],
            [
                11851,
                12000
            ],
            [
                12000,
                12151
            ],
            [
                12151,
                12266
            ],
            [
                12266,
                12331
            ],
            [
                12331,
                12450
            ],
            [
                12450,
                12585
            ],
            [
                12585,
                12699
            ],
            [
                12699,
                12767
            ],
            [
                12767,
                12991
            ],
            [
                12991,
                13098
            ],
            [
                13098,
                13334
            ],
            [
                13334,
                13413
            ],
            [
                13413,
                13554
            ],
            [
                13554,
                13596
            ],
            [
                13596,
                13656
            ],
            [
                13656,
                13715
            ],
            [
                13715,
                13742
            ],
            [
                13742,
                13789
            ],
            [
                13789,
                13820
            ],
            [
                13820,
                13851
            ],
            [
                13851,
                13902
            ],
            [
                13902,
                13963
            ],
            [
                13963,
                13996
            ],
            [
                13996,
                14030
            ],
            [
                14030,
                14134
            ],
            [
                14134,
                14231
            ],
            [
                14231,
                14299
            ],
            [
                14299,
                14342
            ],
            [
                14342,
                14356
            ],
            [
                14356,
                14405
            ],
            [
                14405,
                14457
            ],
            [
                14457,
                14478
            ],
            [
                14478,
                14499
            ],
            [
                14499,
                14533
            ],
            [
                14533,
                14607
            ],
            [
                14607,
                14637
            ],
            [
                14637,
                14669
            ],
            [
                14669,
                14733
            ],
            [
                14733,
                14781
            ],
            [
                14781,
                14886
            ],
            [
                14886,
                15015
            ],
            [
                15015,
                15053
            ],
            [
                15053,
                15067
            ],
            [
                15067,
                15091
            ],
            [
                15091,
                15147
            ],
            [
                15147,
                15188
            ],
            [
                15188,
                15349
            ],
            [
                15349,
                15385
            ],
            [
                15385,
                15482
            ],
            [
                15482,
                15610
            ],
            [
                15610,
                15780
            ],
            [
                15780,
                16112
            ],
            [
                16112,
                16410
            ],
            [
                16410,
                16503
            ],
            [
                16503,
                16567
            ],
            [
                16567,
                16607
            ],
            [
                16607,
                16682
            ],
            [
                16682,
                16741
            ],
            [
                16741,
                16775
            ],
            [
                16775,
                16883
            ],
            [
                16883,
                16923
            ],
            [
                16923,
                17030
            ],
            [
                17030,
                17202
            ],
            [
                17202,
                17320
            ],
            [
                17320,
                17388
            ],
            [
                17388,
                17473
            ],
            [
                17473,
                17527
            ],
            [
                17527,
                17581
            ],
            [
                17581,
                17622
            ],
            [
                17622,
                17757
            ],
            [
                17757,
                17927
            ],
            [
                17927,
                18080
            ]
        ],
        "overlap_chars": [
            [
                18,
                30
            ],
            [
                42,
                55
            ],
            [
                60,
                63
            ],
            [
                91,
                110
            ],
            [
                227,
                281
            ],
            [
                292,
                315
            ],
            [
                324,
                331
            ],
            [
                331,
                344
            ],
            [
                370,
                381
            ],
            [
                357,
                365
            ],
            [
                427,
                456
            ],
            [
                456,
                580
            ],
            [
                610,
                681
            ],
            [
                682,
                705
            ],
            [
                706,
                730
            ],
            [
                753,
                774
            ],
            [
                787,
                789
            ],
            [
                736,
                739
            ],
            [
                790,
                797
            ],
            [
                779,
                780
            ],
            [
                802,
                856
            ],
            [
                861,
                864
            ],
            [
                864,
                865
            ],
            [
                879,
                892
            ],
            [
                892,
                913
            ],
            [
                952,
                963
            ],
            [
                914,
                929
            ],
            [
                946,
                951
            ],
            [
                964,
                973
            ],
            [
                1014,
                1017
            ],
            [
                1028,
                1032
            ],
            [
                1018,
                1024
            ],
            [
                1044,
                1069
            ],
            [
                1146,
                1149
            ],
            [
                1168,
                1170
            ],
            [
                1170,
                1178
            ],
            [
                1182,
                1188
            ],
            [
                1203,
                1209
            ],
            [
                1213,
                1216
            ],
            [
                1216,
                1220
            ],
            [
                1234,
                1236
            ],
            [
                1239,
                1321
            ],
            [
                1337,
                1359
            ],
            [
                1359,
                1362
            ],
            [
                1366,
                1372
            ],
            [
                1388,
                1390
            ],
            [
                1390,
                1440
            ],
            [
                1440,
                1441
            ],
            [
                1446,
                1451
            ],
            [
                1456,
                1458
            ],
            [
                1458,
                1509
            ],
            [
                1509,
                1566
            ],
            [
                1704,
                1706
            ],
            [
                1581,
                1588
            ],
            [
                1633,
                1634
            ],
            [
                1917,
                1921
            ],
            [
                1669,
                1670
            ],
            [
                1882,
                1914
            ],
            [
                1645,
                1654
            ],
            [
                2096,
                2098
            ],
            [
                2098,
                2106
            ],
            [
                2112,
                2117
            ],
            [
                2118,
                2122
            ],
            [
                2134,
                2155
            ],
            [
                2155,
                2178
            ],
            [
                2178,
                2210
            ],
            [
                2260,
                2315
            ],
            [
                2336,
                2357
            ],
            [
                2361,
                2363
            ],
            [
                2370,
                2381
            ],
            [
                2381,
                2471
            ],
            [
                2471,
                2484
            ],
            [
                2495,
                2560
            ],
            [
                2560,
                2585
            ],
            [
                2591,
                2599
            ],
            [
                2628,
                2645
            ],
            [
                2651,
                2669
            ],
            [
                2669,
                2730
            ],
            [
                2747,
                2783
            ],
            [
                2783,
                2829
            ],
            [
                2840,
                2842
            ],
            [
                2855,
                2902
            ],
            [
                2923,
                2931
            ],
            [
                2931,
                2944
            ],
            [
                2957,
                2982
            ],
            [
                2987,
                3015
            ],
            [
                3020,
                3029
            ],
            [
                3080,
                3084
            ],
            [
                3121,
                3122
            ],
            [
                2945,
                2946
            ],
            [
                3106,
                3110
            ],
            [
                3094,
                3098
            ],
            [
                3064,
                3070
            ],
            [
                3337,
                3339
            ],
            [
                3364,
                3371
            ],
            [
                3436,
                3443
            ],
            [
                3378,
                3380
            ],
            [
                3372,
                3373
            ],
            [
                3382,
                3406
            ],
            [
                3412,
                3419
            ],
            [
                3456,
                3478
            ],
            [
                3481,
                3523
            ],
            [
                3524,
                3596
            ],
            [
                3608,
                3675
            ],
            [
                3675,
                3759
            ],
            [
                3900,
                3913
            ],
            [
                3920,
                3963
            ],
            [
                3969,
                4014
            ],
            [
                4037,
                4087
            ],
            [
                4087,
                4157
            ],
            [
                4158,
                4179
            ],
            [
                4179,
                4184
            ],
            [
                4185,
                4188
            ],
            [
                4197,
                4200
            ],
            [
                4189,
                4196
            ],
            [
                4208,
                4244
            ],
            [
                4259,
                4269
            ],
            [
                4275,
                4363
            ],
            [
                4364,
                4366
            ],
            [
                4382,
                4386
            ],
            [
                4470,
                4506
            ],
            [
                4507,
                4530
            ],
            [
                4547,
                4577
            ],
            [
                4589,
                4592
            ],
            [
                4602,
                4644
            ],
            [
                4644,
                4670
            ],
            [
                4819,
                4853
            ],
            [
                4896,
                4930
            ],
            [
                4936,
                4968
            ],
            [
                4972,
                5015
            ],
            [
                5015,
                5017
            ],
            [
                5028,
                5032
            ],
            [
                5018,
                5027
            ],
            [
                5033,
                5066
            ],
            [
                5077,
                5150
            ],
            [
                5151,
                5187
            ],
            [
                5193,
                5216
            ],
            [
                5255,
                5257
            ],
            [
                5257,
                5280
            ],
            [
                5280,
                5314
            ],
            [
                5314,
                5320
            ],
            [
                5328,
                5359
            ],
            [
                5359,
                5367
            ],
            [
                5374,
                5422
            ],
            [
                5422,
                5523
            ],
            [
                5523,
                5524
            ],
            [
                5533,
                5574
            ],
            [
                5574,
                5598
            ],
            [
                5599,
                5633
            ],
            [
                5798,
                5861
            ],
            [
                5861,
                5874
            ],
            [
                5894,
                5897
            ],
            [
                5953,
                5954
            ],
            [
                6043,
                6057
            ],
            [
                6059,
                6067
            ],
            [
                6057,
                6059
            ],
            [
                6071,
                6094
            ],
            [
                6099,
                6117
            ],
            [
                6120,
                6153
            ],
            [
                6171,
                6185
            ],
            [
                6190,
                6201
            ],
            [
                6308,
                6313
            ],
            [
                6405,
                6413
            ],
            [
                6427,
                6431
            ],
            [
                6368,
                6377
            ],
            [
                6358,
                6364
            ],
            [
                6378,
                6404
            ],
            [
                6432,
                6445
            ],
            [
                6449,
                6483
            ],
            [
                6527,
                6587
            ],
            [
                6587,
                6617
            ],
            [
                6617,
                6636
            ],
            [
                6695,
                6701
            ],
            [
                6641,
                6654
            ],
            [
                6718,
                6722
            ],
            [
                6728,
                6755
            ],
            [
                6760,
                6794
            ],
            [
                6794,
                6881
            ],
            [
                6881,
                7011
            ],
            [
                7016,
                7024
            ],
            [
                7030,
                7070
            ],
            [
                7078,
                7107
            ],
            [
                7107,
                7230
            ],
            [
                7235,
                7263
            ],
            [
                7376,
                7379
            ],
            [
                7310,
                7318
            ],
            [
                7269,
                7272
            ],
            [
                7290,
                7294
            ],
            [
                7323,
                7331
            ],
            [
                7401,
                7402
            ],
            [
                7791,
                7828
            ],
            [
                7851,
                7884
            ],
            [
                8129,
                8196
            ],
            [
                8086,
                8091
            ],
            [
                8203,
                8215
            ],
            [
                8215,
                8286
            ],
            [
                8287,
                8323
            ],
            [
                8323,
                8324
            ],
            [
                8341,
                8343
            ],
            [
                8350,
                8368
            ],
            [
                8368,
                8370
            ],
            [
                8414,
                8461
            ],
            [
                8461,
                8477
            ],
            [
                8504,
                8540
            ],
            [
                8565,
                8566
            ],
            [
                8568,
                8571
            ],
            [
                8792,
                8920
            ],
            [
                8928,
                8936
            ],
            [
                8550,
                8555
            ],
            [
                8943,
                8969
            ],
            [
                9393,
                9398
            ],
            [
                9441,
                9493
            ],
            [
                9522,
                9538
            ],
            [
                9538,
                9591
            ],
            [
                9591,
                9593
            ],
            [
                9674,
                9682
            ],
            [
                9722,
                9773
            ],
            [
                9891,
                9896
            ],
            [
                9785,
                9873
            ],
            [
                9661,
                9664
            ],
            [
                9958,
                9962
            ],
            [
                9874,
                9891
            ],
            [
                9968,
                9970
            ],
            [
                10094,
                10178
            ],
            [
                10178,
                10213
            ],
            [
                10213,
                10274
            ],
            [
                10575,
                10603
            ],
            [
                10759,
                10776
            ],
            [
                10796,
                10845
            ],
            [
                10892,
                10904
            ],
            [
                10782,
                10784
            ],
            [
                10882,
                10887
            ],
            [
                10905,
                10946
            ],
            [
                10960,
                10973
            ],
            [
                10973,
                11001
            ],
            [
                11084,
                11158
            ],
            [
                11158,
                11176
            ],
            [
                11176,
                11219
            ],
            [
                11219,
                11257
            ],
            [
                11300,
                11302
            ],
            [
                11302,
                11303
            ],
            [
                11316,
                11351
            ],
            [
                11363,
                11424
            ],
            [
                11424,
                11582
            ],
            [
                11633,
                11678
            ],
            [
                11746,
                11748
            ],
            [
                11797,
                11800
            ],
            [
                11814,
                11851
            ],
            [
                11851,
                11875
            ],
            [
                11876,
                11905
            ],
            [
                11959,
                11970
            ],
            [
                11979,
                11987
            ],
            [
                11950,
                11958
            ],
            [
                11998,
                12000
            ],
            [
                12000,
                12057
            ],
            [
                12089,
                12151
            ],
            [
                12159,
                12176
            ],
            [
                12185,
                12248
            ],
            [
                12264,
                12266
            ],
            [
                12266,
                12269
            ],
            [
                12307,
                12331
            ],
            [
                12331,
                12450
            ],
            [
                12485,
                12486
            ],
            [
                12540,
                12543
            ],
            [
                12464,
                12485
            ],
            [
                12583,
                12585
            ],
            [
                12585,
                12605
            ],
            [
                12643,
                12699
            ],
            [
                12699,
                12712
            ],
            [
                12728,
                12767
            ],
            [
                12952,
                12955
            ],
            [
                12825,
                12893
            ],
            [
                12895,
                12938
            ],
            [
                12989,
                12991
            ],
            [
                12991,
                13098
            ],
            [
                13168,
                13180
            ],
            [
                13240,
                13242
            ],
            [
                13190,
                13191
            ],
            [
                13300,
                13303
            ],
            [
                13163,
                13167
            ],
            [
                13332,
                13333
            ],
            [
                13413,
                13419
            ],
            [
                13421,
                13497
            ],
            [
                13552,
                13553
            ],
            [
                13656,
                13715
            ],
            [
                13715,
                13716
            ],
            [
                13727,
                13742
            ],
            [
                13742,
                13789
            ],
            [
                13789,
                13820
            ],
            [
                13820,
                13851
            ],
            [
                13851,
                13901
            ],
            [
                13963,
                13996
            ],
            [
                13996,
                14030
            ],
            [
                14134,
                14178
            ],
            [
                14180,
                14214
            ],
            [
                14217,
                14231
            ],
            [
                14231,
                14299
            ],
            [
                14299,
                14342
            ],
            [
                14342,
                14356
            ],
            [
                14356,
                14405
            ],
            [
                14405,
                14454
            ],
            [
                14499,
                14533
            ],
            [
                14533,
                14607
            ],
            [
                14607,
                14637
            ],
            [
                14637,
                14655
            ],
            [
                14666,
                14669
            ],
            [
                14669,
                14733
            ],
            [
                14733,
                14781
            ],
            [
                14814,
                14815
            ],
            [
                14829,
                14833
            ],
            [
                14842,
                14872
            ],
            [
                14880,
                14886
            ],
            [
                14886,
                14896
            ],
            [
                14909,
                14947
            ],
            [
                14957,
                14967
            ],
            [
                14975,
                14978
            ],
            [
                14992,
                15015
            ],
            [
                15015,
                15049
            ],
            [
                15053,
                15067
            ],
            [
                15067,
                15091
            ],
            [
                15091,
                15103
            ],
            [
                15105,
                15113
            ],
            [
                15123,
                15127
            ],
            [
                15114,
                15122
            ],
            [
                15144,
                15147
            ],
            [
                15147,
                15188
            ],
            [
                15385,
                15482
            ],
            [
                15482,
                15610
            ],
            [
                15610,
                15707
            ],
            [
                15713,
                15738
            ],
            [
                15746,
                15780
            ],
            [
                15780,
                15796
            ],
            [
                15808,
                15827
            ],
            [
                15925,
                15958
            ],
            [
                15976,
                16111
            ],
            [
                16410,
                16501
            ],
            [
                16501,
                16503
            ],
            [
                16503,
                16532
            ],
            [
                16546,
                16567
            ],
            [
                16567,
                16607
            ],
            [
                16607,
                16643
            ],
            [
                16682,
                16741
            ],
            [
                16741,
                16775
            ],
            [
                16775,
                16801
            ],
            [
                16923,
                16985
            ],
            [
                17028,
                17030
            ],
            [
                17030,
                17047
            ],
            [
                17070,
                17103
            ],
            [
                17121,
                17151
            ],
            [
                17156,
                17159
            ],
            [
                17168,
                17202
            ],
            [
                17202,
                17255
            ],
            [
                17265,
                17287
            ],
            [
                17363,
                17365
            ],
            [
                17311,
                17318
            ],
            [
                17320,
                17347
            ],
            [
                17318,
                17319
            ],
            [
                17388,
                17452
            ],
            [
                17461,
                17473
            ],
            [
                17473,
                17527
            ],
            [
                17527,
                17532
            ],
            [
                17561,
                17565
            ],
            [
                17533,
                17558
            ],
            [
                17581,
                17622
            ],
            [
                17840,
                17843
            ],
            [
                17659,
                17665
            ],
            [
                17708,
                17712
            ],
            [
                17775,
                17779
            ],
            [
                17734,
                17740
            ],
            [
                17649,
                17654
            ],
            [
                17848,
                17852
            ],
            [
                17666,
                17668
            ],
            [
                17855,
                17859
            ],
            [
                17925,
                17927
            ],
            [
                17927,
                17983
            ],
            [
                18004,
                18026
            ],
            [
                18036,
                18048
            ],
            [
                18063,
                18066
            ],
            [
                18054,
                18059
            ],
            [
                18067,
                18080
            ]
        ],
        "row_chars": [
            [
                0,
                110
            ],
            [
                110,
                331
            ],
            [
                331,
                456
            ],
            [
                456,
                682
            ],
            [
                682,
                864
            ],
            [
                864,
                892
            ],
            [
                892,
                1070
            ],
            [
                1070,
                1146
            ],
            [
                1146,
                1170
            ],
            [
                1170,
                1216
            ],
            [
                1216,
                1359
            ],
            [
                1359,
                1390
            ],
            [
                1390,
                1440
            ],
            [
                1440,
                1458
            ],
            [
                1458,
                1509
            ],
            [
                1509,
                1566
            ],
            [
                1566,
                2098
            ],
            [
                2098,
                2155
            ],
            [
                2155,
                2178
            ],
            [
                2178,
                2210
            ],
            [
                2210,
                2260
            ],
            [
                2260,
                2381
            ],
            [
                2381,
                2471
            ],
            [
                2471,
                2560
            ],
            [
                2560,
                2669
            ],
            [
                2669,
                2783
            ],
            [
                2783,
                2829
            ],
            [
                2829,
                2931
            ],
            [
                2931,
                3339
            ],
            [
                3339,
                3364
            ],
            [
                3364,
                3524
            ],
            [
                3524,
                3675
            ],
            [
                3675,
                4087
            ],
            [
                4087,
                4244
            ],
            [
                4244,
                4386
            ],
            [
                4386,
                4470
            ],
            [
                4470,
                4644
            ],
            [
                4644,
                4671
            ],
            [
                4671,
                4819
            ],
            [
                4819,
                5015
            ],
            [
                5015,
                5151
            ],
            [
                5151,
                5257
            ],
            [
                5257,
                5280
            ],
            [
                5280,
                5314
            ],
            [
                5314,
                5359
            ],
            [
                5359,
                5422
            ],
            [
                5422,
                5523
            ],
            [
                5523,
                5574
            ],
            [
                5574,
                5634
            ],
            [
                5634,
                5798
            ],
            [
                5798,
                5861
            ],
            [
                5861,
                5955
            ],
            [
                5955,
                6043
            ],
            [
                6043,
                6094
            ],
            [
                6094,
                6201
            ],
            [
                6201,
                6308
            ],
            [
                6308,
                6483
            ],
            [
                6483,
                6527
            ],
            [
                6527,
                6587
            ],
            [
                6587,
                6617
            ],
            [
                6617,
                6794
            ],
            [
                6794,
                6881
            ],
            [
                6881,
                7011
            ],
            [
                7011,
                7107
            ],
            [
                7107,
                7263
            ],
            [
                7263,
                7403
            ],
            [
                7403,
                7492
            ],
            [
                7492,
                7670
            ],
            [
                7670,
                7791
            ],
            [
                7791,
                7884
            ],
            [
                7884,
                7944
            ],
            [
                7944,
                8055
            ],
            [
                8055,
                8215
            ],
            [
                8215,
                8287
            ],
            [
                8287,
                8323
            ],
            [
                8323,
                8370
            ],
            [
                8370,
                8461
            ],
            [
                8461,
                8969
            ],
            [
                8969,
                9105
            ],
            [
                9105,
                9190
            ],
            [
                9190,
                9393
            ],
            [
                9393,
                9538
            ],
            [
                9538,
                9591
            ],
            [
                9591,
                9970
            ],
            [
                9970,
                10178
            ],
            [
                10178,
                10213
            ],
            [
                10213,
                10295
            ],
            [
                10295,
                10441
            ],
            [
                10441,
                10574
            ],
            [
                10574,
                10759
            ],
            [
                10759,
                10973
            ],
            [
                10973,
                11158
            ],
            [
                11158,
                11176
            ],
            [
                11176,
                11219
            ],
            [
                11219,
                11302
            ],
            [
                11302,
                11424
            ],
            [
                11424,
                11582
            ],
            [
                11582,
                11748
            ],
            [
                11748,
                11793
            ],
            [
                11793,
                11851
            ],
            [
                11851,
                12000
            ],
            [
                12000,
                12151
            ],
            [
                12151,
                12266
            ],
            [
                12266,
                12331
            ],
            [
                12331,
                12450
            ],
            [
                12450,
                12585
            ],
            [
                12585,
                12699
            ],
            [
                12699,
                12767
            ],
            [
                12767,
                12991
            ],
            [
                12991,
                13098
            ],
            [
                13098,
                13334
            ],
            [
                13334,
                13413
            ],
            [
                13413,
                13554
            ],
            [
                13554,
                13596
            ],
            [
                13596,
                13656
            ],
            [
                13656,
                13715
            ],
            [
                13715,
                13742
            ],
            [
                13742,
                13789
            ],
            [
                13789,
                13820
            ],
            [
                13820,
                13851
            ],
            [
                13851,
                13902
            ],
            [
                13902,
                13963
            ],
            [
                13963,
                13996
            ],
            [
                13996,
                14030
            ],
            [
                14030,
                14134
            ],
            [
                14134,
                14231
            ],
            [
                14231,
                14299
            ],
            [
                14299,
                14342
            ],
            [
                14342,
                14356
            ],
            [
                14356,
                14405
            ],
            [
                14405,
                14457
            ],
            [
                14457,
                14478
            ],
            [
                14478,
                14499
            ],
            [
                14499,
                14533
            ],
            [
                14533,
                14607
            ],
            [
                14607,
                14637
            ],
            [
                14637,
                14669
            ],
            [
                14669,
                14733
            ],
            [
                14733,
                14781
            ],
            [
                14781,
                14886
            ],
            [
                14886,
                15015
            ],
            [
                15015,
                15053
            ],
            [
                15053,
                15067
            ],
            [
                15067,
                15091
            ],
            [
                15091,
                15147
            ],
            [
                15147,
                15188
            ],
            [
                15188,
                15349
            ],
            [
                15349,
                15385
            ],
            [
                15385,
                15482
            ],
            [
                15482,
                15610
            ],
            [
                15610,
                15780
            ],
            [
                15780,
                16112
            ],
            [
                16112,
                16410
            ],
            [
                16410,
                16503
            ],
            [
                16503,
                16567
            ],
            [
                16567,
                16607
            ],
            [
                16607,
                16741
            ],
            [
                16741,
                16775
            ],
            [
                16775,
                16883
            ],
            [
                16883,
                16923
            ],
            [
                16923,
                17030
            ],
            [
                17030,
                17202
            ],
            [
                17202,
                17388
            ],
            [
                17388,
                17473
            ],
            [
                17473,
                17527
            ],
            [
                17527,
                17581
            ],
            [
                17581,
                17622
            ],
            [
                17622,
                17927
            ],
            [
                17927,
                18080
            ]
        ]
    },
    "abridged": {
        "text": "In the new year Lady Glencora did not go to Lady Monk's house. When the time came for moving on to Monkshade, she was unwell, and Mr. Palliser went there alone. Lady Glencora remained at Matching with the two Miss Pallisers.\nWhen the tidings reached Monkshade that Lady Glencora was not to be expected, Burgo Fitzgerald was already there, armed with the money George Vavasor had been able to wrench out of the hands of Mr. Magruin.\n\"Burgo,\" said his aunt, Lady Monk, catching him one morning as he was about to go downstairs in his hunting-clothes, \"Burgo, your old flame, Lady Glencora, is not coming.\"\n\"Not coming!\" said Burgo, betraying too clearly by his look and voice that this was more important to him than it should have been.\n\"No. It can't matter much to you.\"\n\"But it does,\" said he, putting his hand up to his forehead, and leaning back against the wall as though in despair. \"It does matter. I am the most unfortunate devil that ever lived.\"\n\"Burgo! You must not speak in that way of a married woman. I begin to think it is better that she should not come.\" As another guest approached, she said, \"Come back into your room, Burgo.\"\nThere Lady Monk continued. \"If this annoys you, keep it to yourself! What will people say?\"\n\"How can I help what they say?\"\n\"I thought it best to tell you, for fear you should show surprise if you heard it in public. It is very weak in you to allow yourself to feel that sort of regard for a married woman. If you cannot control yourself I shall be afraid to let you meet her in Brook Street.\"\nBurgo looked for a moment at his aunt, and then turned towards the door. \"You can do as you please about that,\" said he; \"but you know what I have made up my mind to do.\"\n\"Nonsense, Burgo; I know nothing of the kind. Go downstairs to breakfast, and don't look like that when you get there.\"\nLady Monk was about fifty years of age, had been a great beauty, and was still good-looking, with a fine, tall figure. She was outwardly a handsome, upright, dame, of whom England might be proud - and of whom Sir Cosmo Monk was very proud.\nShe had come of the family of the Worcestershire Fitzgeralds, of whom it was said that there never was one who was not beautiful and worthless. Looking at Lady Monk you would hardly think that she could be a worthless woman; but her husband's fortune had suffered from her extravagance, she had quarrelled with her only son, and had married her daughter to the greatest fool in the peerage. She had striven very hard to bring about a marriage between her nephew Burgo and the great heiress Lady Glencora, and she was not a woman to pardon those who had foiled her.\nBurgo felt certain that his aunt was aware of his purpose, and could not forgive her for pretending not to know it. Had he been a man who ever reflected, he must have known that his aunt could only assist him if she was presumed to be ignorant of his intention. But Burgo never reflected.\nWhen Burgo reached the dining-room Sir Cosmo Monk, a fine bald-headed man of about sixty, was standing at the sideboard, cutting a huge game pie. He also was a man who did not reflect much, but who managed to keep straight in his course through the world without much reflection.\n\"Palliser is coming without her,\" he was saying in his loud clear voice. \"She's ill, she says.\"\n\"I'm sorry for it,\" said one man. \"She's the better fellow of the two.\"\n\"She has more go in her than Planty Pall,\" said another.\n\"Planty is no fool, I can tell you,\" said Sir Cosmo, coming to the table with his plate full of pie. \"He's about the most rising man we have.\" Sir Cosmo was the member of parliament for his county, and was a Liberal.\n\"Burgo, do you hear that Palliser is coming without his wife?\" said one man, who did not know Burgo's history.\n\"I have heard, and be d--d to him,\" said Burgo. There was suddenly silence in the room, and everyone attended assiduously to breakfast. Burgo sat back with his hands thrust into his breeches pockets, and the blackness of a thunder cloud upon his brow.\n\"Burgo, you had better eat your breakfast,\" said Sir Cosmo.\n\"I don't want any breakfast.\" He took, however, a morsel of toast, and went to the sideboard and filled himself a glass of cherry brandy.\n\"If you don't eat any breakfast the less of that you take the better,\" said Sir Cosmo.\n\"I'm all right now,\" said he, and coming back to the table, went through some form of making a meal with a roll and a cup of tea.\nThose who were present used afterwards to say that they would never forget that breakfast. There had been something, they declared, in the tone of Burgo's voice when he uttered his curse against Mr. Palliser, which struck them all with dread. And the expression on his face had been terrible.\nOn that day Burgo Fitzgerald startled everyone by the mad way in which he rode. He steered at gates and rails as though resolved to do himself and his uncle's horse a mischief. This was so apparent that some friend spoke to Sir Cosmo Monk about it.\n\"I can do nothing,\" said Sir Cosmo. \"No words will control him. He must run his chance till he becomes quiet.\" In the afternoon Burgo again rode as hard as he could; but he finished the day without accident, and as he went home, assured Sir Cosmo, in a voice which was almost cheery, that his mare Spinster was the best horse in the Monkshade stables. Burgo appeared at the dinner-table in a better humour than in the morning.\nOn the day appointed Mr. Palliser reached Monkshade. He could not have declined the invitation of so influential a man as Sir Cosmo, who had a little party of his own in the House, consisting of four or five other respectable and bald-headed country gentlemen. Therefore Mr. Palliser came to Monkshade, although Lady Glencora was unable to accompany him.\n\"We are so sorry,\" said Lady Monk. \"We have been looking forward to having Lady Glencora with us. I hope it is nothing serious.\"\nThen Mr. Palliser explained that Lady Glencora had unfortunately been foolish, and had gone out on a frosty night among the ruins at Matching, to show them to a friend. The friend had thoughtlessly allowed Lady Glencora to remain among the ruins till she had caught cold.\n\"How very wrong!\" said Lady Monk with considerable emphasis.\n\"It was very wrong,\" said Mr. Palliser. \"Glencora caught a cold which, unfortunately, became worse at my uncle's, and so I was obliged to take her home.\"\nLady Monk perceived that Mr. Palliser had in truth left his wife behind because he believed her to be ill, and not because he was afraid of Burgo Fitzgerald. But she was sure that the wife's absence was caused by fear of Burgo. She felt that Mr. Palliser had been deceived. As she was right in this, we must go back for a moment, to the events after Alice had left Matching.\nAlice had told Miss Palliser that steps ought to be taken to save Lady Glencora from the peril of a visit to Monkshade. Miss Palliser had agreed, and, when she left Alice, was determined to tell Mr. Palliser. But her courage failed her. She could not find words in which to warn the husband that his wife would not be safe in the company of her old lover. However, she managed to speak to Lady Glencora herself.\n\"Glencora,\" she said, \"you won't be angry, I hope, if I say a word to you?\"\n\"That depends on what the word is,\" said Lady Glencora. She had not done much to ingratiate herself with Mr. Palliser's cousins; not perhaps so much as she should have done. She had taught herself to think that they were hard, stiff, and too proud of bearing the name of Palliser. If they tried to teach her on any point, she did not easily forgive them.\n\"Well, the word shall be as little unpleasant as I can make it,\" said Miss Palliser. \"You are going to Monkshade, I believe, with Plantagenet.\"\n\"What of that?\"\n\"Dear Glencora, I think you had better not go. Do you not think so yourself?\"\n\"Who has been talking to you?\" said Lady Glencora, turning upon her very sharply. \"Plantagenet has spoken to you?\"\n\"Not a word,\" said Miss Palliser. \"But, dear Glencora, you should not go there; I mean it in all kindness and love - I do indeed.\" Saying this she offered her hand to Glencora, and Glencora took it.\n\"Perhaps you do,\" said she in a low voice.\n\"Indeed I do. The world is so hard and cruel in what it says.\"\n\"I do not care two straws for what the world says. But I do not want to go to Monkshade. Lady Monk was my friend once, but I do not care if I never see her again. I did not arrange this visit. It was Plantagenet.\"\n\"But he will not take you there if you say you do not wish it.\"\n\"I have said so, and he told me that I must go. I even told him why I thought it better to stay away. He told me that it was a silly folly which I must overcome, and that I should not be afraid of any man.\"\n\"Of course you are not afraid, but-\"\n\"I am afraid. That is just the truth. I am afraid; but what more can I do?\"\nThis was very terrible to Miss Palliser. There were not many more words between them, and we already know the result of the conversation. Lady Glencora became so ill from the effects of her imprudent lingering among the ruins that she was unable to go to Monkshade.\nMr. Palliser remained three days at Monkshade, and cemented his political alliance with Sir Cosmo in the same way as he had done with the Duke of St. Bungay. There was little said about politics; but they sat at dinner together, drank a glass of wine or two out of the same decanters, and dropped a chance word now and again about the next session of Parliament.\n\"I can't see that there's so much in him,\" said one young member of Parliament to Sir Cosmo, once Mr. Palliser had left.\n\"I rather think that there is,\" said the baronet. \"There's a good deal in him, I believe! I dare say he's not very bright, but a bright financier is the most dangerous man in the world. We've had enough of that already. Give me sound common sense!\" From which it became evident that Sir Cosmo was satisfied with Mr. Palliser.\nLady Monk took an opportunity of introducing Mr. Palliser to Burgo Fitzgerald; why, it is difficult to say, unless it was to make mischief between the men. Burgo scowled at him; but Mr. Palliser did not notice, and put out his hand so affably that Burgo was forced to take it.\n\"I'm sorry that we have not the pleasure of seeing Lady Glencora,\" said he.\n\"She is unfortunately indisposed,\" said Mr. Palliser.\n\"I am very sorry for it,\" said Burgo. Then he turned his back and walked away. His speech and manner were such that everyone around noticed, and felt an indefinable fear. But Mr. Palliser himself did not seem to notice anything; and nothing terrible came of it during his visit to Monkshade.",
        "paragraph_chars": [
            [
                0,
                225
            ],
            [
                225,
                432
            ],
            [
                432,
                604
            ],
            [
                604,
                736
            ],
            [
                736,
                771
            ],
            [
                771,
                955
            ],
            [
                955,
                1145
            ],
            [
                1145,
                1237
            ],
            [
                1237,
                1269
            ],
            [
                1269,
                1539
            ],
            [
                1539,
                1710
            ],
            [
                1710,
                1830
            ],
            [
                1830,
                2070
            ],
            [
                2070,
                2635
            ],
            [
                2635,
                2924
            ],
            [
                2924,
                3204
            ],
            [
                3204,
                3300
            ],
            [
                3300,
                3372
            ],
            [
                3372,
                3429
            ],
            [
                3429,
                3646
            ],
            [
                3646,
                3757
            ],
            [
                3757,
                4009
            ],
            [
                4009,
                4069
            ],
            [
                4069,
                4207
            ],
            [
                4207,
                4294
            ],
            [
                4294,
                4424
            ],
            [
                4424,
                4717
            ],
            [
                4717,
                4966
            ],
            [
                4966,
                5393
            ],
            [
                5393,
                5748
            ],
            [
                5748,
                5877
            ],
            [
                5877,
                6149
            ],
            [
                6149,
                6210
            ],
            [
                6210,
                6364
            ],
            [
                6364,
                6739
            ],
            [
                6739,
                7151
            ],
            [
                7151,
                7227
            ],
            [
                7227,
                7582
            ],
            [
                7582,
                7726
            ],
            [
                7726,
                7742
            ],
            [
                7742,
                7820
            ],
            [
                7820,
                7935
            ],
            [
                7935,
                8134
            ],
            [
                8134,
                8177
            ],
            [
                8177,
                8240
            ],
            [
                8240,
                8454
            ],
            [
                8454,
                8518
            ],
            [
                8518,
                8725
            ],
            [
                8725,
                8762
            ],
            [
                8762,
                8838
            ],
            [
                8838,
                9104
            ],
            [
                9104,
                9467
            ],
            [
                9467,
                9588
            ],
            [
                9588,
                9914
            ],
            [
                9914,
                10191
            ],
            [
                10191,
                10267
            ],
            [
                10267,
                10321
            ],
            [
                10321,
                10612
            ]
        ],
        "segment_chars": [
            [
                0,
                63
            ],
            [
                63,
                161
            ],
            [
                161,
                225
            ],
            [
                225,
                432
            ],
            [
                432,
                604
            ],
            [
                604,
                618
            ],
            [
                618,
                736
            ],
            [
                736,
                741
            ],
            [
                741,
                771
            ],
            [
                771,
                888
            ],
            [
                888,
                905
            ],
            [
                905,
                955
            ],
            [
                955,
                963
            ],
            [
                963,
                1014
            ],
            [
                1014,
                1071
            ],
            [
                1071,
                1145
            ],
            [
                1145,
                1172
            ],
            [
                1172,
                1214
            ],
            [
                1214,
                1237
            ],
            [
                1237,
                1269
            ],
            [
                1269,
                1362
            ],
            [
                1362,
                1452
            ],
            [
                1452,
                1539
            ],
            [
                1539,
                1612
            ],
            [
                1612,
                1710
            ],
            [
                1710,
                1756
            ],
            [
                1756,
                1830
            ],
            [
                1830,
                1949
            ],
            [
                1949,
                2070
            ],
            [
                2070,
                2214
            ],
            [
                2214,
                2461
            ],
            [
                2461,
                2635
            ],
            [
                2635,
                2751
            ],
            [
                2751,
                2897
            ],
            [
                2897,
                2924
            ],
            [
                2924,
                3070
            ],
            [
                3070,
                3204
            ],
            [
                3204,
                3277
            ],
            [
                3277,
                3300
            ],
            [
                3300,
                3334
            ],
            [
                3334,
                3372
            ],
            [
                3372,
                3429
            ],
            [
                3429,
                3530
            ],
            [
                3530,
                3572
            ],
            [
                3572,
                3646
            ],
            [
                3646,
                3709
            ],
            [
                3709,
                3757
            ],
            [
                3757,
                3805
            ],
            [
                3805,
                3893
            ],
            [
                3893,
                4009
            ],
            [
                4009,
                4069
            ],
            [
                4069,
                4099
            ],
            [
                4099,
                4207
            ],
            [
                4207,
                4294
            ],
            [
                4294,
                4424
            ],
            [
                4424,
                4515
            ],
            [
                4515,
                4667
            ],
            [
                4667,
                4717
            ],
            [
                4717,
                4797
            ],
            [
                4797,
                4894
            ],
            [
                4894,
                4966
            ],
            [
                4966,
                5002
            ],
            [
                5002,
                5030
            ],
            [
                5030,
                5077
            ],
            [
                5077,
                5318
            ],
            [
                5318,
                5393
            ],
            [
                5393,
                5446
            ],
            [
                5446,
                5654
            ],
            [
                5654,
                5748
            ],
            [
                5748,
                5783
            ],
            [
                5783,
                5846
            ],
            [
                5846,
                5877
            ],
            [
                5877,
                6046
            ],
            [
                6046,
                6149
            ],
            [
                6149,
                6167
            ],
            [
                6167,
                6210
            ],
            [
                6210,
                6250
            ],
            [
                6250,
                6364
            ],
            [
                6364,
                6522
            ],
            [
                6522,
                6592
            ],
            [
                6592,
                6638
            ],
            [
                6638,
                6739
            ],
            [
                6739,
                6859
            ],
            [
                6859,
                6948
            ],
            [
                6948,
                6976
            ],
            [
                6976,
                7095
            ],
            [
                7095,
                7151
            ],
            [
                7151,
                7227
            ],
            [
                7227,
                7283
            ],
            [
                7283,
                7401
            ],
            [
                7401,
                7508
            ],
            [
                7508,
                7582
            ],
            [
                7582,
                7667
            ],
            [
                7667,
                7726
            ],
            [
                7726,
                7742
            ],
            [
                7742,
                7789
            ],
            [
                7789,
                7820
            ],
            [
                7820,
                7851
            ],
            [
                7851,
                7902
            ],
            [
                7902,
                7935
            ],
            [
                7935,
                7969
            ],
            [
                7969,
                8066
            ],
            [
                8066,
                8134
            ],
            [
                8134,
                8177
            ],
            [
                8177,
                8191
            ],
            [
                8191,
                8240
            ],
            [
                8240,
                8291
            ],
            [
                8291,
                8329
            ],
            [
                8329,
                8403
            ],
            [
                8403,
                8433
            ],
            [
                8433,
                8454
            ],
            [
                8454,
                8518
            ],
            [
                8518,
                8566
            ],
            [
                8566,
                8620
            ],
            [
                8620,
                8725
            ],
            [
                8725,
                8762
            ],
            [
                8762,
                8776
            ],
            [
                8776,
                8800
            ],
            [
                8800,
                8838
            ],
            [
                8838,
                8879
            ],
            [
                8879,
                8976
            ],
            [
                8976,
                9104
            ],
            [
                9104,
                9262
            ],
            [
                9262,
                9467
            ],
            [
                9467,
                9588
            ],
            [
                9588,
                9638
            ],
            [
                9638,
                9678
            ],
            [
                9678,
                9774
            ],
            [
                9774,
                9808
            ],
            [
                9808,
                9837
            ],
            [
                9837,
                9914
            ],
            [
                9914,
                10070
            ],
            [
                10070,
                10191
            ],
            [
                10191,
                10267
            ],
            [
                10267,
                10321
            ],
            [
                10321,
                10359
            ],
            [
                10359,
                10400
            ],
            [
                10400,
                10492
            ],
            [
                10492,
                10612
            ]
        ],
        "overlap_chars": [
            [
                3,
                15
            ],
            [
                16,
                29
            ],
            [
                34,
                37
            ],
            [
                44,
                63
            ],
            [
                63,
                117
            ],
            [
                124,
                147
            ],
            [
                154,
                161
            ],
            [
                161,
                174
            ],
            [
                175,
                186
            ],
            [
                187,
                195
            ],
            [
                196,
                225
            ],
            [
                225,
                349
            ],
            [
                360,
                431
            ],
            [
                432,
                455
            ],
            [
                467,
                491
            ],
            [
                492,
                513
            ],
            [
                525,
                527
            ],
            [
                528,
                531
            ],
            [
                532,
                539
            ],
            [
                539,
                540
            ],
            [
                547,
                601
            ],
            [
                601,
                604
            ],
            [
                604,
                605
            ],
            [
                605,
                618
            ],
            [
                618,
                639
            ],
            [
                640,
                651
            ],
            [
                652,
                667
            ],
            [
                668,
                673
            ],
            [
                674,
                683
            ],
            [
                684,
                687
            ],
            [
                688,
                692
            ],
            [
                703,
                709
            ],
            [
                710,
                735
            ],
            [
                736,
                739
            ],
            [
                739,
                741
            ],
            [
                741,
                749
            ],
            [
                750,
                756
            ],
            [
                762,
                768
            ],
            [
                768,
                771
            ],
            [
                771,
                775
            ],
            [
                776,
                778
            ],
            [
                783,
                865
            ],
            [
                866,
                888
            ],
            [
                888,
                891
            ],
            [
                897,
                903
            ],
            [
                903,
                905
            ],
            [
                905,
                955
            ],
            [
                955,
                956
            ],
            [
                956,
                961
            ],
            [
                961,
                963
            ],
            [
                963,
                1014
            ],
            [
                1014,
                1071
            ],
            [
                1071,
                1073
            ],
            [
                1074,
                1081
            ],
            [
                1098,
                1099
            ],
            [
                1104,
                1108
            ],
            [
                1108,
                1109
            ],
            [
                1110,
                1142
            ],
            [
                1151,
                1160
            ],
            [
                1170,
                1172
            ],
            [
                1172,
                1180
            ],
            [
                1181,
                1186
            ],
            [
                1188,
                1192
            ],
            [
                1193,
                1214
            ],
            [
                1214,
                1237
            ],
            [
                1237,
                1269
            ],
            [
                1270,
                1325
            ],
            [
                1326,
                1347
            ],
            [
                1348,
                1350
            ],
            [
                1351,
                1362
            ],
            [
                1362,
                1452
            ],
            [
                1452,
                1465
            ],
            [
                1474,
                1539
            ],
            [
                1539,
                1564
            ],
            [
                1568,
                1576
            ],
            [
                1576,
                1593
            ],
            [
                1594,
                1612
            ],
            [
                1612,
                1673
            ],
            [
                1674,
                1710
            ],
            [
                1710,
                1756
            ],
            [
                1756,
                1758
            ],
            [
                1770,
                1817
            ],
            [
                1822,
                1830
            ],
            [
                1830,
                1843
            ],
            [
                1844,
                1869
            ],
            [
                1870,
                1898
            ],
            [
                1899,
                1908
            ],
            [
                1909,
                1913
            ],
            [
                1921,
                1922
            ],
            [
                1928,
                1929
            ],
            [
                1930,
                1934
            ],
            [
                1936,
                1940
            ],
            [
                1941,
                1947
            ],
            [
                1947,
                1949
            ],
            [
                1949,
                1956
            ],
            [
                1957,
                1964
            ],
            [
                1964,
                1966
            ],
            [
                1967,
                1968
            ],
            [
                1969,
                1993
            ],
            [
                1994,
                2001
            ],
            [
                2002,
                2024
            ],
            [
                2027,
                2069
            ],
            [
                2070,
                2142
            ],
            [
                2147,
                2214
            ],
            [
                2214,
                2298
            ],
            [
                2299,
                2312
            ],
            [
                2313,
                2356
            ],
            [
                2357,
                2402
            ],
            [
                2411,
                2461
            ],
            [
                2461,
                2531
            ],
            [
                2538,
                2559
            ],
            [
                2573,
                2578
            ],
            [
                2583,
                2586
            ],
            [
                2587,
                2590
            ],
            [
                2591,
                2598
            ],
            [
                2599,
                2635
            ],
            [
                2635,
                2645
            ],
            [
                2646,
                2734
            ],
            [
                2739,
                2741
            ],
            [
                2747,
                2751
            ],
            [
                2751,
                2787
            ],
            [
                2789,
                2812
            ],
            [
                2813,
                2843
            ],
            [
                2847,
                2850
            ],
            [
                2855,
                2897
            ],
            [
                2897,
                2923
            ],
            [
                2924,
                2958
            ],
            [
                2959,
                2993
            ],
            [
                2994,
                3026
            ],
            [
                3027,
                3070
            ],
            [
                3070,
                3072
            ],
            [
                3073,
                3077
            ],
            [
                3078,
                3087
            ],
            [
                3088,
                3121
            ],
            [
                3130,
                3203
            ],
            [
                3204,
                3240
            ],
            [
                3252,
                3275
            ],
            [
                3275,
                3277
            ],
            [
                3277,
                3300
            ],
            [
                3300,
                3334
            ],
            [
                3334,
                3340
            ],
            [
                3341,
                3372
            ],
            [
                3372,
                3380
            ],
            [
                3381,
                3429
            ],
            [
                3429,
                3530
            ],
            [
                3530,
                3531
            ],
            [
                3531,
                3572
            ],
            [
                3572,
                3596
            ],
            [
                3611,
                3645
            ],
            [
                3646,
                3709
            ],
            [
                3709,
                3722
            ],
            [
                3723,
                3726
            ],
            [
                3755,
                3756
            ],
            [
                3757,
                3771
            ],
            [
                3772,
                3780
            ],
            [
                3780,
                3782
            ],
            [
                3782,
                3805
            ],
            [
                3805,
                3823
            ],
            [
                3824,
                3857
            ],
            [
                3867,
                3881
            ],
            [
                3882,
                3893
            ],
            [
                3893,
                3898
            ],
            [
                3899,
                3907
            ],
            [
                3908,
                3912
            ],
            [
                3913,
                3922
            ],
            [
                3923,
                3929
            ],
            [
                3930,
                3956
            ],
            [
                3961,
                3974
            ],
            [
                3975,
                4009
            ],
            [
                4009,
                4069
            ],
            [
                4069,
                4099
            ],
            [
                4099,
                4118
            ],
            [
                4119,
                4125
            ],
            [
                4126,
                4139
            ],
            [
                4140,
                4144
            ],
            [
                4145,
                4172
            ],
            [
                4173,
                4207
            ],
            [
                4207,
                4294
            ],
            [
                4294,
                4424
            ],
            [
                4430,
                4438
            ],
            [
                4439,
                4479
            ],
            [
                4486,
                4515
            ],
            [
                4515,
                4638
            ],
            [
                4639,
                4667
            ],
            [
                4671,
                4674
            ],
            [
                4689,
                4697
            ],
            [
                4698,
                4701
            ],
            [
                4702,
                4706
            ],
            [
                4707,
                4715
            ],
            [
                4715,
                4716
            ],
            [
                4717,
                4754
            ],
            [
                4764,
                4797
            ],
            [
                4808,
                4875
            ],
            [
                4876,
                4881
            ],
            [
                4882,
                4894
            ],
            [
                4894,
                4965
            ],
            [
                4966,
                5002
            ],
            [
                5002,
                5003
            ],
            [
                5003,
                5005
            ],
            [
                5006,
                5024
            ],
            [
                5028,
                5030
            ],
            [
                5030,
                5077
            ],
            [
                5077,
                5093
            ],
            [
                5094,
                5130
            ],
            [
                5130,
                5131
            ],
            [
                5132,
                5135
            ],
            [
                5148,
                5276
            ],
            [
                5277,
                5285
            ],
            [
                5286,
                5291
            ],
            [
                5292,
                5318
            ],
            [
                5318,
                5323
            ],
            [
                5324,
                5376
            ],
            [
                5377,
                5393
            ],
            [
                5393,
                5446
            ],
            [
                5446,
                5448
            ],
            [
                5455,
                5463
            ],
            [
                5473,
                5524
            ],
            [
                5524,
                5529
            ],
            [
                5530,
                5618
            ],
            [
                5619,
                5622
            ],
            [
                5623,
                5627
            ],
            [
                5635,
                5652
            ],
            [
                5652,
                5654
            ],
            [
                5664,
                5748
            ],
            [
                5748,
                5783
            ],
            [
                5783,
                5844
            ],
            [
                5846,
                5874
            ],
            [
                5877,
                5894
            ],
            [
                5905,
                5954
            ],
            [
                5960,
                5972
            ],
            [
                5973,
                5975
            ],
            [
                5978,
                5983
            ],
            [
                5991,
                6032
            ],
            [
                6033,
                6046
            ],
            [
                6046,
                6074
            ],
            [
                6075,
                6149
            ],
            [
                6149,
                6167
            ],
            [
                6167,
                6210
            ],
            [
                6210,
                6248
            ],
            [
                6248,
                6250
            ],
            [
                6250,
                6251
            ],
            [
                6260,
                6295
            ],
            [
                6303,
                6364
            ],
            [
                6364,
                6522
            ],
            [
                6539,
                6584
            ],
            [
                6590,
                6592
            ],
            [
                6592,
                6595
            ],
            [
                6601,
                6638
            ],
            [
                6638,
                6662
            ],
            [
                6664,
                6693
            ],
            [
                6708,
                6719
            ],
            [
                6720,
                6728
            ],
            [
                6729,
                6737
            ],
            [
                6737,
                6739
            ],
            [
                6739,
                6796
            ],
            [
                6797,
                6859
            ],
            [
                6859,
                6876
            ],
            [
                6883,
                6946
            ],
            [
                6946,
                6948
            ],
            [
                6948,
                6951
            ],
            [
                6952,
                6976
            ],
            [
                6976,
                7095
            ],
            [
                7102,
                7103
            ],
            [
                7104,
                7107
            ],
            [
                7128,
                7149
            ],
            [
                7149,
                7151
            ],
            [
                7151,
                7171
            ],
            [
                7171,
                7227
            ],
            [
                7227,
                7240
            ],
            [
                7244,
                7283
            ],
            [
                7283,
                7286
            ],
            [
                7287,
                7355
            ],
            [
                7356,
                7399
            ],
            [
                7399,
                7401
            ],
            [
                7401,
                7508
            ],
            [
                7522,
                7534
            ],
            [
                7535,
                7537
            ],
            [
                7547,
                7548
            ],
            [
                7557,
                7560
            ],
            [
                7576,
                7580
            ],
            [
                7580,
                7581
            ],
            [
                7582,
                7588
            ],
            [
                7589,
                7665
            ],
            [
                7665,
                7666
            ],
            [
                7667,
                7726
            ],
            [
                7726,
                7727
            ],
            [
                7727,
                7742
            ],
            [
                7742,
                7789
            ],
            [
                7789,
                7820
            ],
            [
                7820,
                7851
            ],
            [
                7851,
                7901
            ],
            [
                7902,
                7935
            ],
            [
                7935,
                7969
            ],
            [
                7970,
                8014
            ],
            [
                8015,
                8049
            ],
            [
                8052,
                8066
            ],
            [
                8066,
                8134
            ],
            [
                8134,
                8177
            ],
            [
                8177,
                8191
            ],
            [
                8191,
                8240
            ],
            [
                8240,
                8289
            ],
            [
                8295,
                8329
            ],
            [
                8329,
                8403
            ],
            [
                8403,
                8433
            ],
            [
                8433,
                8451
            ],
            [
                8451,
                8454
            ],
            [
                8454,
                8518
            ],
            [
                8518,
                8566
            ],
            [
                8566,
                8567
            ],
            [
                8568,
                8572
            ],
            [
                8578,
                8608
            ],
            [
                8614,
                8620
            ],
            [
                8620,
                8630
            ],
            [
                8631,
                8669
            ],
            [
                8678,
                8688
            ],
            [
                8698,
                8701
            ],
            [
                8702,
                8725
            ],
            [
                8725,
                8759
            ],
            [
                8762,
                8776
            ],
            [
                8776,
                8800
            ],
            [
                8800,
                8812
            ],
            [
                8813,
                8821
            ],
            [
                8822,
                8826
            ],
            [
                8827,
                8835
            ],
            [
                8835,
                8838
            ],
            [
                8838,
                8879
            ],
            [
                8879,
                8976
            ],
            [
                8976,
                9104
            ],
            [
                9104,
                9201
            ],
            [
                9202,
                9227
            ],
            [
                9228,
                9262
            ],
            [
                9262,
                9278
            ],
            [
                9279,
                9298
            ],
            [
                9298,
                9331
            ],
            [
                9331,
                9466
            ],
            [
                9467,
                9558
            ],
            [
                9586,
                9588
            ],
            [
                9588,
                9617
            ],
            [
                9617,
                9638
            ],
            [
                9638,
                9678
            ],
            [
                9678,
                9714
            ],
            [
                9715,
                9774
            ],
            [
                9774,
                9808
            ],
            [
                9808,
                9834
            ],
            [
                9837,
                9899
            ],
            [
                9912,
                9914
            ],
            [
                9914,
                9931
            ],
            [
                9959,
                9992
            ],
            [
                9998,
                10028
            ],
            [
                10032,
                10035
            ],
            [
                10036,
                10070
            ],
            [
                10070,
                10123
            ],
            [
                10123,
                10145
            ],
            [
                10146,
                10148
            ],
            [
                10149,
                10156
            ],
            [
                10162,
                10189
            ],
            [
                10189,
                10190
            ],
            [
                10191,
                10255
            ],
            [
                10255,
                10267
            ],
            [
                10267,
                10321
            ],
            [
                10321,
                10326
            ],
            [
                10327,
                10331
            ],
            [
                10332,
                10357
            ],
            [
                10359,
                10400
            ],
            [
                10411,
                10414
            ],
            [
                10415,
                10421
            ],
            [
                10427,
                10431
            ],
            [
                10432,
                10436
            ],
            [
                10446,
                10452
            ],
            [
                10460,
                10465
            ],
            [
                10466,
                10470
            ],
            [
                10479,
                10481
            ],
            [
                10486,
                10490
            ],
            [
                10490,
                10492
            ],
            [
                10492,
                10548
            ],
            [
                10548,
                10570
            ],
            [
                10576,
                10588
            ],
            [
                10589,
                10592
            ],
            [
                10593,
                10598
            ],
            [
                10599,
                10612
            ]
        ],
        "row_chars": [
            [
                0,
                63
            ],
            [
                63,
                161
            ],
            [
                161,
                225
            ],
            [
                225,
                432
            ],
            [
                432,
                604
            ],
            [
                604,
                618
            ],
            [
                618,
                736
            ],
            [
                736,
                736
            ],
            [
                736,
                741
            ],
            [
                741,
                771
            ],
            [
                771,
                888
            ],
            [
                888,
                905
            ],
            [
                905,
                955
            ],
            [
                955,
                963
            ],
            [
                963,
                1014
            ],
            [
                1014,
                1071
            ],
            [
                1071,
                1172
            ],
            [
                1172,
                1214
            ],
            [
                1214,
                1237
            ],
            [
                1237,
                1269
            ],
            [
                1269,
                1269
            ],
            [
                1269,
                1362
            ],
            [
                1362,
                1452
            ],
            [
                1452,
                1539
            ],
            [
                1539,
                1612
            ],
            [
                1612,
                1710
            ],
            [
                1710,
                1756
            ],
            [
                1756,
                1830
            ],
            [
                1830,
                1949
            ],
            [
                1949,
                1949
            ],
            [
                1949,
                2070
            ],
            [
                2070,
                2214
            ],
            [
                2214,
                2461
            ],
            [
                2461,
                2635
            ],
            [
                2635,
                2751
            ],
            [
                2751,
                2751
            ],
            [
                2751,
                2897
            ],
            [
                2897,
                2924
            ],
            [
                2924,
                2924
            ],
            [
                2924,
                3070
            ],
            [
                3070,
                3204
            ],
            [
                3204,
                3277
            ],
            [
                3277,
                3300
            ],
            [
                3300,
                3334
            ],
            [
                3334,
                3372
            ],
            [
                3372,
                3429
            ],
            [
                3429,
                3530
            ],
            [
                3530,
                3572
            ],
            [
                3572,
                3646
            ],
            [
                3646,
                3646
            ],
            [
                3646,
                3709
            ],
            [
                3709,
                3757
            ],
            [
                3757,
                3757
            ],
            [
                3757,
                3805
            ],
            [
                3805,
                3893
            ],
            [
                3893,
                3893
            ],
            [
                3893,
                4009
            ],
            [
                4009,
                4009
            ],
            [
                4009,
                4069
            ],
            [
                4069,
                4099
            ],
            [
                4099,
                4207
            ],
            [
                4207,
                4294
            ],
            [
                4294,
                4424
            ],
            [
                4424,
                4515
            ],
            [
                4515,
                4667
            ],
            [
                4667,
                4717
            ],
            [
                4717,
                4717
            ],
            [
                4717,
                4717
            ],
            [
                4717,
                4717
            ],
            [
                4717,
                4797
            ],
            [
                4797,
                4797
            ],
            [
                4797,
                4797
            ],
            [
                4797,
                4894
            ],
            [
                4894,
                4966
            ],
            [
                4966,
                5002
            ],
            [
                5002,
                5030
            ],
            [
                5030,
                5077
            ],
            [
                5077,
                5318
            ],
            [
                5318,
                5318
            ],
            [
                5318,
                5318
            ],
            [
                5318,
                5318
            ],
            [
                5318,
                5393
            ],
            [
                5393,
                5446
            ],
            [
                5446,
                5654
            ],
            [
                5654,
                5748
            ],
            [
                5748,
                5783
            ],
            [
                5783,
                5846
            ],
            [
                5846,
                5846
            ],
            [
                5846,
                5846
            ],
            [
                5846,
                5877
            ],
            [
                5877,
                6046
            ],
            [
                6046,
                6149
            ],
            [
                6149,
                6167
            ],
            [
                6167,
                6210
            ],
            [
                6210,
                6250
            ],
            [
                6250,
                6364
            ],
            [
                6364,
                6522
            ],
            [
                6522,
                6592
            ],
            [
                6592,
                6592
            ],
            [
                6592,
                6638
            ],
            [
                6638,
                6739
            ],
            [
                6739,
                6859
            ],
            [
                6859,
                6948
            ],
            [
                6948,
                6976
            ],
            [
                6976,
                7095
            ],
            [
                7095,
                7151
            ],
            [
                7151,
                7227
            ],
            [
                7227,
                7283
            ],
            [
                7283,
                7401
            ],
            [
                7401,
                7508
            ],
            [
                7508,
                7582
            ],
            [
                7582,
                7582
            ],
            [
                7582,
                7667
            ],
            [
                7667,
                7667
            ],
            [
                7667,
                7667
            ],
            [
                7667,
                7726
            ],
            [
                7726,
                7742
            ],
            [
                7742,
                7789
            ],
            [
                7789,
                7820
            ],
            [
                7820,
                7851
            ],
            [
                7851,
                7902
            ],
            [
                7902,
                7902
            ],
            [
                7902,
                7935
            ],
            [
                7935,
                7969
            ],
            [
                7969,
                7969
            ],
            [
                7969,
                8066
            ],
            [
                8066,
                8134
            ],
            [
                8134,
                8177
            ],
            [
                8177,
                8191
            ],
            [
                8191,
                8240
            ],
            [
                8240,
                8291
            ],
            [
                8291,
                8291
            ],
            [
                8291,
                8291
            ],
            [
                8291,
                8329
            ],
            [
                8329,
                8403
            ],
            [
                8403,
                8433
            ],
            [
                8433,
                8454
            ],
            [
                8454,
                8518
            ],
            [
                8518,
                8566
            ],
            [
                8566,
                8620
            ],
            [
                8620,
                8725
            ],
            [
                8725,
                8762
            ],
            [
                8762,
                8776
            ],
            [
                8776,
                8800
            ],
            [
                8800,
                8838
            ],
            [
                8838,
                8879
            ],
            [
                8879,
                8879
            ],
            [
                8879,
                8879
            ],
            [
                8879,
                8976
            ],
            [
                8976,
                9104
            ],
            [
                9104,
                9262
            ],
            [
                9262,
                9467
            ],
            [
                9467,
                9467
            ],
            [
                9467,
                9588
            ],
            [
                9588,
                9638
            ],
            [
                9638,
                9678
            ],
            [
                9678,
                9774
            ],
            [
                9774,
                9808
            ],
            [
                9808,
                9837
            ],
            [
                9837,
                9837
            ],
            [
                9837,
                9914
            ],
            [
                9914,
                10070
            ],
            [
                10070,
                10191
            ],
            [
                10191,
                10267
            ],
            [
                10267,
                10321
            ],
            [
                10321,
                10359
            ],
            [
                10359,
                10400
            ],
            [
                10400,
                10492
            ],
            [
                10492,
                10612
            ]
        ]
    }
}