{
    "original": {
        "text": "Early in that conversation which Mr. Vavasor had with his daughter, and which was recorded a few pages back, he implored her to pause a while before she informed Mr. Grey of her engagement with her cousin. Nothing, however, on that point had been settled between them. Mr. Vavasor had wished her to say that she would not write till he should have assented to her doing so. She had declined to bind herself in this way, and then they had gone off to other things;--to George Vavasor's character and the disposition of her money. Alice, however, had felt herself bound not to write to Mr. Grey quite at once. Indeed, when her cousin left her she had no appetite for writing such a letter as hers was to be. A day or two passed by her in this way, and nothing more was said by her or her father. It was now the middle of January, and the reader may remember that Mr. Grey had promised that he would come to her in London in that month, as soon as he should know that she had returned from Westmoreland. She must at any rate do something to prevent that visit. Mr. Grey would not come without giving her notice. She knew enough of the habits of the man to be sure of that. But she desired that her letter to him should be in time to prevent his to her; so when those few days were gone, she sat down to write without speaking to her father again upon the subject.\nIt was a terrible job;--perhaps the most difficult of all the difficult tasks which her adverse fate had imposed upon her. She found when she did attempt it, that she could have done it better if she had done it at the moment when she was writing the other letter to her cousin George. Then Kate had been near her, and she had been comforted by Kate's affectionate happiness. She had been strengthened at that moment by a feeling that she was doing the best in her power, if not for herself, at any rate for others. All that comfort and all that strength had left her now. The atmosphere of the fells had buoyed her up, and now the thick air of London depressed her. She sat for hours with the pen in her hand, and could not write the letter. She let a day go by and a night, and still it was not written. She hardly knew herself in her unnatural weakness. As the mental photographs of the two men forced themselves upon her, she could not force herself to forget those words--\"Look here, upon this picture--and on this.\" How was it that she now knew how great was the difference between the two men, how immense the pre-eminence of him whom she had rejected;--and that she had not before been able to see this on any of those many previous occasions on which she had compared the two together? As she thought of her cousin George's face when he left her room a few days since, and remembered Mr. Grey's countenance when last he held her hand at Cheltenham, the quiet dignity of his beauty which would submit to show no consciousness of injury, she could not but tell herself that when Paradise had been opened to her, she had declared herself to be fit only for Pandemonium. In that was her chief misery; that now,--now when it was too late,--she could look at it aright.\nBut the letter must be written, and on the second day she declared to herself that she would not rise from her chair till it was done. The letter was written on that day and was posted. I will now ask the reader to go down with me to Nethercoats that we may be present with John Grey when he received it. He was sitting at breakfast in his study there, and opposite to him, lounging in an arm-chair, with a _Quarterly_ in his hand, was the most intimate of his friends, Frank Seward, a fellow of the college to which they had both belonged. Mr. Seward was a clergyman, and the tutor of his college, and a man who worked very hard at Cambridge. In the days of his leisure he spent much of his time at Nethercoats, and he was the only man to whom Grey had told anything of his love for Alice and of his disappointment. Even to Seward he had not told the whole story. He had at first informed his friend that he was engaged to be married, and as he had told this as no secret,--having even said that he hated secrets on such matters,--the engagement had been mentioned in the common room of their college, and men at Cambridge knew that Mr. Grey was going to take to himself a wife. Then Mr. Seward had been told that trouble had come, and that it was not improbable that there would be no such marriage. Even when saying this Mr. Grey told none of the particulars, though he owned to his friend that a heavy blow had struck him. His intimacy with Seward was of that thorough kind which is engendered only out of such young and lasting friendship as had existed between them; but even to such a friend as this Mr. Grey could not open his whole heart. It was only to a friend who should also be his wife that he could do that,--as he himself thoroughly understood. He had felt that such a friend was wanting to him, and he had made the attempt.\n\"Don't speak of this as yet,\" he had said to Mr. Seward. \"Of course when the matter is settled, those few people who know me must know it. But perhaps there may be a doubt as yet, and as long as there is a doubt, it is better that it should not be discussed.\"\nHe had said no more than this,--had imputed no blame to Alice,--had told none of the circumstances; but Seward had known that the girl had jilted his friend, and had made up his mind that she must be heartless and false. He had known also that his friend would never look for any other such companion for his home.\nLetters were brought to each of them on this morning, and Seward's attention was of course occupied by those which he received. Grey, as soon as the envelopes had touched his hand, became aware that one of them was from Alice, and this he at once opened. He did it very calmly, but without any of that bravado of indifference with which George Vavasor had received Alice's letter from Westmoreland. \"It is right that I should tell you at once,\" said Alice, rushing into the middle of her subject without even the formality of the customary address--\"It is right that I should tell you at once that--.\" Oh, the difficulty which she had encountered when her words had carried her as far as this!--\"that my cousin, George Vavasor, has repeated to me his offer of marriage, and that I have accepted it. I tell you, chiefly in order that I may save you from the trouble which you purposed to take when I last saw you at Cheltenham. I will not tell you any of the circumstances of this engagement, because I have no right to presume that you will care to hear them. I hardly dare to ask you to believe of me that in all that I have done, I have endeavoured to act with truth and honesty. That I have been very ignorant, foolish,--what you will that is bad, I know well; otherwise there could not have been so much in the last few years of my life on which I am utterly ashamed to look back. For the injury that I have done you, I can only express deep contrition. I do not dare to ask you to forgive me.--ALICE VAVASOR.\" She had tormented herself in writing this,--had so nearly driven herself distracted with attempts which she had destroyed, that she would not even read once to herself these last words. \"He'll know it, and that is all that is necessary,\" she said to herself as she sent the letter away from her.\nMr. Grey read it twice over, leaving the other letters unnoticed on the table by his tea-cup. He read it twice over, and the work of reading it was one to him of intense agony. Hitherto he had fed himself with hope. That Alice should have been brought to think of her engagement with him in a spirit of doubt and with a mind so troubled, that she had been inclined to attempt an escape from it, had been very grievous to him; but it had been in his mind a fantasy, a morbid fear of himself, which might be cured by time. He, at any rate, would give all his energies towards achieving such a cure. There had been one thing, however, which he most feared;--which he had chiefly feared, though he had forbidden himself to think that it could be probable, and this thing had now happened.\nHe had ever disliked and feared George Vavasor;--not from any effect which the man had upon himself, for as we know his acquaintance with Vavasor was of the slightest;--but he had feared and disliked his influence upon Alice. He had also feared the influence of her cousin Kate. To have cautioned Alice against her cousins would have been to him impossible. It was not his nature to express suspicion to one he loved. Is the tone of that letter remembered in which he had answered Alice when she informed him that her cousin George was to go with Kate and her to Switzerland? He had written, with a pleasant joke, words which Alice had been able to read with some little feeling of triumph to her two friends. He had not so written because he liked what he knew of the man. He disliked all that he knew of him. But it had not been possible for him to show that he distrusted the prudence of her, whom, as his future wife, he was prepared to trust in all things.\nI have said that he read Alice's letter with an agony of sorrow; as he sat with it in his hand he suffered as, probably, he had never suffered before. But there was nothing in his countenance to show that he was in pain. Seward had received some long epistle, crossed from end to end,--indicative, I should say, of a not far distant termination to that college tutorship,--and was reading it with placid contentment. It did not occur to him to look across at Grey, but had he done so, I doubt whether he would have seen anything to attract his attention. But Grey, though he was wounded, would not allow himself to be dismayed. There was less hope now than before, but there might still be hope;--hope for her, even though there might be none for him. Tidings had reached his ears also as to George Vavasor, which had taught him to believe that the man was needy, reckless, and on the brink of ruin. Such a marriage to Alice Vavasor would be altogether ruinous. Whatever might be his own ultimate fate he would still seek to save her from that. Her cousin, doubtless, wanted her money. Might it not be possible that he would be satisfied with her money, and that thus the woman might be saved?\n\"Seward,\" he said at last, addressing his friend, who had not yet come to the end of the last crossed page.\n\"Is there anything wrong?\" said Seward.\n\"Well;--yes; there is something a little wrong. I fear I must leave you, and go up to town to-day.\"\n\"Nobody ill, I hope?\"\n\"No;--nobody is ill. But I must go up to London. Mrs. Bole will take care of you, and you must not be angry with me for leaving you.\"\nSeward assured him that he would not be in the least angry, and that he was thoroughly conversant with the capabilities and good intentions of Mrs. Bole the housekeeper; but added, that as he was so near his own college, he would of course go back to Cambridge. He longed to say some word as to the purpose of Grey's threatened journey; to make some inquiry as to this new trouble; but he knew that Grey was a man who did not well bear close inquiries, and he was silent.\n\"Why not stay here?\" said Grey, after a minute's pause. \"I wish you would, old fellow; I do, indeed.\" There was a tone of special affection in his voice which struck Seward at once. \"If I can be of the slightest service or comfort to you, I will of course.\"\nGrey again sat silent for a little while. \"I wish you would; I do, indeed.\"\n\"Then I will.\" And again there was a pause.\n\"I have got a letter here from--Miss Vavasor,\" said Grey.\n\"May I hope that--\"\n\"No;--it does not bring good news to me. I do not know that I can tell it you all. I would if I could, but the whole story is one not to be told in a hurry. I should leave false impressions. There are things which a man cannot tell.\"\n\"Indeed there are,\" said Seward.\n\"I wish with all my heart that you knew it all as I know it; but that is impossible. There are things which happen in a day which it would take a lifetime to explain.\" Then there was another pause. \"I have heard bad news this morning, and I must go up to London at once. I shall go into Ely so as to be there by twelve; and if you will, you shall drive me over. I may be back in a day; certainly in less than a week; but it will be a comfort to me to know that I shall find you here.\"\nThe matter was so arranged, and at eleven they started. During the first two miles not a word was spoken between them. \"Seward,\" Grey said at last, \"if I fail in what I am going to attempt, it is probable that you will never hear Alice Vavasor's name mentioned by me again; but I want you always to bear this in mind;--that at no moment has my opinion of her ever been changed, nor must you in such case imagine from my silence that it has changed. Do you understand me?\"\n\"I think I do.\"\n\"To my thinking she is the finest of God's creatures that I have known. It may be that in her future life she will be severed from me altogether; but I shall not, therefore, think the less well of her; and I wish that you, as my friend, should know that I so esteem her, even though her name should never be mentioned between us.\" Seward, in some few words, assured him that it should be so, and then they finished their journey in silence.\nFrom the station at Ely, Grey sent a message by the wires up to John Vavasor, saying that he would call on him that afternoon at his office in Chancery Lane. The chances were always much against finding Mr. Vavasor at his office; but on this occasion the telegram did reach him there, and he remained till the unaccustomed hour of half past four to meet the man who was to have been his son-in-law.\n\"Have you heard from her?\" he asked as soon as Grey entered the dingy little room, not in Chancery Lane, but in its neighbourhood, which was allocated to him for his signing purposes.\n\"Yes,\"--said Grey; \"she has written to me.\"\n\"And told you about her cousin George. I tried to hinder her from writing, but she is very wilful.\"\n\"Why should you have hindered her? If the thing was to be told, it is better that it should be done at once.\"\n\"But I hoped that there might be an escape. I don't know what you think of all this, Grey, but to me it is the bitterest misfortune that I have known. And I've had some bitter things, too,\" he added,--thinking of that period of his life, when the work of which he was ashamed was first ordained as his future task.\n\"What is the escape that you hoped?\" asked Grey.\n\"I hardly know. The whole thing seems to me to be so mad, that I partly trusted that she would see the madness of it. I am not sure whether you know anything of my nephew George?\" asked Mr. Vavasor.\n\"Very little,\" said Grey.\n\"I believe him to be utterly an adventurer,--a man without means and without principle,--upon the whole about as bad a man as you may meet. I give you my word, Grey, that I don't think I know a worse man. He's going to marry her for her money; then he will beggar her, after that he'll ill-treat her, and yet what can I do?\"\n\"Prevent the marriage.\"\n\"But how, my dear fellow? Prevent it! It's all very well to say that, and it's the very thing I want to do. But how am I to prevent it? She's as much her own master as you are yours. She can give him every shilling of her fortune to-morrow. How am I to prevent her from marrying him?\"\n\"Let her give him every shilling of her fortune to-morrow,\" said Grey.\n\"And what is she to do then?\" asked Mr. Vavasor.\n\"Then--then,--then,--then let her come to me,\" said John Grey; and as he spoke there was the fragment of a tear in his eye, and the hint of quiver in his voice.\n[Illustration: \"Then--then,--then let her come to me.\"]\nEven the worldly, worn-out, unsympathetic nature of John Vavasor was struck, and, as it were, warmed by this.\n\"God bless you; God bless you, my dear fellow. I heartily wish for her sake that I could look forward to any such an end to this affair.\"\n\"And why not look forward to it? You say that he merely wants her money. As he wants it let him have it!\"\n\"But Grey, you do not know Alice; you do not understand my girl. When she had lost her fortune nothing would induce her to become your wife.\"\n\"Leave that to follow as it may,\" said John Grey. \"Our first object must be to sever her from a man, who is, as you say, himself on the verge of ruin; and who would certainly make her wretched. I am here now, not because I wish her to be my own wife, but because I wish that she should not become the wife of such a one as your nephew. If I were you I would let him have her money.\"\n\"If you were I, you would have nothing more to do with it than the man that is as yet unborn. I know that she will give him her money because she has said so; but I have no power as to her giving it or as to her withholding it. That's the hardship of my position;--but it is of no use to think of that now.\"\nJohn Grey certainly did not think about it. He knew well that Alice was independent, and that she was not inclined to give up that independence to anyone. He had not expected that her father would be able to do much towards hindering his daughter from becoming the wife of George Vavasor, but he had wished that he himself and her father should be in accord in their views, and he found that this was so. When he left Mr. Vavasor's room nothing had been said about the period of the marriage. Grey thought it improbable that Alice would find herself able to give herself in marriage to her cousin immediately,--so soon after her breach with him; but as to this he had no assurance, and he determined to have the facts from her own lips, if she would see him. So he wrote to her, naming a day on which he would call upon her early in the morning; and having received from her no prohibition, he was in Queen Anne Street at the hour appointed.\nHe had conceived a scheme which he had not made known to Mr. Vavasor, and as to the practicability of which he had much doubt; but which, nevertheless, he was resolved to try if he should find the attempt possible. He himself would buy off George Vavasor. He had ever been a prudent man, and he had money at command. If Vavasor was such a man as they, who knew him best, represented him, such a purchase might be possible. But then, before this was attempted, he must be quite sure that he knew his man, and he must satisfy himself also that in doing so he would not, in truth, add to Alice's misery. He could hardly bring himself to think it possible that she did, in truth, love her cousin with passionate love. It seemed to him, as he remembered what Alice had been to himself, that this must be impossible. But if it were so, that of course must put an end to his interference. He thought that if he saw her he might learn all this, and therefore he went to Queen Anne Street.\n\"Of course he must come if he will,\" she said to herself when she received his note. \"It can make no matter. He will say nothing half so hard to me as what I say to myself all day long.\" But when the morning came, and the hour came, and the knock at the door for which her ears were on the alert, her heart misgave her, and she felt that the present moment of her punishment, though not the heaviest, would still be hard to bear.\nHe came slowly up-stairs,--his step was ever slow,--and gently opened the door for himself. Then, before he even looked at her, he closed it again. I do not know how to explain that it was so; but it was this perfect command of himself at all seasons which had in part made Alice afraid of him, and drove her to believe that they were not fitted for each other. She, when he thus turned for a moment from her, and then walked slowly towards her, stood with both her hands leaning on the centre table of the room, and with her eyes fixed upon its surface.\n\"Alice,\" he said, walking up to her very slowly.\nHer whole frame shuddered as she heard the sweetness of his voice. Had I not better tell the truth of her at once? Oh, if she could only have been his again! What madness during these last six months had driven her to such a plight as this! The old love came back upon her. Nay; it had never gone. But that trust in his love returned to her,--that trust which told her that such love and such worth would have sufficed to make her happy. But this confidence in him was worthless now! Even though he should desire it, she could not change again.\n\"Alice,\" he said again. And then, as slowly she looked up at him, he asked her for her hand. \"You may give it me,\" he said, \"as to an old friend.\" She put her hand in his hand, and then, withdrawing it, felt that she must never trust herself to do so again.\n\"Alice,\" he continued, \"I do not expect you to say much to me; but there is a question or two which I think you will answer. Has a day been fixed for this marriage?\"\n\"No,\" she said.\n\"Will it be in a month?\"\n\"Oh, no;--not for a year,\" she replied hurriedly;--and he knew at once by her voice that she already dreaded this new wedlock. Whatever of anger he might before have felt for her was banished. She had brought herself by her ill-judgement,--by her ignorance, as she had confessed,--to a sad pass; but he believed that she was still worthy of his love.\n\"And now one other question, Alice;--but if you are silent, I will not ask it again. Can you tell me why you have again accepted your cousin's offer?\"\n\"Because--,\" she said very quickly, looking up as though she were about to speak with all her old courage. \"But you would never understand me,\" she said,--\"and there can be no reason why I should dare to hope that you should ever think well of me again.\"\nHe knew that there was no love,--no love for that man to whom she had pledged her hand. He did not know, on the other hand, how strong, how unchanged, how true was her love for himself. Indeed, of himself he was thinking not at all. He desired to learn whether she would suffer, if by any scheme he might succeed in breaking off this marriage. When he had asked her whether she were to be married at once, she had shuddered at the thought. When he asked her why she had accepted her cousin, she had faltered, and hinted at some excuse which he might fail to understand. Had she loved George Vavasor, he could have understood that well enough.\n\"Alice,\" he said, speaking still very slowly, \"nothing has ever yet been done which need to a certainty separate you and me. I am a persistent man, and I do not even yet give up all hope. A year is a long time. As you say yourself, I do not as yet quite understand you. But, Alice,--and I think that the position in which we stood a few months since justifies me in saying so without offence,--I love you now as well as ever, and should things change with you, I cannot tell you with how much joy and eagerness I should take you back to my bosom. My heart is yours now as it has been since I knew you.\"\nThen he again just touched her hand, and left her before she had been able to answer a word.",
        "paragraph_chars": [
            [
                0,
                1361
            ],
            [
                1361,
                3134
            ],
            [
                3134,
                4975
            ],
            [
                4975,
                5235
            ],
            [
                5235,
                5550
            ],
            [
                5550,
                7361
            ],
            [
                7361,
                8146
            ],
            [
                8146,
                9108
            ],
            [
                9108,
                10302
            ],
            [
                10302,
                10410
            ],
            [
                10410,
                10450
            ],
            [
                10450,
                10550
            ],
            [
                10550,
                10572
            ],
            [
                10572,
                10706
            ],
            [
                10706,
                11178
            ],
            [
                11178,
                11436
            ],
            [
                11436,
                11512
            ],
            [
                11512,
                11556
            ],
            [
                11556,
                11614
            ],
            [
                11614,
                11634
            ],
            [
                11634,
                11868
            ],
            [
                11868,
                11901
            ],
            [
                11901,
                12386
            ],
            [
                12386,
                12858
            ],
            [
                12858,
                12874
            ],
            [
                12874,
                13315
            ],
            [
                13315,
                13714
            ],
            [
                13714,
                13898
            ],
            [
                13898,
                13942
            ],
            [
                13942,
                14042
            ],
            [
                14042,
                14152
            ],
            [
                14152,
                14467
            ],
            [
                14467,
                14516
            ],
            [
                14516,
                14715
            ],
            [
                14715,
                14741
            ],
            [
                14741,
                15066
            ],
            [
                15066,
                15090
            ],
            [
                15090,
                15375
            ],
            [
                15375,
                15446
            ],
            [
                15446,
                15495
            ],
            [
                15495,
                15656
            ],
            [
                15656,
                15712
            ],
            [
                15712,
                15822
            ],
            [
                15822,
                15960
            ],
            [
                15960,
                16066
            ],
            [
                16066,
                16208
            ],
            [
                16208,
                16591
            ],
            [
                16591,
                16899
            ],
            [
                16899,
                17841
            ],
            [
                17841,
                18822
            ],
            [
                18822,
                19252
            ],
            [
                19252,
                19807
            ],
            [
                19807,
                19856
            ],
            [
                19856,
                20401
            ],
            [
                20401,
                20659
            ],
            [
                20659,
                20825
            ],
            [
                20825,
                20841
            ],
            [
                20841,
                20866
            ],
            [
                20866,
                21217
            ],
            [
                21217,
                21368
            ],
            [
                21368,
                21623
            ],
            [
                21623,
                22266
            ],
            [
                22266,
                22869
            ],
            [
                22869,
                22961
            ]
        ],
        "segment_chars": [
            [
                0,
                206
            ],
            [
                206,
                269
            ],
            [
                269,
                374
            ],
            [
                374,
                529
            ],
            [
                529,
                608
            ],
            [
                608,
                706
            ],
            [
                706,
                794
            ],
            [
                794,
                1001
            ],
            [
                1001,
                1058
            ],
            [
                1058,
                1109
            ],
            [
                1109,
                1170
            ],
            [
                1170,
                1361
            ],
            [
                1361,
                1484
            ],
            [
                1484,
                1647
            ],
            [
                1647,
                1737
            ],
            [
                1737,
                1877
            ],
            [
                1877,
                1934
            ],
            [
                1934,
                2028
            ],
            [
                2028,
                2104
            ],
            [
                2104,
                2167
            ],
            [
                2167,
                2218
            ],
            [
                2218,
                2383
            ],
            [
                2383,
                2656
            ],
            [
                2656,
                3037
            ],
            [
                3037,
                3134
            ],
            [
                3134,
                3269
            ],
            [
                3269,
                3320
            ],
            [
                3320,
                3439
            ],
            [
                3439,
                3675
            ],
            [
                3675,
                3778
            ],
            [
                3778,
                3951
            ],
            [
                3951,
                3999
            ],
            [
                3999,
                4314
            ],
            [
                4314,
                4436
            ],
            [
                4436,
                4561
            ],
            [
                4561,
                4782
            ],
            [
                4782,
                4895
            ],
            [
                4895,
                4975
            ],
            [
                4975,
                5032
            ],
            [
                5032,
                5114
            ],
            [
                5114,
                5235
            ],
            [
                5235,
                5456
            ],
            [
                5456,
                5550
            ],
            [
                5550,
                5678
            ],
            [
                5678,
                5805
            ],
            [
                5805,
                5949
            ],
            [
                5949,
                6152
            ],
            [
                6152,
                6349
            ],
            [
                6349,
                6477
            ],
            [
                6477,
                6610
            ],
            [
                6610,
                6732
            ],
            [
                6732,
                6935
            ],
            [
                6935,
                7008
            ],
            [
                7008,
                7065
            ],
            [
                7065,
                7251
            ],
            [
                7251,
                7361
            ],
            [
                7361,
                7455
            ],
            [
                7455,
                7538
            ],
            [
                7538,
                7577
            ],
            [
                7577,
                7882
            ],
            [
                7882,
                7958
            ],
            [
                7958,
                8146
            ],
            [
                8146,
                8372
            ],
            [
                8372,
                8425
            ],
            [
                8425,
                8504
            ],
            [
                8504,
                8564
            ],
            [
                8564,
                8722
            ],
            [
                8722,
                8856
            ],
            [
                8856,
                8920
            ],
            [
                8920,
                8957
            ],
            [
                8957,
                9108
            ],
            [
                9108,
                9259
            ],
            [
                9259,
                9329
            ],
            [
                9329,
                9525
            ],
            [
                9525,
                9663
            ],
            [
                9663,
                9736
            ],
            [
                9736,
                9860
            ],
            [
                9860,
                10008
            ],
            [
                10008,
                10070
            ],
            [
                10070,
                10153
            ],
            [
                10153,
                10194
            ],
            [
                10194,
                10302
            ],
            [
                10302,
                10410
            ],
            [
                10410,
                10437
            ],
            [
                10437,
                10450
            ],
            [
                10450,
                10498
            ],
            [
                10498,
                10550
            ],
            [
                10550,
                10572
            ],
            [
                10572,
                10593
            ],
            [
                10593,
                10621
            ],
            [
                10621,
                10706
            ],
            [
                10706,
                10968
            ],
            [
                10968,
                11178
            ],
            [
                11178,
                11199
            ],
            [
                11199,
                11234
            ],
            [
                11234,
                11280
            ],
            [
                11280,
                11360
            ],
            [
                11360,
                11436
            ],
            [
                11436,
                11478
            ],
            [
                11478,
                11512
            ],
            [
                11512,
                11527
            ],
            [
                11527,
                11556
            ],
            [
                11556,
                11614
            ],
            [
                11614,
                11634
            ],
            [
                11634,
                11675
            ],
            [
                11675,
                11717
            ],
            [
                11717,
                11791
            ],
            [
                11791,
                11825
            ],
            [
                11825,
                11868
            ],
            [
                11868,
                11901
            ],
            [
                11901,
                11986
            ],
            [
                11986,
                12069
            ],
            [
                12069,
                12099
            ],
            [
                12099,
                12172
            ],
            [
                12172,
                12263
            ],
            [
                12263,
                12386
            ],
            [
                12386,
                12442
            ],
            [
                12442,
                12505
            ],
            [
                12505,
                12835
            ],
            [
                12835,
                12858
            ],
            [
                12858,
                12874
            ],
            [
                12874,
                12946
            ],
            [
                12946,
                13205
            ],
            [
                13205,
                13315
            ],
            [
                13315,
                13473
            ],
            [
                13473,
                13714
            ],
            [
                13714,
                13741
            ],
            [
                13741,
                13898
            ],
            [
                13898,
                13942
            ],
            [
                13942,
                13981
            ],
            [
                13981,
                14042
            ],
            [
                14042,
                14077
            ],
            [
                14077,
                14152
            ],
            [
                14152,
                14196
            ],
            [
                14196,
                14303
            ],
            [
                14303,
                14467
            ],
            [
                14467,
                14504
            ],
            [
                14504,
                14516
            ],
            [
                14516,
                14532
            ],
            [
                14532,
                14634
            ],
            [
                14634,
                14696
            ],
            [
                14696,
                14715
            ],
            [
                14715,
                14741
            ],
            [
                14741,
                14881
            ],
            [
                14881,
                14946
            ],
            [
                14946,
                15066
            ],
            [
                15066,
                15090
            ],
            [
                15090,
                15116
            ],
            [
                15116,
                15128
            ],
            [
                15128,
                15198
            ],
            [
                15198,
                15226
            ],
            [
                15226,
                15273
            ],
            [
                15273,
                15331
            ],
            [
                15331,
                15375
            ],
            [
                15375,
                15446
            ],
            [
                15446,
                15476
            ],
            [
                15476,
                15495
            ],
            [
                15495,
                15656
            ],
            [
                15656,
                15712
            ],
            [
                15712,
                15822
            ],
            [
                15822,
                15869
            ],
            [
                15869,
                15960
            ],
            [
                15960,
                15993
            ],
            [
                15993,
                16033
            ],
            [
                16033,
                16066
            ],
            [
                16066,
                16131
            ],
            [
                16131,
                16208
            ],
            [
                16208,
                16258
            ],
            [
                16258,
                16402
            ],
            [
                16402,
                16544
            ],
            [
                16544,
                16591
            ],
            [
                16591,
                16685
            ],
            [
                16685,
                16819
            ],
            [
                16819,
                16899
            ],
            [
                16899,
                16943
            ],
            [
                16943,
                17054
            ],
            [
                17054,
                17304
            ],
            [
                17304,
                17392
            ],
            [
                17392,
                17658
            ],
            [
                17658,
                17841
            ],
            [
                17841,
                18056
            ],
            [
                18056,
                18097
            ],
            [
                18097,
                18158
            ],
            [
                18158,
                18264
            ],
            [
                18264,
                18442
            ],
            [
                18442,
                18555
            ],
            [
                18555,
                18652
            ],
            [
                18652,
                18723
            ],
            [
                18723,
                18822
            ],
            [
                18822,
                18907
            ],
            [
                18907,
                18931
            ],
            [
                18931,
                19009
            ],
            [
                19009,
                19252
            ],
            [
                19252,
                19344
            ],
            [
                19344,
                19400
            ],
            [
                19400,
                19614
            ],
            [
                19614,
                19807
            ],
            [
                19807,
                19856
            ],
            [
                19856,
                19923
            ],
            [
                19923,
                19971
            ],
            [
                19971,
                20014
            ],
            [
                20014,
                20097
            ],
            [
                20097,
                20130
            ],
            [
                20130,
                20154
            ],
            [
                20154,
                20294
            ],
            [
                20294,
                20340
            ],
            [
                20340,
                20401
            ],
            [
                20401,
                20425
            ],
            [
                20425,
                20494
            ],
            [
                20494,
                20548
            ],
            [
                20548,
                20659
            ],
            [
                20659,
                20784
            ],
            [
                20784,
                20825
            ],
            [
                20825,
                20841
            ],
            [
                20841,
                20866
            ],
            [
                20866,
                20993
            ],
            [
                20993,
                21059
            ],
            [
                21059,
                21217
            ],
            [
                21217,
                21302
            ],
            [
                21302,
                21368
            ],
            [
                21368,
                21475
            ],
            [
                21475,
                21623
            ],
            [
                21623,
                21711
            ],
            [
                21711,
                21809
            ],
            [
                21809,
                21856
            ],
            [
                21856,
                21967
            ],
            [
                21967,
                22063
            ],
            [
                22063,
                22193
            ],
            [
                22193,
                22266
            ],
            [
                22266,
                22391
            ],
            [
                22391,
                22454
            ],
            [
                22454,
                22477
            ],
            [
                22477,
                22536
            ],
            [
                22536,
                22813
            ],
            [
                22813,
                22869
            ],
            [
                22869,
                22961
            ]
        ],
        "overlap_chars": [
            [
                35,
                48
            ],
            [
                112,
                120
            ],
            [
                125,
                127
            ],
            [
                142,
                206
            ],
            [
                374,
                390
            ],
            [
                418,
                419
            ],
            [
                568,
                571
            ],
            [
                562,
                567
            ],
            [
                572,
                592
            ],
            [
                599,
                608
            ],
            [
                608,
                686
            ],
            [
                704,
                706
            ],
            [
                794,
                896
            ],
            [
                905,
                918
            ],
            [
                922,
                932
            ],
            [
                999,
                1001
            ],
            [
                1001,
                1009
            ],
            [
                1022,
                1058
            ],
            [
                1250,
                1252
            ],
            [
                1284,
                1305
            ],
            [
                1359,
                1361
            ],
            [
                1361,
                1383
            ],
            [
                1385,
                1444
            ],
            [
                1462,
                1465
            ],
            [
                1482,
                1484
            ],
            [
                1484,
                1487
            ],
            [
                1519,
                1523
            ],
            [
                1515,
                1517
            ],
            [
                1534,
                1538
            ],
            [
                1554,
                1556
            ],
            [
                1561,
                1564
            ],
            [
                1517,
                1518
            ],
            [
                1592,
                1599
            ],
            [
                1494,
                1498
            ],
            [
                1608,
                1647
            ],
            [
                1647,
                1651
            ],
            [
                1680,
                1735
            ],
            [
                1674,
                1679
            ],
            [
                1750,
                1762
            ],
            [
                1778,
                1818
            ],
            [
                1831,
                1852
            ],
            [
                1865,
                1876
            ],
            [
                1877,
                1897
            ],
            [
                1907,
                1934
            ],
            [
                1934,
                2028
            ],
            [
                2028,
                2091
            ],
            [
                2102,
                2104
            ],
            [
                2218,
                2300
            ],
            [
                2383,
                2519
            ],
            [
                2535,
                2538
            ],
            [
                2531,
                2534
            ],
            [
                2539,
                2542
            ],
            [
                2550,
                2571
            ],
            [
                2543,
                2549
            ],
            [
                2654,
                2656
            ],
            [
                3037,
                3075
            ],
            [
                3082,
                3102
            ],
            [
                3105,
                3134
            ],
            [
                3269,
                3283
            ],
            [
                3284,
                3291
            ],
            [
                3304,
                3307
            ],
            [
                3312,
                3320
            ],
            [
                3408,
                3417
            ],
            [
                3426,
                3437
            ],
            [
                3368,
                3379
            ],
            [
                3485,
                3486
            ],
            [
                3454,
                3479
            ],
            [
                3437,
                3438
            ],
            [
                3508,
                3532
            ],
            [
                3491,
                3499
            ],
            [
                3442,
                3445
            ],
            [
                3556,
                3559
            ],
            [
                3602,
                3633
            ],
            [
                3634,
                3675
            ],
            [
                3675,
                3731
            ],
            [
                3776,
                3778
            ],
            [
                3805,
                3825
            ],
            [
                3797,
                3804
            ],
            [
                3826,
                3951
            ],
            [
                3951,
                3998
            ],
            [
                4975,
                4995
            ],
            [
                4999,
                5032
            ],
            [
                5032,
                5070
            ],
            [
                5081,
                5087
            ],
            [
                5100,
                5114
            ],
            [
                5114,
                5117
            ],
            [
                5159,
                5178
            ],
            [
                5181,
                5200
            ],
            [
                5216,
                5219
            ],
            [
                5223,
                5235
            ],
            [
                5235,
                5264
            ],
            [
                5333,
                5456
            ],
            [
                5456,
                5458
            ],
            [
                5469,
                5473
            ],
            [
                5474,
                5520
            ],
            [
                5548,
                5550
            ],
            [
                5550,
                5573
            ],
            [
                5579,
                5586
            ],
            [
                5590,
                5630
            ],
            [
                5641,
                5652
            ],
            [
                5676,
                5678
            ],
            [
                5678,
                5682
            ],
            [
                5797,
                5803
            ],
            [
                5721,
                5724
            ],
            [
                5765,
                5775
            ],
            [
                5789,
                5796
            ],
            [
                5682,
                5683
            ],
            [
                5815,
                5851
            ],
            [
                5863,
                5929
            ],
            [
                5803,
                5804
            ],
            [
                5949,
                6005
            ],
            [
                6005,
                6006
            ],
            [
                6020,
                6023
            ],
            [
                6031,
                6033
            ],
            [
                6245,
                6349
            ],
            [
                6349,
                6359
            ],
            [
                6361,
                6377
            ],
            [
                6434,
                6436
            ],
            [
                6389,
                6414
            ],
            [
                6475,
                6477
            ],
            [
                6477,
                6496
            ],
            [
                6504,
                6551
            ],
            [
                6577,
                6610
            ],
            [
                6610,
                6645
            ],
            [
                6652,
                6656
            ],
            [
                6682,
                6732
            ],
            [
                6732,
                6771
            ],
            [
                6796,
                6813
            ],
            [
                6824,
                6829
            ],
            [
                6793,
                6795
            ],
            [
                6853,
                6890
            ],
            [
                6894,
                6920
            ],
            [
                6933,
                6935
            ],
            [
                6935,
                7008
            ],
            [
                7008,
                7046
            ],
            [
                7049,
                7064
            ],
            [
                7065,
                7106
            ],
            [
                7249,
                7251
            ],
            [
                7251,
                7262
            ],
            [
                7265,
                7322
            ],
            [
                7359,
                7361
            ],
            [
                7361,
                7383
            ],
            [
                7453,
                7455
            ],
            [
                7482,
                7512
            ],
            [
                7520,
                7538
            ],
            [
                7547,
                7577
            ],
            [
                7577,
                7599
            ],
            [
                7622,
                7644
            ],
            [
                7664,
                7669
            ],
            [
                7756,
                7790
            ],
            [
                7708,
                7711
            ],
            [
                7752,
                7754
            ],
            [
                7815,
                7824
            ],
            [
                7852,
                7882
            ],
            [
                7882,
                7884
            ],
            [
                7899,
                7958
            ],
            [
                7958,
                8001
            ],
            [
                8007,
                8014
            ],
            [
                8113,
                8146
            ],
            [
                8146,
                8152
            ],
            [
                8158,
                8192
            ],
            [
                8333,
                8336
            ],
            [
                8346,
                8370
            ],
            [
                8245,
                8246
            ],
            [
                8319,
                8321
            ],
            [
                8370,
                8372
            ],
            [
                8372,
                8425
            ],
            [
                8425,
                8484
            ],
            [
                8492,
                8504
            ],
            [
                8504,
                8525
            ],
            [
                8562,
                8563
            ],
            [
                9173,
                9187
            ],
            [
                9141,
                9147
            ],
            [
                9191,
                9259
            ],
            [
                9259,
                9287
            ],
            [
                9300,
                9329
            ],
            [
                9329,
                9335
            ],
            [
                9485,
                9496
            ],
            [
                9423,
                9424
            ],
            [
                9354,
                9358
            ],
            [
                9500,
                9525
            ],
            [
                9525,
                9636
            ],
            [
                9661,
                9662
            ],
            [
                9663,
                9679
            ],
            [
                9687,
                9736
            ],
            [
                9736,
                9802
            ],
            [
                9810,
                9818
            ],
            [
                9851,
                9860
            ],
            [
                9868,
                9871
            ],
            [
                9948,
                9952
            ],
            [
                9900,
                9914
            ],
            [
                9961,
                10008
            ],
            [
                10008,
                10023
            ],
            [
                10041,
                10068
            ],
            [
                10024,
                10032
            ],
            [
                10068,
                10070
            ],
            [
                10070,
                10109
            ],
            [
                10110,
                10153
            ],
            [
                10153,
                10194
            ],
            [
                10194,
                10302
            ],
            [
                10302,
                10327
            ],
            [
                10408,
                10410
            ],
            [
                10410,
                10437
            ],
            [
                10437,
                10450
            ],
            [
                10450,
                10456
            ],
            [
                10458,
                10461
            ],
            [
                10496,
                10498
            ],
            [
                10498,
                10540
            ],
            [
                10547,
                10550
            ],
            [
                10550,
                10572
            ],
            [
                10572,
                10575
            ],
            [
                10591,
                10593
            ],
            [
                10593,
                10621
            ],
            [
                10621,
                10652
            ],
            [
                10703,
                10706
            ],
            [
                10706,
                10729
            ],
            [
                10849,
                10858
            ],
            [
                10778,
                10781
            ],
            [
                10863,
                10879
            ],
            [
                10887,
                10935
            ],
            [
                10954,
                10968
            ],
            [
                10968,
                10980
            ],
            [
                11016,
                11022
            ],
            [
                11079,
                11157
            ],
            [
                11176,
                11178
            ],
            [
                11178,
                11199
            ],
            [
                11199,
                11234
            ],
            [
                11234,
                11280
            ],
            [
                11308,
                11330
            ],
            [
                11337,
                11359
            ],
            [
                11512,
                11527
            ],
            [
                11537,
                11556
            ],
            [
                11556,
                11586
            ],
            [
                11588,
                11614
            ],
            [
                11614,
                11630
            ],
            [
                11634,
                11638
            ],
            [
                11640,
                11667
            ],
            [
                11673,
                11675
            ],
            [
                11717,
                11724
            ],
            [
                11725,
                11791
            ],
            [
                11791,
                11825
            ],
            [
                11825,
                11868
            ],
            [
                11868,
                11901
            ],
            [
                11901,
                11943
            ],
            [
                11948,
                11984
            ],
            [
                12069,
                12099
            ],
            [
                12099,
                12121
            ],
            [
                12134,
                12172
            ],
            [
                12172,
                12191
            ],
            [
                12210,
                12212
            ],
            [
                12236,
                12237
            ],
            [
                12225,
                12236
            ],
            [
                12248,
                12263
            ],
            [
                12263,
                12386
            ],
            [
                12386,
                12400
            ],
            [
                12404,
                12441
            ],
            [
                12505,
                12514
            ],
            [
                12520,
                12524
            ],
            [
                12515,
                12519
            ],
            [
                12532,
                12575
            ],
            [
                12596,
                12604
            ],
            [
                12605,
                12684
            ],
            [
                12705,
                12762
            ],
            [
                12833,
                12835
            ],
            [
                12835,
                12858
            ],
            [
                12858,
                12866
            ],
            [
                12871,
                12874
            ],
            [
                12874,
                12946
            ],
            [
                12946,
                12963
            ],
            [
                12968,
                12974
            ],
            [
                12980,
                13095
            ],
            [
                13111,
                13127
            ],
            [
                13143,
                13149
            ],
            [
                13157,
                13205
            ],
            [
                13205,
                13211
            ],
            [
                13232,
                13269
            ],
            [
                13275,
                13315
            ],
            [
                13315,
                13344
            ],
            [
                13350,
                13359
            ],
            [
                13376,
                13473
            ],
            [
                13566,
                13578
            ],
            [
                13522,
                13529
            ],
            [
                13593,
                13620
            ],
            [
                13646,
                13668
            ],
            [
                13712,
                13714
            ],
            [
                13714,
                13741
            ],
            [
                13741,
                13773
            ],
            [
                13896,
                13898
            ],
            [
                13898,
                13904
            ],
            [
                13906,
                13942
            ],
            [
                13942,
                13981
            ],
            [
                13981,
                13991
            ],
            [
                13999,
                14042
            ],
            [
                14042,
                14062
            ],
            [
                14072,
                14077
            ],
            [
                14077,
                14105
            ],
            [
                14112,
                14152
            ],
            [
                14152,
                14196
            ],
            [
                14196,
                14301
            ],
            [
                14467,
                14472
            ],
            [
                14480,
                14486
            ],
            [
                14492,
                14495
            ],
            [
                14501,
                14504
            ],
            [
                14504,
                14516
            ],
            [
                14516,
                14532
            ],
            [
                14532,
                14580
            ],
            [
                14588,
                14634
            ],
            [
                14634,
                14695
            ],
            [
                14715,
                14741
            ],
            [
                14741,
                14761
            ],
            [
                14786,
                14828
            ],
            [
                14835,
                14881
            ],
            [
                14946,
                15066
            ],
            [
                15066,
                15090
            ],
            [
                15090,
                15116
            ],
            [
                15226,
                15273
            ],
            [
                15273,
                15319
            ],
            [
                15329,
                15331
            ],
            [
                15331,
                15375
            ],
            [
                15375,
                15422
            ],
            [
                15432,
                15446
            ],
            [
                15446,
                15476
            ],
            [
                15476,
                15495
            ],
            [
                15495,
                15500
            ],
            [
                15502,
                15506
            ],
            [
                15516,
                15634
            ],
            [
                15635,
                15656
            ],
            [
                15712,
                15728
            ],
            [
                15738,
                15753
            ],
            [
                15764,
                15787
            ],
            [
                15820,
                15822
            ],
            [
                15822,
                15823
            ],
            [
                15838,
                15869
            ],
            [
                15869,
                15926
            ],
            [
                15931,
                15960
            ],
            [
                15960,
                15993
            ],
            [
                15993,
                16033
            ],
            [
                16048,
                16066
            ],
            [
                16066,
                16076
            ],
            [
                16100,
                16131
            ],
            [
                16136,
                16160
            ],
            [
                16161,
                16208
            ],
            [
                16208,
                16258
            ],
            [
                16258,
                16307
            ],
            [
                16309,
                16315
            ],
            [
                16337,
                16402
            ],
            [
                16402,
                16411
            ],
            [
                16417,
                16497
            ],
            [
                16517,
                16544
            ],
            [
                16544,
                16591
            ],
            [
                16591,
                16603
            ],
            [
                16605,
                16621
            ],
            [
                16654,
                16657
            ],
            [
                16683,
                16685
            ],
            [
                16685,
                16724
            ],
            [
                16748,
                16769
            ],
            [
                16776,
                16779
            ],
            [
                16899,
                16908
            ],
            [
                16946,
                16987
            ],
            [
                17054,
                17114
            ],
            [
                17186,
                17210
            ],
            [
                17160,
                17163
            ],
            [
                17237,
                17243
            ],
            [
                17257,
                17271
            ],
            [
                17302,
                17304
            ],
            [
                17392,
                17435
            ],
            [
                17485,
                17508
            ],
            [
                17510,
                17548
            ],
            [
                17567,
                17569
            ],
            [
                17555,
                17559
            ],
            [
                17579,
                17601
            ],
            [
                17622,
                17625
            ],
            [
                17634,
                17657
            ],
            [
                17658,
                17722
            ],
            [
                17743,
                17748
            ],
            [
                17788,
                17792
            ],
            [
                17818,
                17841
            ],
            [
                17841,
                17847
            ],
            [
                17940,
                17942
            ],
            [
                17858,
                17883
            ],
            [
                17895,
                17909
            ],
            [
                17949,
                17951
            ],
            [
                18016,
                18018
            ],
            [
                17909,
                17910
            ],
            [
                17968,
                17971
            ],
            [
                17977,
                18015
            ],
            [
                18054,
                18056
            ],
            [
                18056,
                18097
            ],
            [
                18133,
                18158
            ],
            [
                18158,
                18186
            ],
            [
                18191,
                18192
            ],
            [
                18245,
                18263
            ],
            [
                18264,
                18267
            ],
            [
                18274,
                18280
            ],
            [
                18281,
                18285
            ],
            [
                18299,
                18442
            ],
            [
                18442,
                18501
            ],
            [
                18522,
                18555
            ],
            [
                18652,
                18723
            ],
            [
                18762,
                18776
            ],
            [
                18734,
                18738
            ],
            [
                18792,
                18822
            ],
            [
                18822,
                18851
            ],
            [
                18856,
                18907
            ],
            [
                18907,
                18922
            ],
            [
                18929,
                18931
            ],
            [
                18931,
                19009
            ],
            [
                19009,
                19039
            ],
            [
                19059,
                19068
            ],
            [
                19117,
                19159
            ],
            [
                19172,
                19196
            ],
            [
                19223,
                19228
            ],
            [
                19235,
                19252
            ],
            [
                19252,
                19266
            ],
            [
                19269,
                19270
            ],
            [
                19279,
                19291
            ],
            [
                19297,
                19301
            ],
            [
                19304,
                19344
            ],
            [
                19344,
                19400
            ],
            [
                19449,
                19494
            ],
            [
                19503,
                19614
            ],
            [
                19614,
                19617
            ],
            [
                19698,
                19807
            ],
            [
                19807,
                19856
            ],
            [
                19856,
                19923
            ],
            [
                19971,
                20014
            ],
            [
                20014,
                20097
            ],
            [
                20097,
                20130
            ],
            [
                20130,
                20154
            ],
            [
                20158,
                20196
            ],
            [
                20294,
                20340
            ],
            [
                20340,
                20344
            ],
            [
                20352,
                20354
            ],
            [
                20369,
                20393
            ],
            [
                20394,
                20401
            ],
            [
                20401,
                20417
            ],
            [
                20423,
                20425
            ],
            [
                20494,
                20495
            ],
            [
                20499,
                20502
            ],
            [
                20488,
                20492
            ],
            [
                20435,
                20437
            ],
            [
                20532,
                20545
            ],
            [
                20548,
                20571
            ],
            [
                20576,
                20659
            ],
            [
                20659,
                20784
            ],
            [
                20784,
                20825
            ],
            [
                20825,
                20841
            ],
            [
                20841,
                20866
            ],
            [
                20866,
                20873
            ],
            [
                20876,
                20915
            ],
            [
                20917,
                20993
            ],
            [
                20993,
                21001
            ],
            [
                21005,
                21019
            ],
            [
                21027,
                21059
            ],
            [
                21059,
                21103
            ],
            [
                21106,
                21122
            ],
            [
                21147,
                21217
            ],
            [
                21217,
                21252
            ],
            [
                21254,
                21302
            ],
            [
                21302,
                21368
            ],
            [
                21368,
                21376
            ],
            [
                21378,
                21475
            ],
            [
                21475,
                21521
            ],
            [
                21523,
                21554
            ],
            [
                21582,
                21623
            ],
            [
                21623,
                21653
            ],
            [
                21664,
                21672
            ],
            [
                21673,
                21676
            ],
            [
                21709,
                21711
            ],
            [
                21747,
                21750
            ],
            [
                21726,
                21727
            ],
            [
                21711,
                21726
            ],
            [
                21759,
                21772
            ],
            [
                21778,
                21809
            ],
            [
                21809,
                21816
            ],
            [
                21828,
                21834
            ],
            [
                21844,
                21847
            ],
            [
                21835,
                21843
            ],
            [
                21817,
                21827
            ],
            [
                21848,
                21856
            ],
            [
                21856,
                21858
            ],
            [
                21867,
                21904
            ],
            [
                21957,
                21965
            ],
            [
                21965,
                21967
            ],
            [
                21997,
                22000
            ],
            [
                22037,
                22061
            ],
            [
                22061,
                22062
            ],
            [
                22266,
                22283
            ],
            [
                22312,
                22324
            ],
            [
                22330,
                22354
            ],
            [
                22370,
                22391
            ],
            [
                22391,
                22454
            ],
            [
                22454,
                22477
            ],
            [
                22477,
                22506
            ],
            [
                22514,
                22536
            ],
            [
                22536,
                22547
            ],
            [
                22660,
                22813
            ],
            [
                22813,
                22869
            ],
            [
                22869,
                22929
            ],
            [
                22947,
                22961
            ]
        ],
        "row_chars": [
            [
                0,
                206
            ],
            [
                206,
                269
            ],
            [
                269,
                374
            ],
            [
                374,
                608
            ],
            [
                608,
                706
            ],
            [
                706,
                794
            ],
            [
                794,
                1001
            ],
            [
                1001,
                1058
            ],
            [
                1058,
                1109
            ],
            [
                1109,
                1170
            ],
            [
                1170,
                1361
            ],
            [
                1361,
                1484
            ],
            [
                1484,
                1647
            ],
            [
                1647,
                1877
            ],
            [
                1877,
                1934
            ],
            [
                1934,
                2028
            ],
            [
                2028,
                2104
            ],
            [
                2104,
                2167
            ],
            [
                2167,
                2218
            ],
            [
                2218,
                2656
            ],
            [
                2656,
                3037
            ],
            [
                3037,
                3134
            ],
            [
                3134,
                3269
            ],
            [
                3269,
                3320
            ],
            [
                3320,
                3675
            ],
            [
                3675,
                3778
            ],
            [
                3778,
                3951
            ],
            [
                3951,
                3999
            ],
            [
                3999,
                4314
            ],
            [
                4314,
                4436
            ],
            [
                4436,
                4561
            ],
            [
                4561,
                4782
            ],
            [
                4782,
                4895
            ],
            [
                4895,
                4975
            ],
            [
                4975,
                5032
            ],
            [
                5032,
                5114
            ],
            [
                5114,
                5235
            ],
            [
                5235,
                5456
            ],
            [
                5456,
                5550
            ],
            [
                5550,
                5678
            ],
            [
                5678,
                5949
            ],
            [
                5949,
                6152
            ],
            [
                6152,
                6349
            ],
            [
                6349,
                6477
            ],
            [
                6477,
                6610
            ],
            [
                6610,
                6732
            ],
            [
                6732,
                6935
            ],
            [
                6935,
                7008
            ],
            [
                7008,
                7065
            ],
            [
                7065,
                7251
            ],
            [
                7251,
                7361
            ],
            [
                7361,
                7455
            ],
            [
                7455,
                7538
            ],
            [
                7538,
                7577
            ],
            [
                7577,
                7882
            ],
            [
                7882,
                7958
            ],
            [
                7958,
                8146
            ],
            [
                8146,
                8372
            ],
            [
                8372,
                8425
            ],
            [
                8425,
                8504
            ],
            [
                8504,
                8564
            ],
            [
                8564,
                8722
            ],
            [
                8722,
                8856
            ],
            [
                8856,
                8920
            ],
            [
                8920,
                8957
            ],
            [
                8957,
                9108
            ],
            [
                9108,
                9259
            ],
            [
                9259,
                9329
            ],
            [
                9329,
                9525
            ],
            [
                9525,
                9663
            ],
            [
                9663,
                9736
            ],
            [
                9736,
                9860
            ],
            [
                9860,
                10008
            ],
            [
                10008,
                10070
            ],
            [
                10070,
                10153
            ],
            [
                10153,
                10194
            ],
            [
                10194,
                10302
            ],
            [
                10302,
                10410
            ],
            [
                10410,
                10437
            ],
            [
                10437,
                10450
            ],
            [
                10450,
                10498
            ],
            [
                10498,
                10550
            ],
            [
                10550,
                10572
            ],
            [
                10572,
                10593
            ],
            [
                10593,
                10621
            ],
            [
                10621,
                10706
            ],
            [
                10706,
                10968
            ],
            [
                10968,
                11178
            ],
            [
                11178,
                11199
            ],
            [
                11199,
                11234
            ],
            [
                11234,
                11280
            ],
            [
                11280,
                11360
            ],
            [
                11360,
                11436
            ],
            [
                11436,
                11478
            ],
            [
                11478,
                11512
            ],
            [
                11512,
                11527
            ],
            [
                11527,
                11556
            ],
            [
                11556,
                11614
            ],
            [
                11614,
                11634
            ],
            [
                11634,
                11675
            ],
            [
                11675,
                11717
            ],
            [
                11717,
                11791
            ],
            [
                11791,
                11825
            ],
            [
                11825,
                11868
            ],
            [
                11868,
                11901
            ],
            [
                11901,
                11986
            ],
            [
                11986,
                12069
            ],
            [
                12069,
                12099
            ],
            [
                12099,
                12172
            ],
            [
                12172,
                12263
            ],
            [
                12263,
                12386
            ],
            [
                12386,
                12442
            ],
            [
                12442,
                12505
            ],
            [
                12505,
                12835
            ],
            [
                12835,
                12858
            ],
            [
                12858,
                12874
            ],
            [
                12874,
                12946
            ],
            [
                12946,
                13205
            ],
            [
                13205,
                13315
            ],
            [
                13315,
                13473
            ],
            [
                13473,
                13714
            ],
            [
                13714,
                13741
            ],
            [
                13741,
                13898
            ],
            [
                13898,
                13942
            ],
            [
                13942,
                13981
            ],
            [
                13981,
                14042
            ],
            [
                14042,
                14077
            ],
            [
                14077,
                14152
            ],
            [
                14152,
                14196
            ],
            [
                14196,
                14303
            ],
            [
                14303,
                14467
            ],
            [
                14467,
                14504
            ],
            [
                14504,
                14516
            ],
            [
                14516,
                14532
            ],
            [
                14532,
                14634
            ],
            [
                14634,
                14696
            ],
            [
                14696,
                14715
            ],
            [
                14715,
                14741
            ],
            [
                14741,
                14881
            ],
            [
                14881,
                14946
            ],
            [
                14946,
                15066
            ],
            [
                15066,
                15090
            ],
            [
                15090,
                15116
            ],
            [
                15116,
                15128
            ],
            [
                15128,
                15198
            ],
            [
                15198,
                15226
            ],
            [
                15226,
                15273
            ],
            [
                15273,
                15331
            ],
            [
                15331,
                15375
            ],
            [
                15375,
                15446
            ],
            [
                15446,
                15476
            ],
            [
                15476,
                15495
            ],
            [
                15495,
                15656
            ],
            [
                15656,
                15712
            ],
            [
                15712,
                15822
            ],
            [
                15822,
                15869
            ],
            [
                15869,
                15960
            ],
            [
                15960,
                15993
            ],
            [
                15993,
                16033
            ],
            [
                16033,
                16066
            ],
            [
                16066,
                16131
            ],
            [
                16131,
                16208
            ],
            [
                16208,
                16258
            ],
            [
                16258,
                16402
            ],
            [
                16402,
                16544
            ],
            [
                16544,
                16591
            ],
            [
                16591,
                16685
            ],
            [
                16685,
                16819
            ],
            [
                16819,
                16899
            ],
            [
                16899,
                17304
            ],
            [
                17304,
                17392
            ],
            [
                17392,
                17658
            ],
            [
                17658,
                17841
            ],
            [
                17841,
                18056
            ],
            [
                18056,
                18097
            ],
            [
                18097,
                18158
            ],
            [
                18158,
                18264
            ],
            [
                18264,
                18442
            ],
            [
                18442,
                18555
            ],
            [
                18555,
                18652
            ],
            [
                18652,
                18723
            ],
            [
                18723,
                18822
            ],
            [
                18822,
                18907
            ],
            [
                18907,
                18931
            ],
            [
                18931,
                19009
            ],
            [
                19009,
                19252
            ],
            [
                19252,
                19344
            ],
            [
                19344,
                19400
            ],
            [
                19400,
                19614
            ],
            [
                19614,
                19807
            ],
            [
                19807,
                19856
            ],
            [
                19856,
                19923
            ],
            [
                19923,
                19971
            ],
            [
                19971,
                20014
            ],
            [
                20014,
                20097
            ],
            [
                20097,
                20130
            ],
            [
                20130,
                20154
            ],
            [
                20154,
                20340
            ],
            [
                20340,
                20401
            ],
            [
                20401,
                20425
            ],
            [
                20425,
                20548
            ],
            [
                20548,
                20659
            ],
            [
                20659,
                20784
            ],
            [
                20784,
                20825
            ],
            [
                20825,
                20841
            ],
            [
                20841,
                20866
            ],
            [
                20866,
                20993
            ],
            [
                20993,
                21059
            ],
            [
                21059,
                21217
            ],
            [
                21217,
                21302
            ],
            [
                21302,
                21368
            ],
            [
                21368,
                21475
            ],
            [
                21475,
                21623
            ],
            [
                21623,
                21711
            ],
            [
                21711,
                21809
            ],
            [
                21809,
                21856
            ],
            [
                21856,
                21967
            ],
            [
                21967,
                22063
            ],
            [
                22063,
                22193
            ],
            [
                22193,
                22266
            ],
            [
                22266,
                22391
            ],
            [
                22391,
                22454
            ],
            [
                22454,
                22477
            ],
            [
                22477,
                22536
            ],
            [
                22536,
                22813
            ],
            [
                22813,
                22869
            ],
            [
                22869,
                22961
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Vavasor had implored Alice to wait before she informed Mr. Grey of her engagement with her cousin. Although she had declined, she did not feel bound to write to Mr. Grey at once. Indeed, when her cousin left her she had no appetite for writing such a letter. It was now the middle of January, and the reader may remember that Mr. Grey had promised that he would visit her in London that month. She must do something to prevent that visit. So she sat down to write.\nIt was a terrible job; perhaps the most difficult of all the difficult tasks which she had faced. She felt that it would have been easier if Kate had been nearby, as she was when Alice wrote the other letter to her cousin George. Then she had been comforted by Kate's affectionate happiness, and strengthened by a feeling that she was doing the best, if not for herself, then for others.\nAll that comfort and strength had left her now. The atmosphere of the fells had buoyed her up, and now the thick air of London depressed her. She sat for hours with the pen in her hand, and could not write. As the mental photographs of the two men forced themselves upon her, she could not help comparing them. How was it that she now knew how great was the difference between the two men, how immense the pre-eminence of him whom she had rejected? Why had she not been able to see this before? In that was her chief misery; that now - when it was too late - she could look at it aright.\nBut the letter was at last written and posted. John Grey received it at Nethercoats, at breakfast in his study. Lounging in an arm-chair opposite was his closest friend, Frank Seward, a fellow of the Cambridge college to which they had both belonged. Mr. Seward was a clergyman, and the tutor of his college. He spent much of his leisure time at Nethercoats, and he was the only man to whom Grey had told anything of his love for Alice and of his disappointment. Even to Seward he had not told the whole story.\n\"Don't speak of this yet,\" he had said to Mr. Seward. \"Of course when the matter is settled, people must know it. But as long as there is any doubt, it is better not discussed.\"\nHe had said no more than this; but Seward had known that the girl had jilted his friend, and had made up his mind that she must be heartless and false. He also knew that his friend would never look for any other wife.\nLetters were brought to both of them this morning, and Seward's attention was occupied by his own. Grey opened his letter from Alice at once, very calmly, but without any of that pretended indifference with which George Vavasor had received Alice's letter.\n\"It is right that I should tell you at once,\" said Alice - oh, the difficulty of writing this! - \"that my cousin, George Vavasor, has repeated to me his offer of marriage, and that I have accepted it. I tell you chiefly in order to save you from the trouble of visiting. I will not tell you the circumstances of this engagement, because I do not think that you will care to hear them. I hardly dare to ask you to believe that I have endeavoured to act with truth and honesty. That I have been very ignorant, foolish and bad, I know well; there is much in the last few years of my life of which I am utterly ashamed. For the injury that I have done you, I can only express deep contrition. I do not dare to ask you to forgive me.\n\"Alice Vavasor.\"\nShe had tormented herself in writing this. \"He'll know, and that is all that is necessary,\" she said to herself.\nMr. Grey read it twice. The work of reading it was one of intense agony. Until now he had fed himself with hope. That Alice should have thought of her engagement with doubt had been very grievous to him; but he had considered it a fantasy which might be cured by time. He would give all his energies towards achieving such a cure. There had been one thing, however, which he feared; and this thing had now happened.\nHe had always disliked and feared George Vavasor and his influence upon Alice, although he barely knew him. He had also feared the influence of her cousin Kate. But to have cautioned Alice against her cousins would have been impossible. It was not his nature.\nAs he sat with the letter in his hand he suffered as, probably, he had never suffered before. But there was nothing in his face to show that he was in pain. Seward was reading a long letter with placid contentment. It did not occur to him to look across at Grey, but had he done so, I doubt whether he would have seen anything unusual.\nBut Grey, though wounded, would not allow himself to be dismayed. There was less hope now than before, but there might still be hope - hope for her, if not for him. He had heard that George Vavasor was needy, reckless, and on the brink of ruin. Such a marriage would be altogether ruinous to Alice. Whatever might be his own ultimate fate, he would still seek to save her from that. Her cousin, doubtless, wanted her money. Might it not be possible that he would be satisfied with her money, and that thus the woman might be saved?\n\"Seward,\" he said at last.\n\"Is there anything wrong?\" said Seward.\n\"Well; yes. I fear I must leave you, and go up to town today.\"\n\"Nobody ill, I hope?\"\n\"No. But I must go up to London. Mrs. Bole will take care of you.\"\nSeward assured him that Mrs. Bole was an excellent housekeeper; but that as he was so near his own college, he would return to Cambridge. He longed to ask about Grey's trouble; but he knew that Grey was a man who did not well bear close inquiries.\n\"Why not stay here?\" said Grey, after a minute's pause. \"I wish you would, old fellow; I do, indeed.\" The affection in his voice struck Seward at once.\n\"Then I will.\" There was a pause.\n\"I have got a letter here from - Miss Vavasor,\" said Grey.\n\"May I hope that-\"\n\"No; it does not bring good news. I would tell you if I could, but the whole story is one not to be told in a hurry. I should leave false impressions. There are things which a man cannot tell.\"\n\"Indeed there are,\" said Seward.\n\"I wish with all my heart that you knew it as I know it; but that is impossible.\" Then there was another pause. \"I have heard bad news, and I must go up to London at once. I shall go into Ely by noon, if you will drive me over. I may be back in a day; certainly in less than a week; but it will be a comfort to me to know that I shall find you here.\"\nThe matter was arranged, and at eleven they started.\n\"Seward,\" said Grey on the journey, \"if I fail in what I am going to attempt, you will probably never hear Alice Vavasor's name mentioned by me again; but I want you always to remember that at no moment has my opinion of her ever been changed. Do you understand me?\"\n\"I think so.\"\n\"To my thinking she is the finest of God's creatures that I have known. It may be that in future she will be severed from me altogether; but I shall not, therefore, think the less well of her; and I wish that you should know that, even if her name should never be mentioned between us.\" Seward assured him that it should be so, and they finished their journey in silence.\nFrom the station at Ely, Grey wired a message to John Vavasor, saying that he would call on him that afternoon at his office in Chancery Lane. The telegram reached Vavasor there, and he remained till half past four to meet Grey.\n\"Have you heard from her?\" he asked as soon as Grey entered.\n\"Yes,\" said Grey; \"she has written to me.\"\n\"And told you about her cousin George. I tried to prevent her from writing, but she is very wilful.\"\n\"Why should you have prevented her? If the thing was to be told, better that it should be done at once.\"\n\"But I hoped that there might be an escape. I don't know what you think of all this, Grey, but to me it is the bitterest misfortune that I have known.\"\n\"What escape did you hope for?\" asked Grey.\n\"I hardly know. The whole thing seems to me to be so mad, that I trusted that she would see the madness of it. I am not sure whether you know anything of my nephew George?\"\n\"Very little,\" said Grey.\n\"I believe him to be a man without means and without principle, on the whole about as bad a man as you may meet. He's going to marry her for her money; then he will beggar her, after that he'll ill-treat her, and yet what can I do?\"\n\"Prevent the marriage.\"\n\"But how, my dear fellow? She's as much her own master as you are yours. She can give him every shilling of her fortune tomorrow. How am I to prevent her from marrying him?\"\n\"Let her give him every shilling of her fortune tomorrow,\" said Grey.\n\"And what is she to do then?\" asked Mr. Vavasor.\n\"Then - then - then let her come to me,\" said John Grey; and as he spoke there was the fragment of a tear in his eye, and the hint of a quiver in his voice.\nEven the worldly, unsympathetic John Vavasor was struck.\n\"God bless you, my dear fellow. I heartily wish for her sake that I could look forward to such an end to this affair.\"\n\"And why not look forward to it? You say that he merely wants her money. So let him have it!\"\n\"But Grey, you do not understand my girl. Once she had lost her fortune, nothing would induce her to become your wife.\"\n\"Leave that to follow as it may,\" said John Grey. \"Our first object must be to sever her from a man who is on the verge of ruin; and who would certainly make her wretched. I am here not because I wish her to be my own wife, but because I wish that she should not marry such a one as your nephew. If I were you I would let him have her money.\"\n\"If you were me, you would have no say in the matter. I know that she will give him her money; but I have no power over her.\"\nJohn Grey knew well that Alice was independent, and he had not expected that her father would be able to do much, but he had wished that the two men should agree in their views. Grey thought it improbable that Alice would marry her cousin immediately, so soon after her breach with him; but there was no certainty of this, and he determined to ask her, if she would see him.\nSo he wrote to her, naming a day on which he would call upon her; and when she did not refuse, he arrived at the hour appointed.\nHe had thought of a scheme which he had not told to Mr. Vavasor. He was not sure if it was practicable, but, nevertheless, he was resolved to try it. He himself would buy off George Vavasor. He had money at command. If Vavasor was such a man as people said, this might be possible.\nBut before trying this, he must be quite sure that he knew his man, and he must satisfy himself also that in doing so he would not, in truth, add to Alice's misery. He could hardly bring himself to think it possible that she actually loved her cousin with passionate love. But if it were so, that of course must put an end to his interference. It was to learn all this that he went to Queen Anne Street.\n\"Of course he must come if he wishes,\" she said to herself when she received his note. \"It can make no difference. He will say nothing half so hard to me as what I say to myself all day long.\" But when the morning came, and she heard the knock, her heart misgave her, and she felt that this moment of her punishment would be hard to bear.\nHe came slowly upstairs - his step was always slow - and gently opened the door for himself. Then, before he even looked at her, he closed it again. It was this perfect command of himself at all times which had in part made Alice afraid of him, and drove her to believe that they were not fitted for each other. She stood with both her hands leaning on the centre table of the room, and with her eyes fixed upon its surface.\n\"Alice,\" he said, walking up to her very slowly.\nHer whole frame shuddered as she heard the sweetness of his voice. Oh, if she could only have been his again! What madness during these last six months had driven her to such a plight as this! The old love came back upon her. Nay; it had never gone. That trust in his love returned to her - but this confidence in him was worthless now! Even if he desired it, she could not change her mind again.\n\"Alice,\" he said. \"May I take your hand - as an old friend?\" She put her hand in his, and then, withdrawing it, felt that she must never trust herself to do so again.\n\"Alice,\" he continued, \"I do not expect you to say much to me; but there is a question or two which I think you will answer. Has a day been fixed for this marriage?\"\n\"No,\" she said.\n\"Will it be in a month?\"\n\"Oh, no - not for a year,\" she replied hurriedly; and he knew at once by her voice that she already dreaded this new wedlock. Whatever anger he might have felt for her was banished. She had brought herself by her ill-judgement - by her ignorance - to a sad pass; but he believed that she was still worthy of his love.\n\"And now one other question, Alice; but if you are silent, I will not ask it again. Can you tell me why you have again accepted your cousin's offer?\"\n\"Because-,\" she said very quickly, looking up as though she were about to speak with all her old courage. \"But you would never understand me,\" she said, \"and there can be no reason why you should ever think well of me again.\"\nHe knew that there was no love for that other man. However, he did not know how unchanged and true was her love for himself. Indeed, he was not thinking of himself at all. He wished to learn whether she would suffer, if the marriage were prevented. But it seemed that she shuddered at the thought of the marriage.\n\"Alice,\" he said, \"nothing has yet been done which need totally separate you and me. I am a persistent man, and I do not even yet give up all hope. A year is a long time. As you say yourself, I do not quite understand you. But, Alice , I love you now as well as ever, and should things change with you, I cannot tell you with how much joy and eagerness I should take you back to my bosom. My heart is yours now as it has been since I knew you.\"\nThen he again just touched her hand, and left her before she could answer a word.",
        "paragraph_chars": [
            [
                0,
                469
            ],
            [
                469,
                857
            ],
            [
                857,
                1445
            ],
            [
                1445,
                1956
            ],
            [
                1956,
                2134
            ],
            [
                2134,
                2352
            ],
            [
                2352,
                2609
            ],
            [
                2609,
                3338
            ],
            [
                3338,
                3355
            ],
            [
                3355,
                3468
            ],
            [
                3468,
                3884
            ],
            [
                3884,
                4144
            ],
            [
                4144,
                4480
            ],
            [
                4480,
                5012
            ],
            [
                5012,
                5039
            ],
            [
                5039,
                5079
            ],
            [
                5079,
                5142
            ],
            [
                5142,
                5164
            ],
            [
                5164,
                5231
            ],
            [
                5231,
                5479
            ],
            [
                5479,
                5631
            ],
            [
                5631,
                5665
            ],
            [
                5665,
                5724
            ],
            [
                5724,
                5743
            ],
            [
                5743,
                5937
            ],
            [
                5937,
                5970
            ],
            [
                5970,
                6321
            ],
            [
                6321,
                6374
            ],
            [
                6374,
                6641
            ],
            [
                6641,
                6655
            ],
            [
                6655,
                7027
            ],
            [
                7027,
                7256
            ],
            [
                7256,
                7317
            ],
            [
                7317,
                7360
            ],
            [
                7360,
                7461
            ],
            [
                7461,
                7566
            ],
            [
                7566,
                7718
            ],
            [
                7718,
                7762
            ],
            [
                7762,
                7935
            ],
            [
                7935,
                7961
            ],
            [
                7961,
                8194
            ],
            [
                8194,
                8218
            ],
            [
                8218,
                8392
            ],
            [
                8392,
                8462
            ],
            [
                8462,
                8511
            ],
            [
                8511,
                8668
            ],
            [
                8668,
                8725
            ],
            [
                8725,
                8844
            ],
            [
                8844,
                8938
            ],
            [
                8938,
                9058
            ],
            [
                9058,
                9401
            ],
            [
                9401,
                9527
            ],
            [
                9527,
                9902
            ],
            [
                9902,
                10031
            ],
            [
                10031,
                10313
            ],
            [
                10313,
                10717
            ],
            [
                10717,
                11056
            ],
            [
                11056,
                11481
            ],
            [
                11481,
                11530
            ],
            [
                11530,
                11927
            ],
            [
                11927,
                12094
            ],
            [
                12094,
                12260
            ],
            [
                12260,
                12276
            ],
            [
                12276,
                12301
            ],
            [
                12301,
                12619
            ],
            [
                12619,
                12769
            ],
            [
                12769,
                12995
            ],
            [
                12995,
                13309
            ],
            [
                13309,
                13754
            ],
            [
                13754,
                13835
            ]
        ],
        "segment_chars": [
            [
                0,
                103
            ],
            [
                103,
                183
            ],
            [
                183,
                263
            ],
            [
                263,
                398
            ],
            [
                398,
                443
            ],
            [
                443,
                469
            ],
            [
                469,
                567
            ],
            [
                567,
                699
            ],
            [
                699,
                857
            ],
            [
                857,
                905
            ],
            [
                905,
                999
            ],
            [
                999,
                1064
            ],
            [
                1064,
                1168
            ],
            [
                1168,
                1306
            ],
            [
                1306,
                1352
            ],
            [
                1352,
                1445
            ],
            [
                1445,
                1492
            ],
            [
                1492,
                1557
            ],
            [
                1557,
                1696
            ],
            [
                1696,
                1754
            ],
            [
                1754,
                1908
            ],
            [
                1908,
                1956
            ],
            [
                1956,
                2010
            ],
            [
                2010,
                2070
            ],
            [
                2070,
                2134
            ],
            [
                2134,
                2286
            ],
            [
                2286,
                2352
            ],
            [
                2352,
                2451
            ],
            [
                2451,
                2609
            ],
            [
                2609,
                2704
            ],
            [
                2704,
                2810
            ],
            [
                2810,
                2880
            ],
            [
                2880,
                2994
            ],
            [
                2994,
                3085
            ],
            [
                3085,
                3225
            ],
            [
                3225,
                3298
            ],
            [
                3298,
                3338
            ],
            [
                3338,
                3355
            ],
            [
                3355,
                3398
            ],
            [
                3398,
                3468
            ],
            [
                3468,
                3492
            ],
            [
                3492,
                3541
            ],
            [
                3541,
                3581
            ],
            [
                3581,
                3737
            ],
            [
                3737,
                3799
            ],
            [
                3799,
                3884
            ],
            [
                3884,
                3992
            ],
            [
                3992,
                4045
            ],
            [
                4045,
                4121
            ],
            [
                4121,
                4144
            ],
            [
                4144,
                4238
            ],
            [
                4238,
                4301
            ],
            [
                4301,
                4359
            ],
            [
                4359,
                4480
            ],
            [
                4480,
                4546
            ],
            [
                4546,
                4645
            ],
            [
                4645,
                4725
            ],
            [
                4725,
                4779
            ],
            [
                4779,
                4863
            ],
            [
                4863,
                4904
            ],
            [
                4904,
                5012
            ],
            [
                5012,
                5039
            ],
            [
                5039,
                5066
            ],
            [
                5066,
                5079
            ],
            [
                5079,
                5091
            ],
            [
                5091,
                5142
            ],
            [
                5142,
                5164
            ],
            [
                5164,
                5169
            ],
            [
                5169,
                5197
            ],
            [
                5197,
                5231
            ],
            [
                5231,
                5369
            ],
            [
                5369,
                5479
            ],
            [
                5479,
                5500
            ],
            [
                5500,
                5535
            ],
            [
                5535,
                5581
            ],
            [
                5581,
                5631
            ],
            [
                5631,
                5646
            ],
            [
                5646,
                5665
            ],
            [
                5665,
                5724
            ],
            [
                5724,
                5743
            ],
            [
                5743,
                5777
            ],
            [
                5777,
                5860
            ],
            [
                5860,
                5894
            ],
            [
                5894,
                5937
            ],
            [
                5937,
                5970
            ],
            [
                5970,
                6052
            ],
            [
                6052,
                6082
            ],
            [
                6082,
                6142
            ],
            [
                6142,
                6198
            ],
            [
                6198,
                6321
            ],
            [
                6321,
                6374
            ],
            [
                6374,
                6618
            ],
            [
                6618,
                6641
            ],
            [
                6641,
                6655
            ],
            [
                6655,
                6727
            ],
            [
                6727,
                6942
            ],
            [
                6942,
                7027
            ],
            [
                7027,
                7170
            ],
            [
                7170,
                7256
            ],
            [
                7256,
                7283
            ],
            [
                7283,
                7317
            ],
            [
                7317,
                7360
            ],
            [
                7360,
                7399
            ],
            [
                7399,
                7461
            ],
            [
                7461,
                7497
            ],
            [
                7497,
                7566
            ],
            [
                7566,
                7610
            ],
            [
                7610,
                7718
            ],
            [
                7718,
                7750
            ],
            [
                7750,
                7762
            ],
            [
                7762,
                7778
            ],
            [
                7778,
                7873
            ],
            [
                7873,
                7935
            ],
            [
                7935,
                7961
            ],
            [
                7961,
                8074
            ],
            [
                8074,
                8194
            ],
            [
                8194,
                8218
            ],
            [
                8218,
                8244
            ],
            [
                8244,
                8291
            ],
            [
                8291,
                8348
            ],
            [
                8348,
                8392
            ],
            [
                8392,
                8462
            ],
            [
                8462,
                8492
            ],
            [
                8492,
                8511
            ],
            [
                8511,
                8668
            ],
            [
                8668,
                8725
            ],
            [
                8725,
                8757
            ],
            [
                8757,
                8844
            ],
            [
                8844,
                8877
            ],
            [
                8877,
                8917
            ],
            [
                8917,
                8938
            ],
            [
                8938,
                8980
            ],
            [
                8980,
                9058
            ],
            [
                9058,
                9108
            ],
            [
                9108,
                9230
            ],
            [
                9230,
                9354
            ],
            [
                9354,
                9401
            ],
            [
                9401,
                9455
            ],
            [
                9455,
                9527
            ],
            [
                9527,
                9705
            ],
            [
                9705,
                9902
            ],
            [
                9902,
                10031
            ],
            [
                10031,
                10096
            ],
            [
                10096,
                10181
            ],
            [
                10181,
                10222
            ],
            [
                10222,
                10247
            ],
            [
                10247,
                10313
            ],
            [
                10313,
                10478
            ],
            [
                10478,
                10586
            ],
            [
                10586,
                10657
            ],
            [
                10657,
                10717
            ],
            [
                10717,
                10804
            ],
            [
                10804,
                10832
            ],
            [
                10832,
                10910
            ],
            [
                10910,
                11056
            ],
            [
                11056,
                11149
            ],
            [
                11149,
                11205
            ],
            [
                11205,
                11368
            ],
            [
                11368,
                11481
            ],
            [
                11481,
                11530
            ],
            [
                11530,
                11597
            ],
            [
                11597,
                11640
            ],
            [
                11640,
                11723
            ],
            [
                11723,
                11756
            ],
            [
                11756,
                11780
            ],
            [
                11780,
                11867
            ],
            [
                11867,
                11927
            ],
            [
                11927,
                11945
            ],
            [
                11945,
                11988
            ],
            [
                11988,
                12094
            ],
            [
                12094,
                12219
            ],
            [
                12219,
                12260
            ],
            [
                12260,
                12276
            ],
            [
                12276,
                12301
            ],
            [
                12301,
                12427
            ],
            [
                12427,
                12483
            ],
            [
                12483,
                12619
            ],
            [
                12619,
                12703
            ],
            [
                12703,
                12769
            ],
            [
                12769,
                12875
            ],
            [
                12875,
                12995
            ],
            [
                12995,
                13046
            ],
            [
                13046,
                13120
            ],
            [
                13120,
                13167
            ],
            [
                13167,
                13244
            ],
            [
                13244,
                13309
            ],
            [
                13309,
                13394
            ],
            [
                13394,
                13457
            ],
            [
                13457,
                13480
            ],
            [
                13480,
                13532
            ],
            [
                13532,
                13698
            ],
            [
                13698,
                13754
            ],
            [
                13754,
                13835
            ]
        ],
        "overlap_chars": [
            [
                2,
                15
            ],
            [
                16,
                24
            ],
            [
                31,
                33
            ],
            [
                39,
                103
            ],
            [
                112,
                128
            ],
            [
                128,
                129
            ],
            [
                138,
                141
            ],
            [
                147,
                152
            ],
            [
                153,
                173
            ],
            [
                174,
                183
            ],
            [
                183,
                261
            ],
            [
                261,
                263
            ],
            [
                263,
                365
            ],
            [
                372,
                385
            ],
            [
                386,
                396
            ],
            [
                396,
                398
            ],
            [
                398,
                406
            ],
            [
                407,
                443
            ],
            [
                443,
                445
            ],
            [
                446,
                467
            ],
            [
                467,
                469
            ],
            [
                469,
                491
            ],
            [
                492,
                551
            ],
            [
                556,
                559
            ],
            [
                565,
                567
            ],
            [
                567,
                570
            ],
            [
                576,
                580
            ],
            [
                581,
                583
            ],
            [
                590,
                594
            ],
            [
                607,
                609
            ],
            [
                615,
                618
            ],
            [
                630,
                631
            ],
            [
                635,
                642
            ],
            [
                643,
                647
            ],
            [
                660,
                699
            ],
            [
                699,
                703
            ],
            [
                704,
                759
            ],
            [
                759,
                764
            ],
            [
                765,
                777
            ],
            [
                778,
                818
            ],
            [
                818,
                839
            ],
            [
                845,
                856
            ],
            [
                857,
                877
            ],
            [
                878,
                905
            ],
            [
                905,
                999
            ],
            [
                999,
                1062
            ],
            [
                1062,
                1064
            ],
            [
                1064,
                1146
            ],
            [
                1168,
                1304
            ],
            [
                1310,
                1313
            ],
            [
                1314,
                1317
            ],
            [
                1318,
                1321
            ],
            [
                1322,
                1343
            ],
            [
                1344,
                1350
            ],
            [
                1350,
                1352
            ],
            [
                1352,
                1390
            ],
            [
                1393,
                1413
            ],
            [
                1416,
                1445
            ],
            [
                1449,
                1463
            ],
            [
                1472,
                1479
            ],
            [
                1480,
                1483
            ],
            [
                1484,
                1492
            ],
            [
                1492,
                1501
            ],
            [
                1502,
                1513
            ],
            [
                1517,
                1528
            ],
            [
                1528,
                1529
            ],
            [
                1530,
                1555
            ],
            [
                1555,
                1556
            ],
            [
                1557,
                1581
            ],
            [
                1582,
                1590
            ],
            [
                1591,
                1594
            ],
            [
                1595,
                1598
            ],
            [
                1613,
                1644
            ],
            [
                1655,
                1696
            ],
            [
                1696,
                1752
            ],
            [
                1752,
                1754
            ],
            [
                1754,
                1774
            ],
            [
                1775,
                1782
            ],
            [
                1783,
                1908
            ],
            [
                1908,
                1955
            ],
            [
                1956,
                1976
            ],
            [
                1977,
                2010
            ],
            [
                2010,
                2048
            ],
            [
                2049,
                2055
            ],
            [
                2056,
                2070
            ],
            [
                2070,
                2073
            ],
            [
                2074,
                2093
            ],
            [
                2098,
                2117
            ],
            [
                2118,
                2121
            ],
            [
                2122,
                2134
            ],
            [
                2134,
                2163
            ],
            [
                2163,
                2286
            ],
            [
                2286,
                2288
            ],
            [
                2289,
                2293
            ],
            [
                2299,
                2345
            ],
            [
                2350,
                2352
            ],
            [
                2352,
                2375
            ],
            [
                2381,
                2388
            ],
            [
                2389,
                2429
            ],
            [
                2430,
                2441
            ],
            [
                2449,
                2451
            ],
            [
                2451,
                2455
            ],
            [
                2456,
                2462
            ],
            [
                2463,
                2466
            ],
            [
                2474,
                2484
            ],
            [
                2485,
                2492
            ],
            [
                2492,
                2493
            ],
            [
                2494,
                2530
            ],
            [
                2541,
                2607
            ],
            [
                2607,
                2608
            ],
            [
                2609,
                2665
            ],
            [
                2670,
                2671
            ],
            [
                2672,
                2675
            ],
            [
                2687,
                2689
            ],
            [
                2706,
                2810
            ],
            [
                2810,
                2820
            ],
            [
                2821,
                2837
            ],
            [
                2838,
                2840
            ],
            [
                2841,
                2866
            ],
            [
                2878,
                2880
            ],
            [
                2880,
                2899
            ],
            [
                2900,
                2947
            ],
            [
                2961,
                2994
            ],
            [
                2994,
                3029
            ],
            [
                3030,
                3034
            ],
            [
                3035,
                3085
            ],
            [
                3085,
                3124
            ],
            [
                3129,
                3146
            ],
            [
                3147,
                3152
            ],
            [
                3153,
                3155
            ],
            [
                3156,
                3193
            ],
            [
                3197,
                3223
            ],
            [
                3223,
                3225
            ],
            [
                3225,
                3298
            ],
            [
                3298,
                3336
            ],
            [
                3339,
                3354
            ],
            [
                3355,
                3396
            ],
            [
                3396,
                3398
            ],
            [
                3398,
                3409
            ],
            [
                3409,
                3466
            ],
            [
                3466,
                3468
            ],
            [
                3468,
                3490
            ],
            [
                3490,
                3492
            ],
            [
                3492,
                3522
            ],
            [
                3523,
                3541
            ],
            [
                3551,
                3581
            ],
            [
                3581,
                3603
            ],
            [
                3612,
                3634
            ],
            [
                3635,
                3640
            ],
            [
                3641,
                3675
            ],
            [
                3679,
                3682
            ],
            [
                3694,
                3696
            ],
            [
                3697,
                3706
            ],
            [
                3707,
                3737
            ],
            [
                3737,
                3739
            ],
            [
                3740,
                3799
            ],
            [
                3799,
                3842
            ],
            [
                3843,
                3850
            ],
            [
                3851,
                3884
            ],
            [
                3884,
                3890
            ],
            [
                3898,
                3932
            ],
            [
                3933,
                3936
            ],
            [
                3937,
                3961
            ],
            [
                3961,
                3962
            ],
            [
                3972,
                3974
            ],
            [
                3990,
                3992
            ],
            [
                3992,
                4045
            ],
            [
                4049,
                4108
            ],
            [
                4109,
                4121
            ],
            [
                4121,
                4142
            ],
            [
                4142,
                4143
            ],
            [
                4144,
                4158
            ],
            [
                4163,
                4169
            ],
            [
                4170,
                4238
            ],
            [
                4238,
                4266
            ],
            [
                4272,
                4301
            ],
            [
                4301,
                4307
            ],
            [
                4308,
                4319
            ],
            [
                4320,
                4321
            ],
            [
                4322,
                4326
            ],
            [
                4334,
                4359
            ],
            [
                4359,
                4470
            ],
            [
                4478,
                4479
            ],
            [
                4480,
                4496
            ],
            [
                4497,
                4546
            ],
            [
                4546,
                4612
            ],
            [
                4620,
                4628
            ],
            [
                4636,
                4645
            ],
            [
                4648,
                4651
            ],
            [
                4658,
                4662
            ],
            [
                4663,
                4677
            ],
            [
                4678,
                4725
            ],
            [
                4725,
                4740
            ],
            [
                4741,
                4768
            ],
            [
                4769,
                4777
            ],
            [
                4777,
                4779
            ],
            [
                4779,
                4818
            ],
            [
                4820,
                4863
            ],
            [
                4863,
                4904
            ],
            [
                4904,
                5012
            ],
            [
                5012,
                5037
            ],
            [
                5037,
                5039
            ],
            [
                5039,
                5066
            ],
            [
                5066,
                5079
            ],
            [
                5079,
                5085
            ],
            [
                5086,
                5089
            ],
            [
                5089,
                5091
            ],
            [
                5091,
                5133
            ],
            [
                5139,
                5142
            ],
            [
                5142,
                5164
            ],
            [
                5164,
                5167
            ],
            [
                5167,
                5169
            ],
            [
                5169,
                5197
            ],
            [
                5197,
                5228
            ],
            [
                5228,
                5231
            ],
            [
                5231,
                5254
            ],
            [
                5255,
                5264
            ],
            [
                5265,
                5268
            ],
            [
                5282,
                5298
            ],
            [
                5299,
                5347
            ],
            [
                5355,
                5369
            ],
            [
                5369,
                5381
            ],
            [
                5392,
                5398
            ],
            [
                5399,
                5477
            ],
            [
                5477,
                5479
            ],
            [
                5479,
                5500
            ],
            [
                5500,
                5535
            ],
            [
                5535,
                5581
            ],
            [
                5585,
                5607
            ],
            [
                5608,
                5630
            ],
            [
                5631,
                5646
            ],
            [
                5646,
                5665
            ],
            [
                5665,
                5695
            ],
            [
                5698,
                5724
            ],
            [
                5724,
                5740
            ],
            [
                5743,
                5747
            ],
            [
                5748,
                5775
            ],
            [
                5775,
                5777
            ],
            [
                5777,
                5784
            ],
            [
                5794,
                5860
            ],
            [
                5860,
                5894
            ],
            [
                5894,
                5937
            ],
            [
                5937,
                5970
            ],
            [
                5970,
                6012
            ],
            [
                6013,
                6049
            ],
            [
                6052,
                6082
            ],
            [
                6082,
                6104
            ],
            [
                6104,
                6142
            ],
            [
                6142,
                6161
            ],
            [
                6162,
                6164
            ],
            [
                6169,
                6170
            ],
            [
                6171,
                6182
            ],
            [
                6183,
                6198
            ],
            [
                6198,
                6321
            ],
            [
                6321,
                6335
            ],
            [
                6336,
                6373
            ],
            [
                6374,
                6383
            ],
            [
                6384,
                6388
            ],
            [
                6389,
                6393
            ],
            [
                6408,
                6451
            ],
            [
                6452,
                6460
            ],
            [
                6470,
                6549
            ],
            [
                6559,
                6616
            ],
            [
                6616,
                6618
            ],
            [
                6618,
                6641
            ],
            [
                6641,
                6649
            ],
            [
                6652,
                6655
            ],
            [
                6655,
                6727
            ],
            [
                6727,
                6744
            ],
            [
                6745,
                6751
            ],
            [
                6752,
                6867
            ],
            [
                6868,
                6884
            ],
            [
                6884,
                6890
            ],
            [
                6894,
                6942
            ],
            [
                6942,
                6948
            ],
            [
                6949,
                6986
            ],
            [
                6987,
                7027
            ],
            [
                7027,
                7056
            ],
            [
                7063,
                7072
            ],
            [
                7073,
                7170
            ],
            [
                7170,
                7182
            ],
            [
                7191,
                7198
            ],
            [
                7199,
                7226
            ],
            [
                7227,
                7249
            ],
            [
                7254,
                7256
            ],
            [
                7256,
                7283
            ],
            [
                7283,
                7315
            ],
            [
                7315,
                7317
            ],
            [
                7317,
                7323
            ],
            [
                7324,
                7360
            ],
            [
                7360,
                7399
            ],
            [
                7399,
                7409
            ],
            [
                7418,
                7461
            ],
            [
                7461,
                7481
            ],
            [
                7492,
                7497
            ],
            [
                7497,
                7525
            ],
            [
                7526,
                7566
            ],
            [
                7566,
                7610
            ],
            [
                7610,
                7715
            ],
            [
                7718,
                7723
            ],
            [
                7724,
                7730
            ],
            [
                7735,
                7738
            ],
            [
                7747,
                7750
            ],
            [
                7750,
                7762
            ],
            [
                7762,
                7778
            ],
            [
                7778,
                7826
            ],
            [
                7827,
                7873
            ],
            [
                7873,
                7934
            ],
            [
                7935,
                7961
            ],
            [
                7961,
                7981
            ],
            [
                7982,
                8024
            ],
            [
                8028,
                8074
            ],
            [
                8074,
                8194
            ],
            [
                8194,
                8218
            ],
            [
                8218,
                8244
            ],
            [
                8244,
                8291
            ],
            [
                8291,
                8337
            ],
            [
                8346,
                8348
            ],
            [
                8348,
                8392
            ],
            [
                8392,
                8439
            ],
            [
                8448,
                8462
            ],
            [
                8462,
                8492
            ],
            [
                8492,
                8511
            ],
            [
                8511,
                8516
            ],
            [
                8519,
                8523
            ],
            [
                8526,
                8644
            ],
            [
                8647,
                8668
            ],
            [
                8668,
                8684
            ],
            [
                8684,
                8699
            ],
            [
                8700,
                8723
            ],
            [
                8723,
                8725
            ],
            [
                8725,
                8726
            ],
            [
                8726,
                8757
            ],
            [
                8757,
                8814
            ],
            [
                8815,
                8844
            ],
            [
                8844,
                8877
            ],
            [
                8877,
                8917
            ],
            [
                8920,
                8938
            ],
            [
                8938,
                8948
            ],
            [
                8949,
                8980
            ],
            [
                8985,
                9009
            ],
            [
                9011,
                9058
            ],
            [
                9058,
                9108
            ],
            [
                9108,
                9157
            ],
            [
                9158,
                9164
            ],
            [
                9165,
                9230
            ],
            [
                9230,
                9239
            ],
            [
                9240,
                9320
            ],
            [
                9327,
                9354
            ],
            [
                9354,
                9401
            ],
            [
                9401,
                9413
            ],
            [
                9416,
                9432
            ],
            [
                9443,
                9446
            ],
            [
                9453,
                9455
            ],
            [
                9455,
                9494
            ],
            [
                9494,
                9515
            ],
            [
                9521,
                9524
            ],
            [
                9527,
                9536
            ],
            [
                9537,
                9578
            ],
            [
                9579,
                9639
            ],
            [
                9639,
                9663
            ],
            [
                9664,
                9667
            ],
            [
                9676,
                9682
            ],
            [
                9689,
                9703
            ],
            [
                9703,
                9705
            ],
            [
                9705,
                9748
            ],
            [
                9755,
                9778
            ],
            [
                9779,
                9817
            ],
            [
                9828,
                9830
            ],
            [
                9844,
                9848
            ],
            [
                9848,
                9870
            ],
            [
                9875,
                9878
            ],
            [
                9878,
                9901
            ],
            [
                9902,
                9966
            ],
            [
                9966,
                9971
            ],
            [
                9995,
                9999
            ],
            [
                10008,
                10031
            ],
            [
                10031,
                10037
            ],
            [
                10046,
                10048
            ],
            [
                10049,
                10074
            ],
            [
                10080,
                10094
            ],
            [
                10096,
                10098
            ],
            [
                10112,
                10114
            ],
            [
                10133,
                10134
            ],
            [
                10135,
                10138
            ],
            [
                10138,
                10176
            ],
            [
                10179,
                10181
            ],
            [
                10181,
                10222
            ],
            [
                10222,
                10247
            ],
            [
                10247,
                10275
            ],
            [
                10287,
                10288
            ],
            [
                10294,
                10312
            ],
            [
                10313,
                10316
            ],
            [
                10317,
                10323
            ],
            [
                10331,
                10335
            ],
            [
                10335,
                10478
            ],
            [
                10478,
                10537
            ],
            [
                10553,
                10586
            ],
            [
                10586,
                10657
            ],
            [
                10667,
                10681
            ],
            [
                10682,
                10686
            ],
            [
                10687,
                10717
            ],
            [
                10717,
                10746
            ],
            [
                10753,
                10804
            ],
            [
                10804,
                10819
            ],
            [
                10830,
                10832
            ],
            [
                10832,
                10910
            ],
            [
                10910,
                10940
            ],
            [
                10951,
                10960
            ],
            [
                10960,
                11002
            ],
            [
                11008,
                11032
            ],
            [
                11033,
                11038
            ],
            [
                11039,
                11056
            ],
            [
                11056,
                11070
            ],
            [
                11080,
                11081
            ],
            [
                11082,
                11094
            ],
            [
                11102,
                11106
            ],
            [
                11109,
                11149
            ],
            [
                11149,
                11205
            ],
            [
                11205,
                11250
            ],
            [
                11257,
                11368
            ],
            [
                11368,
                11371
            ],
            [
                11372,
                11481
            ],
            [
                11481,
                11530
            ],
            [
                11530,
                11597
            ],
            [
                11597,
                11640
            ],
            [
                11640,
                11723
            ],
            [
                11723,
                11756
            ],
            [
                11756,
                11780
            ],
            [
                11780,
                11818
            ],
            [
                11821,
                11867
            ],
            [
                11867,
                11871
            ],
            [
                11875,
                11877
            ],
            [
                11886,
                11910
            ],
            [
                11920,
                11927
            ],
            [
                11927,
                11943
            ],
            [
                11943,
                11945
            ],
            [
                11945,
                11946
            ],
            [
                11946,
                11949
            ],
            [
                11962,
                11966
            ],
            [
                11969,
                11971
            ],
            [
                11972,
                11985
            ],
            [
                11988,
                12011
            ],
            [
                12011,
                12094
            ],
            [
                12094,
                12219
            ],
            [
                12219,
                12260
            ],
            [
                12260,
                12276
            ],
            [
                12276,
                12301
            ],
            [
                12301,
                12308
            ],
            [
                12311,
                12350
            ],
            [
                12351,
                12427
            ],
            [
                12427,
                12435
            ],
            [
                12436,
                12450
            ],
            [
                12451,
                12483
            ],
            [
                12483,
                12527
            ],
            [
                12530,
                12546
            ],
            [
                12549,
                12619
            ],
            [
                12619,
                12654
            ],
            [
                12655,
                12703
            ],
            [
                12703,
                12769
            ],
            [
                12769,
                12777
            ],
            [
                12778,
                12875
            ],
            [
                12875,
                12921
            ],
            [
                12922,
                12953
            ],
            [
                12954,
                12995
            ],
            [
                12995,
                13025
            ],
            [
                13026,
                13034
            ],
            [
                13041,
                13044
            ],
            [
                13044,
                13046
            ],
            [
                13046,
                13049
            ],
            [
                13053,
                13054
            ],
            [
                13055,
                13070
            ],
            [
                13071,
                13084
            ],
            [
                13089,
                13120
            ],
            [
                13120,
                13127
            ],
            [
                13128,
                13134
            ],
            [
                13135,
                13138
            ],
            [
                13139,
                13147
            ],
            [
                13148,
                13158
            ],
            [
                13159,
                13167
            ],
            [
                13167,
                13169
            ],
            [
                13177,
                13214
            ],
            [
                13219,
                13227
            ],
            [
                13242,
                13244
            ],
            [
                13263,
                13266
            ],
            [
                13267,
                13291
            ],
            [
                13307,
                13308
            ],
            [
                13309,
                13326
            ],
            [
                13327,
                13339
            ],
            [
                13340,
                13364
            ],
            [
                13373,
                13394
            ],
            [
                13394,
                13457
            ],
            [
                13457,
                13480
            ],
            [
                13480,
                13509
            ],
            [
                13510,
                13532
            ],
            [
                13532,
                13544
            ],
            [
                13545,
                13698
            ],
            [
                13698,
                13754
            ],
            [
                13754,
                13814
            ],
            [
                13821,
                13835
            ]
        ],
        "row_chars": [
            [
                0,
                103
            ],
            [
                103,
                103
            ],
            [
                103,
                103
            ],
            [
                103,
                183
            ],
            [
                183,
                263
            ],
            [
                263,
                263
            ],
            [
                263,
                398
            ],
            [
                398,
                443
            ],
            [
                443,
                443
            ],
            [
                443,
                443
            ],
            [
                443,
                469
            ],
            [
                469,
                567
            ],
            [
                567,
                699
            ],
            [
                699,
                857
            ],
            [
                857,
                905
            ],
            [
                905,
                999
            ],
            [
                999,
                1064
            ],
            [
                1064,
                1064
            ],
            [
                1064,
                1064
            ],
            [
                1064,
                1352
            ],
            [
                1352,
                1352
            ],
            [
                1352,
                1445
            ],
            [
                1445,
                1445
            ],
            [
                1445,
                1492
            ],
            [
                1492,
                1696
            ],
            [
                1696,
                1754
            ],
            [
                1754,
                1908
            ],
            [
                1908,
                1956
            ],
            [
                1956,
                1956
            ],
            [
                1956,
                1956
            ],
            [
                1956,
                1956
            ],
            [
                1956,
                1956
            ],
            [
                1956,
                1956
            ],
            [
                1956,
                1956
            ],
            [
                1956,
                2010
            ],
            [
                2010,
                2070
            ],
            [
                2070,
                2134
            ],
            [
                2134,
                2286
            ],
            [
                2286,
                2352
            ],
            [
                2352,
                2451
            ],
            [
                2451,
                2609
            ],
            [
                2609,
                2704
            ],
            [
                2704,
                2810
            ],
            [
                2810,
                2880
            ],
            [
                2880,
                2994
            ],
            [
                2994,
                3085
            ],
            [
                3085,
                3225
            ],
            [
                3225,
                3298
            ],
            [
                3298,
                3355
            ],
            [
                3355,
                3398
            ],
            [
                3398,
                3468
            ],
            [
                3468,
                3492
            ],
            [
                3492,
                3541
            ],
            [
                3541,
                3581
            ],
            [
                3581,
                3737
            ],
            [
                3737,
                3799
            ],
            [
                3799,
                3884
            ],
            [
                3884,
                3992
            ],
            [
                3992,
                4045
            ],
            [
                4045,
                4121
            ],
            [
                4121,
                4144
            ],
            [
                4144,
                4144
            ],
            [
                4144,
                4144
            ],
            [
                4144,
                4144
            ],
            [
                4144,
                4144
            ],
            [
                4144,
                4144
            ],
            [
                4144,
                4238
            ],
            [
                4238,
                4301
            ],
            [
                4301,
                4359
            ],
            [
                4359,
                4480
            ],
            [
                4480,
                4546
            ],
            [
                4546,
                4645
            ],
            [
                4645,
                4725
            ],
            [
                4725,
                4779
            ],
            [
                4779,
                4863
            ],
            [
                4863,
                4904
            ],
            [
                4904,
                5012
            ],
            [
                5012,
                5039
            ],
            [
                5039,
                5066
            ],
            [
                5066,
                5079
            ],
            [
                5079,
                5091
            ],
            [
                5091,
                5142
            ],
            [
                5142,
                5164
            ],
            [
                5164,
                5169
            ],
            [
                5169,
                5197
            ],
            [
                5197,
                5231
            ],
            [
                5231,
                5369
            ],
            [
                5369,
                5479
            ],
            [
                5479,
                5500
            ],
            [
                5500,
                5535
            ],
            [
                5535,
                5581
            ],
            [
                5581,
                5631
            ],
            [
                5631,
                5631
            ],
            [
                5631,
                5631
            ],
            [
                5631,
                5631
            ],
            [
                5631,
                5646
            ],
            [
                5646,
                5665
            ],
            [
                5665,
                5724
            ],
            [
                5724,
                5743
            ],
            [
                5743,
                5777
            ],
            [
                5777,
                5777
            ],
            [
                5777,
                5860
            ],
            [
                5860,
                5894
            ],
            [
                5894,
                5937
            ],
            [
                5937,
                5970
            ],
            [
                5970,
                6052
            ],
            [
                6052,
                6052
            ],
            [
                6052,
                6082
            ],
            [
                6082,
                6142
            ],
            [
                6142,
                6198
            ],
            [
                6198,
                6321
            ],
            [
                6321,
                6374
            ],
            [
                6374,
                6374
            ],
            [
                6374,
                6618
            ],
            [
                6618,
                6641
            ],
            [
                6641,
                6655
            ],
            [
                6655,
                6727
            ],
            [
                6727,
                6942
            ],
            [
                6942,
                7027
            ],
            [
                7027,
                7170
            ],
            [
                7170,
                7256
            ],
            [
                7256,
                7283
            ],
            [
                7283,
                7317
            ],
            [
                7317,
                7360
            ],
            [
                7360,
                7399
            ],
            [
                7399,
                7461
            ],
            [
                7461,
                7497
            ],
            [
                7497,
                7566
            ],
            [
                7566,
                7610
            ],
            [
                7610,
                7718
            ],
            [
                7718,
                7718
            ],
            [
                7718,
                7750
            ],
            [
                7750,
                7762
            ],
            [
                7762,
                7778
            ],
            [
                7778,
                7873
            ],
            [
                7873,
                7935
            ],
            [
                7935,
                7935
            ],
            [
                7935,
                7961
            ],
            [
                7961,
                8074
            ],
            [
                8074,
                8074
            ],
            [
                8074,
                8194
            ],
            [
                8194,
                8218
            ],
            [
                8218,
                8244
            ],
            [
                8244,
                8244
            ],
            [
                8244,
                8244
            ],
            [
                8244,
                8244
            ],
            [
                8244,
                8291
            ],
            [
                8291,
                8348
            ],
            [
                8348,
                8392
            ],
            [
                8392,
                8462
            ],
            [
                8462,
                8492
            ],
            [
                8492,
                8511
            ],
            [
                8511,
                8668
            ],
            [
                8668,
                8668
            ],
            [
                8668,
                8725
            ],
            [
                8725,
                8757
            ],
            [
                8757,
                8844
            ],
            [
                8844,
                8877
            ],
            [
                8877,
                8917
            ],
            [
                8917,
                8938
            ],
            [
                8938,
                8980
            ],
            [
                8980,
                9058
            ],
            [
                9058,
                9108
            ],
            [
                9108,
                9230
            ],
            [
                9230,
                9354
            ],
            [
                9354,
                9401
            ],
            [
                9401,
                9455
            ],
            [
                9455,
                9527
            ],
            [
                9527,
                9527
            ],
            [
                9527,
                9705
            ],
            [
                9705,
                9705
            ],
            [
                9705,
                9902
            ],
            [
                9902,
                10031
            ],
            [
                10031,
                10181
            ],
            [
                10181,
                10222
            ],
            [
                10222,
                10247
            ],
            [
                10247,
                10313
            ],
            [
                10313,
                10478
            ],
            [
                10478,
                10586
            ],
            [
                10586,
                10586
            ],
            [
                10586,
                10657
            ],
            [
                10657,
                10717
            ],
            [
                10717,
                10804
            ],
            [
                10804,
                10832
            ],
            [
                10832,
                10910
            ],
            [
                10910,
                11056
            ],
            [
                11056,
                11149
            ],
            [
                11149,
                11205
            ],
            [
                11205,
                11368
            ],
            [
                11368,
                11481
            ],
            [
                11481,
                11530
            ],
            [
                11530,
                11597
            ],
            [
                11597,
                11597
            ],
            [
                11597,
                11640
            ],
            [
                11640,
                11723
            ],
            [
                11723,
                11756
            ],
            [
                11756,
                11780
            ],
            [
                11780,
                11867
            ],
            [
                11867,
                11927
            ],
            [
                11927,
                11945
            ],
            [
                11945,
                11988
            ],
            [
                11988,
                12094
            ],
            [
                12094,
                12219
            ],
            [
                12219,
                12260
            ],
            [
                12260,
                12276
            ],
            [
                12276,
                12301
            ],
            [
                12301,
                12427
            ],
            [
                12427,
                12483
            ],
            [
                12483,
                12619
            ],
            [
                12619,
                12703
            ],
            [
                12703,
                12769
            ],
            [
                12769,
                12875
            ],
            [
                12875,
                12995
            ],
            [
                12995,
                13046
            ],
            [
                13046,
                13120
            ],
            [
                13120,
                13167
            ],
            [
                13167,
                13244
            ],
            [
                13244,
                13309
            ],
            [
                13309,
                13309
            ],
            [
                13309,
                13309
            ],
            [
                13309,
                13394
            ],
            [
                13394,
                13457
            ],
            [
                13457,
                13480
            ],
            [
                13480,
                13532
            ],
            [
                13532,
                13698
            ],
            [
                13698,
                13754
            ],
            [
                13754,
                13835
            ]
        ]
    }
}