{
    "original": {
        "text": "When George Vavasor left Mr. Scruby's office--the attentive reader will remember that he did call upon Mr. Scruby, the Parliamentary lawyer, and there recognised the necessity of putting himself in possession of a small sum of money with as little delay as possible;--when he left the attorney's office, he was well aware that the work to be done was still before him. And he knew also that the job to be undertaken was a very disagreeable job. He did not like the task of borrowing his cousin Alice's money.\nWe all of us know that swindlers and rogues do very dirty tricks, and we are apt to picture to ourselves a certain amount of gusto and delight on the part of the swindlers in the doing of them. In this, I think we are wrong. The poor, broken, semi-genteel beggar, who borrows half-sovereigns apiece from all his old acquaintances, knowing that they know that he will never repay them, suffers a separate little agony with each petition that he makes. He does not enjoy pleasant sailing in this journey which he is making. To be refused is painful to him. To get his half sovereign with scorn is painful. To get it with apparent confidence in his honour is almost more painful. \"D---- it,\" he says to himself on such rare occasions, \"I will pay that fellow;\" and yet, as he says it, he knows that he never will pay even that fellow. It is a comfortless unsatisfying trade, that of living upon other people's money.\nHow was George Vavasor to make his first step towards getting his hand into his cousin's purse? He had gone to her asking for her love, and she had shuddered when he asked her. That had been the commencement of their life under their new engagement. He knew very well that the money would be forthcoming when he demanded it,--but under their present joint circumstances, how was he to make the demand? If he wrote to her, should he simply ask for money, and make no allusion to his love? If he went to her in person, should he make his visit a mere visit of business,--as he might call on his banker?\nHe resolved at last that Kate should do the work for him. Indeed, he had felt all along that it would be well that Kate should act as ambassador between him and Alice in money matters, as she had long done in other things. He could talk to Kate as he could not talk to Alice;--and then, between the women, those hard money necessities would be softened down by a romantic phraseology which he would not himself know how to use with any effect. He made up his mind to see Kate, and with this view he went down to Westmoreland; and took himself to a small wayside inn at Shap among the fells, which had been known to him of old. He gave his sister notice that he would be there, and begged her to come over to him as early as she might find it possible on the morning after his arrival. He himself reached the place late in the evening by train from London. There is a station at Shap, by which the railway company no doubt conceives that it has conferred on that somewhat rough and remote locality all the advantages of a refined civilization; but I doubt whether the Shappites have been thankful for the favour. The landlord at the inn, for one, is not thankful. Shap had been a place owing all such life as it had possessed to coaching and posting. It had been a stage on the high road from Lancaster to Carlisle, and though it lay high and bleak among the fells, and was a cold, windy, thinly-populated place,--filling all travellers with thankfulness that they had not been made Shappites, nevertheless, it had had its glory in its coaching and posting. I have no doubt that there are men and women who look back with a fond regret to the palmy days of Shap.\nVavasor reached the little inn about nine in the evening on a night that was pitchy dark, and in a wind which made it necessary for him to hold his hat on to his head. \"What a beastly country to live in,\" he said to himself, resolving that he would certainly sell Vavasor Hall in spite of all family associations, if ever the power to do so should be his. \"What trash it is,\" he said, \"hanging on to such a place as that without the means of living like a gentleman, simply because one's ancestors have done so.\" And then he expressed a doubt to himself whether all the world contained a more ignorant, opinionated, useless old man than his grandfather,--or, in short, a greater fool.\n\"Well, Mr. George,\" said the landlord as soon as he saw him, \"a sight of you's guid for sair een. It's o'er lang since you've been doon amang the fells.\" But George did not want to converse with the innkeeper, or to explain how it was that he did not visit Vavasor Hall. The innkeeper, no doubt, knew all about it,--knew that the grandfather had quarrelled with his grandson, and knew the reason why; but George, if he suspected such knowledge, did not choose to refer to it. So he simply grunted something in reply, and getting himself in before a spark of fire which hardly was burning in a public room with a sandy floor, begged that the little sitting-room up-stairs might be got ready for him. There he passed the evening in solitude, giving no encouragement to the landlord, who, nevertheless, looked him up three or four times,--till at last George said that his head ached, and that he would wish to be alone. \"He was always one of them cankery chiels as never have a kindly word for man nor beast,\" said the landlord. \"Seems as though that raw slash in his face had gone right through into his heart.\" After that George was left alone, and sat thinking whether it would not be better to ask Alice for two thousand pounds at once,--so as to save him from the disagreeable necessity of a second borrowing before their marriage. He was very uneasy in his mind. He had flattered himself through it all that his cousin had loved him. He had felt sure that such was the case while they were together in Switzerland. When she had determined to give up John Grey, of course he had told himself the same thing. When she had at once answered his first subsequent overture with an assent, he had of course been certain that it was so. Dark, selfish, and even dishonest as he was, he had, nevertheless, enjoyed something of a lover's true pleasure in believing that Alice had still loved him through all their mischances. But his joy had in a moment been turned into gall during that interview in Queen Anne Street. He had read the truth at a glance. A man must be very vain, or else very little used to such matters, who at George Vavasor's age cannot understand the feelings with which a woman receives him. When Alice contrived as she had done to escape the embrace he was so well justified in asking, he knew the whole truth. He was sore at heart, and very angry withal. He could have readily spurned her from him, and rejected her who had once rejected him. He would have done so had not his need for her money restrained him. He was not a man who could deceive himself in such matters. He knew that this was so, and he told himself that he was a rascal.\nVavasor Hall was, by the road, about five miles from Shap, and it was not altogether an easy task for Kate to get over to the village without informing her grandfather that the visit was to be made, and what was its purport. She could, indeed, walk, and the walk would not be so long as that she had taken with Alice to Swindale fell;--but walking to an inn on a high road, is not the same thing as walking to a point on a hill side over a lake. Had she been dirty, draggled, and wet through on Swindale fell, it would have simply been matter for mirth; but her brother she knew would not have liked to see her enter the Lowther Arms at Shap in such a condition. It, therefore, became necessary that she should ask her grandfather to lend her the jaunting car.\n\"Where do you want to go?\" he asked sharply. In such establishments as that at Vavasor Hall the family horse is generally used for double duties. Though he draws the lady of the house one day, he is not too proud to draw manure on the next. And it will always be found that the master of the house gives a great preference to the manure over the lady. The squire at Vavasor had come to do so to such an extent that he regarded any application for the animal's services as an encroachment.\n\"Only to Shap, grandpapa.\"\n\"To Shap! what on earth can take you to Shap? There are no shops at Shap.\"\n\"I am not going to do shopping. I want to see some one there.\"\n\"Whom can you want to see at Shap?\"\nThen it occurred to Kate on the spur of the moment that she might as well tell her grandfather the fact. \"My brother has come down,\" she said; \"and is at the inn there. I had not intended to tell you, as I did not wish to mention his name till you had consented to receive him here.\"\n\"And he expects to come here now;--does he?\" said the squire.\n\"Oh, no, sir. I think he has no expectation of the kind. He has come down simply to see me;--about business I believe.\"\n\"Business! what business? I suppose he wants to get your money from you?\"\n\"I think it is with reference to his marriage. I think he wants me to use my influence with Alice that it may not be delayed.\"\n\"Look here, Kate; if ever you lend him your money, or any of it,--that is, of the principal I mean,--I will never speak to him again under any circumstance. And more than that! Look here, Kate. In spite of all that has past and gone, the property will become his for his life when I die,--unless I change my will. If he gets your money from you, I will change it, and he shall not be a shilling richer at my death than he is now. You can have the horse to go to Shap.\"\nWhat unlucky chance had it been which had put this idea into the old squire's head on this especial morning? Kate had resolved that she would entreat her brother to make use of her little fortune. She feared that he was now coming with some reference to his cousin's money,--that something was to be done to enable him to avail himself of his cousin's offer; and Kate, almost blushing in the solitude of her chamber at the thought, was determined that her brother must be saved from such temptation. She knew that money was necessary to him. She knew that he could not stand a second contest without assistance. With all their confidences, he had never told her much of his pecuniary circumstances in the world, but she was almost sure that he was a poor man. He had said as much as that to her, and in his letter desiring her to come to him at Shap, he had inserted a word or two purposely intended to prepare her mind for monetary considerations.\nAs she was jogged along over the rough road to Shap, she made up her mind that Aunt Greenow would be the proper person to defray the expense of the coming election. To give Kate her due she would have given up every shilling of her own money without a moment's hesitation, or any feeling that her brother would be wrong to accept it. Nor would she, perhaps, have been unalterably opposed to his taking Alice's money, had Alice simply been his cousin. She felt that as Vavasors they were bound to stand by the future head of the family in an attempt which was to be made, as she felt, for the general Vavasor interest. But she could not endure to think that her brother should take the money of the girl whom he was engaged to marry. Aunt Greenow's money she thought was fair game. Aunt Greenow herself had made various liberal offers to herself which Kate had declined, not caring to be under pecuniary obligations even to Aunt Greenow without necessity; but she felt that for such a purpose as her brother's contest, she need not hesitate to ask for assistance, and she thought also that such assistance would be forthcoming.\n\"Grandpapa knows that you are here, George,\" said Kate, when their first greeting was over.\n\"The deuce he does! and why did you tell him?\"\n\"I could not get the car to come in without letting him know why I wanted it.\"\n\"What nonsense! as if you couldn't have made any excuse! I was particularly anxious that he should not guess that I am here.\"\n\"I don't see that it can make any difference, George.\"\n\"But I see that it can,--a very great difference. It may prevent my ever being able to get near him again before he dies. What did he say about my coming?\"\n\"He didn't say much.\"\n\"He made no offer as to my going there?\"\n\"No.\"\n\"I should not have gone if he had. I don't know now that I ever shall go. To be there to do any good,--so as to make him alter his will, and leave me in the position which I have a right to expect, would take more time than the whole property is worth. And he would endeavour to tie me down in some way I could not stand;--perhaps ask me to give up my notion for going into Parliament.\"\n\"He might ask you, but he would not make it ground for another quarrel, if you refused.\"\n\"He is so unreasonable and ignorant that I am better away from him. But, Kate, you have not congratulated me on my matrimonial prospects.\"\n\"Indeed I did, George, when I wrote to you.\"\n\"Did you? well; I had forgotten. I don't know that any very strong congratulatory tone is necessary. As things go, perhaps it may be as well for all of us, and that's about the best that can be said for it.\"\n\"Oh, George!\"\n\"You see I'm not romantic, Kate, as you are. Half a dozen children with a small income do not generally present themselves as being desirable to men who wish to push their way in the world.\"\n\"You know you have always longed to make her your wife.\"\n\"I don't know anything of the kind. You have always been under a match-making hallucination on that point. But in this case you have been so far successful, and are entitled to your triumph.\"\n\"I don't want any triumph; you ought to know that.\"\n\"But I'll tell you what I do want, Kate. I want some money.\" Then he paused, but as she did not answer immediately, he was obliged to go on speaking. \"I'm not at all sure that I have not been wrong in making this attempt to get into Parliament,--that I'm not struggling to pick fruit which is above my reach.\"\n\"Don't say that, George.\"\n\"Ah, but I can't help feeling it. I need hardly tell you that I am ready to risk anything of my own. If I know myself I would toss up to-morrow, or for the matter of that to-day, between the gallows and a seat in the House. But I cannot go on with this contest by risking what is merely my own. Money, for immediate use, I have none left, and my neck, though I were ever so willing to risk it, is of no service.\"\n\"Whatever I have can be yours to-morrow,\" said Kate, in a hesitating voice, which too plainly pronounced her misery as she made the offer. She could not refrain herself from making it. Though her grandfather's threat was ringing in her ears,--though she knew that she might be ruining her brother by proposing such a loan, she had no alternative. When her brother told her of his want of money, she could not abstain from tendering to him the use of what was her own.\n\"No;\" said he. \"I shall not take your money.\"\n\"You would not scruple, if you knew how welcome you are.\"\n\"At any rate, I shall not take it. I should not think it right. All that you have would only just suffice for my present wants, and I should not choose to make you a beggar. There would, moreover, be a difficulty about readjusting the payment.\"\n\"There would be no difficulty, because no one need be consulted but us two.\"\n\"I should not think it right, and therefore let there be an end of it,\" said George in a tone of voice which had in it something of magniloquence.\n\"What is it you wish then?\" said Kate, who knew too well what he did wish.\n\"I will explain to you. When Alice and I are married, of course there will be a settlement made on her, and as we are both the grandchildren of the old squire I shall propose that the Vavasor property shall be hers for life in the event of her outliving me.\"\n\"Well,\" said Kate.\n\"And if this be done, there can be no harm in my forestalling some of her property, which, under the circumstances of such a settlement, would of course become mine when we are married.\"\n\"But the squire might leave the property to whom he pleases.\"\n\"We know very well that he won't, at any rate, leave it out of the family. In fact, he would only be too glad to consent to such an agreement as that I have proposed, because he would thereby rob me of all power in the matter.\"\n\"But that could not be done till you are married.\"\n\"Look here, Kate;--don't you make difficulties.\" And now, as he looked at her, the cicature on his face seemed to open and yawn at her. \"If you mean to say that you won't help me, do say so, and I will go back to London.\"\n\"I would do anything in my power to help you,--that was not wrong!\"\n\"Yes; anybody could say as much as that. That is not much of an offer if you are to keep to yourself the power of deciding what is wrong. Will you write to Alice,--or better still, go to her, and explain that I want the money.\"\n\"How can I go to London now?\"\n\"You can do it very well, if you choose. But if that be too much, then write to her. It will come much better from you than from me; write to her, and explain that I must pay in advance the expenses of this contest, and that I cannot look for success unless I do so. I did not think that the demand would come so quick on me; but they know that I am not a man of capital, and therefore I cannot expect them to carry on the fight for me, unless they know that the money is sure. Scruby has been bitten two or three times by these metropolitan fellows, and he is determined that he will not be bitten again.\" Then he paused for Kate to speak.\n\"George,\" she said, slowly.\n\"Well.\"\n\"I wish you would try any other scheme but that.\"\n\"There is no other scheme! That's so like a woman;--to quarrel with the only plan that is practicable.\"\n\"I do not think you ought to take Alice's money.\"\n\"My dear Kate, you must allow me to be the best judge of what I ought to do, and what I ought not to do. Alice herself understands the matter perfectly. She knows that I cannot obtain this position, which is as desirable for her as it is for me--\"\n\"And for me as much as for either,\" said Kate, interrupting him.\n\"Very well. Alice, I say, knows that I cannot do this without money, and has offered the assistance which I want. I would rather that you should tell her how much I want, and that I want it now, than that I should do so. That is all. If you are half the woman that I take you to be, you will understand this well enough.\"\nKate did understand it well enough. She was quite awake to the fact that her brother was ashamed of the thing he was about to do,--so much ashamed of it that he was desirous of using her voice instead of his own. \"I want you to write to her quite at once,\" he continued; \"since you seem to think that it is not worth while to take the trouble of a journey to London.\"\n\"There is no question about the trouble,\" said Kate. \"I would walk to London to get the money for you, if that were all.\"\n\"Do you think that Alice will refuse to lend it me?\" said he, looking into her face.\n\"I am sure that she would not, but I think that you ought not to take it from her. There seems to me to be something sacred about property that belongs to the girl you are going to marry.\"\n\"If there is anything on earth I hate,\" said George, walking about the room, \"it is romance. If you keep it for reading in your bedroom, it's all very well for those who like it, but when it comes to be mixed up with one's business it plays the devil. If you would only sift what you have said, you would see what nonsense it is. Alice and I are to be man and wife. All our interests, and all our money, and our station in life, whatever it may be, are to be joint property. And yet she is the last person in the world to whom I ought to go for money to improve her prospects as well as my own. That's what you call delicacy. I call it infernal nonsense.\"\n\"I tell you what I'll do, George. I'll ask Aunt Greenow to lend you the money,--or to lend it to me.\"\n\"I don't believe she'd give me a shilling. Moreover, I want it quite immediately, and the time taken up in letter-writing and negotiations would be fatal to me. If you won't apply to Alice, I must. I want you to tell me whether you will oblige me in this matter.\"\nKate was still hesitating as to her answer, when there came a knock at the door, and a little crumpled note was brought up to her. A boy had just come with it across the fell from Vavasor Hall, and Kate, as soon as she saw her name on the outside, knew that it was from her grandfather. It was as follows:--\n\"If George wishes to come to the Hall, let him come. If he chooses to tell me that he regrets his conduct to me, I will see him.\"\n\"What is it?\" said George. Then Kate put the note into her brother's hand.\n\"I'll do nothing of the kind,\" he said. \"What good should I get by going to the old man's house?\"\n\"Every good,\" said Kate. \"If you don't go now you never can do so.\"\n\"Never till it's my own,\" said George.\n\"If you show him that you are determined to be at variance with him, it never will be your own;--unless, indeed, it should some day come to you as part of Alice's fortune. Think of it, George; you would not like to receive everything from her.\"\nHe walked about the room, muttering maledictions between his teeth and balancing, as best he was able at such a moment, his pride against his profit. \"You haven't answered my question,\" said he. \"If I go to the Hall, will you write to Alice?\"\n\"No, George; I cannot write to Alice asking her for the money.\"\n\"You won't?\"\n\"I could not bring myself to do it.\"\n\"Then, Kate, you and my grandfather may work together for the future. You may get him to leave you the place if you have skill enough.\"\n\"That is as undeserved a reproach as any woman ever encountered,\" said Kate, standing her ground boldly before him. \"If you have either heart or conscience, you will feel that it is so.\"\n\"I'm not much troubled with either one or the other, I fancy. Things are being brought to such a pass with me that I am better without them.\"\n\"Will you take my money, George; just for the present?\"\n\"No. I haven't much conscience; but I have a little left.\"\n\"Will you let me write to Mrs. Greenow?\"\n\"I have not the slightest objection; but it will be of no use whatsoever.\"\n\"I will do so, at any rate. And now will you come to the Hall?\"\n\"To beg that old fool's pardon? No; I won't. In the mood I am in at present, I couldn't do it. I should only anger him worse than ever. Tell him that I've business which calls me back to London at once.\"\n\"It is a thousand pities.\"\n\"It can't be helped.\"\n\"It may make so great a difference to you for your whole life!\" urged Kate.\n\"I'll tell you what I'll do,\" said George. \"I'll go to Vavasor and put up with the old squire's insolence, if you'll make this application for me to Alice.\" I wonder whether it occurred to him that his sister desired his presence at the Hall solely on his own behalf. The same idea certainly did not occur to Kate. She hesitated, feeling that she would almost do anything to achieve a reconciliation between her grandfather and her brother.\n\"But you'll let me write to Aunt Greenow first,\" said she. \"It will take only two days,--or at the most three?\"\nTo this George consented as though he were yielding a great deal; and Kate, with a sore conscience, with a full knowledge that she was undertaking to do wrong, promised that she would apply to Alice for her money, if sufficient funds should not be forthcoming from Mrs. Greenow. Thereupon, George graciously consented to proceed to his bedroom, and put together his clothes with a view to his visit to the Hall.\n\"I thank Providence, Kate, that circumstances make it impossible for me to stay above two days. I have not linen to last me longer.\"\n\"We'll manage that for you at the Hall.\"\n\"Indeed you won't do anything of the kind. And look, Kate, when I make that excuse don't you offer to do so. I will stay there over to-morrow night, and shall go into Kendal early, so as to catch the express train up on Thursday morning. Don't you throw me over by any counter proposition.\"\nThen they started together in the car, and very few words were said till they reached the old lodge, which stood at the entrance to the place. \"Eh, Mr. George; be that you?\" said the old woman, who came out to swing back for them the broken gate. \"A sight of you is good for sair een.\" It was the same welcome that the inn-keeper had given him, and equally sincere. George had never made himself popular about the place, but he was the heir.\n\"I suppose you had better go into the drawing-room,\" said Kate; \"while I go to my grandfather. You won't find a fire there.\"\n\"Manage it how you please; but don't keep me in the cold very long. Heavens, what a country house! The middle of January, and no fires in the room.\"\n\"And remember, George, when you see him you must say that you regret that you ever displeased him. Now that you are here, don't let there be any further misunderstanding.\"\n\"I think it very probable that there will be,\" said George. \"I only hope he'll let me have the old horse to take me back to Shap if there is. There he is at the front door, so I shan't have to go into the room without a fire.\"\nThe old man was standing at the hall steps when the car drove up, as though to welcome his grandson. He put out his hand to help Kate down the steps, keeping his eye all the time on George's face.\n\"So you've come back,\" the squire said to him.\n[Illustration: \"So you've come back, have you?\" said the Squire.]\n\"Yes, sir;--I've come back, like the prodigal son in the parable.\"\n\"The prodigal son was contrite. I hope you are so.\"\n\"Pretty well for that, sir. I'm sorry there has been any quarrel, and all that, you know.\"\n\"Go in,\" said the squire, very angrily. \"Go in. To expect anything gracious from you would be to expect pearls from swine. Go in.\"\nGeorge went in, shrugging his shoulders as his eyes met his sister's. It was in this fashion that the reconciliation took place between Squire Vavasor and his heir.",
        "paragraph_chars": [
            [
                0,
                509
            ],
            [
                509,
                1423
            ],
            [
                1423,
                2024
            ],
            [
                2024,
                3686
            ],
            [
                3686,
                4371
            ],
            [
                4371,
                7028
            ],
            [
                7028,
                7789
            ],
            [
                7789,
                8278
            ],
            [
                8278,
                8305
            ],
            [
                8305,
                8380
            ],
            [
                8380,
                8443
            ],
            [
                8443,
                8479
            ],
            [
                8479,
                8763
            ],
            [
                8763,
                8825
            ],
            [
                8825,
                8945
            ],
            [
                8945,
                9019
            ],
            [
                9019,
                9146
            ],
            [
                9146,
                9615
            ],
            [
                9615,
                10564
            ],
            [
                10564,
                11691
            ],
            [
                11691,
                11783
            ],
            [
                11783,
                11830
            ],
            [
                11830,
                11909
            ],
            [
                11909,
                12035
            ],
            [
                12035,
                12090
            ],
            [
                12090,
                12246
            ],
            [
                12246,
                12268
            ],
            [
                12268,
                12309
            ],
            [
                12309,
                12315
            ],
            [
                12315,
                12702
            ],
            [
                12702,
                12791
            ],
            [
                12791,
                12930
            ],
            [
                12930,
                12975
            ],
            [
                12975,
                13183
            ],
            [
                13183,
                13197
            ],
            [
                13197,
                13388
            ],
            [
                13388,
                13445
            ],
            [
                13445,
                13637
            ],
            [
                13637,
                13689
            ],
            [
                13689,
                13999
            ],
            [
                13999,
                14025
            ],
            [
                14025,
                14438
            ],
            [
                14438,
                14906
            ],
            [
                14906,
                14952
            ],
            [
                14952,
                15010
            ],
            [
                15010,
                15255
            ],
            [
                15255,
                15332
            ],
            [
                15332,
                15479
            ],
            [
                15479,
                15554
            ],
            [
                15554,
                15813
            ],
            [
                15813,
                15832
            ],
            [
                15832,
                16019
            ],
            [
                16019,
                16081
            ],
            [
                16081,
                16309
            ],
            [
                16309,
                16360
            ],
            [
                16360,
                16582
            ],
            [
                16582,
                16650
            ],
            [
                16650,
                16878
            ],
            [
                16878,
                16908
            ],
            [
                16908,
                17549
            ],
            [
                17549,
                17577
            ],
            [
                17577,
                17585
            ],
            [
                17585,
                17635
            ],
            [
                17635,
                17739
            ],
            [
                17739,
                17789
            ],
            [
                17789,
                18037
            ],
            [
                18037,
                18102
            ],
            [
                18102,
                18424
            ],
            [
                18424,
                18792
            ],
            [
                18792,
                18914
            ],
            [
                18914,
                18999
            ],
            [
                18999,
                19188
            ],
            [
                19188,
                19844
            ],
            [
                19844,
                19946
            ],
            [
                19946,
                20210
            ],
            [
                20210,
                20518
            ],
            [
                20518,
                20648
            ],
            [
                20648,
                20723
            ],
            [
                20723,
                20821
            ],
            [
                20821,
                20889
            ],
            [
                20889,
                20928
            ],
            [
                20928,
                21173
            ],
            [
                21173,
                21416
            ],
            [
                21416,
                21480
            ],
            [
                21480,
                21493
            ],
            [
                21493,
                21530
            ],
            [
                21530,
                21666
            ],
            [
                21666,
                21853
            ],
            [
                21853,
                21995
            ],
            [
                21995,
                22051
            ],
            [
                22051,
                22110
            ],
            [
                22110,
                22151
            ],
            [
                22151,
                22226
            ],
            [
                22226,
                22290
            ],
            [
                22290,
                22494
            ],
            [
                22494,
                22521
            ],
            [
                22521,
                22543
            ],
            [
                22543,
                22619
            ],
            [
                22619,
                23060
            ],
            [
                23060,
                23172
            ],
            [
                23172,
                23584
            ],
            [
                23584,
                23717
            ],
            [
                23717,
                23758
            ],
            [
                23758,
                24049
            ],
            [
                24049,
                24491
            ],
            [
                24491,
                24616
            ],
            [
                24616,
                24765
            ],
            [
                24765,
                24937
            ],
            [
                24937,
                25164
            ],
            [
                25164,
                25361
            ],
            [
                25361,
                25408
            ],
            [
                25408,
                25474
            ],
            [
                25474,
                25541
            ],
            [
                25541,
                25593
            ],
            [
                25593,
                25684
            ],
            [
                25684,
                25815
            ],
            [
                25815,
                25979
            ]
        ],
        "segment_chars": [
            [
                0,
                369
            ],
            [
                369,
                445
            ],
            [
                445,
                509
            ],
            [
                509,
                703
            ],
            [
                703,
                734
            ],
            [
                734,
                960
            ],
            [
                960,
                1031
            ],
            [
                1031,
                1064
            ],
            [
                1064,
                1113
            ],
            [
                1113,
                1186
            ],
            [
                1186,
                1341
            ],
            [
                1341,
                1423
            ],
            [
                1423,
                1519
            ],
            [
                1519,
                1600
            ],
            [
                1600,
                1673
            ],
            [
                1673,
                1825
            ],
            [
                1825,
                1911
            ],
            [
                1911,
                2024
            ],
            [
                2024,
                2082
            ],
            [
                2082,
                2247
            ],
            [
                2247,
                2468
            ],
            [
                2468,
                2651
            ],
            [
                2651,
                2809
            ],
            [
                2809,
                2880
            ],
            [
                2880,
                3136
            ],
            [
                3136,
                3187
            ],
            [
                3187,
                3274
            ],
            [
                3274,
                3581
            ],
            [
                3581,
                3686
            ],
            [
                3686,
                3854
            ],
            [
                3854,
                4042
            ],
            [
                4042,
                4199
            ],
            [
                4199,
                4371
            ],
            [
                4371,
                4469
            ],
            [
                4469,
                4525
            ],
            [
                4525,
                4642
            ],
            [
                4642,
                4847
            ],
            [
                4847,
                5070
            ],
            [
                5070,
                5289
            ],
            [
                5289,
                5398
            ],
            [
                5398,
                5482
            ],
            [
                5482,
                5706
            ],
            [
                5706,
                5738
            ],
            [
                5738,
                5809
            ],
            [
                5809,
                5890
            ],
            [
                5890,
                5982
            ],
            [
                5982,
                6104
            ],
            [
                6104,
                6290
            ],
            [
                6290,
                6384
            ],
            [
                6384,
                6419
            ],
            [
                6419,
                6578
            ],
            [
                6578,
                6698
            ],
            [
                6698,
                6743
            ],
            [
                6743,
                6831
            ],
            [
                6831,
                6900
            ],
            [
                6900,
                6960
            ],
            [
                6960,
                7028
            ],
            [
                7028,
                7253
            ],
            [
                7253,
                7474
            ],
            [
                7474,
                7691
            ],
            [
                7691,
                7789
            ],
            [
                7789,
                7816
            ],
            [
                7816,
                7834
            ],
            [
                7834,
                7935
            ],
            [
                7935,
                8030
            ],
            [
                8030,
                8141
            ],
            [
                8141,
                8278
            ],
            [
                8278,
                8305
            ],
            [
                8305,
                8315
            ],
            [
                8315,
                8351
            ],
            [
                8351,
                8380
            ],
            [
                8380,
                8412
            ],
            [
                8412,
                8443
            ],
            [
                8443,
                8479
            ],
            [
                8479,
                8584
            ],
            [
                8584,
                8648
            ],
            [
                8648,
                8763
            ],
            [
                8763,
                8808
            ],
            [
                8808,
                8825
            ],
            [
                8825,
                8839
            ],
            [
                8839,
                8882
            ],
            [
                8882,
                8945
            ],
            [
                8945,
                8956
            ],
            [
                8956,
                8971
            ],
            [
                8971,
                9019
            ],
            [
                9019,
                9066
            ],
            [
                9066,
                9146
            ],
            [
                9146,
                9303
            ],
            [
                9303,
                9323
            ],
            [
                9323,
                9340
            ],
            [
                9340,
                9460
            ],
            [
                9460,
                9576
            ],
            [
                9576,
                9615
            ],
            [
                9615,
                9724
            ],
            [
                9724,
                9812
            ],
            [
                9812,
                10115
            ],
            [
                10115,
                10157
            ],
            [
                10157,
                10227
            ],
            [
                10227,
                10375
            ],
            [
                10375,
                10564
            ],
            [
                10564,
                10729
            ],
            [
                10729,
                10898
            ],
            [
                10898,
                11015
            ],
            [
                11015,
                11182
            ],
            [
                11182,
                11297
            ],
            [
                11297,
                11345
            ],
            [
                11345,
                11691
            ],
            [
                11691,
                11783
            ],
            [
                11783,
                11803
            ],
            [
                11803,
                11830
            ],
            [
                11830,
                11909
            ],
            [
                11909,
                11925
            ],
            [
                11925,
                11966
            ],
            [
                11966,
                12035
            ],
            [
                12035,
                12090
            ],
            [
                12090,
                12140
            ],
            [
                12140,
                12212
            ],
            [
                12212,
                12246
            ],
            [
                12246,
                12268
            ],
            [
                12268,
                12309
            ],
            [
                12309,
                12315
            ],
            [
                12315,
                12350
            ],
            [
                12350,
                12389
            ],
            [
                12389,
                12568
            ],
            [
                12568,
                12702
            ],
            [
                12702,
                12791
            ],
            [
                12791,
                12859
            ],
            [
                12859,
                12930
            ],
            [
                12930,
                12975
            ],
            [
                12975,
                12985
            ],
            [
                12985,
                13008
            ],
            [
                13008,
                13076
            ],
            [
                13076,
                13183
            ],
            [
                13183,
                13197
            ],
            [
                13197,
                13242
            ],
            [
                13242,
                13388
            ],
            [
                13388,
                13445
            ],
            [
                13445,
                13481
            ],
            [
                13481,
                13552
            ],
            [
                13552,
                13637
            ],
            [
                13637,
                13689
            ],
            [
                13689,
                13730
            ],
            [
                13730,
                13750
            ],
            [
                13750,
                13839
            ],
            [
                13839,
                13999
            ],
            [
                13999,
                14025
            ],
            [
                14025,
                14059
            ],
            [
                14059,
                14126
            ],
            [
                14126,
                14249
            ],
            [
                14249,
                14320
            ],
            [
                14320,
                14438
            ],
            [
                14438,
                14577
            ],
            [
                14577,
                14623
            ],
            [
                14623,
                14785
            ],
            [
                14785,
                14906
            ],
            [
                14906,
                14921
            ],
            [
                14921,
                14952
            ],
            [
                14952,
                15010
            ],
            [
                15010,
                15045
            ],
            [
                15045,
                15074
            ],
            [
                15074,
                15184
            ],
            [
                15184,
                15255
            ],
            [
                15255,
                15332
            ],
            [
                15332,
                15479
            ],
            [
                15479,
                15507
            ],
            [
                15507,
                15554
            ],
            [
                15554,
                15578
            ],
            [
                15578,
                15813
            ],
            [
                15813,
                15832
            ],
            [
                15832,
                16019
            ],
            [
                16019,
                16081
            ],
            [
                16081,
                16156
            ],
            [
                16156,
                16309
            ],
            [
                16309,
                16360
            ],
            [
                16360,
                16409
            ],
            [
                16409,
                16496
            ],
            [
                16496,
                16582
            ],
            [
                16582,
                16650
            ],
            [
                16650,
                16691
            ],
            [
                16691,
                16788
            ],
            [
                16788,
                16878
            ],
            [
                16878,
                16908
            ],
            [
                16908,
                16949
            ],
            [
                16949,
                16993
            ],
            [
                16993,
                17175
            ],
            [
                17175,
                17386
            ],
            [
                17386,
                17515
            ],
            [
                17515,
                17549
            ],
            [
                17549,
                17577
            ],
            [
                17577,
                17585
            ],
            [
                17585,
                17635
            ],
            [
                17635,
                17662
            ],
            [
                17662,
                17739
            ],
            [
                17739,
                17789
            ],
            [
                17789,
                17894
            ],
            [
                17894,
                17942
            ],
            [
                17942,
                18037
            ],
            [
                18037,
                18102
            ],
            [
                18102,
                18114
            ],
            [
                18114,
                18216
            ],
            [
                18216,
                18323
            ],
            [
                18323,
                18336
            ],
            [
                18336,
                18424
            ],
            [
                18424,
                18460
            ],
            [
                18460,
                18637
            ],
            [
                18637,
                18792
            ],
            [
                18792,
                18845
            ],
            [
                18845,
                18914
            ],
            [
                18914,
                18967
            ],
            [
                18967,
                18999
            ],
            [
                18999,
                19082
            ],
            [
                19082,
                19188
            ],
            [
                19188,
                19281
            ],
            [
                19281,
                19440
            ],
            [
                19440,
                19518
            ],
            [
                19518,
                19554
            ],
            [
                19554,
                19663
            ],
            [
                19663,
                19783
            ],
            [
                19783,
                19814
            ],
            [
                19814,
                19844
            ],
            [
                19844,
                19878
            ],
            [
                19878,
                19946
            ],
            [
                19946,
                19989
            ],
            [
                19989,
                20107
            ],
            [
                20107,
                20144
            ],
            [
                20144,
                20210
            ],
            [
                20210,
                20341
            ],
            [
                20341,
                20497
            ],
            [
                20497,
                20518
            ],
            [
                20518,
                20571
            ],
            [
                20571,
                20648
            ],
            [
                20648,
                20662
            ],
            [
                20662,
                20675
            ],
            [
                20675,
                20723
            ],
            [
                20723,
                20763
            ],
            [
                20763,
                20821
            ],
            [
                20821,
                20846
            ],
            [
                20846,
                20889
            ],
            [
                20889,
                20928
            ],
            [
                20928,
                21100
            ],
            [
                21100,
                21173
            ],
            [
                21173,
                21323
            ],
            [
                21323,
                21368
            ],
            [
                21368,
                21416
            ],
            [
                21416,
                21480
            ],
            [
                21480,
                21493
            ],
            [
                21493,
                21530
            ],
            [
                21530,
                21600
            ],
            [
                21600,
                21666
            ],
            [
                21666,
                21782
            ],
            [
                21782,
                21853
            ],
            [
                21853,
                21915
            ],
            [
                21915,
                21995
            ],
            [
                21995,
                22051
            ],
            [
                22051,
                22056
            ],
            [
                22056,
                22110
            ],
            [
                22110,
                22151
            ],
            [
                22151,
                22226
            ],
            [
                22226,
                22254
            ],
            [
                22254,
                22290
            ],
            [
                22290,
                22322
            ],
            [
                22322,
                22335
            ],
            [
                22335,
                22385
            ],
            [
                22385,
                22426
            ],
            [
                22426,
                22494
            ],
            [
                22494,
                22521
            ],
            [
                22521,
                22543
            ],
            [
                22543,
                22607
            ],
            [
                22607,
                22619
            ],
            [
                22619,
                22662
            ],
            [
                22662,
                22776
            ],
            [
                22776,
                22887
            ],
            [
                22887,
                22934
            ],
            [
                22934,
                23060
            ],
            [
                23060,
                23119
            ],
            [
                23119,
                23172
            ],
            [
                23172,
                23451
            ],
            [
                23451,
                23584
            ],
            [
                23584,
                23680
            ],
            [
                23680,
                23717
            ],
            [
                23717,
                23758
            ],
            [
                23758,
                23801
            ],
            [
                23801,
                23867
            ],
            [
                23867,
                23996
            ],
            [
                23996,
                24049
            ],
            [
                24049,
                24192
            ],
            [
                24192,
                24223
            ],
            [
                24223,
                24296
            ],
            [
                24296,
                24335
            ],
            [
                24335,
                24415
            ],
            [
                24415,
                24491
            ],
            [
                24491,
                24586
            ],
            [
                24586,
                24616
            ],
            [
                24616,
                24684
            ],
            [
                24684,
                24715
            ],
            [
                24715,
                24765
            ],
            [
                24765,
                24864
            ],
            [
                24864,
                24937
            ],
            [
                24937,
                24997
            ],
            [
                24997,
                25079
            ],
            [
                25079,
                25164
            ],
            [
                25164,
                25265
            ],
            [
                25265,
                25361
            ],
            [
                25361,
                25408
            ],
            [
                25408,
                25456
            ],
            [
                25456,
                25474
            ],
            [
                25474,
                25541
            ],
            [
                25541,
                25573
            ],
            [
                25573,
                25593
            ],
            [
                25593,
                25621
            ],
            [
                25621,
                25684
            ],
            [
                25684,
                25724
            ],
            [
                25724,
                25732
            ],
            [
                25732,
                25807
            ],
            [
                25807,
                25815
            ],
            [
                25815,
                25885
            ],
            [
                25885,
                25979
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                302,
                306
            ],
            [
                81,
                88
            ],
            [
                227,
                232
            ],
            [
                367,
                369
            ],
            [
                369,
                380
            ],
            [
                386,
                390
            ],
            [
                420,
                443
            ],
            [
                443,
                445
            ],
            [
                445,
                509
            ],
            [
                579,
                592
            ],
            [
                527,
                531
            ],
            [
                546,
                552
            ],
            [
                542,
                545
            ],
            [
                532,
                541
            ],
            [
                561,
                573
            ],
            [
                634,
                651
            ],
            [
                701,
                703
            ],
            [
                703,
                734
            ],
            [
                734,
                800
            ],
            [
                808,
                839
            ],
            [
                848,
                903
            ],
            [
                913,
                925
            ],
            [
                931,
                935
            ],
            [
                950,
                952
            ],
            [
                958,
                960
            ],
            [
                1341,
                1360
            ],
            [
                1361,
                1423
            ],
            [
                1423,
                1519
            ],
            [
                1563,
                1580
            ],
            [
                1557,
                1558
            ],
            [
                1673,
                1680
            ],
            [
                1691,
                1746
            ],
            [
                1749,
                1752
            ],
            [
                1794,
                1825
            ],
            [
                1825,
                1911
            ],
            [
                1911,
                1954
            ],
            [
                1965,
                1971
            ],
            [
                1981,
                1989
            ],
            [
                1959,
                1964
            ],
            [
                2022,
                2024
            ],
            [
                2024,
                2035
            ],
            [
                2044,
                2080
            ],
            [
                2088,
                2089
            ],
            [
                2181,
                2184
            ],
            [
                2151,
                2157
            ],
            [
                2158,
                2168
            ],
            [
                2191,
                2207
            ],
            [
                2245,
                2247
            ],
            [
                2247,
                2298
            ],
            [
                2466,
                2468
            ],
            [
                2468,
                2470
            ],
            [
                2488,
                2514
            ],
            [
                2520,
                2527
            ],
            [
                2533,
                2540
            ],
            [
                2544,
                2548
            ],
            [
                2613,
                2614
            ],
            [
                2567,
                2613
            ],
            [
                2649,
                2651
            ],
            [
                2651,
                2653
            ],
            [
                2729,
                2731
            ],
            [
                2659,
                2669
            ],
            [
                2682,
                2718
            ],
            [
                2732,
                2735
            ],
            [
                2778,
                2808
            ],
            [
                2809,
                2811
            ],
            [
                2820,
                2866
            ],
            [
                2878,
                2880
            ],
            [
                2880,
                2907
            ],
            [
                3120,
                3123
            ],
            [
                2911,
                2916
            ],
            [
                3136,
                3187
            ],
            [
                3187,
                3191
            ],
            [
                3249,
                3251
            ],
            [
                3215,
                3218
            ],
            [
                3542,
                3545
            ],
            [
                3224,
                3228
            ],
            [
                3659,
                3665
            ],
            [
                3337,
                3338
            ],
            [
                3286,
                3300
            ],
            [
                3306,
                3337
            ],
            [
                3272,
                3273
            ],
            [
                3232,
                3234
            ],
            [
                3201,
                3202
            ],
            [
                3301,
                3305
            ],
            [
                3387,
                3388
            ],
            [
                3366,
                3371
            ],
            [
                3410,
                3435
            ],
            [
                3261,
                3264
            ],
            [
                3686,
                3716
            ],
            [
                3743,
                3747
            ],
            [
                3763,
                3768
            ],
            [
                3770,
                3774
            ],
            [
                3403,
                3410
            ],
            [
                3748,
                3753
            ],
            [
                3684,
                3686
            ],
            [
                3854,
                3869
            ],
            [
                3972,
                3974
            ],
            [
                4008,
                4011
            ],
            [
                3870,
                3877
            ],
            [
                3888,
                3962
            ],
            [
                4000,
                4002
            ],
            [
                4003,
                4007
            ],
            [
                4037,
                4042
            ],
            [
                4042,
                4059
            ],
            [
                4069,
                4070
            ],
            [
                4080,
                4106
            ],
            [
                4151,
                4196
            ],
            [
                4252,
                4261
            ],
            [
                4272,
                4288
            ],
            [
                4302,
                4313
            ],
            [
                4365,
                4369
            ],
            [
                4318,
                4322
            ],
            [
                4327,
                4338
            ],
            [
                4382,
                4388
            ],
            [
                4396,
                4408
            ],
            [
                4447,
                4449
            ],
            [
                4376,
                4377
            ],
            [
                4860,
                4864
            ],
            [
                4878,
                4886
            ],
            [
                5068,
                5070
            ],
            [
                5076,
                5097
            ],
            [
                5098,
                5155
            ],
            [
                5171,
                5177
            ],
            [
                5185,
                5205
            ],
            [
                5212,
                5236
            ],
            [
                5262,
                5264
            ],
            [
                5276,
                5288
            ],
            [
                5289,
                5358
            ],
            [
                5376,
                5398
            ],
            [
                5398,
                5481
            ],
            [
                5482,
                5549
            ],
            [
                5554,
                5609
            ],
            [
                5611,
                5705
            ],
            [
                5706,
                5724
            ],
            [
                5736,
                5738
            ],
            [
                5738,
                5762
            ],
            [
                5774,
                5777
            ],
            [
                5778,
                5793
            ],
            [
                5798,
                5809
            ],
            [
                5809,
                5825
            ],
            [
                5874,
                5890
            ],
            [
                5890,
                5981
            ],
            [
                6104,
                6122
            ],
            [
                6128,
                6259
            ],
            [
                6288,
                6290
            ],
            [
                6290,
                6305
            ],
            [
                6318,
                6384
            ],
            [
                6384,
                6419
            ],
            [
                6578,
                6588
            ],
            [
                6615,
                6624
            ],
            [
                6629,
                6636
            ],
            [
                6671,
                6698
            ],
            [
                6698,
                6734
            ],
            [
                6741,
                6743
            ],
            [
                6743,
                6776
            ],
            [
                6785,
                6790
            ],
            [
                6834,
                6900
            ],
            [
                6960,
                6967
            ],
            [
                6973,
                6977
            ],
            [
                6984,
                7028
            ],
            [
                7028,
                7044
            ],
            [
                7059,
                7101
            ],
            [
                7116,
                7120
            ],
            [
                7126,
                7195
            ],
            [
                7251,
                7253
            ],
            [
                7253,
                7276
            ],
            [
                7580,
                7597
            ],
            [
                7291,
                7300
            ],
            [
                7628,
                7661
            ],
            [
                7487,
                7492
            ],
            [
                7278,
                7281
            ],
            [
                7499,
                7502
            ],
            [
                7689,
                7691
            ],
            [
                7728,
                7731
            ],
            [
                7739,
                7783
            ],
            [
                7784,
                7789
            ],
            [
                7789,
                7816
            ],
            [
                7816,
                7833
            ],
            [
                8278,
                8305
            ],
            [
                8305,
                8315
            ],
            [
                8315,
                8328
            ],
            [
                8349,
                8351
            ],
            [
                8351,
                8369
            ],
            [
                8377,
                8380
            ],
            [
                8380,
                8395
            ],
            [
                8402,
                8412
            ],
            [
                8585,
                8595
            ],
            [
                8627,
                8640
            ],
            [
                8609,
                8620
            ],
            [
                8646,
                8648
            ],
            [
                8648,
                8763
            ],
            [
                8763,
                8795
            ],
            [
                8798,
                8808
            ],
            [
                8808,
                8825
            ],
            [
                8825,
                8837
            ],
            [
                8839,
                8840
            ],
            [
                8841,
                8846
            ],
            [
                8880,
                8882
            ],
            [
                8882,
                8893
            ],
            [
                8899,
                8915
            ],
            [
                8918,
                8932
            ],
            [
                8933,
                8945
            ],
            [
                8945,
                8956
            ],
            [
                8956,
                8971
            ],
            [
                8971,
                9019
            ],
            [
                9019,
                9064
            ],
            [
                9146,
                9196
            ],
            [
                9247,
                9278
            ],
            [
                9301,
                9303
            ],
            [
                9303,
                9323
            ],
            [
                9323,
                9340
            ],
            [
                9340,
                9364
            ],
            [
                9378,
                9432
            ],
            [
                9435,
                9460
            ],
            [
                9460,
                9559
            ],
            [
                9574,
                9576
            ],
            [
                9576,
                9615
            ],
            [
                9615,
                9634
            ],
            [
                9653,
                9697
            ],
            [
                9701,
                9705
            ],
            [
                9715,
                9724
            ],
            [
                9724,
                9741
            ],
            [
                9765,
                9779
            ],
            [
                9785,
                9788
            ],
            [
                9792,
                9812
            ],
            [
                9812,
                9834
            ],
            [
                9839,
                9845
            ],
            [
                9869,
                9887
            ],
            [
                9890,
                9894
            ],
            [
                9866,
                9868
            ],
            [
                9954,
                9982
            ],
            [
                10047,
                10066
            ],
            [
                10079,
                10115
            ],
            [
                10115,
                10123
            ],
            [
                10171,
                10173
            ],
            [
                10129,
                10134
            ],
            [
                10316,
                10319
            ],
            [
                10199,
                10206
            ],
            [
                10331,
                10374
            ],
            [
                10564,
                10729
            ],
            [
                10729,
                10749
            ],
            [
                10835,
                10836
            ],
            [
                10750,
                10813
            ],
            [
                10825,
                10835
            ],
            [
                10896,
                10898
            ],
            [
                10913,
                10920
            ],
            [
                10908,
                10911
            ],
            [
                10902,
                10907
            ],
            [
                10922,
                10931
            ],
            [
                10944,
                10980
            ],
            [
                10985,
                10990
            ],
            [
                10981,
                10984
            ],
            [
                10991,
                11013
            ],
            [
                10911,
                10912
            ],
            [
                11099,
                11101
            ],
            [
                11152,
                11182
            ],
            [
                11182,
                11199
            ],
            [
                11207,
                11296
            ],
            [
                11297,
                11345
            ],
            [
                11345,
                11357
            ],
            [
                11366,
                11374
            ],
            [
                11391,
                11400
            ],
            [
                11415,
                11419
            ],
            [
                11358,
                11365
            ],
            [
                11432,
                11433
            ],
            [
                11409,
                11414
            ],
            [
                11631,
                11634
            ],
            [
                11420,
                11432
            ],
            [
                11517,
                11536
            ],
            [
                11582,
                11625
            ],
            [
                11537,
                11540
            ],
            [
                11559,
                11570
            ],
            [
                11689,
                11691
            ],
            [
                11691,
                11746
            ],
            [
                11752,
                11772
            ],
            [
                11781,
                11783
            ],
            [
                11783,
                11803
            ],
            [
                11807,
                11830
            ],
            [
                11830,
                11854
            ],
            [
                11866,
                11909
            ],
            [
                11909,
                11925
            ],
            [
                11925,
                11966
            ],
            [
                11966,
                12035
            ],
            [
                12035,
                12090
            ],
            [
                12090,
                12112
            ],
            [
                12138,
                12140
            ],
            [
                12140,
                12212
            ],
            [
                12212,
                12246
            ],
            [
                12246,
                12268
            ],
            [
                12268,
                12271
            ],
            [
                12301,
                12309
            ],
            [
                12309,
                12315
            ],
            [
                12315,
                12350
            ],
            [
                12350,
                12362
            ],
            [
                12367,
                12389
            ],
            [
                12389,
                12400
            ],
            [
                12424,
                12568
            ],
            [
                12568,
                12580
            ],
            [
                12591,
                12617
            ],
            [
                12638,
                12673
            ],
            [
                12678,
                12702
            ],
            [
                12702,
                12772
            ],
            [
                12788,
                12791
            ],
            [
                12791,
                12859
            ],
            [
                12859,
                12905
            ],
            [
                12927,
                12930
            ],
            [
                12930,
                12975
            ],
            [
                12975,
                12985
            ],
            [
                12991,
                13008
            ],
            [
                13008,
                13029
            ],
            [
                13065,
                13074
            ],
            [
                13183,
                13194
            ],
            [
                13389,
                13445
            ],
            [
                13445,
                13481
            ],
            [
                13481,
                13552
            ],
            [
                13552,
                13555
            ],
            [
                13569,
                13577
            ],
            [
                13600,
                13637
            ],
            [
                13637,
                13689
            ],
            [
                13689,
                13730
            ],
            [
                13730,
                13750
            ],
            [
                13750,
                13791
            ],
            [
                13803,
                13839
            ],
            [
                13839,
                13847
            ],
            [
                13855,
                13866
            ],
            [
                13941,
                13943
            ],
            [
                13887,
                13932
            ],
            [
                13988,
                13999
            ],
            [
                13999,
                14025
            ],
            [
                14025,
                14059
            ],
            [
                14059,
                14126
            ],
            [
                14346,
                14352
            ],
            [
                14425,
                14427
            ],
            [
                14320,
                14325
            ],
            [
                14358,
                14362
            ],
            [
                14435,
                14438
            ],
            [
                14438,
                14467
            ],
            [
                14477,
                14553
            ],
            [
                14575,
                14577
            ],
            [
                14577,
                14606
            ],
            [
                14621,
                14623
            ],
            [
                14623,
                14678
            ],
            [
                14681,
                14759
            ],
            [
                14833,
                14846
            ],
            [
                14904,
                14906
            ],
            [
                14906,
                14909
            ],
            [
                14922,
                14949
            ],
            [
                14919,
                14920
            ],
            [
                15045,
                15072
            ],
            [
                15162,
                15184
            ],
            [
                15376,
                15415
            ],
            [
                15477,
                15479
            ],
            [
                15479,
                15507
            ],
            [
                15507,
                15526
            ],
            [
                15552,
                15554
            ],
            [
                15554,
                15569
            ],
            [
                15576,
                15578
            ],
            [
                15578,
                15810
            ],
            [
                15837,
                15844
            ],
            [
                15848,
                15880
            ],
            [
                15894,
                15921
            ],
            [
                15969,
                16019
            ],
            [
                16019,
                16081
            ],
            [
                16081,
                16113
            ],
            [
                16128,
                16156
            ],
            [
                16156,
                16173
            ],
            [
                16179,
                16181
            ],
            [
                16174,
                16178
            ],
            [
                16182,
                16222
            ],
            [
                16246,
                16255
            ],
            [
                16259,
                16264
            ],
            [
                16273,
                16306
            ],
            [
                16361,
                16377
            ],
            [
                16379,
                16384
            ],
            [
                16389,
                16409
            ],
            [
                16418,
                16442
            ],
            [
                16452,
                16496
            ],
            [
                16496,
                16499
            ],
            [
                16521,
                16539
            ],
            [
                16543,
                16582
            ],
            [
                16582,
                16627
            ],
            [
                16629,
                16650
            ],
            [
                16691,
                16726
            ],
            [
                16734,
                16738
            ],
            [
                16751,
                16788
            ],
            [
                16788,
                16812
            ],
            [
                16814,
                16875
            ],
            [
                16878,
                16908
            ],
            [
                16908,
                16949
            ],
            [
                16949,
                16955
            ],
            [
                16972,
                16993
            ],
            [
                16993,
                17039
            ],
            [
                17059,
                17082
            ],
            [
                17094,
                17122
            ],
            [
                17083,
                17093
            ],
            [
                17122,
                17141
            ],
            [
                17147,
                17175
            ],
            [
                17294,
                17379
            ],
            [
                17384,
                17386
            ],
            [
                17386,
                17436
            ],
            [
                17450,
                17479
            ],
            [
                17493,
                17496
            ],
            [
                17497,
                17514
            ],
            [
                17585,
                17586
            ],
            [
                17586,
                17635
            ],
            [
                17635,
                17662
            ],
            [
                17662,
                17685
            ],
            [
                17687,
                17739
            ],
            [
                17739,
                17789
            ],
            [
                17789,
                17864
            ],
            [
                17892,
                17894
            ],
            [
                17894,
                17942
            ],
            [
                17942,
                17986
            ],
            [
                18156,
                18186
            ],
            [
                18014,
                18017
            ],
            [
                18191,
                18201
            ],
            [
                18214,
                18216
            ],
            [
                18216,
                18272
            ],
            [
                18297,
                18323
            ],
            [
                18323,
                18334
            ],
            [
                18492,
                18520
            ],
            [
                18555,
                18557
            ],
            [
                18563,
                18570
            ],
            [
                18577,
                18584
            ],
            [
                18480,
                18482
            ],
            [
                18607,
                18637
            ],
            [
                18637,
                18664
            ],
            [
                18671,
                18734
            ],
            [
                18747,
                18792
            ],
            [
                18792,
                18845
            ],
            [
                18845,
                18914
            ],
            [
                18914,
                18967
            ],
            [
                18967,
                18999
            ],
            [
                18999,
                19082
            ],
            [
                19082,
                19188
            ],
            [
                19188,
                19281
            ],
            [
                19371,
                19378
            ],
            [
                19391,
                19440
            ],
            [
                19511,
                19513
            ],
            [
                19502,
                19510
            ],
            [
                19516,
                19518
            ],
            [
                19518,
                19554
            ],
            [
                19554,
                19591
            ],
            [
                19637,
                19663
            ],
            [
                19663,
                19749
            ],
            [
                19754,
                19763
            ],
            [
                19824,
                19844
            ],
            [
                19921,
                19922
            ],
            [
                19878,
                19921
            ],
            [
                19924,
                19946
            ],
            [
                19946,
                19989
            ],
            [
                19989,
                20008
            ],
            [
                20015,
                20099
            ],
            [
                20105,
                20107
            ],
            [
                20107,
                20144
            ],
            [
                20178,
                20182
            ],
            [
                20151,
                20154
            ],
            [
                20210,
                20235
            ],
            [
                20254,
                20321
            ],
            [
                20336,
                20341
            ],
            [
                20341,
                20355
            ],
            [
                20366,
                20412
            ],
            [
                20458,
                20462
            ],
            [
                20463,
                20497
            ],
            [
                20497,
                20514
            ],
            [
                20518,
                20571
            ],
            [
                20571,
                20648
            ],
            [
                20648,
                20662
            ],
            [
                20662,
                20673
            ],
            [
                20680,
                20702
            ],
            [
                20717,
                20723
            ],
            [
                20723,
                20763
            ],
            [
                20763,
                20821
            ],
            [
                20821,
                20846
            ],
            [
                20846,
                20889
            ],
            [
                20889,
                20928
            ],
            [
                20928,
                20971
            ],
            [
                20987,
                21022
            ],
            [
                21025,
                21100
            ],
            [
                21100,
                21173
            ],
            [
                21173,
                21198
            ],
            [
                21222,
                21253
            ],
            [
                21293,
                21323
            ],
            [
                21368,
                21416
            ],
            [
                21416,
                21480
            ],
            [
                21530,
                21600
            ],
            [
                21600,
                21666
            ],
            [
                21666,
                21674
            ],
            [
                21678,
                21688
            ],
            [
                21691,
                21699
            ],
            [
                21729,
                21769
            ],
            [
                21780,
                21782
            ],
            [
                21782,
                21831
            ],
            [
                21842,
                21844
            ],
            [
                21850,
                21853
            ],
            [
                21853,
                21915
            ],
            [
                21968,
                21979
            ],
            [
                21980,
                21995
            ],
            [
                21995,
                22051
            ],
            [
                22051,
                22054
            ],
            [
                22110,
                22151
            ],
            [
                22151,
                22158
            ],
            [
                22177,
                22226
            ],
            [
                22226,
                22254
            ],
            [
                22254,
                22290
            ],
            [
                22290,
                22322
            ],
            [
                22322,
                22335
            ],
            [
                22335,
                22368
            ],
            [
                22387,
                22426
            ],
            [
                22426,
                22494
            ],
            [
                22494,
                22518
            ],
            [
                22544,
                22580
            ],
            [
                22589,
                22607
            ],
            [
                22607,
                22619
            ],
            [
                22619,
                22662
            ],
            [
                22662,
                22775
            ],
            [
                22934,
                23060
            ],
            [
                23060,
                23064
            ],
            [
                23072,
                23119
            ],
            [
                23119,
                23141
            ],
            [
                23149,
                23151
            ],
            [
                23164,
                23169
            ],
            [
                23142,
                23146
            ],
            [
                23172,
                23186
            ],
            [
                23197,
                23271
            ],
            [
                23332,
                23388
            ],
            [
                23400,
                23451
            ],
            [
                23462,
                23492
            ],
            [
                23534,
                23545
            ],
            [
                23574,
                23584
            ],
            [
                23584,
                23586
            ],
            [
                23659,
                23663
            ],
            [
                23670,
                23678
            ],
            [
                23678,
                23680
            ],
            [
                23867,
                23884
            ],
            [
                23900,
                23910
            ],
            [
                23917,
                23938
            ],
            [
                23945,
                23971
            ],
            [
                23975,
                23994
            ],
            [
                24054,
                24058
            ],
            [
                24092,
                24096
            ],
            [
                24079,
                24082
            ],
            [
                24086,
                24087
            ],
            [
                24122,
                24148
            ],
            [
                24162,
                24191
            ],
            [
                24192,
                24223
            ],
            [
                24223,
                24241
            ],
            [
                24243,
                24269
            ],
            [
                24279,
                24296
            ],
            [
                24296,
                24335
            ],
            [
                24335,
                24415
            ],
            [
                24415,
                24491
            ],
            [
                24765,
                24766
            ],
            [
                24770,
                24786
            ],
            [
                24788,
                24800
            ],
            [
                24805,
                24864
            ],
            [
                24887,
                24937
            ],
            [
                24937,
                24997
            ],
            [
                24997,
                25079
            ],
            [
                25079,
                25108
            ],
            [
                25161,
                25164
            ],
            [
                25164,
                25211
            ],
            [
                25216,
                25265
            ],
            [
                25265,
                25329
            ],
            [
                25343,
                25361
            ],
            [
                25361,
                25408
            ],
            [
                25474,
                25484
            ],
            [
                25502,
                25541
            ],
            [
                25541,
                25573
            ],
            [
                25573,
                25587
            ],
            [
                25590,
                25593
            ],
            [
                25593,
                25605
            ],
            [
                25614,
                25621
            ],
            [
                25621,
                25684
            ],
            [
                25684,
                25724
            ],
            [
                25724,
                25732
            ],
            [
                25732,
                25805
            ],
            [
                25815,
                25885
            ],
            [
                25885,
                25979
            ]
        ],
        "row_chars": [
            [
                0,
                369
            ],
            [
                369,
                445
            ],
            [
                445,
                509
            ],
            [
                509,
                703
            ],
            [
                703,
                734
            ],
            [
                734,
                960
            ],
            [
                960,
                1031
            ],
            [
                1031,
                1064
            ],
            [
                1064,
                1113
            ],
            [
                1113,
                1186
            ],
            [
                1186,
                1341
            ],
            [
                1341,
                1423
            ],
            [
                1423,
                1519
            ],
            [
                1519,
                1825
            ],
            [
                1825,
                1911
            ],
            [
                1911,
                2024
            ],
            [
                2024,
                2247
            ],
            [
                2247,
                2468
            ],
            [
                2468,
                2651
            ],
            [
                2651,
                2809
            ],
            [
                2809,
                2880
            ],
            [
                2880,
                3187
            ],
            [
                3187,
                3854
            ],
            [
                3854,
                4042
            ],
            [
                4042,
                4199
            ],
            [
                4199,
                4371
            ],
            [
                4371,
                5070
            ],
            [
                5070,
                5289
            ],
            [
                5289,
                5398
            ],
            [
                5398,
                5482
            ],
            [
                5482,
                5706
            ],
            [
                5706,
                5738
            ],
            [
                5738,
                5809
            ],
            [
                5809,
                5890
            ],
            [
                5890,
                5982
            ],
            [
                5982,
                6104
            ],
            [
                6104,
                6290
            ],
            [
                6290,
                6384
            ],
            [
                6384,
                6419
            ],
            [
                6419,
                6578
            ],
            [
                6578,
                6698
            ],
            [
                6698,
                6743
            ],
            [
                6743,
                6900
            ],
            [
                6900,
                6960
            ],
            [
                6960,
                7028
            ],
            [
                7028,
                7253
            ],
            [
                7253,
                7691
            ],
            [
                7691,
                7789
            ],
            [
                7789,
                7816
            ],
            [
                7816,
                7834
            ],
            [
                7834,
                7935
            ],
            [
                7935,
                8030
            ],
            [
                8030,
                8141
            ],
            [
                8141,
                8278
            ],
            [
                8278,
                8305
            ],
            [
                8305,
                8315
            ],
            [
                8315,
                8351
            ],
            [
                8351,
                8380
            ],
            [
                8380,
                8412
            ],
            [
                8412,
                8443
            ],
            [
                8443,
                8479
            ],
            [
                8479,
                8584
            ],
            [
                8584,
                8648
            ],
            [
                8648,
                8763
            ],
            [
                8763,
                8808
            ],
            [
                8808,
                8825
            ],
            [
                8825,
                8882
            ],
            [
                8882,
                8945
            ],
            [
                8945,
                8956
            ],
            [
                8956,
                8971
            ],
            [
                8971,
                9019
            ],
            [
                9019,
                9066
            ],
            [
                9066,
                9146
            ],
            [
                9146,
                9303
            ],
            [
                9303,
                9323
            ],
            [
                9323,
                9340
            ],
            [
                9340,
                9460
            ],
            [
                9460,
                9576
            ],
            [
                9576,
                9615
            ],
            [
                9615,
                9724
            ],
            [
                9724,
                9812
            ],
            [
                9812,
                10115
            ],
            [
                10115,
                10375
            ],
            [
                10375,
                10564
            ],
            [
                10564,
                10729
            ],
            [
                10729,
                10898
            ],
            [
                10898,
                11182
            ],
            [
                11182,
                11297
            ],
            [
                11297,
                11345
            ],
            [
                11345,
                11691
            ],
            [
                11691,
                11783
            ],
            [
                11783,
                11803
            ],
            [
                11803,
                11830
            ],
            [
                11830,
                11909
            ],
            [
                11909,
                11925
            ],
            [
                11925,
                11966
            ],
            [
                11966,
                12035
            ],
            [
                12035,
                12090
            ],
            [
                12090,
                12140
            ],
            [
                12140,
                12212
            ],
            [
                12212,
                12246
            ],
            [
                12246,
                12268
            ],
            [
                12268,
                12309
            ],
            [
                12309,
                12315
            ],
            [
                12315,
                12350
            ],
            [
                12350,
                12389
            ],
            [
                12389,
                12568
            ],
            [
                12568,
                12702
            ],
            [
                12702,
                12791
            ],
            [
                12791,
                12859
            ],
            [
                12859,
                12930
            ],
            [
                12930,
                12975
            ],
            [
                12975,
                12985
            ],
            [
                12985,
                13008
            ],
            [
                13008,
                13076
            ],
            [
                13076,
                13183
            ],
            [
                13183,
                13197
            ],
            [
                13197,
                13242
            ],
            [
                13242,
                13388
            ],
            [
                13388,
                13445
            ],
            [
                13445,
                13481
            ],
            [
                13481,
                13552
            ],
            [
                13552,
                13637
            ],
            [
                13637,
                13689
            ],
            [
                13689,
                13730
            ],
            [
                13730,
                13750
            ],
            [
                13750,
                13839
            ],
            [
                13839,
                13999
            ],
            [
                13999,
                14025
            ],
            [
                14025,
                14059
            ],
            [
                14059,
                14126
            ],
            [
                14126,
                14249
            ],
            [
                14249,
                14320
            ],
            [
                14320,
                14438
            ],
            [
                14438,
                14577
            ],
            [
                14577,
                14623
            ],
            [
                14623,
                14906
            ],
            [
                14906,
                14952
            ],
            [
                14952,
                15010
            ],
            [
                15010,
                15045
            ],
            [
                15045,
                15184
            ],
            [
                15184,
                15255
            ],
            [
                15255,
                15332
            ],
            [
                15332,
                15479
            ],
            [
                15479,
                15507
            ],
            [
                15507,
                15554
            ],
            [
                15554,
                15578
            ],
            [
                15578,
                15813
            ],
            [
                15813,
                15832
            ],
            [
                15832,
                16019
            ],
            [
                16019,
                16081
            ],
            [
                16081,
                16156
            ],
            [
                16156,
                16309
            ],
            [
                16309,
                16360
            ],
            [
                16360,
                16409
            ],
            [
                16409,
                16496
            ],
            [
                16496,
                16582
            ],
            [
                16582,
                16650
            ],
            [
                16650,
                16691
            ],
            [
                16691,
                16788
            ],
            [
                16788,
                16878
            ],
            [
                16878,
                16908
            ],
            [
                16908,
                16949
            ],
            [
                16949,
                16993
            ],
            [
                16993,
                17175
            ],
            [
                17175,
                17386
            ],
            [
                17386,
                17515
            ],
            [
                17515,
                17549
            ],
            [
                17549,
                17577
            ],
            [
                17577,
                17585
            ],
            [
                17585,
                17635
            ],
            [
                17635,
                17662
            ],
            [
                17662,
                17739
            ],
            [
                17739,
                17789
            ],
            [
                17789,
                17894
            ],
            [
                17894,
                17942
            ],
            [
                17942,
                18216
            ],
            [
                18216,
                18323
            ],
            [
                18323,
                18336
            ],
            [
                18336,
                18424
            ],
            [
                18424,
                18460
            ],
            [
                18460,
                18637
            ],
            [
                18637,
                18792
            ],
            [
                18792,
                18845
            ],
            [
                18845,
                18914
            ],
            [
                18914,
                18967
            ],
            [
                18967,
                18999
            ],
            [
                18999,
                19082
            ],
            [
                19082,
                19188
            ],
            [
                19188,
                19281
            ],
            [
                19281,
                19440
            ],
            [
                19440,
                19518
            ],
            [
                19518,
                19554
            ],
            [
                19554,
                19663
            ],
            [
                19663,
                19783
            ],
            [
                19783,
                19814
            ],
            [
                19814,
                19844
            ],
            [
                19844,
                19878
            ],
            [
                19878,
                19946
            ],
            [
                19946,
                19989
            ],
            [
                19989,
                20107
            ],
            [
                20107,
                20144
            ],
            [
                20144,
                20210
            ],
            [
                20210,
                20341
            ],
            [
                20341,
                20497
            ],
            [
                20497,
                20518
            ],
            [
                20518,
                20571
            ],
            [
                20571,
                20648
            ],
            [
                20648,
                20662
            ],
            [
                20662,
                20723
            ],
            [
                20723,
                20763
            ],
            [
                20763,
                20821
            ],
            [
                20821,
                20846
            ],
            [
                20846,
                20889
            ],
            [
                20889,
                20928
            ],
            [
                20928,
                21100
            ],
            [
                21100,
                21173
            ],
            [
                21173,
                21323
            ],
            [
                21323,
                21368
            ],
            [
                21368,
                21416
            ],
            [
                21416,
                21480
            ],
            [
                21480,
                21493
            ],
            [
                21493,
                21530
            ],
            [
                21530,
                21600
            ],
            [
                21600,
                21666
            ],
            [
                21666,
                21782
            ],
            [
                21782,
                21853
            ],
            [
                21853,
                21915
            ],
            [
                21915,
                21995
            ],
            [
                21995,
                22051
            ],
            [
                22051,
                22056
            ],
            [
                22056,
                22110
            ],
            [
                22110,
                22151
            ],
            [
                22151,
                22226
            ],
            [
                22226,
                22254
            ],
            [
                22254,
                22290
            ],
            [
                22290,
                22322
            ],
            [
                22322,
                22335
            ],
            [
                22335,
                22426
            ],
            [
                22426,
                22494
            ],
            [
                22494,
                22521
            ],
            [
                22521,
                22543
            ],
            [
                22543,
                22607
            ],
            [
                22607,
                22619
            ],
            [
                22619,
                22662
            ],
            [
                22662,
                22776
            ],
            [
                22776,
                22887
            ],
            [
                22887,
                22934
            ],
            [
                22934,
                23060
            ],
            [
                23060,
                23119
            ],
            [
                23119,
                23172
            ],
            [
                23172,
                23451
            ],
            [
                23451,
                23584
            ],
            [
                23584,
                23680
            ],
            [
                23680,
                23717
            ],
            [
                23717,
                23758
            ],
            [
                23758,
                23801
            ],
            [
                23801,
                23867
            ],
            [
                23867,
                23996
            ],
            [
                23996,
                24049
            ],
            [
                24049,
                24192
            ],
            [
                24192,
                24223
            ],
            [
                24223,
                24296
            ],
            [
                24296,
                24335
            ],
            [
                24335,
                24415
            ],
            [
                24415,
                24491
            ],
            [
                24491,
                24586
            ],
            [
                24586,
                24616
            ],
            [
                24616,
                24684
            ],
            [
                24684,
                24715
            ],
            [
                24715,
                24765
            ],
            [
                24765,
                24864
            ],
            [
                24864,
                24937
            ],
            [
                24937,
                24997
            ],
            [
                24997,
                25079
            ],
            [
                25079,
                25164
            ],
            [
                25164,
                25265
            ],
            [
                25265,
                25361
            ],
            [
                25361,
                25408
            ],
            [
                25408,
                25456
            ],
            [
                25456,
                25474
            ],
            [
                25474,
                25541
            ],
            [
                25541,
                25573
            ],
            [
                25573,
                25593
            ],
            [
                25593,
                25621
            ],
            [
                25621,
                25684
            ],
            [
                25684,
                25724
            ],
            [
                25724,
                25732
            ],
            [
                25732,
                25807
            ],
            [
                25807,
                25815
            ],
            [
                25815,
                25885
            ],
            [
                25885,
                25979
            ]
        ]
    },
    "abridged": {
        "text": "When George Vavasor left Mr. Scruby's office, he knew that he needed money. And he knew that he had a very disagreeable job ahead of him. He did not like the task of borrowing his cousin Alice's money.\nWe are apt to imagine that rogues and swindlers carry out their dirty tricks with gusto and delight. In this, I think we are wrong. The poor, broken, semi-genteel beggar, who borrows half-sovereigns from all his old acquaintances, aware that they know that he will never repay them, suffers a little agony each time he asks for money. It is a comfortless, unsatisfying trade, that of living upon other people's money.\nHow was George Vavasor to make his first step towards getting his hand into his cousin's purse? Although she had shuddered at his approach, he knew that the money would be forthcoming when he demanded it - but how was he to make the demand? If he wrote to her, should he simply ask for money, and make no allusion to his love? If he went to her in person, should he make it a mere business visit?\nHe resolved that Kate should do the work for him, and act as his ambassador in money matters. He could talk to Kate as he could not talk to Alice. He decided to see Kate, and with this purpose he went north to Westmorland, to a small wayside inn at Shap among the fells. He wrote to tell his sister he would be there, and begged her to visit him the morning after his arrival.\nHe reached the place late in the evening by train. There is a station at Shap, for which the landlord at the inn, for one, is not thankful. Shap used to owe all its life to the stage-coach, being a stage on the road from Lancaster to Carlisle. It is a high, bleak, thinly-populated place, and Vavasor reached the little inn on a pitch dark, windy night.\n\"What a beastly past of the country,\" he said to himself, resolving that he would certainly sell Vavasor Hall if it ever became his. \"What trash it is, hanging on to such a place as that, simply because one's ancestors have done so. But the world does not hold a more ignorant, useless old fool than my grandfather.\"\nGeorge rejected the landlord's friendly greeting, merely grunting in reply. He passed the evening in a little sitting-room in solitude, giving no encouragement to the landlord, who looked in three or four times, till at last George said that he wished to be alone.\n\"He was always one of them cankery chiels as never have a kindly word,\" said the landlord. \"Seems as though that raw slash in his face had gone right through into his heart.\"\nAfter that George was left alone, and sat thinking whether it would be better to ask Alice for two thousand pounds at once, so as to save him from the disagreeable necessity of a second borrowing before their marriage.\nHe was very uneasy. He had flattered himself all along that his cousin loved him. He had felt sure of it in Switzerland. When she had determined to give up John Grey, of course he had told himself the same thing.\nDark, selfish, and dishonest as he was, he had, nevertheless, enjoyed something of a lover's true pleasure in believing that Alice had still loved him. But his joy had been turned into gall during that interview in Queen Anne Street. He had read the truth at a glance. When Alice managed to escape his embrace, he knew the whole truth. He was sore at heart, and very angry. He could have readily spurned her then, and would have done so had not his need for her money restrained him. He knew this, and he told himself that he was a rascal.\nVavasor Hall was about five miles from Shap, and it was not easy for Kate to get over to the village without informing her grandfather. She could, indeed, walk; but her brother would not like to see her enter the Lowther Arms dirty and bedraggled. So she had to ask her grandfather to lend her the jaunting-car.\n\"Where do you want to go?\" he asked sharply.\n\"Only to Shap, grandpapa.\"\n\"To Shap! what on earth for? There are no shops there.\"\n\"I am not going shopping. My brother is at the inn,\" she said. \"I had not intended to tell you, as I did not wish to mention his name till you had consented to receive him here.\"\n\"And he expects to come here now, does he?\" said the squire.\n\"Oh, no, sir, I don't think so. He has come simply to see me - about business, I believe.\"\n\"Business! what business? I suppose he wants to get your money from you?\"\n\"I think it is with reference to his marriage.\"\n\"Look here, Kate; if ever you lend him your money, I will never speak to him again. And more than that! Look here, Kate. In spite of all that has passed, the property will become his for his life when I die - unless I change my will. If he gets your money from you, I will change it, and he shall not be a shilling richer at my death. You can have the horse to go to Shap.\"\nWhat unlucky chance had put this idea into the old squire's head this morning? Kate had resolved to ask her brother to use her little fortune. She feared that he was coming about his cousin's money - that he wished to take up his cousin's offer; and Kate was determined that he must be saved from such temptation. She knew he needed money for the election contest; and she was almost sure that he was a poor man.\nAs she was jogged along over the rough road to Shap, she made up her mind that Aunt Greenow would be the proper person to defray the expense of the coming election. To give Kate her due, she would have given up every shilling of her own money without hesitation. Perhaps she would not have been so opposed to his taking Alice's money, if Alice had simply been his cousin, supporting him in the general Vavasor interest. But she could not bear to think that her brother should take the money of the girl whom he was engaged to marry.\nAunt Greenow's money she thought was fair game. Aunt Greenow had made generous offers to Kate herself, which she had declined; but she felt that she need not hesitate to ask for assistance for her brother.\n\"Grandpapa knows that you are here, George,\" said Kate, after their first greeting.\n\"The deuce he does! why did you tell him?\"\n\"I could not get the car without letting him know why I wanted it.\"\n\"What nonsense! as if you couldn't have made any excuse! I was particularly anxious that he should not guess that I am here.\"\n\"I don't see that it can make any difference, George.\"\n\"But I see that it can. It may prevent my ever being able to get near him again before he dies. What did he say about my coming?\"\n\"He didn't say much.\"\n\"He didn't invite he over there?\"\n\"No.\"\n\"I should not have gone if he had. I don't know that I ever shall go. To be there long enough to make him alter his will, and leave me in the position which I have a right to expect, would take more time than the whole property is worth. And he would try to tie me down in some way - perhaps ask me to give up my notion of going into Parliament.\"\n\"He might ask you, but he would not make it ground for another quarrel.\"\n\"He is so unreasonable and ignorant that I am better away from him. But, Kate, you have not congratulated me on my engagement.\"\n\"Indeed I did, George, when I wrote to you.\"\n\"Did you? I had forgotten. I don't know that any great congratulations are necessary.\"\n\"Oh, George! You know you have always longed to make her your wife.\"\n\"I don't know anything of the kind. You have always been under a match-making hallucination on that point. But you have succeeded, and are entitled to your triumph.\"\n\"I don't want any triumph; you ought to know that.\"\n\"But I'll tell you what I do want, Kate. I want some money.\" Then he paused, but as she did not answer, he was obliged to go on speaking. \"I'm not sure that I'm right in making this attempt to get into Parliament. It's beyond my reach.\"\n\"Don't say that, George.\"\n\"Ah, but I can't help feeling it. I need hardly tell you that I am ready to risk anything of my own. But I have no ready money left.\"\n\"Whatever I have can be yours tomorrow,\" said Kate, in a hesitating voice, which too plainly pronounced her misery. She could not refrain herself. Though her grandfather's threat was ringing in her ears - though she knew that she might be ruining her brother by proposing such a loan - she could not help offering.\n\"No, I shall not take your money. I should not think it right to make you a beggar. Therefore let there be an end of it,\" said George loftily.\n\"What is it you wish then?\" said Kate, who knew already.\n\"I will explain. When Alice and I are married, of course there will be a settlement made on her, and as we are both the grandchildren of the old squire I shall propose that the Vavasor property shall be hers for life in the event of her outliving me. If this is done, there can be no harm in my using some of her property, which would of course become mine when we are married.\"\n\"But the squire might leave the property to whom he pleases.\"\n\"We know very well that he won't leave it out of the family. In fact, he would be only too glad to consent to such an agreement, because it would rob me of all power in the matter. Look here, Kate; don't make difficulties.\" As he looked at her, the scar on his face seemed to open and yawn at her. \"If you won't help me, say so, and I will go back to London.\"\n\"I would do anything in my power to help you, that was not wrong!\"\n\"That is not much of an offer if you keep the power of deciding what is wrong. Will you write to Alice, or better still, go to her, and explain that I want the money?\"\n\"How can I go to London now?\"\n\"You can do it very well, if you choose. But if not, then write to her. It will come much better from you than from me. Explain that I must pay the expenses of this contest in advance, and that I cannot hope for success unless I do so. I cannot expect them to carry on the fight for me, unless they know that the money is there. Scruby has been bitten two or three times by these city fellows, and he is determined not to be bitten again.\"\n\"George, I wish you would try any other scheme but that.\"\n\"There is no other scheme! That's so like a woman; to quarrel with the only plan that is practicable.\"\n\"I do not think you ought to take Alice's money.\"\n\"My dear Kate, you must allow me to be the best judge of what I ought to do. Alice herself understands the matter perfectly. She knows that I cannot obtain this position without money, and has offered her assistance. I would rather that you should tell her how much I want, than that I should do so. That is all.\"\nKate understood that her brother was ashamed; so ashamed that he wanted to use her voice instead of his own. \"I want you to write to her at once,\" he continued; \"since you seem to think that it is not worthwhile to take the trouble of a journey to London.\"\n\"There is no question about the trouble,\" said Kate. \"I would walk to London to get the money for you, if that were all.\"\n\"Do you think that Alice will refuse to lend it me?\" said he, looking into her face.\n\"I am sure that she would not, but I think that you ought not to take it from her. There seems to me to be something sacred about property that belongs to the girl you are going to marry.\"\n\"If there is anything on earth I hate,\" said George, walking about the room, \"it is romance. When it gets mixed up with one's business it plays the devil. It's all nonsense. Alice and I are to be man and wife. All our interests, and all our money, are to be joint property. And yet she is the last person in the world to whom I ought to go for money to improve our prospects? That's infernal nonsense.\"\n\"George, I'll ask Aunt Greenow to lend you the money - or to lend it to me.\"\n\"I don't believe she'd give me a shilling. Moreover, I want it immediately, and the time taken up in letter-writing and negotiations would be fatal. If you won't apply to Alice, I must. Will you do it?\"\nKate was still hesitating when there came a knock at the door, and a little crumpled note was given her. A boy had just brought it across the fell from Vavasor Hall, and Kate knew at once that it was from her grandfather. It was as follows:-\n\"If George wishes to come to the Hall, let him come. If he chooses to tell me that he regrets his conduct to me, I will see him.\"\n\"What is it?\" said George, and Kate put the note into his hand.\n\"I'll do nothing of the kind,\" he said. \"What good should I get by going to the old man's house?\"\n\"Every good,\" said Kate. \"If you don't go now you never can do so.\"\n\"Never till it's my own,\" said George.\n\"If you show him that you are determined to disagree with him, it never will be your own - unless, indeed, it should some day come to you as part of Alice's fortune. Think of it, George; you would not like to receive everything from her.\"\nHe walked about the room, cursing between his teeth and balancing his pride against his profit. \"If I go to the Hall, will you write to Alice?\"\n\"No, George; I cannot write to Alice asking her for the money.\"\n\"Then, Kate, you and my grandfather may work together for the future. You may get him to leave you the place if you have skill enough.\"\n\"That is an undeserved reproach,\" said Kate, standing her ground boldly. \"If you have either heart or conscience, you will know it.\"\n\"I'm not much troubled with either one or the other, I fancy. I am better off without them.\"\n\"Will you take my money, George; just for the present?\"\n\"No.\"\n\"Will you let me write to Mrs. Greenow?\"\n\"I have no objection; but it will be of no use whatsoever.\"\n\"I will do so, at any rate. And now will you come to the Hall?\"\n\"To beg that old fool's pardon? No; I won't. In the mood I am in at present, I should only anger him worse than ever. Tell him that I've business which calls me back to London at once.\"\n\"It is a thousand pities. It may make so great a difference to your whole life!\" urged Kate.\n\"I'll tell you what I'll do,\" said George. \"I'll go to Vavasor and put up with the old squire's insolence, if you'll make this application for me to Alice.\"\nShe hesitated, feeling that she would almost do anything to achieve a reconciliation between her grandfather and her brother.\n\"But let me write to Aunt Greenow first,\" said she. \"It will take only two or three days.\"\nTo this George agreed as though he were yielding a great deal; and Kate, with a sore conscience, promised that she would apply to Alice for her money, if funds should not be forthcoming from Mrs. Greenow. Then George graciously consented to pack his clothes before visiting the Hall.\n\"I shan't stay more than two days,\" he said. \"I will stay there tomorrow night, and go into Kendal early, to catch the express train on Thursday morning.\"\nThey spoke very little on the way, until they reached the old lodge at the entrance to the place.\n\"Eh, Mr. George; be that you?\" said the old woman who came out to swing back the broken gate. \"A sight of you is good for sair een.\" It was the same welcome that the inn-keeper had given him, and equally sincere. George had never made himself popular about the place, but he was the heir.\n\"Remember, George,\" said Kate on the road up to the house; \"when you see our grandfather you must say that you regret that you ever displeased him. Don't let there be any further misunderstanding.\"\n\"I think it very probable that there will be,\" said George. \"I only hope he'll let me have the old horse to take me back to Shap if there is. There he is at the front door now.\"\nThe old man was standing at the hall steps when they car drove up, as though to welcome his grandson. He put out his hand to help Kate down the steps, keeping his eye on George's face.\n\"So you've come back,\" the squire said to him.\n\"Yes, sir; like the prodigal son in the parable.\"\n\"The prodigal son was contrite. I hope you are.\"\n\"Pretty well, sir. I'm sorry there has been any quarrel, and all that, you know.\"\n\"Go in,\" said the squire, very angrily. \"Go in. To expect anything gracious from you would be to expect pearls from swine.\"\nGeorge went in, shrugging his shoulders as his eyes met his sister's. It was in this fashion that the reconciliation took place between Squire Vavasor and his heir.",
        "paragraph_chars": [
            [
                0,
                202
            ],
            [
                202,
                620
            ],
            [
                620,
                1017
            ],
            [
                1017,
                1394
            ],
            [
                1394,
                1748
            ],
            [
                1748,
                2065
            ],
            [
                2065,
                2330
            ],
            [
                2330,
                2505
            ],
            [
                2505,
                2724
            ],
            [
                2724,
                2937
            ],
            [
                2937,
                3477
            ],
            [
                3477,
                3789
            ],
            [
                3789,
                3834
            ],
            [
                3834,
                3861
            ],
            [
                3861,
                3917
            ],
            [
                3917,
                4096
            ],
            [
                4096,
                4157
            ],
            [
                4157,
                4248
            ],
            [
                4248,
                4322
            ],
            [
                4322,
                4370
            ],
            [
                4370,
                4744
            ],
            [
                4744,
                5157
            ],
            [
                5157,
                5690
            ],
            [
                5690,
                5896
            ],
            [
                5896,
                5980
            ],
            [
                5980,
                6023
            ],
            [
                6023,
                6091
            ],
            [
                6091,
                6217
            ],
            [
                6217,
                6272
            ],
            [
                6272,
                6402
            ],
            [
                6402,
                6424
            ],
            [
                6424,
                6458
            ],
            [
                6458,
                6464
            ],
            [
                6464,
                6811
            ],
            [
                6811,
                6884
            ],
            [
                6884,
                7012
            ],
            [
                7012,
                7057
            ],
            [
                7057,
                7144
            ],
            [
                7144,
                7213
            ],
            [
                7213,
                7379
            ],
            [
                7379,
                7431
            ],
            [
                7431,
                7668
            ],
            [
                7668,
                7694
            ],
            [
                7694,
                7828
            ],
            [
                7828,
                8143
            ],
            [
                8143,
                8286
            ],
            [
                8286,
                8343
            ],
            [
                8343,
                8722
            ],
            [
                8722,
                8784
            ],
            [
                8784,
                9144
            ],
            [
                9144,
                9211
            ],
            [
                9211,
                9379
            ],
            [
                9379,
                9409
            ],
            [
                9409,
                9849
            ],
            [
                9849,
                9907
            ],
            [
                9907,
                10010
            ],
            [
                10010,
                10060
            ],
            [
                10060,
                10374
            ],
            [
                10374,
                10631
            ],
            [
                10631,
                10753
            ],
            [
                10753,
                10838
            ],
            [
                10838,
                11027
            ],
            [
                11027,
                11430
            ],
            [
                11430,
                11507
            ],
            [
                11507,
                11710
            ],
            [
                11710,
                11952
            ],
            [
                11952,
                12082
            ],
            [
                12082,
                12146
            ],
            [
                12146,
                12244
            ],
            [
                12244,
                12312
            ],
            [
                12312,
                12351
            ],
            [
                12351,
                12590
            ],
            [
                12590,
                12734
            ],
            [
                12734,
                12798
            ],
            [
                12798,
                12934
            ],
            [
                12934,
                13067
            ],
            [
                13067,
                13160
            ],
            [
                13160,
                13216
            ],
            [
                13216,
                13222
            ],
            [
                13222,
                13263
            ],
            [
                13263,
                13323
            ],
            [
                13323,
                13387
            ],
            [
                13387,
                13573
            ],
            [
                13573,
                13666
            ],
            [
                13666,
                13823
            ],
            [
                13823,
                13949
            ],
            [
                13949,
                14040
            ],
            [
                14040,
                14324
            ],
            [
                14324,
                14479
            ],
            [
                14479,
                14577
            ],
            [
                14577,
                14866
            ],
            [
                14866,
                15064
            ],
            [
                15064,
                15242
            ],
            [
                15242,
                15427
            ],
            [
                15427,
                15474
            ],
            [
                15474,
                15524
            ],
            [
                15524,
                15573
            ],
            [
                15573,
                15655
            ],
            [
                15655,
                15779
            ],
            [
                15779,
                15943
            ]
        ],
        "segment_chars": [
            [
                0,
                76
            ],
            [
                76,
                138
            ],
            [
                138,
                202
            ],
            [
                202,
                303
            ],
            [
                303,
                334
            ],
            [
                334,
                537
            ],
            [
                537,
                620
            ],
            [
                620,
                716
            ],
            [
                716,
                861
            ],
            [
                861,
                947
            ],
            [
                947,
                1017
            ],
            [
                1017,
                1111
            ],
            [
                1111,
                1164
            ],
            [
                1164,
                1288
            ],
            [
                1288,
                1394
            ],
            [
                1394,
                1445
            ],
            [
                1445,
                1534
            ],
            [
                1534,
                1638
            ],
            [
                1638,
                1748
            ],
            [
                1748,
                1881
            ],
            [
                1881,
                1981
            ],
            [
                1981,
                2065
            ],
            [
                2065,
                2141
            ],
            [
                2141,
                2330
            ],
            [
                2330,
                2421
            ],
            [
                2421,
                2505
            ],
            [
                2505,
                2724
            ],
            [
                2724,
                2744
            ],
            [
                2744,
                2806
            ],
            [
                2806,
                2845
            ],
            [
                2845,
                2937
            ],
            [
                2937,
                3089
            ],
            [
                3089,
                3171
            ],
            [
                3171,
                3206
            ],
            [
                3206,
                3273
            ],
            [
                3273,
                3311
            ],
            [
                3311,
                3421
            ],
            [
                3421,
                3477
            ],
            [
                3477,
                3613
            ],
            [
                3613,
                3725
            ],
            [
                3725,
                3789
            ],
            [
                3789,
                3816
            ],
            [
                3816,
                3834
            ],
            [
                3834,
                3861
            ],
            [
                3861,
                3871
            ],
            [
                3871,
                3890
            ],
            [
                3890,
                3917
            ],
            [
                3917,
                3943
            ],
            [
                3943,
                3980
            ],
            [
                3980,
                4096
            ],
            [
                4096,
                4140
            ],
            [
                4140,
                4157
            ],
            [
                4157,
                4189
            ],
            [
                4189,
                4248
            ],
            [
                4248,
                4259
            ],
            [
                4259,
                4274
            ],
            [
                4274,
                4322
            ],
            [
                4322,
                4370
            ],
            [
                4370,
                4454
            ],
            [
                4454,
                4474
            ],
            [
                4474,
                4491
            ],
            [
                4491,
                4604
            ],
            [
                4604,
                4705
            ],
            [
                4705,
                4744
            ],
            [
                4744,
                4823
            ],
            [
                4823,
                4887
            ],
            [
                4887,
                5058
            ],
            [
                5058,
                5157
            ],
            [
                5157,
                5322
            ],
            [
                5322,
                5420
            ],
            [
                5420,
                5577
            ],
            [
                5577,
                5690
            ],
            [
                5690,
                5738
            ],
            [
                5738,
                5896
            ],
            [
                5896,
                5980
            ],
            [
                5980,
                6000
            ],
            [
                6000,
                6023
            ],
            [
                6023,
                6091
            ],
            [
                6091,
                6107
            ],
            [
                6107,
                6148
            ],
            [
                6148,
                6217
            ],
            [
                6217,
                6272
            ],
            [
                6272,
                6296
            ],
            [
                6296,
                6368
            ],
            [
                6368,
                6402
            ],
            [
                6402,
                6424
            ],
            [
                6424,
                6458
            ],
            [
                6458,
                6464
            ],
            [
                6464,
                6499
            ],
            [
                6499,
                6534
            ],
            [
                6534,
                6702
            ],
            [
                6702,
                6811
            ],
            [
                6811,
                6884
            ],
            [
                6884,
                6952
            ],
            [
                6952,
                7012
            ],
            [
                7012,
                7057
            ],
            [
                7057,
                7067
            ],
            [
                7067,
                7084
            ],
            [
                7084,
                7144
            ],
            [
                7144,
                7157
            ],
            [
                7157,
                7213
            ],
            [
                7213,
                7249
            ],
            [
                7249,
                7320
            ],
            [
                7320,
                7379
            ],
            [
                7379,
                7431
            ],
            [
                7431,
                7472
            ],
            [
                7472,
                7492
            ],
            [
                7492,
                7569
            ],
            [
                7569,
                7645
            ],
            [
                7645,
                7668
            ],
            [
                7668,
                7694
            ],
            [
                7694,
                7728
            ],
            [
                7728,
                7795
            ],
            [
                7795,
                7828
            ],
            [
                7828,
                7944
            ],
            [
                7944,
                7975
            ],
            [
                7975,
                8143
            ],
            [
                8143,
                8177
            ],
            [
                8177,
                8227
            ],
            [
                8227,
                8286
            ],
            [
                8286,
                8314
            ],
            [
                8314,
                8343
            ],
            [
                8343,
                8360
            ],
            [
                8360,
                8594
            ],
            [
                8594,
                8722
            ],
            [
                8722,
                8784
            ],
            [
                8784,
                8845
            ],
            [
                8845,
                8965
            ],
            [
                8965,
                9008
            ],
            [
                9008,
                9082
            ],
            [
                9082,
                9144
            ],
            [
                9144,
                9211
            ],
            [
                9211,
                9290
            ],
            [
                9290,
                9379
            ],
            [
                9379,
                9409
            ],
            [
                9409,
                9450
            ],
            [
                9450,
                9481
            ],
            [
                9481,
                9529
            ],
            [
                9529,
                9645
            ],
            [
                9645,
                9738
            ],
            [
                9738,
                9849
            ],
            [
                9849,
                9907
            ],
            [
                9907,
                9934
            ],
            [
                9934,
                10010
            ],
            [
                10010,
                10060
            ],
            [
                10060,
                10137
            ],
            [
                10137,
                10185
            ],
            [
                10185,
                10277
            ],
            [
                10277,
                10360
            ],
            [
                10360,
                10374
            ],
            [
                10374,
                10483
            ],
            [
                10483,
                10631
            ],
            [
                10631,
                10684
            ],
            [
                10684,
                10753
            ],
            [
                10753,
                10806
            ],
            [
                10806,
                10838
            ],
            [
                10838,
                10921
            ],
            [
                10921,
                11027
            ],
            [
                11027,
                11120
            ],
            [
                11120,
                11182
            ],
            [
                11182,
                11201
            ],
            [
                11201,
                11237
            ],
            [
                11237,
                11301
            ],
            [
                11301,
                11403
            ],
            [
                11403,
                11430
            ],
            [
                11430,
                11507
            ],
            [
                11507,
                11550
            ],
            [
                11550,
                11656
            ],
            [
                11656,
                11693
            ],
            [
                11693,
                11710
            ],
            [
                11710,
                11815
            ],
            [
                11815,
                11932
            ],
            [
                11932,
                11952
            ],
            [
                11952,
                12005
            ],
            [
                12005,
                12082
            ],
            [
                12082,
                12096
            ],
            [
                12096,
                12146
            ],
            [
                12146,
                12186
            ],
            [
                12186,
                12244
            ],
            [
                12244,
                12269
            ],
            [
                12269,
                12312
            ],
            [
                12312,
                12351
            ],
            [
                12351,
                12517
            ],
            [
                12517,
                12590
            ],
            [
                12590,
                12686
            ],
            [
                12686,
                12734
            ],
            [
                12734,
                12798
            ],
            [
                12798,
                12868
            ],
            [
                12868,
                12934
            ],
            [
                12934,
                13007
            ],
            [
                13007,
                13067
            ],
            [
                13067,
                13129
            ],
            [
                13129,
                13160
            ],
            [
                13160,
                13216
            ],
            [
                13216,
                13222
            ],
            [
                13222,
                13263
            ],
            [
                13263,
                13323
            ],
            [
                13323,
                13351
            ],
            [
                13351,
                13387
            ],
            [
                13387,
                13419
            ],
            [
                13419,
                13432
            ],
            [
                13432,
                13505
            ],
            [
                13505,
                13573
            ],
            [
                13573,
                13599
            ],
            [
                13599,
                13654
            ],
            [
                13654,
                13666
            ],
            [
                13666,
                13709
            ],
            [
                13709,
                13823
            ],
            [
                13823,
                13949
            ],
            [
                13949,
                14001
            ],
            [
                14001,
                14040
            ],
            [
                14040,
                14245
            ],
            [
                14245,
                14324
            ],
            [
                14324,
                14369
            ],
            [
                14369,
                14479
            ],
            [
                14479,
                14577
            ],
            [
                14577,
                14608
            ],
            [
                14608,
                14671
            ],
            [
                14671,
                14710
            ],
            [
                14710,
                14790
            ],
            [
                14790,
                14866
            ],
            [
                14866,
                15014
            ],
            [
                15014,
                15064
            ],
            [
                15064,
                15124
            ],
            [
                15124,
                15206
            ],
            [
                15206,
                15242
            ],
            [
                15242,
                15344
            ],
            [
                15344,
                15427
            ],
            [
                15427,
                15474
            ],
            [
                15474,
                15524
            ],
            [
                15524,
                15556
            ],
            [
                15556,
                15573
            ],
            [
                15573,
                15592
            ],
            [
                15592,
                15655
            ],
            [
                15655,
                15695
            ],
            [
                15695,
                15703
            ],
            [
                15703,
                15779
            ],
            [
                15779,
                15849
            ],
            [
                15849,
                15943
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                44,
                48
            ],
            [
                54,
                61
            ],
            [
                69,
                74
            ],
            [
                74,
                76
            ],
            [
                76,
                87
            ],
            [
                88,
                92
            ],
            [
                100,
                123
            ],
            [
                136,
                138
            ],
            [
                138,
                202
            ],
            [
                202,
                215
            ],
            [
                224,
                228
            ],
            [
                229,
                235
            ],
            [
                236,
                239
            ],
            [
                240,
                249
            ],
            [
                266,
                278
            ],
            [
                284,
                301
            ],
            [
                301,
                303
            ],
            [
                303,
                334
            ],
            [
                334,
                400
            ],
            [
                401,
                432
            ],
            [
                439,
                494
            ],
            [
                495,
                507
            ],
            [
                508,
                512
            ],
            [
                518,
                520
            ],
            [
                535,
                537
            ],
            [
                537,
                556
            ],
            [
                558,
                620
            ],
            [
                620,
                716
            ],
            [
                725,
                742
            ],
            [
                758,
                759
            ],
            [
                760,
                767
            ],
            [
                768,
                823
            ],
            [
                826,
                829
            ],
            [
                830,
                861
            ],
            [
                861,
                947
            ],
            [
                947,
                990
            ],
            [
                994,
                1000
            ],
            [
                1001,
                1009
            ],
            [
                1010,
                1015
            ],
            [
                1015,
                1017
            ],
            [
                1017,
                1028
            ],
            [
                1029,
                1065
            ],
            [
                1065,
                1066
            ],
            [
                1067,
                1070
            ],
            [
                1071,
                1077
            ],
            [
                1082,
                1092
            ],
            [
                1093,
                1109
            ],
            [
                1109,
                1111
            ],
            [
                1111,
                1162
            ],
            [
                1162,
                1164
            ],
            [
                1164,
                1166
            ],
            [
                1175,
                1201
            ],
            [
                1210,
                1217
            ],
            [
                1224,
                1231
            ],
            [
                1234,
                1238
            ],
            [
                1238,
                1239
            ],
            [
                1240,
                1286
            ],
            [
                1286,
                1288
            ],
            [
                1288,
                1290
            ],
            [
                1297,
                1299
            ],
            [
                1305,
                1315
            ],
            [
                1316,
                1352
            ],
            [
                1359,
                1362
            ],
            [
                1363,
                1393
            ],
            [
                1394,
                1396
            ],
            [
                1397,
                1443
            ],
            [
                1443,
                1445
            ],
            [
                1445,
                1472
            ],
            [
                1473,
                1476
            ],
            [
                1477,
                1482
            ],
            [
                1483,
                1534
            ],
            [
                1534,
                1538
            ],
            [
                1544,
                1546
            ],
            [
                1551,
                1554
            ],
            [
                1555,
                1558
            ],
            [
                1559,
                1563
            ],
            [
                1564,
                1570
            ],
            [
                1582,
                1583
            ],
            [
                1590,
                1604
            ],
            [
                1605,
                1636
            ],
            [
                1636,
                1637
            ],
            [
                1638,
                1640
            ],
            [
                1644,
                1645
            ],
            [
                1646,
                1650
            ],
            [
                1650,
                1651
            ],
            [
                1652,
                1657
            ],
            [
                1657,
                1682
            ],
            [
                1683,
                1686
            ],
            [
                1687,
                1717
            ],
            [
                1718,
                1722
            ],
            [
                1723,
                1728
            ],
            [
                1729,
                1733
            ],
            [
                1733,
                1740
            ],
            [
                1741,
                1746
            ],
            [
                1746,
                1748
            ],
            [
                1748,
                1763
            ],
            [
                1769,
                1771
            ],
            [
                1772,
                1775
            ],
            [
                1776,
                1783
            ],
            [
                1783,
                1857
            ],
            [
                1858,
                1860
            ],
            [
                1864,
                1868
            ],
            [
                1876,
                1881
            ],
            [
                1881,
                1898
            ],
            [
                1898,
                1899
            ],
            [
                1908,
                1934
            ],
            [
                1934,
                1979
            ],
            [
                1985,
                1994
            ],
            [
                2009,
                2025
            ],
            [
                2026,
                2037
            ],
            [
                2038,
                2042
            ],
            [
                2043,
                2047
            ],
            [
                2051,
                2062
            ],
            [
                2065,
                2071
            ],
            [
                2081,
                2093
            ],
            [
                2093,
                2095
            ],
            [
                2113,
                2114
            ],
            [
                2122,
                2126
            ],
            [
                2131,
                2139
            ],
            [
                2139,
                2141
            ],
            [
                2141,
                2162
            ],
            [
                2188,
                2245
            ],
            [
                2246,
                2252
            ],
            [
                2256,
                2276
            ],
            [
                2282,
                2306
            ],
            [
                2307,
                2309
            ],
            [
                2317,
                2329
            ],
            [
                2330,
                2399
            ],
            [
                2399,
                2421
            ],
            [
                2421,
                2504
            ],
            [
                2505,
                2572
            ],
            [
                2573,
                2628
            ],
            [
                2629,
                2723
            ],
            [
                2724,
                2742
            ],
            [
                2742,
                2744
            ],
            [
                2744,
                2768
            ],
            [
                2769,
                2772
            ],
            [
                2779,
                2794
            ],
            [
                2795,
                2806
            ],
            [
                2806,
                2822
            ],
            [
                2829,
                2845
            ],
            [
                2845,
                2936
            ],
            [
                2937,
                2955
            ],
            [
                2956,
                3087
            ],
            [
                3087,
                3089
            ],
            [
                3089,
                3104
            ],
            [
                3105,
                3171
            ],
            [
                3171,
                3206
            ],
            [
                3206,
                3216
            ],
            [
                3225,
                3234
            ],
            [
                3239,
                3246
            ],
            [
                3246,
                3273
            ],
            [
                3273,
                3309
            ],
            [
                3309,
                3311
            ],
            [
                3311,
                3344
            ],
            [
                3349,
                3354
            ],
            [
                3355,
                3421
            ],
            [
                3421,
                3428
            ],
            [
                3429,
                3433
            ],
            [
                3433,
                3477
            ],
            [
                3477,
                3493
            ],
            [
                3494,
                3536
            ],
            [
                3537,
                3541
            ],
            [
                3542,
                3611
            ],
            [
                3611,
                3613
            ],
            [
                3613,
                3636
            ],
            [
                3636,
                3653
            ],
            [
                3654,
                3663
            ],
            [
                3669,
                3702
            ],
            [
                3703,
                3708
            ],
            [
                3709,
                3712
            ],
            [
                3720,
                3723
            ],
            [
                3723,
                3725
            ],
            [
                3728,
                3731
            ],
            [
                3739,
                3783
            ],
            [
                3784,
                3789
            ],
            [
                3789,
                3816
            ],
            [
                3816,
                3833
            ],
            [
                3834,
                3861
            ],
            [
                3861,
                3871
            ],
            [
                3871,
                3884
            ],
            [
                3888,
                3890
            ],
            [
                3890,
                3908
            ],
            [
                3914,
                3917
            ],
            [
                3917,
                3932
            ],
            [
                3933,
                3943
            ],
            [
                3943,
                3953
            ],
            [
                3954,
                3967
            ],
            [
                3967,
                3978
            ],
            [
                3978,
                3980
            ],
            [
                3981,
                4096
            ],
            [
                4096,
                4128
            ],
            [
                4130,
                4140
            ],
            [
                4140,
                4157
            ],
            [
                4157,
                4169
            ],
            [
                4171,
                4172
            ],
            [
                4179,
                4184
            ],
            [
                4187,
                4189
            ],
            [
                4189,
                4200
            ],
            [
                4201,
                4217
            ],
            [
                4220,
                4234
            ],
            [
                4236,
                4248
            ],
            [
                4248,
                4259
            ],
            [
                4259,
                4274
            ],
            [
                4274,
                4322
            ],
            [
                4322,
                4367
            ],
            [
                4370,
                4420
            ],
            [
                4421,
                4452
            ],
            [
                4452,
                4454
            ],
            [
                4454,
                4474
            ],
            [
                4474,
                4491
            ],
            [
                4491,
                4515
            ],
            [
                4522,
                4576
            ],
            [
                4579,
                4604
            ],
            [
                4604,
                4703
            ],
            [
                4703,
                4705
            ],
            [
                4705,
                4744
            ],
            [
                4744,
                4763
            ],
            [
                4764,
                4808
            ],
            [
                4809,
                4813
            ],
            [
                4814,
                4823
            ],
            [
                4823,
                4840
            ],
            [
                4848,
                4862
            ],
            [
                4863,
                4866
            ],
            [
                4867,
                4887
            ],
            [
                4887,
                4909
            ],
            [
                4910,
                4916
            ],
            [
                4923,
                4941
            ],
            [
                4944,
                4948
            ],
            [
                4959,
                4961
            ],
            [
                4970,
                4998
            ],
            [
                4999,
                5018
            ],
            [
                5022,
                5058
            ],
            [
                5058,
                5066
            ],
            [
                5067,
                5069
            ],
            [
                5077,
                5082
            ],
            [
                5087,
                5090
            ],
            [
                5100,
                5107
            ],
            [
                5113,
                5156
            ],
            [
                5157,
                5322
            ],
            [
                5322,
                5342
            ],
            [
                5342,
                5343
            ],
            [
                5344,
                5407
            ],
            [
                5408,
                5418
            ],
            [
                5418,
                5420
            ],
            [
                5420,
                5427
            ],
            [
                5428,
                5431
            ],
            [
                5432,
                5437
            ],
            [
                5442,
                5451
            ],
            [
                5455,
                5491
            ],
            [
                5495,
                5500
            ],
            [
                5501,
                5504
            ],
            [
                5505,
                5527
            ],
            [
                5527,
                5528
            ],
            [
                5544,
                5546
            ],
            [
                5547,
                5577
            ],
            [
                5577,
                5594
            ],
            [
                5600,
                5689
            ],
            [
                5690,
                5738
            ],
            [
                5738,
                5750
            ],
            [
                5751,
                5759
            ],
            [
                5769,
                5778
            ],
            [
                5779,
                5783
            ],
            [
                5784,
                5791
            ],
            [
                5791,
                5792
            ],
            [
                5793,
                5798
            ],
            [
                5799,
                5802
            ],
            [
                5803,
                5815
            ],
            [
                5815,
                5834
            ],
            [
                5835,
                5878
            ],
            [
                5879,
                5882
            ],
            [
                5883,
                5894
            ],
            [
                5894,
                5896
            ],
            [
                5896,
                5951
            ],
            [
                5958,
                5978
            ],
            [
                5978,
                5980
            ],
            [
                5980,
                6000
            ],
            [
                6000,
                6023
            ],
            [
                6023,
                6047
            ],
            [
                6048,
                6091
            ],
            [
                6091,
                6107
            ],
            [
                6107,
                6148
            ],
            [
                6148,
                6217
            ],
            [
                6217,
                6272
            ],
            [
                6272,
                6294
            ],
            [
                6294,
                6296
            ],
            [
                6296,
                6368
            ],
            [
                6368,
                6402
            ],
            [
                6402,
                6424
            ],
            [
                6424,
                6427
            ],
            [
                6450,
                6458
            ],
            [
                6458,
                6464
            ],
            [
                6464,
                6499
            ],
            [
                6499,
                6511
            ],
            [
                6512,
                6534
            ],
            [
                6534,
                6545
            ],
            [
                6558,
                6702
            ],
            [
                6702,
                6714
            ],
            [
                6719,
                6745
            ],
            [
                6748,
                6783
            ],
            [
                6787,
                6811
            ],
            [
                6811,
                6881
            ],
            [
                6881,
                6884
            ],
            [
                6884,
                6952
            ],
            [
                6952,
                6998
            ],
            [
                7009,
                7012
            ],
            [
                7012,
                7057
            ],
            [
                7057,
                7067
            ],
            [
                7067,
                7084
            ],
            [
                7084,
                7105
            ],
            [
                7132,
                7141
            ],
            [
                7144,
                7155
            ],
            [
                7157,
                7213
            ],
            [
                7213,
                7249
            ],
            [
                7249,
                7320
            ],
            [
                7320,
                7323
            ],
            [
                7324,
                7332
            ],
            [
                7342,
                7379
            ],
            [
                7379,
                7431
            ],
            [
                7431,
                7472
            ],
            [
                7472,
                7492
            ],
            [
                7492,
                7533
            ],
            [
                7533,
                7569
            ],
            [
                7569,
                7577
            ],
            [
                7578,
                7589
            ],
            [
                7589,
                7591
            ],
            [
                7598,
                7643
            ],
            [
                7657,
                7668
            ],
            [
                7668,
                7694
            ],
            [
                7694,
                7728
            ],
            [
                7728,
                7795
            ],
            [
                7799,
                7805
            ],
            [
                7806,
                7808
            ],
            [
                7815,
                7820
            ],
            [
                7821,
                7825
            ],
            [
                7825,
                7828
            ],
            [
                7828,
                7857
            ],
            [
                7866,
                7942
            ],
            [
                7942,
                7944
            ],
            [
                7944,
                7973
            ],
            [
                7973,
                7975
            ],
            [
                7975,
                8030
            ],
            [
                8033,
                8111
            ],
            [
                8114,
                8127
            ],
            [
                8141,
                8143
            ],
            [
                8143,
                8146
            ],
            [
                8148,
                8175
            ],
            [
                8175,
                8176
            ],
            [
                8177,
                8204
            ],
            [
                8205,
                8227
            ],
            [
                8237,
                8276
            ],
            [
                8284,
                8286
            ],
            [
                8286,
                8314
            ],
            [
                8314,
                8333
            ],
            [
                8341,
                8343
            ],
            [
                8343,
                8358
            ],
            [
                8358,
                8360
            ],
            [
                8360,
                8592
            ],
            [
                8594,
                8601
            ],
            [
                8605,
                8637
            ],
            [
                8644,
                8671
            ],
            [
                8672,
                8722
            ],
            [
                8722,
                8784
            ],
            [
                8784,
                8816
            ],
            [
                8817,
                8845
            ],
            [
                8845,
                8862
            ],
            [
                8863,
                8865
            ],
            [
                8866,
                8870
            ],
            [
                8871,
                8911
            ],
            [
                8911,
                8920
            ],
            [
                8924,
                8929
            ],
            [
                8930,
                8963
            ],
            [
                8965,
                8981
            ],
            [
                8982,
                8987
            ],
            [
                8988,
                9008
            ],
            [
                9008,
                9032
            ],
            [
                9038,
                9082
            ],
            [
                9082,
                9085
            ],
            [
                9086,
                9104
            ],
            [
                9105,
                9144
            ],
            [
                9144,
                9189
            ],
            [
                9190,
                9211
            ],
            [
                9212,
                9247
            ],
            [
                9248,
                9252
            ],
            [
                9253,
                9290
            ],
            [
                9290,
                9314
            ],
            [
                9315,
                9376
            ],
            [
                9379,
                9409
            ],
            [
                9409,
                9450
            ],
            [
                9450,
                9456
            ],
            [
                9460,
                9481
            ],
            [
                9481,
                9527
            ],
            [
                9529,
                9552
            ],
            [
                9553,
                9581
            ],
            [
                9582,
                9592
            ],
            [
                9592,
                9611
            ],
            [
                9617,
                9645
            ],
            [
                9645,
                9730
            ],
            [
                9736,
                9738
            ],
            [
                9738,
                9788
            ],
            [
                9794,
                9823
            ],
            [
                9824,
                9827
            ],
            [
                9831,
                9848
            ],
            [
                9849,
                9850
            ],
            [
                9858,
                9907
            ],
            [
                9907,
                9934
            ],
            [
                9934,
                9957
            ],
            [
                9958,
                10010
            ],
            [
                10010,
                10060
            ],
            [
                10060,
                10135
            ],
            [
                10135,
                10137
            ],
            [
                10137,
                10185
            ],
            [
                10185,
                10229
            ],
            [
                10230,
                10260
            ],
            [
                10261,
                10264
            ],
            [
                10265,
                10275
            ],
            [
                10275,
                10277
            ],
            [
                10277,
                10333
            ],
            [
                10334,
                10360
            ],
            [
                10360,
                10371
            ],
            [
                10390,
                10418
            ],
            [
                10420,
                10422
            ],
            [
                10423,
                10430
            ],
            [
                10431,
                10438
            ],
            [
                10446,
                10448
            ],
            [
                10453,
                10483
            ],
            [
                10483,
                10510
            ],
            [
                10511,
                10574
            ],
            [
                10586,
                10631
            ],
            [
                10631,
                10684
            ],
            [
                10684,
                10753
            ],
            [
                10753,
                10806
            ],
            [
                10806,
                10838
            ],
            [
                10838,
                10921
            ],
            [
                10921,
                11027
            ],
            [
                11027,
                11120
            ],
            [
                11120,
                11127
            ],
            [
                11133,
                11182
            ],
            [
                11182,
                11184
            ],
            [
                11191,
                11199
            ],
            [
                11199,
                11201
            ],
            [
                11201,
                11237
            ],
            [
                11237,
                11274
            ],
            [
                11275,
                11301
            ],
            [
                11301,
                11387
            ],
            [
                11392,
                11401
            ],
            [
                11410,
                11430
            ],
            [
                11437,
                11438
            ],
            [
                11439,
                11482
            ],
            [
                11485,
                11507
            ],
            [
                11507,
                11550
            ],
            [
                11550,
                11569
            ],
            [
                11570,
                11654
            ],
            [
                11654,
                11656
            ],
            [
                11656,
                11693
            ],
            [
                11693,
                11697
            ],
            [
                11698,
                11701
            ],
            [
                11710,
                11735
            ],
            [
                11736,
                11803
            ],
            [
                11810,
                11815
            ],
            [
                11815,
                11829
            ],
            [
                11838,
                11884
            ],
            [
                11885,
                11889
            ],
            [
                11898,
                11932
            ],
            [
                11932,
                11949
            ],
            [
                11952,
                12005
            ],
            [
                12005,
                12082
            ],
            [
                12082,
                12096
            ],
            [
                12096,
                12107
            ],
            [
                12113,
                12135
            ],
            [
                12140,
                12146
            ],
            [
                12146,
                12186
            ],
            [
                12186,
                12244
            ],
            [
                12244,
                12269
            ],
            [
                12269,
                12312
            ],
            [
                12312,
                12351
            ],
            [
                12351,
                12394
            ],
            [
                12404,
                12439
            ],
            [
                12442,
                12517
            ],
            [
                12517,
                12590
            ],
            [
                12590,
                12615
            ],
            [
                12624,
                12655
            ],
            [
                12656,
                12686
            ],
            [
                12686,
                12734
            ],
            [
                12734,
                12798
            ],
            [
                12798,
                12868
            ],
            [
                12868,
                12934
            ],
            [
                12934,
                12942
            ],
            [
                12946,
                12956
            ],
            [
                12957,
                12965
            ],
            [
                12965,
                13005
            ],
            [
                13005,
                13007
            ],
            [
                13007,
                13056
            ],
            [
                13062,
                13064
            ],
            [
                13064,
                13067
            ],
            [
                13067,
                13129
            ],
            [
                13129,
                13140
            ],
            [
                13145,
                13160
            ],
            [
                13160,
                13216
            ],
            [
                13216,
                13219
            ],
            [
                13222,
                13263
            ],
            [
                13263,
                13270
            ],
            [
                13274,
                13323
            ],
            [
                13323,
                13351
            ],
            [
                13351,
                13387
            ],
            [
                13387,
                13419
            ],
            [
                13419,
                13432
            ],
            [
                13432,
                13465
            ],
            [
                13466,
                13505
            ],
            [
                13505,
                13573
            ],
            [
                13573,
                13597
            ],
            [
                13599,
                13635
            ],
            [
                13636,
                13654
            ],
            [
                13654,
                13666
            ],
            [
                13666,
                13709
            ],
            [
                13709,
                13822
            ],
            [
                13823,
                13949
            ],
            [
                13949,
                13953
            ],
            [
                13954,
                14001
            ],
            [
                14001,
                14023
            ],
            [
                14024,
                14026
            ],
            [
                14027,
                14032
            ],
            [
                14033,
                14037
            ],
            [
                14040,
                14054
            ],
            [
                14062,
                14136
            ],
            [
                14137,
                14193
            ],
            [
                14194,
                14245
            ],
            [
                14250,
                14280
            ],
            [
                14286,
                14297
            ],
            [
                14314,
                14324
            ],
            [
                14324,
                14326
            ],
            [
                14334,
                14338
            ],
            [
                14349,
                14357
            ],
            [
                14367,
                14369
            ],
            [
                14370,
                14387
            ],
            [
                14397,
                14407
            ],
            [
                14408,
                14429
            ],
            [
                14430,
                14456
            ],
            [
                14457,
                14476
            ],
            [
                14479,
                14483
            ],
            [
                14490,
                14494
            ],
            [
                14505,
                14508
            ],
            [
                14512,
                14513
            ],
            [
                14520,
                14546
            ],
            [
                14547,
                14576
            ],
            [
                14577,
                14608
            ],
            [
                14608,
                14626
            ],
            [
                14627,
                14653
            ],
            [
                14654,
                14671
            ],
            [
                14671,
                14710
            ],
            [
                14710,
                14790
            ],
            [
                14790,
                14866
            ],
            [
                14866,
                14867
            ],
            [
                14867,
                14883
            ],
            [
                14926,
                14938
            ],
            [
                14955,
                15014
            ],
            [
                15014,
                15064
            ],
            [
                15064,
                15124
            ],
            [
                15124,
                15206
            ],
            [
                15206,
                15235
            ],
            [
                15239,
                15242
            ],
            [
                15242,
                15289
            ],
            [
                15295,
                15344
            ],
            [
                15344,
                15408
            ],
            [
                15409,
                15427
            ],
            [
                15427,
                15474
            ],
            [
                15474,
                15484
            ],
            [
                15485,
                15524
            ],
            [
                15524,
                15556
            ],
            [
                15556,
                15570
            ],
            [
                15570,
                15573
            ],
            [
                15573,
                15585
            ],
            [
                15585,
                15592
            ],
            [
                15592,
                15655
            ],
            [
                15655,
                15695
            ],
            [
                15695,
                15703
            ],
            [
                15703,
                15776
            ],
            [
                15779,
                15849
            ],
            [
                15849,
                15943
            ]
        ],
        "row_chars": [
            [
                0,
                76
            ],
            [
                76,
                138
            ],
            [
                138,
                202
            ],
            [
                202,
                303
            ],
            [
                303,
                334
            ],
            [
                334,
                537
            ],
            [
                537,
                537
            ],
            [
                537,
                537
            ],
            [
                537,
                537
            ],
            [
                537,
                537
            ],
            [
                537,
                537
            ],
            [
                537,
                620
            ],
            [
                620,
                716
            ],
            [
                716,
                861
            ],
            [
                861,
                947
            ],
            [
                947,
                1017
            ],
            [
                1017,
                1111
            ],
            [
                1111,
                1164
            ],
            [
                1164,
                1288
            ],
            [
                1288,
                1394
            ],
            [
                1394,
                1445
            ],
            [
                1445,
                1534
            ],
            [
                1534,
                1748
            ],
            [
                1748,
                1881
            ],
            [
                1881,
                1981
            ],
            [
                1981,
                2065
            ],
            [
                2065,
                2141
            ],
            [
                2141,
                2330
            ],
            [
                2330,
                2421
            ],
            [
                2421,
                2505
            ],
            [
                2505,
                2724
            ],
            [
                2724,
                2744
            ],
            [
                2744,
                2806
            ],
            [
                2806,
                2845
            ],
            [
                2845,
                2937
            ],
            [
                2937,
                2937
            ],
            [
                2937,
                3089
            ],
            [
                3089,
                3171
            ],
            [
                3171,
                3206
            ],
            [
                3206,
                3206
            ],
            [
                3206,
                3273
            ],
            [
                3273,
                3311
            ],
            [
                3311,
                3421
            ],
            [
                3421,
                3421
            ],
            [
                3421,
                3477
            ],
            [
                3477,
                3613
            ],
            [
                3613,
                3725
            ],
            [
                3725,
                3789
            ],
            [
                3789,
                3816
            ],
            [
                3816,
                3834
            ],
            [
                3834,
                3834
            ],
            [
                3834,
                3834
            ],
            [
                3834,
                3834
            ],
            [
                3834,
                3834
            ],
            [
                3834,
                3861
            ],
            [
                3861,
                3871
            ],
            [
                3871,
                3890
            ],
            [
                3890,
                3917
            ],
            [
                3917,
                3943
            ],
            [
                3943,
                3943
            ],
            [
                3943,
                3943
            ],
            [
                3943,
                3943
            ],
            [
                3943,
                3980
            ],
            [
                3980,
                4096
            ],
            [
                4096,
                4140
            ],
            [
                4140,
                4157
            ],
            [
                4157,
                4189
            ],
            [
                4189,
                4248
            ],
            [
                4248,
                4259
            ],
            [
                4259,
                4274
            ],
            [
                4274,
                4322
            ],
            [
                4322,
                4370
            ],
            [
                4370,
                4370
            ],
            [
                4370,
                4454
            ],
            [
                4454,
                4474
            ],
            [
                4474,
                4491
            ],
            [
                4491,
                4604
            ],
            [
                4604,
                4705
            ],
            [
                4705,
                4744
            ],
            [
                4744,
                4823
            ],
            [
                4823,
                4887
            ],
            [
                4887,
                5058
            ],
            [
                5058,
                5157
            ],
            [
                5157,
                5157
            ],
            [
                5157,
                5322
            ],
            [
                5322,
                5420
            ],
            [
                5420,
                5577
            ],
            [
                5577,
                5690
            ],
            [
                5690,
                5738
            ],
            [
                5738,
                5896
            ],
            [
                5896,
                5980
            ],
            [
                5980,
                6000
            ],
            [
                6000,
                6023
            ],
            [
                6023,
                6091
            ],
            [
                6091,
                6107
            ],
            [
                6107,
                6148
            ],
            [
                6148,
                6217
            ],
            [
                6217,
                6272
            ],
            [
                6272,
                6296
            ],
            [
                6296,
                6368
            ],
            [
                6368,
                6402
            ],
            [
                6402,
                6424
            ],
            [
                6424,
                6458
            ],
            [
                6458,
                6464
            ],
            [
                6464,
                6499
            ],
            [
                6499,
                6534
            ],
            [
                6534,
                6702
            ],
            [
                6702,
                6811
            ],
            [
                6811,
                6884
            ],
            [
                6884,
                6952
            ],
            [
                6952,
                7012
            ],
            [
                7012,
                7057
            ],
            [
                7057,
                7067
            ],
            [
                7067,
                7084
            ],
            [
                7084,
                7144
            ],
            [
                7144,
                7144
            ],
            [
                7144,
                7157
            ],
            [
                7157,
                7157
            ],
            [
                7157,
                7157
            ],
            [
                7157,
                7213
            ],
            [
                7213,
                7249
            ],
            [
                7249,
                7320
            ],
            [
                7320,
                7379
            ],
            [
                7379,
                7431
            ],
            [
                7431,
                7472
            ],
            [
                7472,
                7492
            ],
            [
                7492,
                7569
            ],
            [
                7569,
                7668
            ],
            [
                7668,
                7694
            ],
            [
                7694,
                7728
            ],
            [
                7728,
                7795
            ],
            [
                7795,
                7795
            ],
            [
                7795,
                7795
            ],
            [
                7795,
                7828
            ],
            [
                7828,
                7944
            ],
            [
                7944,
                7975
            ],
            [
                7975,
                8143
            ],
            [
                8143,
                8177
            ],
            [
                8177,
                8177
            ],
            [
                8177,
                8177
            ],
            [
                8177,
                8227
            ],
            [
                8227,
                8227
            ],
            [
                8227,
                8227
            ],
            [
                8227,
                8286
            ],
            [
                8286,
                8314
            ],
            [
                8314,
                8343
            ],
            [
                8343,
                8360
            ],
            [
                8360,
                8594
            ],
            [
                8594,
                8594
            ],
            [
                8594,
                8722
            ],
            [
                8722,
                8784
            ],
            [
                8784,
                8845
            ],
            [
                8845,
                8965
            ],
            [
                8965,
                8965
            ],
            [
                8965,
                9008
            ],
            [
                9008,
                9082
            ],
            [
                9082,
                9144
            ],
            [
                9144,
                9211
            ],
            [
                9211,
                9211
            ],
            [
                9211,
                9290
            ],
            [
                9290,
                9379
            ],
            [
                9379,
                9409
            ],
            [
                9409,
                9450
            ],
            [
                9450,
                9481
            ],
            [
                9481,
                9645
            ],
            [
                9645,
                9738
            ],
            [
                9738,
                9849
            ],
            [
                9849,
                9849
            ],
            [
                9849,
                9849
            ],
            [
                9849,
                9849
            ],
            [
                9849,
                9907
            ],
            [
                9907,
                9934
            ],
            [
                9934,
                10010
            ],
            [
                10010,
                10060
            ],
            [
                10060,
                10137
            ],
            [
                10137,
                10185
            ],
            [
                10185,
                10277
            ],
            [
                10277,
                10360
            ],
            [
                10360,
                10374
            ],
            [
                10374,
                10374
            ],
            [
                10374,
                10374
            ],
            [
                10374,
                10483
            ],
            [
                10483,
                10631
            ],
            [
                10631,
                10684
            ],
            [
                10684,
                10753
            ],
            [
                10753,
                10806
            ],
            [
                10806,
                10838
            ],
            [
                10838,
                10921
            ],
            [
                10921,
                11027
            ],
            [
                11027,
                11120
            ],
            [
                11120,
                11182
            ],
            [
                11182,
                11201
            ],
            [
                11201,
                11237
            ],
            [
                11237,
                11301
            ],
            [
                11301,
                11403
            ],
            [
                11403,
                11403
            ],
            [
                11403,
                11430
            ],
            [
                11430,
                11430
            ],
            [
                11430,
                11507
            ],
            [
                11507,
                11550
            ],
            [
                11550,
                11656
            ],
            [
                11656,
                11693
            ],
            [
                11693,
                11710
            ],
            [
                11710,
                11815
            ],
            [
                11815,
                11932
            ],
            [
                11932,
                11952
            ],
            [
                11952,
                12005
            ],
            [
                12005,
                12082
            ],
            [
                12082,
                12096
            ],
            [
                12096,
                12146
            ],
            [
                12146,
                12186
            ],
            [
                12186,
                12244
            ],
            [
                12244,
                12269
            ],
            [
                12269,
                12312
            ],
            [
                12312,
                12351
            ],
            [
                12351,
                12517
            ],
            [
                12517,
                12590
            ],
            [
                12590,
                12686
            ],
            [
                12686,
                12686
            ],
            [
                12686,
                12734
            ],
            [
                12734,
                12798
            ],
            [
                12798,
                12798
            ],
            [
                12798,
                12798
            ],
            [
                12798,
                12868
            ],
            [
                12868,
                12934
            ],
            [
                12934,
                13007
            ],
            [
                13007,
                13067
            ],
            [
                13067,
                13129
            ],
            [
                13129,
                13160
            ],
            [
                13160,
                13216
            ],
            [
                13216,
                13222
            ],
            [
                13222,
                13222
            ],
            [
                13222,
                13263
            ],
            [
                13263,
                13323
            ],
            [
                13323,
                13351
            ],
            [
                13351,
                13387
            ],
            [
                13387,
                13419
            ],
            [
                13419,
                13432
            ],
            [
                13432,
                13505
            ],
            [
                13505,
                13573
            ],
            [
                13573,
                13599
            ],
            [
                13599,
                13599
            ],
            [
                13599,
                13654
            ],
            [
                13654,
                13666
            ],
            [
                13666,
                13709
            ],
            [
                13709,
                13823
            ],
            [
                13823,
                13823
            ],
            [
                13823,
                13823
            ],
            [
                13823,
                13949
            ],
            [
                13949,
                14001
            ],
            [
                14001,
                14040
            ],
            [
                14040,
                14245
            ],
            [
                14245,
                14324
            ],
            [
                14324,
                14369
            ],
            [
                14369,
                14369
            ],
            [
                14369,
                14369
            ],
            [
                14369,
                14369
            ],
            [
                14369,
                14369
            ],
            [
                14369,
                14479
            ],
            [
                14479,
                14479
            ],
            [
                14479,
                14577
            ],
            [
                14577,
                14608
            ],
            [
                14608,
                14671
            ],
            [
                14671,
                14710
            ],
            [
                14710,
                14790
            ],
            [
                14790,
                14866
            ],
            [
                14866,
                14866
            ],
            [
                14866,
                14866
            ],
            [
                14866,
                14866
            ],
            [
                14866,
                14866
            ],
            [
                14866,
                14866
            ],
            [
                14866,
                15014
            ],
            [
                15014,
                15064
            ],
            [
                15064,
                15124
            ],
            [
                15124,
                15206
            ],
            [
                15206,
                15242
            ],
            [
                15242,
                15344
            ],
            [
                15344,
                15427
            ],
            [
                15427,
                15474
            ],
            [
                15474,
                15474
            ],
            [
                15474,
                15474
            ],
            [
                15474,
                15524
            ],
            [
                15524,
                15556
            ],
            [
                15556,
                15573
            ],
            [
                15573,
                15592
            ],
            [
                15592,
                15655
            ],
            [
                15655,
                15695
            ],
            [
                15695,
                15703
            ],
            [
                15703,
                15779
            ],
            [
                15779,
                15779
            ],
            [
                15779,
                15849
            ],
            [
                15849,
                15943
            ]
        ]
    }
}