{
    "original": {
        "text": "How deep and cunning are the wiles of love! When that Saturday morning arrived not a word was said by Cheesacre to his rival as to his plans for the day. \"You'll take the dog-cart in?\" Captain Bellfield had asked overnight. \"I don't know what I shall do as yet,\" replied he who was master of the house, of the dog-cart, and, as he fondly thought, of the situation. But Bellfield knew that Cheesacre must take the dog-cart, and was contented. His friend would leave him behind, if it were possible, but Bellfield would take care that it should not be possible.\nBefore breakfast Mr. Cheesacre surreptitiously carried out into the yard a bag containing all his apparatus for dressing,--his marrow oil for his hair, his shirt with the wondrous worked front upon an under-stratum of pink to give it colour, his shiny boots, and all the rest of the paraphernalia. When dining in Norwich on ordinary occasions, he simply washed his hands there, trusting to the chambermaid at the inn to find him a comb; and now he came down with his bag surreptitiously, and hid it away in the back of the dog-cart with secret, but alas, not unobserved hands, hoping that Bellfield would forget his toilet. But when did such a Captain ever forget his outward man? Cheesacre, as he returned through the kitchen from the yard into the front hall, perceived another bag lying near the door, apparently filled almost as well as his own.\n\"What the deuce are you going to do with all this luggage?\" said he, giving the bag a kick.\n\"Put it where I saw you putting yours when I opened my window just now,\" said Bellfield.\n\"D---- the window,\" exclaimed Cheesacre, and then they sat down to breakfast. \"How you do hack that ham about,\" he said. \"If you ever found hams yourself you'd be more particular in cutting them.\" This was very bad. Even Bellfield could not bear it with equanimity, and feeling unable to eat the ham under such circumstances, made his breakfast with a couple of fresh eggs. \"If you didn't mean to eat the meat, why the mischief did you cut it?\" said Cheesacre.\n\"Upon my word, Cheesacre, you're too bad;--upon my word you are,\" said Bellfield, almost sobbing.\n\"What's the matter now?\" said the other.\n\"Who wants your ham?\"\n\"You do, I suppose, or you wouldn't cut it.\"\n\"No I don't; nor anything else either that you've got. It isn't fair to ask a fellow into your house, and then say such things to him as that. And it isn't what I've been accustomed to either; I can tell you that, Mr. Cheesacre.\"\n\"Oh, bother!\"\n\"It's all very well to say bother, but I choose to be treated like a gentleman wherever I go. You and I have known each other a long time, and I'd put up with more from you than from anyone else; but--\"\n\"Can you pay me the money that you owe me, Bellfield?\" said Cheesacre, looking hard at him.\n\"No, I can't,\" said Bellfield; \"not immediately.\"\n\"Then eat your breakfast, and hold your tongue.\"\nAfter that Captain Bellfield did eat his breakfast,--leaving the ham however untouched, and did hold his tongue, vowing vengeance in his heart. But the two men went into Norwich more amicably together than they would have done had there been no words between them. Cheesacre felt that he had trespassed a little, and therefore offered the Captain a cigar as he seated himself in the cart. Bellfield accepted the offering, and smoked the weed of peace.\n\"Now,\" said Cheesacre, as he drove into the Swan yard, \"what do you mean to do with yourself all day?\"\n\"I shall go down to the quarters, and look the fellows up.\"\n\"All right. But mind this, Bellfield;--it's an understood thing, that you're not to be in the Close before four?\"\n\"I won't be in the Close before four!\"\n\"Very well. That's understood. If you deceive me, I'll not drive you back to Oileymead to-night.\"\nIn this instance Captain Bellfield had no intention to deceive. He did not think it probable that he could do himself any good by philandering about the widow early in the day. She would be engaged with her dinner and with an early toilet. Captain Bellfield, moreover, had learned from experience that the first comer has not always an advantage in ladies' society. The mind of a woman is greedy after novelty, and it is upon the stranger, or upon the most strange of her slaves around her, that she often smiles the sweetest. The cathedral clock, therefore, had struck four before Captain Bellfield rang Mrs. Greenow's bell, and then, when he was shown into the drawing-room, he found Cheesacre there alone, redolent with the marrow oil, and beautiful with the pink bosom.\n\"Haven't you seen her yet?\" asked the Captain almost in a whisper.\n\"No,\" said Cheesacre sulkily.\n\"Nor yet Charlie Fairstairs?\"\n\"I've seen nobody,\" said Cheesacre.\nBut at this moment he was compelled to swallow his anger, as Mrs. Greenow, accompanied by her lady guest, came into the room. \"Whoever would have expected two gentlemen to be so punctual,\" said she, \"especially on market-day!\"\n\"Market-day makes no difference when I come to see you,\" said Cheesacre, putting his best foot forward, while Captain Bellfield contented himself with saying something civil to Charlie. He would bide his time and ride a waiting race.\nThe widow was almost gorgeous in her weeds. I believe that she had not sinned in her dress against any of those canons which the semi-ecclesiastical authorities on widowhood have laid down as to the outward garments fitted for gentlemen's relicts. The materials were those which are devoted to the deepest conjugal grief. As regarded every item of the written law her suttee worship was carried out to the letter. There was the widow's cap, generally so hideous, so well known to the eyes of all men, so odious to womanhood. Let us hope that such headgear may have some assuaging effect on the departed spirits of husbands. There was the dress of deep, clinging, melancholy crape,--of crape which becomes so brown and so rusty, and which makes the six months' widow seem so much more afflicted a creature than she whose husband is just gone, and whose crape is therefore new. There were the trailing weepers, and the widow's kerchief pinned close round her neck and somewhat tightly over her bosom. But there was that of genius about Mrs. Greenow, that she had turned every seeming disadvantage to some special profit, and had so dressed herself that though she had obeyed the law to the letter, she had thrown the spirit of it to the winds. Her cap sat jauntily on her head, and showed just so much of her rich brown hair as to give her the appearance of youth which she desired. Cheesacre had blamed her in his heart for her private carriage, but she spent more money, I think, on new crape than she did on her brougham. It never became brown and rusty with her, or formed itself into old lumpy folds, or shaped itself round her like a grave cloth. The written law had not interdicted crinoline, and she loomed as large with weeds, which with her were not sombre, as she would do with her silks when the period of her probation should be over. Her weepers were bright with newness, and she would waft them aside from her shoulder with an air which turned even them into auxiliaries. Her kerchief was fastened close round her neck and close over her bosom; but Jeannette well knew what she was doing as she fastened it,--and so did Jeannette's mistress.\nMrs. Greenow would still talk much about her husband, declaring that her loss was as fresh to her wounded heart, as though he, on whom all her happiness had rested, had left her only yesterday; but yet she mistook her dates, frequently referring to the melancholy circumstance, as having taken place fifteen months ago. In truth, however, Mr. Greenow had been alive within the last nine months,--as everybody around her knew. But if she chose to forget the exact day, why should her friends or dependents remind her of it? No friend or dependent did remind her of it, and Charlie Fairstairs spoke of the fifteen months with bold confidence,--false-tongued little parasite that she was.\n\"Looking well,\" said the widow, in answer to some outspoken compliment from Mr. Cheesacre. \"Yes, I'm well enough in health, and I suppose I ought to be thankful that it is so. But if you had buried a wife whom you had loved within the last eighteen months, you would have become as indifferent as I am to all that kind of thing.\"\n\"I never was married yet,\" said Mr. Cheesacre.\n\"And therefore you know nothing about it. Everything in the world is gay and fresh to you. If I were you, Mr. Cheesacre, I would not run the risk. It is hardly worth a woman's while, and I suppose not a man's. The sufferings are too great!\" Whereupon she pressed her handkerchief to her eyes.\n\"But I mean to try all the same,\" said Cheesacre, looking the lover all over as he gazed into the fair one's face.\n\"I hope that you may be successful, Mr. Cheesacre, and that she may not be torn away from you early in life. Is dinner ready, Jeannette? That's well. Mr. Cheesacre, will you give your arm to Miss Fairstairs?\"\nThere was no doubt as to Mrs. Greenow's correctness. As Captain Bellfield held, or had held, her Majesty's commission, he was clearly entitled to take the mistress of the festival down to dinner. But Cheesacre would not look at it in this light. He would only remember that he had paid for the Captain's food for some time past, that the Captain had been brought into Norwich in his gig, that the Captain owed him money, and ought, so to say, to be regarded as his property on the occasion. \"I pay my way, and that ought to give a man higher station than being a beggarly captain,--which I don't believe he is, if all the truth was known.\" It was thus that he took an occasion to express himself to Miss Fairstairs on that very evening. \"Military rank is always recognised,\" Miss Fairstairs had replied, taking Mr. Cheesacre's remarks as a direct slight upon herself. He had taken her down to dinner, and had then come to her complaining that he had been injured in being called upon to do so! \"If you were a magistrate, Mr. Cheesacre, you would have rank; but I believe you are not.\" Charlie Fairstairs knew well what she was about. Mr. Cheesacre had striven much to get his name put upon the commission of the peace, but had failed. \"Nasty, scraggy old cat,\" Cheesacre said to himself, as he turned away from her.\nBut Bellfield gained little by taking the widow down. He and Cheesacre were placed at the top and bottom of the table, so that they might do the work of carving; and the ladies sat at the sides. Mrs. Greenow's hospitality was very good. The dinner was exactly what a dinner ought to be for four persons. There was soup, fish, a cutlet, a roast fowl, and some game. Jeannette waited at table nimbly, and the thing could not have been done better. Mrs. Greenow's appetite was not injured by her grief, and she so far repressed for the time all remembrance of her sorrow as to enable her to play the kind hostess to perfection. Under her immediate eye Cheesacre was forced into apparent cordiality with his friend Bellfield, and the Captain himself took the good things which the gods provided with thankful good-humour.\nNothing, however, was done at the dinner-table. No work got itself accomplished. The widow was so accurately fair in the adjustment of her favours, that even Jeannette could not perceive to which of the two she turned with the amplest smile. She talked herself and made others talk, till Cheesacre became almost comfortable, in spite of his jealousy. \"And now,\" she said, as she got up to leave the room, when she had taken her own glass of wine, \"We will allow these two gentlemen just half an hour, eh Charlie? and then we shall expect them up-stairs.\"\n\"Ten minutes will be enough for us here,\" said Cheesacre, who was in a hurry to utilize his time.\n\"Half an hour,\" said Mrs. Greenow, not without some little tone of command in her voice. Ten minutes might be enough for Mr. Cheesacre, but ten minutes was not enough for her.\nBellfield had opened the door, and it was upon him that the widow's eye glanced as she left the room. Cheesacre saw it, and resolved to resent the injury. \"I'll tell you what it is, Bellfield,\" he said, as he sat down moodily over the fire, \"I won't have you coming here at all, till this matter is settled.\"\n\"Till what matter is settled?\" said Bellfield, filling his glass.\n\"You know what matter I mean.\"\n\"You take such a deuce of a time about it.\"\n\"No, I don't. I take as little time as anybody could. That other fellow has only been dead about nine months, and I've got the thing in excellent training already.\"\n\"And what harm do I do?\"\n\"You disturb me, and you disturb her. You do it on purpose. Do you suppose I can't see? I'll tell you what, now; if you'll go clean out of Norwich for a month, I'll lend you two hundred pounds on the day she becomes Mrs. Cheesacre.\"\n\"And where am I to go to?\"\n\"You may stay at Oileymead, if you like;--that is, on condition that you do stay there.\"\n\"And be told that I hack the ham because it's not my own. Shall I tell you a piece of my mind, Cheesacre?\"\n\"What do you mean?\"\n\"That woman has no more idea of marrying you than she has of marrying the Bishop. Won't you fill your glass, old fellow? I know where the tap is if you want another bottle. You may as well give it up, and spend no more money in pink fronts and polished boots on her account. You're a podgy man, you see, and Mrs. Greenow doesn't like podgy men.\"\nCheesacre sat looking at him with his mouth open, dumb with surprise, and almost paralysed with impotent anger. What had happened during the last few hours to change so entirely the tone of his dependent captain? Could it be that Bellfield had been there during the morning, and that she had accepted him?\n\"You are very podgy, Cheesacre,\" Bellfield continued, \"and then you so often smell of the farm-yard; and you talk too much of your money and your property. You'd have had a better chance if you had openly talked to her of hers,--as I have done. As it is, you haven't any chance at all.\"\nBellfield, as he thus spoke to the man opposite to him, went on drinking his wine comfortably, and seemed to be chuckling with glee. Cheesacre was so astounded, so lost in amazement that the creature whom he had fed,--whom he had bribed with money out of his own pocket, should thus turn against him, that for a while he could not collect his thoughts or find voice wherewith to make any answer. It occurred to him immediately that Bellfield was even now, at this very time, staying at his house,--that he, Cheesacre, was expected to drive him, Bellfield, back to Oileymead, to his own Oileymead, on this very evening; and as he thought of this he almost fancied that he must be in a dream. He shook himself, and looked again, and there sat Bellfield, eyeing him through the bright colour of a glass of port.\n\"Now I've told you a bit of my mind, Cheesy, my boy,\" continued Bellfield, \"and you'll save yourself a deal of trouble and annoyance if you'll believe what I say. She doesn't mean to marry you. It's most probable that she'll marry me; but, at any rate, she won't marry you.\"\n\"Do you mean to pay me my money, sir?\" said Cheesacre, at last, finding his readiest means of attack in that quarter.\n\"Yes, I do.\"\n\"But when?\"\n\"When I've married Mrs. Greenow,--and, therefore, I expect your assistance in that little scheme. Let us drink her health. We shall always be delighted to see you at our house, Cheesy, my boy, and you shall be allowed to hack the hams just as much as you please.\"\n\"You shall be made to pay for this,\" said Cheesacre, gasping with anger;--gasping almost more with dismay than he did with anger.\n\"All right, old fellow; I'll pay for it,--with the widow's money. Come; our half-hour is nearly over; shall we go up-stairs?\"\n\"I'll expose you.\"\n\"Don't now;--don't be ill-natured.\"\n\"Will you tell me where you mean to sleep to-night, Captain Bellfield?\"\n\"If I sleep at Oileymead it will only be on condition that I have one of the mahogany-furnitured bedrooms.\"\n\"You'll never put your foot in that house again. You're a rascal, sir.\"\n\"Come, come, Cheesy, it won't do for us to quarrel in a lady's house. It wouldn't be the thing at all. You're not drinking your wine. You might as well take another glass, and then we'll go up-stairs.\"\n\"You've left your traps at Oileymead, and not one of them you shall have till you've paid me every shilling you owe me. I don't believe you've a shirt in the world beyond what you've got there.\"\n\"It's lucky I brought one in to change; wasn't it, Cheesy? I shouldn't have thought of it only for the hint you gave me. I might as well ring the bell for Jeannette to put away the wine, if you won't take any more.\" Then he rang the bell, and when Jeannette came he skipped lightly up-stairs into the drawing-room.\n\"Was he here before to-day?\" said Cheesacre, nodding his head at the doorway through which Bellfield had passed.\n\"Who? The Captain? Oh dear no. The Captain don't come here much now;--not to say often, by no means.\"\n\"He's a confounded rascal.\"\n\"Oh, Mr. Cheesacre!\" said Jeannette.\n\"He is;--and I ain't sure that there ain't others nearly as bad as he is.\"\n\"If you mean me, Mr. Cheesacre, I do declare you're a wronging me; I do indeed.\"\n\"What's the meaning of his going on in this way?\"\n\"I don't know nothing of his ways, Mr. Cheesacre; but I've been as true to you, sir;--so I have;--as true as true.\" And Jeannette put her handkerchief up to her eyes.\nHe moved to the door, and then a thought occurred to him. He put his hand to his trousers pocket, and turning back towards the girl, gave her half-a-crown. She curtsied as she took it, and then repeated her last words. \"Yes, Mr. Cheesacre,--as true as true.\" Mr. Cheesacre said nothing further, but followed his enemy up to the drawing-room. \"What game is up now, I wonder,\" said Jeannette to herself, when she was left alone. \"They two'll be cutting each other's throatses before they've done, and then my missus will take the surwiver.\" But she made up her mind that Cheesacre should be the one to have his throat cut fatally, and that Bellfield should be the survivor.\nCheesacre, when he reached the drawing-room, found Bellfield sitting on the same sofa with Mrs. Greenow looking at a book of photographs which they both of them were handling together. The outside rim of her widow's frill on one occasion touched the Captain's whisker, and as it did so the Captain looked up with a gratified expression of triumph. If any gentleman has ever seen the same thing under similar circumstances, he will understand that Cheesacre must have been annoyed.\n\"Yes,\" said Mrs. Greenow, waving her handkerchief, of which little but a two-inch-deep border seemed to be visible. Bellfield knew at once that it was not the same handkerchief which she had waved before they went down to dinner. \"Yes,--there he is. It's so like him.\" And then she apostrophized the _carte de visite_ of the departed one. \"Dear Greenow; dear husband! When my spirit is false to thee, let thine forget to visit me softly in my dreams. Thou wast unmatched among husbands. Whose tender kindness was ever equal to thine? whose sweet temper was ever so constant? whose manly care so all-sufficient?\" While the words fell from her lips her little finger was touching Bellfield's little finger, as they held the book between them. Charlie Fairstairs and Mr. Cheesacre were watching her narrowly, and she knew that they were watching her. She was certainly a woman of great genius and of great courage.\n[Illustration: \"Dear Greenow; dear husband!\"]\nBellfield, moved by the eloquence of her words, looked with some interest at the photograph. There was represented there before him, a small, grey-looking, insignificant old man, with pig's eyes and a toothless mouth,--one who should never have been compelled to submit himself to the cruelty of the sun's portraiture! Another widow, even if she had kept in her book the photograph of such a husband, would have scrambled it over silently,--would have been ashamed to show it. \"Have you ever seen it, Mr. Cheesacre?\" asked Mrs. Greenow. \"It's so like him.\"\n\"I saw it at Yarmouth,\" said Cheesacre, very sulkily.\n\"That you did not,\" said the lady with some dignity, and not a little of rebuke in her tone; \"simply because it never was at Yarmouth. A larger one you may have seen, which I always keep, and always shall keep, close by my bedside.\"\n\"Not if I know it,\" said Captain Bellfield to himself. Then the widow punished Mr. Cheesacre for his sullenness by whispering a few words to the Captain; and Cheesacre in his wrath turned to Charlie Fairstairs. Then it was that he spake out his mind about the Captain's rank, and was snubbed by Charlie,--as was told a page or two back.\nAfter that, coffee was brought to them, and here again Cheesacre in his ill-humour allowed the Captain to out-manoeuvre him. It was the Captain who put the sugar into the cups and handed them round. He even handed a cup to his enemy. \"None for me, Captain Bellfield; many thanks for your politeness all the same,\" said Mr. Cheesacre; and Mrs. Greenow knew from the tone of his voice that there had been a quarrel.\nCheesacre sitting then in his gloom, had resolved upon one thing,--or, I may perhaps say, upon two things. He had resolved that he would not leave the room that evening till Bellfield had left it; and that he would get a final answer from the widow, if not that night,--for he thought it very possible that they might both be sent away together,--then early after breakfast on the following morning. For the present, he had given up any idea of turning his time to good account. He was not perhaps a coward, but he had not that special courage which enables a man to fight well under adverse circumstances. He had been cowed by the unexpected impertinence of his rival,--by the insolence of a man to whom he thought that he had obtained the power of being always himself as insolent as he pleased. He could not recover his ground quickly, or carry himself before his lady's eye as though he was unconscious of the wound he had received. So he sat silent, while Bellfield was discoursing fluently. He sat in silence, comforting himself with reflections on his own wealth, and on the poverty of the other, and promising himself a rich harvest of revenge when the moment should come in which he might tell Mrs. Greenow how absolutely that man was a beggar, a swindler, and a rascal.\nAnd he was astonished when an opportunity for doing so came very quickly. Before the neighbouring clock had done striking seven, Bellfield rose from his chair to go. He first of all spoke a word of farewell to Miss Fairstairs; then he turned to his late host; \"Good night, Cheesacre,\" he said, in the easiest tone in the world; after that he pressed the widow's hand and whispered his adieu.\n\"I thought you were staying at Oileymead?\" said Mrs. Greenow.\n\"I came from there this morning,\" said the Captain.\n\"But he isn't going back there, I can tell you,\" said Mr. Cheesacre.\n\"Oh, indeed,\" said Mrs. Greenow; \"I hope there is nothing wrong.\"\n\"All as right as a trivet,\" said the Captain; and then he was off.\n\"I promised mamma that I would be home by seven,\" said Charlie Fairstairs, rising from her chair. It cannot be supposed that she had any wish to oblige Mr. Cheesacre, and therefore this movement on her part must be regarded simply as done in kindness to Mrs. Greenow. She might be mistaken in supposing that Mrs. Greenow would desire to be left alone with Mr. Cheesacre; but it was clear to her that in this way she could give no offence, whereas it was quite possible that she might offend by remaining. A little after seven Mr. Cheesacre found himself alone with the lady.\n\"I'm sorry to find,\" said she, gravely, \"that you two have quarrelled.\"\n\"Mrs. Greenow,\" said he, jumping up, and becoming on a sudden full of life, \"that man is a downright swindler.\"\n\"Oh, Mr. Cheesacre.\"\n\"He is. He'll tell you that he was at Inkerman, but I believe he was in prison all the time.\" The Captain had been arrested, I think twice, and thus Mr. Cheesacre justified to himself this assertion. \"I doubt whether he ever saw a shot fired,\" he continued.\n\"He's none the worse for that.\"\n\"But he tells such lies; and then he has not a penny in the world. How much do you suppose he owes me, now?\"\n\"However much it is, I'm sure you are too much of a gentleman to say.\"\n\"Well;--yes, I am,\" said he, trying to recover himself. \"But when I asked him how he intended to pay me, what do you think he said? He said he'd pay me when he got your money.\"\n\"My money! He couldn't have said that!\"\n\"But he did, Mrs. Greenow; I give you my word and honour. 'I'll pay you when I get the widow's money,' he said.\"\n\"You gentlemen must have a nice way of talking about me when I am absent.\"\n\"I never said a disrespectful word about you in my life, Mrs. Greenow,--or thought one. He does;--he says horrible things.\"\n\"What horrible things, Mr. Cheesacre?\"\n\"Oh, I can't tell you;--but he does. What can you expect from such a man as that, who, to my knowledge, won't have a change of clothes to-morrow, except what he brought in on his back this morning. Where he's to get a bed to-night, I don't know, for I doubt whether he's got half-a-crown in the world.\"\n\"Poor Bellfield!\"\n\"Yes; he is poor.\"\n\"But how gracefully he carries his poverty.\"\n\"I should call it very disgraceful, Mrs. Greenow.\" To this she made no reply, and then he thought that he might begin his work. \"Mrs. Greenow,--may I say Arabella?\"\n\"Mr. Cheesacre!\"\n\"But mayn't I? Come, Mrs. Greenow. You know well enough by this time what it is I mean. What's the use of shilly-shallying?\"\n\"Shilly-shallying, Mr. Cheesacre! I never heard such language. If I bid you good night, now, and tell you that it is time for you to go home, shall you call that shilly-shallying?\"\nHe had made a mistake in his word and repented it. \"I beg your pardon, Mrs. Greenow; I do indeed. I didn't mean anything offensive.\"\n\"Shilly-shallying, indeed! There's very little shall in it, I can assure you.\"\nThe poor man was dreadfully crestfallen, so much so that the widow's heart relented, and she pardoned him. It was not in her nature to quarrel with people;--at any rate, not with her lovers. \"I beg your pardon, Mrs. Greenow,\" said the culprit, humbly. \"It is granted,\" said the widow; \"but never tell a lady again that she is shilly-shallying. And look here, Mr. Cheesacre, if it should ever come to pass that you are making love to a lady in earnest--\"\n\"I couldn't be more in earnest,\" said he.\n\"That you are making love to a lady in earnest, talk to her a little more about your passion and a little less about your purse. Now, good night.\"\n\"But we are friends.\"\n\"Oh yes;--as good friends as ever.\"\nCheesacre, as he drove himself home in the dark, tried to console himself by thinking of the miserable plight in which Bellfield would find himself at Norwich, with no possessions but what he had brought into the town that day in a small bag. But as he turned in at his own gate he met two figures emerging; one of them was laden with a portmanteau, and the other with a hat case.\n\"It's only me, Cheesy, my boy,\" said Bellfield. \"I've just come down by the rail to fetch my things, and I'm going back to Norwich by the 9.20.\n\"If you've stolen anything of mine I'll have you prosecuted,\" roared Cheesacre, as he drove his gig up to his own door.\nVOLUME II.",
        "paragraph_chars": [
            [
                0,
                560
            ],
            [
                560,
                1410
            ],
            [
                1410,
                1502
            ],
            [
                1502,
                1591
            ],
            [
                1591,
                2052
            ],
            [
                2052,
                2150
            ],
            [
                2150,
                2191
            ],
            [
                2191,
                2213
            ],
            [
                2213,
                2258
            ],
            [
                2258,
                2488
            ],
            [
                2488,
                2502
            ],
            [
                2502,
                2705
            ],
            [
                2705,
                2797
            ],
            [
                2797,
                2847
            ],
            [
                2847,
                2896
            ],
            [
                2896,
                3348
            ],
            [
                3348,
                3451
            ],
            [
                3451,
                3511
            ],
            [
                3511,
                3625
            ],
            [
                3625,
                3664
            ],
            [
                3664,
                3762
            ],
            [
                3762,
                4536
            ],
            [
                4536,
                4603
            ],
            [
                4603,
                4633
            ],
            [
                4633,
                4663
            ],
            [
                4663,
                4699
            ],
            [
                4699,
                4926
            ],
            [
                4926,
                5160
            ],
            [
                5160,
                7315
            ],
            [
                7315,
                8001
            ],
            [
                8001,
                8331
            ],
            [
                8331,
                8378
            ],
            [
                8378,
                8671
            ],
            [
                8671,
                8786
            ],
            [
                8786,
                8995
            ],
            [
                8995,
                10311
            ],
            [
                10311,
                11129
            ],
            [
                11129,
                11684
            ],
            [
                11684,
                11782
            ],
            [
                11782,
                11958
            ],
            [
                11958,
                12267
            ],
            [
                12267,
                12333
            ],
            [
                12333,
                12364
            ],
            [
                12364,
                12408
            ],
            [
                12408,
                12573
            ],
            [
                12573,
                12598
            ],
            [
                12598,
                12831
            ],
            [
                12831,
                12858
            ],
            [
                12858,
                12947
            ],
            [
                12947,
                13054
            ],
            [
                13054,
                13074
            ],
            [
                13074,
                13420
            ],
            [
                13420,
                13726
            ],
            [
                13726,
                14013
            ],
            [
                14013,
                14822
            ],
            [
                14822,
                15097
            ],
            [
                15097,
                15215
            ],
            [
                15215,
                15228
            ],
            [
                15228,
                15240
            ],
            [
                15240,
                15504
            ],
            [
                15504,
                15634
            ],
            [
                15634,
                15760
            ],
            [
                15760,
                15779
            ],
            [
                15779,
                15815
            ],
            [
                15815,
                15887
            ],
            [
                15887,
                15995
            ],
            [
                15995,
                16067
            ],
            [
                16067,
                16269
            ],
            [
                16269,
                16464
            ],
            [
                16464,
                16779
            ],
            [
                16779,
                16892
            ],
            [
                16892,
                16994
            ],
            [
                16994,
                17022
            ],
            [
                17022,
                17059
            ],
            [
                17059,
                17134
            ],
            [
                17134,
                17215
            ],
            [
                17215,
                17265
            ],
            [
                17265,
                17432
            ],
            [
                17432,
                18104
            ],
            [
                18104,
                18585
            ],
            [
                18585,
                19497
            ],
            [
                19497,
                19543
            ],
            [
                19543,
                20100
            ],
            [
                20100,
                20154
            ],
            [
                20154,
                20387
            ],
            [
                20387,
                20724
            ],
            [
                20724,
                21138
            ],
            [
                21138,
                22418
            ],
            [
                22418,
                22810
            ],
            [
                22810,
                22872
            ],
            [
                22872,
                22924
            ],
            [
                22924,
                22993
            ],
            [
                22993,
                23059
            ],
            [
                23059,
                23126
            ],
            [
                23126,
                23701
            ],
            [
                23701,
                23773
            ],
            [
                23773,
                23885
            ],
            [
                23885,
                23906
            ],
            [
                23906,
                24164
            ],
            [
                24164,
                24196
            ],
            [
                24196,
                24305
            ],
            [
                24305,
                24376
            ],
            [
                24376,
                24553
            ],
            [
                24553,
                24593
            ],
            [
                24593,
                24706
            ],
            [
                24706,
                24781
            ],
            [
                24781,
                24905
            ],
            [
                24905,
                24944
            ],
            [
                24944,
                25247
            ],
            [
                25247,
                25265
            ],
            [
                25265,
                25284
            ],
            [
                25284,
                25329
            ],
            [
                25329,
                25494
            ],
            [
                25494,
                25511
            ],
            [
                25511,
                25636
            ],
            [
                25636,
                25817
            ],
            [
                25817,
                25950
            ],
            [
                25950,
                26029
            ],
            [
                26029,
                26483
            ],
            [
                26483,
                26525
            ],
            [
                26525,
                26672
            ],
            [
                26672,
                26694
            ],
            [
                26694,
                26730
            ],
            [
                26730,
                27111
            ],
            [
                27111,
                27255
            ],
            [
                27255,
                27375
            ],
            [
                27375,
                27385
            ]
        ],
        "segment_chars": [
            [
                0,
                44
            ],
            [
                44,
                154
            ],
            [
                154,
                185
            ],
            [
                185,
                224
            ],
            [
                224,
                365
            ],
            [
                365,
                442
            ],
            [
                442,
                560
            ],
            [
                560,
                858
            ],
            [
                858,
                1184
            ],
            [
                1184,
                1241
            ],
            [
                1241,
                1410
            ],
            [
                1410,
                1470
            ],
            [
                1470,
                1502
            ],
            [
                1502,
                1591
            ],
            [
                1591,
                1669
            ],
            [
                1669,
                1712
            ],
            [
                1712,
                1788
            ],
            [
                1788,
                1807
            ],
            [
                1807,
                1965
            ],
            [
                1965,
                2036
            ],
            [
                2036,
                2052
            ],
            [
                2052,
                2150
            ],
            [
                2150,
                2175
            ],
            [
                2175,
                2191
            ],
            [
                2191,
                2213
            ],
            [
                2213,
                2258
            ],
            [
                2258,
                2313
            ],
            [
                2313,
                2401
            ],
            [
                2401,
                2488
            ],
            [
                2488,
                2502
            ],
            [
                2502,
                2596
            ],
            [
                2596,
                2705
            ],
            [
                2705,
                2760
            ],
            [
                2760,
                2797
            ],
            [
                2797,
                2847
            ],
            [
                2847,
                2896
            ],
            [
                2896,
                3040
            ],
            [
                3040,
                3161
            ],
            [
                3161,
                3285
            ],
            [
                3285,
                3348
            ],
            [
                3348,
                3451
            ],
            [
                3451,
                3511
            ],
            [
                3511,
                3523
            ],
            [
                3523,
                3625
            ],
            [
                3625,
                3664
            ],
            [
                3664,
                3676
            ],
            [
                3676,
                3695
            ],
            [
                3695,
                3762
            ],
            [
                3762,
                3826
            ],
            [
                3826,
                3939
            ],
            [
                3939,
                4002
            ],
            [
                4002,
                4128
            ],
            [
                4128,
                4289
            ],
            [
                4289,
                4536
            ],
            [
                4536,
                4564
            ],
            [
                4564,
                4603
            ],
            [
                4603,
                4633
            ],
            [
                4633,
                4663
            ],
            [
                4663,
                4699
            ],
            [
                4699,
                4825
            ],
            [
                4825,
                4926
            ],
            [
                4926,
                5112
            ],
            [
                5112,
                5160
            ],
            [
                5160,
                5204
            ],
            [
                5204,
                5408
            ],
            [
                5408,
                5482
            ],
            [
                5482,
                5574
            ],
            [
                5574,
                5685
            ],
            [
                5685,
                5784
            ],
            [
                5784,
                6036
            ],
            [
                6036,
                6159
            ],
            [
                6159,
                6402
            ],
            [
                6402,
                6541
            ],
            [
                6541,
                6683
            ],
            [
                6683,
                6811
            ],
            [
                6811,
                7006
            ],
            [
                7006,
                7145
            ],
            [
                7145,
                7315
            ],
            [
                7315,
                7635
            ],
            [
                7635,
                7741
            ],
            [
                7741,
                7838
            ],
            [
                7838,
                8001
            ],
            [
                8001,
                8092
            ],
            [
                8092,
                8177
            ],
            [
                8177,
                8331
            ],
            [
                8331,
                8378
            ],
            [
                8378,
                8420
            ],
            [
                8420,
                8469
            ],
            [
                8469,
                8525
            ],
            [
                8525,
                8588
            ],
            [
                8588,
                8619
            ],
            [
                8619,
                8671
            ],
            [
                8671,
                8786
            ],
            [
                8786,
                8895
            ],
            [
                8895,
                8923
            ],
            [
                8923,
                8936
            ],
            [
                8936,
                8995
            ],
            [
                8995,
                9048
            ],
            [
                9048,
                9191
            ],
            [
                9191,
                9241
            ],
            [
                9241,
                9486
            ],
            [
                9486,
                9635
            ],
            [
                9635,
                9732
            ],
            [
                9732,
                9863
            ],
            [
                9863,
                9989
            ],
            [
                9989,
                10080
            ],
            [
                10080,
                10129
            ],
            [
                10129,
                10230
            ],
            [
                10230,
                10311
            ],
            [
                10311,
                10365
            ],
            [
                10365,
                10506
            ],
            [
                10506,
                10548
            ],
            [
                10548,
                10615
            ],
            [
                10615,
                10676
            ],
            [
                10676,
                10757
            ],
            [
                10757,
                10936
            ],
            [
                10936,
                11129
            ],
            [
                11129,
                11177
            ],
            [
                11177,
                11210
            ],
            [
                11210,
                11371
            ],
            [
                11371,
                11480
            ],
            [
                11480,
                11642
            ],
            [
                11642,
                11684
            ],
            [
                11684,
                11782
            ],
            [
                11782,
                11871
            ],
            [
                11871,
                11958
            ],
            [
                11958,
                12060
            ],
            [
                12060,
                12113
            ],
            [
                12113,
                12267
            ],
            [
                12267,
                12298
            ],
            [
                12298,
                12333
            ],
            [
                12333,
                12364
            ],
            [
                12364,
                12408
            ],
            [
                12408,
                12422
            ],
            [
                12422,
                12462
            ],
            [
                12462,
                12573
            ],
            [
                12573,
                12598
            ],
            [
                12598,
                12636
            ],
            [
                12636,
                12658
            ],
            [
                12658,
                12686
            ],
            [
                12686,
                12831
            ],
            [
                12831,
                12858
            ],
            [
                12858,
                12947
            ],
            [
                12947,
                13005
            ],
            [
                13005,
                13054
            ],
            [
                13054,
                13074
            ],
            [
                13074,
                13156
            ],
            [
                13156,
                13195
            ],
            [
                13195,
                13247
            ],
            [
                13247,
                13349
            ],
            [
                13349,
                13420
            ],
            [
                13420,
                13532
            ],
            [
                13532,
                13633
            ],
            [
                13633,
                13726
            ],
            [
                13726,
                13882
            ],
            [
                13882,
                13971
            ],
            [
                13971,
                14013
            ],
            [
                14013,
                14146
            ],
            [
                14146,
                14409
            ],
            [
                14409,
                14704
            ],
            [
                14704,
                14822
            ],
            [
                14822,
                14985
            ],
            [
                14985,
                15016
            ],
            [
                15016,
                15097
            ],
            [
                15097,
                15136
            ],
            [
                15136,
                15215
            ],
            [
                15215,
                15228
            ],
            [
                15228,
                15240
            ],
            [
                15240,
                15338
            ],
            [
                15338,
                15363
            ],
            [
                15363,
                15504
            ],
            [
                15504,
                15634
            ],
            [
                15634,
                15700
            ],
            [
                15700,
                15760
            ],
            [
                15760,
                15779
            ],
            [
                15779,
                15815
            ],
            [
                15815,
                15887
            ],
            [
                15887,
                15995
            ],
            [
                15995,
                16044
            ],
            [
                16044,
                16067
            ],
            [
                16067,
                16137
            ],
            [
                16137,
                16170
            ],
            [
                16170,
                16201
            ],
            [
                16201,
                16269
            ],
            [
                16269,
                16389
            ],
            [
                16389,
                16464
            ],
            [
                16464,
                16523
            ],
            [
                16523,
                16585
            ],
            [
                16585,
                16680
            ],
            [
                16680,
                16779
            ],
            [
                16779,
                16808
            ],
            [
                16808,
                16892
            ],
            [
                16892,
                16898
            ],
            [
                16898,
                16911
            ],
            [
                16911,
                16923
            ],
            [
                16923,
                16994
            ],
            [
                16994,
                17022
            ],
            [
                17022,
                17043
            ],
            [
                17043,
                17059
            ],
            [
                17059,
                17134
            ],
            [
                17134,
                17215
            ],
            [
                17215,
                17265
            ],
            [
                17265,
                17381
            ],
            [
                17381,
                17432
            ],
            [
                17432,
                17490
            ],
            [
                17490,
                17588
            ],
            [
                17588,
                17651
            ],
            [
                17651,
                17691
            ],
            [
                17691,
                17774
            ],
            [
                17774,
                17859
            ],
            [
                17859,
                17971
            ],
            [
                17971,
                18104
            ],
            [
                18104,
                18289
            ],
            [
                18289,
                18452
            ],
            [
                18452,
                18585
            ],
            [
                18585,
                18701
            ],
            [
                18701,
                18815
            ],
            [
                18815,
                18835
            ],
            [
                18835,
                18854
            ],
            [
                18854,
                18924
            ],
            [
                18924,
                18953
            ],
            [
                18953,
                19036
            ],
            [
                19036,
                19072
            ],
            [
                19072,
                19119
            ],
            [
                19119,
                19160
            ],
            [
                19160,
                19197
            ],
            [
                19197,
                19326
            ],
            [
                19326,
                19433
            ],
            [
                19433,
                19497
            ],
            [
                19497,
                19543
            ],
            [
                19543,
                19636
            ],
            [
                19636,
                19862
            ],
            [
                19862,
                20020
            ],
            [
                20020,
                20060
            ],
            [
                20060,
                20080
            ],
            [
                20080,
                20100
            ],
            [
                20100,
                20154
            ],
            [
                20154,
                20289
            ],
            [
                20289,
                20387
            ],
            [
                20387,
                20442
            ],
            [
                20442,
                20598
            ],
            [
                20598,
                20724
            ],
            [
                20724,
                20849
            ],
            [
                20849,
                20923
            ],
            [
                20923,
                20958
            ],
            [
                20958,
                21138
            ],
            [
                21138,
                21245
            ],
            [
                21245,
                21538
            ],
            [
                21538,
                21617
            ],
            [
                21617,
                21745
            ],
            [
                21745,
                21936
            ],
            [
                21936,
                22075
            ],
            [
                22075,
                22135
            ],
            [
                22135,
                22418
            ],
            [
                22418,
                22492
            ],
            [
                22492,
                22584
            ],
            [
                22584,
                22810
            ],
            [
                22810,
                22853
            ],
            [
                22853,
                22872
            ],
            [
                22872,
                22924
            ],
            [
                22924,
                22993
            ],
            [
                22993,
                23059
            ],
            [
                23059,
                23126
            ],
            [
                23126,
                23224
            ],
            [
                23224,
                23394
            ],
            [
                23394,
                23631
            ],
            [
                23631,
                23701
            ],
            [
                23701,
                23773
            ],
            [
                23773,
                23885
            ],
            [
                23885,
                23906
            ],
            [
                23906,
                23914
            ],
            [
                23914,
                24000
            ],
            [
                24000,
                24106
            ],
            [
                24106,
                24164
            ],
            [
                24164,
                24196
            ],
            [
                24196,
                24263
            ],
            [
                24263,
                24305
            ],
            [
                24305,
                24376
            ],
            [
                24376,
                24432
            ],
            [
                24432,
                24508
            ],
            [
                24508,
                24553
            ],
            [
                24553,
                24564
            ],
            [
                24564,
                24593
            ],
            [
                24593,
                24651
            ],
            [
                24651,
                24706
            ],
            [
                24706,
                24781
            ],
            [
                24781,
                24869
            ],
            [
                24869,
                24905
            ],
            [
                24905,
                24944
            ],
            [
                24944,
                24981
            ],
            [
                24981,
                25142
            ],
            [
                25142,
                25247
            ],
            [
                25247,
                25265
            ],
            [
                25265,
                25284
            ],
            [
                25284,
                25329
            ],
            [
                25329,
                25380
            ],
            [
                25380,
                25457
            ],
            [
                25457,
                25494
            ],
            [
                25494,
                25511
            ],
            [
                25511,
                25526
            ],
            [
                25526,
                25546
            ],
            [
                25546,
                25599
            ],
            [
                25599,
                25636
            ],
            [
                25636,
                25670
            ],
            [
                25670,
                25699
            ],
            [
                25699,
                25817
            ],
            [
                25817,
                25868
            ],
            [
                25868,
                25915
            ],
            [
                25915,
                25950
            ],
            [
                25950,
                25977
            ],
            [
                25977,
                26029
            ],
            [
                26029,
                26136
            ],
            [
                26136,
                26220
            ],
            [
                26220,
                26281
            ],
            [
                26281,
                26373
            ],
            [
                26373,
                26483
            ],
            [
                26483,
                26525
            ],
            [
                26525,
                26654
            ],
            [
                26654,
                26672
            ],
            [
                26672,
                26694
            ],
            [
                26694,
                26730
            ],
            [
                26730,
                26973
            ],
            [
                26973,
                27111
            ],
            [
                27111,
                27159
            ],
            [
                27159,
                27255
            ],
            [
                27255,
                27375
            ],
            [
                27375,
                27385
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                44,
                78
            ],
            [
                102,
                111
            ],
            [
                94,
                98
            ],
            [
                79,
                89
            ],
            [
                112,
                124
            ],
            [
                131,
                153
            ],
            [
                154,
                179
            ],
            [
                182,
                185
            ],
            [
                185,
                212
            ],
            [
                222,
                223
            ],
            [
                224,
                237
            ],
            [
                257,
                262
            ],
            [
                271,
                273
            ],
            [
                263,
                270
            ],
            [
                363,
                365
            ],
            [
                365,
                442
            ],
            [
                453,
                458
            ],
            [
                528,
                532
            ],
            [
                543,
                546
            ],
            [
                469,
                475
            ],
            [
                558,
                560
            ],
            [
                560,
                680
            ],
            [
                766,
                767
            ],
            [
                683,
                739
            ],
            [
                747,
                752
            ],
            [
                800,
                835
            ],
            [
                856,
                858
            ],
            [
                904,
                906
            ],
            [
                1052,
                1055
            ],
            [
                950,
                953
            ],
            [
                1027,
                1030
            ],
            [
                1059,
                1063
            ],
            [
                1064,
                1091
            ],
            [
                1182,
                1183
            ],
            [
                1255,
                1266
            ],
            [
                1301,
                1321
            ],
            [
                1322,
                1363
            ],
            [
                1408,
                1410
            ],
            [
                1410,
                1450
            ],
            [
                1455,
                1459
            ],
            [
                1467,
                1470
            ],
            [
                1470,
                1502
            ],
            [
                1502,
                1539
            ],
            [
                1564,
                1591
            ],
            [
                1591,
                1593
            ],
            [
                1608,
                1630
            ],
            [
                1632,
                1669
            ],
            [
                1669,
                1677
            ],
            [
                1681,
                1712
            ],
            [
                1712,
                1724
            ],
            [
                1731,
                1787
            ],
            [
                1788,
                1807
            ],
            [
                1869,
                1916
            ],
            [
                1812,
                1821
            ],
            [
                1917,
                1921
            ],
            [
                1936,
                1964
            ],
            [
                1965,
                2036
            ],
            [
                2036,
                2052
            ],
            [
                2052,
                2092
            ],
            [
                2115,
                2133
            ],
            [
                2148,
                2150
            ],
            [
                2150,
                2174
            ],
            [
                2313,
                2391
            ],
            [
                2399,
                2401
            ],
            [
                2401,
                2485
            ],
            [
                2596,
                2701
            ],
            [
                2705,
                2760
            ],
            [
                2760,
                2774
            ],
            [
                2795,
                2797
            ],
            [
                2797,
                2800
            ],
            [
                2809,
                2847
            ],
            [
                2847,
                2896
            ],
            [
                2915,
                2946
            ],
            [
                2957,
                2964
            ],
            [
                2973,
                2982
            ],
            [
                2984,
                3040
            ],
            [
                3044,
                3073
            ],
            [
                3079,
                3087
            ],
            [
                3159,
                3161
            ],
            [
                3161,
                3212
            ],
            [
                3223,
                3250
            ],
            [
                3272,
                3285
            ],
            [
                3285,
                3307
            ],
            [
                3341,
                3346
            ],
            [
                3308,
                3316
            ],
            [
                3346,
                3348
            ],
            [
                3348,
                3451
            ],
            [
                3451,
                3474
            ],
            [
                3475,
                3511
            ],
            [
                3511,
                3523
            ],
            [
                3523,
                3548
            ],
            [
                3581,
                3622
            ],
            [
                3625,
                3636
            ],
            [
                3661,
                3664
            ],
            [
                3664,
                3676
            ],
            [
                3695,
                3750
            ],
            [
                3759,
                3762
            ],
            [
                3762,
                3826
            ],
            [
                3826,
                3842
            ],
            [
                3855,
                3891
            ],
            [
                3905,
                3939
            ],
            [
                3939,
                3951
            ],
            [
                3960,
                3964
            ],
            [
                3969,
                3975
            ],
            [
                4000,
                4001
            ],
            [
                4289,
                4343
            ],
            [
                4520,
                4523
            ],
            [
                4344,
                4351
            ],
            [
                4362,
                4386
            ],
            [
                4398,
                4499
            ],
            [
                4534,
                4536
            ],
            [
                4536,
                4564
            ],
            [
                4564,
                4581
            ],
            [
                4601,
                4603
            ],
            [
                4603,
                4633
            ],
            [
                4633,
                4637
            ],
            [
                4642,
                4663
            ],
            [
                4663,
                4698
            ],
            [
                4699,
                4702
            ],
            [
                4718,
                4755
            ],
            [
                4757,
                4759
            ],
            [
                4805,
                4824
            ],
            [
                4825,
                4885
            ],
            [
                4923,
                4925
            ],
            [
                4888,
                4892
            ],
            [
                5160,
                5196
            ],
            [
                5202,
                5204
            ],
            [
                5918,
                5919
            ],
            [
                5601,
                5610
            ],
            [
                5614,
                5621
            ],
            [
                5649,
                5651
            ],
            [
                5813,
                5839
            ],
            [
                6034,
                6036
            ],
            [
                6159,
                6162
            ],
            [
                6194,
                6206
            ],
            [
                6406,
                6451
            ],
            [
                6460,
                6482
            ],
            [
                6486,
                6521
            ],
            [
                6539,
                6541
            ],
            [
                6562,
                6565
            ],
            [
                6647,
                6652
            ],
            [
                6686,
                6698
            ],
            [
                6705,
                6714
            ],
            [
                6723,
                6762
            ],
            [
                6804,
                6810
            ],
            [
                7315,
                7368
            ],
            [
                7428,
                7440
            ],
            [
                7480,
                7512
            ],
            [
                7517,
                7539
            ],
            [
                7551,
                7591
            ],
            [
                7593,
                7635
            ],
            [
                7635,
                7644
            ],
            [
                7697,
                7709
            ],
            [
                7711,
                7713
            ],
            [
                7735,
                7741
            ],
            [
                7741,
                7744
            ],
            [
                7783,
                7793
            ],
            [
                7820,
                7838
            ],
            [
                7895,
                7955
            ],
            [
                7957,
                8001
            ],
            [
                8092,
                8123
            ],
            [
                8123,
                8124
            ],
            [
                8125,
                8161
            ],
            [
                8167,
                8169
            ],
            [
                8175,
                8177
            ],
            [
                8177,
                8261
            ],
            [
                8262,
                8267
            ],
            [
                8283,
                8294
            ],
            [
                8303,
                8328
            ],
            [
                8469,
                8523
            ],
            [
                8523,
                8525
            ],
            [
                8588,
                8619
            ],
            [
                8619,
                8671
            ],
            [
                8671,
                8720
            ],
            [
                8733,
                8738
            ],
            [
                8760,
                8786
            ],
            [
                8786,
                8787
            ],
            [
                8787,
                8793
            ],
            [
                8841,
                8895
            ],
            [
                8895,
                8923
            ],
            [
                8934,
                8936
            ],
            [
                8936,
                8995
            ],
            [
                8995,
                9048
            ],
            [
                9048,
                9050
            ],
            [
                9073,
                9074
            ],
            [
                9051,
                9068
            ],
            [
                9117,
                9120
            ],
            [
                9129,
                9158
            ],
            [
                9175,
                9191
            ],
            [
                9191,
                9204
            ],
            [
                9211,
                9241
            ],
            [
                9241,
                9243
            ],
            [
                9250,
                9254
            ],
            [
                9264,
                9303
            ],
            [
                9322,
                9425
            ],
            [
                9438,
                9468
            ],
            [
                9484,
                9485
            ],
            [
                9486,
                9529
            ],
            [
                9833,
                9834
            ],
            [
                9530,
                9575
            ],
            [
                9577,
                9608
            ],
            [
                9613,
                9632
            ],
            [
                9767,
                9769
            ],
            [
                9652,
                9654
            ],
            [
                9691,
                9709
            ],
            [
                9888,
                9894
            ],
            [
                9730,
                9731
            ],
            [
                9989,
                10080
            ],
            [
                10080,
                10103
            ],
            [
                10109,
                10121
            ],
            [
                10127,
                10129
            ],
            [
                10129,
                10146
            ],
            [
                10160,
                10179
            ],
            [
                10212,
                10229
            ],
            [
                10230,
                10255
            ],
            [
                10266,
                10311
            ],
            [
                10311,
                10363
            ],
            [
                10363,
                10365
            ],
            [
                10365,
                10386
            ],
            [
                10394,
                10396
            ],
            [
                10416,
                10429
            ],
            [
                10473,
                10506
            ],
            [
                10506,
                10548
            ],
            [
                10615,
                10676
            ],
            [
                10676,
                10757
            ],
            [
                10757,
                10769
            ],
            [
                10904,
                10936
            ],
            [
                10936,
                10945
            ],
            [
                10956,
                11010
            ],
            [
                11022,
                11048
            ],
            [
                11057,
                11077
            ],
            [
                11093,
                11129
            ],
            [
                11210,
                11245
            ],
            [
                11264,
                11275
            ],
            [
                11277,
                11306
            ],
            [
                11316,
                11335
            ],
            [
                11336,
                11339
            ],
            [
                11246,
                11249
            ],
            [
                11360,
                11371
            ],
            [
                11371,
                11381
            ],
            [
                11390,
                11479
            ],
            [
                11480,
                11532
            ],
            [
                11574,
                11642
            ],
            [
                11642,
                11671
            ],
            [
                11681,
                11684
            ],
            [
                11684,
                11740
            ],
            [
                11780,
                11782
            ],
            [
                11782,
                11816
            ],
            [
                11834,
                11856
            ],
            [
                11869,
                11871
            ],
            [
                11871,
                11921
            ],
            [
                11934,
                11958
            ],
            [
                11958,
                11992
            ],
            [
                12014,
                12023
            ],
            [
                12030,
                12037
            ],
            [
                12005,
                12008
            ],
            [
                12038,
                12060
            ],
            [
                12060,
                12100
            ],
            [
                12111,
                12112
            ],
            [
                12113,
                12159
            ],
            [
                12176,
                12183
            ],
            [
                12197,
                12267
            ],
            [
                12267,
                12268
            ],
            [
                12273,
                12284
            ],
            [
                12295,
                12298
            ],
            [
                12298,
                12333
            ],
            [
                12333,
                12364
            ],
            [
                12364,
                12408
            ],
            [
                12408,
                12422
            ],
            [
                12462,
                12553
            ],
            [
                12563,
                12573
            ],
            [
                12573,
                12598
            ],
            [
                12598,
                12636
            ],
            [
                12636,
                12658
            ],
            [
                12686,
                12704
            ],
            [
                12709,
                12831
            ],
            [
                12831,
                12858
            ],
            [
                12858,
                12897
            ],
            [
                12944,
                12947
            ],
            [
                12947,
                13005
            ],
            [
                13005,
                13021
            ],
            [
                13040,
                13051
            ],
            [
                13075,
                13156
            ],
            [
                13156,
                13195
            ],
            [
                13247,
                13273
            ],
            [
                13347,
                13349
            ],
            [
                13349,
                13420
            ],
            [
                13420,
                13532
            ],
            [
                13532,
                13632
            ],
            [
                13726,
                13882
            ],
            [
                13882,
                13923
            ],
            [
                13931,
                13937
            ],
            [
                13945,
                13952
            ],
            [
                13955,
                13971
            ],
            [
                13971,
                14013
            ],
            [
                14013,
                14022
            ],
            [
                14069,
                14106
            ],
            [
                14144,
                14146
            ],
            [
                14146,
                14172
            ],
            [
                14195,
                14228
            ],
            [
                14236,
                14249
            ],
            [
                14284,
                14343
            ],
            [
                14407,
                14409
            ],
            [
                14409,
                14427
            ],
            [
                14511,
                14552
            ],
            [
                14445,
                14454
            ],
            [
                14613,
                14630
            ],
            [
                14702,
                14703
            ],
            [
                14822,
                14840
            ],
            [
                14850,
                14940
            ],
            [
                14955,
                14985
            ],
            [
                14985,
                15016
            ],
            [
                15016,
                15097
            ],
            [
                15097,
                15136
            ],
            [
                15136,
                15159
            ],
            [
                15213,
                15215
            ],
            [
                15215,
                15228
            ],
            [
                15228,
                15229
            ],
            [
                15233,
                15240
            ],
            [
                15240,
                15271
            ],
            [
                15274,
                15277
            ],
            [
                15279,
                15338
            ],
            [
                15338,
                15363
            ],
            [
                15363,
                15474
            ],
            [
                15480,
                15504
            ],
            [
                15504,
                15514
            ],
            [
                15526,
                15575
            ],
            [
                15603,
                15609
            ],
            [
                15632,
                15634
            ],
            [
                15634,
                15673
            ],
            [
                15676,
                15700
            ],
            [
                15700,
                15747
            ],
            [
                15757,
                15760
            ],
            [
                15760,
                15779
            ],
            [
                15779,
                15780
            ],
            [
                15792,
                15815
            ],
            [
                15815,
                15816
            ],
            [
                15833,
                15838
            ],
            [
                15839,
                15856
            ],
            [
                15865,
                15887
            ],
            [
                15887,
                15995
            ],
            [
                15995,
                16044
            ],
            [
                16044,
                16067
            ],
            [
                16067,
                16137
            ],
            [
                16137,
                16170
            ],
            [
                16170,
                16201
            ],
            [
                16219,
                16256
            ],
            [
                16585,
                16631
            ],
            [
                16664,
                16668
            ],
            [
                16636,
                16649
            ],
            [
                16677,
                16680
            ],
            [
                16680,
                16745
            ],
            [
                16756,
                16779
            ],
            [
                16779,
                16791
            ],
            [
                16805,
                16808
            ],
            [
                16813,
                16822
            ],
            [
                16890,
                16892
            ],
            [
                16892,
                16898
            ],
            [
                16898,
                16911
            ],
            [
                16911,
                16923
            ],
            [
                16923,
                16950
            ],
            [
                16973,
                16978
            ],
            [
                16956,
                16959
            ],
            [
                16991,
                16994
            ],
            [
                16994,
                17022
            ],
            [
                17022,
                17043
            ],
            [
                17043,
                17059
            ],
            [
                17059,
                17066
            ],
            [
                17068,
                17071
            ],
            [
                17102,
                17108
            ],
            [
                17109,
                17122
            ],
            [
                17131,
                17134
            ],
            [
                17134,
                17185
            ],
            [
                17188,
                17199
            ],
            [
                17319,
                17328
            ],
            [
                17363,
                17370
            ],
            [
                17329,
                17349
            ],
            [
                17351,
                17360
            ],
            [
                17378,
                17381
            ],
            [
                17381,
                17432
            ],
            [
                17463,
                17484
            ],
            [
                17488,
                17490
            ],
            [
                17490,
                17533
            ],
            [
                17565,
                17588
            ],
            [
                17705,
                17773
            ],
            [
                17774,
                17832
            ],
            [
                17857,
                17859
            ],
            [
                17859,
                17864
            ],
            [
                17868,
                17871
            ],
            [
                17883,
                17903
            ],
            [
                17906,
                17925
            ],
            [
                17968,
                17971
            ],
            [
                17971,
                17978
            ],
            [
                17996,
                18000
            ],
            [
                18065,
                18069
            ],
            [
                18070,
                18104
            ],
            [
                18131,
                18147
            ],
            [
                18109,
                18113
            ],
            [
                18149,
                18179
            ],
            [
                18185,
                18240
            ],
            [
                18279,
                18289
            ],
            [
                18289,
                18376
            ],
            [
                18390,
                18416
            ],
            [
                18429,
                18451
            ],
            [
                18585,
                18634
            ],
            [
                18699,
                18701
            ],
            [
                18815,
                18820
            ],
            [
                18822,
                18835
            ],
            [
                18835,
                18851
            ],
            [
                18925,
                18929
            ],
            [
                18951,
                18953
            ],
            [
                19036,
                19072
            ],
            [
                19072,
                19119
            ],
            [
                19119,
                19141
            ],
            [
                19147,
                19160
            ],
            [
                19160,
                19179
            ],
            [
                19194,
                19197
            ],
            [
                19197,
                19202
            ],
            [
                19232,
                19326
            ],
            [
                19326,
                19433
            ],
            [
                19433,
                19467
            ],
            [
                19488,
                19497
            ],
            [
                19543,
                19552
            ],
            [
                19591,
                19636
            ],
            [
                19676,
                19759
            ],
            [
                19870,
                19897
            ],
            [
                19910,
                19954
            ],
            [
                19995,
                20019
            ],
            [
                20020,
                20060
            ],
            [
                20060,
                20079
            ],
            [
                20100,
                20154
            ],
            [
                20154,
                20210
            ],
            [
                20227,
                20248
            ],
            [
                20255,
                20287
            ],
            [
                20442,
                20446
            ],
            [
                20457,
                20597
            ],
            [
                20724,
                20837
            ],
            [
                20841,
                20849
            ],
            [
                20849,
                20923
            ],
            [
                20923,
                20956
            ],
            [
                20970,
                20971
            ],
            [
                21136,
                21138
            ],
            [
                21138,
                21147
            ],
            [
                21161,
                21173
            ],
            [
                21179,
                21187
            ],
            [
                21228,
                21245
            ],
            [
                21245,
                21247
            ],
            [
                21252,
                21406
            ],
            [
                21485,
                21538
            ],
            [
                22078,
                22112
            ],
            [
                22125,
                22133
            ],
            [
                22240,
                22245
            ],
            [
                22165,
                22212
            ],
            [
                22256,
                22294
            ],
            [
                22135,
                22137
            ],
            [
                22306,
                22312
            ],
            [
                22336,
                22357
            ],
            [
                22369,
                22418
            ],
            [
                22418,
                22492
            ],
            [
                22492,
                22525
            ],
            [
                22531,
                22583
            ],
            [
                22584,
                22586
            ],
            [
                22600,
                22652
            ],
            [
                22706,
                22710
            ],
            [
                22678,
                22702
            ],
            [
                22712,
                22744
            ],
            [
                22746,
                22810
            ],
            [
                22810,
                22853
            ],
            [
                22853,
                22872
            ],
            [
                22872,
                22924
            ],
            [
                22924,
                22993
            ],
            [
                22993,
                23059
            ],
            [
                23059,
                23116
            ],
            [
                23124,
                23126
            ],
            [
                23126,
                23224
            ],
            [
                23652,
                23701
            ],
            [
                23701,
                23711
            ],
            [
                23719,
                23773
            ],
            [
                23773,
                23885
            ],
            [
                23885,
                23906
            ],
            [
                23906,
                23914
            ],
            [
                23914,
                23997
            ],
            [
                24107,
                24147
            ],
            [
                24164,
                24196
            ],
            [
                24196,
                24224
            ],
            [
                24230,
                24263
            ],
            [
                24263,
                24305
            ],
            [
                24305,
                24376
            ],
            [
                24376,
                24381
            ],
            [
                24384,
                24432
            ],
            [
                24432,
                24508
            ],
            [
                24508,
                24553
            ],
            [
                24553,
                24564
            ],
            [
                24564,
                24593
            ],
            [
                24593,
                24638
            ],
            [
                24649,
                24651
            ],
            [
                24651,
                24706
            ],
            [
                24706,
                24781
            ],
            [
                24781,
                24850
            ],
            [
                24867,
                24869
            ],
            [
                24869,
                24876
            ],
            [
                24879,
                24905
            ],
            [
                24905,
                24944
            ],
            [
                24944,
                24965
            ],
            [
                24968,
                24981
            ],
            [
                24981,
                25029
            ],
            [
                25051,
                25060
            ],
            [
                25068,
                25078
            ],
            [
                25119,
                25127
            ],
            [
                25142,
                25165
            ],
            [
                25174,
                25247
            ],
            [
                25247,
                25265
            ],
            [
                25265,
                25284
            ],
            [
                25284,
                25329
            ],
            [
                25329,
                25380
            ],
            [
                25380,
                25457
            ],
            [
                25457,
                25470
            ],
            [
                25473,
                25494
            ],
            [
                25494,
                25511
            ],
            [
                25511,
                25526
            ],
            [
                25526,
                25546
            ],
            [
                25546,
                25599
            ],
            [
                25599,
                25636
            ],
            [
                25636,
                25670
            ],
            [
                25670,
                25697
            ],
            [
                25868,
                25900
            ],
            [
                25950,
                25977
            ],
            [
                25977,
                26029
            ],
            [
                26029,
                26045
            ],
            [
                26070,
                26072
            ],
            [
                26046,
                26068
            ],
            [
                26081,
                26095
            ],
            [
                26104,
                26112
            ],
            [
                26134,
                26136
            ],
            [
                26136,
                26176
            ],
            [
                26208,
                26219
            ],
            [
                26220,
                26280
            ],
            [
                26281,
                26373
            ],
            [
                26373,
                26479
            ],
            [
                26483,
                26525
            ],
            [
                26573,
                26654
            ],
            [
                26654,
                26672
            ],
            [
                26730,
                26888
            ],
            [
                26971,
                26973
            ],
            [
                26973,
                27111
            ],
            [
                27111,
                27159
            ],
            [
                27159,
                27182
            ],
            [
                27187,
                27253
            ],
            [
                27255,
                27364
            ],
            [
                27369,
                27374
            ]
        ],
        "row_chars": [
            [
                0,
                44
            ],
            [
                44,
                154
            ],
            [
                154,
                185
            ],
            [
                185,
                224
            ],
            [
                224,
                365
            ],
            [
                365,
                442
            ],
            [
                442,
                560
            ],
            [
                560,
                858
            ],
            [
                858,
                1184
            ],
            [
                1184,
                1241
            ],
            [
                1241,
                1410
            ],
            [
                1410,
                1470
            ],
            [
                1470,
                1502
            ],
            [
                1502,
                1591
            ],
            [
                1591,
                1669
            ],
            [
                1669,
                1712
            ],
            [
                1712,
                1788
            ],
            [
                1788,
                1807
            ],
            [
                1807,
                1965
            ],
            [
                1965,
                2036
            ],
            [
                2036,
                2052
            ],
            [
                2052,
                2150
            ],
            [
                2150,
                2175
            ],
            [
                2175,
                2191
            ],
            [
                2191,
                2213
            ],
            [
                2213,
                2258
            ],
            [
                2258,
                2313
            ],
            [
                2313,
                2401
            ],
            [
                2401,
                2488
            ],
            [
                2488,
                2502
            ],
            [
                2502,
                2596
            ],
            [
                2596,
                2705
            ],
            [
                2705,
                2760
            ],
            [
                2760,
                2797
            ],
            [
                2797,
                2847
            ],
            [
                2847,
                2896
            ],
            [
                2896,
                3040
            ],
            [
                3040,
                3161
            ],
            [
                3161,
                3285
            ],
            [
                3285,
                3348
            ],
            [
                3348,
                3451
            ],
            [
                3451,
                3511
            ],
            [
                3511,
                3523
            ],
            [
                3523,
                3625
            ],
            [
                3625,
                3664
            ],
            [
                3664,
                3676
            ],
            [
                3676,
                3695
            ],
            [
                3695,
                3762
            ],
            [
                3762,
                3826
            ],
            [
                3826,
                3939
            ],
            [
                3939,
                4002
            ],
            [
                4002,
                4128
            ],
            [
                4128,
                4289
            ],
            [
                4289,
                4536
            ],
            [
                4536,
                4564
            ],
            [
                4564,
                4603
            ],
            [
                4603,
                4633
            ],
            [
                4633,
                4663
            ],
            [
                4663,
                4699
            ],
            [
                4699,
                4825
            ],
            [
                4825,
                4926
            ],
            [
                4926,
                5112
            ],
            [
                5112,
                5160
            ],
            [
                5160,
                5204
            ],
            [
                5204,
                5408
            ],
            [
                5408,
                5482
            ],
            [
                5482,
                5574
            ],
            [
                5574,
                6036
            ],
            [
                6036,
                6159
            ],
            [
                6159,
                6541
            ],
            [
                6541,
                6811
            ],
            [
                6811,
                7006
            ],
            [
                7006,
                7145
            ],
            [
                7145,
                7315
            ],
            [
                7315,
                7635
            ],
            [
                7635,
                7741
            ],
            [
                7741,
                7838
            ],
            [
                7838,
                8001
            ],
            [
                8001,
                8092
            ],
            [
                8092,
                8177
            ],
            [
                8177,
                8331
            ],
            [
                8331,
                8378
            ],
            [
                8378,
                8420
            ],
            [
                8420,
                8469
            ],
            [
                8469,
                8525
            ],
            [
                8525,
                8588
            ],
            [
                8588,
                8619
            ],
            [
                8619,
                8671
            ],
            [
                8671,
                8786
            ],
            [
                8786,
                8895
            ],
            [
                8895,
                8923
            ],
            [
                8923,
                8936
            ],
            [
                8936,
                8995
            ],
            [
                8995,
                9048
            ],
            [
                9048,
                9191
            ],
            [
                9191,
                9241
            ],
            [
                9241,
                9486
            ],
            [
                9486,
                9989
            ],
            [
                9989,
                10080
            ],
            [
                10080,
                10129
            ],
            [
                10129,
                10230
            ],
            [
                10230,
                10311
            ],
            [
                10311,
                10365
            ],
            [
                10365,
                10506
            ],
            [
                10506,
                10548
            ],
            [
                10548,
                10615
            ],
            [
                10615,
                10676
            ],
            [
                10676,
                10757
            ],
            [
                10757,
                10936
            ],
            [
                10936,
                11129
            ],
            [
                11129,
                11177
            ],
            [
                11177,
                11210
            ],
            [
                11210,
                11371
            ],
            [
                11371,
                11480
            ],
            [
                11480,
                11642
            ],
            [
                11642,
                11684
            ],
            [
                11684,
                11782
            ],
            [
                11782,
                11871
            ],
            [
                11871,
                11958
            ],
            [
                11958,
                12060
            ],
            [
                12060,
                12113
            ],
            [
                12113,
                12267
            ],
            [
                12267,
                12298
            ],
            [
                12298,
                12333
            ],
            [
                12333,
                12364
            ],
            [
                12364,
                12408
            ],
            [
                12408,
                12422
            ],
            [
                12422,
                12462
            ],
            [
                12462,
                12573
            ],
            [
                12573,
                12598
            ],
            [
                12598,
                12636
            ],
            [
                12636,
                12658
            ],
            [
                12658,
                12686
            ],
            [
                12686,
                12831
            ],
            [
                12831,
                12858
            ],
            [
                12858,
                12947
            ],
            [
                12947,
                13005
            ],
            [
                13005,
                13054
            ],
            [
                13054,
                13074
            ],
            [
                13074,
                13156
            ],
            [
                13156,
                13195
            ],
            [
                13195,
                13247
            ],
            [
                13247,
                13349
            ],
            [
                13349,
                13420
            ],
            [
                13420,
                13532
            ],
            [
                13532,
                13633
            ],
            [
                13633,
                13726
            ],
            [
                13726,
                13882
            ],
            [
                13882,
                13971
            ],
            [
                13971,
                14013
            ],
            [
                14013,
                14146
            ],
            [
                14146,
                14409
            ],
            [
                14409,
                14704
            ],
            [
                14704,
                14822
            ],
            [
                14822,
                14985
            ],
            [
                14985,
                15016
            ],
            [
                15016,
                15097
            ],
            [
                15097,
                15136
            ],
            [
                15136,
                15215
            ],
            [
                15215,
                15228
            ],
            [
                15228,
                15240
            ],
            [
                15240,
                15338
            ],
            [
                15338,
                15363
            ],
            [
                15363,
                15504
            ],
            [
                15504,
                15634
            ],
            [
                15634,
                15700
            ],
            [
                15700,
                15760
            ],
            [
                15760,
                15779
            ],
            [
                15779,
                15815
            ],
            [
                15815,
                15887
            ],
            [
                15887,
                15995
            ],
            [
                15995,
                16044
            ],
            [
                16044,
                16067
            ],
            [
                16067,
                16137
            ],
            [
                16137,
                16170
            ],
            [
                16170,
                16201
            ],
            [
                16201,
                16269
            ],
            [
                16269,
                16389
            ],
            [
                16389,
                16464
            ],
            [
                16464,
                16523
            ],
            [
                16523,
                16585
            ],
            [
                16585,
                16680
            ],
            [
                16680,
                16779
            ],
            [
                16779,
                16808
            ],
            [
                16808,
                16892
            ],
            [
                16892,
                16898
            ],
            [
                16898,
                16911
            ],
            [
                16911,
                16923
            ],
            [
                16923,
                16994
            ],
            [
                16994,
                17022
            ],
            [
                17022,
                17043
            ],
            [
                17043,
                17059
            ],
            [
                17059,
                17134
            ],
            [
                17134,
                17215
            ],
            [
                17215,
                17265
            ],
            [
                17265,
                17381
            ],
            [
                17381,
                17432
            ],
            [
                17432,
                17490
            ],
            [
                17490,
                17588
            ],
            [
                17588,
                17651
            ],
            [
                17651,
                17691
            ],
            [
                17691,
                17774
            ],
            [
                17774,
                17859
            ],
            [
                17859,
                17971
            ],
            [
                17971,
                18104
            ],
            [
                18104,
                18289
            ],
            [
                18289,
                18452
            ],
            [
                18452,
                18585
            ],
            [
                18585,
                18701
            ],
            [
                18701,
                18815
            ],
            [
                18815,
                18835
            ],
            [
                18835,
                18854
            ],
            [
                18854,
                18924
            ],
            [
                18924,
                18953
            ],
            [
                18953,
                19036
            ],
            [
                19036,
                19072
            ],
            [
                19072,
                19119
            ],
            [
                19119,
                19160
            ],
            [
                19160,
                19197
            ],
            [
                19197,
                19326
            ],
            [
                19326,
                19433
            ],
            [
                19433,
                19497
            ],
            [
                19497,
                19543
            ],
            [
                19543,
                19636
            ],
            [
                19636,
                19862
            ],
            [
                19862,
                20020
            ],
            [
                20020,
                20060
            ],
            [
                20060,
                20080
            ],
            [
                20080,
                20100
            ],
            [
                20100,
                20154
            ],
            [
                20154,
                20289
            ],
            [
                20289,
                20387
            ],
            [
                20387,
                20442
            ],
            [
                20442,
                20598
            ],
            [
                20598,
                20724
            ],
            [
                20724,
                20849
            ],
            [
                20849,
                20923
            ],
            [
                20923,
                21138
            ],
            [
                21138,
                21245
            ],
            [
                21245,
                21538
            ],
            [
                21538,
                21617
            ],
            [
                21617,
                21745
            ],
            [
                21745,
                21936
            ],
            [
                21936,
                22075
            ],
            [
                22075,
                22418
            ],
            [
                22418,
                22492
            ],
            [
                22492,
                22584
            ],
            [
                22584,
                22810
            ],
            [
                22810,
                22853
            ],
            [
                22853,
                22872
            ],
            [
                22872,
                22924
            ],
            [
                22924,
                22993
            ],
            [
                22993,
                23059
            ],
            [
                23059,
                23126
            ],
            [
                23126,
                23224
            ],
            [
                23224,
                23394
            ],
            [
                23394,
                23631
            ],
            [
                23631,
                23701
            ],
            [
                23701,
                23773
            ],
            [
                23773,
                23885
            ],
            [
                23885,
                23906
            ],
            [
                23906,
                23914
            ],
            [
                23914,
                24000
            ],
            [
                24000,
                24106
            ],
            [
                24106,
                24164
            ],
            [
                24164,
                24196
            ],
            [
                24196,
                24263
            ],
            [
                24263,
                24305
            ],
            [
                24305,
                24376
            ],
            [
                24376,
                24432
            ],
            [
                24432,
                24508
            ],
            [
                24508,
                24553
            ],
            [
                24553,
                24564
            ],
            [
                24564,
                24593
            ],
            [
                24593,
                24651
            ],
            [
                24651,
                24706
            ],
            [
                24706,
                24781
            ],
            [
                24781,
                24869
            ],
            [
                24869,
                24905
            ],
            [
                24905,
                24944
            ],
            [
                24944,
                24981
            ],
            [
                24981,
                25142
            ],
            [
                25142,
                25247
            ],
            [
                25247,
                25265
            ],
            [
                25265,
                25284
            ],
            [
                25284,
                25329
            ],
            [
                25329,
                25380
            ],
            [
                25380,
                25457
            ],
            [
                25457,
                25494
            ],
            [
                25494,
                25511
            ],
            [
                25511,
                25526
            ],
            [
                25526,
                25546
            ],
            [
                25546,
                25599
            ],
            [
                25599,
                25636
            ],
            [
                25636,
                25670
            ],
            [
                25670,
                25699
            ],
            [
                25699,
                25817
            ],
            [
                25817,
                25868
            ],
            [
                25868,
                25915
            ],
            [
                25915,
                25950
            ],
            [
                25950,
                25977
            ],
            [
                25977,
                26029
            ],
            [
                26029,
                26136
            ],
            [
                26136,
                26220
            ],
            [
                26220,
                26281
            ],
            [
                26281,
                26373
            ],
            [
                26373,
                26483
            ],
            [
                26483,
                26525
            ],
            [
                26525,
                26654
            ],
            [
                26654,
                26672
            ],
            [
                26672,
                26694
            ],
            [
                26694,
                26730
            ],
            [
                26730,
                26973
            ],
            [
                26973,
                27111
            ],
            [
                27111,
                27159
            ],
            [
                27159,
                27255
            ],
            [
                27255,
                27375
            ],
            [
                27375,
                27385
            ]
        ]
    },
    "abridged": {
        "text": "How deep and cunning are the wiles of love! When that Saturday morning arrived, Cheesacre said not a word to his rival about his plans for the day.\n\"You'll take the dog-cart?\" Captain Bellfield had asked.\n\"I don't know yet,\" he replied. But Bellfield knew that Cheesacre must take the dog-cart, and was contented. He would make sure that he was not left behind.\nBefore breakfast Mr. Cheesacre surreptitiously carried out into the yard a bag containing all his apparatus for dressing - his marrow oil for his hair, his shirt with the wondrous embroidered front, his shiny boots, and all the rest. He hid the bag away secretly in the back of the dog-cart.\nBut when he returned into the front hall, he perceived another bag lying near the door.\n\"What the deuce are you going to do with this?\" said he, giving the bag a kick.\n\"Put it where I saw you putting yours just now,\" said Bellfield.\n\"D-- it,\" exclaimed Cheesacre; and then they sat down to breakfast. \"How you hack that ham about,\" he said. \"If you ever provided hams yourself you'd be more particular in cutting them.\"\nThis was very bad. Feeling unable to eat the ham under such circumstances, Bellfield made do with a couple of fresh eggs.\n\"If you didn't mean to eat the meat, why the mischief did you cut it?\" said Cheesacre.\n\"Upon my word, Cheesacre, you're too bad,\" said Bellfield, upset.\n\"What's the matter now?\"\n\"It isn't fair to ask a fellow into your house, and then say such things to him. And it isn't what I've been accustomed to either; I can tell you that, Mr. Cheesacre. You and I have known each other a long time, and I'd put up with more from you than from anyone else; but-\"\n\"Can you pay me the money that you owe me, Bellfield?\" said Cheesacre.\n\"No,\" said Bellfield; \"not immediately.\"\n\"Then eat your breakfast, and hold your tongue.\"\nCaptain Bellfield did eat his breakfast - leaving the ham untouched - and did hold his tongue, vowing vengeance in his heart. Yet the two men went into Norwich quite amicably. Cheesacre felt that he had trespassed a little, and offered the Captain a cigar in the cart. Bellfield accepted the peace offering.\n\"Now,\" said Cheesacre, as he drove into the Swan yard, \"what do you mean to do with yourself all day?\"\n\"I shall go down to the soldiers' quarters, and look the fellows up.\"\n\"All right. But mind this, Bellfield; you're not to be in the Close before four.\"\n\"I won't be!\"\n\"Very well. If you deceive me, I'll not drive you back to Oileymead tonight.\"\nIn this instance Captain Bellfield had no intention to deceive. He did not think that he could do himself any good by hanging about the widow early in the day. She would be busy with the dinner.\nThe cathedral clock, therefore, had struck four before the Captain rang Mrs. Greenow's bell. When he was shown into the drawing-room, he found Cheesacre there alone, redolent with the marrow oil.\n\"Haven't you seen her yet?\" asked the Captain.\n\"No,\" said Cheesacre sulkily.\n\"Nor Charlie Fairstairs?\"\n\"I've seen nobody,\" said Cheesacre. But he was compelled to swallow his anger as the ladies came into the room.\n\"Whoever would have expected two gentlemen to be so punctual!\" said Mrs. Greenow.\nThe widow was almost gorgeous in her mourning dress. Widows' caps are generally hideous; as are dresses of clinging, melancholy crape. But Mrs. Greenow's cap sat jauntily on her head, and showed just enough of her rich brown hair to give her the appearance of youth. Her crape never became faded and rusty, or formed itself into old lumpy folds of cloth.\nMrs. Greenow would still talk much about her husband, as though he had left her only yesterday; but she mistook her dates, referring to the melancholy circumstance as having taken place fifteen months ago. In truth, it was nine months, as everyone knew. But why should they remind her of it? Charlie Fairstairs spoke of the fifteen months with bold confidence, false-tongued little parasite that she was.\n\"Yes, I'm well enough in health,\" said the widow, \"and I suppose I ought to be thankful for it. But if you had buried a wife whom you had loved within the last eighteen months, you too would be indifferent to all that kind of thing. If I were you, Mr. Cheesacre, I would not run the risk of marrying. The sufferings are too great!\" Whereupon she pressed her handkerchief to her eyes.\n\"But I mean to try all the same,\" said Cheesacre, gazing lover-like into the fair one's face.\n\"Then I hope that she may not be torn away from you early in life. Is dinner ready, Jeannette? Good. Mr. Cheesacre, will you give your arm to Miss Fairstairs?\"\nThere was no doubt as to Mrs. Greenow's correctness. As a former soldier, Captain Bellfield was entitled to take the mistress down to dinner. But Cheesacre did not look at it in this light. He only remembered that he had paid for the Captain's food, that the Captain had been brought into Norwich in his gig, that the Captain owed him money, and ought to be regarded as his property.\n\"I pay my way, and that ought to give a man a higher station than being a beggarly captain, which I don't believe he is, if the truth was known,\" he complained to Miss Fairstairs over dinner.\n\"If you were a magistrate, Mr. Cheesacre, you would have rank; but I believe you are not.\" Charlie Fairstairs knew what she was doing. Mr. Cheesacre had tried hard to get his name put up as a magistrate, but had failed.\n\"Nasty, scraggy old cat,\" he said to himself, as he turned away from her.\nBut Bellfield gained little by taking the widow down to dinner. He and Cheesacre were at either end of the table, and the ladies sat at the sides. Mrs. Greenow's hospitality was very good. There was soup, fish, a cutlet, a roast fowl, and some game. Jeannette waited at table nimbly, and the thing could not have been done better. Mrs. Greenow played the kind hostess to perfection. Under her eye Cheesacre was forced into apparent cordiality with Bellfield, and the Captain took the good things provided with thankful good-humour.\nThe widow was so accurately fair in her favours that even Jeannette could not tell to which of the two men she gave the warmest smile. She talked and made others talk, till Cheesacre became almost comfortable, in spite of his jealousy.\n\"And now,\" she said, as she got up to leave the room, \"We will allow these two gentlemen just half an hour, eh Charlie? and then we shall expect them upstairs.\"\n\"Ten minutes will be enough for us here,\" said Cheesacre.\n\"Half an hour,\" said Mrs. Greenow, with a little tone of command. Ten minutes might be enough for Mr. Cheesacre, but it was not enough for her.\nBellfield had opened the door, and the widow glanced at him as she left the room. Cheesacre saw it, and resolved to resent it.\n\"I'll tell you what it is, Bellfield,\" he said moodily, \"I won't have you coming here at all, till this matter is settled.\"\n\"What matter?\" said Bellfield, filling his glass.\n\"You know what matter I mean.\"\n\"You take such a deuce of a time about it.\"\n\"No, I don't. That other fellow has only been dead about nine months, and I've got the thing in excellent train already.\"\n\"And what harm do I do?\"\n\"You disturb me, and you disturb her. You do it on purpose. I'll tell you what; if you'll go clean out of Norwich for a month, I'll lend you two hundred pounds on the day she becomes Mrs. Cheesacre.\"\n\"And where am I to go to?\"\n\"You may stay at Oileymead, if you like.\"\n\"And be told that I hack the ham because it's not my own. Shall I tell you what I think, Cheesacre? That woman has no more idea of marrying you than she has of marrying the Bishop. Won't you fill your glass, old fellow? You may as well give it up. You're a podgy man, you see, and Mrs. Greenow doesn't like podgy men.\"\nCheesacre sat looking at him with his mouth open, dumb with surprise, and almost paralysed with impotent anger. What had happened during the last few hours to change so entirely the tone of his dependent captain?\n\"You are very podgy, Cheesacre,\" Bellfield continued, \"and then you so often smell of the farm-yard; and you talk too much of your money and your property. You'd have had a better chance if you had talked of hers - as I have done. As it is, you haven't any chance at all.\"\nBellfield went on drinking his wine comfortably. Cheesacre was so astounded that the creature whom he had fed - whom he had bribed - should thus turn against him, that for a while he could not speak. It occurred to him that he, Cheesacre, was expected to drive Bellfield home this very evening.\n\"Now I've told you my mind, Cheesy, my boy,\" continued Bellfield, \"and you'll save yourself a deal of trouble if you'll believe what I say. She doesn't mean to marry you. It's most probable that she'll marry me; but, at any rate, she won't marry you.\"\n\"Do you mean to pay me my money, sir?\" said Cheesacre, at last.\n\"Yes, I do.\"\n\"When?\"\n\"When I've married Mrs. Greenow - and therefore, I expect your assistance in that little scheme. Let us drink her health. We shall always be delighted to see you at our house, Cheesy, my boy, and you shall be allowed to hack the hams as much as you please.\"\n\"You shall pay for this,\" said Cheesacre, gasping with anger and dismay.\n\"All right, old fellow; I'll pay for it - with the widow's money. Come; our half-hour is nearly over; shall we go upstairs?\"\n\"I'll expose you.\"\n\"Don't be ill-natured.\"\n\"Where do you mean to sleep tonight, Captain Bellfield?\"\n\"If I sleep at Oileymead it will only be on condition that I have one of the mahogany-furnitured bedrooms.\"\n\"You'll never put your foot in that house again. You're a rascal, sir.\"\n\"Come, come, Cheesy, it won't do for us to quarrel in a lady's house. It wouldn't be the thing at all. You're not drinking your wine. Take another glass, and then we'll go upstairs. No? I might as well ring the bell for Jeannette to take away the wine.\" Then he rang the bell, and when Jeannette came he skipped lightly upstairs into the drawing-room.\n\"Was he here earlier today?\" demanded Cheesacre of Jeanette.\n\"Who? The Captain? Oh dear no. The Captain don't come here often now.\"\n\"He's a confounded rascal.\"\n\"Oh, Mr. Cheesacre!\" said Jeannette.\n\"He is; and others are nearly as bad.\"\n\"If you mean me, Mr. Cheesacre, I do declare you're wronging me. I've been as true as true to you, sir; so I have.\" And Jeannette put her handkerchief up to her eyes.\nA thought occurred to Mr. Cheesacre. He put his hand to his trousers pocket, and gave her half-a-crown. He said nothing further, but followed his enemy up to the drawing-room.\n\"What game is up now, I wonder,\" said Jeannette to herself. \"They'll cut each other's throats before they've done.\" But she decided that in that case Bellfield should be the survivor.\nIn the drawing-room Cheesacre found Bellfield sitting on the sofa with Mrs. Greenow looking at a book of photographs together. The outside rim of her widow's frill on one occasion touched the Captain's whisker, and the Captain looked up with an expression of triumph.\n\"Yes,\" said Mrs. Greenow, waving her handkerchief. \"Yes, there he is. It's so like him. Dear man! Thou wast unmatched among husbands. Whose tender kindness was ever equal to thine? whose sweet temper was so constant? whose manly care so great?\" While she spoke her little finger was touching Bellfield's little finger, as they held the book between them. Charlie Fairstairs and Mr. Cheesacre were watching her narrowly, and she knew that they were watching her. She was certainly a woman of great courage.\nBellfield looked with some interest at the photograph. It showed a small, grey-looking, insignificant old man, with pig's eyes and a toothless mouth. Any other widow, even if she had kept the photograph of such a husband, would have been ashamed to show it.\n\"Have you ever seen it, Mr. Cheesacre?\" asked Mrs. Greenow.\n\"I saw it at Yarmouth,\" said Cheesacre, very sulkily.\n\"That you did not,\" said the lady with some dignity, and rebuke in her tone; \"because it never was at Yarmouth.\" Then she punished Mr. Cheesacre for his sullenness by whispering a few words to the Captain; and Cheesacre in his wrath turned to Charlie Fairstairs.\nAfter that, coffee was brought to them, and here again Cheesacre in his ill-humour allowed the Captain to out-manuvre him. It was the Captain who put the sugar into the cups and handed them round. He even handed a cup to his enemy, who refused it sulkily.\nCheesacre in his gloom resolved upon two things. He resolved that he would not leave the room that evening till Bellfield had left it; and that he would get a final answer from the widow, if not that night, then early after breakfast on the following morning. He sat silent, while Bellfield was talking fluently, and comforted himself with reflections on his own wealth, and promised himself a rich harvest of revenge when he should tell Mrs. Greenow how that man was a beggar, a swindler, and a rascal.\nAnd he was astonished when an opportunity for doing so came very quickly. Before the neighbouring clock had finished striking seven, Bellfield rose from his chair to go.\nHe spoke a word of farewell to Miss Fairstairs; then he said \"Good night, Cheesacre,\" in the easiest tone in the world. After that he pressed the widow's hand and whispered his adieu.\n\"I thought you were staying at Oileymead?\" said Mrs. Greenow.\n\"I came from there this morning,\" said the Captain.\n\"But he isn't going back there, I can tell you,\" said Mr. Cheesacre.\n\"Oh, indeed,\" said Mrs. Greenow; \"I hope there is nothing wrong.\"\n\"All as right as a trivet,\" said the Captain; and then he left.\n\"I promised mamma that I would be home by seven,\" said Charlie Fairstairs, rising from her chair. So Mr. Cheesacre found himself alone with the lady.\n\"I'm sorry,\" said she, gravely, \"that you two have quarrelled.\"\n\"Mrs. Greenow,\" said he, jumping up, and becoming on a sudden full of life, \"that man is a downright swindler.\"\n\"Oh, Mr. Cheesacre.\"\n\"He is. He'll tell you that he was at Inkerman, but I believe he was in prison all the time. I doubt whether he ever saw a shot fired.\"\n\"He's none the worse for that.\"\n\"But he tells such lies; and he has not a penny in the world. How much do you suppose he owes me, now?\"\n\"However much it is, I'm sure you are too much of a gentleman to say.\"\n\"Well - yes, I am,\" said he, trying to recover himself. \"But when I asked him how he intended to pay me, what do you think he said? He said he'd pay me when he got your money.\"\n\"My money! He couldn't have said that!\"\n\"But he did, Mrs. Greenow; I give you my word. 'I'll pay you when I get the widow's money,' he said.\"\n\"You gentlemen must have a nice way of talking about me when I am absent.\"\n\"I never said a disrespectful word about you in my life, Mrs. Greenow. He does - he says horrible things.\"\n\"What horrible things, Mr. Cheesacre?\"\n\"Oh, I can't tell you - but he does. What can you expect from such a man as that, who doesn't have a spare set of clothes for his back? Where he's to get a bed tonight, I don't know, for I doubt whether he's got half-a-crown in the world.\"\n\"Poor Bellfield!\"\n\"Yes; he is poor.\"\n\"But how gracefully he carries his poverty.\"\n\"I should call it very disgraceful, Mrs. Greenow.\" To this she made no reply, and then he thought that he might begin his work. \"Mrs. Greenow - may I say Arabella?\"\n\"Mr. Cheesacre!\"\n\"But mayn't I? Come, Mrs. Greenow. You know well enough by this time what it is I mean. What's the use of shilly-shallying?\"\n\"Shilly-shallying, Mr. Cheesacre! I never heard such language?\"\n\"I beg your pardon, Mrs. Greenow.\"\n\"Shilly-shallying, indeed! There's very little shall in it, I can assure you.\"\nThe poor man was so dreadfully crestfallen that the widow relented. It was not in her nature to quarrel with her lovers.\n\"I beg your pardon, Mrs. Greenow,\" said the culprit, humbly.\n\"It is granted,\" said the widow; \"but never tell a lady again that she is shilly-shallying. And look here, Mr. Cheesacre, if it should ever come to pass that you are making love to a lady in earnest-\"\n\"I couldn't be more in earnest,\" said he.\n\"-talk to her a little more about your passion and a little less about your purse. Now, good night.\"\nCheesacre, as he drove himself home in the dark, tried to console himself by thinking of the miserable plight in which Bellfield would find himself at Norwich. But as he turned in at his own gate he met two figures emerging; one of them was laden with a portmanteau, and the other with a hat case.\n\"It's only me, Cheesy, my boy,\" said Bellfield. \"I've just come down by rail to fetch my things, and I'm going back to Norwich by the 9.20.\"\n\"If you've stolen anything of mine I'll have you prosecuted,\" roared Cheesacre, as he drove his gig up to his door.",
        "paragraph_chars": [
            [
                0,
                148
            ],
            [
                148,
                205
            ],
            [
                205,
                362
            ],
            [
                362,
                654
            ],
            [
                654,
                742
            ],
            [
                742,
                822
            ],
            [
                822,
                887
            ],
            [
                887,
                1074
            ],
            [
                1074,
                1196
            ],
            [
                1196,
                1283
            ],
            [
                1283,
                1349
            ],
            [
                1349,
                1374
            ],
            [
                1374,
                1649
            ],
            [
                1649,
                1720
            ],
            [
                1720,
                1761
            ],
            [
                1761,
                1810
            ],
            [
                1810,
                2118
            ],
            [
                2118,
                2221
            ],
            [
                2221,
                2291
            ],
            [
                2291,
                2373
            ],
            [
                2373,
                2387
            ],
            [
                2387,
                2465
            ],
            [
                2465,
                2660
            ],
            [
                2660,
                2856
            ],
            [
                2856,
                2903
            ],
            [
                2903,
                2933
            ],
            [
                2933,
                2959
            ],
            [
                2959,
                3071
            ],
            [
                3071,
                3153
            ],
            [
                3153,
                3508
            ],
            [
                3508,
                3913
            ],
            [
                3913,
                4297
            ],
            [
                4297,
                4391
            ],
            [
                4391,
                4551
            ],
            [
                4551,
                4935
            ],
            [
                4935,
                5127
            ],
            [
                5127,
                5347
            ],
            [
                5347,
                5421
            ],
            [
                5421,
                5953
            ],
            [
                5953,
                6189
            ],
            [
                6189,
                6350
            ],
            [
                6350,
                6408
            ],
            [
                6408,
                6552
            ],
            [
                6552,
                6679
            ],
            [
                6679,
                6803
            ],
            [
                6803,
                6853
            ],
            [
                6853,
                6884
            ],
            [
                6884,
                6928
            ],
            [
                6928,
                7050
            ],
            [
                7050,
                7075
            ],
            [
                7075,
                7275
            ],
            [
                7275,
                7302
            ],
            [
                7302,
                7344
            ],
            [
                7344,
                7663
            ],
            [
                7663,
                7876
            ],
            [
                7876,
                8149
            ],
            [
                8149,
                8444
            ],
            [
                8444,
                8696
            ],
            [
                8696,
                8760
            ],
            [
                8760,
                8773
            ],
            [
                8773,
                8781
            ],
            [
                8781,
                9039
            ],
            [
                9039,
                9112
            ],
            [
                9112,
                9237
            ],
            [
                9237,
                9256
            ],
            [
                9256,
                9280
            ],
            [
                9280,
                9337
            ],
            [
                9337,
                9445
            ],
            [
                9445,
                9517
            ],
            [
                9517,
                9869
            ],
            [
                9869,
                9930
            ],
            [
                9930,
                10001
            ],
            [
                10001,
                10029
            ],
            [
                10029,
                10066
            ],
            [
                10066,
                10105
            ],
            [
                10105,
                10272
            ],
            [
                10272,
                10448
            ],
            [
                10448,
                10632
            ],
            [
                10632,
                10900
            ],
            [
                10900,
                11406
            ],
            [
                11406,
                11664
            ],
            [
                11664,
                11724
            ],
            [
                11724,
                11778
            ],
            [
                11778,
                12041
            ],
            [
                12041,
                12297
            ],
            [
                12297,
                12801
            ],
            [
                12801,
                12971
            ],
            [
                12971,
                13155
            ],
            [
                13155,
                13217
            ],
            [
                13217,
                13269
            ],
            [
                13269,
                13338
            ],
            [
                13338,
                13404
            ],
            [
                13404,
                13468
            ],
            [
                13468,
                13618
            ],
            [
                13618,
                13682
            ],
            [
                13682,
                13794
            ],
            [
                13794,
                13815
            ],
            [
                13815,
                13951
            ],
            [
                13951,
                13983
            ],
            [
                13983,
                14087
            ],
            [
                14087,
                14158
            ],
            [
                14158,
                14335
            ],
            [
                14335,
                14375
            ],
            [
                14375,
                14477
            ],
            [
                14477,
                14552
            ],
            [
                14552,
                14659
            ],
            [
                14659,
                14698
            ],
            [
                14698,
                14938
            ],
            [
                14938,
                14956
            ],
            [
                14956,
                14975
            ],
            [
                14975,
                15020
            ],
            [
                15020,
                15185
            ],
            [
                15185,
                15202
            ],
            [
                15202,
                15327
            ],
            [
                15327,
                15391
            ],
            [
                15391,
                15426
            ],
            [
                15426,
                15505
            ],
            [
                15505,
                15626
            ],
            [
                15626,
                15687
            ],
            [
                15687,
                15888
            ],
            [
                15888,
                15930
            ],
            [
                15930,
                16031
            ],
            [
                16031,
                16329
            ],
            [
                16329,
                16470
            ],
            [
                16470,
                16585
            ]
        ],
        "segment_chars": [
            [
                0,
                44
            ],
            [
                44,
                148
            ],
            [
                148,
                176
            ],
            [
                176,
                205
            ],
            [
                205,
                237
            ],
            [
                237,
                314
            ],
            [
                314,
                362
            ],
            [
                362,
                596
            ],
            [
                596,
                654
            ],
            [
                654,
                742
            ],
            [
                742,
                790
            ],
            [
                790,
                822
            ],
            [
                822,
                887
            ],
            [
                887,
                955
            ],
            [
                955,
                995
            ],
            [
                995,
                1074
            ],
            [
                1074,
                1093
            ],
            [
                1093,
                1196
            ],
            [
                1196,
                1267
            ],
            [
                1267,
                1283
            ],
            [
                1283,
                1349
            ],
            [
                1349,
                1374
            ],
            [
                1374,
                1455
            ],
            [
                1455,
                1541
            ],
            [
                1541,
                1649
            ],
            [
                1649,
                1704
            ],
            [
                1704,
                1720
            ],
            [
                1720,
                1761
            ],
            [
                1761,
                1810
            ],
            [
                1810,
                1936
            ],
            [
                1936,
                1986
            ],
            [
                1986,
                2079
            ],
            [
                2079,
                2118
            ],
            [
                2118,
                2221
            ],
            [
                2221,
                2291
            ],
            [
                2291,
                2303
            ],
            [
                2303,
                2373
            ],
            [
                2373,
                2387
            ],
            [
                2387,
                2399
            ],
            [
                2399,
                2465
            ],
            [
                2465,
                2529
            ],
            [
                2529,
                2625
            ],
            [
                2625,
                2660
            ],
            [
                2660,
                2753
            ],
            [
                2753,
                2856
            ],
            [
                2856,
                2884
            ],
            [
                2884,
                2903
            ],
            [
                2903,
                2933
            ],
            [
                2933,
                2959
            ],
            [
                2959,
                2995
            ],
            [
                2995,
                3071
            ],
            [
                3071,
                3134
            ],
            [
                3134,
                3153
            ],
            [
                3153,
                3206
            ],
            [
                3206,
                3288
            ],
            [
                3288,
                3420
            ],
            [
                3420,
                3508
            ],
            [
                3508,
                3714
            ],
            [
                3714,
                3762
            ],
            [
                3762,
                3800
            ],
            [
                3800,
                3913
            ],
            [
                3913,
                4009
            ],
            [
                4009,
                4146
            ],
            [
                4146,
                4214
            ],
            [
                4214,
                4245
            ],
            [
                4245,
                4297
            ],
            [
                4297,
                4391
            ],
            [
                4391,
                4458
            ],
            [
                4458,
                4486
            ],
            [
                4486,
                4492
            ],
            [
                4492,
                4551
            ],
            [
                4551,
                4604
            ],
            [
                4604,
                4693
            ],
            [
                4693,
                4741
            ],
            [
                4741,
                4935
            ],
            [
                4935,
                5127
            ],
            [
                5127,
                5218
            ],
            [
                5218,
                5262
            ],
            [
                5262,
                5347
            ],
            [
                5347,
                5421
            ],
            [
                5421,
                5485
            ],
            [
                5485,
                5568
            ],
            [
                5568,
                5610
            ],
            [
                5610,
                5671
            ],
            [
                5671,
                5752
            ],
            [
                5752,
                5804
            ],
            [
                5804,
                5953
            ],
            [
                5953,
                6088
            ],
            [
                6088,
                6189
            ],
            [
                6189,
                6309
            ],
            [
                6309,
                6350
            ],
            [
                6350,
                6408
            ],
            [
                6408,
                6474
            ],
            [
                6474,
                6552
            ],
            [
                6552,
                6634
            ],
            [
                6634,
                6679
            ],
            [
                6679,
                6803
            ],
            [
                6803,
                6818
            ],
            [
                6818,
                6853
            ],
            [
                6853,
                6884
            ],
            [
                6884,
                6928
            ],
            [
                6928,
                6942
            ],
            [
                6942,
                7050
            ],
            [
                7050,
                7075
            ],
            [
                7075,
                7113
            ],
            [
                7113,
                7135
            ],
            [
                7135,
                7275
            ],
            [
                7275,
                7302
            ],
            [
                7302,
                7344
            ],
            [
                7344,
                7402
            ],
            [
                7402,
                7444
            ],
            [
                7444,
                7525
            ],
            [
                7525,
                7564
            ],
            [
                7564,
                7592
            ],
            [
                7592,
                7663
            ],
            [
                7663,
                7775
            ],
            [
                7775,
                7876
            ],
            [
                7876,
                8032
            ],
            [
                8032,
                8107
            ],
            [
                8107,
                8149
            ],
            [
                8149,
                8198
            ],
            [
                8198,
                8349
            ],
            [
                8349,
                8444
            ],
            [
                8444,
                8584
            ],
            [
                8584,
                8615
            ],
            [
                8615,
                8696
            ],
            [
                8696,
                8735
            ],
            [
                8735,
                8760
            ],
            [
                8760,
                8773
            ],
            [
                8773,
                8781
            ],
            [
                8781,
                8878
            ],
            [
                8878,
                8903
            ],
            [
                8903,
                9039
            ],
            [
                9039,
                9112
            ],
            [
                9112,
                9178
            ],
            [
                9178,
                9237
            ],
            [
                9237,
                9256
            ],
            [
                9256,
                9280
            ],
            [
                9280,
                9337
            ],
            [
                9337,
                9445
            ],
            [
                9445,
                9494
            ],
            [
                9494,
                9517
            ],
            [
                9517,
                9587
            ],
            [
                9587,
                9620
            ],
            [
                9620,
                9651
            ],
            [
                9651,
                9699
            ],
            [
                9699,
                9703
            ],
            [
                9703,
                9771
            ],
            [
                9771,
                9869
            ],
            [
                9869,
                9898
            ],
            [
                9898,
                9930
            ],
            [
                9930,
                9936
            ],
            [
                9936,
                9949
            ],
            [
                9949,
                9961
            ],
            [
                9961,
                10001
            ],
            [
                10001,
                10029
            ],
            [
                10029,
                10050
            ],
            [
                10050,
                10066
            ],
            [
                10066,
                10105
            ],
            [
                10105,
                10170
            ],
            [
                10170,
                10221
            ],
            [
                10221,
                10272
            ],
            [
                10272,
                10309
            ],
            [
                10309,
                10376
            ],
            [
                10376,
                10448
            ],
            [
                10448,
                10508
            ],
            [
                10508,
                10564
            ],
            [
                10564,
                10632
            ],
            [
                10632,
                10759
            ],
            [
                10759,
                10900
            ],
            [
                10900,
                10951
            ],
            [
                10951,
                10970
            ],
            [
                10970,
                10988
            ],
            [
                10988,
                10998
            ],
            [
                10998,
                11034
            ],
            [
                11034,
                11081
            ],
            [
                11081,
                11117
            ],
            [
                11117,
                11145
            ],
            [
                11145,
                11255
            ],
            [
                11255,
                11362
            ],
            [
                11362,
                11406
            ],
            [
                11406,
                11461
            ],
            [
                11461,
                11556
            ],
            [
                11556,
                11664
            ],
            [
                11664,
                11704
            ],
            [
                11704,
                11724
            ],
            [
                11724,
                11778
            ],
            [
                11778,
                11891
            ],
            [
                11891,
                12041
            ],
            [
                12041,
                12164
            ],
            [
                12164,
                12238
            ],
            [
                12238,
                12297
            ],
            [
                12297,
                12346
            ],
            [
                12346,
                12557
            ],
            [
                12557,
                12801
            ],
            [
                12801,
                12875
            ],
            [
                12875,
                12971
            ],
            [
                12971,
                13091
            ],
            [
                13091,
                13155
            ],
            [
                13155,
                13198
            ],
            [
                13198,
                13217
            ],
            [
                13217,
                13269
            ],
            [
                13269,
                13338
            ],
            [
                13338,
                13404
            ],
            [
                13404,
                13468
            ],
            [
                13468,
                13566
            ],
            [
                13566,
                13618
            ],
            [
                13618,
                13682
            ],
            [
                13682,
                13794
            ],
            [
                13794,
                13815
            ],
            [
                13815,
                13823
            ],
            [
                13823,
                13908
            ],
            [
                13908,
                13951
            ],
            [
                13951,
                13983
            ],
            [
                13983,
                14045
            ],
            [
                14045,
                14087
            ],
            [
                14087,
                14158
            ],
            [
                14158,
                14214
            ],
            [
                14214,
                14290
            ],
            [
                14290,
                14335
            ],
            [
                14335,
                14346
            ],
            [
                14346,
                14375
            ],
            [
                14375,
                14422
            ],
            [
                14422,
                14477
            ],
            [
                14477,
                14552
            ],
            [
                14552,
                14623
            ],
            [
                14623,
                14659
            ],
            [
                14659,
                14698
            ],
            [
                14698,
                14735
            ],
            [
                14735,
                14834
            ],
            [
                14834,
                14938
            ],
            [
                14938,
                14956
            ],
            [
                14956,
                14975
            ],
            [
                14975,
                15020
            ],
            [
                15020,
                15071
            ],
            [
                15071,
                15148
            ],
            [
                15148,
                15185
            ],
            [
                15185,
                15202
            ],
            [
                15202,
                15217
            ],
            [
                15217,
                15237
            ],
            [
                15237,
                15290
            ],
            [
                15290,
                15327
            ],
            [
                15327,
                15361
            ],
            [
                15361,
                15391
            ],
            [
                15391,
                15426
            ],
            [
                15426,
                15453
            ],
            [
                15453,
                15505
            ],
            [
                15505,
                15573
            ],
            [
                15573,
                15626
            ],
            [
                15626,
                15687
            ],
            [
                15687,
                15779
            ],
            [
                15779,
                15888
            ],
            [
                15888,
                15930
            ],
            [
                15930,
                16013
            ],
            [
                16013,
                16031
            ],
            [
                16031,
                16191
            ],
            [
                16191,
                16329
            ],
            [
                16329,
                16377
            ],
            [
                16377,
                16470
            ],
            [
                16470,
                16585
            ]
        ],
        "overlap_chars": [
            [
                0,
                44
            ],
            [
                44,
                78
            ],
            [
                80,
                89
            ],
            [
                90,
                94
            ],
            [
                95,
                105
            ],
            [
                106,
                118
            ],
            [
                125,
                147
            ],
            [
                148,
                173
            ],
            [
                173,
                176
            ],
            [
                176,
                203
            ],
            [
                203,
                204
            ],
            [
                205,
                218
            ],
            [
                219,
                224
            ],
            [
                225,
                227
            ],
            [
                228,
                235
            ],
            [
                235,
                237
            ],
            [
                237,
                314
            ],
            [
                317,
                322
            ],
            [
                333,
                337
            ],
            [
                345,
                348
            ],
            [
                354,
                360
            ],
            [
                360,
                362
            ],
            [
                362,
                482
            ],
            [
                483,
                484
            ],
            [
                485,
                541
            ],
            [
                554,
                559
            ],
            [
                559,
                594
            ],
            [
                594,
                596
            ],
            [
                596,
                598
            ],
            [
                599,
                602
            ],
            [
                603,
                606
            ],
            [
                607,
                610
            ],
            [
                611,
                615
            ],
            [
                625,
                652
            ],
            [
                652,
                653
            ],
            [
                663,
                674
            ],
            [
                675,
                695
            ],
            [
                699,
                740
            ],
            [
                740,
                742
            ],
            [
                742,
                782
            ],
            [
                783,
                787
            ],
            [
                787,
                790
            ],
            [
                790,
                822
            ],
            [
                822,
                859
            ],
            [
                860,
                887
            ],
            [
                887,
                889
            ],
            [
                894,
                916
            ],
            [
                918,
                955
            ],
            [
                955,
                963
            ],
            [
                964,
                995
            ],
            [
                995,
                1007
            ],
            [
                1017,
                1073
            ],
            [
                1074,
                1093
            ],
            [
                1101,
                1148
            ],
            [
                1149,
                1158
            ],
            [
                1159,
                1163
            ],
            [
                1167,
                1195
            ],
            [
                1196,
                1267
            ],
            [
                1267,
                1283
            ],
            [
                1283,
                1323
            ],
            [
                1323,
                1341
            ],
            [
                1347,
                1349
            ],
            [
                1349,
                1373
            ],
            [
                1375,
                1453
            ],
            [
                1453,
                1455
            ],
            [
                1455,
                1539
            ],
            [
                1541,
                1646
            ],
            [
                1649,
                1704
            ],
            [
                1704,
                1718
            ],
            [
                1718,
                1720
            ],
            [
                1720,
                1723
            ],
            [
                1723,
                1761
            ],
            [
                1761,
                1810
            ],
            [
                1818,
                1849
            ],
            [
                1860,
                1867
            ],
            [
                1868,
                1877
            ],
            [
                1880,
                1936
            ],
            [
                1940,
                1969
            ],
            [
                1976,
                1984
            ],
            [
                1984,
                1986
            ],
            [
                1986,
                2037
            ],
            [
                2038,
                2065
            ],
            [
                2066,
                2079
            ],
            [
                2079,
                2101
            ],
            [
                2102,
                2107
            ],
            [
                2108,
                2116
            ],
            [
                2116,
                2118
            ],
            [
                2118,
                2221
            ],
            [
                2221,
                2244
            ],
            [
                2255,
                2291
            ],
            [
                2291,
                2303
            ],
            [
                2303,
                2328
            ],
            [
                2329,
                2370
            ],
            [
                2373,
                2384
            ],
            [
                2384,
                2387
            ],
            [
                2387,
                2399
            ],
            [
                2399,
                2454
            ],
            [
                2462,
                2465
            ],
            [
                2465,
                2529
            ],
            [
                2529,
                2545
            ],
            [
                2546,
                2582
            ],
            [
                2591,
                2625
            ],
            [
                2625,
                2637
            ],
            [
                2643,
                2647
            ],
            [
                2652,
                2658
            ],
            [
                2658,
                2659
            ],
            [
                2660,
                2714
            ],
            [
                2715,
                2718
            ],
            [
                2719,
                2726
            ],
            [
                2727,
                2751
            ],
            [
                2753,
                2854
            ],
            [
                2854,
                2856
            ],
            [
                2856,
                2884
            ],
            [
                2884,
                2901
            ],
            [
                2901,
                2903
            ],
            [
                2903,
                2933
            ],
            [
                2933,
                2937
            ],
            [
                2938,
                2959
            ],
            [
                2959,
                2994
            ],
            [
                2995,
                2998
            ],
            [
                2999,
                3036
            ],
            [
                3037,
                3039
            ],
            [
                3051,
                3070
            ],
            [
                3071,
                3131
            ],
            [
                3131,
                3133
            ],
            [
                3134,
                3138
            ],
            [
                3153,
                3189
            ],
            [
                3204,
                3206
            ],
            [
                3212,
                3213
            ],
            [
                3223,
                3232
            ],
            [
                3233,
                3240
            ],
            [
                3257,
                3259
            ],
            [
                3260,
                3286
            ],
            [
                3286,
                3288
            ],
            [
                3288,
                3291
            ],
            [
                3292,
                3304
            ],
            [
                3307,
                3352
            ],
            [
                3360,
                3382
            ],
            [
                3383,
                3418
            ],
            [
                3418,
                3420
            ],
            [
                3420,
                3423
            ],
            [
                3424,
                3429
            ],
            [
                3430,
                3442
            ],
            [
                3449,
                3458
            ],
            [
                3458,
                3497
            ],
            [
                3501,
                3507
            ],
            [
                3508,
                3561
            ],
            [
                3562,
                3574
            ],
            [
                3575,
                3607
            ],
            [
                3608,
                3630
            ],
            [
                3631,
                3671
            ],
            [
                3672,
                3714
            ],
            [
                3714,
                3723
            ],
            [
                3731,
                3743
            ],
            [
                3744,
                3746
            ],
            [
                3756,
                3762
            ],
            [
                3762,
                3765
            ],
            [
                3766,
                3776
            ],
            [
                3782,
                3800
            ],
            [
                3808,
                3868
            ],
            [
                3869,
                3913
            ],
            [
                3913,
                3944
            ],
            [
                3961,
                3962
            ],
            [
                3964,
                4000
            ],
            [
                4005,
                4007
            ],
            [
                4007,
                4009
            ],
            [
                4009,
                4093
            ],
            [
                4098,
                4103
            ],
            [
                4107,
                4118
            ],
            [
                4119,
                4144
            ],
            [
                4146,
                4200
            ],
            [
                4212,
                4214
            ],
            [
                4214,
                4245
            ],
            [
                4245,
                4297
            ],
            [
                4297,
                4346
            ],
            [
                4354,
                4359
            ],
            [
                4365,
                4391
            ],
            [
                4391,
                4392
            ],
            [
                4397,
                4403
            ],
            [
                4404,
                4458
            ],
            [
                4458,
                4486
            ],
            [
                4490,
                4492
            ],
            [
                4492,
                4551
            ],
            [
                4551,
                4604
            ],
            [
                4604,
                4606
            ],
            [
                4623,
                4624
            ],
            [
                4625,
                4642
            ],
            [
                4643,
                4646
            ],
            [
                4647,
                4676
            ],
            [
                4677,
                4693
            ],
            [
                4693,
                4706
            ],
            [
                4711,
                4741
            ],
            [
                4741,
                4743
            ],
            [
                4744,
                4748
            ],
            [
                4760,
                4799
            ],
            [
                4799,
                4902
            ],
            [
                4903,
                4933
            ],
            [
                4933,
                4934
            ],
            [
                4935,
                4978
            ],
            [
                4979,
                4980
            ],
            [
                4981,
                5026
            ],
            [
                5027,
                5058
            ],
            [
                5059,
                5078
            ],
            [
                5078,
                5080
            ],
            [
                5081,
                5083
            ],
            [
                5095,
                5113
            ],
            [
                5119,
                5125
            ],
            [
                5125,
                5126
            ],
            [
                5127,
                5218
            ],
            [
                5218,
                5241
            ],
            [
                5242,
                5254
            ],
            [
                5260,
                5262
            ],
            [
                5262,
                5279
            ],
            [
                5291,
                5310
            ],
            [
                5329,
                5346
            ],
            [
                5347,
                5372
            ],
            [
                5376,
                5421
            ],
            [
                5421,
                5473
            ],
            [
                5483,
                5485
            ],
            [
                5485,
                5506
            ],
            [
                5507,
                5509
            ],
            [
                5521,
                5534
            ],
            [
                5535,
                5568
            ],
            [
                5568,
                5610
            ],
            [
                5610,
                5671
            ],
            [
                5671,
                5752
            ],
            [
                5752,
                5764
            ],
            [
                5772,
                5804
            ],
            [
                5804,
                5813
            ],
            [
                5814,
                5868
            ],
            [
                5869,
                5895
            ],
            [
                5896,
                5916
            ],
            [
                5917,
                5953
            ],
            [
                5953,
                5988
            ],
            [
                5989,
                6000
            ],
            [
                6001,
                6030
            ],
            [
                6036,
                6055
            ],
            [
                6060,
                6063
            ],
            [
                6069,
                6072
            ],
            [
                6077,
                6088
            ],
            [
                6088,
                6098
            ],
            [
                6099,
                6188
            ],
            [
                6189,
                6241
            ],
            [
                6241,
                6309
            ],
            [
                6309,
                6338
            ],
            [
                6347,
                6350
            ],
            [
                6350,
                6406
            ],
            [
                6406,
                6408
            ],
            [
                6408,
                6442
            ],
            [
                6450,
                6472
            ],
            [
                6472,
                6474
            ],
            [
                6474,
                6524
            ],
            [
                6528,
                6552
            ],
            [
                6552,
                6586
            ],
            [
                6587,
                6596
            ],
            [
                6597,
                6604
            ],
            [
                6608,
                6611
            ],
            [
                6612,
                6634
            ],
            [
                6634,
                6674
            ],
            [
                6677,
                6678
            ],
            [
                6679,
                6725
            ],
            [
                6726,
                6733
            ],
            [
                6733,
                6803
            ],
            [
                6803,
                6804
            ],
            [
                6804,
                6815
            ],
            [
                6815,
                6818
            ],
            [
                6818,
                6853
            ],
            [
                6853,
                6884
            ],
            [
                6884,
                6928
            ],
            [
                6928,
                6942
            ],
            [
                6942,
                7033
            ],
            [
                7040,
                7050
            ],
            [
                7050,
                7075
            ],
            [
                7075,
                7113
            ],
            [
                7113,
                7135
            ],
            [
                7135,
                7153
            ],
            [
                7153,
                7275
            ],
            [
                7275,
                7302
            ],
            [
                7302,
                7341
            ],
            [
                7341,
                7344
            ],
            [
                7344,
                7402
            ],
            [
                7402,
                7418
            ],
            [
                7431,
                7442
            ],
            [
                7444,
                7525
            ],
            [
                7525,
                7564
            ],
            [
                7564,
                7590
            ],
            [
                7590,
                7592
            ],
            [
                7592,
                7663
            ],
            [
                7663,
                7775
            ],
            [
                7775,
                7875
            ],
            [
                7876,
                8032
            ],
            [
                8032,
                8073
            ],
            [
                8074,
                8080
            ],
            [
                8081,
                8088
            ],
            [
                8091,
                8107
            ],
            [
                8107,
                8149
            ],
            [
                8149,
                8158
            ],
            [
                8159,
                8196
            ],
            [
                8196,
                8198
            ],
            [
                8198,
                8224
            ],
            [
                8225,
                8258
            ],
            [
                8266,
                8279
            ],
            [
                8282,
                8341
            ],
            [
                8347,
                8349
            ],
            [
                8349,
                8367
            ],
            [
                8368,
                8409
            ],
            [
                8410,
                8419
            ],
            [
                8425,
                8442
            ],
            [
                8442,
                8443
            ],
            [
                8444,
                8462
            ],
            [
                8463,
                8553
            ],
            [
                8554,
                8584
            ],
            [
                8584,
                8615
            ],
            [
                8615,
                8696
            ],
            [
                8696,
                8735
            ],
            [
                8735,
                8758
            ],
            [
                8758,
                8760
            ],
            [
                8760,
                8773
            ],
            [
                8773,
                8774
            ],
            [
                8774,
                8781
            ],
            [
                8781,
                8812
            ],
            [
                8815,
                8818
            ],
            [
                8819,
                8878
            ],
            [
                8878,
                8903
            ],
            [
                8903,
                9014
            ],
            [
                9015,
                9039
            ],
            [
                9039,
                9049
            ],
            [
                9050,
                9099
            ],
            [
                9104,
                9110
            ],
            [
                9110,
                9112
            ],
            [
                9112,
                9151
            ],
            [
                9154,
                9178
            ],
            [
                9178,
                9225
            ],
            [
                9234,
                9237
            ],
            [
                9237,
                9256
            ],
            [
                9256,
                9257
            ],
            [
                9257,
                9280
            ],
            [
                9280,
                9281
            ],
            [
                9281,
                9286
            ],
            [
                9290,
                9307
            ],
            [
                9315,
                9337
            ],
            [
                9337,
                9445
            ],
            [
                9445,
                9494
            ],
            [
                9494,
                9517
            ],
            [
                9517,
                9587
            ],
            [
                9587,
                9620
            ],
            [
                9620,
                9651
            ],
            [
                9651,
                9688
            ],
            [
                9703,
                9749
            ],
            [
                9750,
                9754
            ],
            [
                9755,
                9768
            ],
            [
                9768,
                9771
            ],
            [
                9771,
                9836
            ],
            [
                9846,
                9869
            ],
            [
                9869,
                9881
            ],
            [
                9895,
                9898
            ],
            [
                9907,
                9916
            ],
            [
                9928,
                9930
            ],
            [
                9930,
                9936
            ],
            [
                9936,
                9949
            ],
            [
                9949,
                9961
            ],
            [
                9961,
                9988
            ],
            [
                9989,
                9994
            ],
            [
                9995,
                9998
            ],
            [
                9998,
                10001
            ],
            [
                10001,
                10029
            ],
            [
                10029,
                10050
            ],
            [
                10050,
                10066
            ],
            [
                10066,
                10073
            ],
            [
                10074,
                10077
            ],
            [
                10078,
                10084
            ],
            [
                10089,
                10102
            ],
            [
                10102,
                10105
            ],
            [
                10105,
                10156
            ],
            [
                10157,
                10168
            ],
            [
                10170,
                10179
            ],
            [
                10180,
                10187
            ],
            [
                10188,
                10208
            ],
            [
                10209,
                10218
            ],
            [
                10218,
                10221
            ],
            [
                10221,
                10272
            ],
            [
                10272,
                10293
            ],
            [
                10307,
                10309
            ],
            [
                10309,
                10352
            ],
            [
                10353,
                10376
            ],
            [
                10379,
                10447
            ],
            [
                10448,
                10506
            ],
            [
                10506,
                10508
            ],
            [
                10508,
                10513
            ],
            [
                10513,
                10516
            ],
            [
                10521,
                10541
            ],
            [
                10542,
                10561
            ],
            [
                10561,
                10564
            ],
            [
                10564,
                10571
            ],
            [
                10580,
                10584
            ],
            [
                10588,
                10592
            ],
            [
                10598,
                10632
            ],
            [
                10635,
                10651
            ],
            [
                10657,
                10661
            ],
            [
                10662,
                10692
            ],
            [
                10693,
                10748
            ],
            [
                10749,
                10759
            ],
            [
                10759,
                10846
            ],
            [
                10847,
                10873
            ],
            [
                10877,
                10899
            ],
            [
                10900,
                10949
            ],
            [
                10949,
                10951
            ],
            [
                10951,
                10956
            ],
            [
                10957,
                10970
            ],
            [
                10970,
                10986
            ],
            [
                10988,
                10992
            ],
            [
                10996,
                10998
            ],
            [
                10998,
                11034
            ],
            [
                11034,
                11081
            ],
            [
                11081,
                11103
            ],
            [
                11104,
                11117
            ],
            [
                11117,
                11136
            ],
            [
                11142,
                11145
            ],
            [
                11145,
                11150
            ],
            [
                11161,
                11255
            ],
            [
                11255,
                11362
            ],
            [
                11362,
                11396
            ],
            [
                11397,
                11406
            ],
            [
                11406,
                11415
            ],
            [
                11416,
                11461
            ],
            [
                11471,
                11554
            ],
            [
                11566,
                11593
            ],
            [
                11594,
                11638
            ],
            [
                11639,
                11663
            ],
            [
                11664,
                11704
            ],
            [
                11704,
                11723
            ],
            [
                11724,
                11778
            ],
            [
                11778,
                11834
            ],
            [
                11835,
                11856
            ],
            [
                11856,
                11888
            ],
            [
                11891,
                11895
            ],
            [
                11900,
                12040
            ],
            [
                12041,
                12154
            ],
            [
                12156,
                12164
            ],
            [
                12164,
                12238
            ],
            [
                12238,
                12271
            ],
            [
                12271,
                12272
            ],
            [
                12295,
                12297
            ],
            [
                12297,
                12306
            ],
            [
                12307,
                12319
            ],
            [
                12320,
                12328
            ],
            [
                12329,
                12346
            ],
            [
                12346,
                12348
            ],
            [
                12349,
                12503
            ],
            [
                12504,
                12557
            ],
            [
                12557,
                12591
            ],
            [
                12600,
                12608
            ],
            [
                12608,
                12613
            ],
            [
                12624,
                12671
            ],
            [
                12681,
                12719
            ],
            [
                12720,
                12722
            ],
            [
                12723,
                12729
            ],
            [
                12730,
                12751
            ],
            [
                12752,
                12801
            ],
            [
                12801,
                12875
            ],
            [
                12875,
                12908
            ],
            [
                12918,
                12970
            ],
            [
                12971,
                12973
            ],
            [
                12974,
                13026
            ],
            [
                13027,
                13031
            ],
            [
                13032,
                13056
            ],
            [
                13057,
                13089
            ],
            [
                13091,
                13155
            ],
            [
                13155,
                13198
            ],
            [
                13198,
                13217
            ],
            [
                13217,
                13269
            ],
            [
                13269,
                13338
            ],
            [
                13338,
                13404
            ],
            [
                13404,
                13461
            ],
            [
                13466,
                13468
            ],
            [
                13468,
                13566
            ],
            [
                13569,
                13618
            ],
            [
                13618,
                13628
            ],
            [
                13628,
                13682
            ],
            [
                13682,
                13794
            ],
            [
                13794,
                13815
            ],
            [
                13815,
                13823
            ],
            [
                13823,
                13906
            ],
            [
                13908,
                13948
            ],
            [
                13951,
                13983
            ],
            [
                13983,
                14011
            ],
            [
                14012,
                14045
            ],
            [
                14045,
                14087
            ],
            [
                14087,
                14158
            ],
            [
                14158,
                14163
            ],
            [
                14166,
                14214
            ],
            [
                14214,
                14290
            ],
            [
                14290,
                14335
            ],
            [
                14335,
                14346
            ],
            [
                14346,
                14375
            ],
            [
                14375,
                14420
            ],
            [
                14420,
                14422
            ],
            [
                14422,
                14477
            ],
            [
                14477,
                14552
            ],
            [
                14552,
                14621
            ],
            [
                14621,
                14623
            ],
            [
                14623,
                14630
            ],
            [
                14633,
                14659
            ],
            [
                14659,
                14698
            ],
            [
                14698,
                14719
            ],
            [
                14722,
                14735
            ],
            [
                14735,
                14783
            ],
            [
                14789,
                14798
            ],
            [
                14809,
                14819
            ],
            [
                14824,
                14832
            ],
            [
                14834,
                14857
            ],
            [
                14865,
                14938
            ],
            [
                14938,
                14956
            ],
            [
                14956,
                14975
            ],
            [
                14975,
                15020
            ],
            [
                15020,
                15071
            ],
            [
                15071,
                15148
            ],
            [
                15148,
                15161
            ],
            [
                15164,
                15185
            ],
            [
                15185,
                15202
            ],
            [
                15202,
                15217
            ],
            [
                15217,
                15237
            ],
            [
                15237,
                15290
            ],
            [
                15290,
                15327
            ],
            [
                15327,
                15361
            ],
            [
                15361,
                15388
            ],
            [
                15391,
                15423
            ],
            [
                15426,
                15453
            ],
            [
                15453,
                15505
            ],
            [
                15505,
                15521
            ],
            [
                15522,
                15524
            ],
            [
                15525,
                15547
            ],
            [
                15548,
                15562
            ],
            [
                15563,
                15571
            ],
            [
                15571,
                15573
            ],
            [
                15573,
                15613
            ],
            [
                15614,
                15625
            ],
            [
                15626,
                15686
            ],
            [
                15687,
                15779
            ],
            [
                15779,
                15885
            ],
            [
                15888,
                15930
            ],
            [
                15932,
                16013
            ],
            [
                16013,
                16031
            ],
            [
                16031,
                16189
            ],
            [
                16189,
                16191
            ],
            [
                16191,
                16329
            ],
            [
                16329,
                16377
            ],
            [
                16377,
                16400
            ],
            [
                16401,
                16467
            ],
            [
                16470,
                16579
            ],
            [
                16580,
                16585
            ]
        ],
        "row_chars": [
            [
                0,
                44
            ],
            [
                44,
                148
            ],
            [
                148,
                176
            ],
            [
                176,
                205
            ],
            [
                205,
                237
            ],
            [
                237,
                314
            ],
            [
                314,
                362
            ],
            [
                362,
                596
            ],
            [
                596,
                654
            ],
            [
                654,
                654
            ],
            [
                654,
                742
            ],
            [
                742,
                790
            ],
            [
                790,
                822
            ],
            [
                822,
                887
            ],
            [
                887,
                955
            ],
            [
                955,
                995
            ],
            [
                995,
                1074
            ],
            [
                1074,
                1093
            ],
            [
                1093,
                1196
            ],
            [
                1196,
                1267
            ],
            [
                1267,
                1283
            ],
            [
                1283,
                1349
            ],
            [
                1349,
                1374
            ],
            [
                1374,
                1374
            ],
            [
                1374,
                1374
            ],
            [
                1374,
                1374
            ],
            [
                1374,
                1374
            ],
            [
                1374,
                1455
            ],
            [
                1455,
                1541
            ],
            [
                1541,
                1541
            ],
            [
                1541,
                1541
            ],
            [
                1541,
                1649
            ],
            [
                1649,
                1704
            ],
            [
                1704,
                1720
            ],
            [
                1720,
                1761
            ],
            [
                1761,
                1810
            ],
            [
                1810,
                1936
            ],
            [
                1936,
                1986
            ],
            [
                1986,
                2079
            ],
            [
                2079,
                2118
            ],
            [
                2118,
                2221
            ],
            [
                2221,
                2291
            ],
            [
                2291,
                2303
            ],
            [
                2303,
                2373
            ],
            [
                2373,
                2387
            ],
            [
                2387,
                2399
            ],
            [
                2399,
                2399
            ],
            [
                2399,
                2465
            ],
            [
                2465,
                2529
            ],
            [
                2529,
                2625
            ],
            [
                2625,
                2660
            ],
            [
                2660,
                2660
            ],
            [
                2660,
                2660
            ],
            [
                2660,
                2856
            ],
            [
                2856,
                2884
            ],
            [
                2884,
                2903
            ],
            [
                2903,
                2933
            ],
            [
                2933,
                2959
            ],
            [
                2959,
                2995
            ],
            [
                2995,
                3071
            ],
            [
                3071,
                3153
            ],
            [
                3153,
                3153
            ],
            [
                3153,
                3153
            ],
            [
                3153,
                3206
            ],
            [
                3206,
                3206
            ],
            [
                3206,
                3206
            ],
            [
                3206,
                3206
            ],
            [
                3206,
                3288
            ],
            [
                3288,
                3288
            ],
            [
                3288,
                3420
            ],
            [
                3420,
                3508
            ],
            [
                3508,
                3508
            ],
            [
                3508,
                3508
            ],
            [
                3508,
                3508
            ],
            [
                3508,
                3714
            ],
            [
                3714,
                3762
            ],
            [
                3762,
                3800
            ],
            [
                3800,
                3913
            ],
            [
                3913,
                3913
            ],
            [
                3913,
                4009
            ],
            [
                4009,
                4146
            ],
            [
                4146,
                4146
            ],
            [
                4146,
                4146
            ],
            [
                4146,
                4146
            ],
            [
                4146,
                4214
            ],
            [
                4214,
                4214
            ],
            [
                4214,
                4245
            ],
            [
                4245,
                4297
            ],
            [
                4297,
                4391
            ],
            [
                4391,
                4458
            ],
            [
                4458,
                4486
            ],
            [
                4486,
                4492
            ],
            [
                4492,
                4551
            ],
            [
                4551,
                4604
            ],
            [
                4604,
                4693
            ],
            [
                4693,
                4741
            ],
            [
                4741,
                4935
            ],
            [
                4935,
                5127
            ],
            [
                5127,
                5218
            ],
            [
                5218,
                5262
            ],
            [
                5262,
                5347
            ],
            [
                5347,
                5421
            ],
            [
                5421,
                5485
            ],
            [
                5485,
                5568
            ],
            [
                5568,
                5610
            ],
            [
                5610,
                5610
            ],
            [
                5610,
                5671
            ],
            [
                5671,
                5752
            ],
            [
                5752,
                5804
            ],
            [
                5804,
                5953
            ],
            [
                5953,
                5953
            ],
            [
                5953,
                5953
            ],
            [
                5953,
                6088
            ],
            [
                6088,
                6189
            ],
            [
                6189,
                6309
            ],
            [
                6309,
                6350
            ],
            [
                6350,
                6408
            ],
            [
                6408,
                6474
            ],
            [
                6474,
                6552
            ],
            [
                6552,
                6634
            ],
            [
                6634,
                6679
            ],
            [
                6679,
                6803
            ],
            [
                6803,
                6818
            ],
            [
                6818,
                6853
            ],
            [
                6853,
                6884
            ],
            [
                6884,
                6928
            ],
            [
                6928,
                6942
            ],
            [
                6942,
                6942
            ],
            [
                6942,
                7050
            ],
            [
                7050,
                7075
            ],
            [
                7075,
                7113
            ],
            [
                7113,
                7135
            ],
            [
                7135,
                7135
            ],
            [
                7135,
                7275
            ],
            [
                7275,
                7302
            ],
            [
                7302,
                7344
            ],
            [
                7344,
                7402
            ],
            [
                7402,
                7444
            ],
            [
                7444,
                7444
            ],
            [
                7444,
                7525
            ],
            [
                7525,
                7564
            ],
            [
                7564,
                7564
            ],
            [
                7564,
                7592
            ],
            [
                7592,
                7663
            ],
            [
                7663,
                7775
            ],
            [
                7775,
                7876
            ],
            [
                7876,
                7876
            ],
            [
                7876,
                8032
            ],
            [
                8032,
                8107
            ],
            [
                8107,
                8149
            ],
            [
                8149,
                8198
            ],
            [
                8198,
                8349
            ],
            [
                8349,
                8444
            ],
            [
                8444,
                8444
            ],
            [
                8444,
                8584
            ],
            [
                8584,
                8615
            ],
            [
                8615,
                8696
            ],
            [
                8696,
                8735
            ],
            [
                8735,
                8760
            ],
            [
                8760,
                8773
            ],
            [
                8773,
                8781
            ],
            [
                8781,
                8878
            ],
            [
                8878,
                8903
            ],
            [
                8903,
                9039
            ],
            [
                9039,
                9112
            ],
            [
                9112,
                9178
            ],
            [
                9178,
                9237
            ],
            [
                9237,
                9256
            ],
            [
                9256,
                9280
            ],
            [
                9280,
                9337
            ],
            [
                9337,
                9445
            ],
            [
                9445,
                9494
            ],
            [
                9494,
                9517
            ],
            [
                9517,
                9587
            ],
            [
                9587,
                9620
            ],
            [
                9620,
                9651
            ],
            [
                9651,
                9699
            ],
            [
                9699,
                9699
            ],
            [
                9699,
                9699
            ],
            [
                9699,
                9699
            ],
            [
                9699,
                9699
            ],
            [
                9699,
                9771
            ],
            [
                9771,
                9869
            ],
            [
                9869,
                9898
            ],
            [
                9898,
                9930
            ],
            [
                9930,
                9936
            ],
            [
                9936,
                9949
            ],
            [
                9949,
                9961
            ],
            [
                9961,
                10001
            ],
            [
                10001,
                10029
            ],
            [
                10029,
                10050
            ],
            [
                10050,
                10066
            ],
            [
                10066,
                10105
            ],
            [
                10105,
                10170
            ],
            [
                10170,
                10170
            ],
            [
                10170,
                10221
            ],
            [
                10221,
                10272
            ],
            [
                10272,
                10309
            ],
            [
                10309,
                10376
            ],
            [
                10376,
                10376
            ],
            [
                10376,
                10376
            ],
            [
                10376,
                10448
            ],
            [
                10448,
                10508
            ],
            [
                10508,
                10564
            ],
            [
                10564,
                10632
            ],
            [
                10632,
                10759
            ],
            [
                10759,
                10900
            ],
            [
                10900,
                10900
            ],
            [
                10900,
                10951
            ],
            [
                10951,
                10951
            ],
            [
                10951,
                10970
            ],
            [
                10970,
                10988
            ],
            [
                10988,
                10988
            ],
            [
                10988,
                10998
            ],
            [
                10998,
                10998
            ],
            [
                10998,
                11034
            ],
            [
                11034,
                11081
            ],
            [
                11081,
                11117
            ],
            [
                11117,
                11145
            ],
            [
                11145,
                11255
            ],
            [
                11255,
                11362
            ],
            [
                11362,
                11406
            ],
            [
                11406,
                11406
            ],
            [
                11406,
                11461
            ],
            [
                11461,
                11556
            ],
            [
                11556,
                11664
            ],
            [
                11664,
                11704
            ],
            [
                11704,
                11724
            ],
            [
                11724,
                11724
            ],
            [
                11724,
                11778
            ],
            [
                11778,
                11891
            ],
            [
                11891,
                11891
            ],
            [
                11891,
                11891
            ],
            [
                11891,
                12041
            ],
            [
                12041,
                12041
            ],
            [
                12041,
                12164
            ],
            [
                12164,
                12238
            ],
            [
                12238,
                12297
            ],
            [
                12297,
                12346
            ],
            [
                12346,
                12557
            ],
            [
                12557,
                12557
            ],
            [
                12557,
                12557
            ],
            [
                12557,
                12557
            ],
            [
                12557,
                12557
            ],
            [
                12557,
                12801
            ],
            [
                12801,
                12875
            ],
            [
                12875,
                12971
            ],
            [
                12971,
                13155
            ],
            [
                13155,
                13198
            ],
            [
                13198,
                13217
            ],
            [
                13217,
                13269
            ],
            [
                13269,
                13338
            ],
            [
                13338,
                13404
            ],
            [
                13404,
                13468
            ],
            [
                13468,
                13566
            ],
            [
                13566,
                13566
            ],
            [
                13566,
                13566
            ],
            [
                13566,
                13618
            ],
            [
                13618,
                13682
            ],
            [
                13682,
                13794
            ],
            [
                13794,
                13815
            ],
            [
                13815,
                13823
            ],
            [
                13823,
                13908
            ],
            [
                13908,
                13908
            ],
            [
                13908,
                13951
            ],
            [
                13951,
                13983
            ],
            [
                13983,
                14045
            ],
            [
                14045,
                14087
            ],
            [
                14087,
                14158
            ],
            [
                14158,
                14214
            ],
            [
                14214,
                14290
            ],
            [
                14290,
                14335
            ],
            [
                14335,
                14346
            ],
            [
                14346,
                14375
            ],
            [
                14375,
                14422
            ],
            [
                14422,
                14477
            ],
            [
                14477,
                14552
            ],
            [
                14552,
                14623
            ],
            [
                14623,
                14659
            ],
            [
                14659,
                14698
            ],
            [
                14698,
                14735
            ],
            [
                14735,
                14834
            ],
            [
                14834,
                14938
            ],
            [
                14938,
                14956
            ],
            [
                14956,
                14975
            ],
            [
                14975,
                15020
            ],
            [
                15020,
                15071
            ],
            [
                15071,
                15148
            ],
            [
                15148,
                15185
            ],
            [
                15185,
                15202
            ],
            [
                15202,
                15217
            ],
            [
                15217,
                15237
            ],
            [
                15237,
                15290
            ],
            [
                15290,
                15327
            ],
            [
                15327,
                15361
            ],
            [
                15361,
                15391
            ],
            [
                15391,
                15391
            ],
            [
                15391,
                15391
            ],
            [
                15391,
                15426
            ],
            [
                15426,
                15426
            ],
            [
                15426,
                15453
            ],
            [
                15453,
                15505
            ],
            [
                15505,
                15573
            ],
            [
                15573,
                15626
            ],
            [
                15626,
                15687
            ],
            [
                15687,
                15779
            ],
            [
                15779,
                15888
            ],
            [
                15888,
                15930
            ],
            [
                15930,
                16013
            ],
            [
                16013,
                16031
            ],
            [
                16031,
                16031
            ],
            [
                16031,
                16031
            ],
            [
                16031,
                16191
            ],
            [
                16191,
                16329
            ],
            [
                16329,
                16377
            ],
            [
                16377,
                16470
            ],
            [
                16470,
                16585
            ],
            [
                16585,
                16585
            ]
        ]
    }
}