{
    "original": {
        "text": "Parliament opened that year on the twelfth of February, and Mr. Palliser was one of the first Members of the Lower House to take his seat. It had been generally asserted through the country, during the last week, that the existing Chancellor of the Exchequer had, so to say, ceased to exist as such; that though he still existed to the outer world, drawing his salary, and doing routine work,--if a man so big can have any routine work to do,--he existed no longer in the inner world of the cabinet. He had differed, men said, with his friend and chief, the Prime Minister, as to the expediency of repealing what were left of the direct taxes of the country, and was prepared to launch himself into opposition with his small bodyguard of followers, with all his energy and with all his venom.\nThere is something very pleasant in the close, bosom friendship, and bitter, uncompromising animosity, of these human gods,--of these human beings who would be gods were they not shorn so short of their divinity in that matter of immortality. If it were so arranged that the same persons were always friends, and the same persons were always enemies, as used to be the case among the dear old heathen gods and goddesses;--if Parliament were an Olympus in which Juno and Venus never kissed, the thing would not be nearly so interesting. But in this Olympus partners are changed, the divine bosom, now rabid with hatred against some opposing deity, suddenly becomes replete with love towards its late enemy, and exciting changes occur which give to the whole thing all the keen interest of a sensational novel. No doubt this is greatly lessened for those who come too near the scene of action. Members of Parliament, and the friends of Members of Parliament, are apt to teach themselves that it means nothing; that Lord This does not hate Mr. That, or think him a traitor to his country, or wish to crucify him; and that Sir John of the Treasury is not much in earnest when he speaks of his noble friend at the \"Foreign Office\" as a god to whom no other god was ever comparable in honesty, discretion, patriotism, and genius. But the outside Briton who takes a delight in politics,--and this description should include ninety-nine educated Englishmen out of every hundred,--should not be desirous of peeping behind the scenes. No beholder at any theatre should do so. It is good to believe in these friendships and these enmities, and very pleasant to watch their changes. It is delightful when Oxford embraces Manchester, finding that it cannot live without support in that quarter; and very delightful when the uncompromising assailant of all men in power receives the legitimate reward of his energy by being taken in among the bosoms of the blessed.\nBut although the outer world was so sure that the existing Chancellor of the Exchequer had ceased to exist, when the House of Commons met that gentleman took his seat on the Treasury Bench. Mr. Palliser, who had by no means given a general support to the Ministry in the last Session, took his seat on the same side of the House indeed, but low down, and near to the cross benches. Mr. Bott sat close behind him, and men knew that Mr. Bott was a distinguished member of Mr. Palliser's party, whatever that party might be. Lord Cinquebars moved the Address, and I must confess that he did it very lamely. He was once accused by Mr. Maxwell, the brewer, of making a great noise in the hunting-field. The accusation could not be repeated as to his performance on this occasion, as no one could hear a word that he said. The Address was seconded by Mr. Loftus Fitzhoward, a nephew of the Duke of St. Bungay, who spoke as though he were resolved to trump poor Lord Cinquebars in every sentence which he pronounced,--as we so often hear the second clergyman from the Communion Table trumping his weary predecessor, who has just finished the Litany not in the clearest or most audible voice. Every word fell from Mr. Fitzhoward with the elaborate accuracy of a separate pistol-shot; and as he became pleased with himself in his progress, and warm with his work, he accented his words sharply, made rhetorical pauses, even moved his hands about in action, and quite disgusted his own party, who had been very well satisfied with Lord Cinquebars. There are many rocks which a young speaker in Parliament should avoid, but no rock which requires such careful avoiding as the rock of eloquence. Whatever may be his faults, let him at least avoid eloquence. He should not be inaccurate, which, however, is not much; he should not be long-winded, which is a good deal; he should not be ill-tempered, which is more; but none of these faults are so damnable as eloquence. All Mr. Fitzhoward's friends and all his enemies knew that he had had his chance, and that he had thrown it away.\nIn the Queen's Speech there had been some very lukewarm allusion to remission of direct taxation. This remission, which had already been carried so far, should be carried further if such further carrying were found practicable. So had said the Queen. Those words, it was known, could not have been approved of by the energetic and still existing Chancellor of the Exchequer. On this subject the mover of the Address said never a word, and the seconder only a word or two. What they had said had, of course, been laid down for them; though, unfortunately, the manner of saying could not be so easily prescribed. Then there arose a great enemy, a man fluent of diction, apparently with deep malice at his heart, though at home,--as we used to say at school,--one of the most good-natured fellows in the world; one ambitious of that godship which a seat on the other side of the House bestowed, and greedy to grasp at the chances which this disagreement in the councils of the gods might give him. He was quite content, he said, to vote for the Address, as, he believed, would be all the gentlemen on his side of the House. No one could suspect them or him of giving a factious opposition to Government. Had they not borne and forborne beyond all precedent known in that House? Then he touched lightly, and almost with grace to his opponents, on many subjects, promising support, and barely hinting that they were totally and manifestly wrong in all things. But--. Then the tone of his voice changed, and the well-known look of fury was assumed upon his countenance. Then great Jove on the other side pulled his hat over his eyes, and smiled blandly. Then members put away the papers they had been reading for a moment, and men in the gallery began to listen. But--. The long and the short of it was this; that the existing Government had come into power on the cry of a reduction of taxation, and now they were going to shirk the responsibility of their own measures. They were going to shirk the responsibility of their own election cry, although it was known that their own Chancellor of the Exchequer was prepared to carry it out to the full. He was willing to carry it out to the full were he not restrained by the timidity, falsehood, and treachery of his colleagues, of whom, of course, the most timid, the most false, and the most treacherous was--the great god Jove, who sat blandly smiling on the other side.\n[Illustration: Great Jove.]\nNo one should ever go near the House of Commons who wishes to enjoy all this. It was so manifestly evident that neither Jove nor any of his satellites cared twopence for what the irate gentleman was saying; nay, it became so evident that, in spite of his assumed fury, the gentleman was not irate. He intended to communicate his look of anger to the newspaper reports of his speech; and he knew from experience that he could succeed in that. And men walked about the House in the most telling moments,--enemies shaking hands with enemies,--in a way that showed an entire absence of all good, honest hatred among them. But the gentleman went on and finished his speech, demanding at last, in direct terms, that the Treasury Jove should state plainly to the House who was to be, and who was not to be, the bearer of the purse among the gods.\nThen Treasury Jove got up smiling, and thanked his enemy for the cordiality of his support. \"He had always,\" he said, \"done the gentleman's party justice for their clemency, and had feared no opposition from them; and he was glad to find that he was correct in his anticipations as to the course they would pursue on the present occasion.\" He went on saying a good deal about home matters, and foreign matters, proving that everything was right, just as easily as his enemy had proved that everything was wrong. On all these points he was very full, and very courteous; but when he came to the subject of taxation, he simply repeated the passage from the Queen's Speech, expressing a hope that his right honourable friend, the Chancellor of the Exchequer, would be able to satisfy the judgement of the House, and the wishes of the people. That specially personal question which had been asked he did not answer at all.\nBut the House was still all agog, as was the crowded gallery. The energetic and still existing Chancellor of the Exchequer was then present, divided only by one little thin Secretary of State from Jove himself. Would he get up and declare his purposes? He was a man who almost always did get up when an opportunity offered itself,--or when it did not. Some second little gun was fired off from the Opposition benches, and then there was a pause. Would the purse-bearer of Olympus rise upon his wings and speak his mind, or would he sit in silence upon his cloud? There was a general call for the purse-bearer, but he floated in silence, and was inexplicable. The purse-bearer was not to be bullied into any sudden reading of the riddle. Then there came on a general debate about money matters, in which the purse-bearer did say a few words, but he said nothing as to the great question at issue. At last up got Mr. Palliser, towards the close of the evening, and occupied a full hour in explaining what taxes the Government might remit with safety, and what they might not,--Mr. Bott, meanwhile, prompting him with figures from behind with an assiduity that was almost too persistent. According to Mr. Palliser, the words used in the Queen's Speech were not at all too cautious. The Members went out gradually, and the House became very thin during this oration; but the newspapers declared, next morning, that his speech had been the speech of the night, and that the perspicuity of Mr. Palliser pointed him out as the coming man.\nHe returned home to his house in Park Lane quite triumphant after his success, and found Lady Glencora, at about twelve o'clock, sitting alone. She had arrived in town on that day, having come up at her own request, instead of remaining at Matching Priory till after Easter, as he had proposed. He had wished her to stay, in order, as he had said, that there might be a home for his cousins. But she had expressed herself unwilling to remain without him, explaining that the cousins might have the home in her absence, as well as they could in her presence; and he had given way. But, in truth, she had learned to hate her cousin Iphy Palliser with a hatred that was unreasonable,--seeing that she did not also hate Alice Vavasor, who had done as much to merit her hatred as had her cousin. Lady Glencora knew by what means her absence from Monkshade had been brought about. Miss Palliser had told her all that had passed in Alice's bedroom on the last night of Alice's stay at Matching, and had, by so doing, contrived to prevent the visit. Lady Glencora understood well all that Alice had said: and yet, though she hated Miss Palliser for what had been done, she entertained no anger against Alice. Of course Alice would have prevented that visit to Monkshade if it were in her power to do so. Of course she would save her friend. It is hardly too much to say that Lady Glencora looked to Alice to save her. Nevertheless she hated Iphy Palliser for engaging herself in the same business. Lady Glencora looked to Alice to save her, and yet it may be doubted whether she did, in truth, wish to be saved.\nWhile she was at Matching, and before Mr. Palliser had returned from Monkshade, a letter reached her, by what means she had never learned. \"A letter has been placed within my writing-case,\" she said to her maid, quite openly. \"Who put it there?\" The maid had declared her ignorance in a manner that had satisfied Lady Glencora of her truth. \"If such a thing happens again,\" said Lady Glencora, \"I shall be obliged to have the matter investigated. I cannot allow that anything should be put into my room surreptitiously.\" There, then, had been an end of that, as regarded any steps taken by Lady Glencora. The letter had been from Burgo Fitzgerald, and had contained a direct proposal that she should go off with him. \"I am at Matching,\" the letter said, \"at the Inn; but I do not dare to show myself, lest I should do you an injury. I walked round the house yesterday, at night, and I know that I saw your room. If I am wrong in thinking that you love me, I would not for worlds insult you by my presence; but if you love me still, I ask you to throw aside from you that fictitious marriage, and give yourself to the man whom, if you love him, you should regard as your husband.\" There had been more of it, but it had been to the same effect. To Lady Glencora it had seemed to convey an assurance of devoted love,--of that love which, in former days, her friends had told her was not within the compass of Burgo's nature. He had not asked her to meet him then, but saying that he would return to Matching after Parliament was met, begged her to let him have some means of knowing whether her heart was true to him.\nShe told no one of the letter, but she kept it, and read it over and over again in the silence and solitude of her room. She felt that she was guilty in thus reading it,--even in keeping it from her husband's knowledge; but though conscious of this guilt, though resolute almost in its commission, still she determined not to remain at Matching after her husband's departure,--not to undergo the danger of remaining there while Burgo Fitzgerald should be in the vicinity. She could not analyse her own wishes. She often told herself, as she had told Alice, that it would be better for them all that she should go away; that in throwing herself even to the dogs, if such must be the result, she would do more of good than of harm. She declared to herself, in the most passionate words she could use, that she loved this man with all her heart. She protested that the fault would not be hers, but theirs, who had forced her to marry the man she did not love. She assured herself that her husband had no affection for her, and that their marriage was in every respect prejudicial to him. She recurred over and over again, in her thoughts, to her own childlessness, and to his extreme desire for an heir. \"Though I do sacrifice myself,\" she would say, \"I shall do more of good than harm, and I cannot be more wretched than I am now.\" But yet she fled to London because she feared to leave herself at Matching when Burgo Fitzgerald should be there. She sent no answer to his letter. She made no preparation for going with him. She longed to see Alice, to whom alone, since her marriage, had she ever spoken of her love, and intended to tell her the whole tale of that letter. She was as one who, in madness, was resolute to throw herself from a precipice, but to whom some remnant of sanity remained which forced her to seek those who would save her from herself.\nMr. Palliser had not seen her since her arrival in London, and, of course, he took her by the hand and kissed her. But it was the embrace of a brother rather than of a lover or a husband. Lady Glencora, with her full woman's nature, understood this thoroughly, and appreciated by instinct the true bearing of every touch from his hand. \"I hope you are well?\" she said.\n\"Oh, yes; quite well. And you? A little fatigued with your journey, I suppose?\"\n\"No; not much.\"\n\"Well, we have had a debate on the Address. Don't you want to know how it has gone?\"\n\"If it has concerned you particularly, I do, of course.\"\n\"Concerned me! It has concerned me certainly.\"\n\"They haven't appointed you yet; have they?\"\n\"No; they don't appoint people during debates, in the House of Commons. But I fear I shall never make you a politician.\"\n\"I'm almost afraid you never will. But I'm not the less anxious for your success, since you wish it yourself. I don't understand why you should work so very hard; but, as you like it, I'm as anxious as anybody can be that you should triumph.\"\n\"Yes; I do like it,\" he said. \"A man must like something, and I don't know what there is to like better. Some people can eat and drink all day; and some people can care about a horse. I can do neither.\"\nAnd there were others, Lady Glencora thought, who could love to lie in the sun, and could look up into the eyes of women, and seek their happiness there. She was sure, at any rate, that she knew one such. But she said nothing of this.\n\"I spoke for a moment to Lord Brock,\" said Mr. Palliser. Lord Brock was the name by which the present Jove of the Treasury was known among men.\n\"And what did Lord Brock say?\"\n\"He didn't say much, but he was very cordial.\"\n\"But I thought, Plantagenet, that he could appoint you if he pleased? Doesn't he do it all?\"\n\"Well, in one sense, he does. But I don't suppose I shall ever make you understand.\" He endeavoured, however, to do so on the present occasion, and gave her a somewhat longer lecture on the working of the British Constitution, and the manner in which British politics evolved themselves, than would have been expected from most young husbands to their young wives under similar circumstances. Lady Glencora yawned, and strove lustily, but ineffectually, to hide her yawn in her handkerchief.\n\"But I see you don't care a bit about it,\" said he, peevishly.\n\"Don't be angry, Plantagenet. Indeed I do care about it, but I am so ignorant that I can't understand it all at once. I am rather tired, and I think I'll go to bed now. Shall you be late?\"\n\"No, not very; that is, I shall be rather late. I've a lot of letters I want to write to-night, as I must be at work all to-morrow. By-the-by, Mr. Bott is coming to dine here. There will be no one else.\" The next day was a Wednesday, and the House would not sit in the evening.\n\"Mr. Bott!\" said Lady Glencora, showing by her voice that she anticipated no pleasure from that gentleman's company.\n\"Yes, Mr. Bott. Have you any objection?\"\n\"Oh, no. Would you like to dine alone with him?\"\n\"Why should I dine alone with him? Why shouldn't you eat your dinner with us? I hope you are not going to become fastidious, and to turn up your nose at people. Mrs. Marsham is in town, and I dare say she'll come to you if you ask her.\"\nBut this was too much for Lady Glencora. She was disposed to be mild, but she could not endure to have her two duennas thus brought upon her together on the first day of her arrival in London. And Mrs. Marsham would be worse than Mr. Bott. Mr. Bott would be engaged with Mr. Palliser during the greater part of the evening. \"I thought,\" said she, \"of asking my cousin, Alice Vavasor, to spend the evening with me.\"\n\"Miss Vavasor!\" said the husband. \"I must say that I thought Miss Vavasor--\" He was going to make some allusion to that unfortunate hour spent among the ruins, but he stopped himself.\n\"I hope you have nothing to say against my cousin?\" said his wife. \"She is my only near relative that I really care for;--the only woman, I mean.\"\n\"No; I don't mean to say anything against her. She's very well as a young lady, I dare say. I would sooner that you would ask Mrs. Marsham to-morrow.\"\nLady Glencora was standing, waiting to go away to her own room, but it was absolutely necessary that this matter should be decided before she went. She felt that he was hard to her, and unreasonable, and that he was treating her like a child who should not be allowed her own way in anything. She had endeavoured to please him, and, having failed, was not now disposed to give way.\n\"As there will be no other ladies here to-morrow evening, Plantagenet, and as I have not yet seen Alice since I have been in town, I wish you would let me have my way in this. Of course I cannot have very much to say to Mrs. Marsham, who is an old woman.\"\n\"I especially want Mrs. Marsham to be your friend,\" said he.\n\"Friendships will not come by ordering, Plantagenet,\" said she.\n[Illustration: \"Friendships will not come by ordering,\" said Lady Glencora.]\n\"Very well,\" said he. \"Of course, you will do as you please. I am sorry that you have refused the first favour I have asked you this year.\" Then he left the room, and she went away to bed.",
        "paragraph_chars": [
            [
                0,
                793
            ],
            [
                793,
                2745
            ],
            [
                2745,
                4816
            ],
            [
                4816,
                7232
            ],
            [
                7232,
                7260
            ],
            [
                7260,
                8100
            ],
            [
                8100,
                9019
            ],
            [
                9019,
                10551
            ],
            [
                10551,
                12155
            ],
            [
                12155,
                13770
            ],
            [
                13770,
                15629
            ],
            [
                15629,
                15998
            ],
            [
                15998,
                16078
            ],
            [
                16078,
                16094
            ],
            [
                16094,
                16179
            ],
            [
                16179,
                16236
            ],
            [
                16236,
                16283
            ],
            [
                16283,
                16328
            ],
            [
                16328,
                16449
            ],
            [
                16449,
                16692
            ],
            [
                16692,
                16895
            ],
            [
                16895,
                17130
            ],
            [
                17130,
                17274
            ],
            [
                17274,
                17305
            ],
            [
                17305,
                17352
            ],
            [
                17352,
                17445
            ],
            [
                17445,
                17937
            ],
            [
                17937,
                18000
            ],
            [
                18000,
                18189
            ],
            [
                18189,
                18467
            ],
            [
                18467,
                18584
            ],
            [
                18584,
                18625
            ],
            [
                18625,
                18674
            ],
            [
                18674,
                18911
            ],
            [
                18911,
                19326
            ],
            [
                19326,
                19510
            ],
            [
                19510,
                19657
            ],
            [
                19657,
                19808
            ],
            [
                19808,
                20190
            ],
            [
                20190,
                20446
            ],
            [
                20446,
                20507
            ],
            [
                20507,
                20571
            ],
            [
                20571,
                20648
            ],
            [
                20648,
                20836
            ]
        ],
        "segment_chars": [
            [
                0,
                139
            ],
            [
                139,
                500
            ],
            [
                500,
                793
            ],
            [
                793,
                1036
            ],
            [
                1036,
                1329
            ],
            [
                1329,
                1602
            ],
            [
                1602,
                1685
            ],
            [
                1685,
                2117
            ],
            [
                2117,
                2318
            ],
            [
                2318,
                2359
            ],
            [
                2359,
                2464
            ],
            [
                2464,
                2745
            ],
            [
                2745,
                2935
            ],
            [
                2935,
                3127
            ],
            [
                3127,
                3267
            ],
            [
                3267,
                3349
            ],
            [
                3349,
                3443
            ],
            [
                3443,
                3562
            ],
            [
                3562,
                3930
            ],
            [
                3930,
                4283
            ],
            [
                4283,
                4429
            ],
            [
                4429,
                4491
            ],
            [
                4491,
                4702
            ],
            [
                4702,
                4816
            ],
            [
                4816,
                4914
            ],
            [
                4914,
                5044
            ],
            [
                5044,
                5067
            ],
            [
                5067,
                5191
            ],
            [
                5191,
                5288
            ],
            [
                5288,
                5427
            ],
            [
                5427,
                5811
            ],
            [
                5811,
                5937
            ],
            [
                5937,
                6017
            ],
            [
                6017,
                6091
            ],
            [
                6091,
                6271
            ],
            [
                6271,
                6278
            ],
            [
                6278,
                6380
            ],
            [
                6380,
                6464
            ],
            [
                6464,
                6573
            ],
            [
                6573,
                6580
            ],
            [
                6580,
                6782
            ],
            [
                6782,
                6960
            ],
            [
                6960,
                7232
            ],
            [
                7232,
                7260
            ],
            [
                7260,
                7338
            ],
            [
                7338,
                7558
            ],
            [
                7558,
                7702
            ],
            [
                7702,
                7878
            ],
            [
                7878,
                8100
            ],
            [
                8100,
                8192
            ],
            [
                8192,
                8440
            ],
            [
                8440,
                8612
            ],
            [
                8612,
                8939
            ],
            [
                8939,
                9019
            ],
            [
                9019,
                9081
            ],
            [
                9081,
                9230
            ],
            [
                9230,
                9272
            ],
            [
                9272,
                9371
            ],
            [
                9371,
                9465
            ],
            [
                9465,
                9582
            ],
            [
                9582,
                9678
            ],
            [
                9678,
                9756
            ],
            [
                9756,
                9915
            ],
            [
                9915,
                10204
            ],
            [
                10204,
                10298
            ],
            [
                10298,
                10551
            ],
            [
                10551,
                10695
            ],
            [
                10695,
                10846
            ],
            [
                10846,
                10943
            ],
            [
                10943,
                11131
            ],
            [
                11131,
                11342
            ],
            [
                11342,
                11426
            ],
            [
                11426,
                11593
            ],
            [
                11593,
                11752
            ],
            [
                11752,
                11847
            ],
            [
                11847,
                11884
            ],
            [
                11884,
                11961
            ],
            [
                11961,
                12041
            ],
            [
                12041,
                12155
            ],
            [
                12155,
                12294
            ],
            [
                12294,
                12381
            ],
            [
                12381,
                12401
            ],
            [
                12401,
                12496
            ],
            [
                12496,
                12602
            ],
            [
                12602,
                12676
            ],
            [
                12676,
                12760
            ],
            [
                12760,
                12872
            ],
            [
                12872,
                12988
            ],
            [
                12988,
                13067
            ],
            [
                13067,
                13335
            ],
            [
                13335,
                13398
            ],
            [
                13398,
                13577
            ],
            [
                13577,
                13770
            ],
            [
                13770,
                13891
            ],
            [
                13891,
                14242
            ],
            [
                14242,
                14280
            ],
            [
                14280,
                14500
            ],
            [
                14500,
                14613
            ],
            [
                14613,
                14727
            ],
            [
                14727,
                14855
            ],
            [
                14855,
                14971
            ],
            [
                14971,
                15100
            ],
            [
                15100,
                15214
            ],
            [
                15214,
                15248
            ],
            [
                15248,
                15292
            ],
            [
                15292,
                15441
            ],
            [
                15441,
                15629
            ],
            [
                15629,
                15744
            ],
            [
                15744,
                15817
            ],
            [
                15817,
                15965
            ],
            [
                15965,
                15988
            ],
            [
                15988,
                15998
            ],
            [
                15998,
                16020
            ],
            [
                16020,
                16029
            ],
            [
                16029,
                16078
            ],
            [
                16078,
                16094
            ],
            [
                16094,
                16138
            ],
            [
                16138,
                16179
            ],
            [
                16179,
                16236
            ],
            [
                16236,
                16251
            ],
            [
                16251,
                16283
            ],
            [
                16283,
                16328
            ],
            [
                16328,
                16400
            ],
            [
                16400,
                16449
            ],
            [
                16449,
                16484
            ],
            [
                16484,
                16559
            ],
            [
                16559,
                16692
            ],
            [
                16692,
                16722
            ],
            [
                16722,
                16797
            ],
            [
                16797,
                16876
            ],
            [
                16876,
                16895
            ],
            [
                16895,
                17049
            ],
            [
                17049,
                17100
            ],
            [
                17100,
                17130
            ],
            [
                17130,
                17187
            ],
            [
                17187,
                17274
            ],
            [
                17274,
                17305
            ],
            [
                17305,
                17352
            ],
            [
                17352,
                17422
            ],
            [
                17422,
                17445
            ],
            [
                17445,
                17475
            ],
            [
                17475,
                17530
            ],
            [
                17530,
                17838
            ],
            [
                17838,
                17937
            ],
            [
                17937,
                18000
            ],
            [
                18000,
                18030
            ],
            [
                18030,
                18118
            ],
            [
                18118,
                18169
            ],
            [
                18169,
                18189
            ],
            [
                18189,
                18237
            ],
            [
                18237,
                18321
            ],
            [
                18321,
                18365
            ],
            [
                18365,
                18393
            ],
            [
                18393,
                18467
            ],
            [
                18467,
                18472
            ],
            [
                18472,
                18479
            ],
            [
                18479,
                18584
            ],
            [
                18584,
                18600
            ],
            [
                18600,
                18625
            ],
            [
                18625,
                18634
            ],
            [
                18634,
                18674
            ],
            [
                18674,
                18709
            ],
            [
                18709,
                18752
            ],
            [
                18752,
                18835
            ],
            [
                18835,
                18911
            ],
            [
                18911,
                18952
            ],
            [
                18952,
                19104
            ],
            [
                19104,
                19151
            ],
            [
                19151,
                19235
            ],
            [
                19235,
                19326
            ],
            [
                19326,
                19342
            ],
            [
                19342,
                19360
            ],
            [
                19360,
                19510
            ],
            [
                19510,
                19562
            ],
            [
                19562,
                19577
            ],
            [
                19577,
                19657
            ],
            [
                19657,
                19704
            ],
            [
                19704,
                19749
            ],
            [
                19749,
                19808
            ],
            [
                19808,
                19956
            ],
            [
                19956,
                20101
            ],
            [
                20101,
                20190
            ],
            [
                20190,
                20366
            ],
            [
                20366,
                20446
            ],
            [
                20446,
                20507
            ],
            [
                20507,
                20571
            ],
            [
                20571,
                20648
            ],
            [
                20648,
                20670
            ],
            [
                20670,
                20709
            ],
            [
                20709,
                20788
            ],
            [
                20788,
                20836
            ]
        ],
        "overlap_chars": [
            [
                0,
                108
            ],
            [
                115,
                120
            ],
            [
                121,
                139
            ],
            [
                191,
                212
            ],
            [
                142,
                145
            ],
            [
                170,
                189
            ],
            [
                213,
                221
            ],
            [
                231,
                262
            ],
            [
                507,
                515
            ],
            [
                527,
                531
            ],
            [
                554,
                572
            ],
            [
                598,
                607
            ],
            [
                630,
                642
            ],
            [
                367,
                372
            ],
            [
                300,
                304
            ],
            [
                312,
                314
            ],
            [
                663,
                678
            ],
            [
                487,
                498
            ],
            [
                543,
                546
            ],
            [
                679,
                772
            ],
            [
                786,
                793
            ],
            [
                793,
                838
            ],
            [
                846,
                856
            ],
            [
                858,
                868
            ],
            [
                885,
                894
            ],
            [
                896,
                915
            ],
            [
                1034,
                1036
            ],
            [
                1036,
                1038
            ],
            [
                1102,
                1105
            ],
            [
                1269,
                1274
            ],
            [
                1281,
                1329
            ],
            [
                1329,
                1332
            ],
            [
                1393,
                1398
            ],
            [
                1404,
                1410
            ],
            [
                1532,
                1601
            ],
            [
                1602,
                1645
            ],
            [
                1655,
                1685
            ],
            [
                2121,
                2171
            ],
            [
                2174,
                2182
            ],
            [
                2195,
                2262
            ],
            [
                2265,
                2275
            ],
            [
                2291,
                2293
            ],
            [
                2299,
                2318
            ],
            [
                2318,
                2359
            ],
            [
                2359,
                2463
            ],
            [
                2745,
                2935
            ],
            [
                2935,
                2947
            ],
            [
                3030,
                3073
            ],
            [
                3080,
                3095
            ],
            [
                3100,
                3125
            ],
            [
                2947,
                2948
            ],
            [
                3127,
                3135
            ],
            [
                3140,
                3152
            ],
            [
                3125,
                3126
            ],
            [
                3267,
                3349
            ],
            [
                3523,
                3562
            ],
            [
                3562,
                3688
            ],
            [
                3695,
                3715
            ],
            [
                3753,
                3754
            ],
            [
                3762,
                3764
            ],
            [
                3719,
                3724
            ],
            [
                3797,
                3801
            ],
            [
                3776,
                3779
            ],
            [
                3928,
                3930
            ],
            [
                4028,
                4030
            ],
            [
                4131,
                4154
            ],
            [
                4021,
                4024
            ],
            [
                4155,
                4159
            ],
            [
                4059,
                4061
            ],
            [
                3997,
                3998
            ],
            [
                4197,
                4226
            ],
            [
                4281,
                4283
            ],
            [
                4310,
                4346
            ],
            [
                4386,
                4393
            ],
            [
                4347,
                4352
            ],
            [
                4418,
                4429
            ],
            [
                4702,
                4734
            ],
            [
                4743,
                4816
            ],
            [
                4816,
                4914
            ],
            [
                5067,
                5078
            ],
            [
                5094,
                5132
            ],
            [
                5153,
                5191
            ],
            [
                5432,
                5458
            ],
            [
                5628,
                5637
            ],
            [
                5540,
                5541
            ],
            [
                5465,
                5471
            ],
            [
                5461,
                5464
            ],
            [
                5482,
                5532
            ],
            [
                5573,
                5622
            ],
            [
                5809,
                5811
            ],
            [
                5811,
                5937
            ],
            [
                6091,
                6114
            ],
            [
                6116,
                6119
            ],
            [
                6132,
                6137
            ],
            [
                6156,
                6172
            ],
            [
                6172,
                6196
            ],
            [
                6204,
                6270
            ],
            [
                6271,
                6274
            ],
            [
                6283,
                6317
            ],
            [
                6350,
                6357
            ],
            [
                6322,
                6345
            ],
            [
                6378,
                6380
            ],
            [
                6469,
                6518
            ],
            [
                6531,
                6536
            ],
            [
                6556,
                6573
            ],
            [
                6573,
                6576
            ],
            [
                6624,
                6674
            ],
            [
                6679,
                6771
            ],
            [
                6780,
                6782
            ],
            [
                6807,
                6810
            ],
            [
                6890,
                6946
            ],
            [
                6865,
                6868
            ],
            [
                7015,
                7041
            ],
            [
                7054,
                7121
            ],
            [
                7139,
                7142
            ],
            [
                7152,
                7167
            ],
            [
                7169,
                7219
            ],
            [
                7226,
                7232
            ],
            [
                7338,
                7344
            ],
            [
                7380,
                7384
            ],
            [
                7417,
                7466
            ],
            [
                7499,
                7501
            ],
            [
                7529,
                7558
            ],
            [
                7585,
                7602
            ],
            [
                7606,
                7627
            ],
            [
                7700,
                7702
            ],
            [
                7878,
                7881
            ],
            [
                7908,
                7927
            ],
            [
                7929,
                7938
            ],
            [
                7965,
                7969
            ],
            [
                7983,
                8035
            ],
            [
                8060,
                8100
            ],
            [
                8100,
                8104
            ],
            [
                8119,
                8156
            ],
            [
                8190,
                8192
            ],
            [
                8440,
                8442
            ],
            [
                8458,
                8544
            ],
            [
                8546,
                8612
            ],
            [
                8674,
                8938
            ],
            [
                9019,
                9036
            ],
            [
                9043,
                9081
            ],
            [
                9081,
                9145
            ],
            [
                9160,
                9230
            ],
            [
                9230,
                9272
            ],
            [
                9633,
                9678
            ],
            [
                9756,
                9766
            ],
            [
                9775,
                9863
            ],
            [
                9872,
                9879
            ],
            [
                9886,
                9904
            ],
            [
                9913,
                9914
            ],
            [
                9915,
                10092
            ],
            [
                10096,
                10102
            ],
            [
                10115,
                10153
            ],
            [
                10181,
                10191
            ],
            [
                10162,
                10167
            ],
            [
                10202,
                10204
            ],
            [
                10298,
                10328
            ],
            [
                10361,
                10483
            ],
            [
                10503,
                10515
            ],
            [
                10535,
                10551
            ],
            [
                10551,
                10610
            ],
            [
                10628,
                10695
            ],
            [
                10695,
                10731
            ],
            [
                10846,
                10871
            ],
            [
                10788,
                10825
            ],
            [
                10930,
                10943
            ],
            [
                10943,
                10954
            ],
            [
                10973,
                11068
            ],
            [
                11107,
                11130
            ],
            [
                11136,
                11199
            ],
            [
                11218,
                11230
            ],
            [
                11202,
                11208
            ],
            [
                11340,
                11342
            ],
            [
                11342,
                11360
            ],
            [
                11375,
                11426
            ],
            [
                11426,
                11512
            ],
            [
                11521,
                11525
            ],
            [
                11591,
                11593
            ],
            [
                11652,
                11655
            ],
            [
                11598,
                11606
            ],
            [
                11638,
                11641
            ],
            [
                11728,
                11752
            ],
            [
                11884,
                11961
            ],
            [
                11961,
                12041
            ],
            [
                12084,
                12087
            ],
            [
                12092,
                12117
            ],
            [
                12046,
                12054
            ],
            [
                12122,
                12155
            ],
            [
                12155,
                12180
            ],
            [
                12233,
                12274
            ],
            [
                12279,
                12292
            ],
            [
                12180,
                12181
            ],
            [
                12345,
                12348
            ],
            [
                12357,
                12365
            ],
            [
                12390,
                12392
            ],
            [
                12330,
                12342
            ],
            [
                12195,
                12196
            ],
            [
                12760,
                12871
            ],
            [
                12872,
                12954
            ],
            [
                12986,
                12988
            ],
            [
                12988,
                13067
            ],
            [
                13165,
                13211
            ],
            [
                13221,
                13334
            ],
            [
                13398,
                13414
            ],
            [
                13546,
                13549
            ],
            [
                13418,
                13431
            ],
            [
                13455,
                13467
            ],
            [
                13473,
                13489
            ],
            [
                13504,
                13530
            ],
            [
                13561,
                13566
            ],
            [
                13531,
                13538
            ],
            [
                13452,
                13454
            ],
            [
                13575,
                13577
            ],
            [
                13627,
                13685
            ],
            [
                13577,
                13579
            ],
            [
                13686,
                13707
            ],
            [
                13735,
                13770
            ],
            [
                13770,
                13864
            ],
            [
                13878,
                13891
            ],
            [
                13891,
                13938
            ],
            [
                13988,
                13993
            ],
            [
                14074,
                14088
            ],
            [
                14147,
                14185
            ],
            [
                14103,
                14114
            ],
            [
                14192,
                14214
            ],
            [
                14240,
                14241
            ],
            [
                14242,
                14280
            ],
            [
                14280,
                14387
            ],
            [
                14498,
                14500
            ],
            [
                14500,
                14523
            ],
            [
                14569,
                14583
            ],
            [
                14593,
                14613
            ],
            [
                14613,
                14727
            ],
            [
                14727,
                14817
            ],
            [
                14847,
                14855
            ],
            [
                14855,
                14970
            ],
            [
                14971,
                14972
            ],
            [
                14979,
                15034
            ],
            [
                15038,
                15099
            ],
            [
                15104,
                15126
            ],
            [
                15180,
                15196
            ],
            [
                15212,
                15214
            ],
            [
                15214,
                15248
            ],
            [
                15248,
                15292
            ],
            [
                15292,
                15315
            ],
            [
                15385,
                15388
            ],
            [
                15398,
                15409
            ],
            [
                15428,
                15441
            ],
            [
                15441,
                15448
            ],
            [
                15452,
                15476
            ],
            [
                15486,
                15629
            ],
            [
                15629,
                15691
            ],
            [
                15693,
                15744
            ],
            [
                15744,
                15791
            ],
            [
                15795,
                15817
            ],
            [
                15817,
                15830
            ],
            [
                15862,
                15888
            ],
            [
                15963,
                15964
            ],
            [
                15965,
                15988
            ],
            [
                15988,
                15998
            ],
            [
                15998,
                16020
            ],
            [
                16020,
                16029
            ],
            [
                16029,
                16078
            ],
            [
                16078,
                16094
            ],
            [
                16094,
                16138
            ],
            [
                16138,
                16179
            ],
            [
                16179,
                16236
            ],
            [
                16251,
                16283
            ],
            [
                16283,
                16314
            ],
            [
                16316,
                16328
            ],
            [
                16328,
                16373
            ],
            [
                16375,
                16400
            ],
            [
                16400,
                16449
            ],
            [
                16449,
                16453
            ],
            [
                16461,
                16484
            ],
            [
                16484,
                16559
            ],
            [
                16559,
                16692
            ],
            [
                16692,
                16722
            ],
            [
                16722,
                16797
            ],
            [
                17131,
                17165
            ],
            [
                17198,
                17210
            ],
            [
                17237,
                17239
            ],
            [
                17220,
                17236
            ],
            [
                17272,
                17274
            ],
            [
                17274,
                17305
            ],
            [
                17305,
                17352
            ],
            [
                17352,
                17422
            ],
            [
                17422,
                17432
            ],
            [
                17436,
                17445
            ],
            [
                17445,
                17475
            ],
            [
                17475,
                17530
            ],
            [
                17530,
                17532
            ],
            [
                17544,
                17563
            ],
            [
                17587,
                17670
            ],
            [
                17733,
                17808
            ],
            [
                17836,
                17838
            ],
            [
                17838,
                17863
            ],
            [
                17899,
                17937
            ],
            [
                17937,
                18000
            ],
            [
                18000,
                18030
            ],
            [
                18030,
                18118
            ],
            [
                18118,
                18169
            ],
            [
                18169,
                18189
            ],
            [
                18189,
                18237
            ],
            [
                18237,
                18274
            ],
            [
                18283,
                18284
            ],
            [
                18321,
                18358
            ],
            [
                18467,
                18472
            ],
            [
                18472,
                18479
            ],
            [
                18479,
                18497
            ],
            [
                18582,
                18584
            ],
            [
                18600,
                18625
            ],
            [
                18625,
                18634
            ],
            [
                18634,
                18674
            ],
            [
                18674,
                18709
            ],
            [
                18709,
                18752
            ],
            [
                18752,
                18835
            ],
            [
                18835,
                18886
            ],
            [
                18894,
                18911
            ],
            [
                18911,
                18952
            ],
            [
                18985,
                19029
            ],
            [
                19052,
                19104
            ],
            [
                19104,
                19149
            ],
            [
                19160,
                19168
            ],
            [
                19182,
                19194
            ],
            [
                19219,
                19234
            ],
            [
                19235,
                19326
            ],
            [
                19326,
                19342
            ],
            [
                19342,
                19360
            ],
            [
                19360,
                19399
            ],
            [
                19403,
                19418
            ],
            [
                19429,
                19432
            ],
            [
                19438,
                19510
            ],
            [
                19510,
                19562
            ],
            [
                19562,
                19576
            ],
            [
                19657,
                19704
            ],
            [
                19749,
                19756
            ],
            [
                19764,
                19795
            ],
            [
                19805,
                19808
            ],
            [
                19960,
                19981
            ],
            [
                19985,
                20101
            ],
            [
                20101,
                20108
            ],
            [
                20121,
                20190
            ],
            [
                20190,
                20228
            ],
            [
                20239,
                20366
            ],
            [
                20376,
                20446
            ],
            [
                20446,
                20507
            ],
            [
                20507,
                20571
            ],
            [
                20648,
                20670
            ],
            [
                20670,
                20709
            ],
            [
                20709,
                20787
            ],
            [
                20788,
                20836
            ]
        ],
        "row_chars": [
            [
                0,
                139
            ],
            [
                139,
                793
            ],
            [
                793,
                1036
            ],
            [
                1036,
                1329
            ],
            [
                1329,
                1602
            ],
            [
                1602,
                1685
            ],
            [
                1685,
                2117
            ],
            [
                2117,
                2318
            ],
            [
                2318,
                2359
            ],
            [
                2359,
                2464
            ],
            [
                2464,
                2745
            ],
            [
                2745,
                2935
            ],
            [
                2935,
                3267
            ],
            [
                3267,
                3349
            ],
            [
                3349,
                3443
            ],
            [
                3443,
                3562
            ],
            [
                3562,
                3930
            ],
            [
                3930,
                4283
            ],
            [
                4283,
                4429
            ],
            [
                4429,
                4491
            ],
            [
                4491,
                4702
            ],
            [
                4702,
                4816
            ],
            [
                4816,
                4914
            ],
            [
                4914,
                5044
            ],
            [
                5044,
                5067
            ],
            [
                5067,
                5191
            ],
            [
                5191,
                5288
            ],
            [
                5288,
                5427
            ],
            [
                5427,
                5811
            ],
            [
                5811,
                5937
            ],
            [
                5937,
                6017
            ],
            [
                6017,
                6091
            ],
            [
                6091,
                6271
            ],
            [
                6271,
                6380
            ],
            [
                6380,
                6464
            ],
            [
                6464,
                6573
            ],
            [
                6573,
                6782
            ],
            [
                6782,
                7232
            ],
            [
                7232,
                7260
            ],
            [
                7260,
                7338
            ],
            [
                7338,
                7558
            ],
            [
                7558,
                7702
            ],
            [
                7702,
                7878
            ],
            [
                7878,
                8100
            ],
            [
                8100,
                8192
            ],
            [
                8192,
                8440
            ],
            [
                8440,
                8612
            ],
            [
                8612,
                8939
            ],
            [
                8939,
                9019
            ],
            [
                9019,
                9081
            ],
            [
                9081,
                9230
            ],
            [
                9230,
                9272
            ],
            [
                9272,
                9371
            ],
            [
                9371,
                9465
            ],
            [
                9465,
                9582
            ],
            [
                9582,
                9678
            ],
            [
                9678,
                9756
            ],
            [
                9756,
                9915
            ],
            [
                9915,
                10204
            ],
            [
                10204,
                10298
            ],
            [
                10298,
                10551
            ],
            [
                10551,
                10695
            ],
            [
                10695,
                10943
            ],
            [
                10943,
                11131
            ],
            [
                11131,
                11342
            ],
            [
                11342,
                11426
            ],
            [
                11426,
                11593
            ],
            [
                11593,
                11752
            ],
            [
                11752,
                11847
            ],
            [
                11847,
                11884
            ],
            [
                11884,
                11961
            ],
            [
                11961,
                12041
            ],
            [
                12041,
                12155
            ],
            [
                12155,
                12401
            ],
            [
                12401,
                12496
            ],
            [
                12496,
                12602
            ],
            [
                12602,
                12676
            ],
            [
                12676,
                12760
            ],
            [
                12760,
                12872
            ],
            [
                12872,
                12988
            ],
            [
                12988,
                13067
            ],
            [
                13067,
                13335
            ],
            [
                13335,
                13398
            ],
            [
                13398,
                13577
            ],
            [
                13577,
                13770
            ],
            [
                13770,
                13891
            ],
            [
                13891,
                14242
            ],
            [
                14242,
                14280
            ],
            [
                14280,
                14500
            ],
            [
                14500,
                14613
            ],
            [
                14613,
                14727
            ],
            [
                14727,
                14855
            ],
            [
                14855,
                14971
            ],
            [
                14971,
                15100
            ],
            [
                15100,
                15214
            ],
            [
                15214,
                15248
            ],
            [
                15248,
                15292
            ],
            [
                15292,
                15441
            ],
            [
                15441,
                15629
            ],
            [
                15629,
                15744
            ],
            [
                15744,
                15817
            ],
            [
                15817,
                15965
            ],
            [
                15965,
                15988
            ],
            [
                15988,
                15998
            ],
            [
                15998,
                16020
            ],
            [
                16020,
                16029
            ],
            [
                16029,
                16078
            ],
            [
                16078,
                16094
            ],
            [
                16094,
                16138
            ],
            [
                16138,
                16179
            ],
            [
                16179,
                16236
            ],
            [
                16236,
                16251
            ],
            [
                16251,
                16283
            ],
            [
                16283,
                16328
            ],
            [
                16328,
                16400
            ],
            [
                16400,
                16449
            ],
            [
                16449,
                16484
            ],
            [
                16484,
                16559
            ],
            [
                16559,
                16692
            ],
            [
                16692,
                16722
            ],
            [
                16722,
                16797
            ],
            [
                16797,
                16876
            ],
            [
                16876,
                16895
            ],
            [
                16895,
                17049
            ],
            [
                17049,
                17100
            ],
            [
                17100,
                17130
            ],
            [
                17130,
                17187
            ],
            [
                17187,
                17274
            ],
            [
                17274,
                17305
            ],
            [
                17305,
                17352
            ],
            [
                17352,
                17422
            ],
            [
                17422,
                17445
            ],
            [
                17445,
                17475
            ],
            [
                17475,
                17530
            ],
            [
                17530,
                17838
            ],
            [
                17838,
                17937
            ],
            [
                17937,
                18000
            ],
            [
                18000,
                18030
            ],
            [
                18030,
                18118
            ],
            [
                18118,
                18169
            ],
            [
                18169,
                18189
            ],
            [
                18189,
                18237
            ],
            [
                18237,
                18365
            ],
            [
                18365,
                18393
            ],
            [
                18393,
                18467
            ],
            [
                18467,
                18472
            ],
            [
                18472,
                18479
            ],
            [
                18479,
                18584
            ],
            [
                18584,
                18600
            ],
            [
                18600,
                18625
            ],
            [
                18625,
                18634
            ],
            [
                18634,
                18674
            ],
            [
                18674,
                18709
            ],
            [
                18709,
                18752
            ],
            [
                18752,
                18835
            ],
            [
                18835,
                18911
            ],
            [
                18911,
                18952
            ],
            [
                18952,
                19104
            ],
            [
                19104,
                19235
            ],
            [
                19235,
                19326
            ],
            [
                19326,
                19342
            ],
            [
                19342,
                19360
            ],
            [
                19360,
                19510
            ],
            [
                19510,
                19562
            ],
            [
                19562,
                19577
            ],
            [
                19577,
                19657
            ],
            [
                19657,
                19704
            ],
            [
                19704,
                19749
            ],
            [
                19749,
                19808
            ],
            [
                19808,
                19956
            ],
            [
                19956,
                20101
            ],
            [
                20101,
                20190
            ],
            [
                20190,
                20366
            ],
            [
                20366,
                20446
            ],
            [
                20446,
                20507
            ],
            [
                20507,
                20571
            ],
            [
                20571,
                20648
            ],
            [
                20648,
                20670
            ],
            [
                20670,
                20709
            ],
            [
                20709,
                20788
            ],
            [
                20788,
                20836
            ]
        ]
    },
    "abridged": {
        "text": "Parliament opened that year on the twelfth of February, and Mr. Palliser was one of the first members of the House of Commons to take his seat. During the last week, rumour had spread through the country that the present Chancellor of the Exchequer had differed with the Prime Minister over repealing direct taxes, and that he was prepared to leave the Cabinet and launch himself into opposition with his small bodyguard of followers, with all his energy and venom.\nThere is something very pleasant in the close friendship and bitter animosity of these human gods. If Parliamentary friendships and enmities never changed, the thing would not be nearly so interesting. But these sudden rabid hatreds or devout loves give to the whole thing all the keen interest of a sensational novel.\nNo doubt this is greatly lessened for those too near the scene of action. The outside Briton who takes a delight in politics - and this should include ninety-nine educated Englishmen out of every hundred - should not desire to peep behind the scenes. No beholder at any theatre should do so. It is good to believe in these friendships and these enmities, and very pleasant to watch their changes.\nBut although the outer world was so sure that the existing Chancellor of the Exchequer had ceased to exist, when the House of Commons met that gentleman took his seat on the Treasury Bench. Mr. Palliser took his seat on the same side of the House, but low down, near to the cross benches, with Mr. Bott close behind.\nLord Cinquebars moved the Address, and I must confess that he did it very lamely. No one could hear a word that he said. The Address was seconded by Mr. Loftus Fitzhoward, a nephew of the Duke of St. Bungay, who spoke as though he were resolved to out-do poor Lord Cinquebars, so that every word fell from him with the elaborate accuracy of a pistol-shot. He made rhetorical pauses, and even gesticulated in a way that quite disgusted his own party. A young speaker in Parliament should be careful to avoid eloquence. All Mr. Fitzhoward's friends and enemies knew that he had had his chance, and that he had thrown it away.\nIn the Queen's Speech there had been some very lukewarm allusion to remission of direct taxation. Those words could not have been approved of by the existing Chancellor of the Exchequer. Next there arose a great enemy, an ambitious, fluent man, apparently with deep malice at his heart, though one of the most good-natured fellows in the world. He was quite content, he said, to vote for the Address, as, he believed, would be all the gentlemen on his side of the House. Then he touched lightly and gracefully on many subjects of legislation, promising support, and just hinting that they were totally and manifestly wrong in all things.\nBut- The tone of his voice changed, and he assumed a well-known look of fury. Members put away the papers they had been reading, and began to listen. But - the existing Government had come into power on the promise of a reduction of taxation, and now they were going to shirk the responsibility of their own promise. The Chancellor of the Exchequer was prepared to carry it out - but was restrained by the timidity and treachery of his colleagues, of whom, of course, the most timid and treacherous was - the great god Jove, who sat blandly smiling on the government side.\nIt was obvious Jove did not care twopence for what the irate gentleman was saying; and in fact the gentleman was not irate. His look of anger was for the newspaper reports. But he finished his speech by demanding that Jove should state plainly to the House who was to be the bearer of the purse among the gods.\nThen got up smiling, and thanked his enemy. He spoke a good deal about home matters, and foreign matters, proving that everything was right just as easily as his enemy had proved that everything was wrong. When he came to the subject of taxation, he simply repeated the passage from the Queen's Speech, expressing a hope that his right honourable friend, the Chancellor of the Exchequer, would be able to satisfy the judgement of the House, and the wishes of the people.\nBut the House was all agog, as was the crowded gallery. The energetic and still existing Chancellor of the Exchequer was divided only by one little thin Secretary of State from Jove himself. Would he get up and declare his purposes? No. He floated in silence, and was inexplicable. Then there was a general debate about money matters, in which the purse-bearer did say a few words, but nothing about the great question.\nAt last up got Mr. Palliser, towards the close of the evening, and occupied a full hour in explaining what taxes the Government might remit with safety, and what they might not, Mr. Bott prompting him with figures from behind almost too assiduously. The Members went out gradually during this oration; but the newspapers declared, next morning, that his speech had been the speech of the night, and that Mr. Palliser was the coming man.\nHe returned home to his house in Park Lane quite triumphant, and found Lady Glencora, at about twelve o'clock, sitting alone. She had arrived in town on that day, although he had wished her to stay at Matching Priory till after Easter, with his cousins. But she had said she was unwilling to remain without him, explaining that the cousins might have the home in her absence; and he had given way.\nIn truth, she had learned to hate her cousin Iphy Palliser with an unreasonable hatred. Lady Glencora knew how her absence from Monkshade had been brought about. Miss Palliser had told her all that had passed in Alice's bedroom on the last night of her stay. Yet Lady Glencora had no anger against Alice. It is hardly too much to say that Lady Glencora looked to Alice to save her. Nevertheless she hated Iphy Palliser for engaging herself in the same business. And it may be doubted whether Lady Glencora did, in truth, wish to be saved.\nWhile she was at Matching, a letter reached her, by what means she never learned, although she suspected her maid of placing it inside her writing-case. The letter had been from Burgo Fitzgerald, and had contained a direct proposal that she should go off with him.\n\"I am at Matching,\" the letter said, \"at the Inn; but I do not dare to show myself. I walked round the house yesterday, at night, and I know that I saw your room. If you love me still, I ask you to throw aside that fictitious marriage, and give yourself to the man whom, if you love him, you should regard as your husband.\"\nTo Lady Glencora the letter had seemed to assure devoted love - that love which, formerly, her friends had told her that Burgo was not capable of feeling. Saying that he would return to Matching after Parliament was met, he begged her to let him know whether her heart was true to him.\nShe told no one of the letter, but she kept it, and read it over and over again in the silence of her room. She felt that she was guilty in thus reading it; but she determined not to undergo the danger of remaining at Matching while Burgo Fitzgerald was nearby.\nShe could not analyse her own wishes. She often told herself, as she had told Alice, that it would be better for them all that she should go away. She declared to herself that she loved Burgo with all her heart. She protested that the fault would not be hers, but theirs, who had forced her to marry the man she did not love. She assured herself that her husband had no affection for her, and that their marriage was damaging to him. She recurred over and over again, in her thoughts, to her own childlessness, and to his extreme desire for an heir.\n\"If I do sacrifice myself,\" she would say, \"I shall do more good than harm, and I cannot be more wretched than I am now.\"\nYet she fled to London rather than risk having Burgo Fitzgerald near. She sent no answer to his letter. She made no preparation for going with him. She longed to see Alice and to tell her about that letter. She was like one who, in madness, was resolved to throw herself from a precipice, but to whom some remnant of sanity remained which forced her to seek those who would save her from herself.\nMr. Palliser had not seen her since her arrival in London, and of course, he took her by the hand and kissed her. But it was the embrace of a brother rather than a lover or a husband. Lady Glencora understood this thoroughly.\n\"I hope you are well?\" she said.\n\"Oh, yes; quite well. And you? A little fatigued with your journey, I suppose?\"\n\"No; not much.\"\n\"Well, we have had a debate on the Address. Don't you want to know how it has gone?\"\n\"If it has concerned you particularly, I do, of course.\"\n\"It has concerned me certainly.\"\n\"They haven't appointed you yet, have they?\"\n\"No; they don't appoint people during debates in the House of Commons. But I fear I shall never make you a politician.\"\n\"I'm afraid you never will. But I'm not the less anxious for your success, since you wish it yourself. I don't understand why you should work so very hard; but, as you like it, I'm as anxious as anybody can be that you should triumph.\"\n\"Yes; I do like it,\" he said. \"A man must like something, and I don't know what there is to like better. I spoke for a moment to Lord Brock.\" This was the name of the present Jove.\n\"And what did Lord Brock say?\"\n\"He didn't say much, but he was very cordial.\"\n\"But I thought, Plantagenet, that he could appoint you if he pleased? Doesn't he decide it all?\"\n\"Well, in one sense, he does. But I don't suppose I shall ever make you understand.\" He tried, however, to do so, and gave her a somewhat longer lecture on the working of the British Constitution than would have been expected from most young husbands to their young wives. Lady Glencora yawned, and tried to hide her yawn in her handkerchief.\n\"But I see you don't care a bit about it,\" said he, peevishly.\n\"Don't be angry, Plantagenet. Indeed I do care about it, but I am so ignorant that I can't understand it all at once. I am rather tired, and I think I'll go to bed now. Shall you be late?\"\n\"No, not very; that is, I shall be rather late. I've a lot of letters I want to write tonight, By-the-by, Mr. Bott is coming to dine tomorrow.\"\n\"Mr. Bott!\" said Lady Glencora with displeasure.\n\"Have you any objection?\"\n\"Oh, no. Would you like to dine alone with him?\"\n\"Why should I dine alone with him? Why shouldn't you eat your dinner with us? I hope you are not going to become fastidious, and to turn up your nose at people. Mrs. Marsham is in town, and I dare say she'll come if you ask her.\"\nBut this was too much for Lady Glencora. She could not endure to have her two duennas together on the first day of her arrival in London. And Mrs. Marsham would be worse than Mr. Bott, who would be talking to Mr. Palliser most of the evening.\n\"I thought,\" said she, \"of asking my cousin, Alice Vavasor, to spend the evening with me.\"\n\"Miss Vavasor!\" said the husband. \"I must say that I thought Miss Vavasor-\" He was going to allude to that unfortunate hour spent among the ruins, but he stopped himself.\n\"I hope you have nothing to say against my cousin?\" said his wife.\n\"No; I don't mean to say anything against her. But I would rather that you would ask Mrs. Marsham tomorrow.\"\nLady Glencora felt that he was hard on her, and unreasonable, and that he was treating her like a child who should not be allowed her own way in anything. She had tried to please him, and, having failed, was not now disposed to give way.\n\"As there will be no other ladies here tomorrow evening, Plantagenet, and as I have not yet seen Alice since I have been in town, I wish you would let me have my way in this. I cannot have very much to say to Mrs. Marsham, who is an old woman.\"\n\"I especially want Mrs. Marsham to be your friend,\" said he.\n\"Friendships will not come by ordering, Plantagenet,\" said she.\n\"Very well,\" said he. \"Of course, you will do as you please. I am sorry that you have refused the first favour I have asked you this year.\"\nThen he left the room, and she went away to bed.",
        "paragraph_chars": [
            [
                0,
                466
            ],
            [
                466,
                785
            ],
            [
                785,
                1182
            ],
            [
                1182,
                1499
            ],
            [
                1499,
                2123
            ],
            [
                2123,
                2761
            ],
            [
                2761,
                3334
            ],
            [
                3334,
                3645
            ],
            [
                3645,
                4116
            ],
            [
                4116,
                4536
            ],
            [
                4536,
                4973
            ],
            [
                4973,
                5371
            ],
            [
                5371,
                5910
            ],
            [
                5910,
                6175
            ],
            [
                6175,
                6499
            ],
            [
                6499,
                6785
            ],
            [
                6785,
                7047
            ],
            [
                7047,
                7597
            ],
            [
                7597,
                7719
            ],
            [
                7719,
                8116
            ],
            [
                8116,
                8342
            ],
            [
                8342,
                8375
            ],
            [
                8375,
                8455
            ],
            [
                8455,
                8471
            ],
            [
                8471,
                8556
            ],
            [
                8556,
                8613
            ],
            [
                8613,
                8646
            ],
            [
                8646,
                8691
            ],
            [
                8691,
                8811
            ],
            [
                8811,
                9047
            ],
            [
                9047,
                9228
            ],
            [
                9228,
                9259
            ],
            [
                9259,
                9306
            ],
            [
                9306,
                9403
            ],
            [
                9403,
                9746
            ],
            [
                9746,
                9809
            ],
            [
                9809,
                9998
            ],
            [
                9998,
                10142
            ],
            [
                10142,
                10191
            ],
            [
                10191,
                10217
            ],
            [
                10217,
                10266
            ],
            [
                10266,
                10496
            ],
            [
                10496,
                10739
            ],
            [
                10739,
                10830
            ],
            [
                10830,
                11001
            ],
            [
                11001,
                11068
            ],
            [
                11068,
                11177
            ],
            [
                11177,
                11415
            ],
            [
                11415,
                11660
            ],
            [
                11660,
                11721
            ],
            [
                11721,
                11785
            ],
            [
                11785,
                11925
            ],
            [
                11925,
                11973
            ]
        ],
        "segment_chars": [
            [
                0,
                144
            ],
            [
                144,
                466
            ],
            [
                466,
                565
            ],
            [
                565,
                668
            ],
            [
                668,
                785
            ],
            [
                785,
                859
            ],
            [
                859,
                1036
            ],
            [
                1036,
                1077
            ],
            [
                1077,
                1182
            ],
            [
                1182,
                1372
            ],
            [
                1372,
                1499
            ],
            [
                1499,
                1581
            ],
            [
                1581,
                1620
            ],
            [
                1620,
                1855
            ],
            [
                1855,
                1949
            ],
            [
                1949,
                2017
            ],
            [
                2017,
                2123
            ],
            [
                2123,
                2221
            ],
            [
                2221,
                2310
            ],
            [
                2310,
                2468
            ],
            [
                2468,
                2594
            ],
            [
                2594,
                2761
            ],
            [
                2761,
                2839
            ],
            [
                2839,
                2911
            ],
            [
                2911,
                3078
            ],
            [
                3078,
                3334
            ],
            [
                3334,
                3458
            ],
            [
                3458,
                3507
            ],
            [
                3507,
                3645
            ],
            [
                3645,
                3689
            ],
            [
                3689,
                3851
            ],
            [
                3851,
                4116
            ],
            [
                4116,
                4172
            ],
            [
                4172,
                4307
            ],
            [
                4307,
                4349
            ],
            [
                4349,
                4353
            ],
            [
                4353,
                4398
            ],
            [
                4398,
                4536
            ],
            [
                4536,
                4786
            ],
            [
                4786,
                4973
            ],
            [
                4973,
                5099
            ],
            [
                5099,
                5227
            ],
            [
                5227,
                5371
            ],
            [
                5371,
                5459
            ],
            [
                5459,
                5533
            ],
            [
                5533,
                5630
            ],
            [
                5630,
                5676
            ],
            [
                5676,
                5753
            ],
            [
                5753,
                5833
            ],
            [
                5833,
                5910
            ],
            [
                5910,
                6063
            ],
            [
                6063,
                6175
            ],
            [
                6175,
                6259
            ],
            [
                6259,
                6338
            ],
            [
                6338,
                6499
            ],
            [
                6499,
                6654
            ],
            [
                6654,
                6785
            ],
            [
                6785,
                6893
            ],
            [
                6893,
                7047
            ],
            [
                7047,
                7085
            ],
            [
                7085,
                7194
            ],
            [
                7194,
                7259
            ],
            [
                7259,
                7373
            ],
            [
                7373,
                7481
            ],
            [
                7481,
                7597
            ],
            [
                7597,
                7719
            ],
            [
                7719,
                7789
            ],
            [
                7789,
                7823
            ],
            [
                7823,
                7867
            ],
            [
                7867,
                7926
            ],
            [
                7926,
                8116
            ],
            [
                8116,
                8230
            ],
            [
                8230,
                8300
            ],
            [
                8300,
                8342
            ],
            [
                8342,
                8365
            ],
            [
                8365,
                8375
            ],
            [
                8375,
                8397
            ],
            [
                8397,
                8406
            ],
            [
                8406,
                8455
            ],
            [
                8455,
                8471
            ],
            [
                8471,
                8515
            ],
            [
                8515,
                8556
            ],
            [
                8556,
                8613
            ],
            [
                8613,
                8646
            ],
            [
                8646,
                8691
            ],
            [
                8691,
                8762
            ],
            [
                8762,
                8811
            ],
            [
                8811,
                8839
            ],
            [
                8839,
                8914
            ],
            [
                8914,
                9047
            ],
            [
                9047,
                9077
            ],
            [
                9077,
                9152
            ],
            [
                9152,
                9189
            ],
            [
                9189,
                9228
            ],
            [
                9228,
                9259
            ],
            [
                9259,
                9306
            ],
            [
                9306,
                9376
            ],
            [
                9376,
                9403
            ],
            [
                9403,
                9433
            ],
            [
                9433,
                9488
            ],
            [
                9488,
                9676
            ],
            [
                9676,
                9746
            ],
            [
                9746,
                9809
            ],
            [
                9809,
                9839
            ],
            [
                9839,
                9927
            ],
            [
                9927,
                9978
            ],
            [
                9978,
                9998
            ],
            [
                9998,
                10046
            ],
            [
                10046,
                10142
            ],
            [
                10142,
                10147
            ],
            [
                10147,
                10154
            ],
            [
                10154,
                10191
            ],
            [
                10191,
                10217
            ],
            [
                10217,
                10226
            ],
            [
                10226,
                10266
            ],
            [
                10266,
                10301
            ],
            [
                10301,
                10344
            ],
            [
                10344,
                10427
            ],
            [
                10427,
                10496
            ],
            [
                10496,
                10537
            ],
            [
                10537,
                10634
            ],
            [
                10634,
                10739
            ],
            [
                10739,
                10830
            ],
            [
                10830,
                10846
            ],
            [
                10846,
                10864
            ],
            [
                10864,
                11001
            ],
            [
                11001,
                11053
            ],
            [
                11053,
                11068
            ],
            [
                11068,
                11115
            ],
            [
                11115,
                11177
            ],
            [
                11177,
                11332
            ],
            [
                11332,
                11415
            ],
            [
                11415,
                11590
            ],
            [
                11590,
                11660
            ],
            [
                11660,
                11721
            ],
            [
                11721,
                11785
            ],
            [
                11785,
                11807
            ],
            [
                11807,
                11846
            ],
            [
                11846,
                11925
            ],
            [
                11925,
                11973
            ]
        ],
        "overlap_chars": [
            [
                0,
                108
            ],
            [
                109,
                114
            ],
            [
                126,
                144
            ],
            [
                144,
                165
            ],
            [
                173,
                176
            ],
            [
                184,
                203
            ],
            [
                204,
                212
            ],
            [
                221,
                252
            ],
            [
                253,
                261
            ],
            [
                262,
                266
            ],
            [
                267,
                285
            ],
            [
                291,
                300
            ],
            [
                301,
                313
            ],
            [
                313,
                318
            ],
            [
                319,
                323
            ],
            [
                324,
                326
            ],
            [
                327,
                342
            ],
            [
                349,
                360
            ],
            [
                361,
                364
            ],
            [
                365,
                458
            ],
            [
                459,
                466
            ],
            [
                466,
                511
            ],
            [
                512,
                522
            ],
            [
                523,
                533
            ],
            [
                534,
                543
            ],
            [
                544,
                563
            ],
            [
                563,
                565
            ],
            [
                565,
                567
            ],
            [
                594,
                597
            ],
            [
                607,
                612
            ],
            [
                620,
                668
            ],
            [
                668,
                671
            ],
            [
                685,
                690
            ],
            [
                691,
                697
            ],
            [
                715,
                784
            ],
            [
                785,
                828
            ],
            [
                829,
                859
            ],
            [
                859,
                909
            ],
            [
                912,
                920
            ],
            [
                921,
                988
            ],
            [
                991,
                1001
            ],
            [
                1012,
                1014
            ],
            [
                1017,
                1036
            ],
            [
                1036,
                1077
            ],
            [
                1077,
                1181
            ],
            [
                1182,
                1372
            ],
            [
                1372,
                1384
            ],
            [
                1385,
                1428
            ],
            [
                1428,
                1443
            ],
            [
                1444,
                1469
            ],
            [
                1469,
                1470
            ],
            [
                1476,
                1484
            ],
            [
                1485,
                1497
            ],
            [
                1497,
                1498
            ],
            [
                1499,
                1581
            ],
            [
                1581,
                1620
            ],
            [
                1620,
                1746
            ],
            [
                1754,
                1774
            ],
            [
                1774,
                1775
            ],
            [
                1776,
                1778
            ],
            [
                1784,
                1789
            ],
            [
                1800,
                1804
            ],
            [
                1814,
                1817
            ],
            [
                1853,
                1855
            ],
            [
                1855,
                1857
            ],
            [
                1858,
                1881
            ],
            [
                1882,
                1885
            ],
            [
                1886,
                1890
            ],
            [
                1904,
                1906
            ],
            [
                1907,
                1908
            ],
            [
                1918,
                1947
            ],
            [
                1947,
                1949
            ],
            [
                1949,
                1985
            ],
            [
                1989,
                1996
            ],
            [
                2000,
                2005
            ],
            [
                2006,
                2017
            ],
            [
                2017,
                2049
            ],
            [
                2050,
                2123
            ],
            [
                2123,
                2221
            ],
            [
                2221,
                2232
            ],
            [
                2233,
                2271
            ],
            [
                2272,
                2310
            ],
            [
                2315,
                2341
            ],
            [
                2345,
                2354
            ],
            [
                2354,
                2355
            ],
            [
                2356,
                2362
            ],
            [
                2363,
                2366
            ],
            [
                2366,
                2416
            ],
            [
                2417,
                2466
            ],
            [
                2466,
                2468
            ],
            [
                2468,
                2594
            ],
            [
                2594,
                2617
            ],
            [
                2618,
                2621
            ],
            [
                2622,
                2627
            ],
            [
                2633,
                2649
            ],
            [
                2664,
                2688
            ],
            [
                2694,
                2760
            ],
            [
                2761,
                2764
            ],
            [
                2766,
                2800
            ],
            [
                2804,
                2811
            ],
            [
                2814,
                2837
            ],
            [
                2837,
                2839
            ],
            [
                2839,
                2888
            ],
            [
                2888,
                2893
            ],
            [
                2894,
                2911
            ],
            [
                2911,
                2914
            ],
            [
                2917,
                2967
            ],
            [
                2976,
                3068
            ],
            [
                3076,
                3078
            ],
            [
                3078,
                3081
            ],
            [
                3082,
                3138
            ],
            [
                3145,
                3148
            ],
            [
                3149,
                3175
            ],
            [
                3176,
                3243
            ],
            [
                3244,
                3247
            ],
            [
                3248,
                3263
            ],
            [
                3266,
                3316
            ],
            [
                3328,
                3334
            ],
            [
                3334,
                3340
            ],
            [
                3349,
                3353
            ],
            [
                3367,
                3416
            ],
            [
                3421,
                3423
            ],
            [
                3429,
                3458
            ],
            [
                3458,
                3475
            ],
            [
                3484,
                3505
            ],
            [
                3505,
                3507
            ],
            [
                3507,
                3510
            ],
            [
                3514,
                3533
            ],
            [
                3537,
                3546
            ],
            [
                3547,
                3551
            ],
            [
                3552,
                3604
            ],
            [
                3605,
                3645
            ],
            [
                3645,
                3649
            ],
            [
                3650,
                3687
            ],
            [
                3687,
                3689
            ],
            [
                3689,
                3691
            ],
            [
                3698,
                3784
            ],
            [
                3785,
                3851
            ],
            [
                3851,
                4115
            ],
            [
                4116,
                4133
            ],
            [
                4134,
                4172
            ],
            [
                4172,
                4236
            ],
            [
                4237,
                4307
            ],
            [
                4307,
                4349
            ],
            [
                4353,
                4398
            ],
            [
                4398,
                4408
            ],
            [
                4413,
                4501
            ],
            [
                4502,
                4509
            ],
            [
                4516,
                4534
            ],
            [
                4534,
                4535
            ],
            [
                4536,
                4713
            ],
            [
                4716,
                4722
            ],
            [
                4723,
                4761
            ],
            [
                4762,
                4772
            ],
            [
                4773,
                4778
            ],
            [
                4784,
                4786
            ],
            [
                4786,
                4816
            ],
            [
                4817,
                4939
            ],
            [
                4940,
                4952
            ],
            [
                4957,
                4973
            ],
            [
                4973,
                5032
            ],
            [
                5032,
                5099
            ],
            [
                5099,
                5135
            ],
            [
                5145,
                5170
            ],
            [
                5171,
                5208
            ],
            [
                5214,
                5227
            ],
            [
                5227,
                5238
            ],
            [
                5252,
                5347
            ],
            [
                5347,
                5370
            ],
            [
                5371,
                5434
            ],
            [
                5438,
                5450
            ],
            [
                5451,
                5457
            ],
            [
                5457,
                5459
            ],
            [
                5459,
                5477
            ],
            [
                5482,
                5533
            ],
            [
                5533,
                5619
            ],
            [
                5624,
                5628
            ],
            [
                5628,
                5630
            ],
            [
                5630,
                5633
            ],
            [
                5639,
                5647
            ],
            [
                5648,
                5651
            ],
            [
                5652,
                5676
            ],
            [
                5676,
                5753
            ],
            [
                5753,
                5833
            ],
            [
                5833,
                5836
            ],
            [
                5837,
                5862
            ],
            [
                5868,
                5876
            ],
            [
                5877,
                5910
            ],
            [
                5910,
                5935
            ],
            [
                5935,
                5976
            ],
            [
                5977,
                5990
            ],
            [
                5990,
                5991
            ],
            [
                6001,
                6004
            ],
            [
                6015,
                6023
            ],
            [
                6035,
                6037
            ],
            [
                6049,
                6061
            ],
            [
                6061,
                6062
            ],
            [
                6063,
                6174
            ],
            [
                6175,
                6257
            ],
            [
                6257,
                6259
            ],
            [
                6259,
                6338
            ],
            [
                6338,
                6384
            ],
            [
                6385,
                6498
            ],
            [
                6499,
                6515
            ],
            [
                6516,
                6519
            ],
            [
                6527,
                6540
            ],
            [
                6548,
                6560
            ],
            [
                6563,
                6579
            ],
            [
                6588,
                6614
            ],
            [
                6620,
                6625
            ],
            [
                6626,
                6633
            ],
            [
                6642,
                6644
            ],
            [
                6652,
                6654
            ],
            [
                6661,
                6719
            ],
            [
                6720,
                6722
            ],
            [
                6723,
                6744
            ],
            [
                6750,
                6785
            ],
            [
                6785,
                6879
            ],
            [
                6880,
                6893
            ],
            [
                6893,
                6940
            ],
            [
                6940,
                6945
            ],
            [
                6946,
                6960
            ],
            [
                6961,
                6999
            ],
            [
                7000,
                7011
            ],
            [
                7012,
                7034
            ],
            [
                7045,
                7046
            ],
            [
                7047,
                7085
            ],
            [
                7085,
                7192
            ],
            [
                7192,
                7194
            ],
            [
                7194,
                7217
            ],
            [
                7218,
                7232
            ],
            [
                7239,
                7259
            ],
            [
                7259,
                7373
            ],
            [
                7373,
                7463
            ],
            [
                7473,
                7481
            ],
            [
                7481,
                7596
            ],
            [
                7597,
                7598
            ],
            [
                7601,
                7656
            ],
            [
                7657,
                7718
            ],
            [
                7719,
                7741
            ],
            [
                7766,
                7782
            ],
            [
                7787,
                7789
            ],
            [
                7789,
                7823
            ],
            [
                7823,
                7867
            ],
            [
                7867,
                7890
            ],
            [
                7891,
                7894
            ],
            [
                7895,
                7906
            ],
            [
                7913,
                7926
            ],
            [
                7926,
                7933
            ],
            [
                7939,
                7963
            ],
            [
                7973,
                8116
            ],
            [
                8116,
                8178
            ],
            [
                8179,
                8230
            ],
            [
                8230,
                8277
            ],
            [
                8278,
                8300
            ],
            [
                8300,
                8313
            ],
            [
                8314,
                8340
            ],
            [
                8340,
                8341
            ],
            [
                8342,
                8365
            ],
            [
                8365,
                8375
            ],
            [
                8375,
                8397
            ],
            [
                8397,
                8406
            ],
            [
                8406,
                8455
            ],
            [
                8455,
                8471
            ],
            [
                8471,
                8515
            ],
            [
                8515,
                8556
            ],
            [
                8556,
                8613
            ],
            [
                8614,
                8646
            ],
            [
                8646,
                8677
            ],
            [
                8679,
                8691
            ],
            [
                8691,
                8736
            ],
            [
                8737,
                8762
            ],
            [
                8762,
                8811
            ],
            [
                8811,
                8815
            ],
            [
                8816,
                8839
            ],
            [
                8839,
                8914
            ],
            [
                8914,
                9047
            ],
            [
                9047,
                9077
            ],
            [
                9077,
                9152
            ],
            [
                9152,
                9186
            ],
            [
                9194,
                9206
            ],
            [
                9207,
                9209
            ],
            [
                9210,
                9226
            ],
            [
                9226,
                9228
            ],
            [
                9228,
                9259
            ],
            [
                9259,
                9306
            ],
            [
                9306,
                9376
            ],
            [
                9376,
                9386
            ],
            [
                9394,
                9403
            ],
            [
                9403,
                9433
            ],
            [
                9433,
                9488
            ],
            [
                9488,
                9490
            ],
            [
                9496,
                9515
            ],
            [
                9515,
                9598
            ],
            [
                9599,
                9674
            ],
            [
                9674,
                9676
            ],
            [
                9676,
                9701
            ],
            [
                9708,
                9746
            ],
            [
                9746,
                9809
            ],
            [
                9809,
                9839
            ],
            [
                9839,
                9927
            ],
            [
                9927,
                9978
            ],
            [
                9978,
                9998
            ],
            [
                9998,
                10046
            ],
            [
                10046,
                10083
            ],
            [
                10091,
                10092
            ],
            [
                10093,
                10130
            ],
            [
                10142,
                10147
            ],
            [
                10147,
                10154
            ],
            [
                10154,
                10172
            ],
            [
                10189,
                10191
            ],
            [
                10192,
                10217
            ],
            [
                10217,
                10226
            ],
            [
                10226,
                10266
            ],
            [
                10266,
                10301
            ],
            [
                10301,
                10344
            ],
            [
                10344,
                10427
            ],
            [
                10427,
                10478
            ],
            [
                10479,
                10496
            ],
            [
                10496,
                10537
            ],
            [
                10537,
                10581
            ],
            [
                10582,
                10634
            ],
            [
                10634,
                10679
            ],
            [
                10685,
                10693
            ],
            [
                10705,
                10717
            ],
            [
                10723,
                10738
            ],
            [
                10739,
                10830
            ],
            [
                10830,
                10846
            ],
            [
                10846,
                10864
            ],
            [
                10864,
                10903
            ],
            [
                10906,
                10921
            ],
            [
                10922,
                10925
            ],
            [
                10929,
                11001
            ],
            [
                11001,
                11053
            ],
            [
                11053,
                11067
            ],
            [
                11068,
                11115
            ],
            [
                11119,
                11126
            ],
            [
                11134,
                11165
            ],
            [
                11174,
                11177
            ],
            [
                11191,
                11212
            ],
            [
                11216,
                11332
            ],
            [
                11332,
                11339
            ],
            [
                11346,
                11415
            ],
            [
                11415,
                11453
            ],
            [
                11463,
                11590
            ],
            [
                11590,
                11660
            ],
            [
                11660,
                11721
            ],
            [
                11721,
                11785
            ],
            [
                11785,
                11807
            ],
            [
                11807,
                11846
            ],
            [
                11846,
                11924
            ],
            [
                11925,
                11973
            ]
        ],
        "row_chars": [
            [
                0,
                144
            ],
            [
                144,
                466
            ],
            [
                466,
                565
            ],
            [
                565,
                668
            ],
            [
                668,
                785
            ],
            [
                785,
                859
            ],
            [
                859,
                859
            ],
            [
                859,
                1036
            ],
            [
                1036,
                1077
            ],
            [
                1077,
                1182
            ],
            [
                1182,
                1182
            ],
            [
                1182,
                1372
            ],
            [
                1372,
                1499
            ],
            [
                1499,
                1581
            ],
            [
                1581,
                1581
            ],
            [
                1581,
                1620
            ],
            [
                1620,
                1855
            ],
            [
                1855,
                1949
            ],
            [
                1949,
                2017
            ],
            [
                2017,
                2017
            ],
            [
                2017,
                2017
            ],
            [
                2017,
                2123
            ],
            [
                2123,
                2221
            ],
            [
                2221,
                2221
            ],
            [
                2221,
                2221
            ],
            [
                2221,
                2310
            ],
            [
                2310,
                2310
            ],
            [
                2310,
                2310
            ],
            [
                2310,
                2468
            ],
            [
                2468,
                2594
            ],
            [
                2594,
                2594
            ],
            [
                2594,
                2594
            ],
            [
                2594,
                2761
            ],
            [
                2761,
                2839
            ],
            [
                2839,
                2839
            ],
            [
                2839,
                2911
            ],
            [
                2911,
                3078
            ],
            [
                3078,
                3334
            ],
            [
                3334,
                3334
            ],
            [
                3334,
                3334
            ],
            [
                3334,
                3458
            ],
            [
                3458,
                3507
            ],
            [
                3507,
                3507
            ],
            [
                3507,
                3645
            ],
            [
                3645,
                3689
            ],
            [
                3689,
                3689
            ],
            [
                3689,
                3851
            ],
            [
                3851,
                4116
            ],
            [
                4116,
                4116
            ],
            [
                4116,
                4172
            ],
            [
                4172,
                4307
            ],
            [
                4307,
                4349
            ],
            [
                4349,
                4349
            ],
            [
                4349,
                4349
            ],
            [
                4349,
                4349
            ],
            [
                4349,
                4398
            ],
            [
                4398,
                4398
            ],
            [
                4398,
                4536
            ],
            [
                4536,
                4786
            ],
            [
                4786,
                4786
            ],
            [
                4786,
                4973
            ],
            [
                4973,
                5099
            ],
            [
                5099,
                5227
            ],
            [
                5227,
                5371
            ],
            [
                5371,
                5459
            ],
            [
                5459,
                5533
            ],
            [
                5533,
                5630
            ],
            [
                5630,
                5676
            ],
            [
                5676,
                5676
            ],
            [
                5676,
                5676
            ],
            [
                5676,
                5753
            ],
            [
                5753,
                5833
            ],
            [
                5833,
                5910
            ],
            [
                5910,
                6063
            ],
            [
                6063,
                6063
            ],
            [
                6063,
                6063
            ],
            [
                6063,
                6063
            ],
            [
                6063,
                6063
            ],
            [
                6063,
                6175
            ],
            [
                6175,
                6259
            ],
            [
                6259,
                6338
            ],
            [
                6338,
                6499
            ],
            [
                6499,
                6499
            ],
            [
                6499,
                6654
            ],
            [
                6654,
                6785
            ],
            [
                6785,
                6893
            ],
            [
                6893,
                7047
            ],
            [
                7047,
                7085
            ],
            [
                7085,
                7194
            ],
            [
                7194,
                7259
            ],
            [
                7259,
                7373
            ],
            [
                7373,
                7481
            ],
            [
                7481,
                7597
            ],
            [
                7597,
                7719
            ],
            [
                7719,
                7789
            ],
            [
                7789,
                7823
            ],
            [
                7823,
                7867
            ],
            [
                7867,
                7926
            ],
            [
                7926,
                8116
            ],
            [
                8116,
                8230
            ],
            [
                8230,
                8300
            ],
            [
                8300,
                8342
            ],
            [
                8342,
                8365
            ],
            [
                8365,
                8375
            ],
            [
                8375,
                8397
            ],
            [
                8397,
                8406
            ],
            [
                8406,
                8455
            ],
            [
                8455,
                8471
            ],
            [
                8471,
                8515
            ],
            [
                8515,
                8556
            ],
            [
                8556,
                8613
            ],
            [
                8613,
                8613
            ],
            [
                8613,
                8646
            ],
            [
                8646,
                8691
            ],
            [
                8691,
                8762
            ],
            [
                8762,
                8811
            ],
            [
                8811,
                8839
            ],
            [
                8839,
                8914
            ],
            [
                8914,
                9047
            ],
            [
                9047,
                9077
            ],
            [
                9077,
                9152
            ],
            [
                9152,
                9152
            ],
            [
                9152,
                9152
            ],
            [
                9152,
                9152
            ],
            [
                9152,
                9152
            ],
            [
                9152,
                9152
            ],
            [
                9152,
                9189
            ],
            [
                9189,
                9228
            ],
            [
                9228,
                9259
            ],
            [
                9259,
                9306
            ],
            [
                9306,
                9376
            ],
            [
                9376,
                9403
            ],
            [
                9403,
                9433
            ],
            [
                9433,
                9488
            ],
            [
                9488,
                9676
            ],
            [
                9676,
                9746
            ],
            [
                9746,
                9809
            ],
            [
                9809,
                9839
            ],
            [
                9839,
                9927
            ],
            [
                9927,
                9978
            ],
            [
                9978,
                9998
            ],
            [
                9998,
                10046
            ],
            [
                10046,
                10142
            ],
            [
                10142,
                10142
            ],
            [
                10142,
                10142
            ],
            [
                10142,
                10147
            ],
            [
                10147,
                10154
            ],
            [
                10154,
                10191
            ],
            [
                10191,
                10191
            ],
            [
                10191,
                10217
            ],
            [
                10217,
                10226
            ],
            [
                10226,
                10266
            ],
            [
                10266,
                10301
            ],
            [
                10301,
                10344
            ],
            [
                10344,
                10427
            ],
            [
                10427,
                10496
            ],
            [
                10496,
                10537
            ],
            [
                10537,
                10634
            ],
            [
                10634,
                10739
            ],
            [
                10739,
                10830
            ],
            [
                10830,
                10846
            ],
            [
                10846,
                10864
            ],
            [
                10864,
                11001
            ],
            [
                11001,
                11053
            ],
            [
                11053,
                11068
            ],
            [
                11068,
                11068
            ],
            [
                11068,
                11115
            ],
            [
                11115,
                11115
            ],
            [
                11115,
                11177
            ],
            [
                11177,
                11177
            ],
            [
                11177,
                11332
            ],
            [
                11332,
                11415
            ],
            [
                11415,
                11590
            ],
            [
                11590,
                11660
            ],
            [
                11660,
                11721
            ],
            [
                11721,
                11785
            ],
            [
                11785,
                11785
            ],
            [
                11785,
                11807
            ],
            [
                11807,
                11846
            ],
            [
                11846,
                11925
            ],
            [
                11925,
                11973
            ]
        ]
    }
}