{
    "original": {
        "text": "But Lady Glencora was not brought to repentance by her husband's last words. It seemed to her to be so intolerably cruel, this demand of his, that she should be made to pass the whole of her first evening in town with an old woman for whom it was impossible that she should entertain the slightest regard, that she resolved upon rebellion. Had he positively ordered Mrs. Marsham, she would have sent for that lady, and have contented herself with enduring her presence in disdainful silence; but Mr. Palliser had not given any order. He had made a request, and a request, from its very nature, admits of no obedience. The compliance with a request must be voluntary, and she would not send for Mrs. Marsham, except upon compulsion. Had not she also made a request to him, and had not he refused it? It was his prerogative, undoubtedly, to command; but in that matter of requests she had a right to expect that her voice should be as potent as his own. She wrote a line, therefore, to Alice before she went to bed, begging her cousin to come to her early on the following day, so that they might go out together, and then afterwards dine in company with Mr. Bott.\n\"I know that will be an inducement to you,\" Lady Glencora said, \"because your generous heart will feel of what service you may be to me. Nobody else will be here,--unless, indeed, Mrs. Marsham should be asked, unknown to myself.\"\nThen she sat herself down to think,--to think especially about the cruelty of husbands. She had been told over and over again, in the days before her marriage, that Burgo would ill-use her if he became her husband. The Marquis of Auld Reekie had gone so far as to suggest that Burgo might probably beat her. But what hard treatment, even what beating, could be so unendurable as this total want of sympathy, as this deadness in life, which her present lot entailed upon her? As for that matter of beating, she ridiculed the idea in her very soul. She sat smiling at the absurdity of the thing as she thought of the beauty of Burgo's eyes, of the softness of his touch, of the loving, almost worshipping, tones of his voice. Would it not even be better to be beaten by him than to have politics explained to her at one o'clock at night by such a husband as Plantagenet Palliser? The British Constitution, indeed! Had she married Burgo they would have been in sunny Italy, and he would have told her some other tale than that as they sat together under the pale moonlight. She had a little water-coloured drawing called Raphael and Fornarina, and she was infantine enough to tell herself that the so-called Raphael was like her Burgo--no, not her Burgo, but the Burgo that was not hers. At any rate, all the romance of the picture she might have enjoyed had they allowed her to dispose as she had wished of her own hand. She might have sat in marble balconies, while the vines clustered over her head, and he would have been at her knee, hardly speaking to her, but making his presence felt by the halo of its divinity. He would have called upon her for no hard replies. With him near her she would have enjoyed the soft air, and would have sat happy, without trouble, lapped in the delight of loving. It was thus that Fornarina sat. And why should not such a lot have been hers? Her Raphael would have loved her, let them say what they would about his cruelty.\nPoor, wretched, overburthened child, to whom the commonest lessons of life had not yet been taught, and who had now fallen into the hands of one who was so ill-fitted to teach them! Who would not pity her? Who could say that the fault was hers? The world had laden her with wealth till she had had no limb free for its ordinary uses, and then had turned her loose to run her race!\n\"Have you written to your cousin?\" her husband asked her the next morning. His voice, as he spoke, clearly showed that his anger was either over or suppressed.\n\"Yes; I have asked her to come and drive, and then to stay for dinner. I shall send the carriage for her if she can come. The man is to wait for an answer.\"\n\"Very well,\" said Mr. Palliser, mildly. And then, after a short pause, he added, \"As that is settled, perhaps you would have no objection to ask Mrs. Marsham also?\"\n\"Won't she probably be engaged?\"\n\"No; I think not,\" said Mr. Palliser. And then he added, being ashamed of the tinge of falsehood of which he would otherwise have been guilty, \"I know she is not engaged.\"\n\"She expects to come, then?\" said Lady Glencora.\n\"I have not asked her, if you mean that, Glencora. Had I done so, I should have said so. I told her that I did not know what your engagements were.\"\n\"I will write to her, if you please,\" said the wife, who felt that she could hardly refuse any longer.\n\"Do, my dear!\" said the husband. So Lady Glencora did write to Mrs. Marsham, who promised to come,--as did also Alice Vavasor.\nLady Glencora would, at any rate, have Alice to herself for some hours before dinner. At first she took comfort in that reflection; but after a while she bethought herself that she would not know what to tell Alice, or what not to tell. Did she mean to show that letter to her cousin? If she did show it, then,--so she argued with herself,--she must bring herself to endure the wretchedness of her present lot, and must give up for ever all her dreams about Raphael and Fornarina. If she did not show it,--or, at any rate, tell of it,--then it would come to pass that she would leave her husband under the protection of another man, and she would become--what she did not dare to name even to herself. She declared that so it must be. She knew that she would go with Burgo, should he ever come to her with the means of going at his and her instant command. But should she bring herself to let Alice know that such a letter had been conveyed to her, Burgo would never have such power.\nI remember the story of a case of abduction in which a man was tried for his life, and was acquitted, because the lady had acquiesced in the carrying away while it was in progress. She had, as she herself declared, armed herself with a sure and certain charm or talisman against such dangers, which she kept suspended round her neck; but whilst she was in the post-chaise she opened the window and threw the charm from her, no longer desiring, as the learned counsel for the defence efficiently alleged, to be kept under the bonds of such protection. Lady Glencora's state of mind was, in its nature, nearly the same as that of the lady in the post-chaise. Whether or no she would use her charm, she had not yet decided, but the power of doing so was still hers.\nAlice came, and the greeting between the cousins was very affectionate. Lady Glencora received her as though they had been playmates from early childhood; and Alice, though such impulsive love was not natural to her as to the other, could not bring herself to be cold to one who was so warm to her. Indeed, had she not promised her love in that meeting at Matching Priory in which her cousin had told her of all her wretchedness? \"I will love you!\" Alice had said; and though there was much in Lady Glencora that she could not approve,--much even that she could not bring herself to like,--still she would not allow her heart to contradict her words.\nThey sat so long over the fire in the drawing-room that at last they agreed that the driving should be abandoned.\n\"What's the use of it?\" said Lady Glencora. \"There's nothing to see, and the wind is as cold as charity. We are much more comfortable here; are we not?\" Alice quite acquiesced in this, having no great desire to be driven through the parks in the gloom of a February afternoon.\n\"If I had Dandy and Flirt up here, there would be some fun in it; but Mr. Palliser doesn't wish me to drive in London.\"\n\"I suppose it would be dangerous?\"\n\"Not in the least. I don't think it's that he minds; but he has an idea that it looks fast.\"\n\"So it does. If I were a man, I'm sure I shouldn't like my wife to drive horses about London.\"\n\"And why not? Just because you'd be a tyrant,--like other husbands? What's the harm of looking fast, if one doesn't do anything improper? Poor Dandy, and dear Flirt! I'm sure they'd like it.\"\n\"Perhaps Mr. Palliser doesn't care for that?\"\n\"I can tell you something else he doesn't care for. He doesn't care whether Dandy's mistress likes it.\"\n\"Don't say that, Glencora.\"\n\"Why not say it,--to you?\"\n\"Don't teach yourself to think it. That's what I mean. I believe he would consent to anything that he didn't think wrong.\"\n\"Such as lectures about the British Constitution! But never mind about that, Alice. Of course the British Constitution is everything to him, and I wish I knew more about it;--that's all. But I haven't told you whom you are to meet at dinner.\"\n\"Yes, you have--Mr. Bott.\"\n\"But there's another guest, a Mrs. Marsham. I thought I'd got rid of her for to-day, when I wrote to you; but I hadn't. She's coming.\"\n\"She won't hurt me at all,\" said Alice.\n\"She will hurt me very much. She'll destroy the pleasure of our whole evening. I do believe that she hates you, and that she thinks you instigate me to all manner of iniquity. What fools they all are!\"\n\"Who are they all, Glencora?\"\n\"She and that man, and--. Never mind. It makes me sick when I think that they should be so blind. Alice, I hardly know how much I owe to you; I don't, indeed. Everything, I believe.\" Lady Glencora, as she spoke, put her hand into her pocket, and grasped the letter which lay there.\n\"That's nonsense,\" said Alice.\n\"No; it's not nonsense. Who do you think came to Matching when I was there?\"\n\"What;--to the house?\" said Alice, feeling almost certain that Mr. Fitzgerald was the person to whom Lady Glencora was alluding.\n\"No; not to the house.\"\n\"If it is the person of whom I am thinking,\" said Alice, solemnly, \"let me implore you not to speak of him.\"\n\"And why should I not speak of him? Did I not speak of him before to you, and was it not for good? How are you to be my friend, if I may not speak to you of everything?\"\n\"But you should not think of him.\"\n\"What nonsense you talk, Alice! Not think of him! How is one to help one's thoughts? Look here.\"\nHer hand was on the letter, and it would have been out in a moment, and thrown upon Alice's lap, had not the servant opened the door and announced Mrs. Marsham.\n\"Oh, how I do wish we had gone to drive!\" said Lady Glencora, in a voice which the servant certainly heard, and which Mrs. Marsham would have heard had she not been a little hard of hearing,--in her bonnet.\n\"How do, my dear?\" said Mrs. Marsham. \"I thought I'd just come across from Norfolk Street and see you, though I am coming to dinner in the evening. It's only just a step, you know. How d'ye do, Miss Vavasor?\" and she made a salutation to Alice which was nearly as cold as it could be.\nMrs. Marsham was a woman who had many good points. She was poor, and bore her poverty without complaint She was connected by blood and friendship with people rich and titled; but she paid to none of them egregious respect on account of their wealth or titles. She was staunch in her friendships, and staunch in her enmities. She was no fool, and knew well what was going on in the world. She could talk about the last novel, or--if need be--about the Constitution. She had been a true wife, though sometimes too strong-minded, and a painstaking mother, whose children, however, had never loved her as most mothers like to be loved.\nThe catalogue of her faults must be quite as long as that of her virtues. She was one of those women who are ambitious of power, and not very scrupulous as to the manner in which they obtain it. She was hardhearted, and capable of pursuing an object without much regard to the injury she might do. She would not flatter wealth or fawn before a title, but she was not above any artifice by which she might ingratiate herself with those whom it suited her purpose to conciliate. She thought evil rather than good. She was herself untrue in action, if not absolutely in word. I do not say that she would coin lies, but she would willingly leave false impressions. She had been the bosom friend, and in many things the guide in life, of Mr. Palliser's mother; and she took a special interest in Mr. Palliser's welfare. When he married, she heard the story of the loves of Burgo and Lady Glencora; and though she thought well of the money, she was not disposed to think very well of the bride. She made up her mind that the young lady would want watching, and she was of opinion that no one would be so well able to watch Lady Glencora as herself. She had not plainly opened her mind on this matter to Mr. Palliser; she had not made any distinct suggestion to him that she would act as Argus to his wife. Mr. Palliser would have rejected any such suggestion, and Mrs. Marsham knew that he would do so; but she had let a word or two drop, hinting that Lady Glencora was very young,--hinting that Lady Glencora's manners were charming in their childlike simplicity; but hinting also that precaution was, for that reason, the more necessary. Mr. Palliser, who suspected nothing as to Burgo or as to any other special peril, whose whole disposition was void of suspicion, whose dry nature realized neither the delights nor the dangers of love, acknowledged that Glencora was young. He especially wished that she should be discreet and matronly; he feared no lovers, but he feared that she might do silly things,--that she would catch cold,--and not know how to live a life becoming the wife of a Chancellor of the Exchequer. Therefore he submitted Glencora,--and, to a certain extent, himself,--into the hands of Mrs. Marsham.\nLady Glencora had not been twenty-four hours in the house with this lady before she recognized in her a duenna. In all such matters no one could be quicker than Lady Glencora. She might be very ignorant about the British Constitution, and, alas! very ignorant also as to the real elements of right and wrong in a woman's conduct, but she was no fool. She had an eye that could see, and an ear that could understand, and an abundance of that feminine instinct which teaches a woman to know her friend or her enemy at a glance, at a touch, at a word. In many things Lady Glencora was much quicker, much more clever, than her husband, though he was to be Chancellor of the Exchequer, and though she did know nothing of the Constitution. She knew, too, that he was easily to be deceived,--that though his intelligence was keen, his instincts were dull,--that he was gifted with no fineness of touch, with no subtle appreciation of the characters of men and women; and, to a certain extent, she looked down upon him for his obtusity. He should have been aware that Burgo was a danger to be avoided; and he should have been aware also that Mrs. Marsham was a duenna not to be employed. When a woman knows that she is guarded by a watch-dog, she is bound to deceive her Cerberus, if it be possible, and is usually not ill-disposed to deceive also the owner of Cerberus. Lady Glencora felt that Mrs. Marsham was her Cerberus, and she was heartily resolved that if she was to be kept in the proper line at all, she would not be so kept by Mrs. Marsham.\nAlice rose and accepted Mrs. Marsham's salutation quite as coldly as it had been given, and from that time forward those two ladies were enemies. Mrs. Marsham, groping quite in the dark, partly guessed that Alice had in some way interfered to prevent Lady Glencora's visit to Monkshade, and, though such prevention was, no doubt, good in that lady's eyes, she resented the interference. She had made up her mind that Alice was not the sort of friend that Lady Glencora should have about her. Alice recognized and accepted the feud.\n\"I thought I might find you at home,\" said Mrs. Marsham, \"as I know you are lazy about going out in the cold,--unless it be for a foolish midnight ramble,\" and Mrs. Marsham shook her head. She was a little woman, with sharp small eyes, with a permanent colour in her face, and two short, crisp, grey curls at each side of her face; always well dressed, always in good health, and, as Lady Glencora believed, altogether incapable of fatigue.\n\"The ramble you speak of was very wise, I think,\" said Lady Glencora; \"but I never could see the use of driving about in London in the middle of winter.\"\n\"One ought to go out of the house every day,\" said Mrs. Marsham.\n\"I hate all those rules. Don't you, Alice?\" Alice did not hate them, therefore she said nothing.\n\"My dear Glencora, one must live by rules in this life. You might as well say that you hated sitting down to dinner.\"\n\"So I do, very often; almost always when there's company.\"\n\"You'll get over that feeling after another season in town,\" said Mrs. Marsham, pretending to suppose that Lady Glencora alluded to some remaining timidity in receiving her own guests.\n\"Upon my word I don't think I shall. It's a thing that seems always to be getting more grievous, instead of less so. Mr. Bott is coming to dine here to-night.\"\nThere was no mistaking the meaning of this. There was no pretending even to mistake it. Now, Mrs. Marsham had accepted the right hand of fellowship from Mr. Bott,--not because she especially liked him, but in compliance with the apparent necessities of Mr. Palliser's position. Mr. Bott had made good his ground about Mr. Palliser; and Mrs. Marsham, as she was not strong enough to turn him off from it, had given him the right hand of fellowship.\n\"Mr. Bott is a Member of Parliament, and a very serviceable friend of Mr. Palliser's,\" said Mrs. Marsham.\n\"All the same; we do not like Mr. Bott--do we, Alice? He is Doctor Fell to us; only I think we could tell why.\"\n\"I certainly do not like him,\" said Alice.\n\"It can be but of small matter to you, Miss Vavasor,\" said Mrs. Marsham, \"as you will not probably have to see much of him.\"\n\"Of the very smallest moment,\" said Alice. \"He did annoy me once, but will never, I dare say, have an opportunity of doing so again.\"\n\"I don't know what the annoyance may have been.\"\n\"Of course you don't, Mrs. Marsham.\"\n\"But I shouldn't have thought it likely that a person so fully employed as Mr. Bott, and employed, too, on matters of such vast importance, would have gone out of his way to annoy a young lady whom he chanced to meet for a day or two in a country-house.\"\n\"I don't think that Alice means that he attempted to flirt with her,\" said Lady Glencora, laughing. \"Fancy Mr. Bott's flirtation!\"\n\"Perhaps he did not attempt,\" said Mrs. Marsham; and the words, the tone, and the innuendo together were more than Alice was able to bear with equanimity.\n\"Glencora,\" said she, rising from her chair, \"I think I'll leave you alone with Mrs. Marsham. I'm not disposed to discuss Mr. Bott's character, and certainly not to hear his name mentioned in disagreeable connection with my own.\"\nBut Lady Glencora would not let her go. \"Nonsense, Alice,\" she said. \"If you and I can't fight our little battles against Mr. Bott and Mrs. Marsham without running away, it is odd. There is a warfare in which they who run away never live to fight another day.\"\n\"I hope, Glencora, you do not count me as your enemy?\" said Mrs. Marsham, drawing herself up.\n\"But I shall,--certainly, if you attack Alice. Love me, love my dog. I beg your pardon, Alice; but what I meant was this, Mrs. Marsham; Love me, love the best friend I have in the world.\"\n\"I did not mean to offend Miss Vavasor,\" said Mrs. Marsham, looking at her very grimly. Alice merely bowed her head. She had been offended, and she would not deny it. After that, Mrs. Marsham took herself off, saying that she would be back to dinner. She was angry, but not unhappy. She thought that she could put down Miss Vavasor, and she was prepared to bear a good deal from Lady Glencora--for Mr. Palliser's sake, as she said to herself, with some attempt at a sentimental remembrance of her old friend.\n\"She's a nasty old cat,\" said Lady Glencora, as soon as the door was closed; and she said these words with so droll a voice, with such a childlike shaking of her head, with so much comedy in her grimace, that Alice could not but laugh. \"She is,\" said Lady Glencora. \"I know her, and you'll have to know her, too, before you've done with her. It won't at all do for you to run away when she spits at you. You must hold your ground, and show your claws,--and make her know that if she spits, you can scratch.\"\n\"But I don't want to be a cat myself.\"\n\"She'll find I'm of the genus, but of the tiger kind, if she persecutes me. Alice, there's one thing I have made up my mind about. I will not be persecuted. If my husband tells me to do anything, as long as he is my husband I'll do it; but I won't be persecuted.\"\n\"You should remember that she was a very old friend of Mr. Palliser's mother.\"\n\"I do remember; and that may be a very good reason why she should come here occasionally, or go to Matching, or to any place in which we may be living. It's a bore, of course; but it's a natural bore, and one that ought to be borne.\"\n\"And that will be the beginning and the end of it.\"\n\"I'm afraid not, my dear. It may perhaps be the end of it, but I fear it won't be the beginning. I won't be persecuted. If she gives me advice, I shall tell her to her face that it's not wanted; and if she insults any friend of mine, as she did you, I shall tell her that she had better stay away. She'll go and tell him, of course; but I can't help that. I've made up my mind that I won't be persecuted.\"\nAfter that, Lady Glencora felt no further inclination to show Burgo's letter to Alice on that occasion. They sat over the drawing-room fire, talking chiefly of Alice's affairs, till it was time for them to dress. But Alice, though she spoke much of Mr. Grey, said no word as to her engagement with George Vavasor. How could she speak of it, inasmuch as she had already resolved,--already almost resolved,--that that engagement also should be broken?\nAlice, when she came down to the drawing-room, before dinner, found Mr. Bott there alone. She had dressed more quickly than her friend, and Mr. Palliser had not yet made his appearance.\n\"I did not expect the pleasure of meeting Miss Vavasor to-day,\" he said, as he came up, offering his hand. She gave him her hand, and then sat down, merely muttering some word of reply.\n\"We spent a very pleasant month down at Matching together;--didn't you think so?\"\n\"I spent a pleasant month there certainly.\"\n\"You left, if I remember, the morning after that late walk out among the ruins? That was unfortunate, was it not? Poor Lady Glencora! it made her very ill; so much so, that she could not go to Monkshade, as she particularly wished. It was very sad. Lady Glencora is very delicate,--very delicate, indeed. We, who have the privilege of being near her, ought always to remember that.\"\n\"I don't think she is at all delicate.\"\n\"Oh! don't you? I'm afraid that's your mistake, Miss Vavasor.\"\n\"I believe she has very good health, which is the greatest blessing in the world. By delicate I suppose you mean weak and infirm.\"\n\"Oh, dear, no,--not in the least,--not infirm certainly! I should be very sorry to be supposed to have said that Lady Glencora is infirm. What I mean is, not robust, Miss Vavasor. Her general organization, if you understand me, is exquisitely delicate. One can see that, I think, in every glance of her eye.\"\nAlice was going to protest that she had never seen it at all, when Mr. Palliser entered the room along with Mrs. Marsham.\nThe two gentlemen shook hands, and then Mr. Palliser turned to Alice. She perceived at once by his face that she was unwelcome, and wished herself away from his house. It might be all very well for Lady Glencora to fight with Mrs. Marsham,--and with her husband, too, in regard to the Marsham persecution,--but there could be no reason why she should do so. He just touched her hand, barely closing his thumb upon her fingers, and asked her how she was. Then he turned away from her side of the fire, and began talking to Mrs. Marsham on the other. There was that in his face and in his manner which was positively offensive to her. He made no allusion to his former acquaintance with her,--spoke no word about Matching, no word about his wife, as he would naturally have done to his wife's friend. Alice felt the blood mount into her face, and regretted greatly that she had ever come among these people. Had she not long since made up her mind that she would avoid her great relations, and did not all this prove that it would have been well for her to have clung to that resolution? What was Lady Glencora to her that she should submit herself to be treated as though she were a poor companion,--a dependent, who received a salary for her attendance,--an indigent cousin, hanging on to the bounty of her rich connection? Alice was proud to a fault. She had nursed her pride till it was very faulty. All her troubles and sorrows in life had come from an overfed craving for independence. Why, then, should she submit to be treated with open want of courtesy by any man; but, of all men, why should she submit to it from such a one as Mr. Palliser,--the heir of a ducal house, rolling in wealth, and magnificent with all the magnificence of British pomp and pride? No; she would make Lady Glencora understand that the close intimacies of daily life were not possible to them!\n\"I declare I'm very much ashamed,\" said Lady Glencora, as she entered the room. \"I shan't apologize to you, Alice, for it was you who kept me talking; but I do beg Mrs. Marsham's pardon.\"\nMrs. Marsham was all smiles and forgiveness, and hoped that Lady Glencora would not make a stranger of her. Then dinner was announced, and Alice had to walk down stairs by herself. She did not care a doit for that, but there had been a disagreeable little contest when the moment came. Lady Glencora had wished to give up Mr. Bott to her cousin, but Mr. Bott had stuck manfully to Lady Glencora's side. He hoped to take Lady Glencora down to dinner very often, and was not at all disposed to abate his privilege.\nDuring dinner-time Alice said very little, nor was there given to her opportunity of saying much. She could not but think of the day of her first arrival at Matching Priory, when she had sat between the Duke of St. Bungay and Jeffrey Palliser, and when everybody had been so civil to her! She now occupied one side of the table by herself, away from the fire, where she felt cold and desolate in the gloom of the large half-lighted room. Mr. Palliser occupied himself with Mrs. Marsham, who talked politics to him; and Mr. Bott never lost a moment in his endeavours to say some civil word to Lady Glencora. Lady Glencora gave him no encouragement; but she hardly dared to snub him openly in her husband's immediate presence. Twenty times during dinner she said some little word to Alice, attempting at first to make the time pleasant, and then, when the matter was too far gone for that, attempting to give some relief. But it was of no avail. There are moments in which conversation seems to be impossible,--in which the very gods interfere to put a seal upon the lips of the unfortunate one. It was such a moment now with Alice. She had never as yet been used to snubbing. Whatever position she had hitherto held, in that she had always stood foremost,--much more so than had been good for her. When she had gone to Matching, she had trembled for her position; but there all had gone well with her; there Lady Glencora's kindness had at first been able to secure for her a reception that had been flattering, and almost better than flattering. Jeffrey Palliser had been her friend, and would, had she so willed it, have been more than her friend. But now she felt that the halls of the Pallisers were too cold for her, and that the sooner she escaped from their gloom and hard discourtesy the better for her.\nMrs. Marsham, when the three ladies had returned to the drawing-room together, was a little triumphant. She felt that she had put Alice down; and with the energetic prudence of a good general who knows that he should follow up a victory, let the cost of doing so be what it may, she determined to keep her down. Alice had resolved that she would come as seldom as might be to Mr. Palliser's house in Park Lane. That resolution on her part was in close accordance with Mrs. Marsham's own views.\n\"Is Miss Vavasor going to walk home?\" she asked.\n\"Walk home;--all along Oxford Street! Good gracious! no. Why should she walk? The carriage will take her.\"\n\"Or a cab,\" said Alice. \"I am quite used to go about London in a cab by myself.\"\n\"I don't think they are nice for young ladies after dark,\" said Mrs. Marsham. \"I was going to offer my servant to walk with her. She is an elderly woman, and would not mind it.\"\n\"I'm sure Alice is very much obliged,\" said Lady. Glencora; \"but she will have the carriage.\"\n\"You are very good-natured,\" said Mrs. Marsham; \"but gentlemen do so dislike having their horses out at night.\"\n\"No gentleman's horses will be out,\" said Lady Glencora, savagely; \"and as for mine, it's what they are there for.\" It was not often that Lady Glencora made any allusion to her own property, or allowed any one near her to suppose that she remembered the fact that her husband's great wealth was, in truth, her wealth. As to many matters her mind was wrong. In some things her taste was not delicate as should be that of a woman. But, as regarded her money, no woman could have behaved with greater reticence, or a purer delicacy. But now, when she was twitted by her husband's special friend with ill-usage to her husband's horses, because she chose to send her own friend home in her own carriage, she did find it hard to bear.\n\"I dare say it's all right,\" said Mrs. Marsham.\n\"It is all right,\" said Lady Glencora. \"Mr. Palliser has given me my horses for my own use, to do as I like with them; and if he thinks I take them out when they ought to be left at home, he can tell me so. Nobody else has a right to do it.\" Lady Glencora, by this time, was almost in a passion, and showed that she was so.\n\"My dear Lady Glencora, you have mistaken me,\" said Mrs. Marsham; \"I did not mean anything of that kind.\"\n\"I am so sorry,\" said Alice. \"And it is such a pity, as I am quite used to going about in cabs.\"\n\"Of course you are,\" said Lady Glencora. \"Why shouldn't you? I'd go home in a wheelbarrow if I couldn't walk, and had no other conveyance. That's not the question. Mrs. Marsham understands that.\"\n\"Upon my word, I don't understand anything,\" said that lady.\n\"I understand this,\" said Lady Glencora; \"that in all such matters as that, I intend to follow my own pleasure. Come, Alice, let us have some coffee,\"--and she rang the bell. \"What a fuss we have made about a stupid old carriage!\"\nThe gentlemen did not return to the drawing-room that evening, having, no doubt, joint work to do in arranging the great financial calculations of the nation; and, at an early hour, Alice was taken home in Lady Glencora's brougham, leaving her cousin still in the hands of Mrs. Marsham.",
        "paragraph_chars": [
            [
                0,
                1163
            ],
            [
                1163,
                1393
            ],
            [
                1393,
                3353
            ],
            [
                3353,
                3734
            ],
            [
                3734,
                3894
            ],
            [
                3894,
                4051
            ],
            [
                4051,
                4216
            ],
            [
                4216,
                4249
            ],
            [
                4249,
                4421
            ],
            [
                4421,
                4470
            ],
            [
                4470,
                4619
            ],
            [
                4619,
                4722
            ],
            [
                4722,
                4849
            ],
            [
                4849,
                5833
            ],
            [
                5833,
                6596
            ],
            [
                6596,
                7247
            ],
            [
                7247,
                7361
            ],
            [
                7361,
                7638
            ],
            [
                7638,
                7758
            ],
            [
                7758,
                7793
            ],
            [
                7793,
                7886
            ],
            [
                7886,
                7981
            ],
            [
                7981,
                8173
            ],
            [
                8173,
                8219
            ],
            [
                8219,
                8323
            ],
            [
                8323,
                8351
            ],
            [
                8351,
                8378
            ],
            [
                8378,
                8501
            ],
            [
                8501,
                8744
            ],
            [
                8744,
                8771
            ],
            [
                8771,
                8906
            ],
            [
                8906,
                8946
            ],
            [
                8946,
                9148
            ],
            [
                9148,
                9178
            ],
            [
                9178,
                9460
            ],
            [
                9460,
                9491
            ],
            [
                9491,
                9568
            ],
            [
                9568,
                9697
            ],
            [
                9697,
                9721
            ],
            [
                9721,
                9830
            ],
            [
                9830,
                10000
            ],
            [
                10000,
                10035
            ],
            [
                10035,
                10132
            ],
            [
                10132,
                10293
            ],
            [
                10293,
                10500
            ],
            [
                10500,
                10785
            ],
            [
                10785,
                11417
            ],
            [
                11417,
                13635
            ],
            [
                13635,
                15179
            ],
            [
                15179,
                15711
            ],
            [
                15711,
                16152
            ],
            [
                16152,
                16306
            ],
            [
                16306,
                16371
            ],
            [
                16371,
                16468
            ],
            [
                16468,
                16586
            ],
            [
                16586,
                16645
            ],
            [
                16645,
                16830
            ],
            [
                16830,
                16990
            ],
            [
                16990,
                17438
            ],
            [
                17438,
                17544
            ],
            [
                17544,
                17656
            ],
            [
                17656,
                17699
            ],
            [
                17699,
                17824
            ],
            [
                17824,
                17958
            ],
            [
                17958,
                18007
            ],
            [
                18007,
                18044
            ],
            [
                18044,
                18299
            ],
            [
                18299,
                18430
            ],
            [
                18430,
                18585
            ],
            [
                18585,
                18815
            ],
            [
                18815,
                19076
            ],
            [
                19076,
                19170
            ],
            [
                19170,
                19358
            ],
            [
                19358,
                19867
            ],
            [
                19867,
                20375
            ],
            [
                20375,
                20414
            ],
            [
                20414,
                20678
            ],
            [
                20678,
                20757
            ],
            [
                20757,
                20991
            ],
            [
                20991,
                21043
            ],
            [
                21043,
                21449
            ],
            [
                21449,
                21899
            ],
            [
                21899,
                22085
            ],
            [
                22085,
                22271
            ],
            [
                22271,
                22353
            ],
            [
                22353,
                22397
            ],
            [
                22397,
                22780
            ],
            [
                22780,
                22820
            ],
            [
                22820,
                22883
            ],
            [
                22883,
                23014
            ],
            [
                23014,
                23323
            ],
            [
                23323,
                23445
            ],
            [
                23445,
                25322
            ],
            [
                25322,
                25510
            ],
            [
                25510,
                26023
            ],
            [
                26023,
                27834
            ],
            [
                27834,
                28328
            ],
            [
                28328,
                28377
            ],
            [
                28377,
                28484
            ],
            [
                28484,
                28565
            ],
            [
                28565,
                28743
            ],
            [
                28743,
                28837
            ],
            [
                28837,
                28949
            ],
            [
                28949,
                29678
            ],
            [
                29678,
                29726
            ],
            [
                29726,
                30050
            ],
            [
                30050,
                30156
            ],
            [
                30156,
                30253
            ],
            [
                30253,
                30449
            ],
            [
                30449,
                30510
            ],
            [
                30510,
                30741
            ],
            [
                30741,
                31027
            ]
        ],
        "segment_chars": [
            [
                0,
                77
            ],
            [
                77,
                340
            ],
            [
                340,
                534
            ],
            [
                534,
                618
            ],
            [
                618,
                732
            ],
            [
                732,
                799
            ],
            [
                799,
                952
            ],
            [
                952,
                1163
            ],
            [
                1163,
                1300
            ],
            [
                1300,
                1393
            ],
            [
                1393,
                1481
            ],
            [
                1481,
                1608
            ],
            [
                1608,
                1701
            ],
            [
                1701,
                1868
            ],
            [
                1868,
                1940
            ],
            [
                1940,
                2117
            ],
            [
                2117,
                2271
            ],
            [
                2271,
                2305
            ],
            [
                2305,
                2464
            ],
            [
                2464,
                2678
            ],
            [
                2678,
                2812
            ],
            [
                2812,
                3011
            ],
            [
                3011,
                3062
            ],
            [
                3062,
                3193
            ],
            [
                3193,
                3225
            ],
            [
                3225,
                3271
            ],
            [
                3271,
                3353
            ],
            [
                3353,
                3535
            ],
            [
                3535,
                3559
            ],
            [
                3559,
                3598
            ],
            [
                3598,
                3734
            ],
            [
                3734,
                3769
            ],
            [
                3769,
                3809
            ],
            [
                3809,
                3894
            ],
            [
                3894,
                3965
            ],
            [
                3965,
                4016
            ],
            [
                4016,
                4051
            ],
            [
                4051,
                4091
            ],
            [
                4091,
                4216
            ],
            [
                4216,
                4249
            ],
            [
                4249,
                4287
            ],
            [
                4287,
                4421
            ],
            [
                4421,
                4450
            ],
            [
                4450,
                4470
            ],
            [
                4470,
                4521
            ],
            [
                4521,
                4559
            ],
            [
                4559,
                4619
            ],
            [
                4619,
                4722
            ],
            [
                4722,
                4737
            ],
            [
                4737,
                4755
            ],
            [
                4755,
                4849
            ],
            [
                4849,
                4935
            ],
            [
                4935,
                5086
            ],
            [
                5086,
                5134
            ],
            [
                5134,
                5330
            ],
            [
                5330,
                5551
            ],
            [
                5551,
                5584
            ],
            [
                5584,
                5706
            ],
            [
                5706,
                5833
            ],
            [
                5833,
                6014
            ],
            [
                6014,
                6384
            ],
            [
                6384,
                6490
            ],
            [
                6490,
                6596
            ],
            [
                6596,
                6668
            ],
            [
                6668,
                6895
            ],
            [
                6895,
                7026
            ],
            [
                7026,
                7045
            ],
            [
                7045,
                7247
            ],
            [
                7247,
                7361
            ],
            [
                7361,
                7385
            ],
            [
                7385,
                7405
            ],
            [
                7405,
                7466
            ],
            [
                7466,
                7514
            ],
            [
                7514,
                7638
            ],
            [
                7638,
                7758
            ],
            [
                7758,
                7793
            ],
            [
                7793,
                7812
            ],
            [
                7812,
                7886
            ],
            [
                7886,
                7899
            ],
            [
                7899,
                7981
            ],
            [
                7981,
                7995
            ],
            [
                7995,
                8049
            ],
            [
                8049,
                8119
            ],
            [
                8119,
                8147
            ],
            [
                8147,
                8173
            ],
            [
                8173,
                8219
            ],
            [
                8219,
                8271
            ],
            [
                8271,
                8323
            ],
            [
                8323,
                8351
            ],
            [
                8351,
                8378
            ],
            [
                8378,
                8413
            ],
            [
                8413,
                8433
            ],
            [
                8433,
                8501
            ],
            [
                8501,
                8551
            ],
            [
                8551,
                8585
            ],
            [
                8585,
                8688
            ],
            [
                8688,
                8744
            ],
            [
                8744,
                8764
            ],
            [
                8764,
                8771
            ],
            [
                8771,
                8815
            ],
            [
                8815,
                8891
            ],
            [
                8891,
                8906
            ],
            [
                8906,
                8946
            ],
            [
                8946,
                8975
            ],
            [
                8975,
                9025
            ],
            [
                9025,
                9122
            ],
            [
                9122,
                9148
            ],
            [
                9148,
                9178
            ],
            [
                9178,
                9204
            ],
            [
                9204,
                9216
            ],
            [
                9216,
                9276
            ],
            [
                9276,
                9337
            ],
            [
                9337,
                9361
            ],
            [
                9361,
                9460
            ],
            [
                9460,
                9491
            ],
            [
                9491,
                9515
            ],
            [
                9515,
                9568
            ],
            [
                9568,
                9591
            ],
            [
                9591,
                9697
            ],
            [
                9697,
                9721
            ],
            [
                9721,
                9830
            ],
            [
                9830,
                9866
            ],
            [
                9866,
                9929
            ],
            [
                9929,
                10000
            ],
            [
                10000,
                10035
            ],
            [
                10035,
                10067
            ],
            [
                10067,
                10085
            ],
            [
                10085,
                10120
            ],
            [
                10120,
                10132
            ],
            [
                10132,
                10293
            ],
            [
                10293,
                10335
            ],
            [
                10335,
                10500
            ],
            [
                10500,
                10519
            ],
            [
                10519,
                10538
            ],
            [
                10538,
                10648
            ],
            [
                10648,
                10681
            ],
            [
                10681,
                10709
            ],
            [
                10709,
                10785
            ],
            [
                10785,
                10836
            ],
            [
                10836,
                11045
            ],
            [
                11045,
                11110
            ],
            [
                11110,
                11173
            ],
            [
                11173,
                11250
            ],
            [
                11250,
                11417
            ],
            [
                11417,
                11491
            ],
            [
                11491,
                11612
            ],
            [
                11612,
                11715
            ],
            [
                11715,
                11894
            ],
            [
                11894,
                11929
            ],
            [
                11929,
                11990
            ],
            [
                11990,
                12078
            ],
            [
                12078,
                12232
            ],
            [
                12232,
                12406
            ],
            [
                12406,
                12560
            ],
            [
                12560,
                12717
            ],
            [
                12717,
                13051
            ],
            [
                13051,
                13290
            ],
            [
                13290,
                13533
            ],
            [
                13533,
                13635
            ],
            [
                13635,
                13747
            ],
            [
                13747,
                13811
            ],
            [
                13811,
                13881
            ],
            [
                13881,
                13986
            ],
            [
                13986,
                14184
            ],
            [
                14184,
                14369
            ],
            [
                14369,
                14664
            ],
            [
                14664,
                14815
            ],
            [
                14815,
                14998
            ],
            [
                14998,
                15179
            ],
            [
                15179,
                15325
            ],
            [
                15325,
                15566
            ],
            [
                15566,
                15671
            ],
            [
                15671,
                15711
            ],
            [
                15711,
                15900
            ],
            [
                15900,
                16152
            ],
            [
                16152,
                16306
            ],
            [
                16306,
                16371
            ],
            [
                16371,
                16396
            ],
            [
                16396,
                16415
            ],
            [
                16415,
                16468
            ],
            [
                16468,
                16524
            ],
            [
                16524,
                16586
            ],
            [
                16586,
                16645
            ],
            [
                16645,
                16830
            ],
            [
                16830,
                16867
            ],
            [
                16867,
                16947
            ],
            [
                16947,
                16990
            ],
            [
                16990,
                17034
            ],
            [
                17034,
                17078
            ],
            [
                17078,
                17268
            ],
            [
                17268,
                17438
            ],
            [
                17438,
                17544
            ],
            [
                17544,
                17598
            ],
            [
                17598,
                17656
            ],
            [
                17656,
                17699
            ],
            [
                17699,
                17824
            ],
            [
                17824,
                17867
            ],
            [
                17867,
                17958
            ],
            [
                17958,
                18007
            ],
            [
                18007,
                18044
            ],
            [
                18044,
                18299
            ],
            [
                18299,
                18399
            ],
            [
                18399,
                18430
            ],
            [
                18430,
                18585
            ],
            [
                18585,
                18679
            ],
            [
                18679,
                18815
            ],
            [
                18815,
                18855
            ],
            [
                18855,
                18884
            ],
            [
                18884,
                18996
            ],
            [
                18996,
                19076
            ],
            [
                19076,
                19131
            ],
            [
                19131,
                19170
            ],
            [
                19170,
                19217
            ],
            [
                19217,
                19239
            ],
            [
                19239,
                19358
            ],
            [
                19358,
                19446
            ],
            [
                19446,
                19475
            ],
            [
                19475,
                19525
            ],
            [
                19525,
                19609
            ],
            [
                19609,
                19641
            ],
            [
                19641,
                19867
            ],
            [
                19867,
                20103
            ],
            [
                20103,
                20133
            ],
            [
                20133,
                20209
            ],
            [
                20209,
                20271
            ],
            [
                20271,
                20375
            ],
            [
                20375,
                20414
            ],
            [
                20414,
                20490
            ],
            [
                20490,
                20545
            ],
            [
                20545,
                20571
            ],
            [
                20571,
                20678
            ],
            [
                20678,
                20757
            ],
            [
                20757,
                20909
            ],
            [
                20909,
                20991
            ],
            [
                20991,
                21043
            ],
            [
                21043,
                21069
            ],
            [
                21069,
                21140
            ],
            [
                21140,
                21163
            ],
            [
                21163,
                21341
            ],
            [
                21341,
                21399
            ],
            [
                21399,
                21449
            ],
            [
                21449,
                21553
            ],
            [
                21553,
                21662
            ],
            [
                21662,
                21763
            ],
            [
                21763,
                21899
            ],
            [
                21899,
                21989
            ],
            [
                21989,
                22085
            ],
            [
                22085,
                22192
            ],
            [
                22192,
                22271
            ],
            [
                22271,
                22353
            ],
            [
                22353,
                22397
            ],
            [
                22397,
                22477
            ],
            [
                22477,
                22511
            ],
            [
                22511,
                22531
            ],
            [
                22531,
                22629
            ],
            [
                22629,
                22646
            ],
            [
                22646,
                22702
            ],
            [
                22702,
                22780
            ],
            [
                22780,
                22820
            ],
            [
                22820,
                22825
            ],
            [
                22825,
                22836
            ],
            [
                22836,
                22883
            ],
            [
                22883,
                22965
            ],
            [
                22965,
                23014
            ],
            [
                23014,
                23071
            ],
            [
                23071,
                23152
            ],
            [
                23152,
                23194
            ],
            [
                23194,
                23267
            ],
            [
                23267,
                23323
            ],
            [
                23323,
                23445
            ],
            [
                23445,
                23515
            ],
            [
                23515,
                23613
            ],
            [
                23613,
                23803
            ],
            [
                23803,
                23899
            ],
            [
                23899,
                23994
            ],
            [
                23994,
                24078
            ],
            [
                24078,
                24244
            ],
            [
                24244,
                24351
            ],
            [
                24351,
                24531
            ],
            [
                24531,
                24769
            ],
            [
                24769,
                24797
            ],
            [
                24797,
                24847
            ],
            [
                24847,
                24935
            ],
            [
                24935,
                25211
            ],
            [
                25211,
                25322
            ],
            [
                25322,
                25402
            ],
            [
                25402,
                25510
            ],
            [
                25510,
                25618
            ],
            [
                25618,
                25691
            ],
            [
                25691,
                25796
            ],
            [
                25796,
                25913
            ],
            [
                25913,
                26023
            ],
            [
                26023,
                26121
            ],
            [
                26121,
                26312
            ],
            [
                26312,
                26461
            ],
            [
                26461,
                26630
            ],
            [
                26630,
                26748
            ],
            [
                26748,
                26943
            ],
            [
                26943,
                26967
            ],
            [
                26967,
                27117
            ],
            [
                27117,
                27154
            ],
            [
                27154,
                27198
            ],
            [
                27198,
                27320
            ],
            [
                27320,
                27569
            ],
            [
                27569,
                27672
            ],
            [
                27672,
                27834
            ],
            [
                27834,
                27938
            ],
            [
                27938,
                28146
            ],
            [
                28146,
                28245
            ],
            [
                28245,
                28328
            ],
            [
                28328,
                28366
            ],
            [
                28366,
                28377
            ],
            [
                28377,
                28415
            ],
            [
                28415,
                28430
            ],
            [
                28430,
                28434
            ],
            [
                28434,
                28455
            ],
            [
                28455,
                28484
            ],
            [
                28484,
                28508
            ],
            [
                28508,
                28565
            ],
            [
                28565,
                28643
            ],
            [
                28643,
                28694
            ],
            [
                28694,
                28743
            ],
            [
                28743,
                28793
            ],
            [
                28793,
                28837
            ],
            [
                28837,
                28949
            ],
            [
                28949,
                29065
            ],
            [
                29065,
                29267
            ],
            [
                29267,
                29306
            ],
            [
                29306,
                29378
            ],
            [
                29378,
                29479
            ],
            [
                29479,
                29678
            ],
            [
                29678,
                29726
            ],
            [
                29726,
                29765
            ],
            [
                29765,
                29933
            ],
            [
                29933,
                29968
            ],
            [
                29968,
                30050
            ],
            [
                30050,
                30156
            ],
            [
                30156,
                30185
            ],
            [
                30185,
                30253
            ],
            [
                30253,
                30294
            ],
            [
                30294,
                30314
            ],
            [
                30314,
                30392
            ],
            [
                30392,
                30417
            ],
            [
                30417,
                30449
            ],
            [
                30449,
                30510
            ],
            [
                30510,
                30622
            ],
            [
                30622,
                30685
            ],
            [
                30685,
                30741
            ],
            [
                30741,
                31027
            ]
        ],
        "overlap_chars": [
            [
                0,
                64
            ],
            [
                70,
                77
            ],
            [
                77,
                99
            ],
            [
                103,
                133
            ],
            [
                142,
                157
            ],
            [
                169,
                173
            ],
            [
                187,
                230
            ],
            [
                235,
                239
            ],
            [
                263,
                266
            ],
            [
                311,
                340
            ],
            [
                534,
                540
            ],
            [
                513,
                516
            ],
            [
                358,
                365
            ],
            [
                404,
                408
            ],
            [
                380,
                383
            ],
            [
                366,
                379
            ],
            [
                555,
                570
            ],
            [
                607,
                618
            ],
            [
                671,
                706
            ],
            [
                730,
                732
            ],
            [
                732,
                735
            ],
            [
                740,
                743
            ],
            [
                736,
                739
            ],
            [
                744,
                779
            ],
            [
                784,
                786
            ],
            [
                780,
                783
            ],
            [
                787,
                799
            ],
            [
                952,
                1163
            ],
            [
                1163,
                1265
            ],
            [
                1296,
                1300
            ],
            [
                1300,
                1324
            ],
            [
                1327,
                1383
            ],
            [
                1390,
                1393
            ],
            [
                1393,
                1405
            ],
            [
                1414,
                1427
            ],
            [
                1450,
                1481
            ],
            [
                1481,
                1498
            ],
            [
                1520,
                1551
            ],
            [
                1553,
                1608
            ],
            [
                1608,
                1681
            ],
            [
                1691,
                1701
            ],
            [
                1701,
                1724
            ],
            [
                1745,
                1782
            ],
            [
                1788,
                1799
            ],
            [
                1833,
                1836
            ],
            [
                1866,
                1868
            ],
            [
                1868,
                1921
            ],
            [
                1938,
                1940
            ],
            [
                1940,
                2064
            ],
            [
                2106,
                2109
            ],
            [
                2069,
                2075
            ],
            [
                2110,
                2117
            ],
            [
                2117,
                2230
            ],
            [
                2249,
                2271
            ],
            [
                2271,
                2304
            ],
            [
                2309,
                2312
            ],
            [
                2305,
                2308
            ],
            [
                2313,
                2363
            ],
            [
                2429,
                2464
            ],
            [
                2812,
                2830
            ],
            [
                2834,
                2963
            ],
            [
                2831,
                2833
            ],
            [
                2985,
                2988
            ],
            [
                2994,
                2996
            ],
            [
                3009,
                3010
            ],
            [
                3353,
                3374
            ],
            [
                3383,
                3460
            ],
            [
                3502,
                3505
            ],
            [
                3465,
                3468
            ],
            [
                3481,
                3497
            ],
            [
                3506,
                3535
            ],
            [
                3535,
                3559
            ],
            [
                3559,
                3598
            ],
            [
                3598,
                3642
            ],
            [
                3685,
                3686
            ],
            [
                3691,
                3695
            ],
            [
                3700,
                3734
            ],
            [
                3734,
                3769
            ],
            [
                3769,
                3807
            ],
            [
                3818,
                3819
            ],
            [
                3857,
                3862
            ],
            [
                3809,
                3818
            ],
            [
                3892,
                3894
            ],
            [
                3894,
                3963
            ],
            [
                4051,
                4091
            ],
            [
                4101,
                4216
            ],
            [
                4216,
                4226
            ],
            [
                4236,
                4249
            ],
            [
                4249,
                4287
            ],
            [
                4287,
                4305
            ],
            [
                4336,
                4345
            ],
            [
                4390,
                4421
            ],
            [
                4421,
                4450
            ],
            [
                4450,
                4470
            ],
            [
                4470,
                4491
            ],
            [
                4519,
                4521
            ],
            [
                4525,
                4526
            ],
            [
                4521,
                4524
            ],
            [
                4534,
                4557
            ],
            [
                4619,
                4647
            ],
            [
                4654,
                4722
            ],
            [
                4722,
                4737
            ],
            [
                4737,
                4755
            ],
            [
                4755,
                4819
            ],
            [
                4822,
                4828
            ],
            [
                4834,
                4839
            ],
            [
                4847,
                4849
            ],
            [
                4849,
                4935
            ],
            [
                4944,
                5002
            ],
            [
                5021,
                5044
            ],
            [
                5050,
                5063
            ],
            [
                5084,
                5086
            ],
            [
                5086,
                5134
            ],
            [
                5134,
                5158
            ],
            [
                5164,
                5167
            ],
            [
                5180,
                5187
            ],
            [
                5190,
                5193
            ],
            [
                5264,
                5306
            ],
            [
                5175,
                5179
            ],
            [
                5328,
                5330
            ],
            [
                5330,
                5353
            ],
            [
                5385,
                5389
            ],
            [
                5417,
                5444
            ],
            [
                5480,
                5485
            ],
            [
                5490,
                5502
            ],
            [
                5509,
                5551
            ],
            [
                5551,
                5584
            ],
            [
                5584,
                5621
            ],
            [
                5630,
                5632
            ],
            [
                5704,
                5706
            ],
            [
                5706,
                5709
            ],
            [
                5717,
                5720
            ],
            [
                5738,
                5752
            ],
            [
                5765,
                5771
            ],
            [
                5796,
                5833
            ],
            [
                6596,
                6668
            ],
            [
                6668,
                6796
            ],
            [
                6812,
                6814
            ],
            [
                6797,
                6811
            ],
            [
                6827,
                6828
            ],
            [
                6815,
                6817
            ],
            [
                6893,
                6895
            ],
            [
                6895,
                6923
            ],
            [
                6928,
                6932
            ],
            [
                6924,
                6927
            ],
            [
                6949,
                6967
            ],
            [
                7024,
                7026
            ],
            [
                7072,
                7130
            ],
            [
                7133,
                7161
            ],
            [
                7179,
                7183
            ],
            [
                7186,
                7201
            ],
            [
                7176,
                7178
            ],
            [
                7212,
                7215
            ],
            [
                7245,
                7247
            ],
            [
                7247,
                7327
            ],
            [
                7340,
                7361
            ],
            [
                7361,
                7385
            ],
            [
                7385,
                7405
            ],
            [
                7405,
                7466
            ],
            [
                7466,
                7513
            ],
            [
                7514,
                7519
            ],
            [
                7544,
                7593
            ],
            [
                7616,
                7617
            ],
            [
                7618,
                7638
            ],
            [
                7638,
                7755
            ],
            [
                7836,
                7838
            ],
            [
                7826,
                7828
            ],
            [
                7883,
                7886
            ],
            [
                7886,
                7892
            ],
            [
                7897,
                7899
            ],
            [
                7899,
                7917
            ],
            [
                7934,
                7981
            ],
            [
                7981,
                7982
            ],
            [
                7986,
                7995
            ],
            [
                7995,
                8026
            ],
            [
                8028,
                8049
            ],
            [
                8182,
                8207
            ],
            [
                8323,
                8348
            ],
            [
                8433,
                8501
            ],
            [
                8501,
                8551
            ],
            [
                8551,
                8576
            ],
            [
                8583,
                8585
            ],
            [
                8692,
                8744
            ],
            [
                8744,
                8745
            ],
            [
                8760,
                8768
            ],
            [
                8748,
                8753
            ],
            [
                8768,
                8771
            ],
            [
                8771,
                8815
            ],
            [
                8815,
                8843
            ],
            [
                8856,
                8880
            ],
            [
                8891,
                8906
            ],
            [
                8906,
                8924
            ],
            [
                8931,
                8946
            ],
            [
                8975,
                9009
            ],
            [
                9016,
                9025
            ],
            [
                9025,
                9101
            ],
            [
                9109,
                9111
            ],
            [
                9120,
                9122
            ],
            [
                9122,
                9145
            ],
            [
                9216,
                9276
            ],
            [
                9276,
                9319
            ],
            [
                9337,
                9361
            ],
            [
                9361,
                9460
            ],
            [
                9460,
                9491
            ],
            [
                9491,
                9515
            ],
            [
                9515,
                9568
            ],
            [
                9721,
                9776
            ],
            [
                9778,
                9830
            ],
            [
                9830,
                9831
            ],
            [
                9835,
                9866
            ],
            [
                9929,
                10000
            ],
            [
                10000,
                10035
            ],
            [
                10035,
                10049
            ],
            [
                10065,
                10067
            ],
            [
                10085,
                10120
            ],
            [
                10120,
                10132
            ],
            [
                10132,
                10293
            ],
            [
                10500,
                10519
            ],
            [
                10519,
                10538
            ],
            [
                10538,
                10648
            ],
            [
                10648,
                10681
            ],
            [
                10681,
                10709
            ],
            [
                10709,
                10723
            ],
            [
                10764,
                10768
            ],
            [
                10724,
                10743
            ],
            [
                10783,
                10785
            ],
            [
                10785,
                10836
            ],
            [
                10836,
                10888
            ],
            [
                10889,
                10906
            ],
            [
                10931,
                10935
            ],
            [
                10943,
                10958
            ],
            [
                10936,
                10942
            ],
            [
                10958,
                10967
            ],
            [
                11043,
                11045
            ],
            [
                11045,
                11110
            ],
            [
                11110,
                11113
            ],
            [
                11131,
                11173
            ],
            [
                11173,
                11212
            ],
            [
                11214,
                11224
            ],
            [
                11226,
                11250
            ],
            [
                11250,
                11417
            ],
            [
                11417,
                11444
            ],
            [
                11459,
                11491
            ],
            [
                11491,
                11498
            ],
            [
                11526,
                11545
            ],
            [
                11620,
                11636
            ],
            [
                11561,
                11569
            ],
            [
                11713,
                11715
            ],
            [
                11715,
                11728
            ],
            [
                11747,
                11789
            ],
            [
                11822,
                11829
            ],
            [
                11833,
                11856
            ],
            [
                11812,
                11815
            ],
            [
                11879,
                11894
            ],
            [
                11894,
                11929
            ],
            [
                12008,
                12017
            ],
            [
                11995,
                11998
            ],
            [
                12023,
                12028
            ],
            [
                12033,
                12077
            ],
            [
                12078,
                12090
            ],
            [
                12101,
                12107
            ],
            [
                12147,
                12232
            ],
            [
                12232,
                12271
            ],
            [
                12285,
                12308
            ],
            [
                12350,
                12351
            ],
            [
                12310,
                12313
            ],
            [
                12352,
                12381
            ],
            [
                12387,
                12406
            ],
            [
                12406,
                12471
            ],
            [
                12491,
                12502
            ],
            [
                12512,
                12519
            ],
            [
                12548,
                12559
            ],
            [
                12560,
                12571
            ],
            [
                12599,
                12603
            ],
            [
                12611,
                12626
            ],
            [
                12812,
                12892
            ],
            [
                12771,
                12774
            ],
            [
                12993,
                13030
            ],
            [
                13035,
                13051
            ],
            [
                13051,
                13064
            ],
            [
                13133,
                13138
            ],
            [
                13190,
                13196
            ],
            [
                13157,
                13160
            ],
            [
                13166,
                13179
            ],
            [
                13065,
                13068
            ],
            [
                13079,
                13086
            ],
            [
                13214,
                13226
            ],
            [
                13235,
                13290
            ],
            [
                13290,
                13419
            ],
            [
                13453,
                13456
            ],
            [
                13490,
                13533
            ],
            [
                13533,
                13564
            ],
            [
                13567,
                13600
            ],
            [
                13603,
                13635
            ],
            [
                13635,
                13679
            ],
            [
                13693,
                13729
            ],
            [
                13733,
                13736
            ],
            [
                13737,
                13747
            ],
            [
                13811,
                13843
            ],
            [
                13963,
                13986
            ],
            [
                14184,
                14229
            ],
            [
                14316,
                14319
            ],
            [
                14249,
                14265
            ],
            [
                14367,
                14369
            ],
            [
                14425,
                14482
            ],
            [
                14593,
                14594
            ],
            [
                14389,
                14391
            ],
            [
                14509,
                14511
            ],
            [
                14521,
                14523
            ],
            [
                14662,
                14664
            ],
            [
                14664,
                14713
            ],
            [
                14727,
                14815
            ],
            [
                14815,
                14893
            ],
            [
                14911,
                14913
            ],
            [
                14906,
                14910
            ],
            [
                14917,
                14925
            ],
            [
                14996,
                14997
            ],
            [
                15179,
                15184
            ],
            [
                15194,
                15217
            ],
            [
                15235,
                15285
            ],
            [
                15294,
                15325
            ],
            [
                15325,
                15337
            ],
            [
                15366,
                15469
            ],
            [
                15535,
                15566
            ],
            [
                15566,
                15659
            ],
            [
                15669,
                15671
            ],
            [
                15671,
                15711
            ],
            [
                15711,
                15819
            ],
            [
                15822,
                15899
            ],
            [
                16152,
                16306
            ],
            [
                16306,
                16371
            ],
            [
                16371,
                16396
            ],
            [
                16396,
                16415
            ],
            [
                16415,
                16420
            ],
            [
                16454,
                16468
            ],
            [
                16468,
                16524
            ],
            [
                16524,
                16586
            ],
            [
                16586,
                16645
            ],
            [
                16645,
                16723
            ],
            [
                16828,
                16830
            ],
            [
                16830,
                16831
            ],
            [
                16844,
                16867
            ],
            [
                16867,
                16869
            ],
            [
                16885,
                16890
            ],
            [
                16898,
                16900
            ],
            [
                16927,
                16937
            ],
            [
                16945,
                16947
            ],
            [
                16947,
                16978
            ],
            [
                16987,
                16990
            ],
            [
                16990,
                17034
            ],
            [
                17083,
                17112
            ],
            [
                17119,
                17152
            ],
            [
                17154,
                17195
            ],
            [
                17243,
                17267
            ],
            [
                17438,
                17485
            ],
            [
                17498,
                17544
            ],
            [
                17544,
                17582
            ],
            [
                17584,
                17597
            ],
            [
                17656,
                17698
            ],
            [
                17867,
                17893
            ],
            [
                17906,
                17917
            ],
            [
                17894,
                17904
            ],
            [
                17918,
                17958
            ],
            [
                17958,
                18007
            ],
            [
                18007,
                18044
            ],
            [
                18044,
                18045
            ],
            [
                18049,
                18100
            ],
            [
                18116,
                18141
            ],
            [
                18148,
                18299
            ],
            [
                18299,
                18399
            ],
            [
                18399,
                18430
            ],
            [
                18430,
                18482
            ],
            [
                18498,
                18502
            ],
            [
                18535,
                18585
            ],
            [
                18585,
                18613
            ],
            [
                18628,
                18679
            ],
            [
                18679,
                18728
            ],
            [
                18747,
                18815
            ],
            [
                18815,
                18855
            ],
            [
                18855,
                18884
            ],
            [
                18884,
                18994
            ],
            [
                19076,
                19131
            ],
            [
                19131,
                19170
            ],
            [
                19170,
                19183
            ],
            [
                19194,
                19215
            ],
            [
                19224,
                19225
            ],
            [
                19320,
                19358
            ],
            [
                19358,
                19446
            ],
            [
                19446,
                19475
            ],
            [
                19525,
                19609
            ],
            [
                19609,
                19641
            ],
            [
                19641,
                19750
            ],
            [
                19752,
                19799
            ],
            [
                19865,
                19867
            ],
            [
                19867,
                19956
            ],
            [
                19969,
                19990
            ],
            [
                20035,
                20087
            ],
            [
                20096,
                20103
            ],
            [
                20209,
                20217
            ],
            [
                20225,
                20271
            ],
            [
                20271,
                20317
            ],
            [
                20372,
                20375
            ],
            [
                20375,
                20414
            ],
            [
                20414,
                20430
            ],
            [
                20449,
                20490
            ],
            [
                20490,
                20496
            ],
            [
                20515,
                20537
            ],
            [
                20552,
                20555
            ],
            [
                20556,
                20571
            ],
            [
                20571,
                20609
            ],
            [
                20638,
                20678
            ],
            [
                20678,
                20711
            ],
            [
                20719,
                20757
            ],
            [
                20757,
                20771
            ],
            [
                20907,
                20909
            ],
            [
                21140,
                21163
            ],
            [
                21163,
                21203
            ],
            [
                21216,
                21276
            ],
            [
                21293,
                21309
            ],
            [
                21204,
                21206
            ],
            [
                21330,
                21339
            ],
            [
                21449,
                21534
            ],
            [
                21551,
                21553
            ],
            [
                21553,
                21662
            ],
            [
                21662,
                21671
            ],
            [
                21708,
                21720
            ],
            [
                21727,
                21763
            ],
            [
                21763,
                21789
            ],
            [
                21855,
                21859
            ],
            [
                21802,
                21817
            ],
            [
                21837,
                21852
            ],
            [
                21860,
                21864
            ],
            [
                21865,
                21875
            ],
            [
                21881,
                21899
            ],
            [
                21906,
                21910
            ],
            [
                21899,
                21904
            ],
            [
                21915,
                21944
            ],
            [
                21946,
                21960
            ],
            [
                21911,
                21914
            ],
            [
                21961,
                21988
            ],
            [
                22085,
                22139
            ],
            [
                22146,
                22156
            ],
            [
                22171,
                22192
            ],
            [
                22192,
                22204
            ],
            [
                22213,
                22233
            ],
            [
                22241,
                22271
            ],
            [
                22271,
                22302
            ],
            [
                22308,
                22329
            ],
            [
                22331,
                22353
            ],
            [
                22353,
                22397
            ],
            [
                22397,
                22477
            ],
            [
                22477,
                22511
            ],
            [
                22511,
                22531
            ],
            [
                22531,
                22555
            ],
            [
                22565,
                22629
            ],
            [
                22629,
                22646
            ],
            [
                22646,
                22676
            ],
            [
                22694,
                22702
            ],
            [
                22702,
                22704
            ],
            [
                22748,
                22780
            ],
            [
                22780,
                22817
            ],
            [
                22884,
                22918
            ],
            [
                22963,
                22965
            ],
            [
                22965,
                23014
            ],
            [
                23014,
                23028
            ],
            [
                23030,
                23046
            ],
            [
                23049,
                23071
            ],
            [
                23152,
                23192
            ],
            [
                23323,
                23349
            ],
            [
                23383,
                23445
            ],
            [
                23445,
                23515
            ],
            [
                23515,
                23613
            ],
            [
                23803,
                23827
            ],
            [
                23870,
                23899
            ],
            [
                23899,
                23918
            ],
            [
                23944,
                23992
            ],
            [
                23928,
                23932
            ],
            [
                23992,
                23994
            ],
            [
                24078,
                24080
            ],
            [
                24142,
                24243
            ],
            [
                24244,
                24330
            ],
            [
                24349,
                24351
            ],
            [
                24355,
                24358
            ],
            [
                24474,
                24478
            ],
            [
                24412,
                24431
            ],
            [
                24531,
                24576
            ],
            [
                24595,
                24605
            ],
            [
                24625,
                24642
            ],
            [
                24646,
                24655
            ],
            [
                24728,
                24730
            ],
            [
                24734,
                24769
            ],
            [
                24769,
                24784
            ],
            [
                24795,
                24797
            ],
            [
                24797,
                24847
            ],
            [
                24935,
                24966
            ],
            [
                24983,
                24987
            ],
            [
                24993,
                25007
            ],
            [
                25067,
                25094
            ],
            [
                25123,
                25140
            ],
            [
                25142,
                25145
            ],
            [
                25171,
                25183
            ],
            [
                25209,
                25211
            ],
            [
                25215,
                25259
            ],
            [
                25264,
                25269
            ],
            [
                25300,
                25312
            ],
            [
                25322,
                25400
            ],
            [
                25400,
                25402
            ],
            [
                25402,
                25403
            ],
            [
                25477,
                25510
            ],
            [
                25510,
                25553
            ],
            [
                25616,
                25618
            ],
            [
                25618,
                25666
            ],
            [
                25679,
                25689
            ],
            [
                25723,
                25724
            ],
            [
                25832,
                25840
            ],
            [
                25873,
                25912
            ],
            [
                26023,
                26069
            ],
            [
                26093,
                26121
            ],
            [
                26121,
                26124
            ],
            [
                26156,
                26168
            ],
            [
                26152,
                26155
            ],
            [
                26177,
                26311
            ],
            [
                26316,
                26319
            ],
            [
                26312,
                26315
            ],
            [
                26329,
                26350
            ],
            [
                26354,
                26447
            ],
            [
                26455,
                26461
            ],
            [
                26461,
                26550
            ],
            [
                26589,
                26591
            ],
            [
                26615,
                26628
            ],
            [
                26644,
                26669
            ],
            [
                26671,
                26674
            ],
            [
                26692,
                26710
            ],
            [
                26746,
                26748
            ],
            [
                26775,
                26778
            ],
            [
                26779,
                26809
            ],
            [
                26943,
                26967
            ],
            [
                27147,
                27152
            ],
            [
                27120,
                27123
            ],
            [
                27152,
                27154
            ],
            [
                27154,
                27157
            ],
            [
                27180,
                27187
            ],
            [
                27188,
                27192
            ],
            [
                27196,
                27198
            ],
            [
                27672,
                27796
            ],
            [
                27802,
                27824
            ],
            [
                27832,
                27834
            ],
            [
                27834,
                27869
            ],
            [
                27874,
                27938
            ],
            [
                27938,
                28025
            ],
            [
                28111,
                28145
            ],
            [
                28328,
                28366
            ],
            [
                28366,
                28377
            ],
            [
                28377,
                28387
            ],
            [
                28394,
                28415
            ],
            [
                28415,
                28430
            ],
            [
                28430,
                28434
            ],
            [
                28455,
                28484
            ],
            [
                28484,
                28508
            ],
            [
                28508,
                28565
            ],
            [
                28565,
                28643
            ],
            [
                28643,
                28692
            ],
            [
                28743,
                28791
            ],
            [
                28793,
                28837
            ],
            [
                28885,
                28949
            ],
            [
                28949,
                29065
            ],
            [
                29065,
                29138
            ],
            [
                29184,
                29187
            ],
            [
                29426,
                29438
            ],
            [
                29227,
                29232
            ],
            [
                29447,
                29456
            ],
            [
                29469,
                29479
            ],
            [
                29479,
                29525
            ],
            [
                29534,
                29540
            ],
            [
                29559,
                29678
            ],
            [
                29678,
                29726
            ],
            [
                29726,
                29765
            ],
            [
                29765,
                29882
            ],
            [
                29888,
                29893
            ],
            [
                29912,
                29933
            ],
            [
                29933,
                29968
            ],
            [
                29968,
                30032
            ],
            [
                30048,
                30050
            ],
            [
                30050,
                30114
            ],
            [
                30116,
                30156
            ],
            [
                30156,
                30185
            ],
            [
                30185,
                30253
            ],
            [
                30253,
                30294
            ],
            [
                30294,
                30314
            ],
            [
                30392,
                30417
            ],
            [
                30417,
                30449
            ],
            [
                30449,
                30510
            ],
            [
                30510,
                30622
            ],
            [
                30622,
                30660
            ],
            [
                30662,
                30685
            ],
            [
                30685,
                30741
            ],
            [
                30923,
                30943
            ],
            [
                30971,
                31027
            ]
        ],
        "row_chars": [
            [
                0,
                77
            ],
            [
                77,
                340
            ],
            [
                340,
                618
            ],
            [
                618,
                732
            ],
            [
                732,
                799
            ],
            [
                799,
                952
            ],
            [
                952,
                1163
            ],
            [
                1163,
                1300
            ],
            [
                1300,
                1393
            ],
            [
                1393,
                1481
            ],
            [
                1481,
                1608
            ],
            [
                1608,
                1701
            ],
            [
                1701,
                1868
            ],
            [
                1868,
                1940
            ],
            [
                1940,
                2117
            ],
            [
                2117,
                2271
            ],
            [
                2271,
                2305
            ],
            [
                2305,
                2464
            ],
            [
                2464,
                2678
            ],
            [
                2678,
                2812
            ],
            [
                2812,
                3011
            ],
            [
                3011,
                3062
            ],
            [
                3062,
                3193
            ],
            [
                3193,
                3225
            ],
            [
                3225,
                3271
            ],
            [
                3271,
                3353
            ],
            [
                3353,
                3535
            ],
            [
                3535,
                3559
            ],
            [
                3559,
                3598
            ],
            [
                3598,
                3734
            ],
            [
                3734,
                3769
            ],
            [
                3769,
                3894
            ],
            [
                3894,
                3965
            ],
            [
                3965,
                4016
            ],
            [
                4016,
                4051
            ],
            [
                4051,
                4091
            ],
            [
                4091,
                4216
            ],
            [
                4216,
                4249
            ],
            [
                4249,
                4287
            ],
            [
                4287,
                4421
            ],
            [
                4421,
                4450
            ],
            [
                4450,
                4470
            ],
            [
                4470,
                4521
            ],
            [
                4521,
                4559
            ],
            [
                4559,
                4619
            ],
            [
                4619,
                4722
            ],
            [
                4722,
                4737
            ],
            [
                4737,
                4755
            ],
            [
                4755,
                4849
            ],
            [
                4849,
                4935
            ],
            [
                4935,
                5086
            ],
            [
                5086,
                5134
            ],
            [
                5134,
                5330
            ],
            [
                5330,
                5551
            ],
            [
                5551,
                5584
            ],
            [
                5584,
                5706
            ],
            [
                5706,
                5833
            ],
            [
                5833,
                6014
            ],
            [
                6014,
                6384
            ],
            [
                6384,
                6490
            ],
            [
                6490,
                6596
            ],
            [
                6596,
                6668
            ],
            [
                6668,
                6895
            ],
            [
                6895,
                7026
            ],
            [
                7026,
                7045
            ],
            [
                7045,
                7247
            ],
            [
                7247,
                7361
            ],
            [
                7361,
                7385
            ],
            [
                7385,
                7405
            ],
            [
                7405,
                7466
            ],
            [
                7466,
                7514
            ],
            [
                7514,
                7638
            ],
            [
                7638,
                7758
            ],
            [
                7758,
                7793
            ],
            [
                7793,
                7812
            ],
            [
                7812,
                7886
            ],
            [
                7886,
                7899
            ],
            [
                7899,
                7981
            ],
            [
                7981,
                7995
            ],
            [
                7995,
                8049
            ],
            [
                8049,
                8119
            ],
            [
                8119,
                8147
            ],
            [
                8147,
                8173
            ],
            [
                8173,
                8219
            ],
            [
                8219,
                8271
            ],
            [
                8271,
                8323
            ],
            [
                8323,
                8351
            ],
            [
                8351,
                8378
            ],
            [
                8378,
                8413
            ],
            [
                8413,
                8433
            ],
            [
                8433,
                8501
            ],
            [
                8501,
                8551
            ],
            [
                8551,
                8585
            ],
            [
                8585,
                8688
            ],
            [
                8688,
                8744
            ],
            [
                8744,
                8771
            ],
            [
                8771,
                8815
            ],
            [
                8815,
                8906
            ],
            [
                8906,
                8946
            ],
            [
                8946,
                8975
            ],
            [
                8975,
                9025
            ],
            [
                9025,
                9122
            ],
            [
                9122,
                9148
            ],
            [
                9148,
                9178
            ],
            [
                9178,
                9204
            ],
            [
                9204,
                9216
            ],
            [
                9216,
                9276
            ],
            [
                9276,
                9361
            ],
            [
                9361,
                9460
            ],
            [
                9460,
                9491
            ],
            [
                9491,
                9515
            ],
            [
                9515,
                9568
            ],
            [
                9568,
                9591
            ],
            [
                9591,
                9697
            ],
            [
                9697,
                9721
            ],
            [
                9721,
                9830
            ],
            [
                9830,
                9866
            ],
            [
                9866,
                9929
            ],
            [
                9929,
                10000
            ],
            [
                10000,
                10035
            ],
            [
                10035,
                10067
            ],
            [
                10067,
                10085
            ],
            [
                10085,
                10120
            ],
            [
                10120,
                10132
            ],
            [
                10132,
                10293
            ],
            [
                10293,
                10335
            ],
            [
                10335,
                10500
            ],
            [
                10500,
                10519
            ],
            [
                10519,
                10538
            ],
            [
                10538,
                10648
            ],
            [
                10648,
                10681
            ],
            [
                10681,
                10709
            ],
            [
                10709,
                10785
            ],
            [
                10785,
                10836
            ],
            [
                10836,
                11045
            ],
            [
                11045,
                11110
            ],
            [
                11110,
                11173
            ],
            [
                11173,
                11250
            ],
            [
                11250,
                11417
            ],
            [
                11417,
                11491
            ],
            [
                11491,
                11715
            ],
            [
                11715,
                11894
            ],
            [
                11894,
                11929
            ],
            [
                11929,
                11990
            ],
            [
                11990,
                12078
            ],
            [
                12078,
                12232
            ],
            [
                12232,
                12406
            ],
            [
                12406,
                12560
            ],
            [
                12560,
                13051
            ],
            [
                13051,
                13290
            ],
            [
                13290,
                13533
            ],
            [
                13533,
                13635
            ],
            [
                13635,
                13747
            ],
            [
                13747,
                13811
            ],
            [
                13811,
                13986
            ],
            [
                13986,
                14184
            ],
            [
                14184,
                14369
            ],
            [
                14369,
                14664
            ],
            [
                14664,
                14815
            ],
            [
                14815,
                14998
            ],
            [
                14998,
                15179
            ],
            [
                15179,
                15325
            ],
            [
                15325,
                15566
            ],
            [
                15566,
                15671
            ],
            [
                15671,
                15711
            ],
            [
                15711,
                15900
            ],
            [
                15900,
                16152
            ],
            [
                16152,
                16306
            ],
            [
                16306,
                16371
            ],
            [
                16371,
                16396
            ],
            [
                16396,
                16415
            ],
            [
                16415,
                16468
            ],
            [
                16468,
                16524
            ],
            [
                16524,
                16586
            ],
            [
                16586,
                16645
            ],
            [
                16645,
                16830
            ],
            [
                16830,
                16867
            ],
            [
                16867,
                16947
            ],
            [
                16947,
                16990
            ],
            [
                16990,
                17034
            ],
            [
                17034,
                17078
            ],
            [
                17078,
                17268
            ],
            [
                17268,
                17438
            ],
            [
                17438,
                17544
            ],
            [
                17544,
                17598
            ],
            [
                17598,
                17656
            ],
            [
                17656,
                17699
            ],
            [
                17699,
                17824
            ],
            [
                17824,
                17867
            ],
            [
                17867,
                17958
            ],
            [
                17958,
                18007
            ],
            [
                18007,
                18044
            ],
            [
                18044,
                18299
            ],
            [
                18299,
                18399
            ],
            [
                18399,
                18430
            ],
            [
                18430,
                18585
            ],
            [
                18585,
                18679
            ],
            [
                18679,
                18815
            ],
            [
                18815,
                18855
            ],
            [
                18855,
                18884
            ],
            [
                18884,
                18996
            ],
            [
                18996,
                19076
            ],
            [
                19076,
                19131
            ],
            [
                19131,
                19170
            ],
            [
                19170,
                19358
            ],
            [
                19358,
                19446
            ],
            [
                19446,
                19475
            ],
            [
                19475,
                19525
            ],
            [
                19525,
                19609
            ],
            [
                19609,
                19641
            ],
            [
                19641,
                19867
            ],
            [
                19867,
                20103
            ],
            [
                20103,
                20133
            ],
            [
                20133,
                20209
            ],
            [
                20209,
                20271
            ],
            [
                20271,
                20375
            ],
            [
                20375,
                20414
            ],
            [
                20414,
                20490
            ],
            [
                20490,
                20571
            ],
            [
                20571,
                20678
            ],
            [
                20678,
                20757
            ],
            [
                20757,
                20909
            ],
            [
                20909,
                20991
            ],
            [
                20991,
                21043
            ],
            [
                21043,
                21069
            ],
            [
                21069,
                21140
            ],
            [
                21140,
                21163
            ],
            [
                21163,
                21341
            ],
            [
                21341,
                21399
            ],
            [
                21399,
                21449
            ],
            [
                21449,
                21553
            ],
            [
                21553,
                21662
            ],
            [
                21662,
                21763
            ],
            [
                21763,
                21899
            ],
            [
                21899,
                21989
            ],
            [
                21989,
                22085
            ],
            [
                22085,
                22192
            ],
            [
                22192,
                22271
            ],
            [
                22271,
                22353
            ],
            [
                22353,
                22397
            ],
            [
                22397,
                22477
            ],
            [
                22477,
                22511
            ],
            [
                22511,
                22531
            ],
            [
                22531,
                22629
            ],
            [
                22629,
                22646
            ],
            [
                22646,
                22702
            ],
            [
                22702,
                22780
            ],
            [
                22780,
                22820
            ],
            [
                22820,
                22825
            ],
            [
                22825,
                22836
            ],
            [
                22836,
                22883
            ],
            [
                22883,
                22965
            ],
            [
                22965,
                23014
            ],
            [
                23014,
                23071
            ],
            [
                23071,
                23152
            ],
            [
                23152,
                23194
            ],
            [
                23194,
                23267
            ],
            [
                23267,
                23323
            ],
            [
                23323,
                23445
            ],
            [
                23445,
                23515
            ],
            [
                23515,
                23613
            ],
            [
                23613,
                23803
            ],
            [
                23803,
                23899
            ],
            [
                23899,
                23994
            ],
            [
                23994,
                24078
            ],
            [
                24078,
                24244
            ],
            [
                24244,
                24351
            ],
            [
                24351,
                24531
            ],
            [
                24531,
                24769
            ],
            [
                24769,
                24797
            ],
            [
                24797,
                24847
            ],
            [
                24847,
                24935
            ],
            [
                24935,
                25211
            ],
            [
                25211,
                25322
            ],
            [
                25322,
                25402
            ],
            [
                25402,
                25510
            ],
            [
                25510,
                25618
            ],
            [
                25618,
                25913
            ],
            [
                25913,
                26023
            ],
            [
                26023,
                26121
            ],
            [
                26121,
                26312
            ],
            [
                26312,
                26461
            ],
            [
                26461,
                26748
            ],
            [
                26748,
                26967
            ],
            [
                26967,
                27154
            ],
            [
                27154,
                27198
            ],
            [
                27198,
                27320
            ],
            [
                27320,
                27569
            ],
            [
                27569,
                27672
            ],
            [
                27672,
                27834
            ],
            [
                27834,
                27938
            ],
            [
                27938,
                28146
            ],
            [
                28146,
                28245
            ],
            [
                28245,
                28328
            ],
            [
                28328,
                28366
            ],
            [
                28366,
                28377
            ],
            [
                28377,
                28415
            ],
            [
                28415,
                28430
            ],
            [
                28430,
                28434
            ],
            [
                28434,
                28455
            ],
            [
                28455,
                28484
            ],
            [
                28484,
                28508
            ],
            [
                28508,
                28565
            ],
            [
                28565,
                28643
            ],
            [
                28643,
                28694
            ],
            [
                28694,
                28743
            ],
            [
                28743,
                28837
            ],
            [
                28837,
                28949
            ],
            [
                28949,
                29065
            ],
            [
                29065,
                29479
            ],
            [
                29479,
                29678
            ],
            [
                29678,
                29726
            ],
            [
                29726,
                29765
            ],
            [
                29765,
                29933
            ],
            [
                29933,
                29968
            ],
            [
                29968,
                30050
            ],
            [
                30050,
                30156
            ],
            [
                30156,
                30185
            ],
            [
                30185,
                30253
            ],
            [
                30253,
                30294
            ],
            [
                30294,
                30314
            ],
            [
                30314,
                30392
            ],
            [
                30392,
                30417
            ],
            [
                30417,
                30449
            ],
            [
                30449,
                30510
            ],
            [
                30510,
                30622
            ],
            [
                30622,
                30685
            ],
            [
                30685,
                30741
            ],
            [
                30741,
                31027
            ]
        ]
    },
    "abridged": {
        "text": "But Lady Glencora was not brought to repentance by her husband's words. It seemed to her to be intolerably cruel, this demand that she should pass her first evening in town with an old woman whom she disliked.\nShe resolved upon rebellion. He had not ordered that she invite Mrs. Marsham, merely requested, and a request does not demand obedience. She would not send for Mrs. Marsham unless he forced her to. Had she not also made a request to him, and had he not refused it? She wrote a line, therefore, to Alice before she went to bed, begging her cousin to come to her early on the following day, so that they might go out together, and then afterwards dine in company with Mr. Bott.\n\"I know that will be an inducement to you,\" Lady Glencora said, \"because your generous heart will feel how that will help me. Nobody else will be here - unless, indeed, Mrs. Marsham should be asked, unknown to me.\"\nThen she sat down to think about the cruelty of husbands. She had been told in the days before her marriage that Burgo would ill-use her if he became her husband. The Marquis of Auld Reekie had gone so far as to suggest that Burgo might beat her. But what hard treatment could be so unendurable as this total lack of sympathy on her husband's part? As for that matter of beating, she ridiculed the idea. She sat smiling at the absurdity of the thing as she thought of the beauty of Burgo's eyes, of the softness of his touch, of his loving voice. Would it not even be better to be beaten by him than to have politics explained to her at one o'clock at night by Plantagenet Palliser? The British Constitution, indeed!\nIf she had married Burgo they would have been in sunny Italy, sitting together under the pale moonlight. She might have sat on marble balconies, while the vines clustered over her head, and he would have been at her knee, hardly speaking to her, but making her happy, lapped in the delight of loving.\nPoor, wretched, overburdened child, to whom the commonest lessons of life had not yet been taught, and who was now in the hands of one so ill-fitted to teach them! Who would not pity her? Who could say that the fault was hers? The world had laden her with wealth till she could barely move, then turned her loose to run her race!\n\"Have you written to your cousin?\" her husband asked her the next morning, with no anger in his voice.\n\"Yes; I have asked her to come and drive, and then to stay for dinner.\"\n\"Very well,\" said Mr. Palliser, mildly. After a short pause, he added, \"As that is settled, perhaps you would have no objection to ask Mrs. Marsham also?\"\n\"Won't she be engaged?\"\n\"No; I think not,\" said Mr. Palliser. And then he added, so as to avoid a falsehood, \"I know she is not engaged.\"\n\"She expects to come, then?\" said Lady Glencora.\n\"I have not asked her. If I had, I should have said so.\"\n\"I will write to her, if you wish,\" said the wife, who felt that she could hardly refuse any longer.\n\"Do, my dear!\" said the husband. So Lady Glencora did write to Mrs. Marsham, who promised to come - as did Alice.\nLady Glencora would, at any rate, have Alice to herself for some hours before dinner. She took comfort in that reflection; but after a while she realised that she would not know how much to tell Alice. Did she mean to show that letter to her cousin? If she did show it, then - she told herself - she must give up for ever all her dreams about life with Burgo. If she did not show it, then she would leave her husband, and would become - something she did not dare to name even to herself. She declared that so it must be. She knew that she would go with Burgo if he found a way. But if she let Alice know about his letter, Burgo would never have such power.\nAlice came, and the greeting between the cousins was very affectionate. Lady Glencora received her as though they had been playmates from early childhood; and Alice, though such impulsive love was not as natural to her, responded to Glencora's warmth. Indeed, had she not promised to love her, at Matching Priory? Although there was much in Lady Glencora that she could not approve - much even that she could not like - still she would keep to her promise.\nThey sat so long over the fire in the drawing-room that at last they agreed that their drive should be abandoned.\n\"What's the use of it?\" said Lady Glencora. \"There's nothing to see, and the wind is as cold as charity. We are much more comfortable here; are we not?\"\nAlice agreed, having no great desire to be driven through the park on a gloomy February afternoon.\n\"If I had Dandy and Flirt up here, there would be some fun in it; but Mr. Palliser doesn't wish me to drive in London. He thinks it is unladylike.\"\n\"So it is. If I were a man, I wouldn't like my wife to drive horses about London.\"\n\"Why not? Just because you'd be a tyrant, like other husbands? But Mr. Palliser doesn't care about what I want.\"\n\"Don't say that, Glencora. I believe he would consent to anything that he didn't think wrong.\"\n\"Such as lectures about the British Constitution! But never mind about that. I haven't told you whom you are to meet at dinner.\"\n\"Mr. Bott, you said.\"\n\"But there's another guest, a Mrs. Marsham. I thought I'd got rid of her when I wrote to you; but she's coming.\"\n\"She won't hurt me,\" said Alice.\n\"She'll destroy the pleasure of our evening. I do believe that she hates you, and that she thinks you instigate me to all kinds of wickedness. What fools they all are! It makes me sick when I think that they should be so blind. Alice, I hardly know how much I owe to you; everything, I believe.\" Lady Glencora, as she spoke, put her hand into her pocket, and grasped the letter which lay there.\n\"That's nonsense,\" said Alice.\n\"No; it's not nonsense. Who do you think came to Matching when I was there?\"\n\"If it is the person of whom I am thinking,\" said Alice solemnly, \"let me implore you not to speak of him.\"\n\"Why should I not speak of him? How are you to be my friend, if I may not speak to you of everything?\"\n\"But you should not think of him.\"\n\"What nonsense! How is one to help one's thoughts? Look here.\"\nHer hand was on the letter, and it would have been out in a moment, and thrown upon Alice's lap, had not the servant opened the door and announced Mrs. Marsham.\n\"How do, my dear?\" said Mrs. Marsham. \"I thought I'd just come across from Norfolk Street and see you, though I am coming to dinner in the evening. It's only just a step, you know. How d'ye do, Miss Vavasor?\" and she made a cold salutation to Alice.\nMrs. Marsham was a woman who had many good points. She was poor, and bore her poverty without complaint. She was connected with rich and titled people; but she was no flatterer. She was staunch in her friendships, and staunch in her enmities. She knew well what was going on in the world. She could talk about the last novel, or - if need be - about the Constitution. She had been a true wife, though sometimes too strong-minded, and a painstaking mother, whose children, however, had never loved her as most mothers like to be loved.\nThe catalogue of her faults was as long as that of her virtues. She was ambitious of power, hardhearted, and unscrupulous. She would not fawn before a title, but she was not above ingratiating herself with those whom she wished to conciliate. She thought evil rather than good. Although she would not invent lies, she would willingly leave false impressions.\nShe had been a close friend of Mr. Palliser's mother; and she took a special interest in Mr. Palliser's welfare. When he married, she heard the story of Burgo and Lady Glencora, and she was not disposed to think well of the bride. She made up her mind that the young lady would want watching, and felt that no one could so this so well as herself.\nShe had not openly suggested this to Mr. Palliser; but she had let a word or two drop, hinting that Lady Glencora was very young, and that precaution was, for that reason, more necessary. Mr. Palliser, whose nature was devoid of suspicion, and who knew nothing of the delights and dangers of love, acknowledged that Glencora was young. He especially wished that she should be discreet and matronly; he feared no lovers, but he feared that she might do silly things, not befitting the wife of a Chancellor of the Exchequer. Therefore he submitted Glencora - and, to a certain extent, himself - into the hands of Mrs. Marsham.\nLady Glencora had not been twenty-four hours with this lady before she recognized her as a duenna. She might be very ignorant about some things, but she was no fool. In many things Lady Glencora was much quicker and cleverer than her husband. Though his intelligence was keen, his instincts were dull; he had no understanding of character. He should have been aware that Burgo was a danger; and he should have been aware also that Mrs. Marsham was a duenna not to be employed. When a woman knows that she is guarded by a watch-dog, she is bound to deceive it, if possible.\nAlice accepted Mrs. Marsham's greeting as coldly as it had been given, and from that time those two ladies were enemies. Mrs. Marsham partly guessed that Alice had in some way interfered to prevent Lady Glencora's visit to Monkshade, and she resented the interference. She had made up her mind that Alice was not the sort of friend that Lady Glencora should have. Alice recognized and accepted the feud.\n\"I thought I might find you at home,\" said Mrs. Marsham, \"as I know you are lazy about going out in the cold - unless it be for a foolish midnight ramble,\" and Mrs. Marsham shook her head.\n\"The ramble you speak of was very wise, I think,\" said Lady Glencora; \"but I never could see the use of driving about in London in the middle of winter.\"\n\"One ought to go out of the house every day,\" said Mrs. Marsham.\n\"I hate all those rules. Don't you, Alice?\" Alice said nothing.\n\"My dear Glencora, one must live by rules in this life. You might as well say that you hated sitting down to dinner.\"\n\"So I do, very often; almost always when there's company.\"\n\"You'll get over that feeling after another season in town,\" said Mrs. Marsham.\n\"I don't think I shall. It seems to get worse instead of better. Mr. Bott is coming to dine here tonight.\"\nThere was no mistaking the meaning of this. Mrs. Marsham had accepted the hand of fellowship from Mr. Bott, not because she especially liked him, but because they both supported Mr. Palliser's position.\n\"Mr. Bott is a Member of Parliament, and a very useful friend of Mr. Palliser's,\" said Mrs. Marsham.\n\"All the same; we do not like Mr. Bott - do we, Alice? \"\n\"I certainly do not like him,\" said Alice. \"He did annoy me once, but I dare say, will never have an opportunity of doing so again.\"\n\"I don't know what the annoyance may have been.\"\n\"Of course you don't, Mrs. Marsham.\"\n\"I shouldn't have thought it likely that a person so busy as Mr. Bott, and employed on matters of such vast importance, would have gone out of his way to annoy a young lady whom he chanced to meet for a day or two in a country-house.\"\n\"I don't think that Alice means that he attempted to flirt with her,\" said Lady Glencora, laughing. \"Fancy Mr. Bott's flirtation!\"\n\"Perhaps he did not attempt,\" said Mrs. Marsham; and her tone was more than Alice was able to bear with equanimity.\n\"Glencora,\" said she, rising, \"I think I'll leave you alone with Mrs. Marsham. I'm not disposed to discuss Mr. Bott's character, nor to hear his name mentioned in disagreeable connection with my own.\"\nBut Lady Glencora would not let her go. \"Nonsense, Alice,\" she said. \"If you and I can't fight our little battles against Mr. Bott and Mrs. Marsham without running away, it is odd.\"\n\"I hope, Glencora, you do not count me as your enemy?\" said Mrs. Marsham, drawing herself up.\n\"But I shall, certainly, if you attack Alice, who is the best friend I have in the world.\"\n\"I did not mean to offend Miss Vavasor,\" said Mrs. Marsham, looking at her very grimly. Alice merely bowed her head. After that, Mrs. Marsham took herself off, saying that she would be back to dinner. She was angry, but not unhappy. She thought that she could put down Miss Vavasor, and she was prepared to bear a good deal from Lady Glencora - for Mr. Palliser's sake, as she said to herself.\n\"She's a nasty old cat,\" said Lady Glencora, as soon as the door was closed; and she said this with so droll a voice and with so much comedy in her grimace, that Alice could only laugh. \"It won't do for you to run away when she spits at you. You must hold your ground, and show your claws.\"\n\"But I don't want to be a cat myself.\"\n\"She'll find I'm of the tiger kind, if she persecutes me. Alice, I have made up my mind not to be persecuted. If my husband tells me to do anything, I'll do it; but I won't be persecuted.\"\n\"You should remember that she was an old friend of Mr. Palliser's mother.\"\n\"I do remember. But I won't be persecuted. If she gives me advice, I shall tell her that it's not wanted; and if she insults any friend of mine, I shall tell her to stay away.\"\nAfter that, Lady Glencora felt no further inclination to show Burgo's letter to Alice. They sat over the drawing-room fire, talking chiefly of Alice's affairs, till it was time for them to dress. But Alice said no word about her engagement with George Vavasor. How could she speak of it, seeing that she had already almost resolved that the engagement should be broken?\nWhen Alice came down to the drawing-room before dinner, she found Mr. Bott there alone.\n\"I did not expect the pleasure of meeting Miss Vavasor today,\" he said, offering his hand. She gave him hers, and then sat down, muttering some word of reply.\n\"We spent a very pleasant month at Matching together; didn't you think so?\"\n\"I spent a pleasant month there certainly.\"\n\"You left, if I remember, the morning after that late walk out among the ruins? That was unfortunate, was it not? Poor Lady Glencora! it made her very ill; so that she could not go to Monkshade, as she particularly wished. It was very sad. Lady Glencora is very delicate indeed. We ought always to remember that.\"\n\"I don't think she is at all delicate. I believe she has very good health. But by delicate I suppose you mean weak and infirm.\"\n\"Oh, dear, no, not in the least - not infirm certainly! What I mean is, not robust, Miss Vavasor.\"\nAlice was going to protest, when Mr. Palliser entered the room along with Mrs. Marsham.\nThe two gentlemen shook hands, and then Mr. Palliser turned to Alice. She perceived at once by his face that she was unwelcome, and wished herself away from his house. He just touched her hand, and asked her how she was. Then he turned away, and began talking to Mrs. Marsham on the other side. He spoke no word about Matching, no word about his wife, as he would naturally have done to his wife's friend.\nAlice felt the blood mount into her face, and regretted greatly that she had ever come here. She should have avoided her great relations. What was Lady Glencora to her that she should be treated like a poor companion, dependent on the bounty of her rich connection? Alice was proud. She had nursed her pride till it was very faulty. Why, then, should she submit to such an open lack of courtesy by such a one as Mr. Palliser, who was rolling in wealth and magnificence? She would make Lady Glencora understand that a close friendship was not possible.\n\"I declare I'm very much ashamed,\" said Lady Glencora, as she entered the room late. \"I do beg Mrs. Marsham's pardon.\"\nMrs. Marsham was all smiles and forgiveness. Then dinner was announced, and Alice had to walk downstairs by herself, because Mr. Bott stuck manfully to Lady Glencora's side.\nDuring dinner-time Alice said very little, nor did she have the opportunity of saying much. She thought of her first day at Matching Priory, when she had sat between the Duke of St. Bungay and Jeffrey Palliser, and when everybody had been so civil to her!\nNow she had one side of the table to herself, away from the fire, where she felt cold and desolate in the gloom of the large half-lit room. Mr. Palliser occupied himself with Mrs. Marsham, who talked politics to him; and Mr. Bott was constantly trying to make conversation with Lady Glencora, who gave him no encouragement, but did not dare to snub him openly. She frequently said some little word to Alice; but it was of no avail. Alice was dumb. She was not used to being snubbed. But now she felt that the halls of the Pallisers were too cold for her, and that the sooner she escaped from their gloom and discourtesy the better.\nMrs. Marsham, when the three ladies returned to the drawing-room together, was a little triumphant. She felt that she had put Alice down; and with the energetic prudence of a good general, she determined to keep her down.\n\"Is Miss Vavasor going to walk home?\" she asked.\n\"Walk home - along Oxford Street! Good gracious! no. The carriage will take her.\"\n\"Or a cab,\" said Alice. \"I am quite used to go about London in a cab by myself.\"\n\"I don't think they are nice for young ladies after dark,\" said Mrs. Marsham. \"I was going to offer my servant to walk with her.\"\n\"I'm sure Alice is very much obliged,\" said Lady Glencora; \"but she will have the carriage.\"\n\"But gentlemen do so dislike having their horses out at night.\"\n\"No gentleman's horses will be out,\" said Lady Glencora, savagely; \"and as for mine, it's what they are there for.\" It was not often that Lady Glencora made any allusion to her own property; there she behaved with great reticence and delicacy. But now, when she was twitted by her husband's friend about her husband's horses, because she chose to send her own friend home in her own carriage, she did find it hard to bear.\n\"I dare say it's all right,\" said Mrs. Marsham.\n\"It is all right,\" said Lady Glencora. \"Mr. Palliser has given me my horses for my own use, to do as I like with them; and if he thinks I take them out when I ought not, he can tell me so. Nobody else has a right to do it.\" Lady Glencora, by this time, was almost in a passion, and showed it.\n\"My dear Lady Glencora, you have mistaken me,\" said Mrs. Marsham. \"I did not mean anything of that kind.\"\n\"I am so sorry,\" said Alice. \"And it is such a pity, as I am quite used to going about in cabs.\"\n\"Of course you are,\" said Lady Glencora. \"Why shouldn't you? That's not the question. Mrs. Marsham understands that.\"\n\"Upon my word, I don't understand anything,\" said that lady.\n\"I understand this,\" said Lady Glencora; \"that in all such matters as that, I intend to follow my own pleasure. Come, Alice, let us have some coffee,\" and she rang the bell. \"What a fuss we have made about a stupid old carriage!\"\nSo Alice was taken home, leaving her cousin still in the hands of Mrs. Marsham.",
        "paragraph_chars": [
            [
                0,
                210
            ],
            [
                210,
                686
            ],
            [
                686,
                901
            ],
            [
                901,
                1618
            ],
            [
                1618,
                1919
            ],
            [
                1919,
                2249
            ],
            [
                2249,
                2352
            ],
            [
                2352,
                2424
            ],
            [
                2424,
                2579
            ],
            [
                2579,
                2603
            ],
            [
                2603,
                2717
            ],
            [
                2717,
                2766
            ],
            [
                2766,
                2823
            ],
            [
                2823,
                2924
            ],
            [
                2924,
                3038
            ],
            [
                3038,
                3696
            ],
            [
                3696,
                4153
            ],
            [
                4153,
                4267
            ],
            [
                4267,
                4420
            ],
            [
                4420,
                4519
            ],
            [
                4519,
                4667
            ],
            [
                4667,
                4750
            ],
            [
                4750,
                4863
            ],
            [
                4863,
                4958
            ],
            [
                4958,
                5087
            ],
            [
                5087,
                5109
            ],
            [
                5109,
                5222
            ],
            [
                5222,
                5255
            ],
            [
                5255,
                5650
            ],
            [
                5650,
                5681
            ],
            [
                5681,
                5758
            ],
            [
                5758,
                5866
            ],
            [
                5866,
                5969
            ],
            [
                5969,
                6004
            ],
            [
                6004,
                6067
            ],
            [
                6067,
                6228
            ],
            [
                6228,
                6478
            ],
            [
                6478,
                7013
            ],
            [
                7013,
                7372
            ],
            [
                7372,
                7720
            ],
            [
                7720,
                8345
            ],
            [
                8345,
                8918
            ],
            [
                8918,
                9322
            ],
            [
                9322,
                9511
            ],
            [
                9511,
                9665
            ],
            [
                9665,
                9730
            ],
            [
                9730,
                9794
            ],
            [
                9794,
                9912
            ],
            [
                9912,
                9971
            ],
            [
                9971,
                10051
            ],
            [
                10051,
                10158
            ],
            [
                10158,
                10361
            ],
            [
                10361,
                10462
            ],
            [
                10462,
                10519
            ],
            [
                10519,
                10652
            ],
            [
                10652,
                10701
            ],
            [
                10701,
                10738
            ],
            [
                10738,
                10973
            ],
            [
                10973,
                11104
            ],
            [
                11104,
                11220
            ],
            [
                11220,
                11421
            ],
            [
                11421,
                11603
            ],
            [
                11603,
                11697
            ],
            [
                11697,
                11788
            ],
            [
                11788,
                12182
            ],
            [
                12182,
                12473
            ],
            [
                12473,
                12512
            ],
            [
                12512,
                12701
            ],
            [
                12701,
                12776
            ],
            [
                12776,
                12953
            ],
            [
                12953,
                13323
            ],
            [
                13323,
                13411
            ],
            [
                13411,
                13570
            ],
            [
                13570,
                13646
            ],
            [
                13646,
                13690
            ],
            [
                13690,
                14004
            ],
            [
                14004,
                14132
            ],
            [
                14132,
                14231
            ],
            [
                14231,
                14319
            ],
            [
                14319,
                14725
            ],
            [
                14725,
                15277
            ],
            [
                15277,
                15396
            ],
            [
                15396,
                15570
            ],
            [
                15570,
                15826
            ],
            [
                15826,
                16458
            ],
            [
                16458,
                16680
            ],
            [
                16680,
                16729
            ],
            [
                16729,
                16811
            ],
            [
                16811,
                16892
            ],
            [
                16892,
                17022
            ],
            [
                17022,
                17115
            ],
            [
                17115,
                17179
            ],
            [
                17179,
                17602
            ],
            [
                17602,
                17650
            ],
            [
                17650,
                17943
            ],
            [
                17943,
                18049
            ],
            [
                18049,
                18146
            ],
            [
                18146,
                18264
            ],
            [
                18264,
                18325
            ],
            [
                18325,
                18555
            ],
            [
                18555,
                18634
            ]
        ],
        "segment_chars": [
            [
                0,
                72
            ],
            [
                72,
                210
            ],
            [
                210,
                239
            ],
            [
                239,
                347
            ],
            [
                347,
                408
            ],
            [
                408,
                475
            ],
            [
                475,
                686
            ],
            [
                686,
                812
            ],
            [
                812,
                901
            ],
            [
                901,
                959
            ],
            [
                959,
                1064
            ],
            [
                1064,
                1148
            ],
            [
                1148,
                1250
            ],
            [
                1250,
                1305
            ],
            [
                1305,
                1448
            ],
            [
                1448,
                1584
            ],
            [
                1584,
                1618
            ],
            [
                1618,
                1723
            ],
            [
                1723,
                1919
            ],
            [
                1919,
                2083
            ],
            [
                2083,
                2107
            ],
            [
                2107,
                2146
            ],
            [
                2146,
                2249
            ],
            [
                2249,
                2284
            ],
            [
                2284,
                2352
            ],
            [
                2352,
                2424
            ],
            [
                2424,
                2464
            ],
            [
                2464,
                2579
            ],
            [
                2579,
                2603
            ],
            [
                2603,
                2641
            ],
            [
                2641,
                2717
            ],
            [
                2717,
                2746
            ],
            [
                2746,
                2766
            ],
            [
                2766,
                2789
            ],
            [
                2789,
                2823
            ],
            [
                2823,
                2924
            ],
            [
                2924,
                2939
            ],
            [
                2939,
                2957
            ],
            [
                2957,
                3038
            ],
            [
                3038,
                3124
            ],
            [
                3124,
                3240
            ],
            [
                3240,
                3288
            ],
            [
                3288,
                3398
            ],
            [
                3398,
                3527
            ],
            [
                3527,
                3560
            ],
            [
                3560,
                3617
            ],
            [
                3617,
                3696
            ],
            [
                3696,
                3768
            ],
            [
                3768,
                3948
            ],
            [
                3948,
                4010
            ],
            [
                4010,
                4153
            ],
            [
                4153,
                4267
            ],
            [
                4267,
                4291
            ],
            [
                4291,
                4311
            ],
            [
                4311,
                4372
            ],
            [
                4372,
                4420
            ],
            [
                4420,
                4519
            ],
            [
                4519,
                4638
            ],
            [
                4638,
                4667
            ],
            [
                4667,
                4678
            ],
            [
                4678,
                4750
            ],
            [
                4750,
                4760
            ],
            [
                4760,
                4813
            ],
            [
                4813,
                4863
            ],
            [
                4863,
                4890
            ],
            [
                4890,
                4958
            ],
            [
                4958,
                5008
            ],
            [
                5008,
                5035
            ],
            [
                5035,
                5087
            ],
            [
                5087,
                5109
            ],
            [
                5109,
                5153
            ],
            [
                5153,
                5222
            ],
            [
                5222,
                5255
            ],
            [
                5255,
                5300
            ],
            [
                5300,
                5398
            ],
            [
                5398,
                5423
            ],
            [
                5423,
                5483
            ],
            [
                5483,
                5551
            ],
            [
                5551,
                5650
            ],
            [
                5650,
                5681
            ],
            [
                5681,
                5705
            ],
            [
                5705,
                5758
            ],
            [
                5758,
                5866
            ],
            [
                5866,
                5898
            ],
            [
                5898,
                5969
            ],
            [
                5969,
                6004
            ],
            [
                6004,
                6020
            ],
            [
                6020,
                6055
            ],
            [
                6055,
                6067
            ],
            [
                6067,
                6228
            ],
            [
                6228,
                6247
            ],
            [
                6247,
                6266
            ],
            [
                6266,
                6376
            ],
            [
                6376,
                6409
            ],
            [
                6409,
                6437
            ],
            [
                6437,
                6478
            ],
            [
                6478,
                6529
            ],
            [
                6529,
                6583
            ],
            [
                6583,
                6656
            ],
            [
                6656,
                6721
            ],
            [
                6721,
                6767
            ],
            [
                6767,
                6846
            ],
            [
                6846,
                7013
            ],
            [
                7013,
                7077
            ],
            [
                7077,
                7136
            ],
            [
                7136,
                7256
            ],
            [
                7256,
                7291
            ],
            [
                7291,
                7372
            ],
            [
                7372,
                7485
            ],
            [
                7485,
                7603
            ],
            [
                7603,
                7720
            ],
            [
                7720,
                7908
            ],
            [
                7908,
                8056
            ],
            [
                8056,
                8243
            ],
            [
                8243,
                8345
            ],
            [
                8345,
                8444
            ],
            [
                8444,
                8511
            ],
            [
                8511,
                8588
            ],
            [
                8588,
                8685
            ],
            [
                8685,
                8822
            ],
            [
                8822,
                8918
            ],
            [
                8918,
                9039
            ],
            [
                9039,
                9187
            ],
            [
                9187,
                9282
            ],
            [
                9282,
                9322
            ],
            [
                9322,
                9511
            ],
            [
                9511,
                9665
            ],
            [
                9665,
                9730
            ],
            [
                9730,
                9755
            ],
            [
                9755,
                9774
            ],
            [
                9774,
                9794
            ],
            [
                9794,
                9850
            ],
            [
                9850,
                9912
            ],
            [
                9912,
                9971
            ],
            [
                9971,
                10051
            ],
            [
                10051,
                10075
            ],
            [
                10075,
                10116
            ],
            [
                10116,
                10158
            ],
            [
                10158,
                10202
            ],
            [
                10202,
                10361
            ],
            [
                10361,
                10462
            ],
            [
                10462,
                10519
            ],
            [
                10519,
                10562
            ],
            [
                10562,
                10652
            ],
            [
                10652,
                10701
            ],
            [
                10701,
                10738
            ],
            [
                10738,
                10973
            ],
            [
                10973,
                11073
            ],
            [
                11073,
                11104
            ],
            [
                11104,
                11220
            ],
            [
                11220,
                11299
            ],
            [
                11299,
                11421
            ],
            [
                11421,
                11461
            ],
            [
                11461,
                11490
            ],
            [
                11490,
                11603
            ],
            [
                11603,
                11658
            ],
            [
                11658,
                11697
            ],
            [
                11697,
                11788
            ],
            [
                11788,
                11876
            ],
            [
                11876,
                11905
            ],
            [
                11905,
                11989
            ],
            [
                11989,
                12021
            ],
            [
                12021,
                12182
            ],
            [
                12182,
                12368
            ],
            [
                12368,
                12424
            ],
            [
                12424,
                12473
            ],
            [
                12473,
                12512
            ],
            [
                12512,
                12570
            ],
            [
                12570,
                12622
            ],
            [
                12622,
                12701
            ],
            [
                12701,
                12776
            ],
            [
                12776,
                12792
            ],
            [
                12792,
                12819
            ],
            [
                12819,
                12953
            ],
            [
                12953,
                13040
            ],
            [
                13040,
                13149
            ],
            [
                13149,
                13214
            ],
            [
                13214,
                13323
            ],
            [
                13323,
                13411
            ],
            [
                13411,
                13502
            ],
            [
                13502,
                13570
            ],
            [
                13570,
                13646
            ],
            [
                13646,
                13690
            ],
            [
                13690,
                13770
            ],
            [
                13770,
                13804
            ],
            [
                13804,
                13824
            ],
            [
                13824,
                13913
            ],
            [
                13913,
                13930
            ],
            [
                13930,
                13969
            ],
            [
                13969,
                14004
            ],
            [
                14004,
                14043
            ],
            [
                14043,
                14079
            ],
            [
                14079,
                14132
            ],
            [
                14132,
                14188
            ],
            [
                14188,
                14231
            ],
            [
                14231,
                14319
            ],
            [
                14319,
                14389
            ],
            [
                14389,
                14487
            ],
            [
                14487,
                14540
            ],
            [
                14540,
                14614
            ],
            [
                14614,
                14725
            ],
            [
                14725,
                14818
            ],
            [
                14818,
                14863
            ],
            [
                14863,
                14991
            ],
            [
                14991,
                15008
            ],
            [
                15008,
                15058
            ],
            [
                15058,
                15195
            ],
            [
                15195,
                15277
            ],
            [
                15277,
                15362
            ],
            [
                15362,
                15396
            ],
            [
                15396,
                15441
            ],
            [
                15441,
                15570
            ],
            [
                15570,
                15662
            ],
            [
                15662,
                15826
            ],
            [
                15826,
                15966
            ],
            [
                15966,
                16187
            ],
            [
                16187,
                16258
            ],
            [
                16258,
                16274
            ],
            [
                16274,
                16309
            ],
            [
                16309,
                16458
            ],
            [
                16458,
                16558
            ],
            [
                16558,
                16680
            ],
            [
                16680,
                16718
            ],
            [
                16718,
                16729
            ],
            [
                16729,
                16763
            ],
            [
                16763,
                16778
            ],
            [
                16778,
                16782
            ],
            [
                16782,
                16811
            ],
            [
                16811,
                16835
            ],
            [
                16835,
                16892
            ],
            [
                16892,
                16970
            ],
            [
                16970,
                17022
            ],
            [
                17022,
                17115
            ],
            [
                17115,
                17179
            ],
            [
                17179,
                17295
            ],
            [
                17295,
                17423
            ],
            [
                17423,
                17602
            ],
            [
                17602,
                17650
            ],
            [
                17650,
                17689
            ],
            [
                17689,
                17839
            ],
            [
                17839,
                17874
            ],
            [
                17874,
                17943
            ],
            [
                17943,
                18009
            ],
            [
                18009,
                18049
            ],
            [
                18049,
                18078
            ],
            [
                18078,
                18146
            ],
            [
                18146,
                18187
            ],
            [
                18187,
                18207
            ],
            [
                18207,
                18232
            ],
            [
                18232,
                18264
            ],
            [
                18264,
                18325
            ],
            [
                18325,
                18437
            ],
            [
                18437,
                18499
            ],
            [
                18499,
                18555
            ],
            [
                18555,
                18634
            ]
        ],
        "overlap_chars": [
            [
                0,
                64
            ],
            [
                65,
                72
            ],
            [
                72,
                94
            ],
            [
                95,
                125
            ],
            [
                126,
                141
            ],
            [
                142,
                146
            ],
            [
                147,
                190
            ],
            [
                191,
                195
            ],
            [
                196,
                199
            ],
            [
                210,
                239
            ],
            [
                239,
                245
            ],
            [
                246,
                249
            ],
            [
                250,
                257
            ],
            [
                258,
                262
            ],
            [
                263,
                266
            ],
            [
                274,
                287
            ],
            [
                304,
                319
            ],
            [
                336,
                347
            ],
            [
                347,
                382
            ],
            [
                406,
                408
            ],
            [
                408,
                411
            ],
            [
                412,
                415
            ],
            [
                416,
                419
            ],
            [
                420,
                455
            ],
            [
                456,
                458
            ],
            [
                459,
                462
            ],
            [
                463,
                475
            ],
            [
                475,
                686
            ],
            [
                686,
                788
            ],
            [
                808,
                812
            ],
            [
                812,
                836
            ],
            [
                839,
                895
            ],
            [
                898,
                901
            ],
            [
                901,
                913
            ],
            [
                914,
                927
            ],
            [
                928,
                959
            ],
            [
                959,
                976
            ],
            [
                977,
                1008
            ],
            [
                1009,
                1064
            ],
            [
                1064,
                1137
            ],
            [
                1138,
                1148
            ],
            [
                1148,
                1171
            ],
            [
                1172,
                1209
            ],
            [
                1215,
                1226
            ],
            [
                1230,
                1233
            ],
            [
                1248,
                1250
            ],
            [
                1250,
                1303
            ],
            [
                1303,
                1305
            ],
            [
                1305,
                1429
            ],
            [
                1430,
                1433
            ],
            [
                1434,
                1440
            ],
            [
                1441,
                1448
            ],
            [
                1448,
                1561
            ],
            [
                1562,
                1584
            ],
            [
                1584,
                1617
            ],
            [
                1621,
                1624
            ],
            [
                1625,
                1628
            ],
            [
                1629,
                1679
            ],
            [
                1688,
                1723
            ],
            [
                1723,
                1741
            ],
            [
                1745,
                1874
            ],
            [
                1893,
                1895
            ],
            [
                1896,
                1899
            ],
            [
                1908,
                1910
            ],
            [
                1917,
                1918
            ],
            [
                1919,
                1940
            ],
            [
                1948,
                2025
            ],
            [
                2026,
                2029
            ],
            [
                2030,
                2033
            ],
            [
                2037,
                2053
            ],
            [
                2054,
                2083
            ],
            [
                2083,
                2107
            ],
            [
                2107,
                2146
            ],
            [
                2146,
                2190
            ],
            [
                2208,
                2209
            ],
            [
                2210,
                2214
            ],
            [
                2215,
                2249
            ],
            [
                2249,
                2284
            ],
            [
                2284,
                2322
            ],
            [
                2322,
                2323
            ],
            [
                2332,
                2337
            ],
            [
                2341,
                2350
            ],
            [
                2350,
                2352
            ],
            [
                2352,
                2421
            ],
            [
                2424,
                2464
            ],
            [
                2464,
                2579
            ],
            [
                2579,
                2589
            ],
            [
                2590,
                2603
            ],
            [
                2603,
                2641
            ],
            [
                2641,
                2659
            ],
            [
                2677,
                2686
            ],
            [
                2686,
                2717
            ],
            [
                2717,
                2746
            ],
            [
                2746,
                2766
            ],
            [
                2766,
                2787
            ],
            [
                2787,
                2789
            ],
            [
                2792,
                2793
            ],
            [
                2794,
                2797
            ],
            [
                2797,
                2820
            ],
            [
                2823,
                2851
            ],
            [
                2856,
                2924
            ],
            [
                2924,
                2939
            ],
            [
                2939,
                2957
            ],
            [
                2957,
                3021
            ],
            [
                3024,
                3030
            ],
            [
                3031,
                3036
            ],
            [
                3036,
                3038
            ],
            [
                3038,
                3124
            ],
            [
                3124,
                3182
            ],
            [
                3192,
                3215
            ],
            [
                3225,
                3238
            ],
            [
                3238,
                3240
            ],
            [
                3240,
                3288
            ],
            [
                3288,
                3312
            ],
            [
                3315,
                3318
            ],
            [
                3324,
                3331
            ],
            [
                3334,
                3337
            ],
            [
                3338,
                3380
            ],
            [
                3386,
                3390
            ],
            [
                3396,
                3398
            ],
            [
                3398,
                3421
            ],
            [
                3422,
                3426
            ],
            [
                3427,
                3454
            ],
            [
                3454,
                3459
            ],
            [
                3460,
                3472
            ],
            [
                3485,
                3527
            ],
            [
                3527,
                3560
            ],
            [
                3560,
                3597
            ],
            [
                3601,
                3603
            ],
            [
                3615,
                3617
            ],
            [
                3617,
                3620
            ],
            [
                3624,
                3627
            ],
            [
                3628,
                3642
            ],
            [
                3653,
                3659
            ],
            [
                3659,
                3696
            ],
            [
                3696,
                3768
            ],
            [
                3768,
                3896
            ],
            [
                3897,
                3899
            ],
            [
                3900,
                3914
            ],
            [
                3914,
                3915
            ],
            [
                3926,
                3928
            ],
            [
                3946,
                3948
            ],
            [
                3948,
                3976
            ],
            [
                3980,
                3984
            ],
            [
                3985,
                3988
            ],
            [
                3990,
                4008
            ],
            [
                4008,
                4010
            ],
            [
                4019,
                4077
            ],
            [
                4080,
                4108
            ],
            [
                4109,
                4113
            ],
            [
                4116,
                4131
            ],
            [
                4137,
                4139
            ],
            [
                4140,
                4143
            ],
            [
                4151,
                4153
            ],
            [
                4153,
                4233
            ],
            [
                4246,
                4267
            ],
            [
                4267,
                4291
            ],
            [
                4291,
                4311
            ],
            [
                4311,
                4372
            ],
            [
                4372,
                4419
            ],
            [
                4420,
                4425
            ],
            [
                4432,
                4481
            ],
            [
                4490,
                4491
            ],
            [
                4499,
                4519
            ],
            [
                4519,
                4636
            ],
            [
                4638,
                4640
            ],
            [
                4648,
                4650
            ],
            [
                4664,
                4667
            ],
            [
                4667,
                4673
            ],
            [
                4676,
                4678
            ],
            [
                4678,
                4696
            ],
            [
                4703,
                4750
            ],
            [
                4750,
                4751
            ],
            [
                4751,
                4760
            ],
            [
                4760,
                4791
            ],
            [
                4792,
                4813
            ],
            [
                4817,
                4842
            ],
            [
                4863,
                4888
            ],
            [
                4890,
                4958
            ],
            [
                4958,
                5008
            ],
            [
                5008,
                5033
            ],
            [
                5033,
                5035
            ],
            [
                5035,
                5087
            ],
            [
                5087,
                5088
            ],
            [
                5088,
                5096
            ],
            [
                5096,
                5101
            ],
            [
                5106,
                5109
            ],
            [
                5109,
                5153
            ],
            [
                5153,
                5181
            ],
            [
                5182,
                5206
            ],
            [
                5207,
                5222
            ],
            [
                5222,
                5240
            ],
            [
                5240,
                5255
            ],
            [
                5256,
                5290
            ],
            [
                5291,
                5300
            ],
            [
                5300,
                5376
            ],
            [
                5383,
                5385
            ],
            [
                5396,
                5398
            ],
            [
                5398,
                5421
            ],
            [
                5423,
                5483
            ],
            [
                5483,
                5526
            ],
            [
                5527,
                5551
            ],
            [
                5551,
                5650
            ],
            [
                5650,
                5681
            ],
            [
                5681,
                5705
            ],
            [
                5705,
                5758
            ],
            [
                5758,
                5813
            ],
            [
                5814,
                5866
            ],
            [
                5866,
                5867
            ],
            [
                5867,
                5898
            ],
            [
                5898,
                5969
            ],
            [
                5969,
                6004
            ],
            [
                6004,
                6018
            ],
            [
                6018,
                6020
            ],
            [
                6020,
                6055
            ],
            [
                6055,
                6067
            ],
            [
                6067,
                6228
            ],
            [
                6228,
                6247
            ],
            [
                6247,
                6266
            ],
            [
                6266,
                6376
            ],
            [
                6376,
                6409
            ],
            [
                6409,
                6437
            ],
            [
                6437,
                6451
            ],
            [
                6452,
                6456
            ],
            [
                6457,
                6476
            ],
            [
                6476,
                6478
            ],
            [
                6478,
                6529
            ],
            [
                6529,
                6581
            ],
            [
                6583,
                6600
            ],
            [
                6601,
                6605
            ],
            [
                6606,
                6621
            ],
            [
                6622,
                6628
            ],
            [
                6628,
                6637
            ],
            [
                6654,
                6656
            ],
            [
                6656,
                6721
            ],
            [
                6721,
                6724
            ],
            [
                6725,
                6767
            ],
            [
                6767,
                6806
            ],
            [
                6809,
                6819
            ],
            [
                6822,
                6846
            ],
            [
                6846,
                7013
            ],
            [
                7013,
                7040
            ],
            [
                7045,
                7077
            ],
            [
                7077,
                7084
            ],
            [
                7085,
                7104
            ],
            [
                7105,
                7121
            ],
            [
                7126,
                7134
            ],
            [
                7134,
                7136
            ],
            [
                7136,
                7149
            ],
            [
                7150,
                7192
            ],
            [
                7193,
                7200
            ],
            [
                7206,
                7229
            ],
            [
                7230,
                7233
            ],
            [
                7241,
                7256
            ],
            [
                7256,
                7291
            ],
            [
                7300,
                7309
            ],
            [
                7310,
                7313
            ],
            [
                7321,
                7326
            ],
            [
                7327,
                7371
            ],
            [
                7372,
                7384
            ],
            [
                7393,
                7399
            ],
            [
                7400,
                7485
            ],
            [
                7485,
                7524
            ],
            [
                7525,
                7548
            ],
            [
                7548,
                7549
            ],
            [
                7550,
                7553
            ],
            [
                7554,
                7583
            ],
            [
                7584,
                7603
            ],
            [
                7603,
                7668
            ],
            [
                7674,
                7685
            ],
            [
                7700,
                7707
            ],
            [
                7708,
                7719
            ],
            [
                7720,
                7731
            ],
            [
                7749,
                7753
            ],
            [
                7754,
                7769
            ],
            [
                7769,
                7849
            ],
            [
                7850,
                7853
            ],
            [
                7854,
                7891
            ],
            [
                7892,
                7908
            ],
            [
                7908,
                7921
            ],
            [
                7922,
                7927
            ],
            [
                7928,
                7934
            ],
            [
                7935,
                7938
            ],
            [
                7946,
                7959
            ],
            [
                7964,
                7967
            ],
            [
                7973,
                7980
            ],
            [
                7984,
                7996
            ],
            [
                8001,
                8056
            ],
            [
                8056,
                8185
            ],
            [
                8186,
                8189
            ],
            [
                8200,
                8243
            ],
            [
                8243,
                8274
            ],
            [
                8277,
                8310
            ],
            [
                8313,
                8345
            ],
            [
                8345,
                8389
            ],
            [
                8390,
                8426
            ],
            [
                8427,
                8430
            ],
            [
                8434,
                8444
            ],
            [
                8444,
                8476
            ],
            [
                8488,
                8511
            ],
            [
                8511,
                8556
            ],
            [
                8557,
                8560
            ],
            [
                8570,
                8586
            ],
            [
                8586,
                8588
            ],
            [
                8588,
                8645
            ],
            [
                8645,
                8646
            ],
            [
                8647,
                8649
            ],
            [
                8654,
                8656
            ],
            [
                8671,
                8673
            ],
            [
                8683,
                8685
            ],
            [
                8685,
                8734
            ],
            [
                8734,
                8822
            ],
            [
                8822,
                8900
            ],
            [
                8901,
                8903
            ],
            [
                8903,
                8907
            ],
            [
                8908,
                8916
            ],
            [
                8916,
                8917
            ],
            [
                8918,
                8923
            ],
            [
                8924,
                8947
            ],
            [
                8957,
                9007
            ],
            [
                9008,
                9039
            ],
            [
                9039,
                9051
            ],
            [
                9052,
                9155
            ],
            [
                9156,
                9187
            ],
            [
                9187,
                9280
            ],
            [
                9280,
                9282
            ],
            [
                9282,
                9322
            ],
            [
                9322,
                9430
            ],
            [
                9433,
                9510
            ],
            [
                9511,
                9665
            ],
            [
                9665,
                9730
            ],
            [
                9730,
                9755
            ],
            [
                9755,
                9774
            ],
            [
                9774,
                9779
            ],
            [
                9780,
                9794
            ],
            [
                9794,
                9850
            ],
            [
                9850,
                9912
            ],
            [
                9912,
                9971
            ],
            [
                9971,
                10049
            ],
            [
                10049,
                10051
            ],
            [
                10051,
                10052
            ],
            [
                10052,
                10075
            ],
            [
                10075,
                10077
            ],
            [
                10078,
                10083
            ],
            [
                10084,
                10086
            ],
            [
                10097,
                10107
            ],
            [
                10114,
                10116
            ],
            [
                10116,
                10147
            ],
            [
                10155,
                10158
            ],
            [
                10158,
                10202
            ],
            [
                10202,
                10231
            ],
            [
                10232,
                10265
            ],
            [
                10266,
                10307
            ],
            [
                10336,
                10360
            ],
            [
                10361,
                10408
            ],
            [
                10416,
                10462
            ],
            [
                10462,
                10500
            ],
            [
                10503,
                10516
            ],
            [
                10519,
                10561
            ],
            [
                10562,
                10588
            ],
            [
                10589,
                10600
            ],
            [
                10601,
                10611
            ],
            [
                10612,
                10652
            ],
            [
                10652,
                10701
            ],
            [
                10701,
                10738
            ],
            [
                10738,
                10739
            ],
            [
                10739,
                10790
            ],
            [
                10796,
                10821
            ],
            [
                10822,
                10973
            ],
            [
                10973,
                11073
            ],
            [
                11073,
                11104
            ],
            [
                11104,
                11156
            ],
            [
                11161,
                11165
            ],
            [
                11170,
                11220
            ],
            [
                11220,
                11248
            ],
            [
                11248,
                11299
            ],
            [
                11299,
                11348
            ],
            [
                11353,
                11421
            ],
            [
                11421,
                11461
            ],
            [
                11461,
                11490
            ],
            [
                11490,
                11600
            ],
            [
                11603,
                11658
            ],
            [
                11658,
                11697
            ],
            [
                11697,
                11710
            ],
            [
                11720,
                11741
            ],
            [
                11741,
                11742
            ],
            [
                11750,
                11788
            ],
            [
                11788,
                11876
            ],
            [
                11876,
                11905
            ],
            [
                11905,
                11989
            ],
            [
                11989,
                12021
            ],
            [
                12021,
                12130
            ],
            [
                12133,
                12180
            ],
            [
                12180,
                12182
            ],
            [
                12182,
                12271
            ],
            [
                12277,
                12298
            ],
            [
                12303,
                12355
            ],
            [
                12361,
                12368
            ],
            [
                12369,
                12377
            ],
            [
                12378,
                12424
            ],
            [
                12424,
                12470
            ],
            [
                12470,
                12473
            ],
            [
                12473,
                12512
            ],
            [
                12512,
                12528
            ],
            [
                12529,
                12570
            ],
            [
                12570,
                12576
            ],
            [
                12577,
                12599
            ],
            [
                12600,
                12603
            ],
            [
                12607,
                12622
            ],
            [
                12622,
                12660
            ],
            [
                12661,
                12701
            ],
            [
                12701,
                12734
            ],
            [
                12738,
                12776
            ],
            [
                12776,
                12790
            ],
            [
                12790,
                12792
            ],
            [
                12796,
                12819
            ],
            [
                12819,
                12859
            ],
            [
                12860,
                12920
            ],
            [
                12921,
                12937
            ],
            [
                12938,
                12940
            ],
            [
                12941,
                12950
            ],
            [
                12953,
                13038
            ],
            [
                13038,
                13040
            ],
            [
                13040,
                13149
            ],
            [
                13149,
                13158
            ],
            [
                13159,
                13171
            ],
            [
                13178,
                13214
            ],
            [
                13214,
                13240
            ],
            [
                13248,
                13252
            ],
            [
                13253,
                13268
            ],
            [
                13269,
                13284
            ],
            [
                13285,
                13289
            ],
            [
                13294,
                13304
            ],
            [
                13305,
                13323
            ],
            [
                13323,
                13327
            ],
            [
                13328,
                13333
            ],
            [
                13334,
                13363
            ],
            [
                13364,
                13378
            ],
            [
                13379,
                13382
            ],
            [
                13383,
                13410
            ],
            [
                13411,
                13465
            ],
            [
                13471,
                13481
            ],
            [
                13481,
                13502
            ],
            [
                13502,
                13514
            ],
            [
                13519,
                13539
            ],
            [
                13540,
                13570
            ],
            [
                13570,
                13601
            ],
            [
                13602,
                13623
            ],
            [
                13624,
                13646
            ],
            [
                13646,
                13690
            ],
            [
                13690,
                13770
            ],
            [
                13770,
                13804
            ],
            [
                13804,
                13824
            ],
            [
                13824,
                13848
            ],
            [
                13849,
                13913
            ],
            [
                13913,
                13930
            ],
            [
                13930,
                13960
            ],
            [
                13961,
                13969
            ],
            [
                13969,
                13971
            ],
            [
                13972,
                14004
            ],
            [
                14004,
                14041
            ],
            [
                14043,
                14077
            ],
            [
                14077,
                14079
            ],
            [
                14083,
                14132
            ],
            [
                14132,
                14146
            ],
            [
                14147,
                14163
            ],
            [
                14166,
                14188
            ],
            [
                14188,
                14228
            ],
            [
                14231,
                14257
            ],
            [
                14257,
                14319
            ],
            [
                14319,
                14389
            ],
            [
                14389,
                14487
            ],
            [
                14487,
                14511
            ],
            [
                14511,
                14540
            ],
            [
                14540,
                14559
            ],
            [
                14559,
                14607
            ],
            [
                14608,
                14612
            ],
            [
                14612,
                14614
            ],
            [
                14614,
                14616
            ],
            [
                14623,
                14724
            ],
            [
                14725,
                14811
            ],
            [
                14816,
                14818
            ],
            [
                14818,
                14821
            ],
            [
                14829,
                14833
            ],
            [
                14842,
                14861
            ],
            [
                14863,
                14908
            ],
            [
                14909,
                14919
            ],
            [
                14925,
                14942
            ],
            [
                14943,
                14952
            ],
            [
                14953,
                14955
            ],
            [
                14956,
                14991
            ],
            [
                14991,
                15006
            ],
            [
                15006,
                15008
            ],
            [
                15008,
                15058
            ],
            [
                15058,
                15089
            ],
            [
                15098,
                15102
            ],
            [
                15108,
                15122
            ],
            [
                15123,
                15150
            ],
            [
                15159,
                15176
            ],
            [
                15177,
                15180
            ],
            [
                15181,
                15193
            ],
            [
                15193,
                15195
            ],
            [
                15195,
                15239
            ],
            [
                15242,
                15247
            ],
            [
                15263,
                15275
            ],
            [
                15277,
                15355
            ],
            [
                15360,
                15362
            ],
            [
                15362,
                15363
            ],
            [
                15363,
                15396
            ],
            [
                15396,
                15439
            ],
            [
                15439,
                15441
            ],
            [
                15441,
                15489
            ],
            [
                15501,
                15511
            ],
            [
                15511,
                15512
            ],
            [
                15521,
                15529
            ],
            [
                15530,
                15569
            ],
            [
                15570,
                15616
            ],
            [
                15634,
                15662
            ],
            [
                15662,
                15665
            ],
            [
                15674,
                15686
            ],
            [
                15687,
                15690
            ],
            [
                15691,
                15825
            ],
            [
                15826,
                15829
            ],
            [
                15830,
                15833
            ],
            [
                15838,
                15859
            ],
            [
                15863,
                15956
            ],
            [
                15960,
                15966
            ],
            [
                15966,
                16055
            ],
            [
                16078,
                16080
            ],
            [
                16104,
                16117
            ],
            [
                16123,
                16148
            ],
            [
                16150,
                16153
            ],
            [
                16167,
                16185
            ],
            [
                16185,
                16187
            ],
            [
                16187,
                16190
            ],
            [
                16202,
                16232
            ],
            [
                16234,
                16258
            ],
            [
                16258,
                16263
            ],
            [
                16264,
                16267
            ],
            [
                16272,
                16274
            ],
            [
                16274,
                16277
            ],
            [
                16286,
                16293
            ],
            [
                16300,
                16304
            ],
            [
                16307,
                16309
            ],
            [
                16309,
                16433
            ],
            [
                16434,
                16456
            ],
            [
                16456,
                16458
            ],
            [
                16458,
                16493
            ],
            [
                16494,
                16558
            ],
            [
                16558,
                16645
            ],
            [
                16645,
                16679
            ],
            [
                16680,
                16718
            ],
            [
                16718,
                16729
            ],
            [
                16729,
                16739
            ],
            [
                16742,
                16763
            ],
            [
                16763,
                16778
            ],
            [
                16778,
                16782
            ],
            [
                16782,
                16811
            ],
            [
                16811,
                16835
            ],
            [
                16835,
                16892
            ],
            [
                16892,
                16970
            ],
            [
                16970,
                17019
            ],
            [
                17022,
                17070
            ],
            [
                17071,
                17115
            ],
            [
                17115,
                17179
            ],
            [
                17179,
                17295
            ],
            [
                17295,
                17368
            ],
            [
                17376,
                17379
            ],
            [
                17380,
                17392
            ],
            [
                17393,
                17398
            ],
            [
                17399,
                17408
            ],
            [
                17413,
                17423
            ],
            [
                17423,
                17469
            ],
            [
                17470,
                17476
            ],
            [
                17483,
                17602
            ],
            [
                17602,
                17650
            ],
            [
                17650,
                17689
            ],
            [
                17689,
                17806
            ],
            [
                17809,
                17814
            ],
            [
                17818,
                17839
            ],
            [
                17839,
                17874
            ],
            [
                17874,
                17938
            ],
            [
                17941,
                17943
            ],
            [
                17943,
                18007
            ],
            [
                18009,
                18049
            ],
            [
                18049,
                18078
            ],
            [
                18078,
                18146
            ],
            [
                18146,
                18187
            ],
            [
                18187,
                18207
            ],
            [
                18207,
                18232
            ],
            [
                18232,
                18264
            ],
            [
                18264,
                18325
            ],
            [
                18325,
                18437
            ],
            [
                18437,
                18475
            ],
            [
                18476,
                18499
            ],
            [
                18499,
                18555
            ],
            [
                18558,
                18578
            ],
            [
                18578,
                18634
            ]
        ],
        "row_chars": [
            [
                0,
                72
            ],
            [
                72,
                239
            ],
            [
                239,
                347
            ],
            [
                347,
                408
            ],
            [
                408,
                475
            ],
            [
                475,
                475
            ],
            [
                475,
                686
            ],
            [
                686,
                812
            ],
            [
                812,
                901
            ],
            [
                901,
                959
            ],
            [
                959,
                1064
            ],
            [
                1064,
                1148
            ],
            [
                1148,
                1250
            ],
            [
                1250,
                1305
            ],
            [
                1305,
                1448
            ],
            [
                1448,
                1584
            ],
            [
                1584,
                1618
            ],
            [
                1618,
                1723
            ],
            [
                1723,
                1723
            ],
            [
                1723,
                1723
            ],
            [
                1723,
                1919
            ],
            [
                1919,
                1919
            ],
            [
                1919,
                1919
            ],
            [
                1919,
                1919
            ],
            [
                1919,
                1919
            ],
            [
                1919,
                1919
            ],
            [
                1919,
                2083
            ],
            [
                2083,
                2107
            ],
            [
                2107,
                2146
            ],
            [
                2146,
                2249
            ],
            [
                2249,
                2284
            ],
            [
                2284,
                2352
            ],
            [
                2352,
                2424
            ],
            [
                2424,
                2424
            ],
            [
                2424,
                2424
            ],
            [
                2424,
                2464
            ],
            [
                2464,
                2579
            ],
            [
                2579,
                2603
            ],
            [
                2603,
                2641
            ],
            [
                2641,
                2717
            ],
            [
                2717,
                2746
            ],
            [
                2746,
                2766
            ],
            [
                2766,
                2789
            ],
            [
                2789,
                2823
            ],
            [
                2823,
                2823
            ],
            [
                2823,
                2924
            ],
            [
                2924,
                2939
            ],
            [
                2939,
                2957
            ],
            [
                2957,
                3038
            ],
            [
                3038,
                3124
            ],
            [
                3124,
                3240
            ],
            [
                3240,
                3288
            ],
            [
                3288,
                3398
            ],
            [
                3398,
                3527
            ],
            [
                3527,
                3560
            ],
            [
                3560,
                3617
            ],
            [
                3617,
                3696
            ],
            [
                3696,
                3696
            ],
            [
                3696,
                3696
            ],
            [
                3696,
                3696
            ],
            [
                3696,
                3696
            ],
            [
                3696,
                3768
            ],
            [
                3768,
                3948
            ],
            [
                3948,
                4010
            ],
            [
                4010,
                4010
            ],
            [
                4010,
                4153
            ],
            [
                4153,
                4267
            ],
            [
                4267,
                4291
            ],
            [
                4291,
                4311
            ],
            [
                4311,
                4372
            ],
            [
                4372,
                4420
            ],
            [
                4420,
                4519
            ],
            [
                4519,
                4638
            ],
            [
                4638,
                4638
            ],
            [
                4638,
                4638
            ],
            [
                4638,
                4667
            ],
            [
                4667,
                4678
            ],
            [
                4678,
                4750
            ],
            [
                4750,
                4760
            ],
            [
                4760,
                4813
            ],
            [
                4813,
                4813
            ],
            [
                4813,
                4813
            ],
            [
                4813,
                4813
            ],
            [
                4813,
                4863
            ],
            [
                4863,
                4863
            ],
            [
                4863,
                4863
            ],
            [
                4863,
                4890
            ],
            [
                4890,
                4890
            ],
            [
                4890,
                4890
            ],
            [
                4890,
                4890
            ],
            [
                4890,
                4958
            ],
            [
                4958,
                5008
            ],
            [
                5008,
                5035
            ],
            [
                5035,
                5035
            ],
            [
                5035,
                5087
            ],
            [
                5087,
                5109
            ],
            [
                5109,
                5153
            ],
            [
                5153,
                5222
            ],
            [
                5222,
                5255
            ],
            [
                5255,
                5255
            ],
            [
                5255,
                5300
            ],
            [
                5300,
                5398
            ],
            [
                5398,
                5423
            ],
            [
                5423,
                5423
            ],
            [
                5423,
                5423
            ],
            [
                5423,
                5423
            ],
            [
                5423,
                5483
            ],
            [
                5483,
                5551
            ],
            [
                5551,
                5650
            ],
            [
                5650,
                5681
            ],
            [
                5681,
                5705
            ],
            [
                5705,
                5758
            ],
            [
                5758,
                5758
            ],
            [
                5758,
                5758
            ],
            [
                5758,
                5758
            ],
            [
                5758,
                5866
            ],
            [
                5866,
                5898
            ],
            [
                5898,
                5898
            ],
            [
                5898,
                5969
            ],
            [
                5969,
                6004
            ],
            [
                6004,
                6020
            ],
            [
                6020,
                6020
            ],
            [
                6020,
                6055
            ],
            [
                6055,
                6067
            ],
            [
                6067,
                6228
            ],
            [
                6228,
                6228
            ],
            [
                6228,
                6228
            ],
            [
                6228,
                6247
            ],
            [
                6247,
                6266
            ],
            [
                6266,
                6376
            ],
            [
                6376,
                6409
            ],
            [
                6409,
                6437
            ],
            [
                6437,
                6478
            ],
            [
                6478,
                6529
            ],
            [
                6529,
                6656
            ],
            [
                6656,
                6721
            ],
            [
                6721,
                6767
            ],
            [
                6767,
                6846
            ],
            [
                6846,
                7013
            ],
            [
                7013,
                7077
            ],
            [
                7077,
                7136
            ],
            [
                7136,
                7256
            ],
            [
                7256,
                7291
            ],
            [
                7291,
                7291
            ],
            [
                7291,
                7372
            ],
            [
                7372,
                7485
            ],
            [
                7485,
                7603
            ],
            [
                7603,
                7720
            ],
            [
                7720,
                7908
            ],
            [
                7908,
                8056
            ],
            [
                8056,
                8243
            ],
            [
                8243,
                8345
            ],
            [
                8345,
                8444
            ],
            [
                8444,
                8444
            ],
            [
                8444,
                8511
            ],
            [
                8511,
                8511
            ],
            [
                8511,
                8588
            ],
            [
                8588,
                8685
            ],
            [
                8685,
                8822
            ],
            [
                8822,
                8918
            ],
            [
                8918,
                8918
            ],
            [
                8918,
                9039
            ],
            [
                9039,
                9187
            ],
            [
                9187,
                9282
            ],
            [
                9282,
                9322
            ],
            [
                9322,
                9511
            ],
            [
                9511,
                9511
            ],
            [
                9511,
                9665
            ],
            [
                9665,
                9730
            ],
            [
                9730,
                9755
            ],
            [
                9755,
                9774
            ],
            [
                9774,
                9794
            ],
            [
                9794,
                9850
            ],
            [
                9850,
                9912
            ],
            [
                9912,
                9971
            ],
            [
                9971,
                10051
            ],
            [
                10051,
                10075
            ],
            [
                10075,
                10116
            ],
            [
                10116,
                10158
            ],
            [
                10158,
                10202
            ],
            [
                10202,
                10202
            ],
            [
                10202,
                10361
            ],
            [
                10361,
                10361
            ],
            [
                10361,
                10462
            ],
            [
                10462,
                10519
            ],
            [
                10519,
                10519
            ],
            [
                10519,
                10562
            ],
            [
                10562,
                10562
            ],
            [
                10562,
                10562
            ],
            [
                10562,
                10652
            ],
            [
                10652,
                10701
            ],
            [
                10701,
                10738
            ],
            [
                10738,
                10973
            ],
            [
                10973,
                11073
            ],
            [
                11073,
                11104
            ],
            [
                11104,
                11220
            ],
            [
                11220,
                11299
            ],
            [
                11299,
                11421
            ],
            [
                11421,
                11461
            ],
            [
                11461,
                11490
            ],
            [
                11490,
                11603
            ],
            [
                11603,
                11603
            ],
            [
                11603,
                11658
            ],
            [
                11658,
                11697
            ],
            [
                11697,
                11788
            ],
            [
                11788,
                11876
            ],
            [
                11876,
                11905
            ],
            [
                11905,
                11905
            ],
            [
                11905,
                11989
            ],
            [
                11989,
                12021
            ],
            [
                12021,
                12182
            ],
            [
                12182,
                12368
            ],
            [
                12368,
                12368
            ],
            [
                12368,
                12368
            ],
            [
                12368,
                12424
            ],
            [
                12424,
                12473
            ],
            [
                12473,
                12512
            ],
            [
                12512,
                12570
            ],
            [
                12570,
                12622
            ],
            [
                12622,
                12701
            ],
            [
                12701,
                12776
            ],
            [
                12776,
                12792
            ],
            [
                12792,
                12792
            ],
            [
                12792,
                12792
            ],
            [
                12792,
                12792
            ],
            [
                12792,
                12792
            ],
            [
                12792,
                12819
            ],
            [
                12819,
                12953
            ],
            [
                12953,
                12953
            ],
            [
                12953,
                12953
            ],
            [
                12953,
                13040
            ],
            [
                13040,
                13149
            ],
            [
                13149,
                13214
            ],
            [
                13214,
                13323
            ],
            [
                13323,
                13411
            ],
            [
                13411,
                13411
            ],
            [
                13411,
                13502
            ],
            [
                13502,
                13570
            ],
            [
                13570,
                13646
            ],
            [
                13646,
                13690
            ],
            [
                13690,
                13770
            ],
            [
                13770,
                13804
            ],
            [
                13804,
                13824
            ],
            [
                13824,
                13913
            ],
            [
                13913,
                13930
            ],
            [
                13930,
                13969
            ],
            [
                13969,
                14004
            ],
            [
                14004,
                14043
            ],
            [
                14043,
                14043
            ],
            [
                14043,
                14043
            ],
            [
                14043,
                14043
            ],
            [
                14043,
                14079
            ],
            [
                14079,
                14132
            ],
            [
                14132,
                14188
            ],
            [
                14188,
                14188
            ],
            [
                14188,
                14231
            ],
            [
                14231,
                14231
            ],
            [
                14231,
                14231
            ],
            [
                14231,
                14319
            ],
            [
                14319,
                14389
            ],
            [
                14389,
                14487
            ],
            [
                14487,
                14487
            ],
            [
                14487,
                14540
            ],
            [
                14540,
                14614
            ],
            [
                14614,
                14614
            ],
            [
                14614,
                14725
            ],
            [
                14725,
                14818
            ],
            [
                14818,
                14863
            ],
            [
                14863,
                14991
            ],
            [
                14991,
                15008
            ],
            [
                15008,
                15058
            ],
            [
                15058,
                15058
            ],
            [
                15058,
                15195
            ],
            [
                15195,
                15277
            ],
            [
                15277,
                15362
            ],
            [
                15362,
                15396
            ],
            [
                15396,
                15441
            ],
            [
                15441,
                15570
            ],
            [
                15570,
                15570
            ],
            [
                15570,
                15662
            ],
            [
                15662,
                15826
            ],
            [
                15826,
                15966
            ],
            [
                15966,
                16187
            ],
            [
                16187,
                16258
            ],
            [
                16258,
                16274
            ],
            [
                16274,
                16309
            ],
            [
                16309,
                16309
            ],
            [
                16309,
                16309
            ],
            [
                16309,
                16309
            ],
            [
                16309,
                16458
            ],
            [
                16458,
                16558
            ],
            [
                16558,
                16680
            ],
            [
                16680,
                16680
            ],
            [
                16680,
                16680
            ],
            [
                16680,
                16718
            ],
            [
                16718,
                16729
            ],
            [
                16729,
                16763
            ],
            [
                16763,
                16778
            ],
            [
                16778,
                16782
            ],
            [
                16782,
                16782
            ],
            [
                16782,
                16811
            ],
            [
                16811,
                16835
            ],
            [
                16835,
                16892
            ],
            [
                16892,
                16970
            ],
            [
                16970,
                17022
            ],
            [
                17022,
                17022
            ],
            [
                17022,
                17115
            ],
            [
                17115,
                17179
            ],
            [
                17179,
                17295
            ],
            [
                17295,
                17423
            ],
            [
                17423,
                17602
            ],
            [
                17602,
                17650
            ],
            [
                17650,
                17689
            ],
            [
                17689,
                17839
            ],
            [
                17839,
                17874
            ],
            [
                17874,
                17943
            ],
            [
                17943,
                18049
            ],
            [
                18049,
                18078
            ],
            [
                18078,
                18146
            ],
            [
                18146,
                18187
            ],
            [
                18187,
                18207
            ],
            [
                18207,
                18207
            ],
            [
                18207,
                18232
            ],
            [
                18232,
                18264
            ],
            [
                18264,
                18325
            ],
            [
                18325,
                18437
            ],
            [
                18437,
                18499
            ],
            [
                18499,
                18555
            ],
            [
                18555,
                18634
            ]
        ]
    }
}