{
    "original": {
        "text": "March came, and still the Chancellor of the Exchequer held his position. In the early days of March there was given in the House a certain parliamentary explanation on the subject, which, however, did not explain very much to any person. A statement was made which was declared by the persons making it to be altogether satisfactory, but nobody else seemed to find any satisfaction in it. The big wigs of the Cabinet had made an arrangement which, from the language used by them on this occasion, they must be supposed to have regarded as hardly less permanent than the stars; but everybody else protested that the Government was going to pieces; and Mr. Bott was heard to declare in clubs and lobbies, and wherever he could get a semi-public, political hearing, that this kind of thing wouldn't do. Lord Brock must either blow hot or cold. If he chose to lean upon Mr. Palliser, he might lean upon him, and Mr. Palliser would not be found wanting. In such case no opposition could touch Lord Brock or the Government. That was Mr. Bott's opinion. But if Lord Brock did not so choose, why, in that case, he must expect that Mr. Palliser, and Mr. Palliser's friends, would--. Mr. Bott did not say what they would do; but he was supposed by those who understood the matter to hint at an Opposition lobby, and adverse divisions, and to threaten Lord Brock with the open enmity of Mr. Palliser,--and of Mr. Palliser's great follower.\n\"This kind of thing won't do long, you know,\" repeated Mr. Bott for the second or third time, as he stood upon the rug before the fire at his club, with one or two of his young friends around him.\n\"I suppose not,\" said Calder Jones, the hunting Member of Parliament whom we once met at Roebury. \"Planty Pall won't stand it, I should say.\"\n\"What can he do?\" asked another, an unfledged Member who was not as yet quite settled as to the leadership under which he intended to work.\n\"What can he do?\" said Mr. Bott, who on such an occasion as this could be very great,--who, for a moment, could almost feel that he might become a leader of a party for himself, and some day institute a Bott Ministry. \"What can he do? You will very shortly see what he can do. He can make himself the master of the occasion. If Lord Brock doesn't look about him, he'll find that Mr. Palliser will be in the Cabinet without his help.\"\n\"You don't mean to say that the Queen will send for Planty Pall!\" said the young Member.\n\"I mean to say that the Queen will send for any one that the House of Commons may direct her to call upon,\" said Mr. Bott, who conceived himself to have gauged the very depths of our glorious Constitution. \"How hard it is to make any one understand that the Queen has really nothing to do with it!\"\n\"Come, Bott, draw it mild,\" said Calder Jones, whose loyalty was shocked by the utter Manchesterialism of his political friend.\n\"Not if I know it,\" said Mr. Bott, with something of grandeur in his tone and countenance. \"I never drew it mild yet, and I shan't begin now. All our political offences against civilization have come from men drawing it mild, as you call it. Why is it that Englishmen can't read and write as Americans do? Why can't they vote as they do even in Imperial France? Why are they serfs, less free than those whose chains were broken the other day in Russia? Why is the Spaniard more happy, and the Italian more contented? Because men in power have been drawing it mild!\" And Mr. Bott made an action with his hand as though he were drawing up beer from a patent tap.\n\"But you can't set aside Her Majesty like that, you know,\" said the young Member, who had been presented, and whose mother's old-world notions about the throne still clung to him.\n\"I should be very sorry,\" said Mr. Bott; \"I'm no republican.\" With all his constitutional love, Mr. Bott did not know what the word republican meant. \"I mean no disrespect to the throne. The throne in its place is very well. But the power of governing this great nation does not rest with the throne. It is contained within the four walls of the House of Commons. That is the great truth which all young Members should learn, and take to their hearts.\"\n\"And you think Planty Pall will become Prime Minister?\" said Calder Jones.\n\"I haven't said that; but there are more unlikely things. Among young men I know no man more likely. But I certainly think this,--that if Lord Brock doesn't take him into the Cabinet, Lord Brock won't long remain there himself.\"\nIn the meantime the election came on in the Chelsea districts, and the whole of the south-western part of the metropolis was covered with posters bearing George Vavasor's name. \"Vote for Vavasor and the River Bank.\" That was the cry with which he went to the electors; and though it must be presumed that it was understood by some portion of the Chelsea electors, it was perfectly unintelligible to the majority of those who read it. His special acquaintances and his general enemies called him Viscount Riverbank, and he was pestered on all sides by questions as to Father Thames. It was Mr. Scruby who invented the legend, and who gave George Vavasor an infinity of trouble by the invention. There was a question in those days as to embanking the river from the Houses of Parliament up to the remote desolations of further Pimlico, and Mr. Scruby recommended the coming Member to pledge himself that he would have the work carried on even to Battersea Bridge. \"You must have a subject,\" pleaded Mr. Scruby. \"No young Member can do anything without a subject. And it should be local;--that is to say, if you have anything of a constituency. Such a subject as that, if it's well worked, may save you thousands of pounds--thousands of pounds at future elections.\"\n\"It won't save me anything at this one, I take it.\"\n\"But it may secure the seat, Mr. Vavasor, and afterwards make you the most popular metropolitan Member in the House; that is, with your own constituency. Only look at the money that would be spent in the districts if that were done! It would come to millions, sir!\"\n\"But it never will be done.\"\n\"What matters that?\" and Mr. Scruby almost became eloquent as he explained the nature of a good parliamentary subject. \"You should work it up, so as to be able to discuss it at all points. Get the figures by heart, and then, as nobody else will do so, nobody can put you down. Of course it won't be done. If it were done, that would be an end of it, and your bread would be taken out of your mouth. But you can always promise it at the hustings, and can always demand it in the House. I've known men who've walked into as much as two thousand a year, permanent place, on the strength of a worse subject than that!\"\nVavasor allowed Mr. Scruby to manage the matter for him, and took up the subject of the River Bank. \"Vavasor and the River Bank\" was carried about by an army of men with iron shoulder-straps, and huge pasteboard placards six feet high on the top of them. You would think, as you saw the long rows, that the men were being marshalled to their several routes; but they always kept together--four-and-twenty at the heels of each other. \"One placard at a time would strike the eye,\" said Mr. Vavasor, counting the expense up to himself. \"There's no doubt of it,\" said Mr. Scruby in reply. \"One placard will do that, if it's big enough; but it takes four-and-twenty to touch the imagination.\" And then sides of houses were covered with that shibboleth--\"Vavasor and the River Bank\"--the same words repeated in columns down the whole sides of houses. Vavasor himself declared that he was ashamed to walk among his future constituents, so conspicuous had his name become. Grimes saw it, and was dismayed. At first, Grimes ridiculed the cry with all his publican's wit. \"Unless he mean to drown hisself in the Reach, it's hard to say what he do mean by all that gammon about the River Bank,\" said Grimes, as he canvassed for the other Liberal candidate. But, after a while, Grimes was driven to confess that Mr. Scruby knew what he was about. \"He is a sharp 'un, that he is,\" said Grimes in the inside bar of the \"Handsome Man;\" and he almost regretted that he had left the leadership of Mr. Scruby, although he knew that on this occasion he would not have gotten his odd money.\nGeorge Vavasor, with much labour, actually did get up the subject of the River Bank. He got himself introduced to men belonging to the Metropolitan Board, and went manfully into the matter of pounds, shillings, and pence. He was able even to work himself into an apparent heat when he was told that the thing was out of the question; and soon found that he had disciples who really believed in him. If he could have brought himself to believe in the thing,--if he could have been induced himself to care whether Chelsea was to be embanked or no, the work would not have been so difficult to him. In that case it would have done good to him, if to no one else. But such belief was beyond him. He had gone too far in life to be capable of believing in, or of caring for, such things. He was ambitious of having a hand in the government of his country, but he was not capable of caring even for that.\nBut he worked. He worked hard, and spoke vehemently, and promised the men of Chelsea, Pimlico, and Brompton that the path of London westwards had hardly commenced as yet. Sloane Street should be the new Cheapside. Squares should arise around the Chelsea barracks, with sides open to the water, for which Belgravia would be deserted. There should be palaces there for the rich, because the rich spend their riches; but no rich man's palace should interfere with the poor man's right to the River Bank. Three millions and a half should be spent on the noble street to be constructed, the grandest pathway that the world should ever yet have seen; three millions and a half to be drawn from,--to be drawn from anywhere except from Chelsea;--from the bloated money-bags of the City Corporation, Vavasor once ventured to declare, amidst the encouraging shouts of the men of Chelsea. Mr. Scruby was forced to own that his pupil worked the subject well. \"Upon my word, that was uncommon good,\" he said, almost patting Vavasor on the back, after a speech in which he had vehemently asserted that his ambition to represent the Chelsea districts had all come of his long-fixed idea that the glory of future London would be brought about by the embankment of the river at Chelsea.\nBut armies of men carrying big boards, and public-houses open at every corner, and placards in which the letters are three feet long, cost money. Those few modest hundreds which Mr. Scruby had already received before the work began, had been paid on the supposition that the election would not take place till September. Mr. Scruby made an early request, a very early request, that a further sum of fifteen hundred pounds should be placed in his hands; and he did this in a tone which clearly signified that not a man would be sent about through the streets, or a poster put upon a wall, till this request had been conceded. Mr. Scruby was in possession of two very distinct manners of address. In his jovial moods, when he was instigating his clients to fight their battles well, it might almost be thought that he was doing it really for the love of the thing; and some clients, so thinking, had believed for a few hours that Scruby, in his jolly, passionate eagerness, would pour out his own money like dust, trusting implicitly to future days for its return. But such clients had soon encountered Mr. Scruby's other manner, and had perceived that they were mistaken.\nThe thing had come so suddenly upon George Vavasor that there was not time for him to carry on his further operations through his sister. Had he written to Kate,--let him have written in what language he would,--she would have first rejoined by a negative, and there would have been a correspondence before he had induced her to comply. He thought of sending for her by telegram, but even in that there would have been too much delay. He resolved, therefore, to make his application to Alice himself, and he wrote to her, explaining his condition. The election had come upon him quite suddenly, as she knew, he said. He wanted two thousand pounds instantly, and felt little scruple in asking her for it, as he was aware that the old Squire would be only too glad to saddle the property with a legacy to Alice for the repayment of this money, though he would not have advanced a shilling himself for the purpose of the election. Then he said a word or two as to his prolonged absence from Queen Anne Street. He had not been there because he had felt, from her manner when they last met, that she would for a while prefer to be left free from the unavoidable excitement of such interviews. But should he be triumphant in his present contest, he should go to her to share his triumph with her; or, should he fail, he should go to her to console him in his failure.\nWithin three days he heard from her, saying that the money would be at once placed to his credit. She sent him also her candid good wishes for success in his enterprise, but beyond this her letter said nothing. There was no word of love,--no word of welcome,--no expression of a desire to see him. Vavasor, as he perceived all this in the reading of her note, felt a triumph in the possession of her money. She was ill-using him by her coldness, and there was comfort in revenge. \"It serves her right,\" he said to himself. \"She should have married me at once when she said she would do so, and then it would have been my own.\"\nWhen Mr. Tombe had communicated with John Grey on the matter of this increased demand,--this demand which Mr. Tombe began to regard as carrying a love-affair rather too far,--Grey had telegraphed back that Vavasor's demand for money, if made through Mr. John Vavasor, was to be honoured to the extent of five thousand pounds. Mr. Tombe raised his eyebrows, and reflected that some men were very foolish. But John Grey's money matters were of such a nature as to make Mr. Tombe know that he must do as he was bidden; and the money was paid to George Vavasor's account.\nHe told Kate nothing of this. Why should he trouble himself to do so? Indeed, at this time he wrote no letters to his sister, though she twice sent to him, knowing what his exigencies would be, and made further tenders of her own money. He could not reply to these offers without telling her that money had been forthcoming from that other quarter, and so he left them unanswered.\nIn the meantime the battle went on gloriously. Mr. Travers, the other Liberal candidate, spent his money freely,--or else some other person did so on his behalf. When Mr. Scruby mentioned this last alternative to George Vavasor, George cursed his own luck in that he had never found such backers. \"I don't call a man half a Member when he's brought in like that,\" said Mr. Scruby, comforting him. \"He can't do what he likes with his vote. He ain't independent. You never hear of those fellows getting anything good. Pay for the article yourself, Mr. Vavasor, and then it's your own. That's what I always say.\"\nMr. Grimes went to work strenuously, almost fiercely, in the opposite interest, telling all that he knew, and perhaps more than he knew, of Vavasor's circumstances. He was at work morning, noon, and night, not only in his own neighbourhood, but among those men on the river bank of whom he had spoken so much in his interview with Vavasor in Cecil Street. The entire Vavasorian army with its placards was entirely upset on more than one occasion, and was once absolutely driven ignominiously into the river mud. And all this was done under the direction of Mr. Grimes. Vavasor himself was pelted with offal from the sinking tide, so that the very name of the River Bank became odious to him. He was a man who did not like to have his person touched, and when they hustled him he became angry. \"Lord love you, Mr. Vavasor,\" said Scruby, \"that's nothing! I've had a candidate so mauled,--it was in the Hamlets, I think,--that there wasn't a spot on him that wasn't painted with rotten eggs. The smell was something quite awful. But I brought him in, through it all.\"\nAnd Mr. Scruby at last did as much for George Vavasor as he had done for the hero of the Hamlets. At the close of the poll Vavasor's name stood at the head by a considerable majority, and Scruby comforted him by saying that Travers certainly wouldn't stand the expense of a petition, as the seat was to be held only for a few months.\n\"And you've done it very cheap, Mr. Vavasor,\" said Scruby, \"considering that the seat is metropolitan. I do say that you have done it cheap. Another thousand, or twelve hundred, will cover everything--say thirteen, perhaps, at the outside. And when you shall have fought the battle once again, you'll have paid your footing, and the fellows will let you in almost for nothing after that.\"\nA further sum of thirteen hundred pounds was wanted at once, and then the whole thing was to be repeated over again in six months' time! This was not consolatory. But, nevertheless, there was a triumph in the thing itself which George Vavasor was man enough to enjoy. It would be something to have sat in the House of Commons, though it should only have been for half a session.",
        "paragraph_chars": [
            [
                0,
                1429
            ],
            [
                1429,
                1626
            ],
            [
                1626,
                1768
            ],
            [
                1768,
                1908
            ],
            [
                1908,
                2342
            ],
            [
                2342,
                2431
            ],
            [
                2431,
                2730
            ],
            [
                2730,
                2858
            ],
            [
                2858,
                3519
            ],
            [
                3519,
                3699
            ],
            [
                3699,
                4152
            ],
            [
                4152,
                4227
            ],
            [
                4227,
                4456
            ],
            [
                4456,
                5719
            ],
            [
                5719,
                5771
            ],
            [
                5771,
                6037
            ],
            [
                6037,
                6066
            ],
            [
                6066,
                6681
            ],
            [
                6681,
                8252
            ],
            [
                8252,
                9150
            ],
            [
                9150,
                10420
            ],
            [
                10420,
                11591
            ],
            [
                11591,
                12953
            ],
            [
                12953,
                13580
            ],
            [
                13580,
                14148
            ],
            [
                14148,
                14529
            ],
            [
                14529,
                15139
            ],
            [
                15139,
                16204
            ],
            [
                16204,
                16538
            ],
            [
                16538,
                16927
            ],
            [
                16927,
                17305
            ]
        ],
        "segment_chars": [
            [
                0,
                73
            ],
            [
                73,
                238
            ],
            [
                238,
                389
            ],
            [
                389,
                800
            ],
            [
                800,
                841
            ],
            [
                841,
                949
            ],
            [
                949,
                1018
            ],
            [
                1018,
                1047
            ],
            [
                1047,
                1174
            ],
            [
                1174,
                1429
            ],
            [
                1429,
                1626
            ],
            [
                1626,
                1724
            ],
            [
                1724,
                1768
            ],
            [
                1768,
                1786
            ],
            [
                1786,
                1908
            ],
            [
                1908,
                1926
            ],
            [
                1926,
                2126
            ],
            [
                2126,
                2143
            ],
            [
                2143,
                2185
            ],
            [
                2185,
                2233
            ],
            [
                2233,
                2342
            ],
            [
                2342,
                2408
            ],
            [
                2408,
                2431
            ],
            [
                2431,
                2637
            ],
            [
                2637,
                2730
            ],
            [
                2730,
                2858
            ],
            [
                2858,
                2949
            ],
            [
                2949,
                3000
            ],
            [
                3000,
                3100
            ],
            [
                3100,
                3164
            ],
            [
                3164,
                3220
            ],
            [
                3220,
                3311
            ],
            [
                3311,
                3375
            ],
            [
                3375,
                3424
            ],
            [
                3424,
                3519
            ],
            [
                3519,
                3699
            ],
            [
                3699,
                3761
            ],
            [
                3761,
                3849
            ],
            [
                3849,
                3886
            ],
            [
                3886,
                3924
            ],
            [
                3924,
                4000
            ],
            [
                4000,
                4063
            ],
            [
                4063,
                4152
            ],
            [
                4152,
                4208
            ],
            [
                4208,
                4227
            ],
            [
                4227,
                4285
            ],
            [
                4285,
                4328
            ],
            [
                4328,
                4456
            ],
            [
                4456,
                4633
            ],
            [
                4633,
                4672
            ],
            [
                4672,
                4890
            ],
            [
                4890,
                5038
            ],
            [
                5038,
                5150
            ],
            [
                5150,
                5418
            ],
            [
                5418,
                5465
            ],
            [
                5465,
                5517
            ],
            [
                5517,
                5598
            ],
            [
                5598,
                5719
            ],
            [
                5719,
                5771
            ],
            [
                5771,
                5925
            ],
            [
                5925,
                6004
            ],
            [
                6004,
                6037
            ],
            [
                6037,
                6066
            ],
            [
                6066,
                6087
            ],
            [
                6087,
                6185
            ],
            [
                6185,
                6255
            ],
            [
                6255,
                6343
            ],
            [
                6343,
                6371
            ],
            [
                6371,
                6465
            ],
            [
                6465,
                6551
            ],
            [
                6551,
                6681
            ],
            [
                6681,
                6781
            ],
            [
                6781,
                6936
            ],
            [
                6936,
                7114
            ],
            [
                7114,
                7214
            ],
            [
                7214,
                7266
            ],
            [
                7266,
                7369
            ],
            [
                7369,
                7526
            ],
            [
                7526,
                7646
            ],
            [
                7646,
                7679
            ],
            [
                7679,
                7743
            ],
            [
                7743,
                7927
            ],
            [
                7927,
                8016
            ],
            [
                8016,
                8252
            ],
            [
                8252,
                8337
            ],
            [
                8337,
                8474
            ],
            [
                8474,
                8651
            ],
            [
                8651,
                8848
            ],
            [
                8848,
                8912
            ],
            [
                8912,
                8944
            ],
            [
                8944,
                9034
            ],
            [
                9034,
                9150
            ],
            [
                9150,
                9165
            ],
            [
                9165,
                9321
            ],
            [
                9321,
                9364
            ],
            [
                9364,
                9483
            ],
            [
                9483,
                9651
            ],
            [
                9651,
                10028
            ],
            [
                10028,
                10097
            ],
            [
                10097,
                10420
            ],
            [
                10420,
                10566
            ],
            [
                10566,
                10741
            ],
            [
                10741,
                11045
            ],
            [
                11045,
                11115
            ],
            [
                11115,
                11483
            ],
            [
                11483,
                11591
            ],
            [
                11591,
                11729
            ],
            [
                11729,
                11928
            ],
            [
                11928,
                12026
            ],
            [
                12026,
                12139
            ],
            [
                12139,
                12208
            ],
            [
                12208,
                12519
            ],
            [
                12519,
                12598
            ],
            [
                12598,
                12779
            ],
            [
                12779,
                12953
            ],
            [
                12953,
                13051
            ],
            [
                13051,
                13164
            ],
            [
                13164,
                13251
            ],
            [
                13251,
                13360
            ],
            [
                13360,
                13433
            ],
            [
                13433,
                13476
            ],
            [
                13476,
                13580
            ],
            [
                13580,
                13906
            ],
            [
                13906,
                13984
            ],
            [
                13984,
                14148
            ],
            [
                14148,
                14178
            ],
            [
                14178,
                14218
            ],
            [
                14218,
                14385
            ],
            [
                14385,
                14529
            ],
            [
                14529,
                14576
            ],
            [
                14576,
                14691
            ],
            [
                14691,
                14826
            ],
            [
                14826,
                14926
            ],
            [
                14926,
                14968
            ],
            [
                14968,
                14990
            ],
            [
                14990,
                15045
            ],
            [
                15045,
                15112
            ],
            [
                15112,
                15139
            ],
            [
                15139,
                15304
            ],
            [
                15304,
                15495
            ],
            [
                15495,
                15651
            ],
            [
                15651,
                15708
            ],
            [
                15708,
                15831
            ],
            [
                15831,
                15932
            ],
            [
                15932,
                15992
            ],
            [
                15992,
                16128
            ],
            [
                16128,
                16165
            ],
            [
                16165,
                16204
            ],
            [
                16204,
                16302
            ],
            [
                16302,
                16538
            ],
            [
                16538,
                16641
            ],
            [
                16641,
                16679
            ],
            [
                16679,
                16778
            ],
            [
                16778,
                16927
            ],
            [
                16927,
                17064
            ],
            [
                17064,
                17090
            ],
            [
                17090,
                17195
            ],
            [
                17195,
                17305
            ]
        ],
        "overlap_chars": [
            [
                0,
                73
            ],
            [
                73,
                75
            ],
            [
                80,
                85
            ],
            [
                94,
                130
            ],
            [
                139,
                222
            ],
            [
                236,
                238
            ],
            [
                577,
                580
            ],
            [
                405,
                416
            ],
            [
                596,
                659
            ],
            [
                763,
                800
            ],
            [
                800,
                815
            ],
            [
                839,
                841
            ],
            [
                841,
                852
            ],
            [
                866,
                879
            ],
            [
                908,
                949
            ],
            [
                1047,
                1083
            ],
            [
                1103,
                1135
            ],
            [
                1137,
                1140
            ],
            [
                1156,
                1170
            ],
            [
                1174,
                1225
            ],
            [
                1270,
                1280
            ],
            [
                1314,
                1388
            ],
            [
                1391,
                1401
            ],
            [
                1427,
                1429
            ],
            [
                1429,
                1492
            ],
            [
                1521,
                1534
            ],
            [
                1548,
                1626
            ],
            [
                1626,
                1702
            ],
            [
                1708,
                1724
            ],
            [
                1724,
                1768
            ],
            [
                1768,
                1786
            ],
            [
                1786,
                1832
            ],
            [
                1840,
                1845
            ],
            [
                1887,
                1889
            ],
            [
                1906,
                1908
            ],
            [
                1908,
                1926
            ],
            [
                1926,
                1939
            ],
            [
                1995,
                2072
            ],
            [
                2077,
                2084
            ],
            [
                2124,
                2126
            ],
            [
                2143,
                2185
            ],
            [
                2233,
                2342
            ],
            [
                2342,
                2408
            ],
            [
                2408,
                2431
            ],
            [
                2431,
                2432
            ],
            [
                2451,
                2474
            ],
            [
                2483,
                2552
            ],
            [
                2635,
                2637
            ],
            [
                2637,
                2638
            ],
            [
                2685,
                2727
            ],
            [
                2730,
                2742
            ],
            [
                2748,
                2750
            ],
            [
                2755,
                2802
            ],
            [
                2856,
                2858
            ],
            [
                2858,
                2859
            ],
            [
                2980,
                2988
            ],
            [
                2875,
                2891
            ],
            [
                2911,
                2916
            ],
            [
                2998,
                3000
            ],
            [
                3000,
                3062
            ],
            [
                3098,
                3100
            ],
            [
                3100,
                3103
            ],
            [
                3126,
                3131
            ],
            [
                3115,
                3125
            ],
            [
                3132,
                3164
            ],
            [
                3164,
                3220
            ],
            [
                3220,
                3232
            ],
            [
                3240,
                3254
            ],
            [
                3233,
                3238
            ],
            [
                3300,
                3311
            ],
            [
                3375,
                3405
            ],
            [
                3414,
                3416
            ],
            [
                3421,
                3423
            ],
            [
                3519,
                3599
            ],
            [
                3697,
                3699
            ],
            [
                3740,
                3758
            ],
            [
                3722,
                3738
            ],
            [
                3793,
                3794
            ],
            [
                3804,
                3830
            ],
            [
                3842,
                3849
            ],
            [
                3849,
                3886
            ],
            [
                3924,
                4000
            ],
            [
                4000,
                4061
            ],
            [
                4152,
                4208
            ],
            [
                4208,
                4227
            ],
            [
                4227,
                4285
            ],
            [
                4328,
                4349
            ],
            [
                4357,
                4427
            ],
            [
                4433,
                4445
            ],
            [
                4428,
                4432
            ],
            [
                4446,
                4456
            ],
            [
                4456,
                4522
            ],
            [
                4540,
                4553
            ],
            [
                4577,
                4632
            ],
            [
                4633,
                4672
            ],
            [
                4672,
                4728
            ],
            [
                4820,
                4854
            ],
            [
                4868,
                4890
            ],
            [
                4975,
                4977
            ],
            [
                4940,
                4946
            ],
            [
                4951,
                4969
            ],
            [
                4994,
                5003
            ],
            [
                4969,
                4974
            ],
            [
                4978,
                4990
            ],
            [
                5004,
                5016
            ],
            [
                5023,
                5037
            ],
            [
                5038,
                5072
            ],
            [
                5148,
                5150
            ],
            [
                5150,
                5161
            ],
            [
                5171,
                5184
            ],
            [
                5188,
                5194
            ],
            [
                5201,
                5246
            ],
            [
                5281,
                5316
            ],
            [
                5185,
                5187
            ],
            [
                5335,
                5344
            ],
            [
                5353,
                5388
            ],
            [
                5416,
                5417
            ],
            [
                5418,
                5463
            ],
            [
                5539,
                5540
            ],
            [
                5465,
                5466
            ],
            [
                5517,
                5539
            ],
            [
                5596,
                5598
            ],
            [
                5625,
                5627
            ],
            [
                5643,
                5665
            ],
            [
                5687,
                5719
            ],
            [
                5719,
                5771
            ],
            [
                5771,
                5816
            ],
            [
                5828,
                5886
            ],
            [
                5923,
                5925
            ],
            [
                5925,
                5987
            ],
            [
                5993,
                6004
            ],
            [
                6004,
                6012
            ],
            [
                6021,
                6037
            ],
            [
                6037,
                6066
            ],
            [
                6066,
                6071
            ],
            [
                6080,
                6084
            ],
            [
                6084,
                6087
            ],
            [
                6091,
                6101
            ],
            [
                6183,
                6185
            ],
            [
                6255,
                6284
            ],
            [
                6291,
                6328
            ],
            [
                6333,
                6336
            ],
            [
                6341,
                6343
            ],
            [
                6343,
                6371
            ],
            [
                6465,
                6519
            ],
            [
                6527,
                6549
            ],
            [
                6681,
                6741
            ],
            [
                6877,
                6881
            ],
            [
                6893,
                6901
            ],
            [
                6781,
                6809
            ],
            [
                6814,
                6845
            ],
            [
                6934,
                6936
            ],
            [
                7369,
                7372
            ],
            [
                7378,
                7411
            ],
            [
                7429,
                7456
            ],
            [
                7526,
                7533
            ],
            [
                7542,
                7578
            ],
            [
                7494,
                7502
            ],
            [
                7608,
                7645
            ],
            [
                7689,
                7695
            ],
            [
                7779,
                7782
            ],
            [
                7727,
                7735
            ],
            [
                7696,
                7713
            ],
            [
                7679,
                7688
            ],
            [
                7881,
                7927
            ],
            [
                7927,
                7946
            ],
            [
                7976,
                8008
            ],
            [
                8014,
                8015
            ],
            [
                8016,
                8019
            ],
            [
                8023,
                8035
            ],
            [
                8041,
                8060
            ],
            [
                8102,
                8171
            ],
            [
                8250,
                8252
            ],
            [
                8252,
                8266
            ],
            [
                8286,
                8298
            ],
            [
                8306,
                8337
            ],
            [
                8337,
                8369
            ],
            [
                8383,
                8433
            ],
            [
                8472,
                8474
            ],
            [
                8474,
                8533
            ],
            [
                8541,
                8651
            ],
            [
                8651,
                8686
            ],
            [
                8751,
                8755
            ],
            [
                8698,
                8701
            ],
            [
                8796,
                8826
            ],
            [
                8830,
                8848
            ],
            [
                8912,
                8915
            ],
            [
                8928,
                8944
            ],
            [
                8944,
                9034
            ],
            [
                9034,
                9150
            ],
            [
                9165,
                9234
            ],
            [
                9258,
                9321
            ],
            [
                9364,
                9413
            ],
            [
                9454,
                9483
            ],
            [
                9651,
                9656
            ],
            [
                9666,
                9676
            ],
            [
                9677,
                9730
            ],
            [
                9793,
                9794
            ],
            [
                9732,
                9735
            ],
            [
                9905,
                9910
            ],
            [
                9821,
                9837
            ],
            [
                9910,
                9911
            ],
            [
                9857,
                9872
            ],
            [
                10019,
                10027
            ],
            [
                10028,
                10096
            ],
            [
                10097,
                10180
            ],
            [
                10182,
                10187
            ],
            [
                10190,
                10196
            ],
            [
                10371,
                10376
            ],
            [
                10264,
                10267
            ],
            [
                10340,
                10346
            ],
            [
                10331,
                10339
            ],
            [
                10380,
                10394
            ],
            [
                10418,
                10420
            ],
            [
                10420,
                10446
            ],
            [
                10503,
                10511
            ],
            [
                10554,
                10566
            ],
            [
                10741,
                10751
            ],
            [
                10802,
                10811
            ],
            [
                10819,
                10841
            ],
            [
                10871,
                10876
            ],
            [
                10862,
                10865
            ],
            [
                10894,
                10898
            ],
            [
                10905,
                10933
            ],
            [
                10938,
                10951
            ],
            [
                10958,
                11012
            ],
            [
                10877,
                10879
            ],
            [
                11026,
                11029
            ],
            [
                11043,
                11045
            ],
            [
                11118,
                11128
            ],
            [
                11144,
                11147
            ],
            [
                11589,
                11591
            ],
            [
                11591,
                11594
            ],
            [
                11610,
                11621
            ],
            [
                11642,
                11656
            ],
            [
                11661,
                11669
            ],
            [
                11627,
                11633
            ],
            [
                11674,
                11676
            ],
            [
                11709,
                11729
            ],
            [
                12026,
                12052
            ],
            [
                12074,
                12123
            ],
            [
                12137,
                12138
            ],
            [
                12139,
                12208
            ],
            [
                12208,
                12336
            ],
            [
                12382,
                12390
            ],
            [
                12400,
                12431
            ],
            [
                12517,
                12518
            ],
            [
                12519,
                12545
            ],
            [
                12552,
                12555
            ],
            [
                12566,
                12598
            ],
            [
                12598,
                12608
            ],
            [
                12620,
                12639
            ],
            [
                12677,
                12691
            ],
            [
                12704,
                12735
            ],
            [
                12748,
                12779
            ],
            [
                12779,
                12782
            ],
            [
                12783,
                12809
            ],
            [
                12829,
                12871
            ],
            [
                12880,
                12904
            ],
            [
                12912,
                12953
            ],
            [
                12953,
                13051
            ],
            [
                13051,
                13103
            ],
            [
                13121,
                13164
            ],
            [
                13164,
                13189
            ],
            [
                13203,
                13211
            ],
            [
                13213,
                13251
            ],
            [
                13251,
                13275
            ],
            [
                13280,
                13284
            ],
            [
                13311,
                13360
            ],
            [
                13360,
                13432
            ],
            [
                13433,
                13476
            ],
            [
                13476,
                13511
            ],
            [
                13541,
                13551
            ],
            [
                13555,
                13570
            ],
            [
                13577,
                13580
            ],
            [
                13580,
                13626
            ],
            [
                13644,
                13665
            ],
            [
                13730,
                13731
            ],
            [
                13680,
                13695
            ],
            [
                13712,
                13714
            ],
            [
                13745,
                13752
            ],
            [
                13755,
                13802
            ],
            [
                13812,
                13906
            ],
            [
                13906,
                13984
            ],
            [
                13984,
                13987
            ],
            [
                14067,
                14069
            ],
            [
                14078,
                14087
            ],
            [
                14094,
                14148
            ],
            [
                14151,
                14178
            ],
            [
                14178,
                14191
            ],
            [
                14216,
                14218
            ],
            [
                14239,
                14290
            ],
            [
                14296,
                14302
            ],
            [
                14370,
                14385
            ],
            [
                14385,
                14459
            ],
            [
                14472,
                14476
            ],
            [
                14495,
                14529
            ],
            [
                14529,
                14576
            ],
            [
                14576,
                14641
            ],
            [
                14758,
                14787
            ],
            [
                14817,
                14825
            ],
            [
                14826,
                14845
            ],
            [
                14851,
                14869
            ],
            [
                14881,
                14926
            ],
            [
                14926,
                14968
            ],
            [
                14968,
                14990
            ],
            [
                15045,
                15052
            ],
            [
                15065,
                15112
            ],
            [
                15112,
                15125
            ],
            [
                15133,
                15139
            ],
            [
                15139,
                15174
            ],
            [
                15193,
                15261
            ],
            [
                15274,
                15304
            ],
            [
                15304,
                15318
            ],
            [
                15345,
                15389
            ],
            [
                15396,
                15417
            ],
            [
                15493,
                15495
            ],
            [
                15495,
                15598
            ],
            [
                15610,
                15616
            ],
            [
                15631,
                15649
            ],
            [
                15673,
                15708
            ],
            [
                15708,
                15739
            ],
            [
                15746,
                15768
            ],
            [
                15889,
                15892
            ],
            [
                15915,
                15931
            ],
            [
                15932,
                15992
            ],
            [
                15992,
                16012
            ],
            [
                16110,
                16128
            ],
            [
                16128,
                16151
            ],
            [
                16158,
                16165
            ],
            [
                16165,
                16185
            ],
            [
                16201,
                16204
            ],
            [
                16204,
                16249
            ],
            [
                16300,
                16302
            ],
            [
                16302,
                16326
            ],
            [
                16386,
                16387
            ],
            [
                16327,
                16386
            ],
            [
                16536,
                16538
            ],
            [
                16538,
                16539
            ],
            [
                16543,
                16595
            ],
            [
                16639,
                16641
            ],
            [
                16679,
                16737
            ],
            [
                16739,
                16760
            ],
            [
                16776,
                16778
            ],
            [
                16778,
                16790
            ],
            [
                16802,
                16927
            ],
            [
                16927,
                16936
            ],
            [
                16944,
                17031
            ],
            [
                17043,
                17064
            ],
            [
                17064,
                17076
            ],
            [
                17088,
                17090
            ],
            [
                17090,
                17108
            ],
            [
                17115,
                17128
            ],
            [
                17149,
                17195
            ],
            [
                17195,
                17253
            ],
            [
                17271,
                17275
            ],
            [
                17286,
                17305
            ]
        ],
        "row_chars": [
            [
                0,
                73
            ],
            [
                73,
                238
            ],
            [
                238,
                389
            ],
            [
                389,
                800
            ],
            [
                800,
                841
            ],
            [
                841,
                949
            ],
            [
                949,
                1018
            ],
            [
                1018,
                1047
            ],
            [
                1047,
                1429
            ],
            [
                1429,
                1626
            ],
            [
                1626,
                1724
            ],
            [
                1724,
                1768
            ],
            [
                1768,
                1786
            ],
            [
                1786,
                1908
            ],
            [
                1908,
                1926
            ],
            [
                1926,
                2126
            ],
            [
                2126,
                2143
            ],
            [
                2143,
                2185
            ],
            [
                2185,
                2233
            ],
            [
                2233,
                2342
            ],
            [
                2342,
                2408
            ],
            [
                2408,
                2431
            ],
            [
                2431,
                2637
            ],
            [
                2637,
                2730
            ],
            [
                2730,
                2858
            ],
            [
                2858,
                3000
            ],
            [
                3000,
                3100
            ],
            [
                3100,
                3164
            ],
            [
                3164,
                3220
            ],
            [
                3220,
                3311
            ],
            [
                3311,
                3375
            ],
            [
                3375,
                3424
            ],
            [
                3424,
                3519
            ],
            [
                3519,
                3699
            ],
            [
                3699,
                3849
            ],
            [
                3849,
                3886
            ],
            [
                3886,
                3924
            ],
            [
                3924,
                4000
            ],
            [
                4000,
                4063
            ],
            [
                4063,
                4152
            ],
            [
                4152,
                4208
            ],
            [
                4208,
                4227
            ],
            [
                4227,
                4285
            ],
            [
                4285,
                4328
            ],
            [
                4328,
                4456
            ],
            [
                4456,
                4633
            ],
            [
                4633,
                4672
            ],
            [
                4672,
                4890
            ],
            [
                4890,
                5038
            ],
            [
                5038,
                5150
            ],
            [
                5150,
                5418
            ],
            [
                5418,
                5598
            ],
            [
                5598,
                5719
            ],
            [
                5719,
                5771
            ],
            [
                5771,
                5925
            ],
            [
                5925,
                6004
            ],
            [
                6004,
                6037
            ],
            [
                6037,
                6066
            ],
            [
                6066,
                6087
            ],
            [
                6087,
                6185
            ],
            [
                6185,
                6255
            ],
            [
                6255,
                6343
            ],
            [
                6343,
                6371
            ],
            [
                6371,
                6465
            ],
            [
                6465,
                6551
            ],
            [
                6551,
                6681
            ],
            [
                6681,
                6936
            ],
            [
                6936,
                7114
            ],
            [
                7114,
                7214
            ],
            [
                7214,
                7266
            ],
            [
                7266,
                7369
            ],
            [
                7369,
                7646
            ],
            [
                7646,
                7679
            ],
            [
                7679,
                7927
            ],
            [
                7927,
                8016
            ],
            [
                8016,
                8252
            ],
            [
                8252,
                8337
            ],
            [
                8337,
                8474
            ],
            [
                8474,
                8651
            ],
            [
                8651,
                8848
            ],
            [
                8848,
                8912
            ],
            [
                8912,
                8944
            ],
            [
                8944,
                9034
            ],
            [
                9034,
                9150
            ],
            [
                9150,
                9165
            ],
            [
                9165,
                9321
            ],
            [
                9321,
                9364
            ],
            [
                9364,
                9483
            ],
            [
                9483,
                9651
            ],
            [
                9651,
                10028
            ],
            [
                10028,
                10097
            ],
            [
                10097,
                10420
            ],
            [
                10420,
                10566
            ],
            [
                10566,
                10741
            ],
            [
                10741,
                11045
            ],
            [
                11045,
                11115
            ],
            [
                11115,
                11591
            ],
            [
                11591,
                11729
            ],
            [
                11729,
                11928
            ],
            [
                11928,
                12026
            ],
            [
                12026,
                12139
            ],
            [
                12139,
                12208
            ],
            [
                12208,
                12519
            ],
            [
                12519,
                12598
            ],
            [
                12598,
                12779
            ],
            [
                12779,
                12953
            ],
            [
                12953,
                13051
            ],
            [
                13051,
                13164
            ],
            [
                13164,
                13251
            ],
            [
                13251,
                13360
            ],
            [
                13360,
                13433
            ],
            [
                13433,
                13476
            ],
            [
                13476,
                13580
            ],
            [
                13580,
                13906
            ],
            [
                13906,
                13984
            ],
            [
                13984,
                14148
            ],
            [
                14148,
                14178
            ],
            [
                14178,
                14218
            ],
            [
                14218,
                14385
            ],
            [
                14385,
                14529
            ],
            [
                14529,
                14576
            ],
            [
                14576,
                14826
            ],
            [
                14826,
                14926
            ],
            [
                14926,
                14968
            ],
            [
                14968,
                14990
            ],
            [
                14990,
                15045
            ],
            [
                15045,
                15112
            ],
            [
                15112,
                15139
            ],
            [
                15139,
                15304
            ],
            [
                15304,
                15495
            ],
            [
                15495,
                15708
            ],
            [
                15708,
                15932
            ],
            [
                15932,
                15992
            ],
            [
                15992,
                16128
            ],
            [
                16128,
                16165
            ],
            [
                16165,
                16204
            ],
            [
                16204,
                16302
            ],
            [
                16302,
                16538
            ],
            [
                16538,
                16641
            ],
            [
                16641,
                16679
            ],
            [
                16679,
                16778
            ],
            [
                16778,
                16927
            ],
            [
                16927,
                17064
            ],
            [
                17064,
                17090
            ],
            [
                17090,
                17195
            ],
            [
                17195,
                17305
            ]
        ]
    },
    "abridged": {
        "text": "March came, and still the Chancellor of the Exchequer held his position. In early March there was given in the House a parliamentary explanation on the subject, which, however, did not explain very much. Everybody but the Cabinet protested that the Government was going to pieces; and Mr. Bott declared that this kind of thing wouldn't do. Lord Brock must decide. If he chose Mr. Palliser, Mr. Palliser would not be found wanting. But if Lord Brock did not so choose, he must expect that Mr. Palliser and his friends, would - Mr. Bott did not say what they would do; but he was assumed to hint at divisions, and to threaten Lord Brock with the open enmity of Mr. Palliser - and of Mr. Bott himself.\n\"This kind of thing won't do long, you know,\" repeated Mr. Bott, as he stood before the fire at his club, with one or two of his young friends around him.\n\"I suppose not,\" said Calder Jones, the hunting Member of Parliament whom we met at Roebury. \"Planty Pall won't stand it, I should say.\"\n\"What can he do?\" asked another, an unfledged Member who was not quite sure whom he should follow.\n\"What can he do?\" said Mr. Bott - who, for a moment, could almost feel that he might become a leader of a party himself. \"You will very shortly see what he can do. If Lord Brock doesn't look about him, he'll find that Mr. Palliser will be in the Cabinet without his help.\"\n\"You don't mean to say that the Queen will send for Planty Pall!\" said the young Member.\n\"The Queen will send for anyone that the House of Commons may direct her to call upon,\" said Mr. Bott. \"The Queen has really nothing to do with it.\"\n\"Come, Bott, tone it down,\" said Calder Jones, whose loyalty was shocked.\n\"I shan't,\" said Mr. Bott grandly. \"All our political offences against civilization have come from that. Why can't Englishmen read and write as Americans do? Why can't they vote as they do even in Imperial France? Why are they less free than serfs in Russia? Because men in power have been toning it down!\"\n\"But you can't set aside Her Majesty like that, you know,\" said the young Member.\n\"I'm no republican,\" said Mr. Bott, although he did not know what the word meant. \"I mean no disrespect to the throne. But the power of governing this great nation does not rest with the throne. It is contained within the four walls of the House of Commons.\"\n\"And you think Planty Pall will become Prime Minister?\" said Calder Jones.\n\"I haven't said that; but there are more unlikely things. But I certainly think that if Lord Brock doesn't take him into the Cabinet, Lord Brock won't remain there long himself.\"\nIn the meantime the election came on in the Chelsea districts, and south-western London was covered with posters bearing George Vavasor's name.\n\"Vote for Vavasor and the River Bank.\" That was the cry with which he went to the electors; and it was perfectly unintelligible to most of those who read it. He was called Viscount Riverbank by all sides, and was pestered by questions about Father Thames.\nIt was Mr. Scruby who invented the slogan. There was a call in those days to embank the river from the Houses of Parliament up to Pimlico, and Mr. Scruby recommended Vavasor to pledge that he would have the work carried out.\n\"You must have a subject,\" pleaded Mr. Scruby; \"and it should be local. It may save you thousands of pounds at future elections.\"\n\"It won't save me anything at this one, I take it.\"\n\"But it may secure the seat, Mr. Vavasor, and make you the most popular metropolitan Member in the House. Only look at the money that would be spent in the districts if the embankment were done! It would be millions, sir!\"\n\"But it never will be done.\"\n\"What does that matter?\" said Mr. Scruby. \"Get the figures by heart, and as nobody else will do so, nobody can argue with you. Of course it won't be done. But you can always promise it at the hustings, and can demand it in the House.\"\nSo Vavasor allowed Mr. Scruby to manage the matter for him, and huge placards saying \"Vavasor and the River Bank\" were carried about by an army of men. And sides of houses were covered with \"Vavasor and the River Bank\", until Vavasor declared that he was ashamed to walk down the streets, so conspicuous had his name become.\nGrimes the publican ridiculed the cry at first, when he canvassed for the other Liberal candidate. But, after a while, he admitted that Mr. Scruby knew what he was doing.\n\"He's a sharp 'un, he is,\" said Grimes; and he almost regretted that he had left the leadership of Mr. Scruby.\nGeorge Vavasor actually did study the subject of the River Bank. He got himself introduced to men on the Metropolitan Board, and went manfully into the figures. He was able even to work himself into an apparent heat when told that the thing was out of the question; and soon found that he had disciples who really believed in him. If he could have brought himself to care about the matter, the work would not have been difficult to him. But that was beyond him. He had gone too far in life to be capable of believing in, or of caring for, such things. He was ambitious of having a hand in the government of his country, but he was not capable of caring even for that.\nBut he worked hard, and spoke vehemently, and promised the men of Chelsea that the path of London westwards had hardly commenced as yet. Squares should arise around the Chelsea barracks, while Belgravia would be deserted. Three and a half million should be spent on the noble street to be constructed; the money to be drawn from - anywhere except Chelsea.\nMr. Scruby was forced to own that his pupil worked the subject well.\n\"Upon my word, that was uncommon good,\" he said, almost patting Vavasor on the back after one speech about the future glory of the embankment.\nBut armies of men carrying placards cost money. Mr. Scruby asked for a further fifteen hundred pounds; and his tone clearly signified that not a placard would be sent through the streets, or a poster put upon a wall, till he had the money. His joviality was absent.\nThe request came so suddenly that there was no time for George to communicate with Alice through his sister. He resolved, therefore, to apply to Alice himself, and he wrote to her, explaining matters.\nThe election had come upon him quite suddenly, as she knew, he said. He wanted two thousand pounds instantly, and felt little scruple in asking her for it, as he was aware that the old Squire would readily leave her a legacy for the repayment of this money.\nThen he said a word or two about his long absence from Queen Anne Street. He had not visited because he had felt that she would prefer to be left free from the excitement of such interviews. But if he should he be triumphant in the election, he should go to her to share his triumph; or, should he fail, he would go to her to console him in his failure.\nWithin three days he heard from her, saying that the money would be at once placed to his credit. She sent him also her candid good wishes for success, but beyond this her letter said nothing. There was no word of love or welcome, no expression of a desire to see him. Vavasor, as he perceived this, felt a triumph in the possession of her money. She was ill-using him by her coldness, and there was comfort in revenge.\n\"It serves her right,\" he said to himself. \"She should have married me at once, and then the money would have been mine.\"\nWhen Mr. Tombe had communicated with John Grey about this increased demand - which Mr. Tombe regarded as going too far - Grey had telegraphed back that Vavasor's demand, if made through Mr. John Vavasor, was to be honoured to the extent of five thousand pounds. Mr. Tombe raised his eyebrows, and reflected that some men were very foolish. But he did as he was asked; and the money was paid to George Vavasor's account.\nGeorge told Kate nothing of this. Why should he? He wrote no letters to his sister, though she twice wrote to him offering her own money. He could not reply to these offers without telling her that money had been obtained from Alice, and so he left them unanswered.\nIn the meantime the battle went on gloriously. Mr. Travers, the other Liberal candidate, spent his money freely, and George cursed his own luck in having no rich backers.\n\"I don't call a man a Member when he's elected like that,\" said Mr. Scruby, comforting him. \"He can't do what he likes with his vote. He ain't independent. Pay for it yourself, Mr. Vavasor, and then it's your own. That's what I say.\"\nMr. Grimes went to work strenuously in the opposite interest, telling all that he knew, and perhaps more, of Vavasor's circumstances. He was at work not only in his own neighbourhood, but among the men on the river bank. The entire Vavasorian army with its placards was entirely upset on more than one occasion, and was once driven into the river mud under the direction of Mr. Grimes. Vavasor himself was pelted with dirt from the sinking tide, and he became angry.\n\"Lord love you, Mr. Vavasor,\" said Scruby, \"that's nothing! I've had a candidate covered with rotten eggs. The smell was something awful. But I brought him in.\"\nAnd Mr. Scruby at last did as much for George. At the close of the poll, Vavasor's name stood at the head by a considerable majority.\n\"You've done it very cheap, Mr. Vavasor,\" said Scruby. \"Another thousand, or twelve hundred, will cover everything - say thirteen, perhaps. And when you've fought the battle once again, you'll have paid your footing, and the fellows will let you in almost for nothing after that.\"\nA further thirteen hundred pounds was wanted at once, and then the whole thing was to be repeated in six months' time! This was not a comfort. But, nevertheless, it was a triumph which George Vavasor was man enough to enjoy. It would be something to have sat in the House of Commons, even if only for half a session.",
        "paragraph_chars": [
            [
                0,
                699
            ],
            [
                699,
                854
            ],
            [
                854,
                991
            ],
            [
                991,
                1090
            ],
            [
                1090,
                1363
            ],
            [
                1363,
                1452
            ],
            [
                1452,
                1601
            ],
            [
                1601,
                1675
            ],
            [
                1675,
                1982
            ],
            [
                1982,
                2064
            ],
            [
                2064,
                2323
            ],
            [
                2323,
                2398
            ],
            [
                2398,
                2577
            ],
            [
                2577,
                2721
            ],
            [
                2721,
                2977
            ],
            [
                2977,
                3202
            ],
            [
                3202,
                3332
            ],
            [
                3332,
                3384
            ],
            [
                3384,
                3607
            ],
            [
                3607,
                3636
            ],
            [
                3636,
                3871
            ],
            [
                3871,
                4196
            ],
            [
                4196,
                4367
            ],
            [
                4367,
                4478
            ],
            [
                4478,
                5146
            ],
            [
                5146,
                5502
            ],
            [
                5502,
                5571
            ],
            [
                5571,
                5714
            ],
            [
                5714,
                5980
            ],
            [
                5980,
                6181
            ],
            [
                6181,
                6439
            ],
            [
                6439,
                6793
            ],
            [
                6793,
                7213
            ],
            [
                7213,
                7335
            ],
            [
                7335,
                7755
            ],
            [
                7755,
                8021
            ],
            [
                8021,
                8192
            ],
            [
                8192,
                8426
            ],
            [
                8426,
                8893
            ],
            [
                8893,
                9054
            ],
            [
                9054,
                9188
            ],
            [
                9188,
                9469
            ],
            [
                9469,
                9785
            ]
        ],
        "segment_chars": [
            [
                0,
                73
            ],
            [
                73,
                204
            ],
            [
                204,
                340
            ],
            [
                340,
                364
            ],
            [
                364,
                431
            ],
            [
                431,
                699
            ],
            [
                699,
                854
            ],
            [
                854,
                947
            ],
            [
                947,
                991
            ],
            [
                991,
                1009
            ],
            [
                1009,
                1090
            ],
            [
                1090,
                1108
            ],
            [
                1108,
                1211
            ],
            [
                1211,
                1254
            ],
            [
                1254,
                1363
            ],
            [
                1363,
                1429
            ],
            [
                1429,
                1452
            ],
            [
                1452,
                1555
            ],
            [
                1555,
                1601
            ],
            [
                1601,
                1675
            ],
            [
                1675,
                1710
            ],
            [
                1710,
                1780
            ],
            [
                1780,
                1833
            ],
            [
                1833,
                1889
            ],
            [
                1889,
                1934
            ],
            [
                1934,
                1982
            ],
            [
                1982,
                2064
            ],
            [
                2064,
                2146
            ],
            [
                2146,
                2183
            ],
            [
                2183,
                2259
            ],
            [
                2259,
                2323
            ],
            [
                2323,
                2379
            ],
            [
                2379,
                2398
            ],
            [
                2398,
                2456
            ],
            [
                2456,
                2577
            ],
            [
                2577,
                2721
            ],
            [
                2721,
                2760
            ],
            [
                2760,
                2879
            ],
            [
                2879,
                2977
            ],
            [
                2977,
                3020
            ],
            [
                3020,
                3202
            ],
            [
                3202,
                3274
            ],
            [
                3274,
                3332
            ],
            [
                3332,
                3384
            ],
            [
                3384,
                3490
            ],
            [
                3490,
                3579
            ],
            [
                3579,
                3607
            ],
            [
                3607,
                3636
            ],
            [
                3636,
                3661
            ],
            [
                3661,
                3678
            ],
            [
                3678,
                3763
            ],
            [
                3763,
                3791
            ],
            [
                3791,
                3871
            ],
            [
                3871,
                4023
            ],
            [
                4023,
                4196
            ],
            [
                4196,
                4295
            ],
            [
                4295,
                4367
            ],
            [
                4367,
                4478
            ],
            [
                4478,
                4543
            ],
            [
                4543,
                4639
            ],
            [
                4639,
                4809
            ],
            [
                4809,
                4915
            ],
            [
                4915,
                4940
            ],
            [
                4940,
                5030
            ],
            [
                5030,
                5146
            ],
            [
                5146,
                5283
            ],
            [
                5283,
                5368
            ],
            [
                5368,
                5502
            ],
            [
                5502,
                5571
            ],
            [
                5571,
                5714
            ],
            [
                5714,
                5762
            ],
            [
                5762,
                5954
            ],
            [
                5954,
                5980
            ],
            [
                5980,
                6089
            ],
            [
                6089,
                6181
            ],
            [
                6181,
                6250
            ],
            [
                6250,
                6439
            ],
            [
                6439,
                6513
            ],
            [
                6513,
                6630
            ],
            [
                6630,
                6793
            ],
            [
                6793,
                6891
            ],
            [
                6891,
                6986
            ],
            [
                6986,
                7062
            ],
            [
                7062,
                7140
            ],
            [
                7140,
                7213
            ],
            [
                7213,
                7256
            ],
            [
                7256,
                7335
            ],
            [
                7335,
                7597
            ],
            [
                7597,
                7675
            ],
            [
                7675,
                7755
            ],
            [
                7755,
                7789
            ],
            [
                7789,
                7804
            ],
            [
                7804,
                7893
            ],
            [
                7893,
                8021
            ],
            [
                8021,
                8068
            ],
            [
                8068,
                8192
            ],
            [
                8192,
                8284
            ],
            [
                8284,
                8326
            ],
            [
                8326,
                8348
            ],
            [
                8348,
                8406
            ],
            [
                8406,
                8426
            ],
            [
                8426,
                8560
            ],
            [
                8560,
                8647
            ],
            [
                8647,
                8812
            ],
            [
                8812,
                8893
            ],
            [
                8893,
                8953
            ],
            [
                8953,
                9000
            ],
            [
                9000,
                9031
            ],
            [
                9031,
                9054
            ],
            [
                9054,
                9101
            ],
            [
                9101,
                9188
            ],
            [
                9188,
                9243
            ],
            [
                9243,
                9328
            ],
            [
                9328,
                9469
            ],
            [
                9469,
                9588
            ],
            [
                9588,
                9612
            ],
            [
                9612,
                9694
            ],
            [
                9694,
                9785
            ]
        ],
        "overlap_chars": [
            [
                0,
                73
            ],
            [
                73,
                75
            ],
            [
                76,
                81
            ],
            [
                82,
                118
            ],
            [
                119,
                202
            ],
            [
                202,
                204
            ],
            [
                214,
                217
            ],
            [
                218,
                229
            ],
            [
                230,
                293
            ],
            [
                303,
                340
            ],
            [
                340,
                355
            ],
            [
                362,
                364
            ],
            [
                364,
                375
            ],
            [
                376,
                389
            ],
            [
                390,
                431
            ],
            [
                431,
                467
            ],
            [
                468,
                500
            ],
            [
                501,
                504
            ],
            [
                509,
                523
            ],
            [
                526,
                577
            ],
            [
                586,
                596
            ],
            [
                597,
                671
            ],
            [
                674,
                684
            ],
            [
                697,
                699
            ],
            [
                699,
                762
            ],
            [
                762,
                775
            ],
            [
                776,
                854
            ],
            [
                854,
                930
            ],
            [
                931,
                947
            ],
            [
                947,
                991
            ],
            [
                991,
                1009
            ],
            [
                1009,
                1055
            ],
            [
                1056,
                1061
            ],
            [
                1072,
                1074
            ],
            [
                1088,
                1090
            ],
            [
                1090,
                1108
            ],
            [
                1108,
                1121
            ],
            [
                1124,
                1201
            ],
            [
                1202,
                1209
            ],
            [
                1209,
                1211
            ],
            [
                1212,
                1254
            ],
            [
                1254,
                1363
            ],
            [
                1363,
                1429
            ],
            [
                1429,
                1452
            ],
            [
                1452,
                1453
            ],
            [
                1453,
                1476
            ],
            [
                1484,
                1553
            ],
            [
                1553,
                1555
            ],
            [
                1555,
                1556
            ],
            [
                1556,
                1598
            ],
            [
                1601,
                1613
            ],
            [
                1619,
                1621
            ],
            [
                1626,
                1673
            ],
            [
                1673,
                1675
            ],
            [
                1675,
                1676
            ],
            [
                1676,
                1684
            ],
            [
                1684,
                1700
            ],
            [
                1701,
                1706
            ],
            [
                1708,
                1710
            ],
            [
                1711,
                1773
            ],
            [
                1778,
                1780
            ],
            [
                1780,
                1783
            ],
            [
                1784,
                1789
            ],
            [
                1790,
                1800
            ],
            [
                1801,
                1833
            ],
            [
                1833,
                1889
            ],
            [
                1889,
                1901
            ],
            [
                1902,
                1916
            ],
            [
                1917,
                1922
            ],
            [
                1923,
                1934
            ],
            [
                1934,
                1964
            ],
            [
                1972,
                1974
            ],
            [
                1979,
                1981
            ],
            [
                1982,
                2062
            ],
            [
                2062,
                2064
            ],
            [
                2064,
                2082
            ],
            [
                2082,
                2098
            ],
            [
                2098,
                2099
            ],
            [
                2112,
                2138
            ],
            [
                2139,
                2146
            ],
            [
                2146,
                2183
            ],
            [
                2183,
                2259
            ],
            [
                2259,
                2320
            ],
            [
                2323,
                2379
            ],
            [
                2379,
                2398
            ],
            [
                2398,
                2456
            ],
            [
                2456,
                2477
            ],
            [
                2478,
                2548
            ],
            [
                2549,
                2561
            ],
            [
                2562,
                2566
            ],
            [
                2567,
                2577
            ],
            [
                2577,
                2643
            ],
            [
                2644,
                2657
            ],
            [
                2665,
                2720
            ],
            [
                2721,
                2760
            ],
            [
                2760,
                2816
            ],
            [
                2817,
                2851
            ],
            [
                2857,
                2879
            ],
            [
                2879,
                2881
            ],
            [
                2886,
                2892
            ],
            [
                2893,
                2911
            ],
            [
                2915,
                2924
            ],
            [
                2924,
                2929
            ],
            [
                2930,
                2942
            ],
            [
                2943,
                2955
            ],
            [
                2962,
                2976
            ],
            [
                2977,
                3011
            ],
            [
                3018,
                3020
            ],
            [
                3020,
                3031
            ],
            [
                3037,
                3050
            ],
            [
                3051,
                3057
            ],
            [
                3061,
                3106
            ],
            [
                3107,
                3142
            ],
            [
                3146,
                3148
            ],
            [
                3151,
                3160
            ],
            [
                3161,
                3196
            ],
            [
                3200,
                3201
            ],
            [
                3202,
                3247
            ],
            [
                3247,
                3248
            ],
            [
                3249,
                3250
            ],
            [
                3250,
                3272
            ],
            [
                3272,
                3274
            ],
            [
                3274,
                3276
            ],
            [
                3277,
                3299
            ],
            [
                3300,
                3332
            ],
            [
                3332,
                3384
            ],
            [
                3384,
                3429
            ],
            [
                3430,
                3488
            ],
            [
                3488,
                3490
            ],
            [
                3490,
                3552
            ],
            [
                3568,
                3579
            ],
            [
                3579,
                3587
            ],
            [
                3591,
                3607
            ],
            [
                3607,
                3636
            ],
            [
                3636,
                3641
            ],
            [
                3647,
                3651
            ],
            [
                3658,
                3661
            ],
            [
                3666,
                3676
            ],
            [
                3676,
                3678
            ],
            [
                3679,
                3708
            ],
            [
                3709,
                3746
            ],
            [
                3758,
                3761
            ],
            [
                3761,
                3763
            ],
            [
                3763,
                3791
            ],
            [
                3791,
                3845
            ],
            [
                3846,
                3868
            ],
            [
                3874,
                3934
            ],
            [
                3935,
                3939
            ],
            [
                3940,
                3948
            ],
            [
                3956,
                3984
            ],
            [
                3990,
                4021
            ],
            [
                4021,
                4023
            ],
            [
                4023,
                4026
            ],
            [
                4027,
                4060
            ],
            [
                4061,
                4088
            ],
            [
                4097,
                4104
            ],
            [
                4105,
                4141
            ],
            [
                4142,
                4150
            ],
            [
                4158,
                4195
            ],
            [
                4196,
                4202
            ],
            [
                4203,
                4206
            ],
            [
                4207,
                4215
            ],
            [
                4216,
                4233
            ],
            [
                4234,
                4243
            ],
            [
                4249,
                4295
            ],
            [
                4295,
                4314
            ],
            [
                4327,
                4359
            ],
            [
                4365,
                4366
            ],
            [
                4367,
                4370
            ],
            [
                4373,
                4385
            ],
            [
                4386,
                4405
            ],
            [
                4407,
                4476
            ],
            [
                4476,
                4478
            ],
            [
                4478,
                4492
            ],
            [
                4493,
                4505
            ],
            [
                4512,
                4543
            ],
            [
                4543,
                4575
            ],
            [
                4579,
                4629
            ],
            [
                4637,
                4639
            ],
            [
                4639,
                4698
            ],
            [
                4699,
                4809
            ],
            [
                4809,
                4844
            ],
            [
                4845,
                4849
            ],
            [
                4856,
                4859
            ],
            [
                4866,
                4896
            ],
            [
                4897,
                4915
            ],
            [
                4915,
                4918
            ],
            [
                4924,
                4940
            ],
            [
                4940,
                5030
            ],
            [
                5030,
                5146
            ],
            [
                5150,
                5219
            ],
            [
                5220,
                5283
            ],
            [
                5283,
                5332
            ],
            [
                5339,
                5368
            ],
            [
                5368,
                5373
            ],
            [
                5374,
                5384
            ],
            [
                5393,
                5446
            ],
            [
                5446,
                5447
            ],
            [
                5448,
                5451
            ],
            [
                5452,
                5457
            ],
            [
                5458,
                5474
            ],
            [
                5475,
                5476
            ],
            [
                5477,
                5492
            ],
            [
                5493,
                5501
            ],
            [
                5502,
                5570
            ],
            [
                5571,
                5654
            ],
            [
                5655,
                5660
            ],
            [
                5665,
                5671
            ],
            [
                5672,
                5677
            ],
            [
                5678,
                5681
            ],
            [
                5682,
                5688
            ],
            [
                5689,
                5697
            ],
            [
                5698,
                5712
            ],
            [
                5712,
                5714
            ],
            [
                5714,
                5740
            ],
            [
                5741,
                5749
            ],
            [
                5750,
                5762
            ],
            [
                5762,
                5772
            ],
            [
                5783,
                5792
            ],
            [
                5793,
                5815
            ],
            [
                5815,
                5820
            ],
            [
                5821,
                5824
            ],
            [
                5825,
                5829
            ],
            [
                5830,
                5858
            ],
            [
                5867,
                5880
            ],
            [
                5881,
                5935
            ],
            [
                5936,
                5938
            ],
            [
                5939,
                5942
            ],
            [
                5952,
                5954
            ],
            [
                5954,
                5964
            ],
            [
                5968,
                5971
            ],
            [
                5978,
                5980
            ],
            [
                5980,
                5983
            ],
            [
                5997,
                6008
            ],
            [
                6009,
                6023
            ],
            [
                6027,
                6035
            ],
            [
                6036,
                6042
            ],
            [
                6043,
                6045
            ],
            [
                6069,
                6089
            ],
            [
                6089,
                6115
            ],
            [
                6122,
                6171
            ],
            [
                6179,
                6180
            ],
            [
                6181,
                6250
            ],
            [
                6250,
                6378
            ],
            [
                6397,
                6405
            ],
            [
                6406,
                6437
            ],
            [
                6437,
                6438
            ],
            [
                6439,
                6465
            ],
            [
                6472,
                6475
            ],
            [
                6481,
                6513
            ],
            [
                6513,
                6523
            ],
            [
                6532,
                6551
            ],
            [
                6552,
                6566
            ],
            [
                6567,
                6598
            ],
            [
                6599,
                6630
            ],
            [
                6630,
                6633
            ],
            [
                6640,
                6666
            ],
            [
                6679,
                6721
            ],
            [
                6721,
                6745
            ],
            [
                6752,
                6793
            ],
            [
                6793,
                6891
            ],
            [
                6891,
                6943
            ],
            [
                6943,
                6986
            ],
            [
                6986,
                7011
            ],
            [
                7015,
                7023
            ],
            [
                7024,
                7062
            ],
            [
                7062,
                7086
            ],
            [
                7087,
                7091
            ],
            [
                7091,
                7140
            ],
            [
                7140,
                7212
            ],
            [
                7213,
                7256
            ],
            [
                7256,
                7291
            ],
            [
                7291,
                7301
            ],
            [
                7312,
                7327
            ],
            [
                7332,
                7335
            ],
            [
                7335,
                7381
            ],
            [
                7388,
                7409
            ],
            [
                7410,
                7411
            ],
            [
                7412,
                7427
            ],
            [
                7437,
                7439
            ],
            [
                7446,
                7453
            ],
            [
                7456,
                7503
            ],
            [
                7503,
                7597
            ],
            [
                7597,
                7675
            ],
            [
                7675,
                7678
            ],
            [
                7679,
                7681
            ],
            [
                7686,
                7695
            ],
            [
                7701,
                7755
            ],
            [
                7762,
                7789
            ],
            [
                7789,
                7802
            ],
            [
                7802,
                7804
            ],
            [
                7804,
                7855
            ],
            [
                7862,
                7868
            ],
            [
                7878,
                7893
            ],
            [
                7893,
                7967
            ],
            [
                7977,
                7981
            ],
            [
                7987,
                8021
            ],
            [
                8021,
                8068
            ],
            [
                8068,
                8133
            ],
            [
                8138,
                8167
            ],
            [
                8183,
                8191
            ],
            [
                8192,
                8211
            ],
            [
                8212,
                8230
            ],
            [
                8239,
                8284
            ],
            [
                8284,
                8326
            ],
            [
                8326,
                8348
            ],
            [
                8348,
                8355
            ],
            [
                8359,
                8406
            ],
            [
                8406,
                8419
            ],
            [
                8420,
                8426
            ],
            [
                8426,
                8461
            ],
            [
                8462,
                8530
            ],
            [
                8530,
                8560
            ],
            [
                8560,
                8574
            ],
            [
                8575,
                8619
            ],
            [
                8624,
                8645
            ],
            [
                8645,
                8647
            ],
            [
                8647,
                8750
            ],
            [
                8751,
                8757
            ],
            [
                8758,
                8776
            ],
            [
                8777,
                8812
            ],
            [
                8812,
                8843
            ],
            [
                8849,
                8871
            ],
            [
                8872,
                8875
            ],
            [
                8876,
                8892
            ],
            [
                8893,
                8953
            ],
            [
                8953,
                8973
            ],
            [
                8982,
                9000
            ],
            [
                9000,
                9023
            ],
            [
                9024,
                9031
            ],
            [
                9031,
                9051
            ],
            [
                9051,
                9054
            ],
            [
                9054,
                9099
            ],
            [
                9099,
                9101
            ],
            [
                9101,
                9125
            ],
            [
                9125,
                9126
            ],
            [
                9127,
                9186
            ],
            [
                9186,
                9188
            ],
            [
                9188,
                9189
            ],
            [
                9189,
                9241
            ],
            [
                9241,
                9243
            ],
            [
                9244,
                9302
            ],
            [
                9305,
                9326
            ],
            [
                9326,
                9328
            ],
            [
                9328,
                9340
            ],
            [
                9344,
                9469
            ],
            [
                9469,
                9478
            ],
            [
                9479,
                9566
            ],
            [
                9567,
                9588
            ],
            [
                9588,
                9600
            ],
            [
                9610,
                9612
            ],
            [
                9612,
                9630
            ],
            [
                9634,
                9647
            ],
            [
                9648,
                9694
            ],
            [
                9694,
                9752
            ],
            [
                9761,
                9765
            ],
            [
                9766,
                9785
            ]
        ],
        "row_chars": [
            [
                0,
                73
            ],
            [
                73,
                204
            ],
            [
                204,
                204
            ],
            [
                204,
                340
            ],
            [
                340,
                364
            ],
            [
                364,
                431
            ],
            [
                431,
                431
            ],
            [
                431,
                431
            ],
            [
                431,
                699
            ],
            [
                699,
                854
            ],
            [
                854,
                947
            ],
            [
                947,
                991
            ],
            [
                991,
                1009
            ],
            [
                1009,
                1090
            ],
            [
                1090,
                1108
            ],
            [
                1108,
                1211
            ],
            [
                1211,
                1211
            ],
            [
                1211,
                1254
            ],
            [
                1254,
                1254
            ],
            [
                1254,
                1363
            ],
            [
                1363,
                1429
            ],
            [
                1429,
                1452
            ],
            [
                1452,
                1555
            ],
            [
                1555,
                1601
            ],
            [
                1601,
                1675
            ],
            [
                1675,
                1710
            ],
            [
                1710,
                1780
            ],
            [
                1780,
                1833
            ],
            [
                1833,
                1889
            ],
            [
                1889,
                1934
            ],
            [
                1934,
                1934
            ],
            [
                1934,
                1982
            ],
            [
                1982,
                1982
            ],
            [
                1982,
                2064
            ],
            [
                2064,
                2146
            ],
            [
                2146,
                2183
            ],
            [
                2183,
                2183
            ],
            [
                2183,
                2259
            ],
            [
                2259,
                2323
            ],
            [
                2323,
                2323
            ],
            [
                2323,
                2379
            ],
            [
                2379,
                2398
            ],
            [
                2398,
                2456
            ],
            [
                2456,
                2456
            ],
            [
                2456,
                2577
            ],
            [
                2577,
                2721
            ],
            [
                2721,
                2760
            ],
            [
                2760,
                2879
            ],
            [
                2879,
                2977
            ],
            [
                2977,
                3020
            ],
            [
                3020,
                3202
            ],
            [
                3202,
                3274
            ],
            [
                3274,
                3332
            ],
            [
                3332,
                3384
            ],
            [
                3384,
                3490
            ],
            [
                3490,
                3579
            ],
            [
                3579,
                3607
            ],
            [
                3607,
                3636
            ],
            [
                3636,
                3661
            ],
            [
                3661,
                3678
            ],
            [
                3678,
                3678
            ],
            [
                3678,
                3763
            ],
            [
                3763,
                3791
            ],
            [
                3791,
                3791
            ],
            [
                3791,
                3871
            ],
            [
                3871,
                3871
            ],
            [
                3871,
                4023
            ],
            [
                4023,
                4023
            ],
            [
                4023,
                4023
            ],
            [
                4023,
                4023
            ],
            [
                4023,
                4023
            ],
            [
                4023,
                4196
            ],
            [
                4196,
                4196
            ],
            [
                4196,
                4295
            ],
            [
                4295,
                4367
            ],
            [
                4367,
                4478
            ],
            [
                4478,
                4543
            ],
            [
                4543,
                4639
            ],
            [
                4639,
                4809
            ],
            [
                4809,
                4915
            ],
            [
                4915,
                4915
            ],
            [
                4915,
                4940
            ],
            [
                4940,
                5030
            ],
            [
                5030,
                5146
            ],
            [
                5146,
                5146
            ],
            [
                5146,
                5283
            ],
            [
                5283,
                5283
            ],
            [
                5283,
                5368
            ],
            [
                5368,
                5368
            ],
            [
                5368,
                5502
            ],
            [
                5502,
                5571
            ],
            [
                5571,
                5714
            ],
            [
                5714,
                5762
            ],
            [
                5762,
                5762
            ],
            [
                5762,
                5954
            ],
            [
                5954,
                5954
            ],
            [
                5954,
                5980
            ],
            [
                5980,
                6089
            ],
            [
                6089,
                6089
            ],
            [
                6089,
                6089
            ],
            [
                6089,
                6181
            ],
            [
                6181,
                6250
            ],
            [
                6250,
                6439
            ],
            [
                6439,
                6513
            ],
            [
                6513,
                6630
            ],
            [
                6630,
                6793
            ],
            [
                6793,
                6891
            ],
            [
                6891,
                6986
            ],
            [
                6986,
                7062
            ],
            [
                7062,
                7140
            ],
            [
                7140,
                7213
            ],
            [
                7213,
                7256
            ],
            [
                7256,
                7335
            ],
            [
                7335,
                7597
            ],
            [
                7597,
                7675
            ],
            [
                7675,
                7755
            ],
            [
                7755,
                7789
            ],
            [
                7789,
                7804
            ],
            [
                7804,
                7893
            ],
            [
                7893,
                8021
            ],
            [
                8021,
                8068
            ],
            [
                8068,
                8192
            ],
            [
                8192,
                8284
            ],
            [
                8284,
                8326
            ],
            [
                8326,
                8348
            ],
            [
                8348,
                8348
            ],
            [
                8348,
                8406
            ],
            [
                8406,
                8426
            ],
            [
                8426,
                8560
            ],
            [
                8560,
                8647
            ],
            [
                8647,
                8812
            ],
            [
                8812,
                8893
            ],
            [
                8893,
                8953
            ],
            [
                8953,
                9000
            ],
            [
                9000,
                9031
            ],
            [
                9031,
                9054
            ],
            [
                9054,
                9101
            ],
            [
                9101,
                9188
            ],
            [
                9188,
                9243
            ],
            [
                9243,
                9243
            ],
            [
                9243,
                9328
            ],
            [
                9328,
                9469
            ],
            [
                9469,
                9588
            ],
            [
                9588,
                9612
            ],
            [
                9612,
                9694
            ],
            [
                9694,
                9785
            ]
        ]
    }
}