{
    "original": {
        "text": "George Vavasor's feeling of triumph was not unjustifiable. It is something to have sat in the House of Commons, though it has been but for one session! There is on the left-hand side of our great national hall,--on the left-hand side as one enters it, and opposite to the doors leading to the Law Courts,--a pair of gilded lamps, with a door between them, near to which a privileged old dame sells her apples and her oranges solely, as I presume, for the accommodation of the Members of the House and of the great policeman who guards the pass. Between those lamps is the entrance to the House of Commons, and none but Members may go that way! It is the only gate before which I have ever stood filled with envy,--sorrowing to think that my steps might never pass under it. There are many portals forbidden to me, as there are many forbidden to all men; and forbidden fruit, they say, is sweet; but my lips have watered after no other fruit but that which grows so high, within the sweep of that great policeman's truncheon.\nAh, my male friend and reader, who earnest thy bread, perhaps, as a country vicar; or sittest, may-be, at some weary desk in Somerset House; or who, perhaps, rulest the yard behind the Cheapside counter, hast thou never stood there and longed,--hast thou never confessed, when standing there, that Fate has been unkind to thee in denying thee the one thing that thou hast wanted? I have done so; and as my slow steps have led me up that more than royal staircase, to those passages and halls which require the hallowing breath of centuries to give them the glory in British eyes which they shall one day possess, I have told myself, in anger and in grief, that to die and not to have won that right of way, though but for a session,--not to have passed by the narrow entrance through those lamps,--is to die and not to have done that which it most becomes an Englishman to have achieved.\nThere are, doubtless, some who come out by that road, the loss of whose society is not to be regretted. England does not choose her six hundred and fifty-four best men. One comforts one's self, sometimes, with remembering that. The George Vavasors, the Calder Joneses, and the Botts are admitted. Dishonesty, ignorance, and vulgarity do not close the gate of that heaven against aspirants; and it is a consolation to the ambition of the poor to know that the ambition of the rich can attain that glory by the strength of its riches alone. But though England does not send thither none but her best men, the best of her Commoners do find their way there. It is the highest and most legitimate pride of an Englishman to have the letters M.P. written after his name. No selection from the alphabet, no doctorship, no fellowship, be it of ever so learned or royal a society, no knightship,--not though it be of the Garter,--confers so fair an honour. Mr. Bott was right when he declared that this country is governed from between the walls of that House, though the truth was almost defiled by the lips which uttered it. He might have added that from thence flow the waters of the world's progress,--the fullest fountain of advancing civilization.\nGeorge Vavasor, as he went in by the lamps and the apple-stall, under the guardianship of Mr. Bott, felt all the pride of which I have been speaking. He was a man quite capable of feeling such pride as it should be felt,--capable, in certain dreamy moments, of looking at the thing with pure and almost noble eyes; of understanding the ambition of serving with truth so great a nation as that which fate had made his own. Nature, I think, had so fashioned George Vavasor, that he might have been a good, and perhaps a great man; whereas Mr. Bott had been born small. Vavasor had educated himself to badness with his eyes open. He had known what was wrong, and had done it, having taught himself to think that bad things were best. But poor Mr. Bott had meant to do well, and thought that he had done very well indeed. He was a tuft-hunter and a toady, but he did not know that he was doing amiss in seeking to rise by tuft-hunting and toadying. He was both mean and vain, both a bully and a coward, and in politics, I fear, quite unscrupulous in spite of his grand dogmas; but he believed that he was progressing in public life by the proper and usual means, and was troubled by no idea that he did wrong.\nVavasor, in those dreamy moments of which I have spoken, would sometimes feel tempted to cut his throat and put an end to himself, because he knew that he had taught himself amiss. Again he would sadly ask himself whether it was yet too late; always, however, answering himself that it was too late. Even now, at this moment, as he went in between the lamps, and felt much of the honest pride of which I have spoken, he told himself that it was too late. What could he do now, hampered by such a debt as that which he owed to his cousin, and with the knowledge that it must be almost indefinitely increased, unless he meant to give up this seat in Parliament, which had cost him so dearly, almost before he had begun to enjoy it? But his courage was good, and he was able to resolve that he would go on with the business that he had in hand, and play out his game to the end. He had achieved his seat in the House of Commons, and was so far successful. Men who had ever been gracious to him were now more gracious than ever, and they who had not hitherto treated him with courtesy, now began to smile and to be very civil. It was, no doubt, a great thing to have the privilege of that entrance between the lamps.\nMr. Bott had the new Member now in hand, not because there had been any old friendship between them, but Mr. Bott was on the look-out for followers, and Vavasor was on the look-out for a party. A man gets no great thanks for attaching himself to existing power. Our friend might have enrolled himself among the general supporters of the Government without attracting much attention. He would in such case have been at the bottom of a long list. But Mr. Palliser was a rising man, round whom, almost without wish of his own, a party was forming itself. If he came into power,--as come he must, according to Mr. Bott and many others,--then they who had acknowledged the new light before its brightness had been declared, might expect their reward.\nVavasor, as he passed through the lobby to the door of the House, leaning on Mr. Bott's arm, was very silent. He had spoken but little since they had left their cab in Palace Yard, and was not very well pleased by the garrulity of his companion. He was going to sit among the first men of his nation, and to take his chance of making himself one of them. He believed in his own ability; he believed thoroughly in his own courage; but he did not believe in his own conduct. He feared that he had done,--feared still more strongly that he would be driven to do,--that which would shut men's ears against his words, and would banish him from high places. No man believes in himself who knows himself to be a rascal, however great may be his talent, or however high his pluck.\n\"Of course you have heard a debate?\" said Mr. Bott.\n\"Yes,\" answered Vavasor, who wished to remain silent.\n\"Many, probably?\"\n\"No.\"\n\"But you have heard debates from the gallery. Now you'll hear them from the body of the House, and you'll find how very different it is. There's no man can know what Parliament is who has never had a seat. Indeed no one can thoroughly understand the British Constitution without it. I felt, very early in life, that that should be my line; and though it's hard work and no pay, I mean to stick to it. How do, Thompson? You know Vavasor? He's just returned for the Chelsea Districts, and I'm taking him up. We shan't divide to-night; shall we? Look! there's Farringcourt just coming out; he's listened to better than any man in the House now, but he'll borrow half-a-crown from you if you'll lend him one. How d'ye do, my lord? I hope I have the pleasure of seeing you well?\" and Bott bowed low to a lord who was hurrying through the lobby as fast as his shuffling feet would carry him. \"Of course you know him?\"\nVavasor, however, did not know the lord in question, and was obliged to say so.\n\"I thought you were up to all these things?\" said Bott.\n\"Taking the peerage generally, I am not up to it,\" said Vavasor, with a curl on his lip.\n\"But you ought to have known him. That was Viscount Middlesex; he has got something on to-night about the Irish Church. His father is past ninety, and he's over sixty. We'll go in now; but let me give you one bit of advice, my dear fellow--don't think of speaking this session. A Member can do no good at that work till he has learned something of the forms of the House. The forms of the House are everything; upon my word they are. This is Mr. Vavasor, the new Member for the Chelsea Districts.\"\nOur friend was thus introduced to the doorkeeper, who smiled familiarly, and seemed to wink his eye. Then George Vavasor passed through into the House itself, under the wing of Mr. Bott.\nVavasor, as he walked up the House to the Clerk's table and took the oath and then walked down again, felt himself to be almost taken aback by the little notice which was accorded to him. It was not that he had expected to create a sensation, or that he had for a moment thought on the subject, but the thing which he was doing was so great to him, that the total indifference of those around him was a surprise to him. After he had taken his seat, a few men came up by degrees and shook hands with him; but it seemed, as they did so, merely because they were passing that way. He was anxious not to sit next to Mr. Bott, but he found himself unable to avoid this contiguity. That gentleman stuck to him pertinaciously, giving him directions which, at the spur of the moment, he hardly knew how not to obey. So he found himself sitting behind Mr. Palliser, a little to the right, while Mr. Bott occupied the ear of the rising man.\nThere was a debate in progress, but it seemed to Vavasor, as soon as he was able to become critical, to be but a dull affair, and yet the Chancellor of the Exchequer was on his legs, and Mr. Palliser was watching him as a cat watches a mouse. The speaker was full of figures, as becomes a Chancellor of the Exchequer; and as every new budget of them fell from him, Mr. Bott, with audible whispers, poured into the ear of his chief certain calculations of his own, most of which went to prove that the financier in office was altogether wrong. Vavasor thought that he could see that Mr. Palliser was receiving more of his assistance than was palatable to him. He would listen, if he did listen, without making any sign that he heard, and would occasionally shake his head with symptoms of impatience. But Mr. Bott was a man not to be repressed by a trifle. When Mr. Palliser shook his head he became more assiduous than ever, and when Mr. Palliser slightly moved himself to the left, he boldly followed him.\nNo general debate arose on the subject which the Minister had in hand, and when he sat down, Mr. Palliser would not get up, though Mr. Bott counselled him to do so. The matter was over for the night, and the time had arrived for Lord Middlesex. That nobleman got upon his feet, with a roll of papers in his hand, and was proceeding to address the House on certain matters of church reform, with great energy; but, alas, for him and for his feelings! before his energy had got itself into full swing, the Members were swarming away through the doors like a flock of sheep. Mr. Palliser got up and went, and was followed at once by Mr. Bott, who succeeded in getting hold of his arm in the lobby. Had not Mr. Palliser been an even-tempered, calculating man, with a mind and spirit well under his command, he must have learned to hate Mr. Bott before this time. Away streamed the Members, but still the noble lord went on speaking, struggling hard to keep up his fire as though no such exodus were in process. There was but little to console him. He knew that the papers would not report one sentence in twenty of those he uttered. He knew that no one would listen to him willingly. He knew that he had worked for weeks and months to get up his facts, and he was beginning to know that he had worked in vain. As he summoned courage to look round, he began to fear that some enemy would count the House, and that all would be over. He had given heart and soul to this affair. His cry was not as Vavasor's cry about the River Bank. He believed in his own subject with a great faith, thinking that he could make men happier and better, and bring them nearer to their God. I said that he had worked for weeks and months. I might have said that he had been all his life at this work. Though he shuffled with his feet when he walked, and knocked his words together when he talked, he was an earnest man, meaning to do well, seeking no other reward for his work than the appreciation of those whom he desired to serve. But this was never to be his. For him there was in store nothing but disappointment. And yet he will work on to the end, either in this House or in the other, labouring wearily, without visible wages of any kind, and, one may say, very sadly. But when he has been taken to his long rest, men will acknowledge that he has done something, and there will be left on the minds of those who shall remember him a conviction that he served a good cause diligently, and not altogether inefficiently. Invisible are his wages, yet in some coin are they paid. Invisible is the thing he does, and yet it is done. Let us hope that some sense of this tardy appreciation may soothe his spirit beyond the grave. On the present occasion there was nothing to soothe his spirit. The Speaker sat, urbane and courteous, with his eyes turned towards the unfortunate orator; but no other ears in the House seemed to listen to him. The corps of reporters had dwindled down to two, and they used their pens very listlessly, taking down here a sentence and there a sentence, knowing that their work was naught. Vavasor sat it out to the last, as it taught him a lesson in those forms of the House which Mr. Bott had truly told him it would be well that he should learn. And at last he did learn the form of a \"count-out.\" Some one from a back seat muttered something, which the Speaker understood; and that high officer, having had his attention called to a fact of which he would never have taken cognizance without such calling, did count the House, and finding that it contained but twenty-three Members, he put an end to his own labours and to those of poor Lord Middlesex. With what feelings that noble lord must have taken himself home, and sat himself down in his study, vainly opening a book before his eyes, can we not all imagine? A man he was with ample means, with children who would do honour to his name; one whose wife believed in him, if no one else would do so; a man, let us say, with a clear conscience, to whom all good things had been given. But of whom now was he thinking with envy? Early on that same day Farringcourt had spoken in the House,--a man to whom no one would lend a shilling, whom the privilege of that House kept out of gaol, whose word no man believed; who was wifeless, childless, and unloved. But three hundred men had hung listening upon his words. When he laughed in his speech, they laughed; when he was indignant against the Minister, they sat breathless, as the Spaniard sits in the critical moment of the bull-killing. Whichever way he turned himself, he carried them with him. Crowds of Members flocked into the House from libraries and smoking-rooms when it was known that this ne'er-do-well was on his legs. The Strangers' Gallery was filled to overflowing. The reporters turned their rapid pages, working their fingers wearily till the sweat drops stood upon their brows. And as the Premier was attacked with some special impetus of redoubled irony, men declared that he would be driven to enrol the speaker among his colleagues, in spite of dishonoured bills and evil reports. A man who could shake the thunderbolts like that must be paid to shake them on the right side. It was of this man, and of his success, that Lord Middlesex was envious, as he sat, wretched and respectable, in his solitary study!\nMr. Bott had left the House with Mr. Palliser; and Vavasor, after the count-out, was able to walk home by himself, and think of the position which he had achieved. He told himself over and over again that he had done a great thing in obtaining that which he now possessed, and he endeavoured to teach himself that the price he was paying for it was not too dear. But already there had come upon him something of that feeling,--that terribly human feeling,--which deprives every prize that is gained of half its value. The mere having it robs the diamond of its purity, and mixes vile alloy with the gold. Lord Middlesex, as he had floundered on into terrible disaster, had not been a subject to envy. There had been nothing of brilliance in the debate, and the Members had loomed no larger than ordinary men at ordinary clubs. The very doorkeepers had hardly treated them with respect. The great men with whose names the papers are filled had sat silent, gloomy, and apparently idle. As soon as a fair opportunity was given them they escaped out of the House, as boys might escape from school. Everybody had rejoiced in the break-up of the evening, except that one poor old lord who had worked so hard. Vavasor had spent everything that he had to become a Member of that House, and now, as he went alone to his lodgings, he could not but ask himself whether the thing purchased was worth the purchase-money.\nBut his courage was still high. Though he was gloomy, and almost sad, he knew that he could trust himself to fight out the battle to the last. On the morrow he would go to Queen Anne Street, and would demand sympathy there from her who had professed to sympathize with him so strongly in his political desires. With her, at any rate, the glory of his Membership would not be dimmed by any untoward knowledge of the realities. She had only seen the play acted from the boxes; and to her eyes the dresses would still be of silk velvet, and the swords of bright steel.",
        "paragraph_chars": [
            [
                0,
                1025
            ],
            [
                1025,
                1913
            ],
            [
                1913,
                3157
            ],
            [
                3157,
                4363
            ],
            [
                4363,
                5576
            ],
            [
                5576,
                6322
            ],
            [
                6322,
                7095
            ],
            [
                7095,
                7147
            ],
            [
                7147,
                7201
            ],
            [
                7201,
                7219
            ],
            [
                7219,
                7225
            ],
            [
                7225,
                8137
            ],
            [
                8137,
                8217
            ],
            [
                8217,
                8273
            ],
            [
                8273,
                8362
            ],
            [
                8362,
                8860
            ],
            [
                8860,
                9047
            ],
            [
                9047,
                9978
            ],
            [
                9978,
                10985
            ],
            [
                10985,
                16324
            ],
            [
                16324,
                17732
            ],
            [
                17732,
                18297
            ]
        ],
        "segment_chars": [
            [
                0,
                59
            ],
            [
                59,
                152
            ],
            [
                152,
                545
            ],
            [
                545,
                644
            ],
            [
                644,
                774
            ],
            [
                774,
                1025
            ],
            [
                1025,
                1405
            ],
            [
                1405,
                1913
            ],
            [
                1913,
                2017
            ],
            [
                2017,
                2082
            ],
            [
                2082,
                2141
            ],
            [
                2141,
                2210
            ],
            [
                2210,
                2452
            ],
            [
                2452,
                2567
            ],
            [
                2567,
                2653
            ],
            [
                2653,
                2677
            ],
            [
                2677,
                2860
            ],
            [
                2860,
                3030
            ],
            [
                3030,
                3157
            ],
            [
                3157,
                3307
            ],
            [
                3307,
                3579
            ],
            [
                3579,
                3724
            ],
            [
                3724,
                3784
            ],
            [
                3784,
                3888
            ],
            [
                3888,
                3975
            ],
            [
                3975,
                4102
            ],
            [
                4102,
                4363
            ],
            [
                4363,
                4544
            ],
            [
                4544,
                4663
            ],
            [
                4663,
                4818
            ],
            [
                4818,
                5093
            ],
            [
                5093,
                5239
            ],
            [
                5239,
                5316
            ],
            [
                5316,
                5486
            ],
            [
                5486,
                5576
            ],
            [
                5576,
                5770
            ],
            [
                5770,
                5838
            ],
            [
                5838,
                5959
            ],
            [
                5959,
                6021
            ],
            [
                6021,
                6128
            ],
            [
                6128,
                6322
            ],
            [
                6322,
                6432
            ],
            [
                6432,
                6568
            ],
            [
                6568,
                6677
            ],
            [
                6677,
                6795
            ],
            [
                6795,
                6974
            ],
            [
                6974,
                7095
            ],
            [
                7095,
                7132
            ],
            [
                7132,
                7147
            ],
            [
                7147,
                7201
            ],
            [
                7201,
                7219
            ],
            [
                7219,
                7225
            ],
            [
                7225,
                7271
            ],
            [
                7271,
                7362
            ],
            [
                7362,
                7431
            ],
            [
                7431,
                7508
            ],
            [
                7508,
                7626
            ],
            [
                7626,
                7644
            ],
            [
                7644,
                7662
            ],
            [
                7662,
                7731
            ],
            [
                7731,
                7768
            ],
            [
                7768,
                7774
            ],
            [
                7774,
                7930
            ],
            [
                7930,
                7952
            ],
            [
                7952,
                8000
            ],
            [
                8000,
                8111
            ],
            [
                8111,
                8137
            ],
            [
                8137,
                8217
            ],
            [
                8217,
                8262
            ],
            [
                8262,
                8273
            ],
            [
                8273,
                8362
            ],
            [
                8362,
                8396
            ],
            [
                8396,
                8482
            ],
            [
                8482,
                8530
            ],
            [
                8530,
                8640
            ],
            [
                8640,
                8734
            ],
            [
                8734,
                8796
            ],
            [
                8796,
                8860
            ],
            [
                8860,
                8961
            ],
            [
                8961,
                9047
            ],
            [
                9047,
                9235
            ],
            [
                9235,
                9467
            ],
            [
                9467,
                9625
            ],
            [
                9625,
                9723
            ],
            [
                9723,
                9855
            ],
            [
                9855,
                9978
            ],
            [
                9978,
                10221
            ],
            [
                10221,
                10521
            ],
            [
                10521,
                10637
            ],
            [
                10637,
                10778
            ],
            [
                10778,
                10834
            ],
            [
                10834,
                10985
            ],
            [
                10985,
                11150
            ],
            [
                11150,
                11230
            ],
            [
                11230,
                11435
            ],
            [
                11435,
                11557
            ],
            [
                11557,
                11680
            ],
            [
                11680,
                11844
            ],
            [
                11844,
                11992
            ],
            [
                11992,
                12029
            ],
            [
                12029,
                12114
            ],
            [
                12114,
                12165
            ],
            [
                12165,
                12291
            ],
            [
                12291,
                12413
            ],
            [
                12413,
                12457
            ],
            [
                12457,
                12512
            ],
            [
                12512,
                12651
            ],
            [
                12651,
                12699
            ],
            [
                12699,
                12761
            ],
            [
                12761,
                12994
            ],
            [
                12994,
                13024
            ],
            [
                13024,
                13079
            ],
            [
                13079,
                13237
            ],
            [
                13237,
                13486
            ],
            [
                13486,
                13543
            ],
            [
                13543,
                13595
            ],
            [
                13595,
                13690
            ],
            [
                13690,
                13754
            ],
            [
                13754,
                13902
            ],
            [
                13902,
                14079
            ],
            [
                14079,
                14238
            ],
            [
                14238,
                14290
            ],
            [
                14290,
                14646
            ],
            [
                14646,
                14809
            ],
            [
                14809,
                15031
            ],
            [
                15031,
                15074
            ],
            [
                15074,
                15301
            ],
            [
                15301,
                15358
            ],
            [
                15358,
                15533
            ],
            [
                15533,
                15592
            ],
            [
                15592,
                15725
            ],
            [
                15725,
                15775
            ],
            [
                15775,
                15890
            ],
            [
                15890,
                16096
            ],
            [
                16096,
                16191
            ],
            [
                16191,
                16324
            ],
            [
                16324,
                16488
            ],
            [
                16488,
                16687
            ],
            [
                16687,
                16842
            ],
            [
                16842,
                16929
            ],
            [
                16929,
                17025
            ],
            [
                17025,
                17151
            ],
            [
                17151,
                17210
            ],
            [
                17210,
                17308
            ],
            [
                17308,
                17418
            ],
            [
                17418,
                17527
            ],
            [
                17527,
                17732
            ],
            [
                17732,
                17764
            ],
            [
                17764,
                17875
            ],
            [
                17875,
                18043
            ],
            [
                18043,
                18158
            ],
            [
                18158,
                18297
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                50,
                59
            ],
            [
                59,
                110
            ],
            [
                234,
                247
            ],
            [
                186,
                210
            ],
            [
                161,
                182
            ],
            [
                306,
                328
            ],
            [
                330,
                354
            ],
            [
                543,
                545
            ],
            [
                545,
                644
            ],
            [
                644,
                712
            ],
            [
                720,
                773
            ],
            [
                1743,
                1746
            ],
            [
                1425,
                1497
            ],
            [
                1535,
                1539
            ],
            [
                1498,
                1516
            ],
            [
                1636,
                1730
            ],
            [
                1759,
                1820
            ],
            [
                1823,
                1825
            ],
            [
                1837,
                1913
            ],
            [
                1922,
                1923
            ],
            [
                2017,
                2033
            ],
            [
                2034,
                2082
            ],
            [
                2141,
                2210
            ],
            [
                2210,
                2283
            ],
            [
                2438,
                2444
            ],
            [
                2307,
                2309
            ],
            [
                2450,
                2451
            ],
            [
                2516,
                2527
            ],
            [
                2463,
                2470
            ],
            [
                2532,
                2567
            ],
            [
                2567,
                2584
            ],
            [
                2605,
                2653
            ],
            [
                2653,
                2677
            ],
            [
                2677,
                2679
            ],
            [
                2833,
                2860
            ],
            [
                2926,
                2930
            ],
            [
                2939,
                2962
            ],
            [
                3067,
                3097
            ],
            [
                3133,
                3157
            ],
            [
                3157,
                3199
            ],
            [
                3221,
                3265
            ],
            [
                3270,
                3275
            ],
            [
                3305,
                3307
            ],
            [
                3307,
                3313
            ],
            [
                3326,
                3333
            ],
            [
                3386,
                3390
            ],
            [
                3399,
                3512
            ],
            [
                3524,
                3541
            ],
            [
                3577,
                3578
            ],
            [
                3613,
                3628
            ],
            [
                3587,
                3595
            ],
            [
                3637,
                3724
            ],
            [
                3724,
                3763
            ],
            [
                3782,
                3784
            ],
            [
                3784,
                3828
            ],
            [
                3886,
                3888
            ],
            [
                3888,
                3975
            ],
            [
                3975,
                3983
            ],
            [
                3996,
                4028
            ],
            [
                4037,
                4040
            ],
            [
                4100,
                4102
            ],
            [
                4102,
                4199
            ],
            [
                4228,
                4269
            ],
            [
                4285,
                4298
            ],
            [
                4309,
                4314
            ],
            [
                4361,
                4363
            ],
            [
                4363,
                4374
            ],
            [
                4381,
                4395
            ],
            [
                4418,
                4536
            ],
            [
                4542,
                4544
            ],
            [
                4550,
                4591
            ],
            [
                4596,
                4605
            ],
            [
                4606,
                4612
            ],
            [
                4641,
                4652
            ],
            [
                4661,
                4663
            ],
            [
                4663,
                4720
            ],
            [
                4743,
                4755
            ],
            [
                4778,
                4795
            ],
            [
                4801,
                4818
            ],
            [
                4818,
                4851
            ],
            [
                4859,
                4863
            ],
            [
                4878,
                4885
            ],
            [
                4889,
                4939
            ],
            [
                4960,
                5021
            ],
            [
                5053,
                5092
            ],
            [
                5093,
                5125
            ],
            [
                5135,
                5137
            ],
            [
                5209,
                5239
            ],
            [
                5239,
                5287
            ],
            [
                5314,
                5316
            ],
            [
                5316,
                5319
            ],
            [
                5354,
                5358
            ],
            [
                5338,
                5353
            ],
            [
                5359,
                5362
            ],
            [
                5386,
                5391
            ],
            [
                5397,
                5408
            ],
            [
                5418,
                5443
            ],
            [
                5449,
                5454
            ],
            [
                5468,
                5486
            ],
            [
                5486,
                5492
            ],
            [
                5504,
                5576
            ],
            [
                5576,
                5603
            ],
            [
                5608,
                5634
            ],
            [
                5644,
                5680
            ],
            [
                5681,
                5770
            ],
            [
                6322,
                6386
            ],
            [
                6399,
                6407
            ],
            [
                6413,
                6432
            ],
            [
                6432,
                6434
            ],
            [
                6507,
                6568
            ],
            [
                6677,
                6707
            ],
            [
                6735,
                6795
            ],
            [
                6795,
                6821
            ],
            [
                6859,
                6864
            ],
            [
                6865,
                6880
            ],
            [
                6883,
                6974
            ],
            [
                6974,
                7033
            ],
            [
                7093,
                7095
            ],
            [
                7095,
                7132
            ],
            [
                7132,
                7147
            ],
            [
                7147,
                7170
            ],
            [
                7199,
                7201
            ],
            [
                7225,
                7271
            ],
            [
                7271,
                7362
            ],
            [
                7370,
                7431
            ],
            [
                7508,
                7626
            ],
            [
                7626,
                7644
            ],
            [
                7644,
                7662
            ],
            [
                7662,
                7731
            ],
            [
                7731,
                7747
            ],
            [
                7758,
                7768
            ],
            [
                7768,
                7774
            ],
            [
                7774,
                7861
            ],
            [
                7865,
                7930
            ],
            [
                7930,
                7952
            ],
            [
                7952,
                7958
            ],
            [
                7989,
                7992
            ],
            [
                7993,
                8000
            ],
            [
                8000,
                8036
            ],
            [
                8079,
                8088
            ],
            [
                8046,
                8063
            ],
            [
                8109,
                8111
            ],
            [
                8111,
                8137
            ],
            [
                8137,
                8144
            ],
            [
                8194,
                8212
            ],
            [
                8155,
                8162
            ],
            [
                8215,
                8217
            ],
            [
                8396,
                8448
            ],
            [
                8458,
                8482
            ],
            [
                8530,
                8600
            ],
            [
                8602,
                8640
            ],
            [
                8640,
                8663
            ],
            [
                8677,
                8696
            ],
            [
                8710,
                8734
            ],
            [
                8796,
                8860
            ],
            [
                8860,
                8951
            ],
            [
                8959,
                8961
            ],
            [
                8961,
                9017
            ],
            [
                9045,
                9047
            ],
            [
                9047,
                9071
            ],
            [
                9082,
                9148
            ],
            [
                9168,
                9217
            ],
            [
                9230,
                9235
            ],
            [
                9235,
                9288
            ],
            [
                9340,
                9394
            ],
            [
                9396,
                9443
            ],
            [
                9448,
                9458
            ],
            [
                9465,
                9467
            ],
            [
                9467,
                9513
            ],
            [
                9525,
                9554
            ],
            [
                9582,
                9588
            ],
            [
                9580,
                9581
            ],
            [
                9555,
                9565
            ],
            [
                9589,
                9625
            ],
            [
                9625,
                9675
            ],
            [
                9690,
                9705
            ],
            [
                9721,
                9723
            ],
            [
                9855,
                9978
            ],
            [
                9978,
                10008
            ],
            [
                10014,
                10034
            ],
            [
                10050,
                10053
            ],
            [
                10089,
                10102
            ],
            [
                10112,
                10221
            ],
            [
                10221,
                10252
            ],
            [
                10294,
                10299
            ],
            [
                10343,
                10408
            ],
            [
                10433,
                10440
            ],
            [
                10417,
                10429
            ],
            [
                10440,
                10478
            ],
            [
                10267,
                10277
            ],
            [
                10499,
                10521
            ],
            [
                10521,
                10541
            ],
            [
                10560,
                10572
            ],
            [
                10587,
                10594
            ],
            [
                10599,
                10614
            ],
            [
                10542,
                10544
            ],
            [
                10635,
                10637
            ],
            [
                10637,
                10748
            ],
            [
                10776,
                10777
            ],
            [
                10778,
                10794
            ],
            [
                10801,
                10820
            ],
            [
                10832,
                10834
            ],
            [
                10834,
                10985
            ],
            [
                10985,
                11023
            ],
            [
                11054,
                11064
            ],
            [
                11030,
                11033
            ],
            [
                11068,
                11150
            ],
            [
                11150,
                11230
            ],
            [
                11230,
                11340
            ],
            [
                11349,
                11412
            ],
            [
                11433,
                11435
            ],
            [
                11435,
                11441
            ],
            [
                11453,
                11460
            ],
            [
                11468,
                11556
            ],
            [
                11557,
                11680
            ],
            [
                11680,
                11722
            ],
            [
                11736,
                11825
            ],
            [
                11842,
                11843
            ],
            [
                11844,
                11912
            ],
            [
                11950,
                11992
            ],
            [
                12029,
                12045
            ],
            [
                12053,
                12095
            ],
            [
                12112,
                12114
            ],
            [
                12165,
                12237
            ],
            [
                12263,
                12291
            ],
            [
                12413,
                12457
            ],
            [
                12512,
                12585
            ],
            [
                12619,
                12624
            ],
            [
                12591,
                12594
            ],
            [
                12630,
                12651
            ],
            [
                12761,
                12779
            ],
            [
                12794,
                12910
            ],
            [
                12917,
                12923
            ],
            [
                12911,
                12916
            ],
            [
                12937,
                12941
            ],
            [
                12946,
                12958
            ],
            [
                12992,
                12994
            ],
            [
                12994,
                13023
            ],
            [
                13079,
                13237
            ],
            [
                13237,
                13290
            ],
            [
                13386,
                13394
            ],
            [
                13412,
                13486
            ],
            [
                13543,
                13594
            ],
            [
                13690,
                13754
            ],
            [
                13754,
                13902
            ],
            [
                14079,
                14127
            ],
            [
                14140,
                14183
            ],
            [
                14190,
                14198
            ],
            [
                14221,
                14223
            ],
            [
                14231,
                14238
            ],
            [
                14238,
                14290
            ],
            [
                14290,
                14335
            ],
            [
                14366,
                14369
            ],
            [
                14342,
                14353
            ],
            [
                14520,
                14523
            ],
            [
                14509,
                14518
            ],
            [
                14524,
                14531
            ],
            [
                14554,
                14592
            ],
            [
                14601,
                14608
            ],
            [
                14622,
                14645
            ],
            [
                15288,
                15291
            ],
            [
                15080,
                15133
            ],
            [
                15136,
                15179
            ],
            [
                15231,
                15244
            ],
            [
                15249,
                15258
            ],
            [
                15301,
                15331
            ],
            [
                15342,
                15358
            ],
            [
                15358,
                15424
            ],
            [
                15445,
                15466
            ],
            [
                15531,
                15533
            ],
            [
                15533,
                15556
            ],
            [
                15564,
                15592
            ],
            [
                15592,
                15711
            ],
            [
                15723,
                15725
            ],
            [
                15775,
                15788
            ],
            [
                15796,
                15801
            ],
            [
                15808,
                15813
            ],
            [
                15888,
                15890
            ],
            [
                15890,
                15926
            ],
            [
                15961,
                15994
            ],
            [
                16005,
                16046
            ],
            [
                16094,
                16096
            ],
            [
                16096,
                16191
            ],
            [
                16191,
                16197
            ],
            [
                16201,
                16209
            ],
            [
                16231,
                16250
            ],
            [
                16322,
                16324
            ],
            [
                16324,
                16374
            ],
            [
                16384,
                16403
            ],
            [
                16375,
                16382
            ],
            [
                16422,
                16438
            ],
            [
                16449,
                16488
            ],
            [
                16488,
                16535
            ],
            [
                16541,
                16554
            ],
            [
                16595,
                16600
            ],
            [
                16616,
                16618
            ],
            [
                16625,
                16647
            ],
            [
                16669,
                16686
            ],
            [
                16687,
                16722
            ],
            [
                16741,
                16748
            ],
            [
                16733,
                16735
            ],
            [
                16840,
                16842
            ],
            [
                17025,
                17039
            ],
            [
                17051,
                17151
            ],
            [
                17210,
                17223
            ],
            [
                17241,
                17251
            ],
            [
                17263,
                17306
            ],
            [
                17308,
                17318
            ],
            [
                17353,
                17365
            ],
            [
                17373,
                17418
            ],
            [
                17527,
                17657
            ],
            [
                17666,
                17681
            ],
            [
                17702,
                17732
            ],
            [
                17732,
                17764
            ],
            [
                17764,
                17817
            ],
            [
                17841,
                17846
            ],
            [
                17851,
                17875
            ],
            [
                18017,
                18019
            ],
            [
                17878,
                17948
            ],
            [
                17955,
                17959
            ],
            [
                18041,
                18043
            ],
            [
                18043,
                18120
            ],
            [
                18130,
                18158
            ],
            [
                18158,
                18297
            ]
        ],
        "row_chars": [
            [
                0,
                59
            ],
            [
                59,
                152
            ],
            [
                152,
                545
            ],
            [
                545,
                644
            ],
            [
                644,
                774
            ],
            [
                774,
                1025
            ],
            [
                1025,
                1405
            ],
            [
                1405,
                1913
            ],
            [
                1913,
                2082
            ],
            [
                2082,
                2141
            ],
            [
                2141,
                2210
            ],
            [
                2210,
                2452
            ],
            [
                2452,
                2567
            ],
            [
                2567,
                2653
            ],
            [
                2653,
                2677
            ],
            [
                2677,
                2860
            ],
            [
                2860,
                3157
            ],
            [
                3157,
                3307
            ],
            [
                3307,
                3579
            ],
            [
                3579,
                3724
            ],
            [
                3724,
                3784
            ],
            [
                3784,
                3888
            ],
            [
                3888,
                3975
            ],
            [
                3975,
                4102
            ],
            [
                4102,
                4363
            ],
            [
                4363,
                4544
            ],
            [
                4544,
                4663
            ],
            [
                4663,
                4818
            ],
            [
                4818,
                5093
            ],
            [
                5093,
                5239
            ],
            [
                5239,
                5316
            ],
            [
                5316,
                5486
            ],
            [
                5486,
                5576
            ],
            [
                5576,
                5770
            ],
            [
                5770,
                5838
            ],
            [
                5838,
                5959
            ],
            [
                5959,
                6021
            ],
            [
                6021,
                6128
            ],
            [
                6128,
                6322
            ],
            [
                6322,
                6432
            ],
            [
                6432,
                6568
            ],
            [
                6568,
                6677
            ],
            [
                6677,
                6795
            ],
            [
                6795,
                6974
            ],
            [
                6974,
                7095
            ],
            [
                7095,
                7132
            ],
            [
                7132,
                7147
            ],
            [
                7147,
                7201
            ],
            [
                7201,
                7219
            ],
            [
                7219,
                7225
            ],
            [
                7225,
                7271
            ],
            [
                7271,
                7362
            ],
            [
                7362,
                7431
            ],
            [
                7431,
                7508
            ],
            [
                7508,
                7626
            ],
            [
                7626,
                7644
            ],
            [
                7644,
                7662
            ],
            [
                7662,
                7731
            ],
            [
                7731,
                7768
            ],
            [
                7768,
                7774
            ],
            [
                7774,
                7930
            ],
            [
                7930,
                7952
            ],
            [
                7952,
                8000
            ],
            [
                8000,
                8111
            ],
            [
                8111,
                8137
            ],
            [
                8137,
                8217
            ],
            [
                8217,
                8262
            ],
            [
                8262,
                8273
            ],
            [
                8273,
                8362
            ],
            [
                8362,
                8396
            ],
            [
                8396,
                8482
            ],
            [
                8482,
                8530
            ],
            [
                8530,
                8640
            ],
            [
                8640,
                8734
            ],
            [
                8734,
                8796
            ],
            [
                8796,
                8860
            ],
            [
                8860,
                8961
            ],
            [
                8961,
                9047
            ],
            [
                9047,
                9235
            ],
            [
                9235,
                9467
            ],
            [
                9467,
                9625
            ],
            [
                9625,
                9723
            ],
            [
                9723,
                9855
            ],
            [
                9855,
                9978
            ],
            [
                9978,
                10221
            ],
            [
                10221,
                10521
            ],
            [
                10521,
                10637
            ],
            [
                10637,
                10778
            ],
            [
                10778,
                10834
            ],
            [
                10834,
                10985
            ],
            [
                10985,
                11150
            ],
            [
                11150,
                11230
            ],
            [
                11230,
                11435
            ],
            [
                11435,
                11557
            ],
            [
                11557,
                11680
            ],
            [
                11680,
                11844
            ],
            [
                11844,
                11992
            ],
            [
                11992,
                12029
            ],
            [
                12029,
                12114
            ],
            [
                12114,
                12165
            ],
            [
                12165,
                12291
            ],
            [
                12291,
                12413
            ],
            [
                12413,
                12457
            ],
            [
                12457,
                12512
            ],
            [
                12512,
                12651
            ],
            [
                12651,
                12699
            ],
            [
                12699,
                12761
            ],
            [
                12761,
                12994
            ],
            [
                12994,
                13024
            ],
            [
                13024,
                13079
            ],
            [
                13079,
                13237
            ],
            [
                13237,
                13486
            ],
            [
                13486,
                13543
            ],
            [
                13543,
                13595
            ],
            [
                13595,
                13690
            ],
            [
                13690,
                13754
            ],
            [
                13754,
                13902
            ],
            [
                13902,
                14079
            ],
            [
                14079,
                14238
            ],
            [
                14238,
                14290
            ],
            [
                14290,
                14646
            ],
            [
                14646,
                14809
            ],
            [
                14809,
                15031
            ],
            [
                15031,
                15074
            ],
            [
                15074,
                15358
            ],
            [
                15358,
                15533
            ],
            [
                15533,
                15592
            ],
            [
                15592,
                15725
            ],
            [
                15725,
                15775
            ],
            [
                15775,
                15890
            ],
            [
                15890,
                16096
            ],
            [
                16096,
                16191
            ],
            [
                16191,
                16324
            ],
            [
                16324,
                16488
            ],
            [
                16488,
                16687
            ],
            [
                16687,
                16842
            ],
            [
                16842,
                16929
            ],
            [
                16929,
                17025
            ],
            [
                17025,
                17151
            ],
            [
                17151,
                17210
            ],
            [
                17210,
                17418
            ],
            [
                17418,
                17527
            ],
            [
                17527,
                17732
            ],
            [
                17732,
                17764
            ],
            [
                17764,
                17875
            ],
            [
                17875,
                18043
            ],
            [
                18043,
                18158
            ],
            [
                18158,
                18297
            ]
        ]
    },
    "abridged": {
        "text": "George Vavasor's feeling of triumph was justifiable. It is something to have sat in the House of Commons.\nAs one enters our great national hall, on the left-hand side are a pair of gilded lamps with a door between them. Between those lamps is the entrance to the House of Commons, and none but Members may go that way! It is the only gate before which I have ever stood filled with envy, sorrowing to think that my steps might never pass under it.\nFor as my slow steps have led me up that more than royal staircase, to those hallowed passages and halls, I have told myself, in anger and in grief, that to die and not to have won that right of way - not to have passed by the narrow entrance through those lamps - is not to have done that which it most becomes an Englishman to have achieved.\nDoubtless, England does not always choose her six hundred and fifty-four best men. The George Vavasors, the Calder Joneses, and the Botts are admitted. Dishonesty, ignorance, and vulgarity do not close the gate of that heaven, though riches open it.\nYet the best of England's Commoners do find their way there. It is the highest pride of an Englishman to have the letters M.P. written after his name. No other membership confers so fair an honour. From within the walls of that House flow the waters of the world's advancing civilization.\nGeorge Vavasor, as he went in by the lamps under the guardianship of Mr. Bott, felt all due pride. He was capable, in dreamy moments, of looking at the thing with pure and almost noble eyes; of understanding the ambition of serving faithfully so great a nation.\nGeorge Vavasor, I think, might have been a good, and perhaps a great man; whereas Mr. Bott had been born small. Vavasor had educated himself to badness knowingly. He had known what was wrong, and had done it. But poor Mr. Bott had meant to do well, and thought that he had done very well indeed. He was a flatterer and a toady, but he did not know this was wrong. He was both mean and vain, both a bully and a coward, and in politics, I fear, quite unscrupulous; but he believed that he was progressing by the proper means.\nVavasor, in his dreamy moments, would sometimes feel tempted to cut his throat and put an end to himself, because he knew that he had taught himself wrongly. He would sadly ask himself whether it was still too late; and he always answered that it was. Even now, at this moment, as he went in between the lamps with honest pride, he told himself it was too late. What could he do now, hampered by the debt he owed his cousin, and with the knowledge that it must be hugely increased, unless he meant to give up this seat in Parliament almost before he had begun to enjoy it?\nBut his courage was good, and he resolved to play out his game to the end. He had achieved his seat in the House of Commons. Men were gracious to him now, and those who had not treated him with courtesy began to be very civil. It was a great thing to have the privilege of that entrance between the lamps.\nMr. Bott had the new Member in hand, not because there was any old friendship between them, but because Mr. Bott was on the look-out for followers, and Vavasor was on the look-out for a party. Vavasor, as he passed through the lobby to the door of the House with Mr. Bott, was very silent. He was not very well pleased by the garrulity of his companion. He believed in his own ability and his own courage; but he did not believe in his own conduct. He feared that he had done - and would in future be driven to do - that which would shut men's ears against his words, and would banish him from high places. No man believes in himself who knows himself to be a rascal.\n\"Of course you have heard a debate?\" said Mr. Bott.\n\"Yes,\" answered Vavasor.\n\"But you have heard debates from the gallery. Now you'll hear them from the body of the House, and you'll find how very different it is. No man can know what Parliament is who has never had a seat. I felt, very early in life, that that should be my line; and though it's hard work and no pay, I mean to stick to it. How do, Thompson? You know Vavasor? He's just returned for the Chelsea Districts, and I'm taking him up. We shan't divide tonight, shall we? Look! there's Farringcourt just coming out; he's listened to better than any man in the House, but he'll borrow half-a-crown from you if you'll lend him one. How d'ye do, my lord? I hope you are well?\" and Bott bowed low to a lord who was shuffling through the lobby. \"Of course you know him?\"\nVavasor was obliged to say he did not.\n\"That was Viscount Middlesex; he has got something on tonight about the Irish Church. We'll go in now; but let me give you one bit of advice, my dear fellow - don't think of speaking this session. A Member can do no good by speaking till he has learned the forms of the House. This is Mr. Vavasor, the new Member for the Chelsea Districts.\"\nOur friend was thus introduced to the doorkeeper, who smiled familiarly, and seemed to wink. Then George Vavasor passed through into the House itself.\nVavasor, as he walked up to the Clerk's table and took the oath and then walked down again, was almost taken aback by the little notice which was taken of him. It was not that he had expected to create a sensation, but the thing which he was doing was so great to him that the total indifference of those around him came as a surprise. After he had taken his seat, a few men came up and shook hands with him; but merely, it seemed, because they were passing that way. He was anxious not to sit next to Mr. Bott, but he was unable to avoid it. So he found himself sitting behind Mr. Palliser, a little to the right, while Mr. Bott occupied the ear of the rising man.\nThere was a debate in progress. It seemed to Vavasor that it was a dull affair. The Chancellor of the Exchequer was on his legs, and Mr. Palliser was watching him as a cat watches a mouse. The speaker was full of figures; and Mr. Bott, with audible whispers, poured into the ear of his chief his own calculations, most of which went to prove that the Chancellor was altogether wrong. Vavasor thought that Mr. Palliser received more of this assistance than he liked. He would listen, if he did listen, without making any sign that he heard, and would occasionally shake his head impatiently.\nBut Mr. Bott was not to be repressed. When Mr. Palliser shook his head he became more assiduous than ever, and when Mr. Palliser slightly moved himself to the left, he boldly followed him.\nNo general debate arose on the subject, and when the Chancellor sat down, Mr. Palliser would not get up, though Mr. Bott counselled him to do so. The matter was over for the night, and the time had arrived for Lord Middlesex. That nobleman got upon his feet, with a roll of papers in his hand, and was proceeding to address the House on matters of church reform, with great energy; but, alas, for him! before he had got into full swing, the Members were swarming away through the doors like a flock of sheep.\nMr. Palliser got up and went, and was followed at once by Mr. Bott, who succeeded in getting hold of his arm in the lobby. Had not Mr. Palliser been an even-tempered man, with a mind and spirit well under his command, he must have learned to hate Mr. Bott by now.\nAway streamed the Members, but still the noble lord went on speaking as though no such exodus were in process. He knew that the newspapers would not report one sentence in twenty of his speech. He knew that he had worked for weeks and months to get up his facts, and realised that he had worked in vain. He had given heart and soul to this affair. He believed in his own subject with a great faith, thinking that he could bring men nearer to their God. Though he shuffled when he walked, and knocked his words together when he talked, he was an earnest man, meaning to do well, seeking no reward other than appreciation. But this was never to be his.\nAnd yet he will work on to the end, either in this House or in the other, labouring wearily, without visible wages of any kind, and, one may say, very sadly. But when he has been taken to his long rest, men will remember that he served a good cause diligently, and not altogether inefficiently. Invisible is the thing he does, and yet it is done.\nBut on the present occasion there was nothing to soothe his spirit. The Speaker sat, urbane and courteous, with his eyes turned towards the unfortunate orator; but no other ears in the House seemed to listen to him. Vavasor sat it out to the last, as it taught him those forms of the House which Mr. Bott had told him he needed to learn. And at last he did learn the form of a \"count-out.\" Some one from a back seat muttered something, and the Speaker heard and counted the Members in the House. Finding only twenty-three Members, he put an end to the labours of poor Lord Middlesex.\nAnd yet earlier on that same day Farringcourt had spoken in the House - a man to whom no one would lend a shilling, and whose word no one believed; but three hundred men had hung upon his words. When he laughed in his speech, they laughed; when he was indignant, they sat breathless. Whichever way he turned, he carried them with him. Crowds of Members flocked into the House from libraries and smoking-rooms when it was known that this ne'er-do-well was speaking. The reporters filled their pages. And as the Premier was attacked with irony, men declared that he would have to enrol the speaker among his colleagues. A man who could shake the thunderbolts like that must be paid to shake them on the right side. It was this man that Lord Middlesex envied!\nMr. Bott had left the House with Mr. Palliser; and after the count-out Vavasor walked home by himself, thinking of the position which he had achieved. He told himself over and over again that he had won a great thing, and tried to persuade himself that the price was not too dear.\nBut already there had come upon him some feeling of anti-climax and disappointment. There had been no brilliance in the debate, and the Members had loomed no larger than ordinary men at ordinary clubs. The great men named in the papers had sat silent, gloomy, and apparently idle; as soon as they could, they escaped from the House, as boys might escape from school. Vavasor had spent everything that he had to become a Member of that House, and now, as he went alone to his lodgings, he could not help asking himself whether it was worth the purchase-money.\nBut his courage was still high. Though he was gloomy, and almost sad, he knew that he would fight the battle to the last. In the morrow he would go to Queen Anne Street, and would demand sympathy from Alice. With her, at any rate, the glory of his Membership would not be dimmed by any knowledge of the realities. She had only seen the play acted from the boxes; and to her eyes the dresses would still be of silk velvet, and the swords of bright steel.",
        "paragraph_chars": [
            [
                0,
                106
            ],
            [
                106,
                448
            ],
            [
                448,
                792
            ],
            [
                792,
                1042
            ],
            [
                1042,
                1331
            ],
            [
                1331,
                1593
            ],
            [
                1593,
                2117
            ],
            [
                2117,
                2690
            ],
            [
                2690,
                2996
            ],
            [
                2996,
                3664
            ],
            [
                3664,
                3716
            ],
            [
                3716,
                3741
            ],
            [
                3741,
                4492
            ],
            [
                4492,
                4531
            ],
            [
                4531,
                4872
            ],
            [
                4872,
                5023
            ],
            [
                5023,
                5689
            ],
            [
                5689,
                6280
            ],
            [
                6280,
                6469
            ],
            [
                6469,
                6978
            ],
            [
                6978,
                7242
            ],
            [
                7242,
                7893
            ],
            [
                7893,
                8240
            ],
            [
                8240,
                8824
            ],
            [
                8824,
                9581
            ],
            [
                9581,
                9862
            ],
            [
                9862,
                10421
            ],
            [
                10421,
                10874
            ]
        ],
        "segment_chars": [
            [
                0,
                53
            ],
            [
                53,
                106
            ],
            [
                106,
                220
            ],
            [
                220,
                319
            ],
            [
                319,
                448
            ],
            [
                448,
                792
            ],
            [
                792,
                875
            ],
            [
                875,
                944
            ],
            [
                944,
                1042
            ],
            [
                1042,
                1103
            ],
            [
                1103,
                1169
            ],
            [
                1169,
                1193
            ],
            [
                1193,
                1240
            ],
            [
                1240,
                1331
            ],
            [
                1331,
                1430
            ],
            [
                1430,
                1593
            ],
            [
                1593,
                1705
            ],
            [
                1705,
                1756
            ],
            [
                1756,
                1802
            ],
            [
                1802,
                1889
            ],
            [
                1889,
                1957
            ],
            [
                1957,
                2117
            ],
            [
                2117,
                2275
            ],
            [
                2275,
                2369
            ],
            [
                2369,
                2479
            ],
            [
                2479,
                2690
            ],
            [
                2690,
                2765
            ],
            [
                2765,
                2815
            ],
            [
                2815,
                2917
            ],
            [
                2917,
                2996
            ],
            [
                2996,
                3189
            ],
            [
                3189,
                3286
            ],
            [
                3286,
                3350
            ],
            [
                3350,
                3445
            ],
            [
                3445,
                3603
            ],
            [
                3603,
                3664
            ],
            [
                3664,
                3701
            ],
            [
                3701,
                3716
            ],
            [
                3716,
                3741
            ],
            [
                3741,
                3787
            ],
            [
                3787,
                3878
            ],
            [
                3878,
                3939
            ],
            [
                3939,
                4057
            ],
            [
                4057,
                4075
            ],
            [
                4075,
                4093
            ],
            [
                4093,
                4162
            ],
            [
                4162,
                4198
            ],
            [
                4198,
                4204
            ],
            [
                4204,
                4356
            ],
            [
                4356,
                4378
            ],
            [
                4378,
                4400
            ],
            [
                4400,
                4466
            ],
            [
                4466,
                4492
            ],
            [
                4492,
                4531
            ],
            [
                4531,
                4617
            ],
            [
                4617,
                4728
            ],
            [
                4728,
                4808
            ],
            [
                4808,
                4872
            ],
            [
                4872,
                4965
            ],
            [
                4965,
                5023
            ],
            [
                5023,
                5183
            ],
            [
                5183,
                5359
            ],
            [
                5359,
                5491
            ],
            [
                5491,
                5566
            ],
            [
                5566,
                5689
            ],
            [
                5689,
                5721
            ],
            [
                5721,
                5769
            ],
            [
                5769,
                5878
            ],
            [
                5878,
                6073
            ],
            [
                6073,
                6155
            ],
            [
                6155,
                6280
            ],
            [
                6280,
                6318
            ],
            [
                6318,
                6469
            ],
            [
                6469,
                6615
            ],
            [
                6615,
                6695
            ],
            [
                6695,
                6871
            ],
            [
                6871,
                6978
            ],
            [
                6978,
                7101
            ],
            [
                7101,
                7242
            ],
            [
                7242,
                7353
            ],
            [
                7353,
                7436
            ],
            [
                7436,
                7546
            ],
            [
                7546,
                7590
            ],
            [
                7590,
                7695
            ],
            [
                7695,
                7863
            ],
            [
                7863,
                7893
            ],
            [
                7893,
                8051
            ],
            [
                8051,
                8188
            ],
            [
                8188,
                8240
            ],
            [
                8240,
                8308
            ],
            [
                8308,
                8456
            ],
            [
                8456,
                8578
            ],
            [
                8578,
                8630
            ],
            [
                8630,
                8736
            ],
            [
                8736,
                8824
            ],
            [
                8824,
                9019
            ],
            [
                9019,
                9108
            ],
            [
                9108,
                9159
            ],
            [
                9159,
                9289
            ],
            [
                9289,
                9323
            ],
            [
                9323,
                9442
            ],
            [
                9442,
                9537
            ],
            [
                9537,
                9581
            ],
            [
                9581,
                9732
            ],
            [
                9732,
                9862
            ],
            [
                9862,
                9946
            ],
            [
                9946,
                10064
            ],
            [
                10064,
                10229
            ],
            [
                10229,
                10421
            ],
            [
                10421,
                10453
            ],
            [
                10453,
                10543
            ],
            [
                10543,
                10629
            ],
            [
                10629,
                10735
            ],
            [
                10735,
                10874
            ]
        ],
        "overlap_chars": [
            [
                0,
                39
            ],
            [
                44,
                53
            ],
            [
                53,
                104
            ],
            [
                106,
                119
            ],
            [
                120,
                144
            ],
            [
                145,
                166
            ],
            [
                171,
                193
            ],
            [
                194,
                218
            ],
            [
                218,
                220
            ],
            [
                220,
                319
            ],
            [
                319,
                387
            ],
            [
                394,
                447
            ],
            [
                448,
                451
            ],
            [
                452,
                524
            ],
            [
                525,
                529
            ],
            [
                534,
                552
            ],
            [
                552,
                646
            ],
            [
                649,
                710
            ],
            [
                713,
                715
            ],
            [
                716,
                792
            ],
            [
                801,
                802
            ],
            [
                803,
                819
            ],
            [
                827,
                875
            ],
            [
                875,
                944
            ],
            [
                944,
                1017
            ],
            [
                1026,
                1032
            ],
            [
                1038,
                1040
            ],
            [
                1040,
                1041
            ],
            [
                1046,
                1057
            ],
            [
                1058,
                1065
            ],
            [
                1068,
                1103
            ],
            [
                1103,
                1120
            ],
            [
                1121,
                1169
            ],
            [
                1169,
                1193
            ],
            [
                1193,
                1195
            ],
            [
                1213,
                1240
            ],
            [
                1240,
                1244
            ],
            [
                1252,
                1275
            ],
            [
                1276,
                1306
            ],
            [
                1307,
                1331
            ],
            [
                1331,
                1373
            ],
            [
                1374,
                1418
            ],
            [
                1423,
                1428
            ],
            [
                1428,
                1430
            ],
            [
                1430,
                1436
            ],
            [
                1437,
                1444
            ],
            [
                1444,
                1448
            ],
            [
                1449,
                1562
            ],
            [
                1574,
                1591
            ],
            [
                1591,
                1592
            ],
            [
                1593,
                1608
            ],
            [
                1609,
                1617
            ],
            [
                1618,
                1705
            ],
            [
                1705,
                1744
            ],
            [
                1754,
                1756
            ],
            [
                1756,
                1800
            ],
            [
                1800,
                1802
            ],
            [
                1802,
                1889
            ],
            [
                1889,
                1897
            ],
            [
                1908,
                1940
            ],
            [
                1946,
                1949
            ],
            [
                1955,
                1957
            ],
            [
                1957,
                2054
            ],
            [
                2054,
                2095
            ],
            [
                2096,
                2109
            ],
            [
                2110,
                2115
            ],
            [
                2115,
                2117
            ],
            [
                2117,
                2128
            ],
            [
                2133,
                2147
            ],
            [
                2147,
                2265
            ],
            [
                2273,
                2275
            ],
            [
                2275,
                2316
            ],
            [
                2323,
                2332
            ],
            [
                2340,
                2346
            ],
            [
                2356,
                2367
            ],
            [
                2367,
                2369
            ],
            [
                2369,
                2426
            ],
            [
                2432,
                2444
            ],
            [
                2444,
                2461
            ],
            [
                2462,
                2479
            ],
            [
                2479,
                2512
            ],
            [
                2517,
                2521
            ],
            [
                2522,
                2529
            ],
            [
                2530,
                2580
            ],
            [
                2588,
                2649
            ],
            [
                2650,
                2689
            ],
            [
                2690,
                2722
            ],
            [
                2732,
                2734
            ],
            [
                2735,
                2765
            ],
            [
                2765,
                2813
            ],
            [
                2813,
                2815
            ],
            [
                2815,
                2818
            ],
            [
                2819,
                2823
            ],
            [
                2824,
                2839
            ],
            [
                2840,
                2843
            ],
            [
                2843,
                2848
            ],
            [
                2855,
                2866
            ],
            [
                2867,
                2892
            ],
            [
                2893,
                2898
            ],
            [
                2899,
                2917
            ],
            [
                2917,
                2923
            ],
            [
                2924,
                2996
            ],
            [
                2996,
                3023
            ],
            [
                3024,
                3050
            ],
            [
                3055,
                3091
            ],
            [
                3100,
                3189
            ],
            [
                3189,
                3253
            ],
            [
                3259,
                3267
            ],
            [
                3267,
                3286
            ],
            [
                3286,
                3288
            ],
            [
                3289,
                3350
            ],
            [
                3350,
                3380
            ],
            [
                3385,
                3445
            ],
            [
                3445,
                3471
            ],
            [
                3478,
                3483
            ],
            [
                3494,
                3509
            ],
            [
                3512,
                3603
            ],
            [
                3603,
                3662
            ],
            [
                3662,
                3664
            ],
            [
                3664,
                3701
            ],
            [
                3701,
                3716
            ],
            [
                3716,
                3739
            ],
            [
                3739,
                3741
            ],
            [
                3741,
                3787
            ],
            [
                3787,
                3878
            ],
            [
                3878,
                3939
            ],
            [
                3939,
                4057
            ],
            [
                4057,
                4075
            ],
            [
                4075,
                4093
            ],
            [
                4093,
                4162
            ],
            [
                4162,
                4178
            ],
            [
                4188,
                4198
            ],
            [
                4198,
                4204
            ],
            [
                4204,
                4291
            ],
            [
                4291,
                4356
            ],
            [
                4356,
                4378
            ],
            [
                4378,
                4384
            ],
            [
                4385,
                4388
            ],
            [
                4393,
                4400
            ],
            [
                4400,
                4436
            ],
            [
                4437,
                4446
            ],
            [
                4447,
                4464
            ],
            [
                4464,
                4466
            ],
            [
                4466,
                4492
            ],
            [
                4492,
                4499
            ],
            [
                4500,
                4518
            ],
            [
                4522,
                4529
            ],
            [
                4529,
                4531
            ],
            [
                4532,
                4584
            ],
            [
                4593,
                4617
            ],
            [
                4617,
                4687
            ],
            [
                4690,
                4728
            ],
            [
                4728,
                4751
            ],
            [
                4764,
                4783
            ],
            [
                4784,
                4808
            ],
            [
                4808,
                4872
            ],
            [
                4872,
                4963
            ],
            [
                4963,
                4965
            ],
            [
                4965,
                5021
            ],
            [
                5021,
                5023
            ],
            [
                5023,
                5047
            ],
            [
                5048,
                5114
            ],
            [
                5119,
                5168
            ],
            [
                5178,
                5183
            ],
            [
                5183,
                5236
            ],
            [
                5236,
                5290
            ],
            [
                5291,
                5338
            ],
            [
                5347,
                5357
            ],
            [
                5357,
                5359
            ],
            [
                5359,
                5405
            ],
            [
                5406,
                5435
            ],
            [
                5436,
                5442
            ],
            [
                5442,
                5443
            ],
            [
                5444,
                5454
            ],
            [
                5455,
                5491
            ],
            [
                5491,
                5541
            ],
            [
                5546,
                5561
            ],
            [
                5564,
                5566
            ],
            [
                5566,
                5689
            ],
            [
                5689,
                5719
            ],
            [
                5721,
                5741
            ],
            [
                5750,
                5753
            ],
            [
                5754,
                5767
            ],
            [
                5769,
                5878
            ],
            [
                5878,
                5909
            ],
            [
                5909,
                5914
            ],
            [
                5915,
                5980
            ],
            [
                5981,
                5988
            ],
            [
                5989,
                6001
            ],
            [
                6001,
                6039
            ],
            [
                6040,
                6050
            ],
            [
                6051,
                6073
            ],
            [
                6073,
                6093
            ],
            [
                6094,
                6106
            ],
            [
                6116,
                6123
            ],
            [
                6129,
                6144
            ],
            [
                6145,
                6147
            ],
            [
                6153,
                6155
            ],
            [
                6155,
                6266
            ],
            [
                6278,
                6279
            ],
            [
                6280,
                6296
            ],
            [
                6297,
                6316
            ],
            [
                6316,
                6318
            ],
            [
                6318,
                6469
            ],
            [
                6469,
                6507
            ],
            [
                6507,
                6517
            ],
            [
                6518,
                6521
            ],
            [
                6533,
                6615
            ],
            [
                6615,
                6695
            ],
            [
                6695,
                6805
            ],
            [
                6806,
                6869
            ],
            [
                6869,
                6871
            ],
            [
                6871,
                6877
            ],
            [
                6881,
                6888
            ],
            [
                6889,
                6977
            ],
            [
                6978,
                7101
            ],
            [
                7101,
                7143
            ],
            [
                7144,
                7233
            ],
            [
                7240,
                7241
            ],
            [
                7242,
                7310
            ],
            [
                7311,
                7353
            ],
            [
                7353,
                7369
            ],
            [
                7381,
                7423
            ],
            [
                7434,
                7436
            ],
            [
                7436,
                7508
            ],
            [
                7518,
                7546
            ],
            [
                7546,
                7590
            ],
            [
                7590,
                7663
            ],
            [
                7664,
                7669
            ],
            [
                7670,
                7673
            ],
            [
                7674,
                7695
            ],
            [
                7695,
                7713
            ],
            [
                7714,
                7830
            ],
            [
                7831,
                7837
            ],
            [
                7838,
                7843
            ],
            [
                7844,
                7848
            ],
            [
                7849,
                7861
            ],
            [
                7861,
                7863
            ],
            [
                7863,
                7892
            ],
            [
                7893,
                8051
            ],
            [
                8051,
                8104
            ],
            [
                8105,
                8113
            ],
            [
                8114,
                8188
            ],
            [
                8188,
                8239
            ],
            [
                8244,
                8308
            ],
            [
                8308,
                8456
            ],
            [
                8456,
                8504
            ],
            [
                8505,
                8548
            ],
            [
                8549,
                8557
            ],
            [
                8558,
                8560
            ],
            [
                8571,
                8578
            ],
            [
                8578,
                8630
            ],
            [
                8630,
                8675
            ],
            [
                8676,
                8679
            ],
            [
                8680,
                8691
            ],
            [
                8698,
                8701
            ],
            [
                8725,
                8734
            ],
            [
                8736,
                8743
            ],
            [
                8749,
                8787
            ],
            [
                8792,
                8799
            ],
            [
                8800,
                8823
            ],
            [
                8824,
                8827
            ],
            [
                8840,
                8893
            ],
            [
                8896,
                8939
            ],
            [
                8944,
                8957
            ],
            [
                8962,
                8971
            ],
            [
                8972,
                9002
            ],
            [
                9003,
                9019
            ],
            [
                9019,
                9085
            ],
            [
                9085,
                9106
            ],
            [
                9106,
                9108
            ],
            [
                9108,
                9131
            ],
            [
                9131,
                9159
            ],
            [
                9159,
                9278
            ],
            [
                9287,
                9289
            ],
            [
                9289,
                9302
            ],
            [
                9310,
                9315
            ],
            [
                9316,
                9321
            ],
            [
                9321,
                9323
            ],
            [
                9323,
                9359
            ],
            [
                9360,
                9393
            ],
            [
                9399,
                9440
            ],
            [
                9440,
                9442
            ],
            [
                9442,
                9537
            ],
            [
                9537,
                9543
            ],
            [
                9544,
                9552
            ],
            [
                9553,
                9572
            ],
            [
                9579,
                9581
            ],
            [
                9581,
                9631
            ],
            [
                9632,
                9651
            ],
            [
                9652,
                9659
            ],
            [
                9667,
                9683
            ],
            [
                9693,
                9732
            ],
            [
                9732,
                9779
            ],
            [
                9784,
                9797
            ],
            [
                9797,
                9802
            ],
            [
                9809,
                9811
            ],
            [
                9821,
                9843
            ],
            [
                9844,
                9861
            ],
            [
                9862,
                9897
            ],
            [
                9903,
                9910
            ],
            [
                9911,
                9913
            ],
            [
                9944,
                9946
            ],
            [
                9946,
                9960
            ],
            [
                9964,
                10064
            ],
            [
                10064,
                10077
            ],
            [
                10087,
                10097
            ],
            [
                10098,
                10141
            ],
            [
                10143,
                10153
            ],
            [
                10166,
                10178
            ],
            [
                10184,
                10229
            ],
            [
                10229,
                10359
            ],
            [
                10372,
                10387
            ],
            [
                10391,
                10421
            ],
            [
                10421,
                10453
            ],
            [
                10453,
                10506
            ],
            [
                10513,
                10518
            ],
            [
                10519,
                10543
            ],
            [
                10543,
                10545
            ],
            [
                10546,
                10616
            ],
            [
                10617,
                10621
            ],
            [
                10627,
                10629
            ],
            [
                10629,
                10706
            ],
            [
                10707,
                10735
            ],
            [
                10735,
                10874
            ]
        ],
        "row_chars": [
            [
                0,
                53
            ],
            [
                53,
                106
            ],
            [
                106,
                220
            ],
            [
                220,
                319
            ],
            [
                319,
                448
            ],
            [
                448,
                448
            ],
            [
                448,
                448
            ],
            [
                448,
                792
            ],
            [
                792,
                875
            ],
            [
                875,
                875
            ],
            [
                875,
                944
            ],
            [
                944,
                1042
            ],
            [
                1042,
                1103
            ],
            [
                1103,
                1169
            ],
            [
                1169,
                1193
            ],
            [
                1193,
                1240
            ],
            [
                1240,
                1331
            ],
            [
                1331,
                1430
            ],
            [
                1430,
                1593
            ],
            [
                1593,
                1705
            ],
            [
                1705,
                1756
            ],
            [
                1756,
                1802
            ],
            [
                1802,
                1889
            ],
            [
                1889,
                1957
            ],
            [
                1957,
                2117
            ],
            [
                2117,
                2275
            ],
            [
                2275,
                2369
            ],
            [
                2369,
                2479
            ],
            [
                2479,
                2690
            ],
            [
                2690,
                2765
            ],
            [
                2765,
                2815
            ],
            [
                2815,
                2917
            ],
            [
                2917,
                2996
            ],
            [
                2996,
                3189
            ],
            [
                3189,
                3189
            ],
            [
                3189,
                3189
            ],
            [
                3189,
                3189
            ],
            [
                3189,
                3189
            ],
            [
                3189,
                3189
            ],
            [
                3189,
                3286
            ],
            [
                3286,
                3350
            ],
            [
                3350,
                3350
            ],
            [
                3350,
                3445
            ],
            [
                3445,
                3603
            ],
            [
                3603,
                3664
            ],
            [
                3664,
                3701
            ],
            [
                3701,
                3716
            ],
            [
                3716,
                3741
            ],
            [
                3741,
                3741
            ],
            [
                3741,
                3741
            ],
            [
                3741,
                3787
            ],
            [
                3787,
                3878
            ],
            [
                3878,
                3939
            ],
            [
                3939,
                3939
            ],
            [
                3939,
                4057
            ],
            [
                4057,
                4075
            ],
            [
                4075,
                4093
            ],
            [
                4093,
                4162
            ],
            [
                4162,
                4198
            ],
            [
                4198,
                4204
            ],
            [
                4204,
                4356
            ],
            [
                4356,
                4378
            ],
            [
                4378,
                4400
            ],
            [
                4400,
                4466
            ],
            [
                4466,
                4492
            ],
            [
                4492,
                4531
            ],
            [
                4531,
                4531
            ],
            [
                4531,
                4531
            ],
            [
                4531,
                4531
            ],
            [
                4531,
                4531
            ],
            [
                4531,
                4617
            ],
            [
                4617,
                4617
            ],
            [
                4617,
                4728
            ],
            [
                4728,
                4808
            ],
            [
                4808,
                4808
            ],
            [
                4808,
                4872
            ],
            [
                4872,
                4965
            ],
            [
                4965,
                5023
            ],
            [
                5023,
                5183
            ],
            [
                5183,
                5359
            ],
            [
                5359,
                5491
            ],
            [
                5491,
                5566
            ],
            [
                5566,
                5566
            ],
            [
                5566,
                5689
            ],
            [
                5689,
                5878
            ],
            [
                5878,
                6073
            ],
            [
                6073,
                6155
            ],
            [
                6155,
                6280
            ],
            [
                6280,
                6318
            ],
            [
                6318,
                6469
            ],
            [
                6469,
                6615
            ],
            [
                6615,
                6695
            ],
            [
                6695,
                6871
            ],
            [
                6871,
                6978
            ],
            [
                6978,
                7101
            ],
            [
                7101,
                7242
            ],
            [
                7242,
                7353
            ],
            [
                7353,
                7353
            ],
            [
                7353,
                7436
            ],
            [
                7436,
                7436
            ],
            [
                7436,
                7546
            ],
            [
                7546,
                7546
            ],
            [
                7546,
                7590
            ],
            [
                7590,
                7590
            ],
            [
                7590,
                7695
            ],
            [
                7695,
                7695
            ],
            [
                7695,
                7695
            ],
            [
                7695,
                7863
            ],
            [
                7863,
                7893
            ],
            [
                7893,
                7893
            ],
            [
                7893,
                8051
            ],
            [
                8051,
                8188
            ],
            [
                8188,
                8188
            ],
            [
                8188,
                8240
            ],
            [
                8240,
                8240
            ],
            [
                8240,
                8308
            ],
            [
                8308,
                8456
            ],
            [
                8456,
                8456
            ],
            [
                8456,
                8578
            ],
            [
                8578,
                8630
            ],
            [
                8630,
                8824
            ],
            [
                8824,
                8824
            ],
            [
                8824,
                8824
            ],
            [
                8824,
                8824
            ],
            [
                8824,
                9019
            ],
            [
                9019,
                9108
            ],
            [
                9108,
                9159
            ],
            [
                9159,
                9289
            ],
            [
                9289,
                9289
            ],
            [
                9289,
                9323
            ],
            [
                9323,
                9442
            ],
            [
                9442,
                9537
            ],
            [
                9537,
                9581
            ],
            [
                9581,
                9732
            ],
            [
                9732,
                9862
            ],
            [
                9862,
                9946
            ],
            [
                9946,
                9946
            ],
            [
                9946,
                9946
            ],
            [
                9946,
                10064
            ],
            [
                10064,
                10064
            ],
            [
                10064,
                10229
            ],
            [
                10229,
                10229
            ],
            [
                10229,
                10421
            ],
            [
                10421,
                10453
            ],
            [
                10453,
                10543
            ],
            [
                10543,
                10629
            ],
            [
                10629,
                10735
            ],
            [
                10735,
                10874
            ]
        ]
    }
}