{
    "original": {
        "text": "When Alice heard of her cousin's success, and understood that he was actually Member of Parliament for the Chelsea Districts, she resolved that she would be triumphant. She had sacrificed nearly everything to her desire for his success in public life, and now that he had achieved the first great step towards that success, it would have been madness on her part to decline her share in the ovation. If she could not rejoice in that, what source of joy would then be left for her? She had promised to be his wife, and at present she was under the bonds of that promise. She had so promised because she had desired to identify her interests with his,--because she wished to share his risks, to assist his struggles, and to aid him in his public career. She had done all this, and he had been successful. She strove, therefore, to be triumphant on his behalf, but she knew that she was striving ineffectually. She had made a mistake, and the days were coming in which she would have to own to herself that she had done so in sackcloth, and to repent with ashes.\nBut yet she struggled to be triumphant. The tidings were first brought to her by her servant, and then she at once sat down to write him a word or two of congratulation. But she found the task more difficult than she had expected, and she gave it up. She had written no word to him since the day on which he had left her almost in anger, and now she did not know how she was to address him. \"I will wait till he comes,\" she said, putting away from her the paper and pens. \"It will be easier to speak than to write.\" But she wrote to Kate, and contrived to put some note of triumph into her letter. Kate had written to her at length, filling her sheet with a loud pan of sincere rejoicing. To Kate, down in Westmoreland, it had seemed that her brother had already done everything. He had already tied Fortune to his chariot wheels. He had made the great leap, and had overcome the only obstacle that Fate had placed in his way. In her great joy she almost forgot whence had come the money with which the contest had been won. She was not enthusiastic in many things;--about herself she was never so; but now she was elated with an enthusiasm which seemed to know no bounds. \"I am proud,\" she said, in her letter to Alice. \"No other thing that he could have done would have made me so proud of him. Had the Queen sent for him and made him an earl, it would have been as nothing to this. When I think that he has forced his way into Parliament without any great friend, with nothing to back him but his own wit\"--she had, in truth, forgotten Alice's money as she wrote;--\"that he has achieved his triumph in the metropolis, among the most wealthy and most fastidious of the richest city in the world, I do feel proud of my brother. And, Alice, I hope that you are proud of your lover.\" Poor girl! One cannot but like her pride, nay, almost love her for it, though it was so sorely misplaced. It must be remembered that she had known nothing of Messrs. Grimes and Scruby, and the River Bank, and that the means had been wanting to her of learning the principles upon which some metropolitan elections are conducted.\n\"And, Alice, I hope that you are proud of your lover!\" \"He is not my lover,\" Alice said to herself. \"He knows that he is not. He understands it, though she may not.\" And if not your lover, Alice Vavasor, what is he then to you? And what are you to him, if not his love? She was beginning to understand that she had put herself in the way of utter destruction;--that she had walked to the brink of a precipice, and that she must now topple over it. \"He is not my lover,\" she said; and then she sat silent and moody, and it took her hours to get her answer written to Kate.\nOn the same afternoon she saw her father for a moment or two. \"So George has got himself returned,\" he said, raising his eyebrows.\n\"Yes, he has been successful. I'm sure you must be glad, papa.\"\n\"Upon my word, I'm not. He has bought a seat for three months; and with whose money has he purchased it?\"\n\"Don't let us always speak of money, papa.\"\n\"When you discuss the value of a thing just purchased, you must mention the price before you know whether the purchaser has done well or badly. They have let him in for his money because there are only a few months left before the general election. Two thousand pounds he has had, I believe?\"\n\"And if as much more is wanted for the next election he shall have it.\"\n\"Very well, my dear;--very well, If you choose to make a beggar of yourself, I cannot help it. Indeed, I shall not complain though he should spend all your money, if you do not marry him at last.\" In answer to this, Alice said nothing. On that point her father's wishes were fast growing to be identical with her own.\n\"I tell you fairly what are my feelings and my wishes,\" he continued. \"Nothing, in my opinion, would be so deplorable and ruinous as such a marriage. You tell me that you have made up your mind to take him, and I know well that nothing that I can say will turn you. But I believe that when he has spent all your money he will not take you, and that thus you will be saved. Thinking as I do about him, you can hardly expect that I should triumph because he has got himself into Parliament with your money!\"\nThen he left her, and it seemed to Alice that he had been very cruel. There had been little, she thought, nay, nothing of a father's loving tenderness in his words to her. If he had spoken to her differently, might she not even now have confessed everything to him? But herein Alice accused him wrongfully. Tenderness from him on this subject had, we may say, become impossible. She had made it impossible. Nor could he tell her the extent of his wishes without damaging his own cause. He could not let her know that all that was done was so done with the view of driving her into John Grey's arms.\nBut what words were those for a father to speak to a daughter! Had she brought herself to such a state that her own father desired to see her deserted and thrown aside? And was it probable that this wish of his should come to pass? As to that, Alice had already made up her mind. She thought that she had made up her mind that she would never become her cousin's wife. It needed not her father's wish to accomplish her salvation, if her salvation lay in being separated from him.\nOn the next morning George went to her. The reader will, perhaps, remember their last interview. He had come to her after her letter to him from Westmoreland, and had asked her to seal their reconciliation with a kiss; but she had refused him. He had offered to embrace her, and she had shuddered before him, fearing his touch, telling him by signs much more clear than any words, that she felt for him none of the love of a woman. Then he had turned from her in anger, declaring to her honestly that he was angry. Since that he had borrowed her money,--had made two separate assaults upon her purse,--and was now come to tell her of the results. How was he to address her? I beg that it may be also remembered that he was not a man to forget the treatment he had received. When he entered the room, Alice looked at him, at first, almost furtively. She was afraid of him. It must be confessed that she already feared him. Had there been in the man anything of lofty principle he might still have made her his slave, though I doubt whether he could ever again have forced her to love him. She looked at him furtively, and perceived that the gash on his face was nearly closed. The mark of existing anger was not there. He had come to her intending to be gentle, if it might be possible. He had been careful in his dress, as though he wished to try once again if the rle of lover might be within his reach.\nAlice was the first to speak. \"George, I am so glad that you have succeeded! I wish you joy with my whole heart.\"\n\"Thanks, dearest. But before I say another word, let me acknowledge my debt. Unless you had aided me with your money, I could not have succeeded.\"\n\"Oh, George! pray don't speak of that!\"\n\"Let me rather speak of it at once, and have done. If you will think of it, you will know that I must speak of it sooner or later.\" He smiled and looked pleasant, as he used to do in those Swiss days.\n\"Well, then, speak and have done.\"\n\"I hope you have trusted me in thus giving me the command of your fortune?\"\n\"Oh, yes.\"\n\"I do believe that you have. I need hardly say that I could not have stood for this last election without it; and I must try to make you understand that if I had not come forward at this vacancy, I should have stood no chance for the next; otherwise, I should not have been justified in paying so dearly for a seat for one session. You can understand that; eh, Alice?\"\n\"Yes; I think so?\n\"Anybody, even your father, would tell you that; though, probably, he regards my ambition to be a Member of Parliament as a sign of downright madness. But I was obliged to stand now, if I intended to go on with it, as that old lord died so inopportunely. Well, about the money! It is quite upon the cards that I may be forced to ask for another loan when the autumn comes.\"\n\"You shall have it, George.\"\n\"Thanks, Alice. And now I will tell you what I propose. You know that I have been reconciled,--with a sort of reconciliation,--to my grandfather? Well, when the next affair is over, I propose to tell him exactly how you and I then stand.\"\n\"Do not go into that now, George. It is enough for you at present to be assured that such assistance as I can give you is at your command. I want you to feel the full joy of your success, and you will do so more thoroughly if you will banish all these money troubles from your mind for a while.\"\n\"They shall, at any rate, be banished while I am with you,\" said he. \"There; let them go!\" And he lifted up his right hand, and blew at the tips of his fingers. \"Let them vanish,\" said he. \"It is always well to be rid of such troubles for a time.\"\nIt is well to be rid of them at any time, or at all times, if only they can be banished without danger. But when a man has overused his liver till it will not act for him any longer, it is not well for him to resolve that he will forget the weakness of his organ just as he sits down to dinner.\nIt was a pretty bit of acting, that of Vavasor's, when he blew away his cares; and, upon the whole, I do not know that he could have done better. But Alice saw through it, and he knew that she did so. The whole thing was uncomfortable to him, except the fact that he had the promise of her further moneys. But he did not intend to rest satisfied with this. He must extract from her some meed of approbation, some show of sympathy, some spark of affection, true or pretended, in order that he might at least affect to be satisfied, and be enabled to speak of the future without open embarrassment. How could even he take her money from her, unless he might presume that he stood with her upon some ground that belonged mutually to them both?\n\"I have already taken my seat,\" said he.\n\"Yes; I saw that in the newspapers. My acquaintance among Members of Parliament is very small, but I see that you were introduced, as they call it, by one of the few men that I do know. Is Mr. Bott a friend of yours?\"\n\"No,--certainly not a friend. I may probably have to act with him in public.\"\n\"Ah, that's just what they said of Mr. Palliser when they felt ashamed of his having such a man as his guest. I think if I were in public life I should try to act with people that I could like.\"\n\"Then you dislike Mr. Bott?\"\n\"I do not like him, but my feelings about him are not violent.\"\n\"He is a vulgar ass,\" said George, \"with no more pretensions to rank himself a gentleman than your footman.\"\n\"If I had one.\"\n\"But he will get on in Parliament, to a certain extent.\"\n\"I'm afraid I don't quite understand what are the requisites for Parliamentary success, or indeed of what it consists. Is his ambition, do you suppose, the same as yours?\"\n\"His ambition, I take it, does not go beyond a desire to be Parliamentary flunkey to a big man,--with wages, if possible, but without, if the wages are impossible.\"\n\"And yours?\"\n\"Oh, as to mine;--there are some things, Alice, that a man does not tell to any one.\"\n\"Are there? They must be very terrible things.\"\n\"The schoolboy, when he sits down to make his rhymes, dares not say, even to his sister, that he hopes to rival Milton; but he nurses such a hope. The preacher, when he preaches his sermon, does not whisper, even to his wife, his belief that thousands may perhaps be turned to repentance by the strength of his words; but he thinks that the thousand converts are possible.\"\n\"And you, though you will not say so, intend to rival Chatham, and to make your thousand converts in politics.\"\n\"I like to hear you laugh at me,--I do, indeed. It does me good to hear your voice again with some touch of satire in it. It brings back the old days,--the days to which I hope we may soon revert without pain. Shall it not be so, dearest?\"\nHer playful manner at once deserted her. Why had he made this foolish attempt to be tender? \"I do not know,\" she said, gloomily.\nFor a few minutes he sat silent, fingering some article belonging to her which was lying on the table. It was a small steel paper-knife, of which the handle was cast and gilt; a thing of no great value, of which the price may have been five shillings. He sat with it, passing it through his fingers, while she went on with her work.\n\"Who gave you this paper-cutter?\" he said, suddenly.\n\"Goodness me, why do you ask? and especially, why do you ask in that way?\"\n\"I asked simply because if it is a present to you from any one, I will take up something else.\"\n\"It was given me by Mr. Grey.\"\nHe let it drop from his fingers on to the table with a noise, and then pushed it from him, so that it fell on the other side, near to where she sat.\n\"George,\" she said, as she stooped and picked it up, \"your violence is unreasonable; pray do not repeat it.\"\n\"I did not mean it,\" he said, \"and I beg your pardon. I was simply unfortunate in the article I selected. And who gave you this?\" In saying which he took up a little ivory foot-rule that was folded up so as to bring it within the compass of three inches.\n\"It so happens that no one gave me that; I bought it at a stupid bazaar.\"\n\"Then this will do. You shall give it me as a present, on the renewal of our love.\"\n\"It is too poor a thing to give,\" said she, speaking still more gloomily than she had done before.\n\"By no means; nothing is too poor, if given in that way. Anything will do; a ribbon, a glove, a broken sixpence. Will you give me something that I may take, and, taking it, may know that your heart is given with it?\"\n\"Take the rule, if you please,\" she said.\n\"And about the heart?\" he asked.\nHe should have been more of a rascal or less. Seeing how very much of a rascal he was already, I think it would have been better that he should have been more,--that he should have been able to content his spirit with the simple acquisition of her money, and that he should have been free from all those remains of a finer feeling which made him desire her love also. But it was not so. It was necessary for his comfort that she should, at any rate, say she loved him. \"Well, Alice, and what about the heart?\" he asked again.\n\"I would so much rather talk about politics, George,\" said she.\nThe cicatrice began to make itself very visible in his face, and the debonair manner was fast vanishing. He had fixed his eyes upon her, and had inserted his thumbs in the armholes of his waistcoat.\n\"Alice, that is not quite fair,\" he said.\n\"I do not mean to be unfair.\"\n\"I am not so sure of that. I almost think that you do mean it. You have told me that you intend to become my wife. If, after that, you wilfully make me miserable, will not that be unfair?\"\n\"I am not making you miserable,--certainly not wilfully.\"\n\"Did that letter which you wrote to me from Westmoreland mean anything?\"\n\"George, do not strive to make me think that it meant too much.\"\n\"If it did, you had better say so at once.\"\nBut Alice, though she would have said so had she dared, made no answer to this. She sat silent, turning her face away from his gaze, longing that the meeting might be over, and feeling that she had lost her own self-respect.\n\"Look here, Alice,\" he said, \"I find it very hard to understand you. When I look back over all that has passed between us, and to that other episode in your life, summing it all up with your conduct to me at present, I find myself at a loss to read your character.\"\n\"I fear I cannot help you in the reading of it.\"\n\"When you first loved me;--for you did love me. I understood that well enough. There is no young man who in early life does not read with sufficient clearness that sweetest morsel of poetry.--And when you quarrelled with me, judging somewhat harshly of my offences, I understood that also; for it is the custom of women to be hard in their judgement on such sins. When I heard that you had accepted the offer made to you by that gentleman in Cambridgeshire, I thought that I understood you still,--knowing how natural it was that you should seek some cure for your wound. I understood it, and accused myself, not you, in that I had driven you to so fatal a remedy.\" Here Alice turned round towards him sharply, as though she were going to interrupt him, but she said nothing, though he paused for her to speak; and then he went on. \"And I understood it well when I heard that this cure had been too much for you. By heavens, yes! there was no misunderstanding that. I meant no insult to the man when I upset his little toy just now. I have not a word to say against him. For many women he would make a model husband, but you are not one of them. And when you discovered this yourself, as you did, I understood that without difficulty. Yes, by heavens! if ever woman had been driven to a mistake, you had been driven to one there.\" Here she looked at him again, and met his eyes. She looked at him with something of his own fierceness in her face, as though she were preparing herself to fight with him; but she said nothing at the moment, and then he again went on. \"And, Alice, I understood it also when you again consented to be my wife. I thought that I still understood you then. I may have been vain to think so, but surely it was natural. I believed that the old love had come back upon you, and again warmed your heart. I thought that it had been cold during our separation, and I was pleased to think so. Was that unnatural? Put yourself in my place, and say if you would not have thought so. I told myself that I understood you then, and I told myself that in all that you had done you had acted as a true, and good, and loving woman. I thought of you much, and I saw that your conduct, as a whole, was intelligible and becoming.\" The last word grated on Alice's ears, and she showed her anger by the motion of her foot upon the floor. Her cousin noted it all, but went on as though he had not noted it. \"But now your present behaviour makes all the rest a riddle. You have said that you would be my wife, declaring thereby that you had forgiven my offences, and, as I suppose, reassuring me of your love; and yet you receive me with all imaginable coldness. What am I to think of it, and in what way would you have me behave to you? When last I was here I asked you for a kiss.\" As he said this he looked at her with all his eyes, with his mouth just open, so as to show the edges of his white teeth, with the wound down his face all wide and purple. The last word came with a stigmatizing hiss from his lips. Though she did not essay to speak, he paused again, as if he were desirous that she might realize the full purport of such a request. I think that, in the energy of his speaking, a touch of true passion had come upon him; that he had forgotten his rascaldom, and his need of her money, and that he was punishing her with his whole power of his vengeance for the treatment which he had received from her. \"I asked you for a kiss. If you are to be my wife you can have no shame in granting me such a request. Within the last two months you have told me that you would marry me. What am I to think of such a promise if you deny me all customary signs of your affection?\" Then he paused again, and she found that the time had come in which she must say something to him.\n[Illustration: \"I asked you for a kiss.\"]\n\"I wonder you cannot understand,\" she said, \"that I have suffered much.\"\n\"And is that to be my answer?\"\n\"I don't know what answer you want.\"\n\"Come, Alice, do not be untrue; you do know what answer I want, and you know also whether my wanting it is unreasonable.\"\n\"No one ever told me that I was untrue before,\" she said.\n\"You do know what it is that I desire. I desire to learn that the woman who is to be my wife, in truth, loves me.\"\nShe was standing up, and so was he also, but still she said nothing. He had in his hand the little rule which she had told him that he might take, but he held it as though in doubt what he would do with it. \"Well, Alice, am I to hear anything from you?\"\n\"Not now, George; you are angry, and I will not speak to you in your anger.\"\n\"Have I not cause to be angry? Do you not know that you are treating me badly?\"\n\"I know that my head aches, and that I am very wretched. I wish you would leave me.\"\n\"There, then, is your gift,\" said he, and he threw the rule over on to the sofa behind her. \"And there is the trumpery trinket which I had hoped you would have worn for my sake.\" Whereupon something which he had taken from his waistcoat-pocket was thrown violently into the fender, beneath the fire-grate. He then walked with quick steps to the door; but when his hand was on the handle, he turned. \"Alice,\" he said, \"when I am gone, try to think honestly of your conduct to me.\" Then he went, and she remained still, till she heard the front door close behind him.\nWhen she was sure that he was gone, her first movement was made in search of the trinket. I fear that this was not dignified on her part; but I think that it was natural. It was not that she had any desire for the jewel, or any curiosity even to see it. She would very much have preferred that he should have brought nothing of the kind to her. But she had a feminine reluctance that anything of value should be destroyed without a purpose. So she took the shovel, and poked among the ashes, and found the ring which her cousin had thrown there. It was a valuable ring, bearing a ruby on it between two small diamonds. Such at least, she became aware, had been its bearing; but one of the side stones had been knocked out by the violence with which the ring had been flung. She searched even for this, scorching her face and eyes, but in vain. Then she made up her mind that the diamond should be lost for ever, and that it should go out among the cinders into the huge dust-heaps of the metropolis. Better that, though it was distasteful to her feminine economy, than the other alternative of setting the servants to search, and thereby telling them something of what had been done.\nWhen her search was over, she placed the ring on the mantelpiece; but she knew that it would not do to leave it there,--so she folded it up carefully in a new sheet of note-paper, and put it in the drawer of her desk. After that she sat herself down at the table to think what she would do; but her head was, in truth, racked with pain, and on that occasion she could bring her thoughts to no conclusion.",
        "paragraph_chars": [
            [
                0,
                1060
            ],
            [
                1060,
                3172
            ],
            [
                3172,
                3744
            ],
            [
                3744,
                3875
            ],
            [
                3875,
                3939
            ],
            [
                3939,
                4045
            ],
            [
                4045,
                4089
            ],
            [
                4089,
                4382
            ],
            [
                4382,
                4454
            ],
            [
                4454,
                4772
            ],
            [
                4772,
                5278
            ],
            [
                5278,
                5877
            ],
            [
                5877,
                6357
            ],
            [
                6357,
                7762
            ],
            [
                7762,
                7876
            ],
            [
                7876,
                8023
            ],
            [
                8023,
                8063
            ],
            [
                8063,
                8264
            ],
            [
                8264,
                8299
            ],
            [
                8299,
                8375
            ],
            [
                8375,
                8386
            ],
            [
                8386,
                8755
            ],
            [
                8755,
                8773
            ],
            [
                8773,
                9147
            ],
            [
                9147,
                9176
            ],
            [
                9176,
                9415
            ],
            [
                9415,
                9711
            ],
            [
                9711,
                9959
            ],
            [
                9959,
                10254
            ],
            [
                10254,
                10995
            ],
            [
                10995,
                11036
            ],
            [
                11036,
                11254
            ],
            [
                11254,
                11332
            ],
            [
                11332,
                11527
            ],
            [
                11527,
                11556
            ],
            [
                11556,
                11620
            ],
            [
                11620,
                11729
            ],
            [
                11729,
                11745
            ],
            [
                11745,
                11802
            ],
            [
                11802,
                11974
            ],
            [
                11974,
                12139
            ],
            [
                12139,
                12152
            ],
            [
                12152,
                12238
            ],
            [
                12238,
                12286
            ],
            [
                12286,
                12660
            ],
            [
                12660,
                12772
            ],
            [
                12772,
                13012
            ],
            [
                13012,
                13141
            ],
            [
                13141,
                13474
            ],
            [
                13474,
                13527
            ],
            [
                13527,
                13602
            ],
            [
                13602,
                13698
            ],
            [
                13698,
                13729
            ],
            [
                13729,
                13878
            ],
            [
                13878,
                13987
            ],
            [
                13987,
                14242
            ],
            [
                14242,
                14316
            ],
            [
                14316,
                14400
            ],
            [
                14400,
                14499
            ],
            [
                14499,
                14716
            ],
            [
                14716,
                14758
            ],
            [
                14758,
                14791
            ],
            [
                14791,
                15317
            ],
            [
                15317,
                15381
            ],
            [
                15381,
                15580
            ],
            [
                15580,
                15622
            ],
            [
                15622,
                15652
            ],
            [
                15652,
                15841
            ],
            [
                15841,
                15899
            ],
            [
                15899,
                15972
            ],
            [
                15972,
                16037
            ],
            [
                16037,
                16081
            ],
            [
                16081,
                16306
            ],
            [
                16306,
                16572
            ],
            [
                16572,
                16621
            ],
            [
                16621,
                20408
            ],
            [
                20408,
                20450
            ],
            [
                20450,
                20523
            ],
            [
                20523,
                20554
            ],
            [
                20554,
                20591
            ],
            [
                20591,
                20713
            ],
            [
                20713,
                20771
            ],
            [
                20771,
                20886
            ],
            [
                20886,
                21140
            ],
            [
                21140,
                21217
            ],
            [
                21217,
                21297
            ],
            [
                21297,
                21382
            ],
            [
                21382,
                21948
            ],
            [
                21948,
                23132
            ],
            [
                23132,
                23536
            ]
        ],
        "segment_chars": [
            [
                0,
                169
            ],
            [
                169,
                400
            ],
            [
                400,
                481
            ],
            [
                481,
                570
            ],
            [
                570,
                752
            ],
            [
                752,
                803
            ],
            [
                803,
                908
            ],
            [
                908,
                1060
            ],
            [
                1060,
                1100
            ],
            [
                1100,
                1230
            ],
            [
                1230,
                1311
            ],
            [
                1311,
                1451
            ],
            [
                1451,
                1532
            ],
            [
                1532,
                1576
            ],
            [
                1576,
                1658
            ],
            [
                1658,
                1749
            ],
            [
                1749,
                1840
            ],
            [
                1840,
                1891
            ],
            [
                1891,
                1987
            ],
            [
                1987,
                2085
            ],
            [
                2085,
                2233
            ],
            [
                2233,
                2281
            ],
            [
                2281,
                2357
            ],
            [
                2357,
                2445
            ],
            [
                2445,
                2789
            ],
            [
                2789,
                2843
            ],
            [
                2843,
                2854
            ],
            [
                2854,
                2949
            ],
            [
                2949,
                3172
            ],
            [
                3172,
                3227
            ],
            [
                3227,
                3272
            ],
            [
                3272,
                3298
            ],
            [
                3298,
                3338
            ],
            [
                3338,
                3400
            ],
            [
                3400,
                3442
            ],
            [
                3442,
                3620
            ],
            [
                3620,
                3744
            ],
            [
                3744,
                3806
            ],
            [
                3806,
                3875
            ],
            [
                3875,
                3905
            ],
            [
                3905,
                3939
            ],
            [
                3939,
                3963
            ],
            [
                3963,
                4045
            ],
            [
                4045,
                4089
            ],
            [
                4089,
                4233
            ],
            [
                4233,
                4338
            ],
            [
                4338,
                4382
            ],
            [
                4382,
                4454
            ],
            [
                4454,
                4549
            ],
            [
                4549,
                4651
            ],
            [
                4651,
                4690
            ],
            [
                4690,
                4772
            ],
            [
                4772,
                4842
            ],
            [
                4842,
                4922
            ],
            [
                4922,
                5038
            ],
            [
                5038,
                5145
            ],
            [
                5145,
                5278
            ],
            [
                5278,
                5348
            ],
            [
                5348,
                5450
            ],
            [
                5450,
                5544
            ],
            [
                5544,
                5585
            ],
            [
                5585,
                5657
            ],
            [
                5657,
                5685
            ],
            [
                5685,
                5764
            ],
            [
                5764,
                5877
            ],
            [
                5877,
                5940
            ],
            [
                5940,
                6046
            ],
            [
                6046,
                6109
            ],
            [
                6109,
                6157
            ],
            [
                6157,
                6246
            ],
            [
                6246,
                6357
            ],
            [
                6357,
                6397
            ],
            [
                6397,
                6454
            ],
            [
                6454,
                6601
            ],
            [
                6601,
                6789
            ],
            [
                6789,
                6872
            ],
            [
                6872,
                7004
            ],
            [
                7004,
                7031
            ],
            [
                7031,
                7131
            ],
            [
                7131,
                7206
            ],
            [
                7206,
                7229
            ],
            [
                7229,
                7279
            ],
            [
                7279,
                7445
            ],
            [
                7445,
                7533
            ],
            [
                7533,
                7575
            ],
            [
                7575,
                7643
            ],
            [
                7643,
                7762
            ],
            [
                7762,
                7792
            ],
            [
                7792,
                7839
            ],
            [
                7839,
                7876
            ],
            [
                7876,
                7894
            ],
            [
                7894,
                7953
            ],
            [
                7953,
                8023
            ],
            [
                8023,
                8036
            ],
            [
                8036,
                8063
            ],
            [
                8063,
                8114
            ],
            [
                8114,
                8195
            ],
            [
                8195,
                8264
            ],
            [
                8264,
                8299
            ],
            [
                8299,
                8375
            ],
            [
                8375,
                8386
            ],
            [
                8386,
                8415
            ],
            [
                8415,
                8718
            ],
            [
                8718,
                8755
            ],
            [
                8755,
                8773
            ],
            [
                8773,
                8924
            ],
            [
                8924,
                9028
            ],
            [
                9028,
                9051
            ],
            [
                9051,
                9147
            ],
            [
                9147,
                9176
            ],
            [
                9176,
                9192
            ],
            [
                9192,
                9232
            ],
            [
                9232,
                9322
            ],
            [
                9322,
                9415
            ],
            [
                9415,
                9449
            ],
            [
                9449,
                9554
            ],
            [
                9554,
                9711
            ],
            [
                9711,
                9780
            ],
            [
                9780,
                9802
            ],
            [
                9802,
                9872
            ],
            [
                9872,
                9900
            ],
            [
                9900,
                9959
            ],
            [
                9959,
                10063
            ],
            [
                10063,
                10254
            ],
            [
                10254,
                10400
            ],
            [
                10400,
                10455
            ],
            [
                10455,
                10560
            ],
            [
                10560,
                10611
            ],
            [
                10611,
                10851
            ],
            [
                10851,
                10995
            ],
            [
                10995,
                11036
            ],
            [
                11036,
                11072
            ],
            [
                11072,
                11222
            ],
            [
                11222,
                11254
            ],
            [
                11254,
                11284
            ],
            [
                11284,
                11332
            ],
            [
                11332,
                11442
            ],
            [
                11442,
                11527
            ],
            [
                11527,
                11556
            ],
            [
                11556,
                11620
            ],
            [
                11620,
                11729
            ],
            [
                11729,
                11745
            ],
            [
                11745,
                11802
            ],
            [
                11802,
                11921
            ],
            [
                11921,
                11974
            ],
            [
                11974,
                12139
            ],
            [
                12139,
                12152
            ],
            [
                12152,
                12238
            ],
            [
                12238,
                12250
            ],
            [
                12250,
                12286
            ],
            [
                12286,
                12433
            ],
            [
                12433,
                12660
            ],
            [
                12660,
                12772
            ],
            [
                12772,
                12820
            ],
            [
                12820,
                12894
            ],
            [
                12894,
                12982
            ],
            [
                12982,
                13012
            ],
            [
                13012,
                13053
            ],
            [
                13053,
                13104
            ],
            [
                13104,
                13141
            ],
            [
                13141,
                13244
            ],
            [
                13244,
                13393
            ],
            [
                13393,
                13474
            ],
            [
                13474,
                13508
            ],
            [
                13508,
                13527
            ],
            [
                13527,
                13557
            ],
            [
                13557,
                13602
            ],
            [
                13602,
                13698
            ],
            [
                13698,
                13729
            ],
            [
                13729,
                13878
            ],
            [
                13878,
                13987
            ],
            [
                13987,
                14041
            ],
            [
                14041,
                14093
            ],
            [
                14093,
                14117
            ],
            [
                14117,
                14242
            ],
            [
                14242,
                14316
            ],
            [
                14316,
                14336
            ],
            [
                14336,
                14400
            ],
            [
                14400,
                14499
            ],
            [
                14499,
                14556
            ],
            [
                14556,
                14612
            ],
            [
                14612,
                14716
            ],
            [
                14716,
                14758
            ],
            [
                14758,
                14781
            ],
            [
                14781,
                14791
            ],
            [
                14791,
                14837
            ],
            [
                14837,
                15159
            ],
            [
                15159,
                15178
            ],
            [
                15178,
                15260
            ],
            [
                15260,
                15301
            ],
            [
                15301,
                15317
            ],
            [
                15317,
                15381
            ],
            [
                15381,
                15486
            ],
            [
                15486,
                15580
            ],
            [
                15580,
                15622
            ],
            [
                15622,
                15652
            ],
            [
                15652,
                15679
            ],
            [
                15679,
                15715
            ],
            [
                15715,
                15767
            ],
            [
                15767,
                15841
            ],
            [
                15841,
                15899
            ],
            [
                15899,
                15972
            ],
            [
                15972,
                16037
            ],
            [
                16037,
                16081
            ],
            [
                16081,
                16161
            ],
            [
                16161,
                16306
            ],
            [
                16306,
                16375
            ],
            [
                16375,
                16572
            ],
            [
                16572,
                16621
            ],
            [
                16621,
                16669
            ],
            [
                16669,
                16700
            ],
            [
                16700,
                16985
            ],
            [
                16985,
                17193
            ],
            [
                17193,
                17287
            ],
            [
                17287,
                17453
            ],
            [
                17453,
                17534
            ],
            [
                17534,
                17551
            ],
            [
                17551,
                17587
            ],
            [
                17587,
                17654
            ],
            [
                17654,
                17692
            ],
            [
                17692,
                17767
            ],
            [
                17767,
                17856
            ],
            [
                17856,
                17873
            ],
            [
                17873,
                17952
            ],
            [
                17952,
                18000
            ],
            [
                18000,
                18187
            ],
            [
                18187,
                18261
            ],
            [
                18261,
                18305
            ],
            [
                18305,
                18366
            ],
            [
                18366,
                18448
            ],
            [
                18448,
                18534
            ],
            [
                18534,
                18554
            ],
            [
                18554,
                18622
            ],
            [
                18622,
                18765
            ],
            [
                18765,
                18861
            ],
            [
                18861,
                18966
            ],
            [
                18966,
                19034
            ],
            [
                19034,
                19095
            ],
            [
                19095,
                19289
            ],
            [
                19289,
                19364
            ],
            [
                19364,
                19410
            ],
            [
                19410,
                19582
            ],
            [
                19582,
                19641
            ],
            [
                19641,
                19775
            ],
            [
                19775,
                20045
            ],
            [
                20045,
                20070
            ],
            [
                20070,
                20148
            ],
            [
                20148,
                20217
            ],
            [
                20217,
                20309
            ],
            [
                20309,
                20408
            ],
            [
                20408,
                20450
            ],
            [
                20450,
                20523
            ],
            [
                20523,
                20554
            ],
            [
                20554,
                20591
            ],
            [
                20591,
                20713
            ],
            [
                20713,
                20771
            ],
            [
                20771,
                20810
            ],
            [
                20810,
                20886
            ],
            [
                20886,
                20955
            ],
            [
                20955,
                21093
            ],
            [
                21093,
                21140
            ],
            [
                21140,
                21217
            ],
            [
                21217,
                21248
            ],
            [
                21248,
                21297
            ],
            [
                21297,
                21354
            ],
            [
                21354,
                21382
            ],
            [
                21382,
                21474
            ],
            [
                21474,
                21561
            ],
            [
                21561,
                21688
            ],
            [
                21688,
                21781
            ],
            [
                21781,
                21862
            ],
            [
                21862,
                21948
            ],
            [
                21948,
                22038
            ],
            [
                22038,
                22119
            ],
            [
                22119,
                22202
            ],
            [
                22202,
                22293
            ],
            [
                22293,
                22389
            ],
            [
                22389,
                22494
            ],
            [
                22494,
                22567
            ],
            [
                22567,
                22722
            ],
            [
                22722,
                22792
            ],
            [
                22792,
                22948
            ],
            [
                22948,
                23132
            ],
            [
                23132,
                23350
            ],
            [
                23350,
                23536
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                126,
                169
            ],
            [
                169,
                208
            ],
            [
                250,
                259
            ],
            [
                265,
                301
            ],
            [
                398,
                400
            ],
            [
                400,
                458
            ],
            [
                464,
                481
            ],
            [
                570,
                577
            ],
            [
                581,
                589
            ],
            [
                614,
                616
            ],
            [
                645,
                648
            ],
            [
                651,
                669
            ],
            [
                690,
                752
            ],
            [
                803,
                842
            ],
            [
                856,
                895
            ],
            [
                906,
                908
            ],
            [
                908,
                980
            ],
            [
                988,
                998
            ],
            [
                1032,
                1047
            ],
            [
                1058,
                1060
            ],
            [
                1100,
                1103
            ],
            [
                1117,
                1137
            ],
            [
                1152,
                1153
            ],
            [
                1163,
                1166
            ],
            [
                1175,
                1183
            ],
            [
                1167,
                1174
            ],
            [
                1184,
                1203
            ],
            [
                1211,
                1230
            ],
            [
                1230,
                1294
            ],
            [
                1299,
                1311
            ],
            [
                1406,
                1426
            ],
            [
                1435,
                1450
            ],
            [
                1451,
                1488
            ],
            [
                1530,
                1532
            ],
            [
                1532,
                1576
            ],
            [
                1576,
                1602
            ],
            [
                1613,
                1658
            ],
            [
                1658,
                1692
            ],
            [
                1711,
                1715
            ],
            [
                1730,
                1749
            ],
            [
                1749,
                1756
            ],
            [
                1763,
                1770
            ],
            [
                1774,
                1782
            ],
            [
                1787,
                1840
            ],
            [
                1891,
                1985
            ],
            [
                1985,
                1987
            ],
            [
                1987,
                2003
            ],
            [
                2004,
                2021
            ],
            [
                2038,
                2047
            ],
            [
                2029,
                2037
            ],
            [
                2083,
                2084
            ],
            [
                2233,
                2250
            ],
            [
                2279,
                2281
            ],
            [
                2281,
                2296
            ],
            [
                2321,
                2357
            ],
            [
                2361,
                2370
            ],
            [
                2357,
                2360
            ],
            [
                2388,
                2435
            ],
            [
                2436,
                2445
            ],
            [
                2445,
                2567
            ],
            [
                2570,
                2625
            ],
            [
                2567,
                2568
            ],
            [
                2758,
                2789
            ],
            [
                2789,
                2843
            ],
            [
                2843,
                2854
            ],
            [
                2976,
                2979
            ],
            [
                2990,
                3051
            ],
            [
                3147,
                3172
            ],
            [
                3227,
                3272
            ],
            [
                3298,
                3312
            ],
            [
                3315,
                3338
            ],
            [
                3338,
                3400
            ],
            [
                3400,
                3423
            ],
            [
                3440,
                3442
            ],
            [
                3442,
                3531
            ],
            [
                3533,
                3620
            ],
            [
                3661,
                3744
            ],
            [
                3744,
                3805
            ],
            [
                3806,
                3851
            ],
            [
                3873,
                3875
            ],
            [
                3875,
                3905
            ],
            [
                3905,
                3939
            ],
            [
                3939,
                3963
            ],
            [
                3963,
                4016
            ],
            [
                4042,
                4045
            ],
            [
                4045,
                4086
            ],
            [
                4387,
                4397
            ],
            [
                4403,
                4454
            ],
            [
                4454,
                4473
            ],
            [
                4487,
                4549
            ],
            [
                4549,
                4577
            ],
            [
                4601,
                4650
            ],
            [
                4670,
                4690
            ],
            [
                4690,
                4772
            ],
            [
                4772,
                4783
            ],
            [
                4791,
                4795
            ],
            [
                4825,
                4842
            ],
            [
                4842,
                4922
            ],
            [
                4922,
                4989
            ],
            [
                4995,
                5038
            ],
            [
                5038,
                5110
            ],
            [
                5143,
                5145
            ],
            [
                5173,
                5278
            ],
            [
                5283,
                5290
            ],
            [
                5294,
                5295
            ],
            [
                5300,
                5348
            ],
            [
                5348,
                5362
            ],
            [
                5389,
                5441
            ],
            [
                5555,
                5560
            ],
            [
                5661,
                5669
            ],
            [
                5585,
                5595
            ],
            [
                5605,
                5620
            ],
            [
                5645,
                5656
            ],
            [
                6357,
                6397
            ],
            [
                6397,
                6452
            ],
            [
                6514,
                6515
            ],
            [
                6454,
                6460
            ],
            [
                6524,
                6529
            ],
            [
                6568,
                6601
            ],
            [
                6636,
                6653
            ],
            [
                6630,
                6631
            ],
            [
                6661,
                6664
            ],
            [
                6711,
                6715
            ],
            [
                6722,
                6736
            ],
            [
                6738,
                6751
            ],
            [
                6760,
                6787
            ],
            [
                6752,
                6759
            ],
            [
                6787,
                6789
            ],
            [
                6794,
                6825
            ],
            [
                6959,
                6962
            ],
            [
                6872,
                6877
            ],
            [
                6789,
                6793
            ],
            [
                6825,
                6826
            ],
            [
                6883,
                6908
            ],
            [
                7002,
                7004
            ],
            [
                7004,
                7007
            ],
            [
                7012,
                7014
            ],
            [
                7018,
                7031
            ],
            [
                7073,
                7130
            ],
            [
                7131,
                7176
            ],
            [
                7188,
                7206
            ],
            [
                7206,
                7229
            ],
            [
                7445,
                7448
            ],
            [
                7478,
                7531
            ],
            [
                7533,
                7544
            ],
            [
                7554,
                7575
            ],
            [
                7575,
                7620
            ],
            [
                7633,
                7642
            ],
            [
                7792,
                7837
            ],
            [
                7839,
                7876
            ],
            [
                7876,
                7894
            ],
            [
                7894,
                7953
            ],
            [
                7953,
                8023
            ],
            [
                8023,
                8036
            ],
            [
                8036,
                8063
            ],
            [
                8063,
                8114
            ],
            [
                8117,
                8120
            ],
            [
                8148,
                8195
            ],
            [
                8195,
                8263
            ],
            [
                8299,
                8329
            ],
            [
                8335,
                8375
            ],
            [
                8375,
                8386
            ],
            [
                8386,
                8415
            ],
            [
                8438,
                8499
            ],
            [
                8539,
                8624
            ],
            [
                8716,
                8718
            ],
            [
                8718,
                8755
            ],
            [
                8755,
                8759
            ],
            [
                8773,
                8774
            ],
            [
                8783,
                8799
            ],
            [
                8801,
                8828
            ],
            [
                8840,
                8842
            ],
            [
                8830,
                8838
            ],
            [
                8843,
                8924
            ],
            [
                8924,
                8927
            ],
            [
                9034,
                9051
            ],
            [
                9051,
                9062
            ],
            [
                9078,
                9147
            ],
            [
                9147,
                9176
            ],
            [
                9176,
                9192
            ],
            [
                9192,
                9232
            ],
            [
                9232,
                9268
            ],
            [
                9276,
                9277
            ],
            [
                9271,
                9275
            ],
            [
                9306,
                9322
            ],
            [
                9322,
                9341
            ],
            [
                9349,
                9359
            ],
            [
                9368,
                9401
            ],
            [
                9407,
                9415
            ],
            [
                9415,
                9449
            ],
            [
                9484,
                9499
            ],
            [
                9466,
                9469
            ],
            [
                9519,
                9524
            ],
            [
                9552,
                9554
            ],
            [
                9554,
                9656
            ],
            [
                9667,
                9711
            ],
            [
                9711,
                9780
            ],
            [
                9780,
                9802
            ],
            [
                9802,
                9872
            ],
            [
                9872,
                9899
            ],
            [
                10254,
                10283
            ],
            [
                10331,
                10400
            ],
            [
                10400,
                10455
            ],
            [
                10455,
                10551
            ],
            [
                10558,
                10559
            ],
            [
                10560,
                10566
            ],
            [
                10571,
                10574
            ],
            [
                10590,
                10611
            ],
            [
                10611,
                10640
            ],
            [
                10667,
                10683
            ],
            [
                10683,
                10728
            ],
            [
                10738,
                10751
            ],
            [
                10803,
                10850
            ],
            [
                10995,
                11036
            ],
            [
                11036,
                11072
            ],
            [
                11072,
                11165
            ],
            [
                11184,
                11222
            ],
            [
                11222,
                11254
            ],
            [
                11254,
                11258
            ],
            [
                11270,
                11273
            ],
            [
                11282,
                11284
            ],
            [
                11284,
                11289
            ],
            [
                11299,
                11332
            ],
            [
                11332,
                11363
            ],
            [
                11367,
                11416
            ],
            [
                11428,
                11442
            ],
            [
                11442,
                11527
            ],
            [
                11527,
                11556
            ],
            [
                11556,
                11574
            ],
            [
                11617,
                11620
            ],
            [
                11620,
                11713
            ],
            [
                11719,
                11726
            ],
            [
                11746,
                11802
            ],
            [
                11802,
                11843
            ],
            [
                11867,
                11888
            ],
            [
                11919,
                11921
            ],
            [
                11921,
                11974
            ],
            [
                11974,
                11990
            ],
            [
                11998,
                12068
            ],
            [
                12071,
                12094
            ],
            [
                12136,
                12139
            ],
            [
                12139,
                12152
            ],
            [
                12152,
                12153
            ],
            [
                12170,
                12227
            ],
            [
                12235,
                12238
            ],
            [
                12238,
                12250
            ],
            [
                12250,
                12286
            ],
            [
                12286,
                12433
            ],
            [
                12433,
                12541
            ],
            [
                12550,
                12576
            ],
            [
                12593,
                12622
            ],
            [
                12649,
                12660
            ],
            [
                12660,
                12668
            ],
            [
                12698,
                12704
            ],
            [
                12727,
                12772
            ],
            [
                12772,
                12803
            ],
            [
                12818,
                12820
            ],
            [
                12820,
                12894
            ],
            [
                12894,
                12921
            ],
            [
                12924,
                12982
            ],
            [
                12982,
                13012
            ],
            [
                13012,
                13053
            ],
            [
                13104,
                13141
            ],
            [
                13141,
                13183
            ],
            [
                13251,
                13280
            ],
            [
                13328,
                13343
            ],
            [
                13214,
                13243
            ],
            [
                13393,
                13467
            ],
            [
                13468,
                13474
            ],
            [
                13474,
                13508
            ],
            [
                13508,
                13527
            ],
            [
                13527,
                13539
            ],
            [
                13571,
                13602
            ],
            [
                13602,
                13698
            ],
            [
                13698,
                13729
            ],
            [
                13729,
                13809
            ],
            [
                13818,
                13835
            ],
            [
                13839,
                13853
            ],
            [
                13876,
                13878
            ],
            [
                13878,
                13961
            ],
            [
                13984,
                13987
            ],
            [
                13987,
                13988
            ],
            [
                14022,
                14041
            ],
            [
                14041,
                14093
            ],
            [
                14097,
                14117
            ],
            [
                14133,
                14135
            ],
            [
                14141,
                14152
            ],
            [
                14153,
                14158
            ],
            [
                14240,
                14242
            ],
            [
                14242,
                14243
            ],
            [
                14262,
                14316
            ],
            [
                14316,
                14336
            ],
            [
                14336,
                14400
            ],
            [
                14400,
                14443
            ],
            [
                14459,
                14477
            ],
            [
                14491,
                14499
            ],
            [
                14499,
                14532
            ],
            [
                14554,
                14556
            ],
            [
                14556,
                14612
            ],
            [
                14612,
                14659
            ],
            [
                14676,
                14716
            ],
            [
                14716,
                14725
            ],
            [
                14730,
                14758
            ],
            [
                14758,
                14762
            ],
            [
                14769,
                14781
            ],
            [
                14781,
                14791
            ],
            [
                14791,
                14810
            ],
            [
                14811,
                14827
            ],
            [
                14828,
                14837
            ],
            [
                14925,
                14944
            ],
            [
                14985,
                14992
            ],
            [
                15004,
                15008
            ],
            [
                15035,
                15044
            ],
            [
                15157,
                15159
            ],
            [
                15178,
                15226
            ],
            [
                15241,
                15260
            ],
            [
                15260,
                15301
            ],
            [
                15301,
                15317
            ],
            [
                15317,
                15325
            ],
            [
                15329,
                15381
            ],
            [
                15381,
                15384
            ],
            [
                15395,
                15486
            ],
            [
                15486,
                15521
            ],
            [
                15526,
                15580
            ],
            [
                15580,
                15622
            ],
            [
                15622,
                15652
            ],
            [
                15652,
                15669
            ],
            [
                15677,
                15679
            ],
            [
                15679,
                15680
            ],
            [
                15688,
                15693
            ],
            [
                15699,
                15715
            ],
            [
                15715,
                15767
            ],
            [
                15767,
                15841
            ],
            [
                15841,
                15872
            ],
            [
                15884,
                15899
            ],
            [
                15899,
                15947
            ],
            [
                15951,
                15972
            ],
            [
                16165,
                16198
            ],
            [
                16212,
                16306
            ],
            [
                16306,
                16375
            ],
            [
                16375,
                16468
            ],
            [
                16547,
                16549
            ],
            [
                16492,
                16510
            ],
            [
                16521,
                16546
            ],
            [
                16569,
                16572
            ],
            [
                16572,
                16597
            ],
            [
                16618,
                16621
            ],
            [
                16780,
                16784
            ],
            [
                16813,
                16853
            ],
            [
                16874,
                16885
            ],
            [
                16854,
                16870
            ],
            [
                16885,
                16985
            ],
            [
                16985,
                17088
            ],
            [
                17139,
                17145
            ],
            [
                17131,
                17138
            ],
            [
                17146,
                17193
            ],
            [
                17193,
                17286
            ],
            [
                17287,
                17395
            ],
            [
                17441,
                17453
            ],
            [
                17453,
                17534
            ],
            [
                17654,
                17692
            ],
            [
                17692,
                17767
            ],
            [
                17767,
                17770
            ],
            [
                17776,
                17804
            ],
            [
                17854,
                17856
            ],
            [
                17856,
                17873
            ],
            [
                17873,
                17951
            ],
            [
                17952,
                17960
            ],
            [
                17986,
                17998
            ],
            [
                18018,
                18096
            ],
            [
                18105,
                18131
            ],
            [
                18132,
                18144
            ],
            [
                17980,
                17985
            ],
            [
                18169,
                18186
            ],
            [
                18187,
                18199
            ],
            [
                18221,
                18259
            ],
            [
                18261,
                18298
            ],
            [
                18303,
                18305
            ],
            [
                18305,
                18366
            ],
            [
                18366,
                18408
            ],
            [
                18414,
                18422
            ],
            [
                18429,
                18448
            ],
            [
                18534,
                18554
            ],
            [
                18554,
                18622
            ],
            [
                18622,
                18640
            ],
            [
                18712,
                18765
            ],
            [
                18765,
                18860
            ],
            [
                18861,
                18926
            ],
            [
                18941,
                18966
            ],
            [
                18966,
                18976
            ],
            [
                18983,
                18985
            ],
            [
                18989,
                19023
            ],
            [
                19032,
                19033
            ],
            [
                19034,
                19047
            ],
            [
                19056,
                19065
            ],
            [
                19085,
                19095
            ],
            [
                19095,
                19135
            ],
            [
                19236,
                19263
            ],
            [
                19279,
                19289
            ],
            [
                19289,
                19307
            ],
            [
                19331,
                19364
            ],
            [
                19364,
                19368
            ],
            [
                19374,
                19379
            ],
            [
                19369,
                19373
            ],
            [
                19380,
                19410
            ],
            [
                19413,
                19425
            ],
            [
                19532,
                19582
            ],
            [
                19775,
                19791
            ],
            [
                19810,
                19930
            ],
            [
                19806,
                19809
            ],
            [
                20040,
                20044
            ],
            [
                20045,
                20070
            ],
            [
                20070,
                20131
            ],
            [
                20146,
                20148
            ],
            [
                20217,
                20235
            ],
            [
                20306,
                20309
            ],
            [
                20309,
                20349
            ],
            [
                20377,
                20399
            ],
            [
                20406,
                20408
            ],
            [
                20450,
                20523
            ],
            [
                20523,
                20554
            ],
            [
                20554,
                20591
            ],
            [
                20591,
                20603
            ],
            [
                20621,
                20653
            ],
            [
                20810,
                20863
            ],
            [
                20875,
                20886
            ],
            [
                20931,
                20955
            ],
            [
                21037,
                21044
            ],
            [
                20974,
                20984
            ],
            [
                21048,
                21093
            ],
            [
                21093,
                21140
            ],
            [
                21140,
                21217
            ],
            [
                21217,
                21248
            ],
            [
                21248,
                21297
            ],
            [
                21297,
                21354
            ],
            [
                21354,
                21382
            ],
            [
                21382,
                21436
            ],
            [
                21447,
                21474
            ],
            [
                21474,
                21561
            ],
            [
                21571,
                21688
            ],
            [
                21688,
                21702
            ],
            [
                21720,
                21780
            ],
            [
                21781,
                21862
            ],
            [
                21862,
                21935
            ],
            [
                21946,
                21948
            ],
            [
                21948,
                22006
            ],
            [
                22015,
                22021
            ],
            [
                22025,
                22038
            ],
            [
                22050,
                22062
            ],
            [
                22063,
                22072
            ],
            [
                22084,
                22119
            ],
            [
                22119,
                22168
            ],
            [
                22293,
                22306
            ],
            [
                22316,
                22389
            ],
            [
                22389,
                22494
            ],
            [
                22494,
                22517
            ],
            [
                22526,
                22532
            ],
            [
                22539,
                22565
            ],
            [
                22620,
                22722
            ],
            [
                22722,
                22734
            ],
            [
                22740,
                22748
            ],
            [
                22783,
                22790
            ],
            [
                22748,
                22749
            ],
            [
                22818,
                22858
            ],
            [
                22892,
                22903
            ],
            [
                22790,
                22791
            ],
            [
                23255,
                23265
            ],
            [
                23169,
                23177
            ],
            [
                23269,
                23286
            ],
            [
                23291,
                23350
            ],
            [
                23350,
                23368
            ],
            [
                23377,
                23403
            ],
            [
                23421,
                23439
            ],
            [
                23451,
                23472
            ],
            [
                23490,
                23536
            ]
        ],
        "row_chars": [
            [
                0,
                169
            ],
            [
                169,
                400
            ],
            [
                400,
                481
            ],
            [
                481,
                570
            ],
            [
                570,
                752
            ],
            [
                752,
                803
            ],
            [
                803,
                908
            ],
            [
                908,
                1060
            ],
            [
                1060,
                1100
            ],
            [
                1100,
                1230
            ],
            [
                1230,
                1311
            ],
            [
                1311,
                1451
            ],
            [
                1451,
                1532
            ],
            [
                1532,
                1576
            ],
            [
                1576,
                1658
            ],
            [
                1658,
                1749
            ],
            [
                1749,
                1840
            ],
            [
                1840,
                1891
            ],
            [
                1891,
                1987
            ],
            [
                1987,
                2085
            ],
            [
                2085,
                2233
            ],
            [
                2233,
                2281
            ],
            [
                2281,
                2357
            ],
            [
                2357,
                2445
            ],
            [
                2445,
                2789
            ],
            [
                2789,
                2843
            ],
            [
                2843,
                2854
            ],
            [
                2854,
                2949
            ],
            [
                2949,
                3172
            ],
            [
                3172,
                3227
            ],
            [
                3227,
                3272
            ],
            [
                3272,
                3298
            ],
            [
                3298,
                3338
            ],
            [
                3338,
                3400
            ],
            [
                3400,
                3442
            ],
            [
                3442,
                3620
            ],
            [
                3620,
                3744
            ],
            [
                3744,
                3806
            ],
            [
                3806,
                3875
            ],
            [
                3875,
                3905
            ],
            [
                3905,
                3939
            ],
            [
                3939,
                3963
            ],
            [
                3963,
                4045
            ],
            [
                4045,
                4089
            ],
            [
                4089,
                4233
            ],
            [
                4233,
                4338
            ],
            [
                4338,
                4382
            ],
            [
                4382,
                4454
            ],
            [
                4454,
                4549
            ],
            [
                4549,
                4651
            ],
            [
                4651,
                4690
            ],
            [
                4690,
                4772
            ],
            [
                4772,
                4842
            ],
            [
                4842,
                4922
            ],
            [
                4922,
                5038
            ],
            [
                5038,
                5145
            ],
            [
                5145,
                5278
            ],
            [
                5278,
                5348
            ],
            [
                5348,
                5685
            ],
            [
                5685,
                5764
            ],
            [
                5764,
                5877
            ],
            [
                5877,
                5940
            ],
            [
                5940,
                6046
            ],
            [
                6046,
                6109
            ],
            [
                6109,
                6157
            ],
            [
                6157,
                6246
            ],
            [
                6246,
                6357
            ],
            [
                6357,
                6397
            ],
            [
                6397,
                6601
            ],
            [
                6601,
                6789
            ],
            [
                6789,
                7004
            ],
            [
                7004,
                7031
            ],
            [
                7031,
                7131
            ],
            [
                7131,
                7206
            ],
            [
                7206,
                7229
            ],
            [
                7229,
                7279
            ],
            [
                7279,
                7445
            ],
            [
                7445,
                7575
            ],
            [
                7575,
                7643
            ],
            [
                7643,
                7762
            ],
            [
                7762,
                7792
            ],
            [
                7792,
                7839
            ],
            [
                7839,
                7876
            ],
            [
                7876,
                7894
            ],
            [
                7894,
                7953
            ],
            [
                7953,
                8023
            ],
            [
                8023,
                8036
            ],
            [
                8036,
                8063
            ],
            [
                8063,
                8114
            ],
            [
                8114,
                8195
            ],
            [
                8195,
                8264
            ],
            [
                8264,
                8299
            ],
            [
                8299,
                8375
            ],
            [
                8375,
                8386
            ],
            [
                8386,
                8415
            ],
            [
                8415,
                8718
            ],
            [
                8718,
                8755
            ],
            [
                8755,
                8773
            ],
            [
                8773,
                8924
            ],
            [
                8924,
                9051
            ],
            [
                9051,
                9147
            ],
            [
                9147,
                9176
            ],
            [
                9176,
                9192
            ],
            [
                9192,
                9232
            ],
            [
                9232,
                9322
            ],
            [
                9322,
                9415
            ],
            [
                9415,
                9449
            ],
            [
                9449,
                9554
            ],
            [
                9554,
                9711
            ],
            [
                9711,
                9780
            ],
            [
                9780,
                9802
            ],
            [
                9802,
                9872
            ],
            [
                9872,
                9900
            ],
            [
                9900,
                9959
            ],
            [
                9959,
                10063
            ],
            [
                10063,
                10254
            ],
            [
                10254,
                10400
            ],
            [
                10400,
                10455
            ],
            [
                10455,
                10560
            ],
            [
                10560,
                10611
            ],
            [
                10611,
                10851
            ],
            [
                10851,
                10995
            ],
            [
                10995,
                11036
            ],
            [
                11036,
                11072
            ],
            [
                11072,
                11222
            ],
            [
                11222,
                11254
            ],
            [
                11254,
                11284
            ],
            [
                11284,
                11332
            ],
            [
                11332,
                11442
            ],
            [
                11442,
                11527
            ],
            [
                11527,
                11556
            ],
            [
                11556,
                11620
            ],
            [
                11620,
                11729
            ],
            [
                11729,
                11745
            ],
            [
                11745,
                11802
            ],
            [
                11802,
                11921
            ],
            [
                11921,
                11974
            ],
            [
                11974,
                12139
            ],
            [
                12139,
                12152
            ],
            [
                12152,
                12238
            ],
            [
                12238,
                12250
            ],
            [
                12250,
                12286
            ],
            [
                12286,
                12433
            ],
            [
                12433,
                12660
            ],
            [
                12660,
                12772
            ],
            [
                12772,
                12820
            ],
            [
                12820,
                12894
            ],
            [
                12894,
                12982
            ],
            [
                12982,
                13012
            ],
            [
                13012,
                13053
            ],
            [
                13053,
                13104
            ],
            [
                13104,
                13141
            ],
            [
                13141,
                13393
            ],
            [
                13393,
                13474
            ],
            [
                13474,
                13508
            ],
            [
                13508,
                13527
            ],
            [
                13527,
                13602
            ],
            [
                13602,
                13698
            ],
            [
                13698,
                13729
            ],
            [
                13729,
                13878
            ],
            [
                13878,
                13987
            ],
            [
                13987,
                14041
            ],
            [
                14041,
                14093
            ],
            [
                14093,
                14117
            ],
            [
                14117,
                14242
            ],
            [
                14242,
                14316
            ],
            [
                14316,
                14336
            ],
            [
                14336,
                14400
            ],
            [
                14400,
                14499
            ],
            [
                14499,
                14556
            ],
            [
                14556,
                14612
            ],
            [
                14612,
                14716
            ],
            [
                14716,
                14758
            ],
            [
                14758,
                14781
            ],
            [
                14781,
                14791
            ],
            [
                14791,
                14837
            ],
            [
                14837,
                15159
            ],
            [
                15159,
                15178
            ],
            [
                15178,
                15260
            ],
            [
                15260,
                15301
            ],
            [
                15301,
                15317
            ],
            [
                15317,
                15381
            ],
            [
                15381,
                15486
            ],
            [
                15486,
                15580
            ],
            [
                15580,
                15622
            ],
            [
                15622,
                15652
            ],
            [
                15652,
                15679
            ],
            [
                15679,
                15715
            ],
            [
                15715,
                15767
            ],
            [
                15767,
                15841
            ],
            [
                15841,
                15899
            ],
            [
                15899,
                15972
            ],
            [
                15972,
                16037
            ],
            [
                16037,
                16081
            ],
            [
                16081,
                16161
            ],
            [
                16161,
                16306
            ],
            [
                16306,
                16375
            ],
            [
                16375,
                16572
            ],
            [
                16572,
                16621
            ],
            [
                16621,
                16669
            ],
            [
                16669,
                16700
            ],
            [
                16700,
                16985
            ],
            [
                16985,
                17193
            ],
            [
                17193,
                17287
            ],
            [
                17287,
                17453
            ],
            [
                17453,
                17534
            ],
            [
                17534,
                17551
            ],
            [
                17551,
                17587
            ],
            [
                17587,
                17654
            ],
            [
                17654,
                17692
            ],
            [
                17692,
                17767
            ],
            [
                17767,
                17856
            ],
            [
                17856,
                17873
            ],
            [
                17873,
                17952
            ],
            [
                17952,
                18187
            ],
            [
                18187,
                18305
            ],
            [
                18305,
                18366
            ],
            [
                18366,
                18448
            ],
            [
                18448,
                18534
            ],
            [
                18534,
                18554
            ],
            [
                18554,
                18622
            ],
            [
                18622,
                18765
            ],
            [
                18765,
                18861
            ],
            [
                18861,
                18966
            ],
            [
                18966,
                19034
            ],
            [
                19034,
                19095
            ],
            [
                19095,
                19289
            ],
            [
                19289,
                19364
            ],
            [
                19364,
                19410
            ],
            [
                19410,
                19582
            ],
            [
                19582,
                19641
            ],
            [
                19641,
                19775
            ],
            [
                19775,
                20045
            ],
            [
                20045,
                20070
            ],
            [
                20070,
                20148
            ],
            [
                20148,
                20217
            ],
            [
                20217,
                20309
            ],
            [
                20309,
                20408
            ],
            [
                20408,
                20450
            ],
            [
                20450,
                20523
            ],
            [
                20523,
                20554
            ],
            [
                20554,
                20591
            ],
            [
                20591,
                20713
            ],
            [
                20713,
                20771
            ],
            [
                20771,
                20810
            ],
            [
                20810,
                20886
            ],
            [
                20886,
                20955
            ],
            [
                20955,
                21093
            ],
            [
                21093,
                21140
            ],
            [
                21140,
                21217
            ],
            [
                21217,
                21248
            ],
            [
                21248,
                21297
            ],
            [
                21297,
                21354
            ],
            [
                21354,
                21382
            ],
            [
                21382,
                21474
            ],
            [
                21474,
                21561
            ],
            [
                21561,
                21688
            ],
            [
                21688,
                21781
            ],
            [
                21781,
                21862
            ],
            [
                21862,
                21948
            ],
            [
                21948,
                22038
            ],
            [
                22038,
                22119
            ],
            [
                22119,
                22389
            ],
            [
                22389,
                22494
            ],
            [
                22494,
                22722
            ],
            [
                22722,
                22948
            ],
            [
                22948,
                23132
            ],
            [
                23132,
                23350
            ],
            [
                23350,
                23536
            ]
        ]
    },
    "abridged": {
        "text": "When Alice heard of her cousin's success, she resolved that she would be triumphant. She had sacrificed nearly everything to this aim, and now he had achieved the first great step. If she could not rejoice in that, what source of joy would be left for her? She had promised to be his wife because she wished to assist his struggles, and to aid him in his public career. She strove, therefore, to be triumphant, but she knew that she was striving in vain. She had made a mistake, and the days were coming in which she would have admit it to herself, and to repent.\nWhen the news was first brought to her, she sat down at once to write him a word of congratulation. But she found the task more difficult than she had expected, and gave it up. She did not know how to address him.\n\"I will wait till he comes,\" she said. \"It will be easier to speak than to write.\" But she wrote to Kate, and managed to put some note of triumph into her letter. Kate had written to her at length, with sincere rejoicing. To Kate in Westmorland, it seemed that her brother had already done everything. He had made the great leap, and had overcome the only obstacle that Fate had placed in his way - the lack of money. In her great joy and enthusiasm she almost forgot where the money had come from.\n\"I am proud,\" she wrote. \"No other thing would have made me so proud of him. If the Queen had made him an earl, it would have been as nothing compared to this. When I think that he has forced his way into Parliament without any great friend, with nothing to back him but his own wit,\" - she had, in truth, forgotten Alice's money as she wrote - \"I do feel proud of my brother. And, Alice, I hope that you are proud of your lover.\" Poor girl! She knew nothing of Messrs. Grimes and Scruby, and the River Bank, and could not have learnt how elections are conducted.\n\"He is not my lover,\" Alice said to herself. \"He understands that, though she may not.\" And if not your lover, Alice Vavasor, what is he then to you? And what are you to him? She was beginning to understand that she had put herself in the way of utter destruction; that she had walked to the brink of a precipice, and that she must now topple over it. She sat silent and moody, and it took her hours to get her answer written to Kate.\nOn the same afternoon she saw her father for a moment or two.\n\"So George has got himself returned,\" he said.\n\"Yes, he has been successful. I'm sure you must be glad, papa.\"\n\"Upon my word, I'm not. He has bought a seat for three months; and with whose two thousand pounds?\"\n\"Don't let us always speak of money, papa. If as much is wanted for the next election he shall have it.\"\n\"Very well, my dear. If you choose to make a beggar of yourself, I cannot help it. Indeed, I shall not complain about him spending all your money, if you do not marry him at last.\"\nAlice said nothing. On that point her father's wishes were fast growing to be identical with her own.\n\"I tell you what I think,\" he continued. \"Nothing, in my opinion, would be so deplorable and ruinous as such a marriage. You tell me that you have made up your mind to take him, and I know that nothing that I can say will turn you. But I believe that when he has spent all your money he will not take you after all. You can hardly expect that I should triumph because he has got himself into Parliament with your money!\"\nWhen he left, it seemed to Alice that he had been very cruel. There had been nothing of a father's loving tenderness in his words - although Alice herself had made tenderness on this subject impossible.\nOn the next morning George went to her. The reader will, perhaps, remember their last interview, when he had asked for a kiss; but she had refused him. She had shuddered, showing him more clearly than any words that she felt none of the love of a woman for him. He had turned from her in anger; and since then, he had borrowed her money twice. How would he address her? He was not a man to forget the treatment he had received.\nWhen he entered the room, Alice looked at him almost furtively. She was afraid of him. But she perceived that the gash on his face was nearly closed; the mark of anger was not there. He had come to her intending to be gentle, if possible.\n\"George, I am so glad that you have succeeded!\" she said. \"I wish you joy with my whole heart.\"\n\"Thanks, dearest. But before I say another word, let me acknowledge my debt. Unless you had aided me with your money, I could not have succeeded.\"\n\"Oh, George! pray don't speak of that!\"\n\"Let me rather speak of it at once, and have done. You know that I must speak of it sooner or later.\" He smiled and looked pleasant, as he used to do in those Swiss days. \"I hope you have trusted me in giving me the command of your fortune?\"\n\"Oh, yes.\"\n\"I do believe that you have. I could not have stood for this last election without it; and if I had not come forward at this vacancy, I should have stood no chance for the next. You can understand that; eh, Alice?\"\n\"Yes.\"\n\"Even your father would tell you that; though he probably regards my ambition to be a Member of Parliament as a sign of downright madness. But about the money! It is quite possible that I may be forced to ask for another loan when the autumn comes.\"\n\"You shall have it, George.\"\n\"Thanks, Alice. And now I will tell you what I propose. You know that I have been reconciled - in a way - with my grandfather? Well, when the next election is over, I wish to tell him exactly how you and I stand.\"\n\"Do not go into that now, George. Simply be assured that I will help you all I can. I want you to feel the full joy of your success, and you will do so more thoroughly if you will banish money troubles from your mind for a while.\"\n\"They shall, at any rate, be banished while I am with you,\" said he. \"There; let them go!\" And he lifted up his right hand, and blew at the tips of his fingers. \"Let them vanish,\" said he.\nIt was a pretty bit of acting; and, upon the whole, I do not know that he could have done better. But Alice saw through it, and he knew that she did so. The whole thing was uncomfortable to him, except the fact that he had the promise of her further money.\nBut he was not satisfied with this. He must extract from her some show of sympathy or approval, some spark of affection, true or pretended, so that he might speak of the future without open embarrassment.\n\"I have already taken my seat,\" said he.\n\"Yes; I saw that in the newspapers. My acquaintance among Members of Parliament is very small, but I see that you were introduced by one of the few men that I do know. Is Mr. Bott a friend of yours?\"\n\"No, certainly not. I may have to act with him in public.\"\n\"Ah, that's just what they said about Mr. Palliser when they felt ashamed of his having him as his guest. I think if I were in public life I should try to act with people that I could like.\"\n\"Then you dislike Mr. Bott?\"\n\"I do not like him.\"\n\"He is a vulgar ass,\" said George, \"with no more pretensions to rank himself a gentleman than a footman. But he will get on in Parliament, to a certain extent.\"\n\"I'm afraid I don't quite understand what Parliamentary success requires. Is his ambition, do you suppose, the same as yours?\"\n\"His ambition, I think, does not go beyond a desire to be Parliamentary flunkey to a big man - with wages, if possible.\"\n\"And yours?\"\n\"There are some things, Alice, that a man does not tell to anyone.\"\n\"Are there? They must be very terrible things.\"\n\"The schoolboy, when he sits down to make his rhymes, dares not say, even to his sister, that he hopes to rival Milton; but he nurses such a hope. The preacher, when he preaches his sermon, does not whisper, even to his wife, his belief that thousands may be turned to repentance by his words; but he thinks that it is possible.\"\n\"And you intend to make your thousand converts in politics.\"\n\"I like to hear you laugh at me. It does me good to hear your voice again with some touch of satire in it. It brings back the old days - the days to which I hope we may soon revert without pain. Shall it not be so, dearest?\"\nHer playful manner at once deserted her. \"I do not know,\" she said, gloomily.\nFor a few minutes he sat silent, fingering a small steel paper-knife, of no great value, which was lying on the table. He sat with it, passing it through his fingers, while she went on with her needlework.\n\"Who gave you this paper-cutter?\" he said, suddenly.\n\"Goodness me, why do you ask in that way?\"\n\"I asked simply because if it is a present to you from any one, I will take up something else.\"\n\"It was given me by Mr. Grey.\"\nHe let it drop from his fingers on to the table with a noise, and then pushed it away, so that it fell off the other side.\n\"George,\" she said, as she stooped and picked it up, \"your violence is unreasonable.\"\n\"I beg your pardon. I was simply unfortunate in the article I selected. Who gave you this?\" He picked up a little folding ivory ruler.\n\"No one gave me that; I bought it at a stupid bazaar.\"\n\"Then this will do. You shall give it me as a present, on the renewal of our love.\"\n\"It is too poor a thing to give,\" said she, more gloomily than before.\n\"By no means; nothing is too poor. Anything will do; a ribbon, a glove, a broken sixpence. Will you give me something that I may take, and know that your heart is given with it?\"\n\"Take the ruler, if you please,\" she said.\n\"And the heart?\" he asked.\nHe should have been either more of a rascal, or less. He should have been content with simply acquiring her money. But it was necessary for his comfort that she should say she loved him. \"Well, Alice, and what about the heart?\" he asked again.\n\"I would much rather talk about politics, George,\" said she.\nThe scar began to make itself very visible in his face, and the debonair manner was fast vanishing. He had fixed his eyes upon her, and inserted his thumbs in the armholes of his waistcoat.\n\"Alice, that is not quite fair,\" he said.\n\"I do not mean to be unfair.\"\n\"I am not so sure. I think you do mean it. You have told me that you intend to become my wife. If, after that, you wilfully make me miserable, will not that be unfair?\"\n\"I am not making you miserable, certainly not wilfully.\"\n\"Did that letter which you wrote to me from Westmorland mean anything?\"\nAlice sat silent, turning her face away, longing that the meeting might be over, and feeling that she had lost her own self-respect.\n\"Look here, Alice,\" he said, \"I find it very hard to understand you. When I look back over all that has passed between us, and to that other episode in your life, compared to your conduct to me now, I find myself at a loss.\"\n\"I fear I cannot help you.\"\n\"When you first loved me - for you did love me; I understood that well enough - and when you quarrelled with me, judging my offences somewhat harshly, I understood that also; for it is the custom of women to be hard in their judgement on such sins. When I heard that you had accepted the offer made to you by that gentleman in Cambridgeshire, I thought it was natural that you should seek some cure for your wound. I understood it, and accused myself, not you, in that I had driven you to so fatal a remedy.\"\nHere Alice turned round towards him sharply, as though she were going to interrupt him, but she said nothing.\nHe went on. \"And I understood it well when I heard that this cure had been too much for you. I have not a word to say against him. For many women he would make a model husband, but you are not one of them. And you discovered this yourself. Yes, by heavens! if ever woman had been driven to a mistake, you had been driven to one there.\"\nHere she met his eyes with something of his own fierceness in her face, as though she were preparing to fight with him; but she still said nothing, and he again went on.\n\"And, Alice, when you again consented to be my wife, I thought that I still understood you. I may have been vain to think so, but surely it was natural. I believed that the old love had come back to you, and warmed your heart. Was that unnatural? Put yourself in my place, and say if you would not have thought so. I told myself that you had acted as a true, and good, and loving woman. I thought of you much, and I saw that your conduct, as a whole, was intelligible and becoming.\"\nThe last word grated on Alice's ears, and she showed her anger by tapping her foot upon the floor. Her cousin noticed it, but went on as though he had not.\n\"But now your behaviour is a riddle. You have said that you would be my wife, and yet you receive me with coldness. What am I to think? How would you have me behave to you? When I was last here I asked you for a kiss.\" He said this with the wound down his face all wide and purple. I think that, in speaking, a touch of true passion had come upon him; that he had forgotten his rascaldom, and his need of her money, and his wish to punish her.\n\"I asked you for a kiss. If you are to be my wife you can have no shame in granting me one. What am I to think?\" Then he paused again, and she found that she must say something.\n\"I wonder you cannot understand,\" she said, \"that I have suffered much.\"\n\"And is that to be my answer?\"\n\"I don't know what answer you want.\"\n\"Come, Alice; you do know what answer I want. I desire to learn that the woman who is to be my wife loves me.\"\nStill she said nothing. He held the little ruler as though in doubt what he would do with it. \"Well, Alice, am I to hear anything from you?\"\n\"Not now, George; you are angry, and I will not speak to you in your anger.\"\n\"Have I not cause to be angry? Do you not know that you are treating me badly?\"\n\"I know that my head aches, and that I am very wretched. I wish you would leave me.\"\n\"There, then, is your gift,\" said he, and he threw the ruler on to the sofa behind her. \"And there is the trumpery trinket which I had hoped you would have worn for my sake.\" Something which he had taken from his waistcoat-pocket was thrown violently into the fender, beneath the fire-grate. He then walked quickly to the door; but when his hand was on the handle, he turned.\n\"Alice,\" he said, \"when I am gone, try to think honestly of your conduct to me.\" Then he went, and she remained still, till she heard the front door close.\nWhen she was sure that he was gone, her first movement was to search for the trinket. This was not very dignified; but I think that it was natural. It was not that she had any desire for the jewel, but she had a reluctance that anything of value should be destroyed without a purpose. So she took the shovel, and poked among the ashes, and found the ring which her cousin had thrown there. It was a valuable ring, with a ruby between two small diamonds; but one of the side stones had been knocked out by the violence with which the ring had been flung. She searched for this in vain, before deciding that the diamond should be lost for ever amongst the cinders.\nThen she folded the ring up carefully in a sheet of note-paper, and put it in the drawer of her desk. After that she sat down at the table to think; but her head was racked with pain, and she could bring her thoughts to no conclusion.",
        "paragraph_chars": [
            [
                0,
                564
            ],
            [
                564,
                778
            ],
            [
                778,
                1277
            ],
            [
                1277,
                1841
            ],
            [
                1841,
                2276
            ],
            [
                2276,
                2338
            ],
            [
                2338,
                2385
            ],
            [
                2385,
                2449
            ],
            [
                2449,
                2549
            ],
            [
                2549,
                2654
            ],
            [
                2654,
                2835
            ],
            [
                2835,
                2937
            ],
            [
                2937,
                3358
            ],
            [
                3358,
                3561
            ],
            [
                3561,
                3989
            ],
            [
                3989,
                4228
            ],
            [
                4228,
                4324
            ],
            [
                4324,
                4471
            ],
            [
                4471,
                4511
            ],
            [
                4511,
                4753
            ],
            [
                4753,
                4764
            ],
            [
                4764,
                4979
            ],
            [
                4979,
                4986
            ],
            [
                4986,
                5236
            ],
            [
                5236,
                5265
            ],
            [
                5265,
                5479
            ],
            [
                5479,
                5710
            ],
            [
                5710,
                5899
            ],
            [
                5899,
                6156
            ],
            [
                6156,
                6361
            ],
            [
                6361,
                6402
            ],
            [
                6402,
                6602
            ],
            [
                6602,
                6661
            ],
            [
                6661,
                6852
            ],
            [
                6852,
                6881
            ],
            [
                6881,
                6902
            ],
            [
                6902,
                7063
            ],
            [
                7063,
                7190
            ],
            [
                7190,
                7311
            ],
            [
                7311,
                7324
            ],
            [
                7324,
                7392
            ],
            [
                7392,
                7440
            ],
            [
                7440,
                7770
            ],
            [
                7770,
                7831
            ],
            [
                7831,
                8056
            ],
            [
                8056,
                8134
            ],
            [
                8134,
                8340
            ],
            [
                8340,
                8393
            ],
            [
                8393,
                8436
            ],
            [
                8436,
                8532
            ],
            [
                8532,
                8563
            ],
            [
                8563,
                8686
            ],
            [
                8686,
                8772
            ],
            [
                8772,
                8907
            ],
            [
                8907,
                8962
            ],
            [
                8962,
                9046
            ],
            [
                9046,
                9117
            ],
            [
                9117,
                9296
            ],
            [
                9296,
                9339
            ],
            [
                9339,
                9366
            ],
            [
                9366,
                9610
            ],
            [
                9610,
                9671
            ],
            [
                9671,
                9861
            ],
            [
                9861,
                9903
            ],
            [
                9903,
                9933
            ],
            [
                9933,
                10102
            ],
            [
                10102,
                10159
            ],
            [
                10159,
                10231
            ],
            [
                10231,
                10364
            ],
            [
                10364,
                10589
            ],
            [
                10589,
                10617
            ],
            [
                10617,
                11126
            ],
            [
                11126,
                11236
            ],
            [
                11236,
                11572
            ],
            [
                11572,
                11742
            ],
            [
                11742,
                12225
            ],
            [
                12225,
                12381
            ],
            [
                12381,
                12825
            ],
            [
                12825,
                13003
            ],
            [
                13003,
                13076
            ],
            [
                13076,
                13107
            ],
            [
                13107,
                13144
            ],
            [
                13144,
                13255
            ],
            [
                13255,
                13396
            ],
            [
                13396,
                13473
            ],
            [
                13473,
                13553
            ],
            [
                13553,
                13638
            ],
            [
                13638,
                14014
            ],
            [
                14014,
                14170
            ],
            [
                14170,
                14833
            ],
            [
                14833,
                15067
            ]
        ],
        "segment_chars": [
            [
                0,
                85
            ],
            [
                85,
                181
            ],
            [
                181,
                257
            ],
            [
                257,
                370
            ],
            [
                370,
                455
            ],
            [
                455,
                564
            ],
            [
                564,
                664
            ],
            [
                664,
                741
            ],
            [
                741,
                778
            ],
            [
                778,
                817
            ],
            [
                817,
                861
            ],
            [
                861,
                941
            ],
            [
                941,
                1000
            ],
            [
                1000,
                1080
            ],
            [
                1080,
                1196
            ],
            [
                1196,
                1277
            ],
            [
                1277,
                1302
            ],
            [
                1302,
                1354
            ],
            [
                1354,
                1437
            ],
            [
                1437,
                1654
            ],
            [
                1654,
                1708
            ],
            [
                1708,
                1719
            ],
            [
                1719,
                1841
            ],
            [
                1841,
                1886
            ],
            [
                1886,
                1929
            ],
            [
                1929,
                1991
            ],
            [
                1991,
                2016
            ],
            [
                2016,
                2193
            ],
            [
                2193,
                2276
            ],
            [
                2276,
                2338
            ],
            [
                2338,
                2385
            ],
            [
                2385,
                2415
            ],
            [
                2415,
                2449
            ],
            [
                2449,
                2473
            ],
            [
                2473,
                2549
            ],
            [
                2549,
                2592
            ],
            [
                2592,
                2654
            ],
            [
                2654,
                2675
            ],
            [
                2675,
                2737
            ],
            [
                2737,
                2835
            ],
            [
                2835,
                2855
            ],
            [
                2855,
                2937
            ],
            [
                2937,
                2978
            ],
            [
                2978,
                3058
            ],
            [
                3058,
                3169
            ],
            [
                3169,
                3253
            ],
            [
                3253,
                3358
            ],
            [
                3358,
                3420
            ],
            [
                3420,
                3561
            ],
            [
                3561,
                3601
            ],
            [
                3601,
                3713
            ],
            [
                3713,
                3823
            ],
            [
                3823,
                3905
            ],
            [
                3905,
                3931
            ],
            [
                3931,
                3989
            ],
            [
                3989,
                4053
            ],
            [
                4053,
                4076
            ],
            [
                4076,
                4172
            ],
            [
                4172,
                4228
            ],
            [
                4228,
                4276
            ],
            [
                4276,
                4286
            ],
            [
                4286,
                4324
            ],
            [
                4324,
                4342
            ],
            [
                4342,
                4401
            ],
            [
                4401,
                4471
            ],
            [
                4471,
                4484
            ],
            [
                4484,
                4511
            ],
            [
                4511,
                4562
            ],
            [
                4562,
                4613
            ],
            [
                4613,
                4682
            ],
            [
                4682,
                4753
            ],
            [
                4753,
                4764
            ],
            [
                4764,
                4793
            ],
            [
                4793,
                4942
            ],
            [
                4942,
                4979
            ],
            [
                4979,
                4986
            ],
            [
                4986,
                5125
            ],
            [
                5125,
                5146
            ],
            [
                5146,
                5236
            ],
            [
                5236,
                5265
            ],
            [
                5265,
                5281
            ],
            [
                5281,
                5321
            ],
            [
                5321,
                5392
            ],
            [
                5392,
                5479
            ],
            [
                5479,
                5513
            ],
            [
                5513,
                5563
            ],
            [
                5563,
                5710
            ],
            [
                5710,
                5779
            ],
            [
                5779,
                5801
            ],
            [
                5801,
                5871
            ],
            [
                5871,
                5899
            ],
            [
                5899,
                5997
            ],
            [
                5997,
                6052
            ],
            [
                6052,
                6156
            ],
            [
                6156,
                6192
            ],
            [
                6192,
                6361
            ],
            [
                6361,
                6402
            ],
            [
                6402,
                6438
            ],
            [
                6438,
                6570
            ],
            [
                6570,
                6602
            ],
            [
                6602,
                6622
            ],
            [
                6622,
                6661
            ],
            [
                6661,
                6767
            ],
            [
                6767,
                6852
            ],
            [
                6852,
                6881
            ],
            [
                6881,
                6902
            ],
            [
                6902,
                7007
            ],
            [
                7007,
                7063
            ],
            [
                7063,
                7137
            ],
            [
                7137,
                7190
            ],
            [
                7190,
                7311
            ],
            [
                7311,
                7324
            ],
            [
                7324,
                7392
            ],
            [
                7392,
                7404
            ],
            [
                7404,
                7440
            ],
            [
                7440,
                7587
            ],
            [
                7587,
                7770
            ],
            [
                7770,
                7831
            ],
            [
                7831,
                7864
            ],
            [
                7864,
                7938
            ],
            [
                7938,
                8026
            ],
            [
                8026,
                8056
            ],
            [
                8056,
                8097
            ],
            [
                8097,
                8134
            ],
            [
                8134,
                8253
            ],
            [
                8253,
                8340
            ],
            [
                8340,
                8374
            ],
            [
                8374,
                8393
            ],
            [
                8393,
                8436
            ],
            [
                8436,
                8532
            ],
            [
                8532,
                8563
            ],
            [
                8563,
                8686
            ],
            [
                8686,
                8772
            ],
            [
                8772,
                8792
            ],
            [
                8792,
                8844
            ],
            [
                8844,
                8864
            ],
            [
                8864,
                8907
            ],
            [
                8907,
                8962
            ],
            [
                8962,
                8982
            ],
            [
                8982,
                9046
            ],
            [
                9046,
                9117
            ],
            [
                9117,
                9152
            ],
            [
                9152,
                9208
            ],
            [
                9208,
                9296
            ],
            [
                9296,
                9339
            ],
            [
                9339,
                9356
            ],
            [
                9356,
                9366
            ],
            [
                9366,
                9420
            ],
            [
                9420,
                9481
            ],
            [
                9481,
                9553
            ],
            [
                9553,
                9594
            ],
            [
                9594,
                9610
            ],
            [
                9610,
                9671
            ],
            [
                9671,
                9771
            ],
            [
                9771,
                9861
            ],
            [
                9861,
                9903
            ],
            [
                9903,
                9933
            ],
            [
                9933,
                9952
            ],
            [
                9952,
                9976
            ],
            [
                9976,
                10028
            ],
            [
                10028,
                10102
            ],
            [
                10102,
                10159
            ],
            [
                10159,
                10231
            ],
            [
                10231,
                10364
            ],
            [
                10364,
                10433
            ],
            [
                10433,
                10589
            ],
            [
                10589,
                10617
            ],
            [
                10617,
                10866
            ],
            [
                10866,
                11032
            ],
            [
                11032,
                11126
            ],
            [
                11126,
                11236
            ],
            [
                11236,
                11248
            ],
            [
                11248,
                11329
            ],
            [
                11329,
                11367
            ],
            [
                11367,
                11442
            ],
            [
                11442,
                11476
            ],
            [
                11476,
                11493
            ],
            [
                11493,
                11572
            ],
            [
                11572,
                11742
            ],
            [
                11742,
                11834
            ],
            [
                11834,
                11895
            ],
            [
                11895,
                11969
            ],
            [
                11969,
                11989
            ],
            [
                11989,
                12057
            ],
            [
                12057,
                12129
            ],
            [
                12129,
                12225
            ],
            [
                12225,
                12324
            ],
            [
                12324,
                12381
            ],
            [
                12381,
                12418
            ],
            [
                12418,
                12497
            ],
            [
                12497,
                12517
            ],
            [
                12517,
                12554
            ],
            [
                12554,
                12600
            ],
            [
                12600,
                12663
            ],
            [
                12663,
                12825
            ],
            [
                12825,
                12850
            ],
            [
                12850,
                12917
            ],
            [
                12917,
                12938
            ],
            [
                12938,
                13003
            ],
            [
                13003,
                13076
            ],
            [
                13076,
                13107
            ],
            [
                13107,
                13144
            ],
            [
                13144,
                13190
            ],
            [
                13190,
                13255
            ],
            [
                13255,
                13279
            ],
            [
                13279,
                13349
            ],
            [
                13349,
                13396
            ],
            [
                13396,
                13473
            ],
            [
                13473,
                13504
            ],
            [
                13504,
                13553
            ],
            [
                13553,
                13610
            ],
            [
                13610,
                13638
            ],
            [
                13638,
                13726
            ],
            [
                13726,
                13813
            ],
            [
                13813,
                13930
            ],
            [
                13930,
                14014
            ],
            [
                14014,
                14095
            ],
            [
                14095,
                14170
            ],
            [
                14170,
                14256
            ],
            [
                14256,
                14318
            ],
            [
                14318,
                14455
            ],
            [
                14455,
                14560
            ],
            [
                14560,
                14724
            ],
            [
                14724,
                14833
            ],
            [
                14833,
                14935
            ],
            [
                14935,
                15067
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                42,
                85
            ],
            [
                85,
                124
            ],
            [
                133,
                142
            ],
            [
                143,
                179
            ],
            [
                179,
                181
            ],
            [
                181,
                239
            ],
            [
                240,
                257
            ],
            [
                257,
                264
            ],
            [
                265,
                273
            ],
            [
                274,
                276
            ],
            [
                280,
                283
            ],
            [
                289,
                307
            ],
            [
                308,
                370
            ],
            [
                370,
                409
            ],
            [
                409,
                448
            ],
            [
                453,
                455
            ],
            [
                455,
                527
            ],
            [
                537,
                547
            ],
            [
                547,
                562
            ],
            [
                562,
                564
            ],
            [
                569,
                572
            ],
            [
                582,
                602
            ],
            [
                602,
                603
            ],
            [
                604,
                607
            ],
            [
                608,
                616
            ],
            [
                617,
                624
            ],
            [
                625,
                644
            ],
            [
                645,
                664
            ],
            [
                664,
                728
            ],
            [
                729,
                741
            ],
            [
                741,
                761
            ],
            [
                762,
                777
            ],
            [
                778,
                815
            ],
            [
                815,
                817
            ],
            [
                817,
                861
            ],
            [
                861,
                887
            ],
            [
                896,
                941
            ],
            [
                941,
                975
            ],
            [
                976,
                980
            ],
            [
                981,
                1000
            ],
            [
                1000,
                1007
            ],
            [
                1008,
                1015
            ],
            [
                1018,
                1026
            ],
            [
                1027,
                1080
            ],
            [
                1080,
                1174
            ],
            [
                1194,
                1196
            ],
            [
                1196,
                1212
            ],
            [
                1228,
                1245
            ],
            [
                1252,
                1261
            ],
            [
                1262,
                1270
            ],
            [
                1275,
                1276
            ],
            [
                1277,
                1294
            ],
            [
                1300,
                1302
            ],
            [
                1302,
                1317
            ],
            [
                1318,
                1354
            ],
            [
                1357,
                1366
            ],
            [
                1367,
                1370
            ],
            [
                1371,
                1418
            ],
            [
                1428,
                1437
            ],
            [
                1437,
                1559
            ],
            [
                1564,
                1619
            ],
            [
                1622,
                1623
            ],
            [
                1623,
                1654
            ],
            [
                1654,
                1708
            ],
            [
                1708,
                1719
            ],
            [
                1719,
                1722
            ],
            [
                1728,
                1789
            ],
            [
                1816,
                1841
            ],
            [
                1841,
                1886
            ],
            [
                1887,
                1901
            ],
            [
                1906,
                1929
            ],
            [
                1929,
                1991
            ],
            [
                1991,
                2014
            ],
            [
                2014,
                2016
            ],
            [
                2016,
                2105
            ],
            [
                2106,
                2193
            ],
            [
                2193,
                2276
            ],
            [
                2276,
                2337
            ],
            [
                2338,
                2383
            ],
            [
                2383,
                2385
            ],
            [
                2385,
                2415
            ],
            [
                2415,
                2449
            ],
            [
                2449,
                2473
            ],
            [
                2473,
                2526
            ],
            [
                2546,
                2549
            ],
            [
                2549,
                2590
            ],
            [
                2592,
                2602
            ],
            [
                2603,
                2654
            ],
            [
                2654,
                2673
            ],
            [
                2675,
                2737
            ],
            [
                2737,
                2765
            ],
            [
                2785,
                2834
            ],
            [
                2835,
                2855
            ],
            [
                2855,
                2937
            ],
            [
                2937,
                2948
            ],
            [
                2949,
                2953
            ],
            [
                2961,
                2978
            ],
            [
                2978,
                3058
            ],
            [
                3058,
                3125
            ],
            [
                3126,
                3169
            ],
            [
                3169,
                3241
            ],
            [
                3251,
                3253
            ],
            [
                3253,
                3358
            ],
            [
                3363,
                3370
            ],
            [
                3370,
                3371
            ],
            [
                3372,
                3420
            ],
            [
                3420,
                3434
            ],
            [
                3435,
                3487
            ],
            [
                3499,
                3504
            ],
            [
                3513,
                3521
            ],
            [
                3522,
                3532
            ],
            [
                3533,
                3548
            ],
            [
                3549,
                3560
            ],
            [
                3561,
                3601
            ],
            [
                3601,
                3656
            ],
            [
                3656,
                3657
            ],
            [
                3663,
                3669
            ],
            [
                3670,
                3675
            ],
            [
                3680,
                3713
            ],
            [
                3713,
                3730
            ],
            [
                3730,
                3731
            ],
            [
                3740,
                3743
            ],
            [
                3744,
                3748
            ],
            [
                3757,
                3771
            ],
            [
                3772,
                3785
            ],
            [
                3786,
                3813
            ],
            [
                3814,
                3821
            ],
            [
                3821,
                3823
            ],
            [
                3823,
                3854
            ],
            [
                3856,
                3859
            ],
            [
                3860,
                3865
            ],
            [
                3866,
                3870
            ],
            [
                3870,
                3871
            ],
            [
                3872,
                3897
            ],
            [
                3903,
                3905
            ],
            [
                3905,
                3908
            ],
            [
                3915,
                3917
            ],
            [
                3918,
                3931
            ],
            [
                3931,
                3988
            ],
            [
                3989,
                4034
            ],
            [
                4035,
                4053
            ],
            [
                4053,
                4076
            ],
            [
                4080,
                4083
            ],
            [
                4084,
                4137
            ],
            [
                4139,
                4150
            ],
            [
                4151,
                4172
            ],
            [
                4172,
                4217
            ],
            [
                4218,
                4227
            ],
            [
                4228,
                4273
            ],
            [
                4287,
                4324
            ],
            [
                4324,
                4342
            ],
            [
                4342,
                4401
            ],
            [
                4401,
                4471
            ],
            [
                4471,
                4484
            ],
            [
                4484,
                4511
            ],
            [
                4511,
                4562
            ],
            [
                4562,
                4565
            ],
            [
                4566,
                4613
            ],
            [
                4613,
                4681
            ],
            [
                4682,
                4712
            ],
            [
                4713,
                4753
            ],
            [
                4753,
                4764
            ],
            [
                4764,
                4793
            ],
            [
                4793,
                4854
            ],
            [
                4855,
                4940
            ],
            [
                4940,
                4942
            ],
            [
                4942,
                4979
            ],
            [
                4979,
                4983
            ],
            [
                4986,
                4987
            ],
            [
                4987,
                5003
            ],
            [
                5004,
                5031
            ],
            [
                5032,
                5034
            ],
            [
                5035,
                5043
            ],
            [
                5044,
                5125
            ],
            [
                5125,
                5128
            ],
            [
                5129,
                5146
            ],
            [
                5146,
                5157
            ],
            [
                5167,
                5236
            ],
            [
                5236,
                5265
            ],
            [
                5265,
                5281
            ],
            [
                5281,
                5321
            ],
            [
                5321,
                5357
            ],
            [
                5363,
                5364
            ],
            [
                5371,
                5375
            ],
            [
                5376,
                5392
            ],
            [
                5392,
                5411
            ],
            [
                5421,
                5431
            ],
            [
                5437,
                5470
            ],
            [
                5471,
                5479
            ],
            [
                5479,
                5513
            ],
            [
                5520,
                5535
            ],
            [
                5548,
                5551
            ],
            [
                5556,
                5561
            ],
            [
                5561,
                5563
            ],
            [
                5563,
                5665
            ],
            [
                5666,
                5710
            ],
            [
                5710,
                5779
            ],
            [
                5779,
                5801
            ],
            [
                5801,
                5871
            ],
            [
                5871,
                5898
            ],
            [
                5899,
                5928
            ],
            [
                5928,
                5997
            ],
            [
                5997,
                6052
            ],
            [
                6052,
                6148
            ],
            [
                6154,
                6155
            ],
            [
                6156,
                6162
            ],
            [
                6167,
                6170
            ],
            [
                6171,
                6192
            ],
            [
                6192,
                6221
            ],
            [
                6222,
                6238
            ],
            [
                6250,
                6295
            ],
            [
                6299,
                6312
            ],
            [
                6313,
                6360
            ],
            [
                6361,
                6402
            ],
            [
                6402,
                6438
            ],
            [
                6438,
                6531
            ],
            [
                6532,
                6570
            ],
            [
                6570,
                6602
            ],
            [
                6602,
                6606
            ],
            [
                6617,
                6620
            ],
            [
                6620,
                6622
            ],
            [
                6622,
                6627
            ],
            [
                6628,
                6661
            ],
            [
                6661,
                6692
            ],
            [
                6699,
                6748
            ],
            [
                6753,
                6767
            ],
            [
                6767,
                6852
            ],
            [
                6852,
                6881
            ],
            [
                6881,
                6899
            ],
            [
                6899,
                6902
            ],
            [
                6902,
                6995
            ],
            [
                6998,
                7005
            ],
            [
                7007,
                7063
            ],
            [
                7063,
                7104
            ],
            [
                7105,
                7126
            ],
            [
                7135,
                7137
            ],
            [
                7137,
                7190
            ],
            [
                7190,
                7206
            ],
            [
                7212,
                7282
            ],
            [
                7285,
                7308
            ],
            [
                7308,
                7311
            ],
            [
                7311,
                7324
            ],
            [
                7324,
                7325
            ],
            [
                7325,
                7382
            ],
            [
                7389,
                7392
            ],
            [
                7392,
                7404
            ],
            [
                7404,
                7440
            ],
            [
                7440,
                7587
            ],
            [
                7587,
                7695
            ],
            [
                7696,
                7722
            ],
            [
                7723,
                7752
            ],
            [
                7759,
                7770
            ],
            [
                7770,
                7778
            ],
            [
                7779,
                7785
            ],
            [
                7786,
                7831
            ],
            [
                7831,
                7862
            ],
            [
                7862,
                7864
            ],
            [
                7864,
                7938
            ],
            [
                7938,
                7965
            ],
            [
                7968,
                8026
            ],
            [
                8026,
                8056
            ],
            [
                8056,
                8097
            ],
            [
                8097,
                8134
            ],
            [
                8134,
                8176
            ],
            [
                8177,
                8206
            ],
            [
                8207,
                8222
            ],
            [
                8223,
                8252
            ],
            [
                8253,
                8327
            ],
            [
                8334,
                8340
            ],
            [
                8340,
                8374
            ],
            [
                8374,
                8393
            ],
            [
                8393,
                8405
            ],
            [
                8405,
                8436
            ],
            [
                8436,
                8532
            ],
            [
                8532,
                8563
            ],
            [
                8563,
                8643
            ],
            [
                8648,
                8665
            ],
            [
                8670,
                8684
            ],
            [
                8684,
                8686
            ],
            [
                8686,
                8769
            ],
            [
                8769,
                8772
            ],
            [
                8772,
                8773
            ],
            [
                8773,
                8792
            ],
            [
                8792,
                8844
            ],
            [
                8844,
                8864
            ],
            [
                8864,
                8866
            ],
            [
                8874,
                8885
            ],
            [
                8894,
                8899
            ],
            [
                8905,
                8907
            ],
            [
                8907,
                8908
            ],
            [
                8908,
                8962
            ],
            [
                8962,
                8982
            ],
            [
                8982,
                9046
            ],
            [
                9046,
                9089
            ],
            [
                9090,
                9108
            ],
            [
                9109,
                9117
            ],
            [
                9117,
                9150
            ],
            [
                9150,
                9152
            ],
            [
                9152,
                9208
            ],
            [
                9208,
                9255
            ],
            [
                9256,
                9296
            ],
            [
                9296,
                9305
            ],
            [
                9311,
                9339
            ],
            [
                9339,
                9343
            ],
            [
                9344,
                9356
            ],
            [
                9356,
                9366
            ],
            [
                9366,
                9385
            ],
            [
                9393,
                9409
            ],
            [
                9411,
                9420
            ],
            [
                9420,
                9439
            ],
            [
                9440,
                9447
            ],
            [
                9448,
                9452
            ],
            [
                9470,
                9479
            ],
            [
                9479,
                9481
            ],
            [
                9485,
                9533
            ],
            [
                9534,
                9553
            ],
            [
                9553,
                9594
            ],
            [
                9594,
                9610
            ],
            [
                9610,
                9618
            ],
            [
                9619,
                9671
            ],
            [
                9671,
                9674
            ],
            [
                9680,
                9771
            ],
            [
                9771,
                9806
            ],
            [
                9807,
                9861
            ],
            [
                9861,
                9903
            ],
            [
                9903,
                9933
            ],
            [
                9933,
                9950
            ],
            [
                9950,
                9952
            ],
            [
                9952,
                9953
            ],
            [
                9954,
                9959
            ],
            [
                9960,
                9976
            ],
            [
                9976,
                10028
            ],
            [
                10028,
                10102
            ],
            [
                10102,
                10133
            ],
            [
                10144,
                10159
            ],
            [
                10159,
                10207
            ],
            [
                10210,
                10231
            ],
            [
                10237,
                10270
            ],
            [
                10270,
                10364
            ],
            [
                10364,
                10433
            ],
            [
                10433,
                10526
            ],
            [
                10536,
                10538
            ],
            [
                10539,
                10557
            ],
            [
                10561,
                10586
            ],
            [
                10586,
                10589
            ],
            [
                10589,
                10614
            ],
            [
                10614,
                10617
            ],
            [
                10678,
                10682
            ],
            [
                10697,
                10737
            ],
            [
                10738,
                10749
            ],
            [
                10750,
                10766
            ],
            [
                10766,
                10866
            ],
            [
                10866,
                10969
            ],
            [
                10970,
                10976
            ],
            [
                10977,
                10984
            ],
            [
                10985,
                11032
            ],
            [
                11032,
                11125
            ],
            [
                11126,
                11234
            ],
            [
                11236,
                11248
            ],
            [
                11248,
                11329
            ],
            [
                11329,
                11367
            ],
            [
                11367,
                11442
            ],
            [
                11442,
                11445
            ],
            [
                11446,
                11474
            ],
            [
                11474,
                11476
            ],
            [
                11476,
                11493
            ],
            [
                11493,
                11571
            ],
            [
                11572,
                11580
            ],
            [
                11581,
                11593
            ],
            [
                11594,
                11672
            ],
            [
                11673,
                11699
            ],
            [
                11706,
                11718
            ],
            [
                11718,
                11723
            ],
            [
                11724,
                11741
            ],
            [
                11742,
                11754
            ],
            [
                11755,
                11793
            ],
            [
                11795,
                11832
            ],
            [
                11832,
                11834
            ],
            [
                11834,
                11895
            ],
            [
                11895,
                11937
            ],
            [
                11941,
                11949
            ],
            [
                11950,
                11969
            ],
            [
                11969,
                11989
            ],
            [
                11989,
                12057
            ],
            [
                12057,
                12075
            ],
            [
                12076,
                12129
            ],
            [
                12129,
                12224
            ],
            [
                12225,
                12290
            ],
            [
                12299,
                12324
            ],
            [
                12324,
                12334
            ],
            [
                12343,
                12345
            ],
            [
                12345,
                12379
            ],
            [
                12379,
                12380
            ],
            [
                12381,
                12394
            ],
            [
                12395,
                12404
            ],
            [
                12408,
                12418
            ],
            [
                12418,
                12458
            ],
            [
                12459,
                12486
            ],
            [
                12487,
                12497
            ],
            [
                12497,
                12515
            ],
            [
                12521,
                12554
            ],
            [
                12554,
                12558
            ],
            [
                12559,
                12564
            ],
            [
                12565,
                12569
            ],
            [
                12570,
                12600
            ],
            [
                12600,
                12612
            ],
            [
                12613,
                12663
            ],
            [
                12663,
                12679
            ],
            [
                12680,
                12800
            ],
            [
                12801,
                12804
            ],
            [
                12820,
                12824
            ],
            [
                12825,
                12850
            ],
            [
                12850,
                12911
            ],
            [
                12915,
                12917
            ],
            [
                12917,
                12935
            ],
            [
                12935,
                12938
            ],
            [
                12938,
                12978
            ],
            [
                12979,
                13001
            ],
            [
                13001,
                13003
            ],
            [
                13003,
                13076
            ],
            [
                13076,
                13107
            ],
            [
                13107,
                13144
            ],
            [
                13144,
                13156
            ],
            [
                13156,
                13188
            ],
            [
                13190,
                13243
            ],
            [
                13244,
                13255
            ],
            [
                13255,
                13279
            ],
            [
                13279,
                13286
            ],
            [
                13287,
                13297
            ],
            [
                13304,
                13349
            ],
            [
                13349,
                13396
            ],
            [
                13396,
                13473
            ],
            [
                13473,
                13504
            ],
            [
                13504,
                13553
            ],
            [
                13553,
                13610
            ],
            [
                13610,
                13638
            ],
            [
                13638,
                13692
            ],
            [
                13699,
                13726
            ],
            [
                13726,
                13813
            ],
            [
                13813,
                13930
            ],
            [
                13930,
                13944
            ],
            [
                13953,
                14013
            ],
            [
                14014,
                14095
            ],
            [
                14095,
                14168
            ],
            [
                14168,
                14170
            ],
            [
                14170,
                14228
            ],
            [
                14232,
                14238
            ],
            [
                14243,
                14256
            ],
            [
                14256,
                14268
            ],
            [
                14274,
                14283
            ],
            [
                14283,
                14318
            ],
            [
                14318,
                14367
            ],
            [
                14368,
                14381
            ],
            [
                14382,
                14455
            ],
            [
                14455,
                14560
            ],
            [
                14560,
                14583
            ],
            [
                14589,
                14595
            ],
            [
                14596,
                14622
            ],
            [
                14622,
                14724
            ],
            [
                14724,
                14736
            ],
            [
                14737,
                14745
            ],
            [
                14746,
                14753
            ],
            [
                14753,
                14754
            ],
            [
                14771,
                14811
            ],
            [
                14820,
                14831
            ],
            [
                14831,
                14832
            ],
            [
                14838,
                14848
            ],
            [
                14849,
                14857
            ],
            [
                14858,
                14875
            ],
            [
                14876,
                14935
            ],
            [
                14935,
                14953
            ],
            [
                14954,
                14980
            ],
            [
                14980,
                14998
            ],
            [
                14999,
                15020
            ],
            [
                15021,
                15067
            ]
        ],
        "row_chars": [
            [
                0,
                85
            ],
            [
                85,
                181
            ],
            [
                181,
                257
            ],
            [
                257,
                257
            ],
            [
                257,
                370
            ],
            [
                370,
                370
            ],
            [
                370,
                455
            ],
            [
                455,
                564
            ],
            [
                564,
                564
            ],
            [
                564,
                664
            ],
            [
                664,
                741
            ],
            [
                741,
                778
            ],
            [
                778,
                817
            ],
            [
                817,
                861
            ],
            [
                861,
                941
            ],
            [
                941,
                1000
            ],
            [
                1000,
                1080
            ],
            [
                1080,
                1080
            ],
            [
                1080,
                1196
            ],
            [
                1196,
                1277
            ],
            [
                1277,
                1277
            ],
            [
                1277,
                1302
            ],
            [
                1302,
                1354
            ],
            [
                1354,
                1437
            ],
            [
                1437,
                1654
            ],
            [
                1654,
                1708
            ],
            [
                1708,
                1719
            ],
            [
                1719,
                1719
            ],
            [
                1719,
                1841
            ],
            [
                1841,
                1841
            ],
            [
                1841,
                1886
            ],
            [
                1886,
                1886
            ],
            [
                1886,
                1929
            ],
            [
                1929,
                1991
            ],
            [
                1991,
                2016
            ],
            [
                2016,
                2193
            ],
            [
                2193,
                2276
            ],
            [
                2276,
                2338
            ],
            [
                2338,
                2385
            ],
            [
                2385,
                2415
            ],
            [
                2415,
                2449
            ],
            [
                2449,
                2473
            ],
            [
                2473,
                2549
            ],
            [
                2549,
                2592
            ],
            [
                2592,
                2592
            ],
            [
                2592,
                2592
            ],
            [
                2592,
                2592
            ],
            [
                2592,
                2654
            ],
            [
                2654,
                2737
            ],
            [
                2737,
                2835
            ],
            [
                2835,
                2855
            ],
            [
                2855,
                2937
            ],
            [
                2937,
                2978
            ],
            [
                2978,
                3058
            ],
            [
                3058,
                3169
            ],
            [
                3169,
                3253
            ],
            [
                3253,
                3358
            ],
            [
                3358,
                3420
            ],
            [
                3420,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3561
            ],
            [
                3561,
                3601
            ],
            [
                3601,
                3713
            ],
            [
                3713,
                3823
            ],
            [
                3823,
                3905
            ],
            [
                3905,
                3931
            ],
            [
                3931,
                3989
            ],
            [
                3989,
                4053
            ],
            [
                4053,
                4076
            ],
            [
                4076,
                4076
            ],
            [
                4076,
                4076
            ],
            [
                4076,
                4172
            ],
            [
                4172,
                4228
            ],
            [
                4228,
                4228
            ],
            [
                4228,
                4228
            ],
            [
                4228,
                4286
            ],
            [
                4286,
                4324
            ],
            [
                4324,
                4342
            ],
            [
                4342,
                4401
            ],
            [
                4401,
                4471
            ],
            [
                4471,
                4484
            ],
            [
                4484,
                4511
            ],
            [
                4511,
                4562
            ],
            [
                4562,
                4613
            ],
            [
                4613,
                4682
            ],
            [
                4682,
                4682
            ],
            [
                4682,
                4753
            ],
            [
                4753,
                4764
            ],
            [
                4764,
                4793
            ],
            [
                4793,
                4942
            ],
            [
                4942,
                4979
            ],
            [
                4979,
                4986
            ],
            [
                4986,
                5125
            ],
            [
                5125,
                5146
            ],
            [
                5146,
                5236
            ],
            [
                5236,
                5265
            ],
            [
                5265,
                5281
            ],
            [
                5281,
                5321
            ],
            [
                5321,
                5392
            ],
            [
                5392,
                5479
            ],
            [
                5479,
                5513
            ],
            [
                5513,
                5563
            ],
            [
                5563,
                5710
            ],
            [
                5710,
                5779
            ],
            [
                5779,
                5801
            ],
            [
                5801,
                5871
            ],
            [
                5871,
                5899
            ],
            [
                5899,
                5899
            ],
            [
                5899,
                5899
            ],
            [
                5899,
                5899
            ],
            [
                5899,
                5997
            ],
            [
                5997,
                6052
            ],
            [
                6052,
                6156
            ],
            [
                6156,
                6192
            ],
            [
                6192,
                6361
            ],
            [
                6361,
                6361
            ],
            [
                6361,
                6402
            ],
            [
                6402,
                6438
            ],
            [
                6438,
                6570
            ],
            [
                6570,
                6602
            ],
            [
                6602,
                6622
            ],
            [
                6622,
                6661
            ],
            [
                6661,
                6767
            ],
            [
                6767,
                6852
            ],
            [
                6852,
                6881
            ],
            [
                6881,
                6902
            ],
            [
                6902,
                7007
            ],
            [
                7007,
                7007
            ],
            [
                7007,
                7063
            ],
            [
                7063,
                7137
            ],
            [
                7137,
                7190
            ],
            [
                7190,
                7311
            ],
            [
                7311,
                7324
            ],
            [
                7324,
                7392
            ],
            [
                7392,
                7404
            ],
            [
                7404,
                7440
            ],
            [
                7440,
                7587
            ],
            [
                7587,
                7770
            ],
            [
                7770,
                7831
            ],
            [
                7831,
                7864
            ],
            [
                7864,
                7938
            ],
            [
                7938,
                8026
            ],
            [
                8026,
                8056
            ],
            [
                8056,
                8097
            ],
            [
                8097,
                8097
            ],
            [
                8097,
                8134
            ],
            [
                8134,
                8253
            ],
            [
                8253,
                8340
            ],
            [
                8340,
                8374
            ],
            [
                8374,
                8393
            ],
            [
                8393,
                8436
            ],
            [
                8436,
                8532
            ],
            [
                8532,
                8563
            ],
            [
                8563,
                8686
            ],
            [
                8686,
                8772
            ],
            [
                8772,
                8792
            ],
            [
                8792,
                8844
            ],
            [
                8844,
                8864
            ],
            [
                8864,
                8907
            ],
            [
                8907,
                8962
            ],
            [
                8962,
                8982
            ],
            [
                8982,
                9046
            ],
            [
                9046,
                9117
            ],
            [
                9117,
                9152
            ],
            [
                9152,
                9208
            ],
            [
                9208,
                9296
            ],
            [
                9296,
                9339
            ],
            [
                9339,
                9356
            ],
            [
                9356,
                9366
            ],
            [
                9366,
                9420
            ],
            [
                9420,
                9481
            ],
            [
                9481,
                9481
            ],
            [
                9481,
                9553
            ],
            [
                9553,
                9594
            ],
            [
                9594,
                9610
            ],
            [
                9610,
                9671
            ],
            [
                9671,
                9771
            ],
            [
                9771,
                9861
            ],
            [
                9861,
                9903
            ],
            [
                9903,
                9933
            ],
            [
                9933,
                9952
            ],
            [
                9952,
                9976
            ],
            [
                9976,
                10028
            ],
            [
                10028,
                10102
            ],
            [
                10102,
                10159
            ],
            [
                10159,
                10231
            ],
            [
                10231,
                10231
            ],
            [
                10231,
                10231
            ],
            [
                10231,
                10231
            ],
            [
                10231,
                10364
            ],
            [
                10364,
                10433
            ],
            [
                10433,
                10589
            ],
            [
                10589,
                10617
            ],
            [
                10617,
                10617
            ],
            [
                10617,
                10617
            ],
            [
                10617,
                10866
            ],
            [
                10866,
                11032
            ],
            [
                11032,
                11126
            ],
            [
                11126,
                11248
            ],
            [
                11248,
                11329
            ],
            [
                11329,
                11329
            ],
            [
                11329,
                11329
            ],
            [
                11329,
                11329
            ],
            [
                11329,
                11367
            ],
            [
                11367,
                11442
            ],
            [
                11442,
                11476
            ],
            [
                11476,
                11493
            ],
            [
                11493,
                11572
            ],
            [
                11572,
                11742
            ],
            [
                11742,
                11834
            ],
            [
                11834,
                11895
            ],
            [
                11895,
                11969
            ],
            [
                11969,
                11969
            ],
            [
                11969,
                11989
            ],
            [
                11989,
                12057
            ],
            [
                12057,
                12129
            ],
            [
                12129,
                12225
            ],
            [
                12225,
                12324
            ],
            [
                12324,
                12381
            ],
            [
                12381,
                12418
            ],
            [
                12418,
                12497
            ],
            [
                12497,
                12554
            ],
            [
                12554,
                12600
            ],
            [
                12600,
                12663
            ],
            [
                12663,
                12663
            ],
            [
                12663,
                12663
            ],
            [
                12663,
                12825
            ],
            [
                12825,
                12850
            ],
            [
                12850,
                12917
            ],
            [
                12917,
                12917
            ],
            [
                12917,
                12938
            ],
            [
                12938,
                13003
            ],
            [
                13003,
                13003
            ],
            [
                13003,
                13076
            ],
            [
                13076,
                13107
            ],
            [
                13107,
                13144
            ],
            [
                13144,
                13190
            ],
            [
                13190,
                13190
            ],
            [
                13190,
                13190
            ],
            [
                13190,
                13255
            ],
            [
                13255,
                13279
            ],
            [
                13279,
                13349
            ],
            [
                13349,
                13396
            ],
            [
                13396,
                13473
            ],
            [
                13473,
                13504
            ],
            [
                13504,
                13553
            ],
            [
                13553,
                13610
            ],
            [
                13610,
                13638
            ],
            [
                13638,
                13726
            ],
            [
                13726,
                13813
            ],
            [
                13813,
                13930
            ],
            [
                13930,
                14014
            ],
            [
                14014,
                14095
            ],
            [
                14095,
                14170
            ],
            [
                14170,
                14256
            ],
            [
                14256,
                14318
            ],
            [
                14318,
                14455
            ],
            [
                14455,
                14560
            ],
            [
                14560,
                14724
            ],
            [
                14724,
                14833
            ],
            [
                14833,
                14833
            ],
            [
                14833,
                14935
            ],
            [
                14935,
                15067
            ]
        ]
    }
}