{
    "original": {
        "text": "When Mrs. Greenow was left alone in her lodgings, after the little entertainment which she had given to her two lovers, she sat herself down to think seriously over her affairs. There were three paths open before her. She might take Mr. Cheesacre, or she might take Captain Bellfield--or she might decide that she would have nothing more to say to either of them in the way of courting. They were very persistent, no doubt; but she thought that she would know how to make them understand her, if she should really make up her mind that she would have neither one nor the other. She was going to leave Norwich after Easter, and they knew that such was her purpose. Something had been said of her returning to Yarmouth in the summer. She was a just woman at heart, and justice required that each of them should know what was to be his prospect if she did so return.\nThere was a good deal to be said on Mr. Cheesacre's behalf. Mahogany-furnitured bedrooms assist one's comfort in this life; and heaps of manure, though they are not brilliant in romance, are very efficacious in farming. Mrs. Greenow by no means despised these things; and as for the owner of them, though she saw that there was much amiss in his character, she thought that his little foibles were of such a nature that she, as his wife, or any other woman of spirit, might be able to repress them, if not to cure them. But she had already married for money once, as she told herself very plainly on this occasion, and she thought that she might now venture on a little love. Her marriage for money had been altogether successful. The nursing of old Greenow had not been very disagreeable to her, nor had it taken longer than she had anticipated. She had now got all the reward that she had ever promised herself, and she really did feel grateful to his memory. I almost think that among those plentiful tears some few drops belonged to sincerity. She was essentially a happy-tempered woman, blessed with a good digestion, who looked back upon her past life with contentment, and forward to her future life with confidence. She would not be greedy, she said to herself. She did not want more money, and therefore she would have none of Mr. Cheesacre. So far she resolved,--resolving also that, if possible, the mahogany-furnitured bedrooms should be kept in the family, and made over to her niece, Kate Vavasor.\nBut should she marry for love; and if so, should Captain Bellfield be the man? Strange to say, his poverty and his scampishness and his lies almost recommended him to her. At any rate, it was not of those things that she was afraid. She had a woman's true belief in her own power, and thought that she could cure them,--as far as they needed cure. As for his stories about Inkerman, and his little debts, she cared nothing about that. She also had her Inkermans, and was quite aware that she made as good use of them as the Captain did of his. And as for the debts,--what was a man to do who hadn't got any money? She also had owed for her gloves and corsets in the ante-Greenow days of her adventures. But there was this danger,--that there might be more behind of which she had never heard. Another Mrs. Bellfield was not impossible; and what, if instead of being a real captain at all, he should be a returned ticket-of-leave man! Such things had happened. Her chief security was in this,--that Cheesacre had known the man for many years, and would certainly have told anything against him that he did know. Under all these circumstances, she could not quite make up her mind either for or against Captain Bellfield.\nBetween nine and ten in the evening, an hour or so after Mr. Cheesacre had left her, Jeannette brought to her some arrowroot with a little sherry in it. She usually dined early, and it was her habit to take a light repast before she retired for the night.\n\"Jeannette,\" she said, as she stirred the lumps of white sugar in the bowl, \"I'm afraid those two gentlemen have quarrelled.\"\n\"Oh, laws, ma'am, in course they have! How was they to help it?\"\nJeannette, on these occasions, was in the habit of standing beside the chair of her mistress, and chatting with her; and then, if the chatting was much prolonged, she would gradually sink down upon the corner of a chair herself,--and then the two women would be very comfortable together over the fire, Jeannette never forgetting that she was the servant, and Mrs. Greenow never forgetting that she was the mistress.\n\"And why should they quarrel, Jeannette? It's very foolish.\"\n\"I don't know about being foolish, ma'am; but it's the most natural thing in life. If I had two beaux as was a-courting me together, in course I should expect as they would punch each other's heads. There's some girls do it a purpose, because they like to see it. One at a time's what I say.\"\n\"You're a young thing, Jeannette.\"\n\"Well, ma'am--yes; I am young, no doubt. But I won't say but what I've had a beau, young as I look.\"\n\"But you don't suppose that I want beaux, as you call them?\"\n\"I don't know, ma'am, as you wants 'em exactly. That's as may be. There they are; and if they was to blow each other's brains out in the gig to-night, I shouldn't be a bit surprised for one. There's nothing won't quiet them at Oileymead to-night, if brandy-and-water don't do it.\" As she said this, Jeannette slipt into her chair, and held up her hands in token of the intensity of her fears.\n\"Why, you silly child, they're not going home together at all. Did not the Captain go away first?\"\n\"The Captain did go away first, certainly; but I thought perhaps it was to get his pistols and fighting things ready.\"\n\"They won't fight, Jeannette. Gentlemen have given over fighting.\"\n\"Have they, ma'am? That makes it much easier for ladies, no doubt. Perhaps them peaceable ways will come down to such as us in time. It'd be a comfort, I know, to them as are quiet given, like me. I hate to see men knocking each other's heads about,--I do. So Mr. Cheesacre and the Captain won't fight, ma'am?\"\n\"Of course they won't, you little fool, you.\"\n\"Dear, dear; I was so sure we should have had the papers all full of it,--and perhaps one of them stretched upon his bloody bier! I wonder which it would have been? I always made up my mind that the Captain wouldn't be wounded in any of his wital parts--unless it was his heart, you know, ma'am.\"\n\"But why should they quarrel at all, Jeannette? It is the most foolish thing.\"\n\"Well, ma'am, I don't know about that. What else is they to do? There's some things as you can cry halves about, but there's no crying halves about this.\"\n\"About what, Jeannette?\"--\"Why, about you, ma'am.\"\n\"Jeannette, I wonder how you can say such things; as if I, in my position, had ever said a word to encourage either of them. You know it's not true, Jeannette, and you shouldn't say so.\" Whereupon Mrs. Greenow put her handkerchief to her eyes, and Jeannette, probably in token of contrition, put her apron to hers.\n\"To be sure, ma'am, no lady could have behaved better through it than you have done, and goodness knows you have been tried hard.\"\n\"Indeed I have, Jeannette.\"\n\"And if gentlemen will make fools of themselves, it isn't your fault; is it, ma'am?\"\n\"But I'm so sorry that they should have quarrelled. They were such dear friends, you know;--quite all in all to each other.\"\n\"When you've settled which it's to be, ma'am, that'll all come right again,--seeing that gentlefolks like them have given up fighting, as you say.\" Then there was a little pause. \"I suppose, ma'am, it won't be Mr. Cheesacre? To be sure, he's a man as is uncommonly well to do in the world.\"\n\"What's all that to me, Jeannette? I shall ever regard Mr. Cheesacre as a dear friend who has been very good to me at a time of trouble; but he'll never be more than that.\"\n\"Then it'll be the Captain, ma'am? I'm sure, for my part, I've always thought the Captain was the nicer gentleman of the two,--and have always said so.\"\n\"He's nothing to me, girl.\"\n\"And as for money,--what's the good of having more than enough? If he can bring love, you can bring money; can't you, ma'am?\"\n\"He's nothing to me, girl,\" repeated Mrs. Greenow.\n\"But he will be?\" said Jeannette, plainly asking a question.\n\"Well, I'm sure! What's the world come to, I wonder, when you sit yourself down there, and cross-examine your mistress in that way! Get to bed, will you? It's near ten o'clock.\"\n\"I hope I haven't said anything amiss, ma'am;\" and Jeannette rose from her seat.\n\"It's my fault for encouraging you,\" said Mrs. Greenow. \"Go down-stairs and finish your work, do; and then take yourself off to bed. Next week we shall have to be packing up, and there'll be all my things to see to before that.\" So Jeannette got up and departed, and after some few further thoughts about Captain Bellfield, Mrs. Greenow herself went to her bedroom.\nMr. Cheesacre, when he drove back to Oileymead alone from Norwich, after dining with Mrs. Greenow, had kept himself hot, and almost comfortable, with passion against Bellfield; and his heat, if not his comfort, had been sustained by his seeing the Captain, with his portmanteau, escaping just as he reached his own homestead. But early on the following morning his mind reverted to Mrs. Greenow, and he remembered, with anything but satisfaction, some of the hard things which she had said to him. He had made mistakes in his manner of wooing. He was quite aware of that now, and was determined that they should be rectified for the future. She had rebuked him for having said nothing about his love. He would instantly mend that fault. And she had bidden him not to be so communicative about his wealth. Henceforth he would be dumb on that subject. Nevertheless, he could not but think that the knowledge of his circumstances which the lady already possessed, must be of service to him. \"She can't really like a poor beggarly wretch who hasn't got a shilling,\" he said to himself. He was very far from feeling that the battle was already lost. Her last word to him had been an assurance of her friendship; and then why should she have been at so much trouble to tell him the way in which he ought to address her if she were herself indifferent as to his addresses? He was, no doubt, becoming tired of his courtship, and heartily wished that the work were over; but he was not minded to give it up. He therefore prepared himself for another attack, and took himself into Norwich without seeking counsel from any one. He could not trust himself to think that she could really wish to refuse him after all the encouragement she had given him. On this occasion he put on no pink shirt or shiny boots, being deterred from doing so by a remembrance of Captain Bellfield's ridicule; but, nevertheless, he dressed himself with considerable care. He clothed his nether person in knickerbockers, with tight, leathern, bright-coloured gaiters round his legs, being conscious of certain manly graces and symmetrical proportions which might, as he thought, stand him in good stead. And he put on a new shooting-coat, the buttons on which were elaborate, and a wonderful waistcoat worked over with foxes' heads. He completed his toilet with a round, low-crowned hat, with dog's-skin gloves, and a cutting whip. Thus armed he went forth resolved to conquer or to die,--as far as death might result from any wound which Mrs. Greenow might be able to give him. He waited, on this occasion, for the coming of no market-day; indeed, the journey into the city was altogether special, and he was desirous that she should know that such was the case. He drove at a great pace into the inn-yard, threw his reins to the ostler, took just one glass of cherry-brandy at the bar, and then marched off across the market-place to the Close, with quiet and decisive steps.\n\"Is that you, Cheesacre?\" said a friendly voice, in one of the narrow streets. \"Who expected to see you in Norwich on a Thursday!\" It was Grimsby, the son of old Grimsby of Hatherwich, a country gentleman, and one, therefore, to whom Cheesacre would generally pay much respect; but on this occasion he did not even pull up for an instant, or moderate his pace. \"A little bit of private business,\" he said, and marched onwards with his head towards the Close. \"I'm not going to be afraid of a woman--not if I know it,\" he said to himself; but, nevertheless, at a certain pastrycook's, of whose shop he had knowledge, he pulled up and had another glass of cherry-brandy.\n\"Mrs. Greenow is at home,\" he said to Jeannette, not deigning to ask any question.\n\"Oh, yes, sir; she is at home,\" said Jeannette, conscious that some occasion had arrived; and in another second he was in the presence of his angel.\n\"Mr. Cheesacre, whoever expected to see you in Norwich on a Thursday?\" said the lady, as she welcomed him, using almost the same words as his friend had done in the street. Why should not he come into Norwich on a Thursday, as well as any one else? Did they suppose that he was tied for ever to his ploughs and carts? He was minded to conduct himself with a little spirit on this occasion, and to improve the opinion which Mrs. Greenow had formed about him. On this account he answered her somewhat boldly.\n\"There's no knowing when I may be in Norwich, Mrs. Greenow, or when I mayn't. I'm one of those men of whom nobody knows anything certain, except that I pay as I go.\" Then he remembered that he was not to make any more boasts about his money, and he endeavoured to cover the error. \"There's one other thing they may all know if they please, but we won't say what that is just at present.\"\n\"Won't you sit down, Mr. Cheesacre?\"\n\"Well,--thank you,--I will sit down for a few minutes if you'll let me, Mrs. Greenow. Mrs. Greenow, I'm in such a state of mind that I must put an end to it, or else I shall be going mad, and doing somebody a damage.\"\n\"Dear me! what has happened to you? You're going out shooting, presently; are you not?\" and Mrs. Greenow looked down at his garments.\n\"No, Mrs. Greenow, I'm not going out shooting. I put on these things because I thought I might take a shot as I came along. But I couldn't bring myself to do it, and then I wouldn't take them off again. What does it matter what a man wears?\"\n\"Not in the least, so long as he is decent.\"\n\"I'm sure I'm always that, Mrs. Greenow.\"\n\"Oh, dear, yes. More than that, I should say. I consider you to be rather gay in your attire.\"\n\"I don't pretend to anything of that kind, Mrs. Greenow. I like to be nice, and all that kind of thing. There are people who think that because a man farms his own land, he must be always in the muck. It is the case, of course, with those who have to make their rent and living out of it.\" Then he remembered that he was again treading on forbidden ground, and stopped himself. \"But it don't matter what a man wears if his heart isn't easy within him.\"\n\"I don't know why you should speak in that way, Mr. Cheesacre; but it's what I have felt every hour since--since Greenow left me.\"\nMr. Cheesacre was rather at a loss to know how he should begin. This allusion to the departed one did not at all assist him. He had so often told the widow that care killed a cat, and that a live dog was better than a dead lion; and had found so little efficacy in the proverbs, that he did not care to revert to them. He was aware that some more decided method of proceeding was now required. Little hints at love-making had been all very well in the earlier days of their acquaintance; but there must be something more than little hints before he could hope to bring the matter to a favourable conclusion. The widow herself had told him that he ought to talk about love; and he had taken two glasses of cherry-brandy, hoping that they might enable him to do so. He had put on a coat with brilliant buttons, and new knickerbockers, in order that he might be master of the occasion. He was resolved to call a spade a spade, and to speak boldly of his passion; but how was he to begin? There was the difficulty. He was now seated in a chair, and there he remained silent for a minute or two, while she smoothed her eyebrows with her handkerchief after her last slight ebullition of grief.\n\"Mrs. Greenow,\" he exclaimed at last, jumping up before her; \"dearest Mrs. Greenow; darling Mrs. Greenow, will you be my wife? There! I have said it at last, and I mean it. Everything that I've got shall be yours. Of course I speak specially of my hand and heart. As for love;--oh, Arabella, if you only knew me! I don't think there's a man in Norfolk better able to love a woman than I am. Ever since I first saw you at Yarmouth, I've been in love to that extent that I've not known what I've been about. If you'll ask them at home, they'll tell you that I've not been able to look after anything about the place,--not as it should be done. I haven't really. I don't suppose I've opened the wages book half a dozen times since last July.\"\n\"And has that been my fault, Mr. Cheesacre?\"\n\"Upon my word it has. I can't move about anywhere without thinking about you. My mind's made up; I won't stay at Oileymead unless you will come and be its mistress.\"\n\"Not stay at Oileymead?\"\n\"No, indeed. I'll let the place, and go and travel somewheres. What's the use of my hanging on there without the woman of my heart? I couldn't do it, Mrs. Greenow; I couldn't, indeed. Of course I've got everything there that money can buy,--but it's all of no use to a man that's in love. Do you know, I've come quite to despise money and stock, and all that sort of thing. I haven't had my banker's book home these last three months. Only think of that now.\"\n\"But how can I help you, Mr. Cheesacre?\"\n\"Just say one word, and the thing'll be done. Say you'll be my wife? I'll be so good to you. I will, indeed. As for your fortune, I don't care that for it! I'm not like somebody else; it's yourself I want. You shall be my pet, and my poppet, and my dearest little duck all the days of your life.\"\n\"No, Mr. Cheesacre; it cannot be.\"\n\"And why not? Look here, Arabella!\" At these words he rose from his chair, and coming immediately before her, went down on both knees so close to her as to prevent the possibility of her escaping from him. There could be no doubt as to the efficacy of the cherry-brandy. There he was, well down on his knees; but he had not got down so low without some little cracking and straining on the part of the gaiters with which his legs were encompassed. He, in his passion, had probably omitted to notice this; but Mrs. Greenow, who was more cool in her present temperament, was painfully aware that he might not be able to rise with ease.\n\"Mr. Cheesacre, don't make a fool of yourself. Get up,\" said she.\n\"Never, till you have told me that you will be mine!\"\n\"Then you'll remain there for ever, which will be inconvenient. I won't have you take hold of my hand, Mr. Cheesacre. I tell you to have done.\" Whereupon his grasp upon her hand was released; but he made no attempt to rise.\n\"I never saw a man look so much like a fool in my life,\" said she. \"If you don't get up, I'll push you over. There; don't you hear? There's somebody coming.\"\nBut Cheesacre, whose senses were less acute than the lady's, did not hear. \"I'll never get up,\" said he, \"till you have bid me hope.\"\n\"Bid you play the fiddle. Get away from my knees, at any rate. There;--he'll be in the room now before--\"\n[Illustration: Mr. Cheesacre disturbed.]\nCheesacre now did hear a sound of steps, and the door was opened while he made his first futile attempt to get back to a standing position. The door was opened, and Captain Bellfield entered. \"I beg ten thousand pardons,\" said he, \"but as I did not see Jeannette, I ventured to come in. May I venture to congratulate my friend Cheesacre on his success?\"\nIn the meantime Cheesacre had risen; but he had done so slowly, and with evident difficulty. \"I'll trouble you to leave the room, Captain Bellfield,\" said he. \"I'm particularly engaged with Mrs. Greenow, as any gentleman might have seen.\"\n\"There wasn't the slightest difficulty in seeing it, old fellow,\" said the Captain. \"Shall I wish you joy?\"\n\"I'll trouble you to leave the room, sir,\" said Cheesacre, walking up to him.\n\"Certainly, if Mrs. Greenow will desire me to do so,\" said the Captain.\nThen Mrs. Greenow felt herself called upon to speak.\n\"Gentlemen, I must beg that you will not make my drawing-room a place for quarrelling. Captain Bellfield, lest there should be any misconception, I must beg you to understand that the position in which you found Mr. Cheesacre was one altogether of his own seeking. It was not with my consent that he was there.\"\n\"I can easily believe that, Mrs. Greenow,\" said the Captain.\n\"Who cares what you believe, sir?\" said Mr. Cheesacre.\n\"Gentlemen! gentlemen! this is really unkind. Captain Bellfield, I think I had better ask you to withdraw.\"\n\"By all means,\" said Mr. Cheesacre.\n\"As it is absolutely necessary that I should give Mr. Cheesacre a definite answer after what has occurred--\"\n\"Of course,\" said Captain Bellfield, preparing to go. \"I'll take another opportunity of paying my respects to you. Perhaps I might be allowed to come this evening?\"\nTo this Mrs. Greenow half assented with an uncertain nod, and then the Captain went. As soon as the door was closed behind his back, Mr. Cheesacre again prepared to throw himself into his former position, but to this Mrs. Greenow decidedly objected. If he were allowed to go down again, there was no knowing what force might be necessary to raise him. \"Mr. Cheesacre,\" she said, \"let there be an end to this little farce between us.\"\n\"Farce!\" said he, standing with his hand on his heart, and his legs and knickerbockers well displayed.\n\"It is certainly either a farce or a mistake. If the latter,--and I have been at all to blame,--I ask your pardon most sincerely.\"\n\"But you'll be Mrs. Cheesacre; won't you?\"\n\"No, Mr. Cheesacre; no. One husband is enough for any woman, and mine lies buried at Birmingham.\"\n\"Oh, damn it!\" said he, in utter disgust at this further reference to Mr. Greenow. The expression, at such a moment, militated against courtesy; but even Mrs. Greenow herself felt that the poor man had been subjected to provocation.\n\"Let us part friends,\" said she, offering him her hand.\nBut he turned his back upon her, for there was something in his eye that he wanted to hide. I believe that he really did love her, and that at this moment he would have taken her, even though he had learned that her fortune was gone.\n\"Will you not give me your hand,\" said she, \"in token that there is no anger between us?\"\n\"Do think about it again--do!\" said he. \"If there's anything you like to have changed, I'll change it at once. I'll give up Oileymead altogether, if you don't like being so near the farm-yard. I'll give up anything; so I will. Mrs. Greenow, if you only knew how I've set my heart upon it!\" And now, though his back was turned, the whimpering of his voice told plainly that tears were in his eyes.\nShe was a little touched. No woman would feel disposed to marry a man simply because he cried, and perhaps few women would be less likely to give way to such tenderness than Mrs. Greenow. She understood men and women too well, and had seen too much both of the world's rough side and of its smooth side to fall into such a blunder as that; but she was touched. \"My friend,\" she said, putting her hand upon his arm, \"think no more of it.\"\n\"But I can't help thinking of it,\" said he, almost blubbering in his earnestness.\n\"No, no, no,\" said she, still touching him with her hand. \"Why, Mr. Cheesacre, how can you bring yourself to care for an old woman like me, when so many pretty young ladies would give their eyes to get a kind word from you?\"\n\"I don't want any young lady,\" said he.\n\"There's Charlie Fairstairs, who would make as good a wife as any girl I know.\"\n\"Psha! Charlie Fairstairs, indeed!\" The very idea of having such a bride palmed off upon him did something to restore him to his manly courage.\n\"Or my niece, Kate Vavasor, who has a nice little fortune of her own, and who is as accomplished as she is good-looking.\"\n\"She's nothing to me, Mrs. Greenow.\"\n\"That's because you never asked her to be anything. If I get her to come back to Yarmouth next summer, will you think about it? You want a wife, and you couldn't do better if you searched all England over. It would be so pleasant for us to be such near friends; wouldn't it?\" And again she put her hand upon his arm.\n\"Mrs. Greenow, just at present there's only one woman in the world that I can think of.\"\n\"And that's my niece.\"\n\"And that's yourself. I'm a broken-hearted man,--I am, indeed. I didn't ever think I should feel so much about a thing of the kind--I didn't, really. I hardly know what to do with myself; but I suppose I'd better go back to Oileymead.\" He had become so painfully unconscious of his new coat and his knickerbockers that it was impossible not to pity him. \"I shall always hate the place now,\" he said,--\"always.\"\n\"That will pass away. You'd be as happy as a king there, if you'd take Kate for your queen.\"\n\"And what'll you do, Mrs. Greenow?\"\n\"What shall I do?\"--\"Yes; what will you do?\"\n\"That is, if you marry Kate? Why, I'll come and stay with you half my time, and nurse the children, as an old grand-aunt should.\"\n\"But about--.\" Then he hesitated, and she asked him of what he was thinking.\n\"You don't mean to take that man Bellfield, do you?\"\n\"Come, Mr. Cheesacre, that's rank jealousy. What right can you have to ask me whether I shall take any man or no man? The chances are that I shall remain as I am till I'm carried to my grave; but I'm not going to give any pledge about it to you or to any one.\"\n\"You don't know that man, Mrs. Greenow; you don't, indeed. I tell it you as your friend. Does not it stand to reason, when he has got nothing in the world, that he must be a beggar? It's all very well saying that when a man is courting a lady, he shouldn't say much about his money; but you won't make me believe that any man will make a good husband who hasn't got a shilling. And for lies, there's no beating him!\"\n\"Why, then, has he been such a friend of yours?\"\n\"Well, because I've been foolish. I took up with him just because he looked pleasant, I suppose.\"\n\"And you want to prevent me from doing the same thing.\"\n\"If you were to marry him, Mrs. Greenow, it's my belief I should do him a mischief; it is, really. I don't think I could stand it;--a mean, skulking beggar! I suppose I'd better go now?\"\n\"Certainly, if that's the way you choose to talk about my friends.\"\n\"Friends, indeed! Well, I won't say any more at present. I suppose if I was to talk for ever it wouldn't be any good?\"\n\"Come and talk to Kate Vavasor for ever, Mr. Cheesacre.\"\nTo this he made no reply, but went forth from the house, and got his gig, and drove himself home to Oileymead, thinking of his disappointment with all the bitterness of a young lover. \"I didn't ever think I should ever care so much about anything,\" he said, as he took himself up to bed that night.\nThat evening Captain Bellfield did call in the Close, as he had said he would do, but he was not admitted. \"Her mistress was very bad with a headache,\" Jeannette said.",
        "paragraph_chars": [
            [
                0,
                864
            ],
            [
                864,
                2376
            ],
            [
                2376,
                3596
            ],
            [
                3596,
                3852
            ],
            [
                3852,
                3978
            ],
            [
                3978,
                4043
            ],
            [
                4043,
                4460
            ],
            [
                4460,
                4521
            ],
            [
                4521,
                4814
            ],
            [
                4814,
                4849
            ],
            [
                4849,
                4950
            ],
            [
                4950,
                5011
            ],
            [
                5011,
                5404
            ],
            [
                5404,
                5503
            ],
            [
                5503,
                5622
            ],
            [
                5622,
                5689
            ],
            [
                5689,
                6000
            ],
            [
                6000,
                6046
            ],
            [
                6046,
                6343
            ],
            [
                6343,
                6422
            ],
            [
                6422,
                6577
            ],
            [
                6577,
                6628
            ],
            [
                6628,
                6943
            ],
            [
                6943,
                7074
            ],
            [
                7074,
                7102
            ],
            [
                7102,
                7187
            ],
            [
                7187,
                7312
            ],
            [
                7312,
                7603
            ],
            [
                7603,
                7776
            ],
            [
                7776,
                7929
            ],
            [
                7929,
                7957
            ],
            [
                7957,
                8083
            ],
            [
                8083,
                8134
            ],
            [
                8134,
                8195
            ],
            [
                8195,
                8373
            ],
            [
                8373,
                8454
            ],
            [
                8454,
                8820
            ],
            [
                8820,
                11764
            ],
            [
                11764,
                12433
            ],
            [
                12433,
                12516
            ],
            [
                12516,
                12665
            ],
            [
                12665,
                13172
            ],
            [
                13172,
                13560
            ],
            [
                13560,
                13597
            ],
            [
                13597,
                13815
            ],
            [
                13815,
                13949
            ],
            [
                13949,
                14191
            ],
            [
                14191,
                14236
            ],
            [
                14236,
                14278
            ],
            [
                14278,
                14373
            ],
            [
                14373,
                14826
            ],
            [
                14826,
                14957
            ],
            [
                14957,
                16145
            ],
            [
                16145,
                16885
            ],
            [
                16885,
                16930
            ],
            [
                16930,
                17096
            ],
            [
                17096,
                17121
            ],
            [
                17121,
                17581
            ],
            [
                17581,
                17622
            ],
            [
                17622,
                17919
            ],
            [
                17919,
                17954
            ],
            [
                17954,
                18588
            ],
            [
                18588,
                18654
            ],
            [
                18654,
                18708
            ],
            [
                18708,
                18932
            ],
            [
                18932,
                19090
            ],
            [
                19090,
                19224
            ],
            [
                19224,
                19330
            ],
            [
                19330,
                19371
            ],
            [
                19371,
                19725
            ],
            [
                19725,
                19964
            ],
            [
                19964,
                20072
            ],
            [
                20072,
                20150
            ],
            [
                20150,
                20222
            ],
            [
                20222,
                20275
            ],
            [
                20275,
                20587
            ],
            [
                20587,
                20648
            ],
            [
                20648,
                20703
            ],
            [
                20703,
                20811
            ],
            [
                20811,
                20847
            ],
            [
                20847,
                20956
            ],
            [
                20956,
                21121
            ],
            [
                21121,
                21555
            ],
            [
                21555,
                21658
            ],
            [
                21658,
                21789
            ],
            [
                21789,
                21832
            ],
            [
                21832,
                21930
            ],
            [
                21930,
                22163
            ],
            [
                22163,
                22219
            ],
            [
                22219,
                22453
            ],
            [
                22453,
                22543
            ],
            [
                22543,
                22940
            ],
            [
                22940,
                23378
            ],
            [
                23378,
                23460
            ],
            [
                23460,
                23685
            ],
            [
                23685,
                23725
            ],
            [
                23725,
                23805
            ],
            [
                23805,
                23949
            ],
            [
                23949,
                24071
            ],
            [
                24071,
                24108
            ],
            [
                24108,
                24425
            ],
            [
                24425,
                24514
            ],
            [
                24514,
                24537
            ],
            [
                24537,
                24948
            ],
            [
                24948,
                25041
            ],
            [
                25041,
                25077
            ],
            [
                25077,
                25122
            ],
            [
                25122,
                25252
            ],
            [
                25252,
                25329
            ],
            [
                25329,
                25382
            ],
            [
                25382,
                25643
            ],
            [
                25643,
                26060
            ],
            [
                26060,
                26109
            ],
            [
                26109,
                26207
            ],
            [
                26207,
                26263
            ],
            [
                26263,
                26450
            ],
            [
                26450,
                26518
            ],
            [
                26518,
                26637
            ],
            [
                26637,
                26694
            ],
            [
                26694,
                26993
            ],
            [
                26993,
                27160
            ]
        ],
        "segment_chars": [
            [
                0,
                178
            ],
            [
                178,
                218
            ],
            [
                218,
                387
            ],
            [
                387,
                578
            ],
            [
                578,
                664
            ],
            [
                664,
                732
            ],
            [
                732,
                864
            ],
            [
                864,
                924
            ],
            [
                924,
                1084
            ],
            [
                1084,
                1384
            ],
            [
                1384,
                1540
            ],
            [
                1540,
                1595
            ],
            [
                1595,
                1711
            ],
            [
                1711,
                1826
            ],
            [
                1826,
                1912
            ],
            [
                1912,
                2088
            ],
            [
                2088,
                2134
            ],
            [
                2134,
                2215
            ],
            [
                2215,
                2376
            ],
            [
                2376,
                2455
            ],
            [
                2455,
                2548
            ],
            [
                2548,
                2609
            ],
            [
                2609,
                2724
            ],
            [
                2724,
                2811
            ],
            [
                2811,
                2920
            ],
            [
                2920,
                2990
            ],
            [
                2990,
                3079
            ],
            [
                3079,
                3169
            ],
            [
                3169,
                3310
            ],
            [
                3310,
                3336
            ],
            [
                3336,
                3487
            ],
            [
                3487,
                3596
            ],
            [
                3596,
                3749
            ],
            [
                3749,
                3852
            ],
            [
                3852,
                3978
            ],
            [
                3978,
                4017
            ],
            [
                4017,
                4043
            ],
            [
                4043,
                4460
            ],
            [
                4460,
                4501
            ],
            [
                4501,
                4521
            ],
            [
                4521,
                4604
            ],
            [
                4604,
                4720
            ],
            [
                4720,
                4785
            ],
            [
                4785,
                4814
            ],
            [
                4814,
                4849
            ],
            [
                4849,
                4890
            ],
            [
                4890,
                4950
            ],
            [
                4950,
                5011
            ],
            [
                5011,
                5059
            ],
            [
                5059,
                5077
            ],
            [
                5077,
                5202
            ],
            [
                5202,
                5292
            ],
            [
                5292,
                5404
            ],
            [
                5404,
                5467
            ],
            [
                5467,
                5503
            ],
            [
                5503,
                5622
            ],
            [
                5622,
                5652
            ],
            [
                5652,
                5689
            ],
            [
                5689,
                5708
            ],
            [
                5708,
                5756
            ],
            [
                5756,
                5822
            ],
            [
                5822,
                5886
            ],
            [
                5886,
                5946
            ],
            [
                5946,
                6000
            ],
            [
                6000,
                6046
            ],
            [
                6046,
                6176
            ],
            [
                6176,
                6211
            ],
            [
                6211,
                6343
            ],
            [
                6343,
                6391
            ],
            [
                6391,
                6422
            ],
            [
                6422,
                6461
            ],
            [
                6461,
                6486
            ],
            [
                6486,
                6577
            ],
            [
                6577,
                6601
            ],
            [
                6601,
                6628
            ],
            [
                6628,
                6753
            ],
            [
                6753,
                6815
            ],
            [
                6815,
                6943
            ],
            [
                6943,
                7074
            ],
            [
                7074,
                7102
            ],
            [
                7102,
                7187
            ],
            [
                7187,
                7239
            ],
            [
                7239,
                7312
            ],
            [
                7312,
                7460
            ],
            [
                7460,
                7491
            ],
            [
                7491,
                7537
            ],
            [
                7537,
                7603
            ],
            [
                7603,
                7638
            ],
            [
                7638,
                7776
            ],
            [
                7776,
                7811
            ],
            [
                7811,
                7929
            ],
            [
                7929,
                7957
            ],
            [
                7957,
                8021
            ],
            [
                8021,
                8083
            ],
            [
                8083,
                8134
            ],
            [
                8134,
                8152
            ],
            [
                8152,
                8195
            ],
            [
                8195,
                8212
            ],
            [
                8212,
                8327
            ],
            [
                8327,
                8349
            ],
            [
                8349,
                8373
            ],
            [
                8373,
                8454
            ],
            [
                8454,
                8510
            ],
            [
                8510,
                8587
            ],
            [
                8587,
                8683
            ],
            [
                8683,
                8820
            ],
            [
                8820,
                9146
            ],
            [
                9146,
                9318
            ],
            [
                9318,
                9364
            ],
            [
                9364,
                9461
            ],
            [
                9461,
                9521
            ],
            [
                9521,
                9557
            ],
            [
                9557,
                9625
            ],
            [
                9625,
                9670
            ],
            [
                9670,
                9808
            ],
            [
                9808,
                9902
            ],
            [
                9902,
                9965
            ],
            [
                9965,
                10186
            ],
            [
                10186,
                10319
            ],
            [
                10319,
                10437
            ],
            [
                10437,
                10561
            ],
            [
                10561,
                10759
            ],
            [
                10759,
                10990
            ],
            [
                10990,
                11119
            ],
            [
                11119,
                11218
            ],
            [
                11218,
                11365
            ],
            [
                11365,
                11550
            ],
            [
                11550,
                11764
            ],
            [
                11764,
                11790
            ],
            [
                11790,
                11843
            ],
            [
                11843,
                11895
            ],
            [
                11895,
                12125
            ],
            [
                12125,
                12223
            ],
            [
                12223,
                12433
            ],
            [
                12433,
                12516
            ],
            [
                12516,
                12665
            ],
            [
                12665,
                12736
            ],
            [
                12736,
                12838
            ],
            [
                12838,
                12914
            ],
            [
                12914,
                12983
            ],
            [
                12983,
                13123
            ],
            [
                13123,
                13172
            ],
            [
                13172,
                13250
            ],
            [
                13250,
                13338
            ],
            [
                13338,
                13453
            ],
            [
                13453,
                13560
            ],
            [
                13560,
                13597
            ],
            [
                13597,
                13683
            ],
            [
                13683,
                13815
            ],
            [
                13815,
                13825
            ],
            [
                13825,
                13851
            ],
            [
                13851,
                13903
            ],
            [
                13903,
                13949
            ],
            [
                13949,
                13996
            ],
            [
                13996,
                14073
            ],
            [
                14073,
                14152
            ],
            [
                14152,
                14191
            ],
            [
                14191,
                14236
            ],
            [
                14236,
                14278
            ],
            [
                14278,
                14294
            ],
            [
                14294,
                14324
            ],
            [
                14324,
                14373
            ],
            [
                14373,
                14430
            ],
            [
                14430,
                14477
            ],
            [
                14477,
                14574
            ],
            [
                14574,
                14663
            ],
            [
                14663,
                14751
            ],
            [
                14751,
                14826
            ],
            [
                14826,
                14957
            ],
            [
                14957,
                15021
            ],
            [
                15021,
                15082
            ],
            [
                15082,
                15276
            ],
            [
                15276,
                15351
            ],
            [
                15351,
                15565
            ],
            [
                15565,
                15721
            ],
            [
                15721,
                15840
            ],
            [
                15840,
                15942
            ],
            [
                15942,
                15968
            ],
            [
                15968,
                16145
            ],
            [
                16145,
                16272
            ],
            [
                16272,
                16279
            ],
            [
                16279,
                16318
            ],
            [
                16318,
                16359
            ],
            [
                16359,
                16409
            ],
            [
                16409,
                16458
            ],
            [
                16458,
                16536
            ],
            [
                16536,
                16651
            ],
            [
                16651,
                16787
            ],
            [
                16787,
                16805
            ],
            [
                16805,
                16885
            ],
            [
                16885,
                16930
            ],
            [
                16930,
                16952
            ],
            [
                16952,
                17008
            ],
            [
                17008,
                17096
            ],
            [
                17096,
                17121
            ],
            [
                17121,
                17134
            ],
            [
                17134,
                17184
            ],
            [
                17184,
                17253
            ],
            [
                17253,
                17305
            ],
            [
                17305,
                17410
            ],
            [
                17410,
                17495
            ],
            [
                17495,
                17556
            ],
            [
                17556,
                17581
            ],
            [
                17581,
                17622
            ],
            [
                17622,
                17668
            ],
            [
                17668,
                17691
            ],
            [
                17691,
                17715
            ],
            [
                17715,
                17731
            ],
            [
                17731,
                17778
            ],
            [
                17778,
                17828
            ],
            [
                17828,
                17919
            ],
            [
                17919,
                17954
            ],
            [
                17954,
                17968
            ],
            [
                17968,
                17990
            ],
            [
                17990,
                18160
            ],
            [
                18160,
                18225
            ],
            [
                18225,
                18402
            ],
            [
                18402,
                18588
            ],
            [
                18588,
                18635
            ],
            [
                18635,
                18654
            ],
            [
                18654,
                18708
            ],
            [
                18708,
                18772
            ],
            [
                18772,
                18826
            ],
            [
                18826,
                18852
            ],
            [
                18852,
                18932
            ],
            [
                18932,
                18999
            ],
            [
                18999,
                19041
            ],
            [
                19041,
                19064
            ],
            [
                19064,
                19090
            ],
            [
                19090,
                19165
            ],
            [
                19165,
                19224
            ],
            [
                19224,
                19250
            ],
            [
                19250,
                19287
            ],
            [
                19287,
                19330
            ],
            [
                19330,
                19371
            ],
            [
                19371,
                19511
            ],
            [
                19511,
                19563
            ],
            [
                19563,
                19658
            ],
            [
                19658,
                19725
            ],
            [
                19725,
                19818
            ],
            [
                19818,
                19884
            ],
            [
                19884,
                19964
            ],
            [
                19964,
                20048
            ],
            [
                20048,
                20072
            ],
            [
                20072,
                20150
            ],
            [
                20150,
                20222
            ],
            [
                20222,
                20275
            ],
            [
                20275,
                20362
            ],
            [
                20362,
                20540
            ],
            [
                20540,
                20587
            ],
            [
                20587,
                20648
            ],
            [
                20648,
                20683
            ],
            [
                20683,
                20703
            ],
            [
                20703,
                20715
            ],
            [
                20715,
                20726
            ],
            [
                20726,
                20749
            ],
            [
                20749,
                20811
            ],
            [
                20811,
                20847
            ],
            [
                20847,
                20956
            ],
            [
                20956,
                21010
            ],
            [
                21010,
                21071
            ],
            [
                21071,
                21121
            ],
            [
                21121,
                21206
            ],
            [
                21206,
                21371
            ],
            [
                21371,
                21473
            ],
            [
                21473,
                21555
            ],
            [
                21555,
                21564
            ],
            [
                21564,
                21658
            ],
            [
                21658,
                21704
            ],
            [
                21704,
                21789
            ],
            [
                21789,
                21832
            ],
            [
                21832,
                21856
            ],
            [
                21856,
                21930
            ],
            [
                21930,
                21945
            ],
            [
                21945,
                22013
            ],
            [
                22013,
                22163
            ],
            [
                22163,
                22219
            ],
            [
                22219,
                22311
            ],
            [
                22311,
                22453
            ],
            [
                22453,
                22543
            ],
            [
                22543,
                22574
            ],
            [
                22574,
                22583
            ],
            [
                22583,
                22654
            ],
            [
                22654,
                22736
            ],
            [
                22736,
                22770
            ],
            [
                22770,
                22833
            ],
            [
                22833,
                22940
            ],
            [
                22940,
                22966
            ],
            [
                22966,
                23128
            ],
            [
                23128,
                23301
            ],
            [
                23301,
                23378
            ],
            [
                23378,
                23460
            ],
            [
                23460,
                23518
            ],
            [
                23518,
                23685
            ],
            [
                23685,
                23725
            ],
            [
                23725,
                23805
            ],
            [
                23805,
                23812
            ],
            [
                23812,
                23841
            ],
            [
                23841,
                23949
            ],
            [
                23949,
                24071
            ],
            [
                24071,
                24108
            ],
            [
                24108,
                24160
            ],
            [
                24160,
                24236
            ],
            [
                24236,
                24314
            ],
            [
                24314,
                24384
            ],
            [
                24384,
                24425
            ],
            [
                24425,
                24514
            ],
            [
                24514,
                24537
            ],
            [
                24537,
                24559
            ],
            [
                24559,
                24600
            ],
            [
                24600,
                24687
            ],
            [
                24687,
                24773
            ],
            [
                24773,
                24891
            ],
            [
                24891,
                24948
            ],
            [
                24948,
                24970
            ],
            [
                24970,
                25041
            ],
            [
                25041,
                25077
            ],
            [
                25077,
                25095
            ],
            [
                25095,
                25122
            ],
            [
                25122,
                25151
            ],
            [
                25151,
                25252
            ],
            [
                25252,
                25267
            ],
            [
                25267,
                25329
            ],
            [
                25329,
                25382
            ],
            [
                25382,
                25426
            ],
            [
                25426,
                25500
            ],
            [
                25500,
                25643
            ],
            [
                25643,
                25702
            ],
            [
                25702,
                25732
            ],
            [
                25732,
                25825
            ],
            [
                25825,
                26021
            ],
            [
                26021,
                26060
            ],
            [
                26060,
                26109
            ],
            [
                26109,
                26143
            ],
            [
                26143,
                26207
            ],
            [
                26207,
                26263
            ],
            [
                26263,
                26362
            ],
            [
                26362,
                26420
            ],
            [
                26420,
                26450
            ],
            [
                26450,
                26518
            ],
            [
                26518,
                26536
            ],
            [
                26536,
                26575
            ],
            [
                26575,
                26637
            ],
            [
                26637,
                26694
            ],
            [
                26694,
                26878
            ],
            [
                26878,
                26993
            ],
            [
                26993,
                27100
            ],
            [
                27100,
                27160
            ]
        ],
        "overlap_chars": [
            [
                0,
                66
            ],
            [
                104,
                127
            ],
            [
                136,
                149
            ],
            [
                176,
                178
            ],
            [
                178,
                218
            ],
            [
                218,
                283
            ],
            [
                285,
                297
            ],
            [
                385,
                387
            ],
            [
                578,
                636
            ],
            [
                662,
                664
            ],
            [
                664,
                687
            ],
            [
                691,
                732
            ],
            [
                732,
                766
            ],
            [
                784,
                793
            ],
            [
                802,
                813
            ],
            [
                829,
                852
            ],
            [
                856,
                864
            ],
            [
                864,
                924
            ],
            [
                924,
                952
            ],
            [
                1051,
                1059
            ],
            [
                986,
                1015
            ],
            [
                1025,
                1028
            ],
            [
                1049,
                1050
            ],
            [
                1021,
                1024
            ],
            [
                1072,
                1084
            ],
            [
                1084,
                1142
            ],
            [
                1147,
                1152
            ],
            [
                1160,
                1176
            ],
            [
                1192,
                1283
            ],
            [
                1296,
                1300
            ],
            [
                1321,
                1330
            ],
            [
                1332,
                1384
            ],
            [
                1384,
                1447
            ],
            [
                1477,
                1539
            ],
            [
                1540,
                1571
            ],
            [
                1583,
                1595
            ],
            [
                1595,
                1634
            ],
            [
                1640,
                1652
            ],
            [
                1659,
                1711
            ],
            [
                1711,
                1726
            ],
            [
                1735,
                1741
            ],
            [
                1776,
                1826
            ],
            [
                1874,
                1878
            ],
            [
                1868,
                1873
            ],
            [
                1901,
                1912
            ],
            [
                1912,
                1940
            ],
            [
                1949,
                1954
            ],
            [
                1985,
                2088
            ],
            [
                2088,
                2134
            ],
            [
                2134,
                2215
            ],
            [
                2234,
                2235
            ],
            [
                2222,
                2225
            ],
            [
                2247,
                2251
            ],
            [
                2226,
                2234
            ],
            [
                2252,
                2376
            ],
            [
                2376,
                2396
            ],
            [
                2425,
                2442
            ],
            [
                2453,
                2455
            ],
            [
                2455,
                2486
            ],
            [
                2491,
                2507
            ],
            [
                2512,
                2548
            ],
            [
                2593,
                2600
            ],
            [
                2568,
                2571
            ],
            [
                2601,
                2607
            ],
            [
                2572,
                2574
            ],
            [
                2609,
                2612
            ],
            [
                2661,
                2693
            ],
            [
                2706,
                2717
            ],
            [
                2722,
                2724
            ],
            [
                2724,
                2811
            ],
            [
                2811,
                2842
            ],
            [
                2864,
                2867
            ],
            [
                2999,
                3007
            ],
            [
                2983,
                2988
            ],
            [
                3008,
                3059
            ],
            [
                2918,
                2919
            ],
            [
                3079,
                3082
            ],
            [
                3089,
                3092
            ],
            [
                3098,
                3104
            ],
            [
                3107,
                3138
            ],
            [
                3104,
                3105
            ],
            [
                3139,
                3169
            ],
            [
                3169,
                3220
            ],
            [
                3222,
                3224
            ],
            [
                3265,
                3274
            ],
            [
                3275,
                3277
            ],
            [
                3242,
                3263
            ],
            [
                3308,
                3310
            ],
            [
                3310,
                3336
            ],
            [
                3336,
                3366
            ],
            [
                3369,
                3476
            ],
            [
                3485,
                3486
            ],
            [
                3596,
                3631
            ],
            [
                3679,
                3725
            ],
            [
                3735,
                3741
            ],
            [
                3631,
                3632
            ],
            [
                3778,
                3802
            ],
            [
                3818,
                3824
            ],
            [
                3837,
                3852
            ],
            [
                3852,
                3889
            ],
            [
                3918,
                3978
            ],
            [
                3978,
                3981
            ],
            [
                3987,
                3995
            ],
            [
                3999,
                4017
            ],
            [
                4017,
                4043
            ],
            [
                4043,
                4073
            ],
            [
                4123,
                4135
            ],
            [
                4114,
                4119
            ],
            [
                4135,
                4136
            ],
            [
                4141,
                4163
            ],
            [
                4170,
                4270
            ],
            [
                4273,
                4460
            ],
            [
                4460,
                4461
            ],
            [
                4465,
                4501
            ],
            [
                4501,
                4521
            ],
            [
                4521,
                4571
            ],
            [
                4581,
                4588
            ],
            [
                4602,
                4604
            ],
            [
                4604,
                4653
            ],
            [
                4664,
                4718
            ],
            [
                4950,
                5011
            ],
            [
                5011,
                5012
            ],
            [
                5059,
                5075
            ],
            [
                5024,
                5031
            ],
            [
                5075,
                5077
            ],
            [
                5083,
                5151
            ],
            [
                5160,
                5192
            ],
            [
                5292,
                5319
            ],
            [
                5326,
                5340
            ],
            [
                5402,
                5404
            ],
            [
                5404,
                5458
            ],
            [
                5465,
                5467
            ],
            [
                5467,
                5503
            ],
            [
                5503,
                5504
            ],
            [
                5516,
                5519
            ],
            [
                5533,
                5534
            ],
            [
                5546,
                5593
            ],
            [
                5614,
                5622
            ],
            [
                5622,
                5652
            ],
            [
                5652,
                5689
            ],
            [
                6046,
                6102
            ],
            [
                6107,
                6118
            ],
            [
                6120,
                6176
            ],
            [
                6176,
                6211
            ],
            [
                6211,
                6272
            ],
            [
                6340,
                6343
            ],
            [
                6343,
                6391
            ],
            [
                6391,
                6419
            ],
            [
                6640,
                6641
            ],
            [
                6712,
                6753
            ],
            [
                6753,
                6761
            ],
            [
                6803,
                6805
            ],
            [
                6775,
                6786
            ],
            [
                6812,
                6815
            ],
            [
                6825,
                6870
            ],
            [
                6941,
                6943
            ],
            [
                6943,
                6996
            ],
            [
                7008,
                7026
            ],
            [
                7107,
                7187
            ],
            [
                7187,
                7239
            ],
            [
                7239,
                7276
            ],
            [
                7309,
                7312
            ],
            [
                7312,
                7386
            ],
            [
                7457,
                7460
            ],
            [
                7460,
                7491
            ],
            [
                7491,
                7535
            ],
            [
                7638,
                7645
            ],
            [
                7651,
                7688
            ],
            [
                7738,
                7776
            ],
            [
                7776,
                7811
            ],
            [
                7811,
                7889
            ],
            [
                7926,
                7929
            ],
            [
                7929,
                7957
            ],
            [
                7957,
                7974
            ],
            [
                7977,
                8021
            ],
            [
                8021,
                8083
            ],
            [
                8083,
                8134
            ],
            [
                8134,
                8152
            ],
            [
                8157,
                8166
            ],
            [
                8193,
                8195
            ],
            [
                8195,
                8212
            ],
            [
                8212,
                8237
            ],
            [
                8248,
                8256
            ],
            [
                8286,
                8327
            ],
            [
                8327,
                8349
            ],
            [
                8349,
                8370
            ],
            [
                8587,
                8605
            ],
            [
                8614,
                8668
            ],
            [
                8680,
                8682
            ],
            [
                8683,
                8695
            ],
            [
                8707,
                8731
            ],
            [
                8736,
                8743
            ],
            [
                8753,
                8790
            ],
            [
                8799,
                8810
            ],
            [
                8818,
                8820
            ],
            [
                8820,
                8872
            ],
            [
                8917,
                8939
            ],
            [
                8965,
                9009
            ],
            [
                9031,
                9130
            ],
            [
                9144,
                9146
            ],
            [
                9146,
                9180
            ],
            [
                9202,
                9233
            ],
            [
                9267,
                9317
            ],
            [
                9318,
                9364
            ],
            [
                9364,
                9414
            ],
            [
                9459,
                9461
            ],
            [
                9461,
                9484
            ],
            [
                9497,
                9521
            ],
            [
                9521,
                9557
            ],
            [
                9557,
                9586
            ],
            [
                9590,
                9592
            ],
            [
                9607,
                9625
            ],
            [
                9625,
                9670
            ],
            [
                9670,
                9686
            ],
            [
                9885,
                9900
            ],
            [
                9779,
                9780
            ],
            [
                9808,
                9879
            ],
            [
                9902,
                9950
            ],
            [
                9959,
                9965
            ],
            [
                9965,
                10025
            ],
            [
                10186,
                10221
            ],
            [
                10226,
                10318
            ],
            [
                10319,
                10321
            ],
            [
                10332,
                10385
            ],
            [
                10391,
                10398
            ],
            [
                10435,
                10437
            ],
            [
                10561,
                10577
            ],
            [
                10716,
                10757
            ],
            [
                10616,
                10617
            ],
            [
                10788,
                10818
            ],
            [
                10829,
                10835
            ],
            [
                10700,
                10701
            ],
            [
                10819,
                10826
            ],
            [
                10845,
                10868
            ],
            [
                10770,
                10773
            ],
            [
                10896,
                10901
            ],
            [
                10925,
                10936
            ],
            [
                10943,
                10948
            ],
            [
                10965,
                10990
            ],
            [
                10990,
                11024
            ],
            [
                11062,
                11087
            ],
            [
                11100,
                11119
            ],
            [
                11119,
                11135
            ],
            [
                11143,
                11155
            ],
            [
                11169,
                11173
            ],
            [
                11179,
                11182
            ],
            [
                11184,
                11203
            ],
            [
                11212,
                11217
            ],
            [
                11218,
                11272
            ],
            [
                11363,
                11365
            ],
            [
                11550,
                11629
            ],
            [
                11635,
                11731
            ],
            [
                11733,
                11737
            ],
            [
                11748,
                11762
            ],
            [
                11731,
                11732
            ],
            [
                12321,
                12325
            ],
            [
                12334,
                12346
            ],
            [
                12063,
                12065
            ],
            [
                12397,
                12433
            ],
            [
                12460,
                12462
            ],
            [
                12450,
                12452
            ],
            [
                12480,
                12481
            ],
            [
                12606,
                12627
            ],
            [
                12631,
                12665
            ],
            [
                12665,
                12736
            ],
            [
                12736,
                12749
            ],
            [
                12836,
                12837
            ],
            [
                13139,
                13150
            ],
            [
                13164,
                13171
            ],
            [
                13172,
                13230
            ],
            [
                13248,
                13250
            ],
            [
                13250,
                13338
            ],
            [
                13338,
                13412
            ],
            [
                13451,
                13453
            ],
            [
                13453,
                13560
            ],
            [
                13560,
                13597
            ],
            [
                13597,
                13603
            ],
            [
                13605,
                13615
            ],
            [
                13617,
                13650
            ],
            [
                13681,
                13683
            ],
            [
                13683,
                13770
            ],
            [
                13780,
                13788
            ],
            [
                13795,
                13815
            ],
            [
                13815,
                13825
            ],
            [
                13825,
                13851
            ],
            [
                13851,
                13876
            ],
            [
                13876,
                13877
            ],
            [
                13889,
                13903
            ],
            [
                13903,
                13926
            ],
            [
                13932,
                13938
            ],
            [
                13947,
                13949
            ],
            [
                13949,
                13981
            ],
            [
                13986,
                13996
            ],
            [
                14430,
                14477
            ],
            [
                14477,
                14574
            ],
            [
                14752,
                14812
            ],
            [
                14823,
                14826
            ],
            [
                14826,
                14931
            ],
            [
                14933,
                14957
            ],
            [
                15021,
                15062
            ],
            [
                15080,
                15082
            ],
            [
                15276,
                15278
            ],
            [
                15289,
                15298
            ],
            [
                15304,
                15336
            ],
            [
                15341,
                15351
            ],
            [
                15351,
                15401
            ],
            [
                15409,
                15416
            ],
            [
                15443,
                15448
            ],
            [
                15449,
                15462
            ],
            [
                15473,
                15495
            ],
            [
                15563,
                15565
            ],
            [
                15565,
                15721
            ],
            [
                15840,
                15858
            ],
            [
                15888,
                15900
            ],
            [
                15915,
                15942
            ],
            [
                15942,
                15968
            ],
            [
                16008,
                16046
            ],
            [
                16143,
                16144
            ],
            [
                16191,
                16204
            ],
            [
                16240,
                16241
            ],
            [
                16145,
                16173
            ],
            [
                16181,
                16182
            ],
            [
                16206,
                16228
            ],
            [
                16251,
                16272
            ],
            [
                16272,
                16279
            ],
            [
                16279,
                16293
            ],
            [
                16301,
                16318
            ],
            [
                16318,
                16359
            ],
            [
                16409,
                16421
            ],
            [
                16423,
                16458
            ],
            [
                16458,
                16536
            ],
            [
                16536,
                16635
            ],
            [
                16644,
                16651
            ],
            [
                16787,
                16803
            ],
            [
                16885,
                16886
            ],
            [
                16890,
                16930
            ],
            [
                16930,
                16952
            ],
            [
                16952,
                16964
            ],
            [
                16971,
                17008
            ],
            [
                17008,
                17096
            ],
            [
                17096,
                17121
            ],
            [
                17121,
                17134
            ],
            [
                17134,
                17171
            ],
            [
                17182,
                17184
            ],
            [
                17184,
                17253
            ],
            [
                17253,
                17283
            ],
            [
                17303,
                17305
            ],
            [
                17305,
                17359
            ],
            [
                17362,
                17410
            ],
            [
                17410,
                17459
            ],
            [
                17471,
                17495
            ],
            [
                17495,
                17556
            ],
            [
                17556,
                17581
            ],
            [
                17581,
                17622
            ],
            [
                17668,
                17691
            ],
            [
                17691,
                17715
            ],
            [
                17731,
                17778
            ],
            [
                17778,
                17828
            ],
            [
                17828,
                17919
            ],
            [
                17919,
                17954
            ],
            [
                17954,
                17968
            ],
            [
                17968,
                17990
            ],
            [
                18005,
                18032
            ],
            [
                18064,
                18103
            ],
            [
                18158,
                18160
            ],
            [
                18160,
                18183
            ],
            [
                18190,
                18225
            ],
            [
                18225,
                18230
            ],
            [
                18234,
                18237
            ],
            [
                18302,
                18336
            ],
            [
                18349,
                18351
            ],
            [
                18252,
                18255
            ],
            [
                18356,
                18363
            ],
            [
                18231,
                18233
            ],
            [
                18400,
                18402
            ],
            [
                18402,
                18404
            ],
            [
                18446,
                18475
            ],
            [
                18523,
                18588
            ],
            [
                18588,
                18635
            ],
            [
                18635,
                18654
            ],
            [
                18654,
                18708
            ],
            [
                18708,
                18772
            ],
            [
                18777,
                18779
            ],
            [
                18789,
                18793
            ],
            [
                18802,
                18826
            ],
            [
                18826,
                18839
            ],
            [
                18849,
                18851
            ],
            [
                18904,
                18906
            ],
            [
                18890,
                18898
            ],
            [
                18877,
                18885
            ],
            [
                18900,
                18903
            ],
            [
                18907,
                18932
            ],
            [
                18932,
                18999
            ],
            [
                18999,
                19041
            ],
            [
                19048,
                19064
            ],
            [
                19064,
                19090
            ],
            [
                19090,
                19103
            ],
            [
                19151,
                19165
            ],
            [
                19165,
                19224
            ],
            [
                19224,
                19250
            ],
            [
                19250,
                19272
            ],
            [
                19285,
                19287
            ],
            [
                19287,
                19293
            ],
            [
                19295,
                19326
            ],
            [
                19371,
                19393
            ],
            [
                19410,
                19424
            ],
            [
                19429,
                19511
            ],
            [
                19544,
                19562
            ],
            [
                19563,
                19658
            ],
            [
                19658,
                19663
            ],
            [
                19675,
                19725
            ],
            [
                19725,
                19760
            ],
            [
                19787,
                19788
            ],
            [
                19793,
                19797
            ],
            [
                19806,
                19818
            ],
            [
                19818,
                19883
            ],
            [
                20150,
                20177
            ],
            [
                20190,
                20222
            ],
            [
                20227,
                20275
            ],
            [
                20362,
                20379
            ],
            [
                20419,
                20540
            ],
            [
                20540,
                20587
            ],
            [
                20587,
                20648
            ],
            [
                20648,
                20683
            ],
            [
                20683,
                20703
            ],
            [
                20703,
                20715
            ],
            [
                20715,
                20726
            ],
            [
                20726,
                20749
            ],
            [
                20749,
                20811
            ],
            [
                20811,
                20847
            ],
            [
                20847,
                20928
            ],
            [
                20956,
                21010
            ],
            [
                21071,
                21121
            ],
            [
                21121,
                21160
            ],
            [
                21174,
                21182
            ],
            [
                21188,
                21206
            ],
            [
                21206,
                21236
            ],
            [
                21252,
                21329
            ],
            [
                21338,
                21350
            ],
            [
                21494,
                21499
            ],
            [
                21473,
                21487
            ],
            [
                21406,
                21407
            ],
            [
                21501,
                21541
            ],
            [
                21552,
                21555
            ],
            [
                21555,
                21564
            ],
            [
                21564,
                21608
            ],
            [
                21656,
                21658
            ],
            [
                21658,
                21704
            ],
            [
                21704,
                21706
            ],
            [
                21724,
                21752
            ],
            [
                21754,
                21789
            ],
            [
                21789,
                21832
            ],
            [
                21832,
                21856
            ],
            [
                21856,
                21930
            ],
            [
                21930,
                21945
            ],
            [
                21945,
                21970
            ],
            [
                22011,
                22013
            ],
            [
                22073,
                22136
            ],
            [
                22161,
                22163
            ],
            [
                22163,
                22219
            ],
            [
                22219,
                22311
            ],
            [
                22311,
                22348
            ],
            [
                22451,
                22453
            ],
            [
                22453,
                22498
            ],
            [
                22507,
                22543
            ],
            [
                22543,
                22552
            ],
            [
                22562,
                22567
            ],
            [
                22584,
                22654
            ],
            [
                22654,
                22736
            ],
            [
                22770,
                22833
            ],
            [
                22833,
                22940
            ],
            [
                22940,
                22966
            ],
            [
                22966,
                23038
            ],
            [
                23114,
                23126
            ],
            [
                23171,
                23188
            ],
            [
                23194,
                23206
            ],
            [
                23243,
                23300
            ],
            [
                23301,
                23378
            ],
            [
                23378,
                23439
            ],
            [
                23458,
                23460
            ],
            [
                23460,
                23482
            ],
            [
                23516,
                23518
            ],
            [
                23518,
                23550
            ],
            [
                23569,
                23685
            ],
            [
                23685,
                23725
            ],
            [
                23725,
                23805
            ],
            [
                23805,
                23812
            ],
            [
                23812,
                23840
            ],
            [
                23949,
                23975
            ],
            [
                24068,
                24071
            ],
            [
                24071,
                24108
            ],
            [
                24108,
                24160
            ],
            [
                24160,
                24236
            ],
            [
                24236,
                24307
            ],
            [
                24312,
                24314
            ],
            [
                24314,
                24350
            ],
            [
                24356,
                24384
            ],
            [
                24384,
                24425
            ],
            [
                24425,
                24439
            ],
            [
                24445,
                24514
            ],
            [
                24514,
                24537
            ],
            [
                24537,
                24559
            ],
            [
                24559,
                24583
            ],
            [
                24586,
                24600
            ],
            [
                24687,
                24770
            ],
            [
                24892,
                24935
            ],
            [
                24948,
                24970
            ],
            [
                24970,
                25041
            ],
            [
                25041,
                25077
            ],
            [
                25077,
                25093
            ],
            [
                25132,
                25149
            ],
            [
                25154,
                25252
            ],
            [
                25252,
                25256
            ],
            [
                25272,
                25284
            ],
            [
                25327,
                25328
            ],
            [
                25329,
                25382
            ],
            [
                25382,
                25410
            ],
            [
                25416,
                25426
            ],
            [
                25426,
                25488
            ],
            [
                25498,
                25500
            ],
            [
                25500,
                25603
            ],
            [
                25611,
                25632
            ],
            [
                25640,
                25643
            ],
            [
                25643,
                25702
            ],
            [
                25887,
                25889
            ],
            [
                25998,
                26021
            ],
            [
                26021,
                26060
            ],
            [
                26060,
                26109
            ],
            [
                26109,
                26143
            ],
            [
                26143,
                26207
            ],
            [
                26207,
                26254
            ],
            [
                26260,
                26263
            ],
            [
                26263,
                26346
            ],
            [
                26347,
                26349
            ],
            [
                26360,
                26362
            ],
            [
                26395,
                26420
            ],
            [
                26420,
                26450
            ],
            [
                26450,
                26518
            ],
            [
                26536,
                26575
            ],
            [
                26575,
                26637
            ],
            [
                26637,
                26694
            ],
            [
                26694,
                26723
            ],
            [
                26766,
                26777
            ],
            [
                26786,
                26877
            ],
            [
                26878,
                26887
            ],
            [
                26893,
                26970
            ],
            [
                26974,
                26993
            ],
            [
                26993,
                27070
            ],
            [
                27073,
                27099
            ],
            [
                27100,
                27113
            ],
            [
                27132,
                27144
            ],
            [
                27155,
                27159
            ],
            [
                27145,
                27154
            ],
            [
                27159,
                27160
            ]
        ],
        "row_chars": [
            [
                0,
                178
            ],
            [
                178,
                218
            ],
            [
                218,
                387
            ],
            [
                387,
                578
            ],
            [
                578,
                664
            ],
            [
                664,
                732
            ],
            [
                732,
                864
            ],
            [
                864,
                924
            ],
            [
                924,
                1084
            ],
            [
                1084,
                1384
            ],
            [
                1384,
                1540
            ],
            [
                1540,
                1595
            ],
            [
                1595,
                1711
            ],
            [
                1711,
                1826
            ],
            [
                1826,
                1912
            ],
            [
                1912,
                2088
            ],
            [
                2088,
                2134
            ],
            [
                2134,
                2215
            ],
            [
                2215,
                2376
            ],
            [
                2376,
                2455
            ],
            [
                2455,
                2548
            ],
            [
                2548,
                2724
            ],
            [
                2724,
                2811
            ],
            [
                2811,
                3079
            ],
            [
                3079,
                3169
            ],
            [
                3169,
                3310
            ],
            [
                3310,
                3336
            ],
            [
                3336,
                3487
            ],
            [
                3487,
                3596
            ],
            [
                3596,
                3852
            ],
            [
                3852,
                3978
            ],
            [
                3978,
                4017
            ],
            [
                4017,
                4043
            ],
            [
                4043,
                4460
            ],
            [
                4460,
                4501
            ],
            [
                4501,
                4521
            ],
            [
                4521,
                4604
            ],
            [
                4604,
                4720
            ],
            [
                4720,
                4785
            ],
            [
                4785,
                4814
            ],
            [
                4814,
                4849
            ],
            [
                4849,
                4890
            ],
            [
                4890,
                4950
            ],
            [
                4950,
                5011
            ],
            [
                5011,
                5077
            ],
            [
                5077,
                5202
            ],
            [
                5202,
                5292
            ],
            [
                5292,
                5404
            ],
            [
                5404,
                5467
            ],
            [
                5467,
                5503
            ],
            [
                5503,
                5622
            ],
            [
                5622,
                5652
            ],
            [
                5652,
                5689
            ],
            [
                5689,
                5708
            ],
            [
                5708,
                5756
            ],
            [
                5756,
                5822
            ],
            [
                5822,
                5886
            ],
            [
                5886,
                5946
            ],
            [
                5946,
                6000
            ],
            [
                6000,
                6046
            ],
            [
                6046,
                6176
            ],
            [
                6176,
                6211
            ],
            [
                6211,
                6343
            ],
            [
                6343,
                6391
            ],
            [
                6391,
                6422
            ],
            [
                6422,
                6461
            ],
            [
                6461,
                6486
            ],
            [
                6486,
                6577
            ],
            [
                6577,
                6601
            ],
            [
                6601,
                6628
            ],
            [
                6628,
                6753
            ],
            [
                6753,
                6815
            ],
            [
                6815,
                6943
            ],
            [
                6943,
                7074
            ],
            [
                7074,
                7102
            ],
            [
                7102,
                7187
            ],
            [
                7187,
                7239
            ],
            [
                7239,
                7312
            ],
            [
                7312,
                7460
            ],
            [
                7460,
                7491
            ],
            [
                7491,
                7537
            ],
            [
                7537,
                7603
            ],
            [
                7603,
                7638
            ],
            [
                7638,
                7776
            ],
            [
                7776,
                7811
            ],
            [
                7811,
                7929
            ],
            [
                7929,
                7957
            ],
            [
                7957,
                8021
            ],
            [
                8021,
                8083
            ],
            [
                8083,
                8134
            ],
            [
                8134,
                8152
            ],
            [
                8152,
                8195
            ],
            [
                8195,
                8212
            ],
            [
                8212,
                8327
            ],
            [
                8327,
                8349
            ],
            [
                8349,
                8373
            ],
            [
                8373,
                8454
            ],
            [
                8454,
                8510
            ],
            [
                8510,
                8587
            ],
            [
                8587,
                8683
            ],
            [
                8683,
                8820
            ],
            [
                8820,
                9146
            ],
            [
                9146,
                9318
            ],
            [
                9318,
                9364
            ],
            [
                9364,
                9461
            ],
            [
                9461,
                9521
            ],
            [
                9521,
                9557
            ],
            [
                9557,
                9625
            ],
            [
                9625,
                9670
            ],
            [
                9670,
                9902
            ],
            [
                9902,
                9965
            ],
            [
                9965,
                10186
            ],
            [
                10186,
                10319
            ],
            [
                10319,
                10437
            ],
            [
                10437,
                10561
            ],
            [
                10561,
                10990
            ],
            [
                10990,
                11119
            ],
            [
                11119,
                11218
            ],
            [
                11218,
                11365
            ],
            [
                11365,
                11550
            ],
            [
                11550,
                12433
            ],
            [
                12433,
                12665
            ],
            [
                12665,
                12736
            ],
            [
                12736,
                12838
            ],
            [
                12838,
                12914
            ],
            [
                12914,
                12983
            ],
            [
                12983,
                13123
            ],
            [
                13123,
                13172
            ],
            [
                13172,
                13250
            ],
            [
                13250,
                13338
            ],
            [
                13338,
                13453
            ],
            [
                13453,
                13560
            ],
            [
                13560,
                13597
            ],
            [
                13597,
                13683
            ],
            [
                13683,
                13815
            ],
            [
                13815,
                13825
            ],
            [
                13825,
                13851
            ],
            [
                13851,
                13903
            ],
            [
                13903,
                13949
            ],
            [
                13949,
                13996
            ],
            [
                13996,
                14073
            ],
            [
                14073,
                14152
            ],
            [
                14152,
                14191
            ],
            [
                14191,
                14236
            ],
            [
                14236,
                14278
            ],
            [
                14278,
                14294
            ],
            [
                14294,
                14324
            ],
            [
                14324,
                14373
            ],
            [
                14373,
                14430
            ],
            [
                14430,
                14477
            ],
            [
                14477,
                14574
            ],
            [
                14574,
                14663
            ],
            [
                14663,
                14751
            ],
            [
                14751,
                14826
            ],
            [
                14826,
                14957
            ],
            [
                14957,
                15021
            ],
            [
                15021,
                15082
            ],
            [
                15082,
                15276
            ],
            [
                15276,
                15351
            ],
            [
                15351,
                15565
            ],
            [
                15565,
                15721
            ],
            [
                15721,
                15840
            ],
            [
                15840,
                15942
            ],
            [
                15942,
                15968
            ],
            [
                15968,
                16145
            ],
            [
                16145,
                16272
            ],
            [
                16272,
                16279
            ],
            [
                16279,
                16318
            ],
            [
                16318,
                16359
            ],
            [
                16359,
                16409
            ],
            [
                16409,
                16458
            ],
            [
                16458,
                16536
            ],
            [
                16536,
                16651
            ],
            [
                16651,
                16787
            ],
            [
                16787,
                16805
            ],
            [
                16805,
                16885
            ],
            [
                16885,
                16930
            ],
            [
                16930,
                16952
            ],
            [
                16952,
                17008
            ],
            [
                17008,
                17096
            ],
            [
                17096,
                17121
            ],
            [
                17121,
                17134
            ],
            [
                17134,
                17184
            ],
            [
                17184,
                17253
            ],
            [
                17253,
                17305
            ],
            [
                17305,
                17410
            ],
            [
                17410,
                17495
            ],
            [
                17495,
                17556
            ],
            [
                17556,
                17581
            ],
            [
                17581,
                17622
            ],
            [
                17622,
                17668
            ],
            [
                17668,
                17691
            ],
            [
                17691,
                17715
            ],
            [
                17715,
                17731
            ],
            [
                17731,
                17778
            ],
            [
                17778,
                17828
            ],
            [
                17828,
                17919
            ],
            [
                17919,
                17954
            ],
            [
                17954,
                17968
            ],
            [
                17968,
                17990
            ],
            [
                17990,
                18160
            ],
            [
                18160,
                18225
            ],
            [
                18225,
                18402
            ],
            [
                18402,
                18588
            ],
            [
                18588,
                18635
            ],
            [
                18635,
                18654
            ],
            [
                18654,
                18708
            ],
            [
                18708,
                18772
            ],
            [
                18772,
                18826
            ],
            [
                18826,
                18852
            ],
            [
                18852,
                18932
            ],
            [
                18932,
                18999
            ],
            [
                18999,
                19041
            ],
            [
                19041,
                19064
            ],
            [
                19064,
                19090
            ],
            [
                19090,
                19165
            ],
            [
                19165,
                19224
            ],
            [
                19224,
                19250
            ],
            [
                19250,
                19287
            ],
            [
                19287,
                19330
            ],
            [
                19330,
                19371
            ],
            [
                19371,
                19511
            ],
            [
                19511,
                19563
            ],
            [
                19563,
                19658
            ],
            [
                19658,
                19725
            ],
            [
                19725,
                19818
            ],
            [
                19818,
                19884
            ],
            [
                19884,
                19964
            ],
            [
                19964,
                20048
            ],
            [
                20048,
                20072
            ],
            [
                20072,
                20150
            ],
            [
                20150,
                20222
            ],
            [
                20222,
                20275
            ],
            [
                20275,
                20362
            ],
            [
                20362,
                20540
            ],
            [
                20540,
                20587
            ],
            [
                20587,
                20648
            ],
            [
                20648,
                20683
            ],
            [
                20683,
                20703
            ],
            [
                20703,
                20715
            ],
            [
                20715,
                20726
            ],
            [
                20726,
                20749
            ],
            [
                20749,
                20811
            ],
            [
                20811,
                20847
            ],
            [
                20847,
                20956
            ],
            [
                20956,
                21010
            ],
            [
                21010,
                21071
            ],
            [
                21071,
                21121
            ],
            [
                21121,
                21206
            ],
            [
                21206,
                21555
            ],
            [
                21555,
                21564
            ],
            [
                21564,
                21658
            ],
            [
                21658,
                21704
            ],
            [
                21704,
                21789
            ],
            [
                21789,
                21832
            ],
            [
                21832,
                21856
            ],
            [
                21856,
                21930
            ],
            [
                21930,
                21945
            ],
            [
                21945,
                22013
            ],
            [
                22013,
                22163
            ],
            [
                22163,
                22219
            ],
            [
                22219,
                22311
            ],
            [
                22311,
                22453
            ],
            [
                22453,
                22543
            ],
            [
                22543,
                22574
            ],
            [
                22574,
                22583
            ],
            [
                22583,
                22654
            ],
            [
                22654,
                22736
            ],
            [
                22736,
                22770
            ],
            [
                22770,
                22833
            ],
            [
                22833,
                22940
            ],
            [
                22940,
                22966
            ],
            [
                22966,
                23301
            ],
            [
                23301,
                23378
            ],
            [
                23378,
                23460
            ],
            [
                23460,
                23518
            ],
            [
                23518,
                23685
            ],
            [
                23685,
                23725
            ],
            [
                23725,
                23805
            ],
            [
                23805,
                23812
            ],
            [
                23812,
                23841
            ],
            [
                23841,
                23949
            ],
            [
                23949,
                24071
            ],
            [
                24071,
                24108
            ],
            [
                24108,
                24160
            ],
            [
                24160,
                24236
            ],
            [
                24236,
                24314
            ],
            [
                24314,
                24384
            ],
            [
                24384,
                24425
            ],
            [
                24425,
                24514
            ],
            [
                24514,
                24537
            ],
            [
                24537,
                24559
            ],
            [
                24559,
                24600
            ],
            [
                24600,
                24687
            ],
            [
                24687,
                24773
            ],
            [
                24773,
                24891
            ],
            [
                24891,
                24948
            ],
            [
                24948,
                24970
            ],
            [
                24970,
                25041
            ],
            [
                25041,
                25077
            ],
            [
                25077,
                25095
            ],
            [
                25095,
                25122
            ],
            [
                25122,
                25252
            ],
            [
                25252,
                25329
            ],
            [
                25329,
                25382
            ],
            [
                25382,
                25426
            ],
            [
                25426,
                25500
            ],
            [
                25500,
                25643
            ],
            [
                25643,
                25702
            ],
            [
                25702,
                25732
            ],
            [
                25732,
                25825
            ],
            [
                25825,
                26021
            ],
            [
                26021,
                26060
            ],
            [
                26060,
                26109
            ],
            [
                26109,
                26143
            ],
            [
                26143,
                26207
            ],
            [
                26207,
                26263
            ],
            [
                26263,
                26362
            ],
            [
                26362,
                26420
            ],
            [
                26420,
                26450
            ],
            [
                26450,
                26518
            ],
            [
                26518,
                26536
            ],
            [
                26536,
                26575
            ],
            [
                26575,
                26637
            ],
            [
                26637,
                26694
            ],
            [
                26694,
                26878
            ],
            [
                26878,
                26993
            ],
            [
                26993,
                27100
            ],
            [
                27100,
                27160
            ]
        ]
    },
    "abridged": {
        "text": "When Mrs. Greenow was left alone in her lodgings, after the little dinner with her two lovers, she sat down to think. There were three paths open before her. She might take Mr. Cheesacre, or she might take Captain Bellfield - or she might take neither. She was going to leave Norwich after Easter, and they knew it. Something had been said about her returning to Yarmouth in the summer. She was a just woman at heart, and felt that each man should know his prospect if she did return.\nThere was a good deal to be said on Mr. Cheesacre's behalf. Mahogany-furnitured bedrooms are very comfortable; and heaps of manure, though not romantic, are useful in farming. Mrs. Greenow by no means despised these things; and as for their owner, though she saw much amiss in his character, she thought that his little foibles were of such a nature that a wife of spirit might be able to repress them, if not to cure them. But she had already married for money once, as she told herself, and she thought that she might now venture on a little love.\nHer marriage for money had been successful. The nursing of old Greenow had not been disagreeable, nor had it taken longer than she had anticipated. She had now got her due reward, and she really did feel grateful to his memory. Some of her tears were dropped with sincerity. She was essentially a happy-natured woman, who looked back upon her past life with contentment, and forward to her future life with confidence. She would not be greedy, she said to herself. She did not want more money, and therefore she would have none of Mr. Cheesacre. However, she also resolved that, if possible, the mahogany-furnitured bedrooms should be kept in the family, and made over to her niece, Kate Vavasor.\nBut should she marry Captain Bellfield? Strange to say, his poverty and scampishness and lies almost recommended him to her. She was not afraid of them; she thought that she could cure them - if they needed curing. As for his stories about Inkerman, and his little debts, she cared nothing about that. She also had her Inkermans, and she too had owed money for her gloves and corsets in the ante-Greenow days.\nBut she was aware of the danger that there might be more behind, of which she had never heard. Another Mrs. Bellfield was not impossible; and what if he should not be a real captain at all! Such things had happened. Her chief security was in this: that Cheesacre had known the man for many years, and would certainly have told anything against him that he knew.\nBetween nine and ten in the evening, Jeannette brought to her some arrowroot with sherry, which it was her habit to take before retiring for the night.\n\"Jeannette,\" she said, as she stirred the bowl, \"I'm afraid those two gentlemen have quarrelled.\"\n\"Oh, ma'am, of course they have! How was they to help it?\"\nJeannette, on these occasions, usually stood by her mistress's chair, chatting with her; and if the chatting was much prolonged, she would gradually sink down upon the corner of a chair herself - and then the two women would be very comfortable together over the fire, Jeannette never forgetting that she was the servant, and Mrs. Greenow never forgetting that she was the mistress.\n\"Why should they quarrel, Jeannette? It's very foolish.\"\n\"I don't know about being foolish, ma'am; but it's natural. If I had two beaux as was a-courting me together, I should expect as they would punch each other's heads.\"\n\"But you don't suppose that I want beaux, as you call them?\"\n\"That's as may be, ma'am. But they are; and if they was to blow each other's brains out in the gig tonight, I shouldn't be a bit surprised.\" As she said this, Jeannette slipped into her chair.\n\"Why, you silly child, they're not going home together. Did not the Captain go away first?\"\n\"He did, but I thought perhaps it was to get his pistols ready.\"\n\"They won't fight, Jeannette. Gentlemen have given over fighting.\"\n\"Dear, dear; I was so sure we should have had the papers full of it, and perhaps one of them stretched upon his bloody bier! I wonder which it would have been? I always made up my mind that the Captain wouldn't be wounded.\"\n\"But why should they quarrel at all, Jeannette? It is the most foolish thing. I have never said a word to encourage either of them. You know I haven't, Jeannette.\" Mrs. Greenow put her handkerchief to her eyes.\n\"To be sure, ma'am, no lady could have behaved better than you have done. If gentlemen will make fools of themselves, it isn't your fault; is it, ma'am?\"\n\"But I'm so sorry that they should have quarrelled. They were such dear friends, you know.\"\n\"When you've settled which it's to be, ma'am, that'll all come right again.\" Then there was a little pause. \"I suppose, ma'am, it won't be Mr. Cheesacre?\"\n\"I shall always regard Mr. Cheesacre as a dear friend; but he'll never be more than that.\"\n\"Then it'll be the Captain, ma'am? I'm sure, for my part, I've always thought the Captain was the nicer gentleman.\"\n\"He's nothing to me, girl.\"\n\"And as for money - what's the good of having more than enough? If he can bring love, you can bring money; can't you, ma'am?\"\n\"He's nothing to me, girl,\" repeated Mrs. Greenow.\n\"But he will be?\" asked Jeannette.\n\"Well, I'm sure! What's the world come to, when you cross-examine your mistress in that way! Get to bed, will you? It's near ten o'clock. Next week we shall be packing up, and there'll be all my things to see to.\"\nSo Jeannette departed, and after some further thought about Captain Bellfield, Mrs. Greenow went to her bed.\nMr. Cheesacre, when he drove back to Oileymead alone, had kept himself hot with passion against Bellfield; and his heat had been sustained by his seeing the Captain, with his portmanteau, escaping just as he reached his home. But early on the following morning he thought of Mrs. Greenow, and he remembered some of the hard things which she had said to him.\nHe had made mistakes in his manner of wooing. He was quite aware of that now, and was determined to put them right. She had rebuked him for saying nothing about his love. He would instantly mend that fault. And she had bidden him not to talk so much about his wealth. Henceforth he would be dumb on that subject. Nevertheless, he said to himself, \"She can't really like a poor beggarly wretch who hasn't got a shilling.\"\nHe was very far from feeling that the battle was lost. Her last word to him had been an assurance of her friendship. He was, no doubt, becoming tired of courtship, and heartily wished that the work were over; but he was not minded to give it up.\nSo he prepared himself for another attack, and took himself back to Norwich. On this occasion he dressed himself with considerable care, in knickerbockers, with tight, bright, leather gaiters round his legs, thinking his manly proportions might stand him in good stead. And he put on a new shooting-coat, and a wonderful waistcoat embroidered with foxes' heads. He completed his outfit with a round hat, dog-skin gloves, and a whip.\nThus armed he went forth resolved to conquer or to die. He drove at a great pace into the inn-yard, threw his reins to the ostler, took one glass of cherry-brandy at the bar, and then marched off across the market-place to the Close with decisive steps, pausing only at a pastrycook's where he had another glass of cherry-brandy.\nHe knocked at the door, and in another second was in the presence of his angel.\n\"Mr. Cheesacre, whoever expected to see you in Norwich on a Thursday?\" said the lady.\nHe answered boldly. \"There's no knowing when I may be in Norwich, Mrs. Greenow. I'm one of those men of whom nobody knows anything certain, except that I pay as I go.\" Then he remembered that he was not to make any more boasts about his money. \"There's one other thing they may all know if they please, but we won't say what that is just at present.\"\n\"Won't you sit down, Mr. Cheesacre?\"\n\"Well, thank you, I will sit down for a few minutes. Mrs. Greenow, I'm in such a state of mind that I must put an end to it, or else I shall go mad, and do somebody a damage.\"\n\"Dear me! what has happened to you? You're going out shooting soon, are you not?\" and Mrs. Greenow looked at his clothes.\n\"No, Mrs. Greenow, I'm not going shooting. I like to be nice, and all that kind of thing. There are people who think that because a man farms his own land, he must be always in the muck. But it don't matter what a man wears if his heart isn't easy.\"\n\"I don't know why you should speak in that way, Mr. Cheesacre; but it's what I have felt every hour since - since Greenow left me.\"\nThis allusion to the departed one did not help Mr. Cheesacre. He felt that some decided method of proceeding was required. Little hints at love-making had been all very well earlier on; but now there must be more than little hints. The widow herself had told him that he ought to talk about love; and he had taken two glasses of cherry-brandy, hoping that they might enable him to do so. He was resolved to speak boldly; but how was he to begin? There was the difficulty. He remained silent for a minute or two. Then he jumped up before her.\n\"Mrs. Greenow,\" he exclaimed, \"dearest Mrs. Greenow; will you be my wife? There! I have said it, and I mean it. Everything that I've got shall be yours. As for love; oh, Arabella, if you only knew me! I don't think there's a man in Norfolk better able to love a woman than I am. Ever since I first saw you at Yarmouth, I've been in love to that extent that I've not known what I'm about. I haven't really.\"\n\"Has that been my fault, Mr. Cheesacre?\"\n\"Upon my word it has. I can't move anywhere without thinking about you. My mind's made up; I won't stay at Oileymead unless you will come and be its mistress.\"\n\"Not stay at Oileymead?\"\n\"No, indeed. I'll let the place, and go and travel. What's the use of my hanging on there without the woman of my heart? I couldn't do it, Mrs. Greenow. Of course I've got everything there that money can buy - but it's all of no use to a man that's in love. Do you know, I've come quite to despise money and all that sort of thing. I haven't had my banker's book home these last three months. Only think of that now.\"\n\"But how can I help you, Mr. Cheesacre?\"\n\"Say you'll be my wife? I'll be so good to you. As for your fortune, I don't care that for it! I'm not like somebody else; it's yourself I want. You shall be my pet, and my poppet, and my dearest little duck all the days of your life.\"\n\"No, Mr. Cheesacre; it cannot be.\"\n\"And why not? Look here, Arabella!\" He rose from his chair, and went down on both knees so close to her that she could not escape. There could be no doubt about the efficacy of the cherry-brandy. There was some little cracking and straining of his gaiters as he knelt. He did not notice this; but Mrs. Greenow was painfully aware that he might not be able to rise with ease.\n\"Mr. Cheesacre, don't make a fool of yourself. Get up,\" said she.\n\"Never, till you have told me that you will be mine!\"\n\"Then you'll remain there for ever, which will be inconvenient. Don't take my hand, Mr. Cheesacre. I tell you to stop.\"\nHe released her hand, but made no attempt to rise.\n\"I never saw a man look so much like a fool in my life,\" said she. \"If you don't get up, I'll push you over. Don't you hear? There's somebody coming.\"\nBut Cheesacre did not hear. \"I'll never get up,\" said he, \"till you have bid me hope.\"\n\"Bid you play the fiddle. Get away from my knees. There; he'll be in the room now before-\"\nCheesacre now did hear footsteps, and the door opened while he made his first futile attempt to get back to a standing position. Captain Bellfield entered.\n\"I beg ten thousand pardons,\" said he, \"but as I did not see Jeannette, I ventured to come in. May I congratulate my friend Cheesacre on his success?\"\nIn the meantime Cheesacre had risen, with difficulty. \"I'll trouble you to leave the room, Captain Bellfield,\" said he.\n\"Certainly, if Mrs. Greenow wishes me to do so,\" said the Captain.\nMrs. Greenow felt herself called upon to speak.\n\"Captain Bellfield, I must beg you to understand that the position in which you found Mr. Cheesacre was one altogether of his own seeking. It was not with my consent that he was there.\"\n\"I can easily believe that, Mrs. Greenow,\" said the Captain.\n\"Who cares what you believe, sir?\" said Mr. Cheesacre.\n\"Gentlemen! gentlemen! this is really unkind. Captain Bellfield, I think I had better ask you to withdraw.\"\n\"By all means,\" said Mr. Cheesacre.\n\"As it is absolutely necessary that I should give Mr. Cheesacre a definite answer-\"\n\"Of course,\" said Captain Bellfield, preparing to go. \"Perhaps I might be allowed to come this evening?\"\nTo this Mrs. Greenow half assented with a nod, and the Captain went. As soon as the door was closed, Mr. Cheesacre again prepared to throw himself into his former position, but Mrs. Greenow promptly said, \"Mr. Cheesacre, let there be an end to this little farce.\"\n\"Farce!\" said he, standing with his hand on his heart.\n\"It is certainly either a farce or a mistake. If I have been at all to blame, I ask your pardon most sincerely.\"\n\"But you'll be Mrs. Cheesacre; won't you?\"\n\"No, Mr. Cheesacre; no. One husband is enough for any woman, and mine lies buried at Birmingham.\"\n\"Oh, damn it!\" said he, in utter disgust. It was not courteous; but even Mrs. Greenow herself felt that the poor man had been provoked.\n\"Let us part friends,\" said she, offering him her hand.\nBut he turned his back upon her, for there was something in his eye that he wanted to hide. I believe that he really did love her.\n\"Will you not give me your hand,\" said she, \"to show that there is no anger between us?\"\n\"Do think again! If there's anything you like to have changed, I'll change it at once. I'll give up Oileymead altogether, if you don't like being so near the farm-yard. Mrs. Greenow, if you only knew how I've set my heart upon it!\" And now, though his back was turned, the whimpering of his voice told plainly that tears were in his eyes.\nShe was a little touched. No woman would feel disposed to marry a man simply because he cried, and Mrs. Greenow had seen too much of the world to fall into such a blunder as that; but she was touched.\n\"My friend,\" she said, putting her hand upon his arm, \"think no more of it.\"\n\"But I can't help thinking of it,\" said he, almost blubbering.\n\"No, no, no,\" said she. \"Why, Mr. Cheesacre, how can you care for an old woman like me, when so many pretty young ladies would give their eyes to get a kind word from you?\"\n\"I don't want any young lady,\" said he.\n\"There's Charlie Fairstairs, who would make as good a wife as any girl I know.\"\n\"Psha! Charlie Fairstairs, indeed!\"\n\"Or my niece, Kate Vavasor.\"\n\"She's nothing to me, Mrs. Greenow.\"\n\"That's because you never asked her to be anything. If I get her to come back to Yarmouth next summer, will you think about it? You want a wife, and you couldn't do better if you searched all England. It would be so pleasant for us to be near friends; wouldn't it?\" And again she put her hand upon his arm.\n\"Mrs. Greenow, at present there's only one woman in the world that I can think of.\"\n\"And that's my niece.\"\n\"And that's yourself. I'm a broken-hearted man - I am, indeed. I hardly know what to do with myself; but I suppose I'd better go back to Oileymead. I shall always hate the place now,\" he said.\n\"That will pass away. You'd be as happy as a king there, if you'd take Kate for your queen.\"\n\"And what'll you do, Mrs. Greenow?\"\n\"What shall I do? If you marry Kate, I'll come and stay with you half my time, and nurse the children, as an old grand-aunt should.\"\n\"But -\" He hesitated. \"You don't mean to take that man Bellfield, do you?\"\n\"Come, Mr. Cheesacre, that's jealousy. What right can you have to ask me whether I shall take any man? The chances are that I shall remain as I am till I'm carried to my grave; but I'm not going to give any promise about it to you or to anyone.\"\n\"You don't know that man, Mrs. Greenow; you don't, indeed. He hasn't got a shilling. And for lies, there's no beating him!\"\n\"Why, then, has he been such a friend of yours?\"\n\"Well, because I've been foolish. I took up with him just because he looked pleasant, I suppose.\"\n\"And you want to prevent me from doing the same.\"\n\"If you were to marry him, Mrs. Greenow, it's my belief I should do him a mischief; I don't think I could stand it. A mean, skulking beggar! I suppose I'd better go now?\"\n\"Certainly, if that's the way you choose to talk about my friends.\"\n\"Well, I won't say any more at present. I suppose if I was to talk for ever it wouldn't be any good?\"\n\"Come and talk to Kate Vavasor for ever, Mr. Cheesacre.\"\nTo this he made no reply, but left, and drove home to Oileymead, thinking of his disappointment with all the bitterness of a young lover.\n\"I didn't think I should ever care so much about anything,\" he said, as he took himself to bed that night.\nThat evening Captain Bellfield did call in the Close, as he had said he would, but he was not admitted.\n\"Her mistress had a headache,\" said Jeannette.",
        "paragraph_chars": [
            [
                0,
                485
            ],
            [
                485,
                1035
            ],
            [
                1035,
                1732
            ],
            [
                1732,
                2142
            ],
            [
                2142,
                2504
            ],
            [
                2504,
                2656
            ],
            [
                2656,
                2754
            ],
            [
                2754,
                2813
            ],
            [
                2813,
                3196
            ],
            [
                3196,
                3253
            ],
            [
                3253,
                3420
            ],
            [
                3420,
                3481
            ],
            [
                3481,
                3674
            ],
            [
                3674,
                3766
            ],
            [
                3766,
                3831
            ],
            [
                3831,
                3898
            ],
            [
                3898,
                4122
            ],
            [
                4122,
                4333
            ],
            [
                4333,
                4487
            ],
            [
                4487,
                4579
            ],
            [
                4579,
                4734
            ],
            [
                4734,
                4825
            ],
            [
                4825,
                4941
            ],
            [
                4941,
                4969
            ],
            [
                4969,
                5095
            ],
            [
                5095,
                5146
            ],
            [
                5146,
                5181
            ],
            [
                5181,
                5395
            ],
            [
                5395,
                5504
            ],
            [
                5504,
                5862
            ],
            [
                5862,
                6283
            ],
            [
                6283,
                6529
            ],
            [
                6529,
                6962
            ],
            [
                6962,
                7292
            ],
            [
                7292,
                7372
            ],
            [
                7372,
                7458
            ],
            [
                7458,
                7809
            ],
            [
                7809,
                7846
            ],
            [
                7846,
                8022
            ],
            [
                8022,
                8144
            ],
            [
                8144,
                8394
            ],
            [
                8394,
                8526
            ],
            [
                8526,
                9068
            ],
            [
                9068,
                9475
            ],
            [
                9475,
                9516
            ],
            [
                9516,
                9676
            ],
            [
                9676,
                9701
            ],
            [
                9701,
                10119
            ],
            [
                10119,
                10160
            ],
            [
                10160,
                10396
            ],
            [
                10396,
                10431
            ],
            [
                10431,
                10806
            ],
            [
                10806,
                10872
            ],
            [
                10872,
                10926
            ],
            [
                10926,
                11046
            ],
            [
                11046,
                11097
            ],
            [
                11097,
                11248
            ],
            [
                11248,
                11335
            ],
            [
                11335,
                11426
            ],
            [
                11426,
                11582
            ],
            [
                11582,
                11733
            ],
            [
                11733,
                11853
            ],
            [
                11853,
                11920
            ],
            [
                11920,
                11968
            ],
            [
                11968,
                12154
            ],
            [
                12154,
                12215
            ],
            [
                12215,
                12270
            ],
            [
                12270,
                12378
            ],
            [
                12378,
                12414
            ],
            [
                12414,
                12498
            ],
            [
                12498,
                12603
            ],
            [
                12603,
                12867
            ],
            [
                12867,
                12922
            ],
            [
                12922,
                13035
            ],
            [
                13035,
                13078
            ],
            [
                13078,
                13176
            ],
            [
                13176,
                13312
            ],
            [
                13312,
                13368
            ],
            [
                13368,
                13499
            ],
            [
                13499,
                13588
            ],
            [
                13588,
                13927
            ],
            [
                13927,
                14128
            ],
            [
                14128,
                14205
            ],
            [
                14205,
                14268
            ],
            [
                14268,
                14441
            ],
            [
                14441,
                14481
            ],
            [
                14481,
                14561
            ],
            [
                14561,
                14597
            ],
            [
                14597,
                14626
            ],
            [
                14626,
                14663
            ],
            [
                14663,
                14970
            ],
            [
                14970,
                15054
            ],
            [
                15054,
                15077
            ],
            [
                15077,
                15270
            ],
            [
                15270,
                15363
            ],
            [
                15363,
                15399
            ],
            [
                15399,
                15532
            ],
            [
                15532,
                15607
            ],
            [
                15607,
                15853
            ],
            [
                15853,
                15977
            ],
            [
                15977,
                16026
            ],
            [
                16026,
                16124
            ],
            [
                16124,
                16174
            ],
            [
                16174,
                16345
            ],
            [
                16345,
                16413
            ],
            [
                16413,
                16515
            ],
            [
                16515,
                16572
            ],
            [
                16572,
                16710
            ],
            [
                16710,
                16817
            ],
            [
                16817,
                16921
            ],
            [
                16921,
                16967
            ]
        ],
        "segment_chars": [
            [
                0,
                118
            ],
            [
                118,
                158
            ],
            [
                158,
                253
            ],
            [
                253,
                316
            ],
            [
                316,
                387
            ],
            [
                387,
                485
            ],
            [
                485,
                545
            ],
            [
                545,
                661
            ],
            [
                661,
                909
            ],
            [
                909,
                1035
            ],
            [
                1035,
                1079
            ],
            [
                1079,
                1183
            ],
            [
                1183,
                1263
            ],
            [
                1263,
                1310
            ],
            [
                1310,
                1454
            ],
            [
                1454,
                1500
            ],
            [
                1500,
                1581
            ],
            [
                1581,
                1732
            ],
            [
                1732,
                1772
            ],
            [
                1772,
                1857
            ],
            [
                1857,
                1947
            ],
            [
                1947,
                2034
            ],
            [
                2034,
                2142
            ],
            [
                2142,
                2237
            ],
            [
                2237,
                2332
            ],
            [
                2332,
                2358
            ],
            [
                2358,
                2504
            ],
            [
                2504,
                2656
            ],
            [
                2656,
                2754
            ],
            [
                2754,
                2787
            ],
            [
                2787,
                2813
            ],
            [
                2813,
                3196
            ],
            [
                3196,
                3233
            ],
            [
                3233,
                3253
            ],
            [
                3253,
                3313
            ],
            [
                3313,
                3420
            ],
            [
                3420,
                3481
            ],
            [
                3481,
                3507
            ],
            [
                3507,
                3622
            ],
            [
                3622,
                3674
            ],
            [
                3674,
                3730
            ],
            [
                3730,
                3766
            ],
            [
                3766,
                3831
            ],
            [
                3831,
                3861
            ],
            [
                3861,
                3898
            ],
            [
                3898,
                4023
            ],
            [
                4023,
                4058
            ],
            [
                4058,
                4122
            ],
            [
                4122,
                4170
            ],
            [
                4170,
                4200
            ],
            [
                4200,
                4254
            ],
            [
                4254,
                4286
            ],
            [
                4286,
                4333
            ],
            [
                4333,
                4407
            ],
            [
                4407,
                4487
            ],
            [
                4487,
                4539
            ],
            [
                4539,
                4579
            ],
            [
                4579,
                4656
            ],
            [
                4656,
                4687
            ],
            [
                4687,
                4734
            ],
            [
                4734,
                4825
            ],
            [
                4825,
                4860
            ],
            [
                4860,
                4941
            ],
            [
                4941,
                4969
            ],
            [
                4969,
                5033
            ],
            [
                5033,
                5095
            ],
            [
                5095,
                5146
            ],
            [
                5146,
                5164
            ],
            [
                5164,
                5181
            ],
            [
                5181,
                5198
            ],
            [
                5198,
                5274
            ],
            [
                5274,
                5296
            ],
            [
                5296,
                5319
            ],
            [
                5319,
                5395
            ],
            [
                5395,
                5504
            ],
            [
                5504,
                5730
            ],
            [
                5730,
                5862
            ],
            [
                5862,
                5908
            ],
            [
                5908,
                5978
            ],
            [
                5978,
                6033
            ],
            [
                6033,
                6069
            ],
            [
                6069,
                6130
            ],
            [
                6130,
                6175
            ],
            [
                6175,
                6283
            ],
            [
                6283,
                6338
            ],
            [
                6338,
                6400
            ],
            [
                6400,
                6529
            ],
            [
                6529,
                6606
            ],
            [
                6606,
                6799
            ],
            [
                6799,
                6891
            ],
            [
                6891,
                6962
            ],
            [
                6962,
                7018
            ],
            [
                7018,
                7292
            ],
            [
                7292,
                7372
            ],
            [
                7372,
                7443
            ],
            [
                7443,
                7458
            ],
            [
                7458,
                7478
            ],
            [
                7478,
                7538
            ],
            [
                7538,
                7626
            ],
            [
                7626,
                7702
            ],
            [
                7702,
                7809
            ],
            [
                7809,
                7846
            ],
            [
                7846,
                7899
            ],
            [
                7899,
                8022
            ],
            [
                8022,
                8032
            ],
            [
                8032,
                8058
            ],
            [
                8058,
                8104
            ],
            [
                8104,
                8144
            ],
            [
                8144,
                8187
            ],
            [
                8187,
                8234
            ],
            [
                8234,
                8331
            ],
            [
                8331,
                8394
            ],
            [
                8394,
                8526
            ],
            [
                8526,
                8588
            ],
            [
                8588,
                8649
            ],
            [
                8649,
                8758
            ],
            [
                8758,
                8914
            ],
            [
                8914,
                8972
            ],
            [
                8972,
                8998
            ],
            [
                8998,
                9038
            ],
            [
                9038,
                9068
            ],
            [
                9068,
                9142
            ],
            [
                9142,
                9149
            ],
            [
                9149,
                9180
            ],
            [
                9180,
                9221
            ],
            [
                9221,
                9269
            ],
            [
                9269,
                9347
            ],
            [
                9347,
                9456
            ],
            [
                9456,
                9475
            ],
            [
                9475,
                9516
            ],
            [
                9516,
                9538
            ],
            [
                9538,
                9588
            ],
            [
                9588,
                9676
            ],
            [
                9676,
                9701
            ],
            [
                9701,
                9714
            ],
            [
                9714,
                9753
            ],
            [
                9753,
                9822
            ],
            [
                9822,
                9854
            ],
            [
                9854,
                9959
            ],
            [
                9959,
                10033
            ],
            [
                10033,
                10094
            ],
            [
                10094,
                10119
            ],
            [
                10119,
                10160
            ],
            [
                10160,
                10184
            ],
            [
                10184,
                10208
            ],
            [
                10208,
                10255
            ],
            [
                10255,
                10305
            ],
            [
                10305,
                10396
            ],
            [
                10396,
                10431
            ],
            [
                10431,
                10445
            ],
            [
                10445,
                10467
            ],
            [
                10467,
                10562
            ],
            [
                10562,
                10627
            ],
            [
                10627,
                10700
            ],
            [
                10700,
                10806
            ],
            [
                10806,
                10853
            ],
            [
                10853,
                10872
            ],
            [
                10872,
                10926
            ],
            [
                10926,
                10990
            ],
            [
                10990,
                11025
            ],
            [
                11025,
                11046
            ],
            [
                11046,
                11097
            ],
            [
                11097,
                11164
            ],
            [
                11164,
                11206
            ],
            [
                11206,
                11222
            ],
            [
                11222,
                11248
            ],
            [
                11248,
                11276
            ],
            [
                11276,
                11335
            ],
            [
                11335,
                11361
            ],
            [
                11361,
                11385
            ],
            [
                11385,
                11426
            ],
            [
                11426,
                11555
            ],
            [
                11555,
                11582
            ],
            [
                11582,
                11677
            ],
            [
                11677,
                11733
            ],
            [
                11733,
                11787
            ],
            [
                11787,
                11853
            ],
            [
                11853,
                11920
            ],
            [
                11920,
                11968
            ],
            [
                11968,
                12107
            ],
            [
                12107,
                12154
            ],
            [
                12154,
                12215
            ],
            [
                12215,
                12250
            ],
            [
                12250,
                12270
            ],
            [
                12270,
                12282
            ],
            [
                12282,
                12293
            ],
            [
                12293,
                12316
            ],
            [
                12316,
                12378
            ],
            [
                12378,
                12414
            ],
            [
                12414,
                12498
            ],
            [
                12498,
                12552
            ],
            [
                12552,
                12603
            ],
            [
                12603,
                12672
            ],
            [
                12672,
                12867
            ],
            [
                12867,
                12876
            ],
            [
                12876,
                12922
            ],
            [
                12922,
                12968
            ],
            [
                12968,
                13035
            ],
            [
                13035,
                13078
            ],
            [
                13078,
                13102
            ],
            [
                13102,
                13176
            ],
            [
                13176,
                13191
            ],
            [
                13191,
                13218
            ],
            [
                13218,
                13312
            ],
            [
                13312,
                13368
            ],
            [
                13368,
                13460
            ],
            [
                13460,
                13499
            ],
            [
                13499,
                13588
            ],
            [
                13588,
                13605
            ],
            [
                13605,
                13675
            ],
            [
                13675,
                13757
            ],
            [
                13757,
                13820
            ],
            [
                13820,
                13927
            ],
            [
                13927,
                13953
            ],
            [
                13953,
                14128
            ],
            [
                14128,
                14205
            ],
            [
                14205,
                14268
            ],
            [
                14268,
                14292
            ],
            [
                14292,
                14441
            ],
            [
                14441,
                14481
            ],
            [
                14481,
                14561
            ],
            [
                14561,
                14568
            ],
            [
                14568,
                14597
            ],
            [
                14597,
                14626
            ],
            [
                14626,
                14663
            ],
            [
                14663,
                14715
            ],
            [
                14715,
                14791
            ],
            [
                14791,
                14864
            ],
            [
                14864,
                14929
            ],
            [
                14929,
                14970
            ],
            [
                14970,
                15054
            ],
            [
                15054,
                15077
            ],
            [
                15077,
                15099
            ],
            [
                15099,
                15140
            ],
            [
                15140,
                15225
            ],
            [
                15225,
                15270
            ],
            [
                15270,
                15292
            ],
            [
                15292,
                15363
            ],
            [
                15363,
                15399
            ],
            [
                15399,
                15417
            ],
            [
                15417,
                15532
            ],
            [
                15532,
                15554
            ],
            [
                15554,
                15607
            ],
            [
                15607,
                15646
            ],
            [
                15646,
                15710
            ],
            [
                15710,
                15853
            ],
            [
                15853,
                15912
            ],
            [
                15912,
                15938
            ],
            [
                15938,
                15977
            ],
            [
                15977,
                16026
            ],
            [
                16026,
                16060
            ],
            [
                16060,
                16124
            ],
            [
                16124,
                16174
            ],
            [
                16174,
                16290
            ],
            [
                16290,
                16315
            ],
            [
                16315,
                16345
            ],
            [
                16345,
                16413
            ],
            [
                16413,
                16453
            ],
            [
                16453,
                16515
            ],
            [
                16515,
                16572
            ],
            [
                16572,
                16710
            ],
            [
                16710,
                16817
            ],
            [
                16817,
                16921
            ],
            [
                16921,
                16967
            ]
        ],
        "overlap_chars": [
            [
                0,
                66
            ],
            [
                79,
                102
            ],
            [
                103,
                116
            ],
            [
                116,
                118
            ],
            [
                118,
                158
            ],
            [
                158,
                223
            ],
            [
                226,
                238
            ],
            [
                251,
                253
            ],
            [
                253,
                311
            ],
            [
                314,
                316
            ],
            [
                316,
                339
            ],
            [
                346,
                387
            ],
            [
                387,
                421
            ],
            [
                427,
                436
            ],
            [
                441,
                452
            ],
            [
                453,
                476
            ],
            [
                477,
                485
            ],
            [
                485,
                545
            ],
            [
                545,
                573
            ],
            [
                574,
                582
            ],
            [
                594,
                623
            ],
            [
                624,
                627
            ],
            [
                636,
                637
            ],
            [
                638,
                641
            ],
            [
                649,
                661
            ],
            [
                661,
                719
            ],
            [
                726,
                731
            ],
            [
                731,
                747
            ],
            [
                748,
                839
            ],
            [
                842,
                846
            ],
            [
                847,
                856
            ],
            [
                857,
                909
            ],
            [
                909,
                972
            ],
            [
                972,
                1034
            ],
            [
                1035,
                1066
            ],
            [
                1067,
                1079
            ],
            [
                1079,
                1118
            ],
            [
                1119,
                1131
            ],
            [
                1131,
                1183
            ],
            [
                1183,
                1198
            ],
            [
                1207,
                1213
            ],
            [
                1213,
                1263
            ],
            [
                1263,
                1267
            ],
            [
                1275,
                1280
            ],
            [
                1299,
                1310
            ],
            [
                1310,
                1338
            ],
            [
                1346,
                1351
            ],
            [
                1351,
                1454
            ],
            [
                1454,
                1500
            ],
            [
                1500,
                1581
            ],
            [
                1588,
                1589
            ],
            [
                1590,
                1593
            ],
            [
                1594,
                1598
            ],
            [
                1599,
                1607
            ],
            [
                1608,
                1732
            ],
            [
                1732,
                1752
            ],
            [
                1753,
                1770
            ],
            [
                1770,
                1772
            ],
            [
                1772,
                1803
            ],
            [
                1804,
                1820
            ],
            [
                1821,
                1857
            ],
            [
                1857,
                1864
            ],
            [
                1865,
                1868
            ],
            [
                1869,
                1875
            ],
            [
                1876,
                1878
            ],
            [
                1885,
                1888
            ],
            [
                1889,
                1921
            ],
            [
                1927,
                1938
            ],
            [
                1945,
                1947
            ],
            [
                1947,
                2034
            ],
            [
                2034,
                2065
            ],
            [
                2066,
                2069
            ],
            [
                2074,
                2082
            ],
            [
                2083,
                2088
            ],
            [
                2089,
                2140
            ],
            [
                2140,
                2141
            ],
            [
                2142,
                2145
            ],
            [
                2150,
                2153
            ],
            [
                2167,
                2173
            ],
            [
                2174,
                2205
            ],
            [
                2205,
                2206
            ],
            [
                2207,
                2237
            ],
            [
                2237,
                2288
            ],
            [
                2289,
                2291
            ],
            [
                2292,
                2301
            ],
            [
                2306,
                2308
            ],
            [
                2309,
                2330
            ],
            [
                2330,
                2332
            ],
            [
                2332,
                2358
            ],
            [
                2358,
                2388
            ],
            [
                2390,
                2497
            ],
            [
                2502,
                2503
            ],
            [
                2504,
                2539
            ],
            [
                2539,
                2585
            ],
            [
                2586,
                2592
            ],
            [
                2592,
                2593
            ],
            [
                2600,
                2624
            ],
            [
                2625,
                2631
            ],
            [
                2641,
                2656
            ],
            [
                2656,
                2693
            ],
            [
                2694,
                2754
            ],
            [
                2754,
                2757
            ],
            [
                2757,
                2765
            ],
            [
                2769,
                2787
            ],
            [
                2787,
                2813
            ],
            [
                2813,
                2843
            ],
            [
                2861,
                2873
            ],
            [
                2876,
                2881
            ],
            [
                2881,
                2882
            ],
            [
                2883,
                2905
            ],
            [
                2906,
                3006
            ],
            [
                3009,
                3196
            ],
            [
                3196,
                3197
            ],
            [
                3197,
                3233
            ],
            [
                3233,
                3253
            ],
            [
                3253,
                3303
            ],
            [
                3304,
                3311
            ],
            [
                3311,
                3313
            ],
            [
                3313,
                3362
            ],
            [
                3363,
                3417
            ],
            [
                3420,
                3481
            ],
            [
                3481,
                3482
            ],
            [
                3482,
                3498
            ],
            [
                3498,
                3505
            ],
            [
                3505,
                3507
            ],
            [
                3511,
                3579
            ],
            [
                3587,
                3619
            ],
            [
                3622,
                3649
            ],
            [
                3658,
                3672
            ],
            [
                3672,
                3674
            ],
            [
                3674,
                3728
            ],
            [
                3728,
                3730
            ],
            [
                3730,
                3766
            ],
            [
                3766,
                3767
            ],
            [
                3770,
                3773
            ],
            [
                3773,
                3774
            ],
            [
                3775,
                3822
            ],
            [
                3823,
                3831
            ],
            [
                3831,
                3861
            ],
            [
                3861,
                3898
            ],
            [
                3898,
                3954
            ],
            [
                3955,
                3966
            ],
            [
                3967,
                4023
            ],
            [
                4023,
                4058
            ],
            [
                4058,
                4119
            ],
            [
                4119,
                4122
            ],
            [
                4122,
                4170
            ],
            [
                4170,
                4198
            ],
            [
                4200,
                4201
            ],
            [
                4213,
                4254
            ],
            [
                4254,
                4262
            ],
            [
                4270,
                4272
            ],
            [
                4272,
                4283
            ],
            [
                4283,
                4286
            ],
            [
                4286,
                4331
            ],
            [
                4331,
                4333
            ],
            [
                4333,
                4386
            ],
            [
                4387,
                4405
            ],
            [
                4407,
                4487
            ],
            [
                4487,
                4539
            ],
            [
                4539,
                4576
            ],
            [
                4576,
                4579
            ],
            [
                4579,
                4653
            ],
            [
                4653,
                4656
            ],
            [
                4656,
                4687
            ],
            [
                4687,
                4731
            ],
            [
                4735,
                4742
            ],
            [
                4750,
                4787
            ],
            [
                4787,
                4825
            ],
            [
                4825,
                4860
            ],
            [
                4860,
                4938
            ],
            [
                4938,
                4941
            ],
            [
                4941,
                4969
            ],
            [
                4969,
                4986
            ],
            [
                4989,
                5033
            ],
            [
                5033,
                5095
            ],
            [
                5095,
                5146
            ],
            [
                5146,
                5164
            ],
            [
                5170,
                5179
            ],
            [
                5179,
                5181
            ],
            [
                5181,
                5198
            ],
            [
                5198,
                5223
            ],
            [
                5224,
                5232
            ],
            [
                5233,
                5274
            ],
            [
                5274,
                5296
            ],
            [
                5296,
                5317
            ],
            [
                5319,
                5337
            ],
            [
                5338,
                5392
            ],
            [
                5392,
                5394
            ],
            [
                5395,
                5407
            ],
            [
                5408,
                5432
            ],
            [
                5433,
                5440
            ],
            [
                5449,
                5486
            ],
            [
                5487,
                5498
            ],
            [
                5502,
                5504
            ],
            [
                5504,
                5556
            ],
            [
                5556,
                5578
            ],
            [
                5579,
                5623
            ],
            [
                5624,
                5723
            ],
            [
                5728,
                5730
            ],
            [
                5730,
                5764
            ],
            [
                5779,
                5810
            ],
            [
                5811,
                5861
            ],
            [
                5862,
                5908
            ],
            [
                5908,
                5958
            ],
            [
                5976,
                5978
            ],
            [
                5978,
                6001
            ],
            [
                6009,
                6033
            ],
            [
                6033,
                6069
            ],
            [
                6069,
                6098
            ],
            [
                6104,
                6106
            ],
            [
                6112,
                6130
            ],
            [
                6130,
                6175
            ],
            [
                6175,
                6191
            ],
            [
                6192,
                6207
            ],
            [
                6207,
                6208
            ],
            [
                6209,
                6280
            ],
            [
                6283,
                6331
            ],
            [
                6332,
                6338
            ],
            [
                6338,
                6398
            ],
            [
                6400,
                6435
            ],
            [
                6436,
                6528
            ],
            [
                6532,
                6534
            ],
            [
                6535,
                6588
            ],
            [
                6597,
                6604
            ],
            [
                6604,
                6606
            ],
            [
                6606,
                6622
            ],
            [
                6623,
                6664
            ],
            [
                6664,
                6665
            ],
            [
                6666,
                6696
            ],
            [
                6697,
                6703
            ],
            [
                6703,
                6704
            ],
            [
                6705,
                6712
            ],
            [
                6713,
                6736
            ],
            [
                6746,
                6749
            ],
            [
                6750,
                6755
            ],
            [
                6756,
                6767
            ],
            [
                6768,
                6773
            ],
            [
                6774,
                6799
            ],
            [
                6799,
                6833
            ],
            [
                6834,
                6859
            ],
            [
                6872,
                6891
            ],
            [
                6891,
                6907
            ],
            [
                6915,
                6927
            ],
            [
                6928,
                6932
            ],
            [
                6933,
                6936
            ],
            [
                6936,
                6955
            ],
            [
                6956,
                6961
            ],
            [
                6962,
                7016
            ],
            [
                7016,
                7018
            ],
            [
                7018,
                7097
            ],
            [
                7098,
                7194
            ],
            [
                7195,
                7199
            ],
            [
                7200,
                7214
            ],
            [
                7214,
                7215
            ],
            [
                7229,
                7233
            ],
            [
                7234,
                7246
            ],
            [
                7253,
                7255
            ],
            [
                7256,
                7292
            ],
            [
                7292,
                7294
            ],
            [
                7303,
                7305
            ],
            [
                7314,
                7315
            ],
            [
                7316,
                7337
            ],
            [
                7338,
                7372
            ],
            [
                7372,
                7443
            ],
            [
                7443,
                7456
            ],
            [
                7456,
                7457
            ],
            [
                7458,
                7469
            ],
            [
                7470,
                7477
            ],
            [
                7478,
                7536
            ],
            [
                7536,
                7538
            ],
            [
                7538,
                7626
            ],
            [
                7626,
                7700
            ],
            [
                7700,
                7702
            ],
            [
                7702,
                7809
            ],
            [
                7809,
                7846
            ],
            [
                7846,
                7852
            ],
            [
                7853,
                7863
            ],
            [
                7864,
                7897
            ],
            [
                7897,
                7899
            ],
            [
                7899,
                7986
            ],
            [
                7990,
                7998
            ],
            [
                8002,
                8022
            ],
            [
                8022,
                8032
            ],
            [
                8032,
                8058
            ],
            [
                8058,
                8083
            ],
            [
                8088,
                8089
            ],
            [
                8090,
                8104
            ],
            [
                8104,
                8127
            ],
            [
                8128,
                8134
            ],
            [
                8142,
                8144
            ],
            [
                8144,
                8176
            ],
            [
                8177,
                8187
            ],
            [
                8187,
                8234
            ],
            [
                8234,
                8331
            ],
            [
                8331,
                8391
            ],
            [
                8391,
                8394
            ],
            [
                8394,
                8499
            ],
            [
                8502,
                8526
            ],
            [
                8526,
                8567
            ],
            [
                8586,
                8588
            ],
            [
                8588,
                8590
            ],
            [
                8596,
                8605
            ],
            [
                8606,
                8638
            ],
            [
                8639,
                8649
            ],
            [
                8649,
                8699
            ],
            [
                8700,
                8707
            ],
            [
                8710,
                8715
            ],
            [
                8720,
                8733
            ],
            [
                8734,
                8756
            ],
            [
                8756,
                8758
            ],
            [
                8758,
                8914
            ],
            [
                8914,
                8932
            ],
            [
                8933,
                8945
            ],
            [
                8945,
                8972
            ],
            [
                8972,
                8998
            ],
            [
                8998,
                9036
            ],
            [
                9036,
                9037
            ],
            [
                9053,
                9066
            ],
            [
                9066,
                9067
            ],
            [
                9068,
                9096
            ],
            [
                9096,
                9097
            ],
            [
                9098,
                9120
            ],
            [
                9121,
                9142
            ],
            [
                9142,
                9149
            ],
            [
                9149,
                9163
            ],
            [
                9163,
                9180
            ],
            [
                9180,
                9221
            ],
            [
                9221,
                9233
            ],
            [
                9234,
                9269
            ],
            [
                9269,
                9347
            ],
            [
                9347,
                9446
            ],
            [
                9449,
                9456
            ],
            [
                9456,
                9472
            ],
            [
                9475,
                9476
            ],
            [
                9476,
                9516
            ],
            [
                9516,
                9538
            ],
            [
                9538,
                9550
            ],
            [
                9551,
                9588
            ],
            [
                9588,
                9676
            ],
            [
                9676,
                9701
            ],
            [
                9701,
                9714
            ],
            [
                9714,
                9751
            ],
            [
                9751,
                9753
            ],
            [
                9753,
                9822
            ],
            [
                9822,
                9852
            ],
            [
                9852,
                9854
            ],
            [
                9854,
                9908
            ],
            [
                9911,
                9959
            ],
            [
                9959,
                10008
            ],
            [
                10009,
                10033
            ],
            [
                10033,
                10094
            ],
            [
                10094,
                10119
            ],
            [
                10119,
                10160
            ],
            [
                10161,
                10184
            ],
            [
                10184,
                10208
            ],
            [
                10208,
                10255
            ],
            [
                10255,
                10305
            ],
            [
                10305,
                10396
            ],
            [
                10396,
                10431
            ],
            [
                10431,
                10445
            ],
            [
                10445,
                10467
            ],
            [
                10467,
                10494
            ],
            [
                10495,
                10534
            ],
            [
                10560,
                10562
            ],
            [
                10562,
                10585
            ],
            [
                10592,
                10627
            ],
            [
                10627,
                10632
            ],
            [
                10633,
                10636
            ],
            [
                10637,
                10671
            ],
            [
                10672,
                10674
            ],
            [
                10675,
                10678
            ],
            [
                10679,
                10686
            ],
            [
                10690,
                10692
            ],
            [
                10698,
                10700
            ],
            [
                10700,
                10702
            ],
            [
                10711,
                10740
            ],
            [
                10741,
                10806
            ],
            [
                10806,
                10853
            ],
            [
                10853,
                10872
            ],
            [
                10872,
                10926
            ],
            [
                10926,
                10990
            ],
            [
                10993,
                10995
            ],
            [
                10996,
                11000
            ],
            [
                11001,
                11025
            ],
            [
                11025,
                11038
            ],
            [
                11043,
                11045
            ],
            [
                11046,
                11048
            ],
            [
                11049,
                11057
            ],
            [
                11058,
                11066
            ],
            [
                11068,
                11071
            ],
            [
                11072,
                11097
            ],
            [
                11097,
                11164
            ],
            [
                11164,
                11206
            ],
            [
                11206,
                11222
            ],
            [
                11222,
                11248
            ],
            [
                11248,
                11261
            ],
            [
                11262,
                11276
            ],
            [
                11276,
                11335
            ],
            [
                11335,
                11361
            ],
            [
                11361,
                11383
            ],
            [
                11383,
                11385
            ],
            [
                11385,
                11391
            ],
            [
                11392,
                11423
            ],
            [
                11426,
                11448
            ],
            [
                11458,
                11472
            ],
            [
                11473,
                11555
            ],
            [
                11563,
                11581
            ],
            [
                11582,
                11677
            ],
            [
                11677,
                11682
            ],
            [
                11683,
                11733
            ],
            [
                11733,
                11768
            ],
            [
                11768,
                11769
            ],
            [
                11770,
                11774
            ],
            [
                11775,
                11787
            ],
            [
                11787,
                11852
            ],
            [
                11853,
                11880
            ],
            [
                11888,
                11920
            ],
            [
                11920,
                11968
            ],
            [
                11969,
                11986
            ],
            [
                11986,
                12107
            ],
            [
                12107,
                12154
            ],
            [
                12154,
                12215
            ],
            [
                12215,
                12250
            ],
            [
                12250,
                12270
            ],
            [
                12270,
                12282
            ],
            [
                12282,
                12293
            ],
            [
                12293,
                12316
            ],
            [
                12316,
                12378
            ],
            [
                12378,
                12414
            ],
            [
                12414,
                12495
            ],
            [
                12498,
                12552
            ],
            [
                12553,
                12603
            ],
            [
                12603,
                12642
            ],
            [
                12645,
                12653
            ],
            [
                12654,
                12672
            ],
            [
                12672,
                12702
            ],
            [
                12702,
                12779
            ],
            [
                12780,
                12792
            ],
            [
                12802,
                12807
            ],
            [
                12808,
                12822
            ],
            [
                12822,
                12823
            ],
            [
                12824,
                12864
            ],
            [
                12864,
                12867
            ],
            [
                12867,
                12876
            ],
            [
                12876,
                12920
            ],
            [
                12920,
                12922
            ],
            [
                12922,
                12968
            ],
            [
                12968,
                12970
            ],
            [
                12971,
                12999
            ],
            [
                13000,
                13035
            ],
            [
                13035,
                13078
            ],
            [
                13078,
                13102
            ],
            [
                13102,
                13176
            ],
            [
                13176,
                13191
            ],
            [
                13191,
                13216
            ],
            [
                13216,
                13218
            ],
            [
                13238,
                13301
            ],
            [
                13310,
                13312
            ],
            [
                13312,
                13368
            ],
            [
                13368,
                13460
            ],
            [
                13460,
                13497
            ],
            [
                13497,
                13499
            ],
            [
                13499,
                13544
            ],
            [
                13552,
                13588
            ],
            [
                13588,
                13597
            ],
            [
                13598,
                13603
            ],
            [
                13605,
                13675
            ],
            [
                13675,
                13757
            ],
            [
                13757,
                13820
            ],
            [
                13820,
                13927
            ],
            [
                13927,
                13953
            ],
            [
                13953,
                14025
            ],
            [
                14026,
                14038
            ],
            [
                14039,
                14056
            ],
            [
                14057,
                14069
            ],
            [
                14070,
                14127
            ],
            [
                14128,
                14205
            ],
            [
                14205,
                14266
            ],
            [
                14266,
                14268
            ],
            [
                14268,
                14290
            ],
            [
                14290,
                14292
            ],
            [
                14292,
                14324
            ],
            [
                14325,
                14441
            ],
            [
                14441,
                14481
            ],
            [
                14481,
                14561
            ],
            [
                14561,
                14568
            ],
            [
                14568,
                14596
            ],
            [
                14597,
                14623
            ],
            [
                14623,
                14626
            ],
            [
                14626,
                14663
            ],
            [
                14663,
                14715
            ],
            [
                14715,
                14791
            ],
            [
                14791,
                14862
            ],
            [
                14862,
                14864
            ],
            [
                14864,
                14900
            ],
            [
                14901,
                14929
            ],
            [
                14929,
                14970
            ],
            [
                14970,
                14984
            ],
            [
                14985,
                15054
            ],
            [
                15054,
                15077
            ],
            [
                15077,
                15099
            ],
            [
                15099,
                15123
            ],
            [
                15126,
                15140
            ],
            [
                15140,
                15223
            ],
            [
                15225,
                15268
            ],
            [
                15270,
                15292
            ],
            [
                15292,
                15363
            ],
            [
                15363,
                15399
            ],
            [
                15399,
                15415
            ],
            [
                15417,
                15434
            ],
            [
                15434,
                15532
            ],
            [
                15532,
                15536
            ],
            [
                15540,
                15552
            ],
            [
                15552,
                15553
            ],
            [
                15554,
                15607
            ],
            [
                15607,
                15635
            ],
            [
                15636,
                15646
            ],
            [
                15646,
                15708
            ],
            [
                15708,
                15710
            ],
            [
                15710,
                15813
            ],
            [
                15822,
                15843
            ],
            [
                15850,
                15853
            ],
            [
                15853,
                15912
            ],
            [
                15912,
                15914
            ],
            [
                15915,
                15938
            ],
            [
                15938,
                15977
            ],
            [
                15977,
                16026
            ],
            [
                16026,
                16060
            ],
            [
                16060,
                16124
            ],
            [
                16124,
                16171
            ],
            [
                16171,
                16174
            ],
            [
                16174,
                16257
            ],
            [
                16286,
                16288
            ],
            [
                16288,
                16290
            ],
            [
                16290,
                16315
            ],
            [
                16315,
                16345
            ],
            [
                16345,
                16413
            ],
            [
                16414,
                16453
            ],
            [
                16453,
                16515
            ],
            [
                16515,
                16572
            ],
            [
                16572,
                16601
            ],
            [
                16606,
                16617
            ],
            [
                16618,
                16709
            ],
            [
                16710,
                16719
            ],
            [
                16720,
                16797
            ],
            [
                16798,
                16817
            ],
            [
                16817,
                16894
            ],
            [
                16894,
                16920
            ],
            [
                16921,
                16934
            ],
            [
                16939,
                16951
            ],
            [
                16952,
                16956
            ],
            [
                16957,
                16966
            ],
            [
                16966,
                16967
            ]
        ],
        "row_chars": [
            [
                0,
                118
            ],
            [
                118,
                158
            ],
            [
                158,
                253
            ],
            [
                253,
                253
            ],
            [
                253,
                316
            ],
            [
                316,
                387
            ],
            [
                387,
                485
            ],
            [
                485,
                545
            ],
            [
                545,
                661
            ],
            [
                661,
                909
            ],
            [
                909,
                1035
            ],
            [
                1035,
                1079
            ],
            [
                1079,
                1183
            ],
            [
                1183,
                1263
            ],
            [
                1263,
                1310
            ],
            [
                1310,
                1454
            ],
            [
                1454,
                1500
            ],
            [
                1500,
                1581
            ],
            [
                1581,
                1732
            ],
            [
                1732,
                1772
            ],
            [
                1772,
                1857
            ],
            [
                1857,
                1947
            ],
            [
                1947,
                2034
            ],
            [
                2034,
                2142
            ],
            [
                2142,
                2237
            ],
            [
                2237,
                2332
            ],
            [
                2332,
                2358
            ],
            [
                2358,
                2504
            ],
            [
                2504,
                2504
            ],
            [
                2504,
                2656
            ],
            [
                2656,
                2754
            ],
            [
                2754,
                2787
            ],
            [
                2787,
                2813
            ],
            [
                2813,
                3196
            ],
            [
                3196,
                3233
            ],
            [
                3233,
                3253
            ],
            [
                3253,
                3313
            ],
            [
                3313,
                3420
            ],
            [
                3420,
                3420
            ],
            [
                3420,
                3420
            ],
            [
                3420,
                3420
            ],
            [
                3420,
                3420
            ],
            [
                3420,
                3420
            ],
            [
                3420,
                3481
            ],
            [
                3481,
                3507
            ],
            [
                3507,
                3622
            ],
            [
                3622,
                3622
            ],
            [
                3622,
                3674
            ],
            [
                3674,
                3730
            ],
            [
                3730,
                3766
            ],
            [
                3766,
                3831
            ],
            [
                3831,
                3861
            ],
            [
                3861,
                3898
            ],
            [
                3898,
                3898
            ],
            [
                3898,
                3898
            ],
            [
                3898,
                3898
            ],
            [
                3898,
                3898
            ],
            [
                3898,
                3898
            ],
            [
                3898,
                3898
            ],
            [
                3898,
                3898
            ],
            [
                3898,
                4023
            ],
            [
                4023,
                4058
            ],
            [
                4058,
                4122
            ],
            [
                4122,
                4170
            ],
            [
                4170,
                4200
            ],
            [
                4200,
                4200
            ],
            [
                4200,
                4200
            ],
            [
                4200,
                4200
            ],
            [
                4200,
                4200
            ],
            [
                4200,
                4200
            ],
            [
                4200,
                4254
            ],
            [
                4254,
                4286
            ],
            [
                4286,
                4333
            ],
            [
                4333,
                4407
            ],
            [
                4407,
                4407
            ],
            [
                4407,
                4487
            ],
            [
                4487,
                4539
            ],
            [
                4539,
                4579
            ],
            [
                4579,
                4656
            ],
            [
                4656,
                4687
            ],
            [
                4687,
                4734
            ],
            [
                4734,
                4734
            ],
            [
                4734,
                4734
            ],
            [
                4734,
                4825
            ],
            [
                4825,
                4860
            ],
            [
                4860,
                4941
            ],
            [
                4941,
                4969
            ],
            [
                4969,
                5033
            ],
            [
                5033,
                5095
            ],
            [
                5095,
                5146
            ],
            [
                5146,
                5164
            ],
            [
                5164,
                5181
            ],
            [
                5181,
                5198
            ],
            [
                5198,
                5274
            ],
            [
                5274,
                5296
            ],
            [
                5296,
                5319
            ],
            [
                5319,
                5319
            ],
            [
                5319,
                5319
            ],
            [
                5319,
                5319
            ],
            [
                5319,
                5395
            ],
            [
                5395,
                5504
            ],
            [
                5504,
                5730
            ],
            [
                5730,
                5862
            ],
            [
                5862,
                5908
            ],
            [
                5908,
                5978
            ],
            [
                5978,
                6033
            ],
            [
                6033,
                6069
            ],
            [
                6069,
                6130
            ],
            [
                6130,
                6175
            ],
            [
                6175,
                6283
            ],
            [
                6283,
                6338
            ],
            [
                6338,
                6400
            ],
            [
                6400,
                6529
            ],
            [
                6529,
                6606
            ],
            [
                6606,
                6606
            ],
            [
                6606,
                6799
            ],
            [
                6799,
                6891
            ],
            [
                6891,
                6962
            ],
            [
                6962,
                7018
            ],
            [
                7018,
                7018
            ],
            [
                7018,
                7292
            ],
            [
                7292,
                7372
            ],
            [
                7372,
                7443
            ],
            [
                7443,
                7458
            ],
            [
                7458,
                7458
            ],
            [
                7458,
                7458
            ],
            [
                7458,
                7458
            ],
            [
                7458,
                7478
            ],
            [
                7478,
                7538
            ],
            [
                7538,
                7626
            ],
            [
                7626,
                7702
            ],
            [
                7702,
                7809
            ],
            [
                7809,
                7846
            ],
            [
                7846,
                7899
            ],
            [
                7899,
                8022
            ],
            [
                8022,
                8032
            ],
            [
                8032,
                8058
            ],
            [
                8058,
                8104
            ],
            [
                8104,
                8144
            ],
            [
                8144,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8187
            ],
            [
                8187,
                8234
            ],
            [
                8234,
                8331
            ],
            [
                8331,
                8331
            ],
            [
                8331,
                8331
            ],
            [
                8331,
                8394
            ],
            [
                8394,
                8526
            ],
            [
                8526,
                8526
            ],
            [
                8526,
                8588
            ],
            [
                8588,
                8588
            ],
            [
                8588,
                8649
            ],
            [
                8649,
                8758
            ],
            [
                8758,
                8914
            ],
            [
                8914,
                8914
            ],
            [
                8914,
                8972
            ],
            [
                8972,
                8998
            ],
            [
                8998,
                9038
            ],
            [
                9038,
                9142
            ],
            [
                9142,
                9149
            ],
            [
                9149,
                9180
            ],
            [
                9180,
                9221
            ],
            [
                9221,
                9221
            ],
            [
                9221,
                9269
            ],
            [
                9269,
                9347
            ],
            [
                9347,
                9456
            ],
            [
                9456,
                9456
            ],
            [
                9456,
                9475
            ],
            [
                9475,
                9475
            ],
            [
                9475,
                9516
            ],
            [
                9516,
                9538
            ],
            [
                9538,
                9588
            ],
            [
                9588,
                9676
            ],
            [
                9676,
                9701
            ],
            [
                9701,
                9714
            ],
            [
                9714,
                9753
            ],
            [
                9753,
                9822
            ],
            [
                9822,
                9854
            ],
            [
                9854,
                9959
            ],
            [
                9959,
                10033
            ],
            [
                10033,
                10094
            ],
            [
                10094,
                10119
            ],
            [
                10119,
                10160
            ],
            [
                10160,
                10160
            ],
            [
                10160,
                10184
            ],
            [
                10184,
                10208
            ],
            [
                10208,
                10208
            ],
            [
                10208,
                10255
            ],
            [
                10255,
                10305
            ],
            [
                10305,
                10396
            ],
            [
                10396,
                10431
            ],
            [
                10431,
                10445
            ],
            [
                10445,
                10467
            ],
            [
                10467,
                10562
            ],
            [
                10562,
                10627
            ],
            [
                10627,
                10700
            ],
            [
                10700,
                10806
            ],
            [
                10806,
                10853
            ],
            [
                10853,
                10872
            ],
            [
                10872,
                10926
            ],
            [
                10926,
                10990
            ],
            [
                10990,
                11025
            ],
            [
                11025,
                11046
            ],
            [
                11046,
                11097
            ],
            [
                11097,
                11164
            ],
            [
                11164,
                11206
            ],
            [
                11206,
                11222
            ],
            [
                11222,
                11248
            ],
            [
                11248,
                11276
            ],
            [
                11276,
                11335
            ],
            [
                11335,
                11361
            ],
            [
                11361,
                11385
            ],
            [
                11385,
                11426
            ],
            [
                11426,
                11426
            ],
            [
                11426,
                11555
            ],
            [
                11555,
                11582
            ],
            [
                11582,
                11677
            ],
            [
                11677,
                11733
            ],
            [
                11733,
                11787
            ],
            [
                11787,
                11853
            ],
            [
                11853,
                11853
            ],
            [
                11853,
                11853
            ],
            [
                11853,
                11853
            ],
            [
                11853,
                11853
            ],
            [
                11853,
                11920
            ],
            [
                11920,
                11968
            ],
            [
                11968,
                11968
            ],
            [
                11968,
                12107
            ],
            [
                12107,
                12154
            ],
            [
                12154,
                12215
            ],
            [
                12215,
                12250
            ],
            [
                12250,
                12270
            ],
            [
                12270,
                12282
            ],
            [
                12282,
                12293
            ],
            [
                12293,
                12316
            ],
            [
                12316,
                12378
            ],
            [
                12378,
                12414
            ],
            [
                12414,
                12498
            ],
            [
                12498,
                12552
            ],
            [
                12552,
                12552
            ],
            [
                12552,
                12603
            ],
            [
                12603,
                12672
            ],
            [
                12672,
                12867
            ],
            [
                12867,
                12876
            ],
            [
                12876,
                12922
            ],
            [
                12922,
                12968
            ],
            [
                12968,
                13035
            ],
            [
                13035,
                13078
            ],
            [
                13078,
                13102
            ],
            [
                13102,
                13176
            ],
            [
                13176,
                13191
            ],
            [
                13191,
                13218
            ],
            [
                13218,
                13312
            ],
            [
                13312,
                13368
            ],
            [
                13368,
                13460
            ],
            [
                13460,
                13499
            ],
            [
                13499,
                13588
            ],
            [
                13588,
                13605
            ],
            [
                13605,
                13605
            ],
            [
                13605,
                13675
            ],
            [
                13675,
                13757
            ],
            [
                13757,
                13757
            ],
            [
                13757,
                13820
            ],
            [
                13820,
                13927
            ],
            [
                13927,
                13953
            ],
            [
                13953,
                14128
            ],
            [
                14128,
                14205
            ],
            [
                14205,
                14268
            ],
            [
                14268,
                14292
            ],
            [
                14292,
                14441
            ],
            [
                14441,
                14481
            ],
            [
                14481,
                14561
            ],
            [
                14561,
                14568
            ],
            [
                14568,
                14597
            ],
            [
                14597,
                14597
            ],
            [
                14597,
                14626
            ],
            [
                14626,
                14663
            ],
            [
                14663,
                14715
            ],
            [
                14715,
                14791
            ],
            [
                14791,
                14864
            ],
            [
                14864,
                14929
            ],
            [
                14929,
                14970
            ],
            [
                14970,
                15054
            ],
            [
                15054,
                15077
            ],
            [
                15077,
                15099
            ],
            [
                15099,
                15140
            ],
            [
                15140,
                15140
            ],
            [
                15140,
                15225
            ],
            [
                15225,
                15225
            ],
            [
                15225,
                15270
            ],
            [
                15270,
                15292
            ],
            [
                15292,
                15363
            ],
            [
                15363,
                15399
            ],
            [
                15399,
                15417
            ],
            [
                15417,
                15417
            ],
            [
                15417,
                15532
            ],
            [
                15532,
                15554
            ],
            [
                15554,
                15607
            ],
            [
                15607,
                15646
            ],
            [
                15646,
                15710
            ],
            [
                15710,
                15853
            ],
            [
                15853,
                15912
            ],
            [
                15912,
                15912
            ],
            [
                15912,
                15912
            ],
            [
                15912,
                15938
            ],
            [
                15938,
                15977
            ],
            [
                15977,
                16026
            ],
            [
                16026,
                16060
            ],
            [
                16060,
                16124
            ],
            [
                16124,
                16174
            ],
            [
                16174,
                16290
            ],
            [
                16290,
                16315
            ],
            [
                16315,
                16345
            ],
            [
                16345,
                16413
            ],
            [
                16413,
                16413
            ],
            [
                16413,
                16453
            ],
            [
                16453,
                16515
            ],
            [
                16515,
                16572
            ],
            [
                16572,
                16710
            ],
            [
                16710,
                16817
            ],
            [
                16817,
                16921
            ],
            [
                16921,
                16967
            ]
        ]
    }
}