{
    "original": {
        "text": "Early in April, the Easter recess being all over, Lady Monk gave a grand party in London. Lady Monk's town house was in Gloucester Square. It was a large mansion, and Lady Monk's parties in London were known to be very great affairs. She usually gave two or three in the season, and spent a large portion of her time and energy in so arranging matters that her parties should be successful. As this was her special line in life, a failure would have been very distressing to her;--and we may also say very disgraceful, taking into consideration, as we should do in forming our judgement on the subject, the very large sums of Sir Cosmo's money which she spent in this way. But she seldom did fail. She knew how to select her days, so as not to fall foul of other events. It seldom happened that people could not come to her because of a division which occupied all the Members of Parliament, or that they were drawn away by the superior magnitude of some other attraction in the world of fashion. This giving of parties was her business, and she had learned it thoroughly. She worked at it harder than most men work at their trades, and let us hope that the profits were consolatory.\nIt was generally acknowledged to be the proper thing to go to Lady Monk's parties. There were certain people who were asked, and who went as a matter of course,--people who were by no means on intimate terms with Lady Monk, or with Sir Cosmo; but they were people to have whom was the proper thing, and they were people who understood that to go to Lady Monk's was the proper thing for them. The Duchess of St. Bungay was always there, though she hated Lady Monk, and Lady Monk always abused her; but a card was sent to the Duchess in the same way as the Lord Mayor invites a Cabinet Minister to dinner, even though the one man might believe the other to be a thief. And Mrs. Conway Sparkes was generally there; she went everywhere. Lady Monk did not at all know why Mrs. Conway Sparkes was so favoured by the world; but there was the fact, and she bowed to it. Then there were another set, the members of which were or were not invited, according to circumstances, at the time; and these were the people who were probably the most legitimate recipients of Lady Monk's hospitality. Old family friends of her husband were among the number. Let the Tuftons come in April, and perhaps again in May; then they will not feel their exclusion from that seventh heaven of glory,--the great culminating crush in July. Scores of young ladies who really loved parties belonged to this set. The mothers and aunts knew Lady Monk's sisters and cousins. They accepted so much of Lady Monk's good things as she vouchsafed them, and were thankful. Then there was another lot, which generally became, especially on that great July occasion, the most numerous of the three. It comprised all those who made strong interest to obtain admittance within her ladyship's house,--who struggled and fought almost with tooth and nail to get invitations. Against these people Lady Monk carried on an internecine war. Had she not done so she would have been swamped by them, and her success would have been at an end; but yet she never dreamed of shutting her doors against them altogether, or of saying boldly that none such should hamper her staircases. She knew that she must yield, but her effort was made to yield to as few as might be possible. When she was first told by her factotum in these operations that Mr. Bott wanted to come, she positively declined to have him. When it was afterwards intimated to her that the Duchess of St. Bungay had made a point of it, she sneered at the Duchess, and did not even then yield. But when at last it was brought home to her understanding that Mr. Palliser wished it, and that Mr. Palliser probably would not come himself unless his wishes were gratified, she gave way. She was especially anxious that Lady Glencora should come to her gathering, and she knew that Lady Glencora could not be had without Mr. Palliser.\nIt was very much desired by her that Lady Glencora should be there. \"Burgo,\" said she to her nephew, one morning, \"look here.\" Burgo was at the time staying with his aunt, in Gloucester Square, much to the annoyance of Sir Cosmo, who had become heartily tired of his nephew. The aunt and the nephew had been closeted together more than once lately, and perhaps they understood each other better now than they had done down at Monkshade. The aunt had handed a little note to Burgo, which he read and then threw back to her. \"You see that she is not afraid of coming,\" said Lady Monk.\n\"I suppose she doesn't think much about it,\" said Burgo.\n\"If that's what you really believe, you'd better give it up. Nothing on earth would justify such a step on your part except a thorough conviction that she is attached to you.\"\nBurgo looked at the fireplace, almost savagely, and his aunt looked at him very keenly. \"Well,\" she said, \"if there's to be an end of it, let there be an end of it.\"\n\"I think I'd better hang myself,\" he said.\n\"Burgo, I will not have you here if you talk to me in that way. I am trying to help you once again; but if you look like that, and talk like that, I will give it up.\"\n\"I think you'd better give it up.\"\n\"Are you becoming cowardly at last? With all your faults I never expected that of you.\"\n\"No; I am not a coward. I'd go out and fight him at two paces' distance with the greatest pleasure in the world.\"\n\"You know that's nonsense, Burgo. It's downright braggadocio. Men do not fight now; nor at any time would a man be called upon to fight, because you simply wanted to take his wife from him. If you had done it, indeed!\"\n\"How am I to do it? I'd do it to-morrow if it depended on me. No one can say that I'm afraid of anybody or of anything.\"\n\"I suppose something in the matter depends on her?\"\n\"I believe she loves me,--if you mean that?\"\n\"Look here, Burgo,\" and the considerate aunt gave to the impoverished and ruined nephew such counsel as she, in accordance with her lights, was enabled to bestow. \"I think you were much wronged in that matter. After what had passed I thought that you had a right to claim Lady Glencora as your wife. Mr. Palliser, in my mind, behaved very wrongly in stepping in between you and--you and such a fortune as hers, in that way. He cannot expect that his wife should have any affection for him. There is nobody alive who has a greater horror of anything improper in married women than I have. I have always shown it. When Lady Madeline Madtop left her husband, I would never allow her to come inside my doors again,--though I have no doubt he ill-used her dreadfully, and there was nothing ever proved between her and Colonel Graham. One can't be too particular in such matters. But here, if you,--if you can succeed, you know, I shall always regard the Palliser episode in Lady Glencora's life as a tragical accident. I shall indeed. Poor dear! It was done exactly as they make nuns of girls in Roman Catholic countries; and as I should think no harm of helping a nun out of her convent, so I should think no harm of helping her now. If you are to say anything to her, I think you might have an opportunity at the party.\"\nBurgo was still looking at the fireplace; and he sat on, looking and still looking, but he said nothing.\n\"You can think of what I have said, Burgo,\" continued his aunt, meaning that he should get up and go. But he did not go. \"Have you anything more that you wish to say to me?\" she asked.\n\"I've got no money,\" said Burgo, still looking at the fireplace.\nLady Glencora's property was worth not less than fifty thousand a year. He was a young man ambitious of obtaining that almost incredible amount of wealth, and who once had nearly reached it, by means of her love. His present obstacle consisted in his want of a twenty-pound note! \"I've got no money.\" The words were growled out rather than spoken, and his eyes were never turned even for a moment towards his aunt's face.\n\"You've never got any money,\" said she, speaking almost with passion.\n\"How can I help it? I can't make money. If I had a couple of hundred pounds, so that I could take her, I believe that she would go with me. It should not be my fault if she did not. It would have been all right if she had come to Monkshade.\"\n\"I've got no money for you, Burgo. I have not five pounds belonging to me.\"\n\"But you've got--?\"\n\"What?\" said Lady Monk, interrupting him sharply.\n\"Would Cosmo lend it me?\" said he, hesitating to go on with that suggestion which he had been about to make. The Cosmo of whom he spoke was not his uncle, but his cousin. No eloquence could have induced his uncle, Sir Cosmo, to lend him another shilling. But the son of the house was a man rich with his own wealth, and Burgo had not taxed him for some years.\n\"I do not know,\" said Lady Monk. \"I never see him. Probably not.\"\n\"It is hard,\" said Burgo. \"Fancy that a man should be ruined for two hundred pounds, just at such a moment of his life as this!\" He was a man bold by nature, and he did make his proposition. \"You have jewels, aunt;--could you not raise it for me? I would redeem them with the very first money that I got.\"\nLady Monk rose in a passion when the suggestion was first made, but before the interview was over she had promised that she would endeavour to do something in the way of raising money for him yet, once again. He was her favourite nephew, and the same almost to her as a child of her own. With one of her own children indeed she had quarrelled, and of the other, a married daughter, she rarely saw much. Such love as she had to give she gave to Burgo, and she promised him the money though she knew that she must raise it by some villanous falsehood to her husband.\nOn the same morning Lady Glencora went to Queen Anne Street with the purpose of inducing Alice to go to Lady Monk's party; but Alice would not accede to the proposition, though Lady Glencora pressed it with all her eloquence. \"I don't know her,\" said Alice.\n\"My dear,\" said Lady Glencora, \"that's absurd. Half the people there won't know her.\"\n\"But they know her set, or know her friends,--or, at any rate, will meet their own friends at her house. I should only bother you, and should not in the least gratify myself.\"\n\"The fact is, everybody will go who can, and I should have no sort of trouble in getting a card for you. Indeed I should simply write a note and say I meant to bring you.\"\n\"Pray don't do any such thing, for I certainly shall not go. I can't conceive why you should wish it.\"\n\"Mr. Fitzgerald will be there,\" said Lady Glencora, altering her voice altogether, and speaking in that low tone with which she used to win Alice's heart down at Matching. She was sitting close over the fire, leaning low, holding up her little hands as a screen to her face, and looking at her companion earnestly. \"I'm sure that he will be there, though nobody has told me.\"\n\"That may be a reason for your staying away,\" said Alice, slowly, \"but hardly a reason for my going with you.\"\nLady Glencora would not condescend to tell her friend in so many words that she wanted her protection. She could not bring herself to say that, though she wished it to be understood. \"Ah! I thought you would have gone,\" said she.\n\"It would be contrary to all my habits,\" said Alice: \"I never go to people's houses when I don't know them. It's a kind of society which I don't like. Pray do not ask me.\"\n\"Oh! very well. If it must be so, I won't press it.\" Lady Glencora had moved the position of one of her hands so as to get it to her pocket, and there had grasped a letter, which she still carried; but when Alice said those last cold words, \"Pray do not ask me,\" she released the grasp, and left the letter where it was. \"I suppose he won't bite me, at any rate,\" she said, and she assumed that look of childish drollery which she would sometimes put on, almost with a grimace, but still with so much prettiness that no one who saw her would regret it.\n\"He certainly can't bite you, if you will not let him.\"\n\"Do you know, Alice, though they all say that Plantagenet is one of the wisest men in London, I sometimes think that he is one of the greatest fools. Soon after we came to town I told him that we had better not go to that woman's house. Of course he understood me. He simply said that he wished that I should do so. 'I hate anything out of the way,' he said. 'There can be no reason why my wife should not go to Lady Monk's house as well as to any other.' There was an end of it, you know, as far as anything I could do was concerned. But there wasn't an end of it with him. He insists that I shall go, but he sends my duenna with me. Dear Mrs. Marsham is to be there!\"\n\"She'll do you no harm, I suppose?\"\n\"I'm not so sure of that, Alice. In the first place, one doesn't like to be followed everywhere by a policeman, even though one isn't going to pick a pocket. And then, the devil is so strong within me, that I should like to dodge the policeman. I can fancy a woman being driven to do wrong simply by a desire to show her policeman that she can be too many for him.\"\n\"Glencora, you make me so wretched when you talk like that.\"\n\"Will you go with me, then, so that I may have a policeman of my own choosing? He asked me if I would mind taking Mrs. Marsham with me in my carriage. So I up and spoke, very boldly, like the proud young porter, and told him I would not; and when he asked why not, I said that I preferred taking a friend of my own,--a young friend, I said, and I then named you or my cousin, Lady Jane. I told him I should bring one or the other.\"\n\"And was he angry?\"\n\"No; he took it very quietly,--saying something, in his calm way, about hoping that I should get over a prejudice against one of his earliest and dearest friends. He twits at me because I don't understand Parliament and the British Constitution, but I know more of them than he does about a woman. You are quite sure you won't go, then?\" Alice hesitated a moment. \"Do,\" said Lady Glencora; and there was an amount of persuasion in her accent which should, I think, have overcome her cousin's scruples.\n\"It is against the whole tenor of my life's way,\" she said, \"And, Glencora, I am not happy myself. I am not fit for parties. I sometimes think that I shall never go into society again.\"\n\"That's nonsense, you know.\"\n\"I suppose it is, but I cannot go now. I would if I really thought--\"\n\"Oh, very well,\" said Lady Glencora, interrupting her. \"I suppose I shall get through it. If he asks me to dance, I shall stand up with him, just as though I had never seen him before.\" Then she remembered the letter in her pocket,--remembered that at this moment she bore about with her a written proposition from this man to go off with him and leave her husband's house. She had intended to show it to Alice on this occasion; but as Alice had refused her request, she was glad that she had not done so. \"You'll come to me the morning after,\" said Lady Glencora, as she went. This Alice promised to do; and then she was left alone.\nAlice regretted,--regretted deeply that she had not consented to go with her cousin. After all, of what importance had been her objection when compared with the cause for which her presence had been desired? Doubtless she would have been uncomfortable at Lady Monk's house; but could she not have borne some hour or two of discomfort on her friend's behalf? But, in truth, it was only after Lady Glencora had left her that she began to understand the subject fully, and to feel that she might possibly have been of service in a great danger. But it was too late now. Then she strove to comfort herself with the reflection that a casual meeting at an evening party in London could not be perilous in the same degree as a prolonged sojourn together in a country house.",
        "paragraph_chars": [
            [
                0,
                1184
            ],
            [
                1184,
                4020
            ],
            [
                4020,
                4603
            ],
            [
                4603,
                4660
            ],
            [
                4660,
                4836
            ],
            [
                4836,
                5002
            ],
            [
                5002,
                5045
            ],
            [
                5045,
                5212
            ],
            [
                5212,
                5247
            ],
            [
                5247,
                5335
            ],
            [
                5335,
                5449
            ],
            [
                5449,
                5668
            ],
            [
                5668,
                5789
            ],
            [
                5789,
                5841
            ],
            [
                5841,
                5886
            ],
            [
                5886,
                7204
            ],
            [
                7204,
                7309
            ],
            [
                7309,
                7494
            ],
            [
                7494,
                7559
            ],
            [
                7559,
                7981
            ],
            [
                7981,
                8051
            ],
            [
                8051,
                8293
            ],
            [
                8293,
                8369
            ],
            [
                8369,
                8389
            ],
            [
                8389,
                8439
            ],
            [
                8439,
                8799
            ],
            [
                8799,
                8865
            ],
            [
                8865,
                9171
            ],
            [
                9171,
                9736
            ],
            [
                9736,
                9994
            ],
            [
                9994,
                10080
            ],
            [
                10080,
                10256
            ],
            [
                10256,
                10428
            ],
            [
                10428,
                10531
            ],
            [
                10531,
                10907
            ],
            [
                10907,
                11018
            ],
            [
                11018,
                11248
            ],
            [
                11248,
                11420
            ],
            [
                11420,
                11973
            ],
            [
                11973,
                12029
            ],
            [
                12029,
                12699
            ],
            [
                12699,
                12735
            ],
            [
                12735,
                13101
            ],
            [
                13101,
                13162
            ],
            [
                13162,
                13594
            ],
            [
                13594,
                13614
            ],
            [
                13614,
                14116
            ],
            [
                14116,
                14302
            ],
            [
                14302,
                14331
            ],
            [
                14331,
                14401
            ],
            [
                14401,
                15035
            ],
            [
                15035,
                15801
            ]
        ],
        "segment_chars": [
            [
                0,
                90
            ],
            [
                90,
                139
            ],
            [
                139,
                234
            ],
            [
                234,
                391
            ],
            [
                391,
                673
            ],
            [
                673,
                698
            ],
            [
                698,
                771
            ],
            [
                771,
                997
            ],
            [
                997,
                1073
            ],
            [
                1073,
                1184
            ],
            [
                1184,
                1267
            ],
            [
                1267,
                1576
            ],
            [
                1576,
                1851
            ],
            [
                1851,
                1917
            ],
            [
                1917,
                2046
            ],
            [
                2046,
                2266
            ],
            [
                2266,
                2323
            ],
            [
                2323,
                2493
            ],
            [
                2493,
                2563
            ],
            [
                2563,
                2623
            ],
            [
                2623,
                2715
            ],
            [
                2715,
                2839
            ],
            [
                2839,
                3010
            ],
            [
                3010,
                3072
            ],
            [
                3072,
                3310
            ],
            [
                3310,
                3405
            ],
            [
                3405,
                3532
            ],
            [
                3532,
                3684
            ],
            [
                3684,
                3873
            ],
            [
                3873,
                4020
            ],
            [
                4020,
                4088
            ],
            [
                4088,
                4147
            ],
            [
                4147,
                4295
            ],
            [
                4295,
                4457
            ],
            [
                4457,
                4543
            ],
            [
                4543,
                4603
            ],
            [
                4603,
                4660
            ],
            [
                4660,
                4721
            ],
            [
                4721,
                4836
            ],
            [
                4836,
                4924
            ],
            [
                4924,
                5002
            ],
            [
                5002,
                5045
            ],
            [
                5045,
                5109
            ],
            [
                5109,
                5212
            ],
            [
                5212,
                5247
            ],
            [
                5247,
                5283
            ],
            [
                5283,
                5335
            ],
            [
                5335,
                5359
            ],
            [
                5359,
                5449
            ],
            [
                5449,
                5483
            ],
            [
                5483,
                5511
            ],
            [
                5511,
                5639
            ],
            [
                5639,
                5668
            ],
            [
                5668,
                5688
            ],
            [
                5688,
                5730
            ],
            [
                5730,
                5789
            ],
            [
                5789,
                5841
            ],
            [
                5841,
                5886
            ],
            [
                5886,
                6049
            ],
            [
                6049,
                6096
            ],
            [
                6096,
                6186
            ],
            [
                6186,
                6310
            ],
            [
                6310,
                6376
            ],
            [
                6376,
                6474
            ],
            [
                6474,
                6498
            ],
            [
                6498,
                6715
            ],
            [
                6715,
                6760
            ],
            [
                6760,
                6900
            ],
            [
                6900,
                6916
            ],
            [
                6916,
                6927
            ],
            [
                6927,
                7116
            ],
            [
                7116,
                7204
            ],
            [
                7204,
                7309
            ],
            [
                7309,
                7411
            ],
            [
                7411,
                7430
            ],
            [
                7430,
                7483
            ],
            [
                7483,
                7494
            ],
            [
                7494,
                7559
            ],
            [
                7559,
                7631
            ],
            [
                7631,
                7772
            ],
            [
                7772,
                7839
            ],
            [
                7839,
                7860
            ],
            [
                7860,
                7981
            ],
            [
                7981,
                8051
            ],
            [
                8051,
                8071
            ],
            [
                8071,
                8091
            ],
            [
                8091,
                8191
            ],
            [
                8191,
                8233
            ],
            [
                8233,
                8293
            ],
            [
                8293,
                8328
            ],
            [
                8328,
                8369
            ],
            [
                8369,
                8389
            ],
            [
                8389,
                8397
            ],
            [
                8397,
                8439
            ],
            [
                8439,
                8465
            ],
            [
                8465,
                8548
            ],
            [
                8548,
                8610
            ],
            [
                8610,
                8694
            ],
            [
                8694,
                8799
            ],
            [
                8799,
                8832
            ],
            [
                8832,
                8850
            ],
            [
                8850,
                8865
            ],
            [
                8865,
                8891
            ],
            [
                8891,
                8994
            ],
            [
                8994,
                9056
            ],
            [
                9056,
                9112
            ],
            [
                9112,
                9171
            ],
            [
                9171,
                9380
            ],
            [
                9380,
                9459
            ],
            [
                9459,
                9574
            ],
            [
                9574,
                9736
            ],
            [
                9736,
                9962
            ],
            [
                9962,
                9994
            ],
            [
                9994,
                10041
            ],
            [
                10041,
                10080
            ],
            [
                10080,
                10185
            ],
            [
                10185,
                10256
            ],
            [
                10256,
                10361
            ],
            [
                10361,
                10428
            ],
            [
                10428,
                10489
            ],
            [
                10489,
                10531
            ],
            [
                10531,
                10703
            ],
            [
                10703,
                10846
            ],
            [
                10846,
                10907
            ],
            [
                10907,
                11018
            ],
            [
                11018,
                11121
            ],
            [
                11121,
                11201
            ],
            [
                11201,
                11206
            ],
            [
                11206,
                11248
            ],
            [
                11248,
                11356
            ],
            [
                11356,
                11399
            ],
            [
                11399,
                11420
            ],
            [
                11420,
                11425
            ],
            [
                11425,
                11436
            ],
            [
                11436,
                11473
            ],
            [
                11473,
                11741
            ],
            [
                11741,
                11973
            ],
            [
                11973,
                12029
            ],
            [
                12029,
                12179
            ],
            [
                12179,
                12266
            ],
            [
                12266,
                12294
            ],
            [
                12294,
                12345
            ],
            [
                12345,
                12388
            ],
            [
                12388,
                12485
            ],
            [
                12485,
                12564
            ],
            [
                12564,
                12604
            ],
            [
                12604,
                12664
            ],
            [
                12664,
                12699
            ],
            [
                12699,
                12735
            ],
            [
                12735,
                12768
            ],
            [
                12768,
                12893
            ],
            [
                12893,
                12980
            ],
            [
                12980,
                13101
            ],
            [
                13101,
                13162
            ],
            [
                13162,
                13241
            ],
            [
                13241,
                13313
            ],
            [
                13313,
                13549
            ],
            [
                13549,
                13594
            ],
            [
                13594,
                13614
            ],
            [
                13614,
                13777
            ],
            [
                13777,
                13912
            ],
            [
                13912,
                13952
            ],
            [
                13952,
                13978
            ],
            [
                13978,
                14116
            ],
            [
                14116,
                14215
            ],
            [
                14215,
                14241
            ],
            [
                14241,
                14302
            ],
            [
                14302,
                14331
            ],
            [
                14331,
                14370
            ],
            [
                14370,
                14401
            ],
            [
                14401,
                14456
            ],
            [
                14456,
                14491
            ],
            [
                14491,
                14587
            ],
            [
                14587,
                14775
            ],
            [
                14775,
                14907
            ],
            [
                14907,
                14979
            ],
            [
                14979,
                15035
            ],
            [
                15035,
                15120
            ],
            [
                15120,
                15243
            ],
            [
                15243,
                15393
            ],
            [
                15393,
                15577
            ],
            [
                15577,
                15602
            ],
            [
                15602,
                15801
            ]
        ],
        "overlap_chars": [
            [
                0,
                14
            ],
            [
                48,
                88
            ],
            [
                14,
                15
            ],
            [
                102,
                112
            ],
            [
                117,
                139
            ],
            [
                238,
                263
            ],
            [
                361,
                368
            ],
            [
                264,
                288
            ],
            [
                312,
                327
            ],
            [
                352,
                356
            ],
            [
                376,
                391
            ],
            [
                677,
                687
            ],
            [
                696,
                697
            ],
            [
                1184,
                1267
            ],
            [
                1267,
                1292
            ],
            [
                1313,
                1343
            ],
            [
                1346,
                1373
            ],
            [
                1392,
                1425
            ],
            [
                1307,
                1308
            ],
            [
                1427,
                1430
            ],
            [
                1456,
                1460
            ],
            [
                1461,
                1464
            ],
            [
                1469,
                1475
            ],
            [
                1448,
                1450
            ],
            [
                1574,
                1576
            ],
            [
                1576,
                1646
            ],
            [
                1679,
                1680
            ],
            [
                1851,
                1894
            ],
            [
                1646,
                1647
            ],
            [
                1917,
                1934
            ],
            [
                1942,
                2004
            ],
            [
                2015,
                2023
            ],
            [
                1692,
                1695
            ],
            [
                2023,
                2045
            ],
            [
                2046,
                2074
            ],
            [
                2189,
                2197
            ],
            [
                2113,
                2120
            ],
            [
                2264,
                2266
            ],
            [
                2305,
                2310
            ],
            [
                2300,
                2304
            ],
            [
                2266,
                2299
            ],
            [
                2352,
                2357
            ],
            [
                2493,
                2515
            ],
            [
                2567,
                2623
            ],
            [
                2623,
                2636
            ],
            [
                2640,
                2678
            ],
            [
                2690,
                2714
            ],
            [
                2715,
                2741
            ],
            [
                2741,
                2748
            ],
            [
                2807,
                2839
            ],
            [
                2839,
                2865
            ],
            [
                2956,
                2969
            ],
            [
                2975,
                3010
            ],
            [
                3031,
                3040
            ],
            [
                3072,
                3075
            ],
            [
                3123,
                3127
            ],
            [
                3127,
                3128
            ],
            [
                3092,
                3119
            ],
            [
                3170,
                3175
            ],
            [
                3076,
                3079
            ],
            [
                3080,
                3083
            ],
            [
                3210,
                3243
            ],
            [
                3308,
                3310
            ],
            [
                3338,
                3339
            ],
            [
                3310,
                3313
            ],
            [
                3373,
                3385
            ],
            [
                3395,
                3404
            ],
            [
                3405,
                3428
            ],
            [
                3465,
                3509
            ],
            [
                3519,
                3532
            ],
            [
                3532,
                3543
            ],
            [
                3572,
                3606
            ],
            [
                3623,
                3666
            ],
            [
                3677,
                3684
            ],
            [
                3684,
                3692
            ],
            [
                3742,
                3824
            ],
            [
                3857,
                3873
            ],
            [
                3873,
                3952
            ],
            [
                3967,
                4020
            ],
            [
                4088,
                4119
            ],
            [
                4121,
                4147
            ],
            [
                4147,
                4156
            ],
            [
                4169,
                4181
            ],
            [
                4192,
                4253
            ],
            [
                4265,
                4295
            ],
            [
                4295,
                4345
            ],
            [
                4361,
                4367
            ],
            [
                4455,
                4457
            ],
            [
                4470,
                4518
            ],
            [
                4524,
                4542
            ],
            [
                4543,
                4603
            ],
            [
                4603,
                4631
            ],
            [
                4637,
                4645
            ],
            [
                4632,
                4636
            ],
            [
                4645,
                4660
            ],
            [
                4660,
                4721
            ],
            [
                4721,
                4728
            ],
            [
                4738,
                4785
            ],
            [
                4795,
                4836
            ],
            [
                4836,
                4923
            ],
            [
                5002,
                5045
            ],
            [
                5045,
                5089
            ],
            [
                5099,
                5109
            ],
            [
                5109,
                5132
            ],
            [
                5143,
                5212
            ],
            [
                5212,
                5247
            ],
            [
                5247,
                5273
            ],
            [
                5335,
                5336
            ],
            [
                5340,
                5359
            ],
            [
                5359,
                5383
            ],
            [
                5407,
                5449
            ],
            [
                5449,
                5481
            ],
            [
                5688,
                5691
            ],
            [
                5708,
                5710
            ],
            [
                5728,
                5730
            ],
            [
                5730,
                5760
            ],
            [
                5842,
                5864
            ],
            [
                5886,
                5905
            ],
            [
                5910,
                5913
            ],
            [
                5926,
                5930
            ],
            [
                6014,
                6017
            ],
            [
                5960,
                5973
            ],
            [
                6047,
                6049
            ],
            [
                6049,
                6096
            ],
            [
                6118,
                6186
            ],
            [
                6186,
                6263
            ],
            [
                6273,
                6295
            ],
            [
                6308,
                6310
            ],
            [
                6310,
                6376
            ],
            [
                6402,
                6474
            ],
            [
                6760,
                6763
            ],
            [
                6770,
                6776
            ],
            [
                6790,
                6797
            ],
            [
                6807,
                6880
            ],
            [
                6890,
                6900
            ],
            [
                6916,
                6927
            ],
            [
                7073,
                7110
            ],
            [
                7114,
                7116
            ],
            [
                7116,
                7150
            ],
            [
                7159,
                7204
            ],
            [
                7494,
                7512
            ],
            [
                7860,
                7910
            ],
            [
                7938,
                7942
            ],
            [
                7964,
                7972
            ],
            [
                7979,
                7981
            ],
            [
                7981,
                8019
            ],
            [
                8049,
                8051
            ],
            [
                8051,
                8071
            ],
            [
                8071,
                8091
            ],
            [
                8091,
                8152
            ],
            [
                8152,
                8189
            ],
            [
                8293,
                8328
            ],
            [
                8328,
                8338
            ],
            [
                8339,
                8350
            ],
            [
                8366,
                8369
            ],
            [
                8439,
                8465
            ],
            [
                8465,
                8472
            ],
            [
                8546,
                8548
            ],
            [
                8548,
                8557
            ],
            [
                8566,
                8568
            ],
            [
                8575,
                8610
            ],
            [
                8623,
                8694
            ],
            [
                8694,
                8724
            ],
            [
                8729,
                8733
            ],
            [
                8725,
                8728
            ],
            [
                8797,
                8799
            ],
            [
                8799,
                8801
            ],
            [
                8809,
                8832
            ],
            [
                8832,
                8850
            ],
            [
                8850,
                8865
            ],
            [
                8865,
                8891
            ],
            [
                8891,
                8949
            ],
            [
                8955,
                8991
            ],
            [
                9057,
                9079
            ],
            [
                9081,
                9112
            ],
            [
                9112,
                9171
            ],
            [
                9171,
                9180
            ],
            [
                9186,
                9188
            ],
            [
                9199,
                9203
            ],
            [
                9233,
                9234
            ],
            [
                9363,
                9366
            ],
            [
                9239,
                9300
            ],
            [
                9311,
                9313
            ],
            [
                9349,
                9362
            ],
            [
                9378,
                9380
            ],
            [
                9380,
                9407
            ],
            [
                9457,
                9459
            ],
            [
                9495,
                9513
            ],
            [
                9459,
                9487
            ],
            [
                9513,
                9518
            ],
            [
                9557,
                9567
            ],
            [
                9522,
                9551
            ],
            [
                9572,
                9574
            ],
            [
                9574,
                9602
            ],
            [
                9603,
                9699
            ],
            [
                9710,
                9736
            ],
            [
                9736,
                9777
            ],
            [
                9825,
                9830
            ],
            [
                9904,
                9905
            ],
            [
                9886,
                9888
            ],
            [
                9947,
                9950
            ],
            [
                9831,
                9878
            ],
            [
                9960,
                9961
            ],
            [
                9962,
                9981
            ],
            [
                9982,
                9986
            ],
            [
                9992,
                9994
            ],
            [
                9994,
                10041
            ],
            [
                10041,
                10080
            ],
            [
                10080,
                10098
            ],
            [
                10116,
                10123
            ],
            [
                10256,
                10257
            ],
            [
                10301,
                10317
            ],
            [
                10326,
                10361
            ],
            [
                10361,
                10428
            ],
            [
                10428,
                10489
            ],
            [
                10489,
                10496
            ],
            [
                10506,
                10513
            ],
            [
                10521,
                10531
            ],
            [
                10531,
                10582
            ],
            [
                10618,
                10629
            ],
            [
                10635,
                10643
            ],
            [
                10701,
                10703
            ],
            [
                10703,
                10706
            ],
            [
                10818,
                10846
            ],
            [
                10846,
                10907
            ],
            [
                10907,
                10963
            ],
            [
                10965,
                11018
            ],
            [
                11018,
                11031
            ],
            [
                11125,
                11160
            ],
            [
                11094,
                11108
            ],
            [
                11065,
                11071
            ],
            [
                11109,
                11119
            ],
            [
                11160,
                11201
            ],
            [
                11201,
                11206
            ],
            [
                11206,
                11248
            ],
            [
                11301,
                11356
            ],
            [
                11399,
                11420
            ],
            [
                11420,
                11425
            ],
            [
                11425,
                11436
            ],
            [
                11454,
                11473
            ],
            [
                11473,
                11490
            ],
            [
                11513,
                11516
            ],
            [
                11549,
                11564
            ],
            [
                11571,
                11591
            ],
            [
                11616,
                11740
            ],
            [
                11741,
                11793
            ],
            [
                11882,
                11888
            ],
            [
                11815,
                11840
            ],
            [
                11971,
                11973
            ],
            [
                11973,
                12029
            ],
            [
                12029,
                12179
            ],
            [
                12179,
                12266
            ],
            [
                12266,
                12289
            ],
            [
                12292,
                12294
            ],
            [
                12294,
                12345
            ],
            [
                12345,
                12388
            ],
            [
                12388,
                12458
            ],
            [
                12482,
                12485
            ],
            [
                12604,
                12664
            ],
            [
                12664,
                12699
            ],
            [
                12699,
                12735
            ],
            [
                12735,
                12751
            ],
            [
                12759,
                12768
            ],
            [
                12768,
                12893
            ],
            [
                12893,
                12896
            ],
            [
                12903,
                12964
            ],
            [
                13101,
                13123
            ],
            [
                13127,
                13162
            ],
            [
                13162,
                13241
            ],
            [
                13241,
                13263
            ],
            [
                13276,
                13313
            ],
            [
                13313,
                13317
            ],
            [
                13378,
                13450
            ],
            [
                13479,
                13486
            ],
            [
                13460,
                13476
            ],
            [
                13503,
                13508
            ],
            [
                13514,
                13547
            ],
            [
                13594,
                13614
            ],
            [
                13614,
                13642
            ],
            [
                13642,
                13643
            ],
            [
                13652,
                13661
            ],
            [
                13680,
                13777
            ],
            [
                13777,
                13875
            ],
            [
                13879,
                13912
            ],
            [
                13912,
                13952
            ],
            [
                13952,
                13978
            ],
            [
                13978,
                14002
            ],
            [
                14114,
                14116
            ],
            [
                14215,
                14241
            ],
            [
                14241,
                14302
            ],
            [
                14302,
                14331
            ],
            [
                14331,
                14368
            ],
            [
                14401,
                14436
            ],
            [
                14454,
                14456
            ],
            [
                14456,
                14491
            ],
            [
                14491,
                14587
            ],
            [
                14587,
                14632
            ],
            [
                14689,
                14690
            ],
            [
                14699,
                14727
            ],
            [
                14748,
                14765
            ],
            [
                14744,
                14747
            ],
            [
                14728,
                14743
            ],
            [
                14773,
                14775
            ],
            [
                14834,
                14897
            ],
            [
                14800,
                14805
            ],
            [
                14905,
                14906
            ],
            [
                14907,
                14908
            ],
            [
                14915,
                14979
            ],
            [
                14979,
                15035
            ],
            [
                15079,
                15082
            ],
            [
                15035,
                15040
            ],
            [
                15097,
                15099
            ],
            [
                15050,
                15051
            ],
            [
                15070,
                15078
            ],
            [
                15118,
                15120
            ],
            [
                15150,
                15153
            ],
            [
                15187,
                15191
            ],
            [
                15159,
                15162
            ],
            [
                15243,
                15337
            ],
            [
                15343,
                15392
            ],
            [
                15581,
                15602
            ],
            [
                15607,
                15721
            ],
            [
                15722,
                15730
            ],
            [
                15750,
                15764
            ],
            [
                15773,
                15801
            ]
        ],
        "row_chars": [
            [
                0,
                139
            ],
            [
                139,
                234
            ],
            [
                234,
                391
            ],
            [
                391,
                673
            ],
            [
                673,
                698
            ],
            [
                698,
                771
            ],
            [
                771,
                997
            ],
            [
                997,
                1073
            ],
            [
                1073,
                1184
            ],
            [
                1184,
                1267
            ],
            [
                1267,
                1576
            ],
            [
                1576,
                2046
            ],
            [
                2046,
                2266
            ],
            [
                2266,
                2623
            ],
            [
                2623,
                2715
            ],
            [
                2715,
                2839
            ],
            [
                2839,
                3010
            ],
            [
                3010,
                3310
            ],
            [
                3310,
                3405
            ],
            [
                3405,
                3532
            ],
            [
                3532,
                3684
            ],
            [
                3684,
                3873
            ],
            [
                3873,
                4020
            ],
            [
                4020,
                4088
            ],
            [
                4088,
                4147
            ],
            [
                4147,
                4295
            ],
            [
                4295,
                4457
            ],
            [
                4457,
                4543
            ],
            [
                4543,
                4603
            ],
            [
                4603,
                4660
            ],
            [
                4660,
                4721
            ],
            [
                4721,
                4836
            ],
            [
                4836,
                4924
            ],
            [
                4924,
                5002
            ],
            [
                5002,
                5045
            ],
            [
                5045,
                5109
            ],
            [
                5109,
                5212
            ],
            [
                5212,
                5247
            ],
            [
                5247,
                5283
            ],
            [
                5283,
                5335
            ],
            [
                5335,
                5359
            ],
            [
                5359,
                5449
            ],
            [
                5449,
                5483
            ],
            [
                5483,
                5511
            ],
            [
                5511,
                5639
            ],
            [
                5639,
                5668
            ],
            [
                5668,
                5688
            ],
            [
                5688,
                5730
            ],
            [
                5730,
                5789
            ],
            [
                5789,
                5841
            ],
            [
                5841,
                5886
            ],
            [
                5886,
                6049
            ],
            [
                6049,
                6096
            ],
            [
                6096,
                6186
            ],
            [
                6186,
                6310
            ],
            [
                6310,
                6376
            ],
            [
                6376,
                6474
            ],
            [
                6474,
                6498
            ],
            [
                6498,
                6715
            ],
            [
                6715,
                6760
            ],
            [
                6760,
                6900
            ],
            [
                6900,
                6916
            ],
            [
                6916,
                6927
            ],
            [
                6927,
                7116
            ],
            [
                7116,
                7204
            ],
            [
                7204,
                7309
            ],
            [
                7309,
                7411
            ],
            [
                7411,
                7430
            ],
            [
                7430,
                7483
            ],
            [
                7483,
                7494
            ],
            [
                7494,
                7559
            ],
            [
                7559,
                7631
            ],
            [
                7631,
                7772
            ],
            [
                7772,
                7839
            ],
            [
                7839,
                7860
            ],
            [
                7860,
                7981
            ],
            [
                7981,
                8051
            ],
            [
                8051,
                8071
            ],
            [
                8071,
                8091
            ],
            [
                8091,
                8191
            ],
            [
                8191,
                8233
            ],
            [
                8233,
                8293
            ],
            [
                8293,
                8328
            ],
            [
                8328,
                8369
            ],
            [
                8369,
                8389
            ],
            [
                8389,
                8397
            ],
            [
                8397,
                8439
            ],
            [
                8439,
                8465
            ],
            [
                8465,
                8548
            ],
            [
                8548,
                8610
            ],
            [
                8610,
                8694
            ],
            [
                8694,
                8799
            ],
            [
                8799,
                8832
            ],
            [
                8832,
                8850
            ],
            [
                8850,
                8865
            ],
            [
                8865,
                8891
            ],
            [
                8891,
                8994
            ],
            [
                8994,
                9056
            ],
            [
                9056,
                9112
            ],
            [
                9112,
                9171
            ],
            [
                9171,
                9380
            ],
            [
                9380,
                9459
            ],
            [
                9459,
                9574
            ],
            [
                9574,
                9736
            ],
            [
                9736,
                9962
            ],
            [
                9962,
                9994
            ],
            [
                9994,
                10041
            ],
            [
                10041,
                10080
            ],
            [
                10080,
                10185
            ],
            [
                10185,
                10256
            ],
            [
                10256,
                10361
            ],
            [
                10361,
                10428
            ],
            [
                10428,
                10489
            ],
            [
                10489,
                10531
            ],
            [
                10531,
                10703
            ],
            [
                10703,
                10846
            ],
            [
                10846,
                10907
            ],
            [
                10907,
                11018
            ],
            [
                11018,
                11201
            ],
            [
                11201,
                11206
            ],
            [
                11206,
                11248
            ],
            [
                11248,
                11356
            ],
            [
                11356,
                11399
            ],
            [
                11399,
                11420
            ],
            [
                11420,
                11425
            ],
            [
                11425,
                11436
            ],
            [
                11436,
                11473
            ],
            [
                11473,
                11741
            ],
            [
                11741,
                11973
            ],
            [
                11973,
                12029
            ],
            [
                12029,
                12179
            ],
            [
                12179,
                12266
            ],
            [
                12266,
                12294
            ],
            [
                12294,
                12345
            ],
            [
                12345,
                12388
            ],
            [
                12388,
                12485
            ],
            [
                12485,
                12564
            ],
            [
                12564,
                12604
            ],
            [
                12604,
                12664
            ],
            [
                12664,
                12699
            ],
            [
                12699,
                12735
            ],
            [
                12735,
                12768
            ],
            [
                12768,
                12893
            ],
            [
                12893,
                12980
            ],
            [
                12980,
                13101
            ],
            [
                13101,
                13162
            ],
            [
                13162,
                13241
            ],
            [
                13241,
                13313
            ],
            [
                13313,
                13549
            ],
            [
                13549,
                13594
            ],
            [
                13594,
                13614
            ],
            [
                13614,
                13777
            ],
            [
                13777,
                13912
            ],
            [
                13912,
                13952
            ],
            [
                13952,
                13978
            ],
            [
                13978,
                14116
            ],
            [
                14116,
                14215
            ],
            [
                14215,
                14241
            ],
            [
                14241,
                14302
            ],
            [
                14302,
                14331
            ],
            [
                14331,
                14370
            ],
            [
                14370,
                14401
            ],
            [
                14401,
                14456
            ],
            [
                14456,
                14491
            ],
            [
                14491,
                14587
            ],
            [
                14587,
                14775
            ],
            [
                14775,
                14907
            ],
            [
                14907,
                14979
            ],
            [
                14979,
                15035
            ],
            [
                15035,
                15120
            ],
            [
                15120,
                15243
            ],
            [
                15243,
                15393
            ],
            [
                15393,
                15577
            ],
            [
                15577,
                15602
            ],
            [
                15602,
                15801
            ]
        ]
    },
    "abridged": {
        "text": "Early in April, Lady Monk gave a grand party in London, at her large town house in Gloucester Square. Lady Monk usually gave two or three such parties in the season, and spent much time and energy ensuring that they would be successful. And she seldom failed.\nIt was generally acknowledged to be the proper thing to go to Lady Monk's parties. There were certain people who went as a matter of course - people who were by no means close friends with Lady Monk, or with Sir Cosmo, but whom it was proper to invite. The Duchess of St. Bungay was always there, though she hated Lady Monk; and Mrs. Conway Sparkes was generally there, although Lady Monk did not know why Mrs. Conway Sparkes was so favoured by the world; but so the fact was, and she bowed to it.\nThen there were another set, who were invited only when it suited. Among these were old family friends of her husband, and scores of young ladies whose mothers and aunts knew Lady Monk's sisters and cousins. They accepted as much of Lady Monk's good things as she offered them, and were thankful.\nThen there was another lot again, which was the most numerous of the three. It comprised all those who fought almost tooth and nail to get invitations. If Lady Monk had admitted them all, she would have been swamped; but she did not shut her doors against them altogether. Rather, she yielded to as few as possible.\nWhen she was first told that Mr. Bott wanted to come, she positively refused to have him. When it was hinted that the Duchess of St. Bungay had requested it, she sneered at the Duchess, and did not yield. But when she learnt that Mr. Palliser wished it, and that Mr. Palliser probably would not come himself otherwise, she gave way. She was especially anxious that Lady Glencora should come to her gathering, and Lady Glencora could not be had without Mr. Palliser.\n\"Burgo,\" said she to her nephew one morning, \"look here.\" Burgo was staying with her in Gloucester Square, much to the annoyance of Sir Cosmo, who was heartily tired of his nephew. The aunt and the nephew had been closeted together often lately. Now she handed a little note to Burgo, which he read and threw back to her.\n\"You see that she is not afraid of coming,\" said Lady Monk.\n\"I suppose she doesn't think about it much,\" said Burgo.\n\"If that's what you really believe, you'd better give it up. Nothing would justify such a step on your part except a conviction that she is attached to you.\"\nBurgo looked at the fireplace, almost savagely, and his aunt looked at him very keenly.\n\"I think I'd better hang myself,\" he said.\n\"Burgo, I will not have you here if you talk that way. I am trying to help you; but if you look like that, and talk like that, I will give it up.\"\n\"I think you'd better give it up.\"\n\"Are you becoming cowardly?\"\n\"I am not a coward. I'd go out and fight him with the greatest pleasure in the world.\"\n\"You know that's nonsense, Burgo.\"\n\"I'd take her tomorrow if I could. No one can say that I'm afraid. And I believe she loves me.\"\n\"Look here, Burgo,\" the aunt advised her ruined nephew. \"I think you were much wronged in that matter. I thought that you had a right to claim Lady Glencora as your wife. Mr. Palliser, in my mind, behaved very wrongly in stepping in between you and such a fortune as hers. He cannot expect that his wife should have any affection for him. Nobody has a greater horror of anything improper in married women than I have. But if you succeed, I shall always regard the Palliser episode in Lady Glencora's life as a tragic accident. Poor dear! I should think no harm of helping her. If you are to say anything to her, you might have an opportunity at the party.\"\n\"I've got no money.\" The words were growled out rather than spoken, and Burgo did not even look at his aunt.\n\"You've never got any money,\" said she.\n\"How can I help it? I can't make money. If I had a couple of hundred pounds, so that I could take her away, I believe that she would go with me.\"\n\"I've got no money for you, Burgo. I have not got five pounds.\"\n\"Would Cosmo lend it me?\" said he. The Cosmo he meant was not his uncle, but his cousin. Nothing could have induced his uncle, Sir Cosmo, to lend him another shilling. But the son of the house was a rich man.\n\"I don't know,\" said Lady Monk. \"I never see him. Probably not.\"\n\"It is hard,\" said Burgo. \"Fancy that a man should be ruined for two hundred pounds, at such a moment of his life as this! You have jewels, aunt; could you not raise it for me? I would redeem them with the very first money that I got.\"\nLady Monk stood up in anger when he suggested this, yet before the interview was over she had promised that she would try to get some money for him. He was her favourite nephew. She had quarrelled with one of her own children, and rarely saw the other, a married daughter. Such love as she had to give, she gave to Burgo, and she promised him the money though she knew that she must raise it by some falsehood to her husband.\nOn the same morning Lady Glencora went to visit Alice, to ask her to go to Lady Monk's party; but Alice would not agree.\n\"I don't know her,\" she said.\n\"My dear,\" said Lady Glencora, \"that's absurd. Half the people there won't know her.\"\n\"But they know her friends.\"\n\"I should have no trouble in getting a card for you. Indeed I should simply write a note and say I meant to bring you.\"\n\"Pray don't do any such thing, for I certainly shall not go. I can't imagine why you wish it.\"\n\"Mr. Fitzgerald will be there,\" said Lady Glencora, speaking in a low tone. She looked at her companion earnestly. \"I'm sure that he will be there, though nobody has told me.\"\n\"That may be a reason for your staying away,\" said Alice slowly, \"but hardly a reason for my going with you.\"\nLady Glencora could not bring herself to say that she wanted her friend's protection, though she wished it to be understood. \"Ah! I thought you would have gone,\" said she.\n\"I never go to people's houses when I don't know them. Pray do not ask me.\"\n\"Oh! very well. I won't press it.\" Lady Glencora had put one hand into her pocket, and had grasped a letter; but when Alice said those last cold words, \"Pray do not ask me,\" she released the grasp, and left the letter where it was.\n\"I suppose he won't bite me, at any rate,\" she said, with a pretty look of childish drollery.\n\"He certainly can't bite you, if you will not let him.\"\n\"Do you know, Alice, though they all say that Plantagenet is one of the wisest men in London, I sometimes think that he is one of the greatest fools. Soon after we came to town I told him that we had better not go to that woman's house. Of course he understood why. He simply said that he wished that I should do so. 'I hate anything out of the way,' he said. 'There can be no reason why my wife should not go to Lady Monk's house.' He insists that I shall go, but he sends my duenna with me. Dear Mrs. Marsham is to be there!\"\n\"She'll do you no harm, I suppose?\"\n\"I'm not so sure, Alice. In the first place, one doesn't like to be followed everywhere by a policeman, even though one isn't going to pick a pocket. And the devil is so strong within me, that I should like to dodge her.\"\n\"Glencora, you make me wretched when you talk like that.\"\n\"Will you go with me, then, so that I may have a policeman of my own choosing? He asked me if I would take Mrs. Marsham with me in my carriage. So I told him I would not; and when he asked why not, I said that I preferred to take a young friend of my own - and I named you or my cousin, Lady Jane.\"\n\"And was he angry?\"\n\"No; he took it very quietly and calmly, saying something about hoping that I should get over a prejudice against one of his earliest and dearest friends. He twits at me because I don't understand Parliament and the British Constitution, but I know more about them than he does about a woman. You are quite sure you won't go, then?\" Alice hesitated a moment. \"Do,\" said Lady Glencora.\n\"Glencora, I am not fit for parties. I sometimes think that I shall never go into society again.\"\n\"That's nonsense, you know.\"\n\"I suppose it is, but I cannot go now.\"\n\"Oh, very well,\" said Lady Glencora. \"I suppose I shall get through it. If he asks me to dance, I shall stand up with him, just as though I had never seen him before.\" Then she remembered the letter in her pocket, which was a proposition from this man to leave her husband and go off with him. As Alice had refused her request, she was glad that she had not shown it to her.\n\"Come to me the morning after,\" said Lady Glencora, as she went. This Alice promised to do; and then she was left alone.\nIt was only after Lady Glencora had left that Alice began to understand the subject fully, and to feel that she might have been of use in a great danger. She regretted deeply that she had not consented to go with her cousin. Doubtless she would have been uncomfortable at Lady Monk's house; but could she not have borne an hour or two of discomfort on her friend's behalf?\nHowever, it was too late now. She strove to comfort herself with the reflection that a casual meeting at an evening party in London could not be nearly as perilous as a prolonged stay together in a country house.",
        "paragraph_chars": [
            [
                0,
                260
            ],
            [
                260,
                758
            ],
            [
                758,
                1055
            ],
            [
                1055,
                1371
            ],
            [
                1371,
                1837
            ],
            [
                1837,
                2159
            ],
            [
                2159,
                2219
            ],
            [
                2219,
                2276
            ],
            [
                2276,
                2434
            ],
            [
                2434,
                2522
            ],
            [
                2522,
                2565
            ],
            [
                2565,
                2712
            ],
            [
                2712,
                2747
            ],
            [
                2747,
                2776
            ],
            [
                2776,
                2863
            ],
            [
                2863,
                2898
            ],
            [
                2898,
                2994
            ],
            [
                2994,
                3651
            ],
            [
                3651,
                3760
            ],
            [
                3760,
                3800
            ],
            [
                3800,
                3946
            ],
            [
                3946,
                4010
            ],
            [
                4010,
                4219
            ],
            [
                4219,
                4284
            ],
            [
                4284,
                4520
            ],
            [
                4520,
                4946
            ],
            [
                4946,
                5067
            ],
            [
                5067,
                5097
            ],
            [
                5097,
                5183
            ],
            [
                5183,
                5212
            ],
            [
                5212,
                5332
            ],
            [
                5332,
                5427
            ],
            [
                5427,
                5603
            ],
            [
                5603,
                5713
            ],
            [
                5713,
                5885
            ],
            [
                5885,
                5961
            ],
            [
                5961,
                6193
            ],
            [
                6193,
                6287
            ],
            [
                6287,
                6343
            ],
            [
                6343,
                6871
            ],
            [
                6871,
                6907
            ],
            [
                6907,
                7129
            ],
            [
                7129,
                7187
            ],
            [
                7187,
                7486
            ],
            [
                7486,
                7506
            ],
            [
                7506,
                7891
            ],
            [
                7891,
                7989
            ],
            [
                7989,
                8018
            ],
            [
                8018,
                8058
            ],
            [
                8058,
                8433
            ],
            [
                8433,
                8554
            ],
            [
                8554,
                8927
            ],
            [
                8927,
                9139
            ]
        ],
        "segment_chars": [
            [
                0,
                102
            ],
            [
                102,
                237
            ],
            [
                237,
                260
            ],
            [
                260,
                343
            ],
            [
                343,
                513
            ],
            [
                513,
                758
            ],
            [
                758,
                825
            ],
            [
                825,
                966
            ],
            [
                966,
                1055
            ],
            [
                1055,
                1131
            ],
            [
                1131,
                1207
            ],
            [
                1207,
                1328
            ],
            [
                1328,
                1371
            ],
            [
                1371,
                1461
            ],
            [
                1461,
                1576
            ],
            [
                1576,
                1704
            ],
            [
                1704,
                1837
            ],
            [
                1837,
                1895
            ],
            [
                1895,
                2018
            ],
            [
                2018,
                2083
            ],
            [
                2083,
                2159
            ],
            [
                2159,
                2219
            ],
            [
                2219,
                2276
            ],
            [
                2276,
                2337
            ],
            [
                2337,
                2434
            ],
            [
                2434,
                2522
            ],
            [
                2522,
                2565
            ],
            [
                2565,
                2620
            ],
            [
                2620,
                2712
            ],
            [
                2712,
                2747
            ],
            [
                2747,
                2776
            ],
            [
                2776,
                2796
            ],
            [
                2796,
                2863
            ],
            [
                2863,
                2898
            ],
            [
                2898,
                2933
            ],
            [
                2933,
                2965
            ],
            [
                2965,
                2994
            ],
            [
                2994,
                3050
            ],
            [
                3050,
                3097
            ],
            [
                3097,
                3165
            ],
            [
                3165,
                3267
            ],
            [
                3267,
                3333
            ],
            [
                3333,
                3412
            ],
            [
                3412,
                3521
            ],
            [
                3521,
                3532
            ],
            [
                3532,
                3571
            ],
            [
                3571,
                3651
            ],
            [
                3651,
                3672
            ],
            [
                3672,
                3760
            ],
            [
                3760,
                3800
            ],
            [
                3800,
                3820
            ],
            [
                3820,
                3840
            ],
            [
                3840,
                3946
            ],
            [
                3946,
                3981
            ],
            [
                3981,
                4010
            ],
            [
                4010,
                4036
            ],
            [
                4036,
                4045
            ],
            [
                4045,
                4099
            ],
            [
                4099,
                4178
            ],
            [
                4178,
                4219
            ],
            [
                4219,
                4251
            ],
            [
                4251,
                4269
            ],
            [
                4269,
                4284
            ],
            [
                4284,
                4310
            ],
            [
                4310,
                4407
            ],
            [
                4407,
                4461
            ],
            [
                4461,
                4520
            ],
            [
                4520,
                4669
            ],
            [
                4669,
                4698
            ],
            [
                4698,
                4793
            ],
            [
                4793,
                4946
            ],
            [
                4946,
                5067
            ],
            [
                5067,
                5097
            ],
            [
                5097,
                5144
            ],
            [
                5144,
                5183
            ],
            [
                5183,
                5212
            ],
            [
                5212,
                5265
            ],
            [
                5265,
                5332
            ],
            [
                5332,
                5393
            ],
            [
                5393,
                5427
            ],
            [
                5427,
                5503
            ],
            [
                5503,
                5542
            ],
            [
                5542,
                5603
            ],
            [
                5603,
                5713
            ],
            [
                5713,
                5838
            ],
            [
                5838,
                5843
            ],
            [
                5843,
                5885
            ],
            [
                5885,
                5940
            ],
            [
                5940,
                5961
            ],
            [
                5961,
                5966
            ],
            [
                5966,
                5977
            ],
            [
                5977,
                5996
            ],
            [
                5996,
                6193
            ],
            [
                6193,
                6287
            ],
            [
                6287,
                6343
            ],
            [
                6343,
                6493
            ],
            [
                6493,
                6580
            ],
            [
                6580,
                6609
            ],
            [
                6609,
                6660
            ],
            [
                6660,
                6703
            ],
            [
                6703,
                6776
            ],
            [
                6776,
                6836
            ],
            [
                6836,
                6871
            ],
            [
                6871,
                6907
            ],
            [
                6907,
                6932
            ],
            [
                6932,
                7057
            ],
            [
                7057,
                7129
            ],
            [
                7129,
                7187
            ],
            [
                7187,
                7266
            ],
            [
                7266,
                7331
            ],
            [
                7331,
                7486
            ],
            [
                7486,
                7506
            ],
            [
                7506,
                7661
            ],
            [
                7661,
                7799
            ],
            [
                7799,
                7839
            ],
            [
                7839,
                7865
            ],
            [
                7865,
                7891
            ],
            [
                7891,
                7928
            ],
            [
                7928,
                7989
            ],
            [
                7989,
                8018
            ],
            [
                8018,
                8058
            ],
            [
                8058,
                8095
            ],
            [
                8095,
                8130
            ],
            [
                8130,
                8226
            ],
            [
                8226,
                8352
            ],
            [
                8352,
                8433
            ],
            [
                8433,
                8498
            ],
            [
                8498,
                8554
            ],
            [
                8554,
                8708
            ],
            [
                8708,
                8779
            ],
            [
                8779,
                8927
            ],
            [
                8927,
                8957
            ],
            [
                8957,
                9139
            ]
        ],
        "overlap_chars": [
            [
                0,
                14
            ],
            [
                14,
                54
            ],
            [
                54,
                55
            ],
            [
                69,
                79
            ],
            [
                80,
                102
            ],
            [
                112,
                137
            ],
            [
                143,
                150
            ],
            [
                151,
                175
            ],
            [
                181,
                196
            ],
            [
                206,
                210
            ],
            [
                222,
                237
            ],
            [
                241,
                251
            ],
            [
                258,
                259
            ],
            [
                260,
                343
            ],
            [
                343,
                368
            ],
            [
                369,
                399
            ],
            [
                402,
                429
            ],
            [
                444,
                477
            ],
            [
                477,
                478
            ],
            [
                479,
                482
            ],
            [
                483,
                487
            ],
            [
                491,
                494
            ],
            [
                495,
                501
            ],
            [
                502,
                504
            ],
            [
                511,
                513
            ],
            [
                513,
                583
            ],
            [
                583,
                584
            ],
            [
                585,
                628
            ],
            [
                628,
                629
            ],
            [
                639,
                656
            ],
            [
                657,
                719
            ],
            [
                723,
                731
            ],
            [
                732,
                735
            ],
            [
                735,
                757
            ],
            [
                758,
                786
            ],
            [
                787,
                795
            ],
            [
                796,
                803
            ],
            [
                823,
                825
            ],
            [
                825,
                830
            ],
            [
                837,
                841
            ],
            [
                842,
                875
            ],
            [
                875,
                880
            ],
            [
                881,
                903
            ],
            [
                910,
                966
            ],
            [
                966,
                979
            ],
            [
                983,
                1021
            ],
            [
                1030,
                1054
            ],
            [
                1055,
                1081
            ],
            [
                1087,
                1094
            ],
            [
                1099,
                1131
            ],
            [
                1131,
                1157
            ],
            [
                1158,
                1171
            ],
            [
                1172,
                1207
            ],
            [
                1210,
                1219
            ],
            [
                1220,
                1223
            ],
            [
                1233,
                1237
            ],
            [
                1241,
                1242
            ],
            [
                1243,
                1270
            ],
            [
                1270,
                1275
            ],
            [
                1276,
                1279
            ],
            [
                1284,
                1287
            ],
            [
                1293,
                1326
            ],
            [
                1326,
                1328
            ],
            [
                1334,
                1335
            ],
            [
                1336,
                1339
            ],
            [
                1348,
                1360
            ],
            [
                1361,
                1370
            ],
            [
                1371,
                1394
            ],
            [
                1395,
                1439
            ],
            [
                1448,
                1461
            ],
            [
                1461,
                1472
            ],
            [
                1480,
                1514
            ],
            [
                1525,
                1568
            ],
            [
                1569,
                1576
            ],
            [
                1576,
                1584
            ],
            [
                1596,
                1678
            ],
            [
                1688,
                1704
            ],
            [
                1704,
                1783
            ],
            [
                1784,
                1837
            ],
            [
                1837,
                1868
            ],
            [
                1869,
                1895
            ],
            [
                1895,
                1904
            ],
            [
                1905,
                1917
            ],
            [
                1922,
                1983
            ],
            [
                1988,
                2018
            ],
            [
                2018,
                2068
            ],
            [
                2075,
                2081
            ],
            [
                2081,
                2083
            ],
            [
                2091,
                2139
            ],
            [
                2140,
                2158
            ],
            [
                2159,
                2219
            ],
            [
                2219,
                2247
            ],
            [
                2248,
                2256
            ],
            [
                2257,
                2261
            ],
            [
                2261,
                2276
            ],
            [
                2276,
                2337
            ],
            [
                2337,
                2344
            ],
            [
                2345,
                2392
            ],
            [
                2393,
                2434
            ],
            [
                2434,
                2521
            ],
            [
                2522,
                2565
            ],
            [
                2565,
                2609
            ],
            [
                2610,
                2620
            ],
            [
                2620,
                2643
            ],
            [
                2643,
                2712
            ],
            [
                2712,
                2747
            ],
            [
                2747,
                2773
            ],
            [
                2776,
                2777
            ],
            [
                2777,
                2796
            ],
            [
                2796,
                2820
            ],
            [
                2821,
                2863
            ],
            [
                2863,
                2895
            ],
            [
                2899,
                2902
            ],
            [
                2921,
                2923
            ],
            [
                2931,
                2933
            ],
            [
                2933,
                2963
            ],
            [
                2969,
                2991
            ],
            [
                2994,
                3013
            ],
            [
                3014,
                3017
            ],
            [
                3018,
                3022
            ],
            [
                3031,
                3034
            ],
            [
                3035,
                3048
            ],
            [
                3048,
                3050
            ],
            [
                3050,
                3097
            ],
            [
                3097,
                3165
            ],
            [
                3165,
                3242
            ],
            [
                3243,
                3265
            ],
            [
                3265,
                3267
            ],
            [
                3267,
                3333
            ],
            [
                3340,
                3412
            ],
            [
                3412,
                3415
            ],
            [
                3416,
                3422
            ],
            [
                3423,
                3430
            ],
            [
                3430,
                3503
            ],
            [
                3511,
                3521
            ],
            [
                3521,
                3532
            ],
            [
                3532,
                3569
            ],
            [
                3569,
                3571
            ],
            [
                3571,
                3605
            ],
            [
                3606,
                3651
            ],
            [
                3651,
                3669
            ],
            [
                3672,
                3722
            ],
            [
                3737,
                3741
            ],
            [
                3750,
                3758
            ],
            [
                3758,
                3760
            ],
            [
                3760,
                3798
            ],
            [
                3798,
                3800
            ],
            [
                3800,
                3820
            ],
            [
                3820,
                3840
            ],
            [
                3840,
                3901
            ],
            [
                3906,
                3943
            ],
            [
                3946,
                3981
            ],
            [
                3981,
                3991
            ],
            [
                3996,
                4007
            ],
            [
                4007,
                4010
            ],
            [
                4010,
                4036
            ],
            [
                4036,
                4043
            ],
            [
                4043,
                4045
            ],
            [
                4045,
                4054
            ],
            [
                4055,
                4057
            ],
            [
                4064,
                4099
            ],
            [
                4107,
                4178
            ],
            [
                4178,
                4208
            ],
            [
                4209,
                4213
            ],
            [
                4214,
                4217
            ],
            [
                4217,
                4219
            ],
            [
                4219,
                4221
            ],
            [
                4228,
                4251
            ],
            [
                4251,
                4269
            ],
            [
                4269,
                4284
            ],
            [
                4284,
                4310
            ],
            [
                4310,
                4368
            ],
            [
                4369,
                4405
            ],
            [
                4407,
                4429
            ],
            [
                4430,
                4461
            ],
            [
                4461,
                4520
            ],
            [
                4520,
                4529
            ],
            [
                4539,
                4541
            ],
            [
                4548,
                4552
            ],
            [
                4570,
                4571
            ],
            [
                4572,
                4575
            ],
            [
                4576,
                4637
            ],
            [
                4642,
                4644
            ],
            [
                4654,
                4667
            ],
            [
                4667,
                4669
            ],
            [
                4669,
                4696
            ],
            [
                4696,
                4698
            ],
            [
                4698,
                4716
            ],
            [
                4717,
                4745
            ],
            [
                4745,
                4750
            ],
            [
                4751,
                4761
            ],
            [
                4762,
                4791
            ],
            [
                4791,
                4793
            ],
            [
                4793,
                4821
            ],
            [
                4823,
                4919
            ],
            [
                4920,
                4946
            ],
            [
                4946,
                4987
            ],
            [
                4994,
                4999
            ],
            [
                4999,
                5000
            ],
            [
                5001,
                5003
            ],
            [
                5008,
                5011
            ],
            [
                5012,
                5059
            ],
            [
                5065,
                5066
            ],
            [
                5067,
                5086
            ],
            [
                5091,
                5095
            ],
            [
                5095,
                5097
            ],
            [
                5097,
                5144
            ],
            [
                5144,
                5183
            ],
            [
                5183,
                5201
            ],
            [
                5202,
                5209
            ],
            [
                5212,
                5213
            ],
            [
                5213,
                5229
            ],
            [
                5230,
                5265
            ],
            [
                5265,
                5332
            ],
            [
                5332,
                5393
            ],
            [
                5393,
                5400
            ],
            [
                5409,
                5416
            ],
            [
                5417,
                5427
            ],
            [
                5427,
                5478
            ],
            [
                5479,
                5490
            ],
            [
                5493,
                5501
            ],
            [
                5501,
                5503
            ],
            [
                5503,
                5506
            ],
            [
                5514,
                5542
            ],
            [
                5542,
                5603
            ],
            [
                5603,
                5659
            ],
            [
                5660,
                5713
            ],
            [
                5713,
                5726
            ],
            [
                5727,
                5762
            ],
            [
                5763,
                5777
            ],
            [
                5778,
                5784
            ],
            [
                5787,
                5797
            ],
            [
                5797,
                5838
            ],
            [
                5838,
                5843
            ],
            [
                5843,
                5885
            ],
            [
                5885,
                5940
            ],
            [
                5940,
                5961
            ],
            [
                5961,
                5966
            ],
            [
                5966,
                5977
            ],
            [
                5977,
                5996
            ],
            [
                5996,
                6013
            ],
            [
                6018,
                6021
            ],
            [
                6032,
                6047
            ],
            [
                6048,
                6068
            ],
            [
                6068,
                6192
            ],
            [
                6193,
                6245
            ],
            [
                6246,
                6252
            ],
            [
                6260,
                6285
            ],
            [
                6285,
                6287
            ],
            [
                6287,
                6343
            ],
            [
                6343,
                6493
            ],
            [
                6493,
                6580
            ],
            [
                6580,
                6603
            ],
            [
                6607,
                6609
            ],
            [
                6609,
                6660
            ],
            [
                6660,
                6703
            ],
            [
                6703,
                6773
            ],
            [
                6773,
                6776
            ],
            [
                6776,
                6836
            ],
            [
                6836,
                6871
            ],
            [
                6871,
                6907
            ],
            [
                6907,
                6923
            ],
            [
                6923,
                6932
            ],
            [
                6932,
                7057
            ],
            [
                7057,
                7060
            ],
            [
                7061,
                7122
            ],
            [
                7129,
                7151
            ],
            [
                7152,
                7187
            ],
            [
                7187,
                7266
            ],
            [
                7266,
                7288
            ],
            [
                7294,
                7331
            ],
            [
                7331,
                7335
            ],
            [
                7336,
                7408
            ],
            [
                7417,
                7424
            ],
            [
                7425,
                7441
            ],
            [
                7444,
                7449
            ],
            [
                7450,
                7483
            ],
            [
                7486,
                7506
            ],
            [
                7506,
                7534
            ],
            [
                7545,
                7546
            ],
            [
                7554,
                7563
            ],
            [
                7564,
                7661
            ],
            [
                7661,
                7759
            ],
            [
                7766,
                7799
            ],
            [
                7799,
                7839
            ],
            [
                7839,
                7865
            ],
            [
                7865,
                7889
            ],
            [
                7889,
                7891
            ],
            [
                7902,
                7928
            ],
            [
                7928,
                7989
            ],
            [
                7989,
                8018
            ],
            [
                8018,
                8055
            ],
            [
                8058,
                8093
            ],
            [
                8093,
                8095
            ],
            [
                8095,
                8130
            ],
            [
                8130,
                8226
            ],
            [
                8226,
                8271
            ],
            [
                8282,
                8283
            ],
            [
                8284,
                8312
            ],
            [
                8313,
                8330
            ],
            [
                8331,
                8334
            ],
            [
                8335,
                8350
            ],
            [
                8350,
                8352
            ],
            [
                8352,
                8415
            ],
            [
                8422,
                8427
            ],
            [
                8431,
                8432
            ],
            [
                8433,
                8434
            ],
            [
                8434,
                8498
            ],
            [
                8498,
                8554
            ],
            [
                8586,
                8589
            ],
            [
                8600,
                8605
            ],
            [
                8612,
                8614
            ],
            [
                8643,
                8644
            ],
            [
                8657,
                8665
            ],
            [
                8706,
                8708
            ],
            [
                8738,
                8741
            ],
            [
                8762,
                8766
            ],
            [
                8767,
                8770
            ],
            [
                8779,
                8873
            ],
            [
                8877,
                8926
            ],
            [
                8936,
                8957
            ],
            [
                8957,
                9071
            ],
            [
                9082,
                9090
            ],
            [
                9091,
                9105
            ],
            [
                9111,
                9139
            ]
        ],
        "row_chars": [
            [
                0,
                102
            ],
            [
                102,
                102
            ],
            [
                102,
                237
            ],
            [
                237,
                237
            ],
            [
                237,
                260
            ],
            [
                260,
                260
            ],
            [
                260,
                260
            ],
            [
                260,
                260
            ],
            [
                260,
                260
            ],
            [
                260,
                343
            ],
            [
                343,
                513
            ],
            [
                513,
                758
            ],
            [
                758,
                825
            ],
            [
                825,
                966
            ],
            [
                966,
                1055
            ],
            [
                1055,
                1131
            ],
            [
                1131,
                1207
            ],
            [
                1207,
                1328
            ],
            [
                1328,
                1371
            ],
            [
                1371,
                1461
            ],
            [
                1461,
                1576
            ],
            [
                1576,
                1704
            ],
            [
                1704,
                1837
            ],
            [
                1837,
                1837
            ],
            [
                1837,
                1895
            ],
            [
                1895,
                2018
            ],
            [
                2018,
                2083
            ],
            [
                2083,
                2159
            ],
            [
                2159,
                2219
            ],
            [
                2219,
                2276
            ],
            [
                2276,
                2337
            ],
            [
                2337,
                2434
            ],
            [
                2434,
                2522
            ],
            [
                2522,
                2522
            ],
            [
                2522,
                2565
            ],
            [
                2565,
                2620
            ],
            [
                2620,
                2712
            ],
            [
                2712,
                2747
            ],
            [
                2747,
                2776
            ],
            [
                2776,
                2776
            ],
            [
                2776,
                2796
            ],
            [
                2796,
                2863
            ],
            [
                2863,
                2898
            ],
            [
                2898,
                2898
            ],
            [
                2898,
                2898
            ],
            [
                2898,
                2898
            ],
            [
                2898,
                2898
            ],
            [
                2898,
                2933
            ],
            [
                2933,
                2965
            ],
            [
                2965,
                2965
            ],
            [
                2965,
                2994
            ],
            [
                2994,
                3050
            ],
            [
                3050,
                3097
            ],
            [
                3097,
                3165
            ],
            [
                3165,
                3267
            ],
            [
                3267,
                3333
            ],
            [
                3333,
                3412
            ],
            [
                3412,
                3412
            ],
            [
                3412,
                3412
            ],
            [
                3412,
                3412
            ],
            [
                3412,
                3521
            ],
            [
                3521,
                3521
            ],
            [
                3521,
                3532
            ],
            [
                3532,
                3571
            ],
            [
                3571,
                3651
            ],
            [
                3651,
                3651
            ],
            [
                3651,
                3651
            ],
            [
                3651,
                3651
            ],
            [
                3651,
                3651
            ],
            [
                3651,
                3651
            ],
            [
                3651,
                3672
            ],
            [
                3672,
                3672
            ],
            [
                3672,
                3672
            ],
            [
                3672,
                3672
            ],
            [
                3672,
                3672
            ],
            [
                3672,
                3760
            ],
            [
                3760,
                3800
            ],
            [
                3800,
                3820
            ],
            [
                3820,
                3840
            ],
            [
                3840,
                3946
            ],
            [
                3946,
                3946
            ],
            [
                3946,
                3946
            ],
            [
                3946,
                3981
            ],
            [
                3981,
                4010
            ],
            [
                4010,
                4010
            ],
            [
                4010,
                4010
            ],
            [
                4010,
                4010
            ],
            [
                4010,
                4036
            ],
            [
                4036,
                4045
            ],
            [
                4045,
                4099
            ],
            [
                4099,
                4178
            ],
            [
                4178,
                4219
            ],
            [
                4219,
                4251
            ],
            [
                4251,
                4269
            ],
            [
                4269,
                4284
            ],
            [
                4284,
                4310
            ],
            [
                4310,
                4407
            ],
            [
                4407,
                4407
            ],
            [
                4407,
                4461
            ],
            [
                4461,
                4520
            ],
            [
                4520,
                4669
            ],
            [
                4669,
                4698
            ],
            [
                4698,
                4793
            ],
            [
                4793,
                4946
            ],
            [
                4946,
                5067
            ],
            [
                5067,
                5097
            ],
            [
                5097,
                5144
            ],
            [
                5144,
                5183
            ],
            [
                5183,
                5212
            ],
            [
                5212,
                5212
            ],
            [
                5212,
                5265
            ],
            [
                5265,
                5332
            ],
            [
                5332,
                5393
            ],
            [
                5393,
                5427
            ],
            [
                5427,
                5503
            ],
            [
                5503,
                5542
            ],
            [
                5542,
                5603
            ],
            [
                5603,
                5713
            ],
            [
                5713,
                5838
            ],
            [
                5838,
                5843
            ],
            [
                5843,
                5885
            ],
            [
                5885,
                5940
            ],
            [
                5940,
                5940
            ],
            [
                5940,
                5961
            ],
            [
                5961,
                5966
            ],
            [
                5966,
                5977
            ],
            [
                5977,
                5996
            ],
            [
                5996,
                6193
            ],
            [
                6193,
                6287
            ],
            [
                6287,
                6343
            ],
            [
                6343,
                6493
            ],
            [
                6493,
                6580
            ],
            [
                6580,
                6609
            ],
            [
                6609,
                6660
            ],
            [
                6660,
                6703
            ],
            [
                6703,
                6776
            ],
            [
                6776,
                6776
            ],
            [
                6776,
                6776
            ],
            [
                6776,
                6836
            ],
            [
                6836,
                6871
            ],
            [
                6871,
                6907
            ],
            [
                6907,
                6932
            ],
            [
                6932,
                7057
            ],
            [
                7057,
                7129
            ],
            [
                7129,
                7129
            ],
            [
                7129,
                7187
            ],
            [
                7187,
                7266
            ],
            [
                7266,
                7331
            ],
            [
                7331,
                7486
            ],
            [
                7486,
                7486
            ],
            [
                7486,
                7506
            ],
            [
                7506,
                7661
            ],
            [
                7661,
                7799
            ],
            [
                7799,
                7839
            ],
            [
                7839,
                7865
            ],
            [
                7865,
                7891
            ],
            [
                7891,
                7891
            ],
            [
                7891,
                7928
            ],
            [
                7928,
                7989
            ],
            [
                7989,
                8018
            ],
            [
                8018,
                8058
            ],
            [
                8058,
                8058
            ],
            [
                8058,
                8095
            ],
            [
                8095,
                8130
            ],
            [
                8130,
                8226
            ],
            [
                8226,
                8352
            ],
            [
                8352,
                8433
            ],
            [
                8433,
                8498
            ],
            [
                8498,
                8554
            ],
            [
                8554,
                8708
            ],
            [
                8708,
                8779
            ],
            [
                8779,
                8927
            ],
            [
                8927,
                8927
            ],
            [
                8927,
                8957
            ],
            [
                8957,
                9139
            ]
        ]
    }
}