{
    "original": {
        "text": "Lady Monk's house in Gloucester Square was admirably well adapted for the giving of parties. It was a large house, and seemed to the eyes of guests to be much larger than it was. The hall was spacious, and the stairs went up in the centre, facing you as you entered the inner hall. Round the top of the stairs there was a broad gallery, with an ornamented railing, and from this opened the doors into the three reception-rooms. There were two on the right, the larger of which looked out backwards, and these two were connected by an archway, as though made for folding-doors; but the doors, I believe, never were there. Fronting the top of the staircase there was a smaller room, looking out backwards, very prettily furnished, and much used by Lady Monk when alone. It was here that Burgo had held that conference with his aunt of which mention has been made. Below stairs there was the great dining-room, on which, on these occasions, a huge buffet was erected for refreshments,--what I may call a masculine buffet, as it was attended by butlers and men in livery,--and there was a smaller room looking out into the square, in which there was a feminine battery for the dispensing of tea and such like smaller good things, and from which female aid could be attained for the arrangement or mending of dresses in a further sanctum within it. For such purposes as that now on foot the house was most commodious. Lady Monk, on these occasions, was moved by a noble ambition to do something different from that done by her neighbours in similar circumstances, and therefore she never came forward to receive her guests. She ensconced herself, early in the evening, in that room at the head of the stairs, and there they who chose to see her made their way up to her, and spoke their little speeches. They who thought her to be a great woman,--and many people did think her to be great,--were wont to declare that she never forgot those who did come, or those who did not. And even they who desired to describe her as little,--for even Lady Monk had enemies,--would hint that though she never came out of the room, she would rise from her chair and make a step towards the door whenever any name very high in fashionable life greeted her ears. So that a mighty Cabinet Minister, or a duchess in great repute, or any special wonder of the season, could not fail of entering her precincts and being seen there for a few moments. It would, of course, happen that the doorway of her chamber would become blocked; but there were precautions taken to avoid this inconvenience as far as possible, and one man in livery was employed to go backwards and forwards between his mistress and the outer world, so as to keep the thread of a passage open.\nBut though Lady Monk was in this way enabled to rest herself during her labours, there was much in her night's work which was not altogether exhilarating. Ladies would come into her small room and sit there by the hour, with whom she had not the slightest wish to hold conversation. The Duchess of St. Bungay would always be there,--so that there was a special seat in one corner of the room which was called the Duchess' stool. \"I shouldn't care a straw about her,\" Lady Monk had been heard to complain, \"if she would talk to anybody. But nobody will talk to her, and then she listens to everything.\"\nThere had been another word or two between Burgo Fitzgerald and his aunt before the evening came, a word or two in the speaking of which she had found some difficulty. She was prepared with the money,--with that two hundred pounds for which he had asked,--obtained with what wiles, and lies, and baseness of subterfuge I need not stop here to describe. But she was by no means willing to give this over into her nephew's hands without security. She was willing to advance him this money; she had been willing even to go through unusual dirt to get it for him; but she was desirous that he should have it only for a certain purpose. How could she bind him down to spend it as she would have it spent? Could she undertake to hand it to him as soon as Lady Glencora should be in his power? Even though she could have brought herself to say as much,--and I think she might also have done so after what she had said,--she could not have carried out such a plan. In that case the want would be instant, and the action must be rapid. She therefore had no alternative but to entrust him with the bank-notes at once. \"Burgo,\" she said, \"if I find that you deceive me now, I will never trust you again.\" \"All right,\" said Burgo, as he barely counted the money before he thrust it into his breast-pocket. \"It is lent to you for a certain purpose, should you happen to want it,\" she said, solemnly. \"I do happen to want it very much,\" he answered. She did not dare to say more; but as her nephew turned away from her with a step that was quite light in its gaiety, she almost felt that she was already cozened. Let Burgo's troubles be as heavy as they might be, there was something to him ecstatic in the touch of ready money which always cured them for the moment.\n[Illustration: \"All right,\" said Burgo, as he thrust the money into his breast-pocket.]\nOn the morning of Lady Monk's party a few very uncomfortable words passed between Mr. Palliser and his wife.\n\"Your cousin is not going, then?\" said he.\n\"Alice is not going.\"\n\"Then you can give Mrs. Marsham a seat in your carriage?\"\n\"Impossible, Plantagenet. I thought I had told you that I had promised my cousin Jane.\"\n\"But you can take three.\"\n\"Indeed I can't,--unless you would like me to sit out with the coachman.\"\nThere was something in this,--a tone of loudness, a touch of what he called to himself vulgarity,--which made him very angry. So he turned away from her, and looked as black as a thundercloud.\n\"You must know, Plantagenet,\" she went on, \"that it is impossible for three women dressed to go out in one carriage. I am sure you wouldn't like to see me afterwards if I had been one of them.\"\n\"You need not have said anything to Lady Jane when Miss Vavasor refused. I had asked you before that.\"\n\"And I had told you that I liked going with young women, and not with old ones. That's the long and the short of it.\"\n\"Glencora, I wish you would not use such expressions.\"\n\"What! not the long and the short? It's good English. Quite as good as Mr. Bott's, when he said in the House the other night that the Government kept their accounts in a higgledy-piggledy way. You see, I have been studying the debates, and you shouldn't be angry with me.\"\n\"I am not angry with you. You speak like a child to say so. Then, I suppose, the carriage must go for Mrs. Marsham after it has taken you?\"\n\"It shall go before. Jane will not be in a hurry, and I am sure I shall not.\"\n\"She will think you very uncivil; that is all. I told her that she could go with you when I heard that Miss Vavasor was not to be there.\"\n\"Then, Plantagenet, you shouldn't have told her so, and that's the long--; but I mustn't say that. The truth is this, if you give me any orders I'll obey them,--as far as I can. If I can't I'll say so. But if I'm left to go by my own judgement, it's not fair that I should be scolded afterwards.\"\n\"I have never scolded you.\"\n\"Yes, you have. You have told me that I was uncivil.\"\n\"I said that she would think you so.\"\n\"Then, if it's only what she thinks, I don't care two straws about it. She may have the carriage to herself if she likes, but she shan't have me in it,--not unless I'm ordered to go. I don't like her, and I won't pretend to like her. My belief is that she follows me about to tell you if she thinks that I do wrong.\"\n\"Glencora!\"\n\"And that odious baboon with the red bristles does the same thing,--only he goes to her because he doesn't dare to go to you.\"\nPlantagenet Palliser was struck wild with dismay. He understood well who it was whom his wife intended to describe; but that she should have spoken of any man as a baboon with red bristles, was terrible to his mind! He was beginning to think that he hardly knew how to manage his wife. And the picture she had drawn was very distressing to him. She had no mother; neither had he; and he had wished that Mrs. Marsham should give to her some of that matronly assistance and guidance which a mother does give to her young married daughter. It was true, too, as he knew, that a word or two as to some socially domestic matters had filtered through to him from Mr. Bott, down at Matching Priory, but only in such a way as to enable him to see what counsel it was needful that he should give. As for espionage over his wife,--no man could despise it more than he did! No man would be less willing to resort to it! And now his wife was accusing him of keeping spies, both male and female.\n\"Glencora!\" he said again; and then he stopped, not knowing what to say to her.\n\"Well, my dear, it's better you should know at once what I feel about it. I don't suppose I'm very good; indeed I dare say I'm bad enough, but these people about me won't make me any better. The duennas don't make the Spanish ladies worth much.\"\n\"Duennas!\" After that, Lady Glencora sat herself down, and Mr. Palliser stood for some moments looking at her.\nIt ended in his making her a long speech, in which he said a good deal of his own justice and forbearance, and something also of her frivolity and childishness. He told her that his only complaint of her was that she was too young, and, as he did so, she made a little grimace,--not to him, but to herself, as though saying to herself that that was all he knew about it. He did not notice it, or, if he did, his notice did not stop his eloquence. He assured her that he was far from keeping any watch over her, and declared that she had altogether mistaken Mrs. Marsham's character. Then there was another little grimace. \"There's somebody has mistaken it worse than I have,\" the grimace said. Of the bristly baboon he condescended to say nothing, and he wound up by giving her a cold kiss, and saying that he would meet her at Lady Monk's.\nWhen the evening came,--or rather the night,--the carriage went first for Mrs. Marsham, and having deposited her at Lady Monk's, went back to Park Lane for Lady Glencora. Then she had herself driven to St. James's Square, to pick up Lady Jane, so that altogether the coachman and horses did not have a good time of it. \"I wish he'd keep a separate carriage for her,\" Lady Glencora said to her cousin Jane,--having perceived that her servants were not in a good humour. \"That would be expensive,\" said Lady Jane. \"Yes, it would be expensive,\" said Lady Glencora. She would not condescend to make any remark as to the non-importance of such expense to a man so wealthy as her husband, knowing that his wealth was, in fact, hers. Never to him or to any other,--not even to herself,--had she hinted that much was due to her because she had been magnificent as an heiress. There were many things about this woman that were not altogether what a husband might wish. She was not softly delicate in all her ways; but in disposition and temper she was altogether generous. I do not know that she was at all points a lady, but had Fate so willed it she would have been a thorough gentleman.\nMrs. Marsham was by no means satisfied with the way in which she was treated. She would not have cared to go at all to Lady Monk's party had she supposed that she would have to make her entry there alone. With Lady Glencora she would have seemed to receive some of that homage which would certainly have been paid to her companion. The carriage called, moreover, before she was fully ready, and the footman, as he stood at the door to hand her in, had been very sulky. She understood it all. She knew that Lady Glencora had positively declined her companionship; and if she resolved to be revenged, such resolution on her part was only natural. When she reached Lady Monk's house, she had to make her way up stairs all alone. The servants called her Mrs. Marsh, and under that name she got passed on into the front drawing-room. There she sat down, not having seen Lady Monk, and meditated over her injuries.\nIt was past eleven before Lady Glencora arrived, and Burgo Fitzgerald had begun to think that his evil stars intended that he should never see her again. He had been wickedly baulked at Monkshade, by what influence he had never yet ascertained; and now he thought that the same influence must be at work to keep her again away from his aunt's house. He had settled in his mind no accurate plan of a campaign; he had in his thoughts no fixed arrangement by which he might do the thing which he meditated. He had attempted to make some such plan; but, as is the case with all men to whom thinking is an unusual operation, concluded at last that he had better leave it to the course of events. It was, however, obviously necessary that he should see Lady Glencora before the course of events could be made to do anything for him. He had written to her, making his proposition in bold terms, and he felt that if she were utterly decided against him, her anger at his suggestion, or at least her refusal, would have been made known to him in some way. Silence did not absolutely give consent, but it seemed to show that consent was not impossible. From ten o'clock to past eleven he stood about on the staircase of his aunt's house, waiting for the name which he was desirous of hearing, and which he almost feared to hear. Men spoke to him, and women also, but he hardly answered. His aunt once called him into her room, and with a cautionary frown on her brow, bade him go dance. \"Don't look so dreadfully preoccupied,\" she said to him in a whisper. But he shook his head at her, almost savagely, and went away, and did not dance. Dance! How was he to dance with such an enterprise as that upon his mind? Even to Burgo Fitzgerald the task of running away with another man's wife had in it something which prevented dancing. Lady Monk was older, and was able to regulate her feelings with more exactness. But Burgo, though he could not dance, went down into the dining-room and drank. He took a large beer-glass full of champagne and soon after that another. The drink did not flush his cheeks or make his forehead red, or bring out the sweat-drops on his brow, as it does with some men; but it added a peculiar brightness to his blue eyes. It was by the light of his eyes that men knew when Burgo had been drinking.\nAt last, while he was still in the supper room, he heard Lady Glencora's name announced. He had already seen Mr. Palliser come in and make his way up-stairs some quarter of an hour before; but as to that he was indifferent. He had known that the husband was to be there. When the long-expected name reached his ears, his heart seemed to jump within him. What, on the spur of the moment, should he do? As he had resolved that he would be doing,--that something should be done, let it be what it might,--he hurried to the dining-room door, and was just in time to see and be seen as Lady Glencora was passing up the stairs. She was just above him as he got himself out into the hall, so that he could not absolutely greet her with his hand; but he looked up at her, and caught her eye. He looked up, and moved his hand to her in token of salutation. She looked down at him, and the expression of her face altered visibly as her glance met his. She barely bowed to him,--with her eyes rather than with her head, but he flattered himself that there was, at any rate, no anger in her countenance. How beautiful he was as he gazed up at her, leaning against the wall as he stood, and watching her as she made her slow way up the stairs! She felt that his eyes were on her, and where the stairs turned she could not restrain herself from one other glance. As her eyes fell on his again, his mouth opened, and she fancied that she could hear the faint sigh that he uttered. It was a glorious mouth, such as the old sculptors gave to their marble gods! And Burgo, if it was so that he had not heart enough to love truly, could look as though he loved. It was not in him deceit,--or what men call acting. The expression came to him naturally, though it expressed so much more than there was within; as strong words come to some men who have no knowledge that they are speaking strongly. At this moment Burgo Fitzgerald looked as though it were possible that he might die of love.\nLady Glencora was met at the top of the stairs by Lady Monk, who came out to her, almost into the gallery, with her sweetest smile,--so that the newly-arrived guest, of course, entered into the small room. There sat the Duchess of St. Bungay on her stool in the corner, and there, next to the Duchess, but at the moment engaged in no conversation, stood Mr. Bott. There was another lady there, who stood very high in the world, and whom Lady Monk was very glad to welcome--the young Marchioness of Hartletop. She was in slight mourning; for her father-in-law, the late Marquis, had died no t yet quite six months since. Very beautiful she was, and one whose presence at their houses ladies and gentlemen prized alike. She never said silly things, like the Duchess, never was troublesome as to people's conduct to her, was always gracious, yet was never led away into intimacies, was without peer the best-dressed woman in London, and yet gave herself no airs;--and then she was so exquisitely beautiful. Her smile was loveliness itself. There were, indeed, people who said that it meant nothing; but then, what should the smile of a young married woman mean? She had not been born in the purple, like Lady Glencora, her father being a country clergyman who had never reached a higher grade than that of an archdeacon; but she knew the ways of high life, and what an exigeant husband would demand of her, much better than poor Glencora. She would have spoken of no man as a baboon with a bristly beard. She never talked of the long and the short of it. She did not wander out o' nights in winter among the ruins. She made no fast friendship with ladies whom her lord did not like. She had once, indeed, been approached by a lover since she had been married,--Mr. Palliser himself having been the offender,--but she had turned the affair to infinite credit and profit, had gained her husband's closest confidence by telling him of it all, had yet not brought on any hostile collision, and had even dismissed her lover without annoying him. But then Lady Hartletop was a miracle of a woman!\nLady Glencora was no miracle. Though born in the purple, she was made of ordinary flesh and blood, and as she entered Lady Monk's little room, hardly knew how to recover herself sufficiently for the purposes of ordinary conversation. \"Dear Lady Glencora, do come in for a moment to my den. We were so sorry not to have you at Monkshade. We heard such terrible things about your health.\" Lady Glencora said that it was only a cold,--a bad cold. \"Oh, yes; we heard,--something about moonlight and ruins. So like you, you know. I love that sort of thing, above all people; but it doesn't do; does it? Circumstances are so exacting. I think you know Lady Hartletop;--and there's the Duchess of St. Bungay. Mr. Palliser was here five minutes since.\" Then Lady Monk was obliged to get to her door again and Lady Glencora found herself standing close to Lady Hartletop.\n\"We saw Mr. Palliser just pass through,\" said Lady Hartletop, who was able to meet and speak of the man who had dared to approach her with his love, without the slightest nervousness.\n\"Yes; he said he should be here,\" said Lady Glencora.\n\"There's a great crowd,\" said Lady Hartletop. \"I didn't think London was so full.\"\n\"Very great.\" said Lady Glencora, and then they had said to each other all that society required. Lady Glencora, as we know, could talk with imprudent vehemence by the hour together if she liked her companion; but the other lady seldom committed herself by more words than she had uttered now,--unless it was to her tirewoman.\n\"How very well you are looking,\" said the Duchess. \"And I heard you had been so ill.\" Of that midnight escapade among the ruins it was fated that Lady Glencora should never hear the last.\n\"How d'ye do, Lady Glencowrer?\" sounded in her ear, and there was a great red paw stuck out for her to take. But after what had passed between Lady Glencora and her husband to-day about Mr. Bott, she was determined that she would not take Mr. Bott's hand.\n\"How are you, Mr. Bott?\" she said. \"I think I'll look for Mr. Palliser in the back room.\"\n\"Dear Lady Glencora,\" whispered the Duchess, in an ecstasy of agony. Lady Glencora turned and bowed her head to her stout friend. \"Do let me go away with you. There's that woman, Mrs. Conway Sparkes, coming, and you know how I hate her.\" She had nothing to do but to take the Duchess under her wing, and they passed into the large room together. It is, I think, more than probable that Mrs. Conway Sparkes had been brought in by Lady Monk as the only way of removing the Duchess from her stool.\nJust within the dancing-room Lady Glencora found her husband, standing in a corner, looking as though he were making calculations.\n\"I'm going away,\" said he, coming up to her. \"I only just came because I said I would. Shall you be late?\"\n\"Oh, no; I suppose not.\"\n\"Shall you dance?\"\n\"Perhaps once,--just to show that I'm not an old woman.\"\n\"Don't heat yourself. Good-bye.\" Then he went, and in the crush of the doorway he passed Burgo Fitzgerald, whose eye was intently fixed upon his wife. He looked at Burgo, and some thought of that young man's former hopes flashed across his mind,--some remembrance, too, of a caution that had been whispered to him; but for no moment did a suspicion come to him that he ought to stop and watch by his wife.",
        "paragraph_chars": [
            [
                0,
                2738
            ],
            [
                2738,
                3340
            ],
            [
                3340,
                5094
            ],
            [
                5094,
                5182
            ],
            [
                5182,
                5291
            ],
            [
                5291,
                5334
            ],
            [
                5334,
                5356
            ],
            [
                5356,
                5414
            ],
            [
                5414,
                5502
            ],
            [
                5502,
                5528
            ],
            [
                5528,
                5602
            ],
            [
                5602,
                5795
            ],
            [
                5795,
                5989
            ],
            [
                5989,
                6092
            ],
            [
                6092,
                6210
            ],
            [
                6210,
                6265
            ],
            [
                6265,
                6538
            ],
            [
                6538,
                6678
            ],
            [
                6678,
                6756
            ],
            [
                6756,
                6894
            ],
            [
                6894,
                7191
            ],
            [
                7191,
                7219
            ],
            [
                7219,
                7273
            ],
            [
                7273,
                7311
            ],
            [
                7311,
                7628
            ],
            [
                7628,
                7640
            ],
            [
                7640,
                7767
            ],
            [
                7767,
                8749
            ],
            [
                8749,
                8829
            ],
            [
                8829,
                9075
            ],
            [
                9075,
                9186
            ],
            [
                9186,
                10027
            ],
            [
                10027,
                11208
            ],
            [
                11208,
                12117
            ],
            [
                12117,
                14430
            ],
            [
                14430,
                16400
            ],
            [
                16400,
                18488
            ],
            [
                18488,
                19351
            ],
            [
                19351,
                19535
            ],
            [
                19535,
                19589
            ],
            [
                19589,
                19672
            ],
            [
                19672,
                19999
            ],
            [
                19999,
                20187
            ],
            [
                20187,
                20443
            ],
            [
                20443,
                20533
            ],
            [
                20533,
                21028
            ],
            [
                21028,
                21159
            ],
            [
                21159,
                21266
            ],
            [
                21266,
                21291
            ],
            [
                21291,
                21310
            ],
            [
                21310,
                21367
            ],
            [
                21367,
                21772
            ]
        ],
        "segment_chars": [
            [
                0,
                93
            ],
            [
                93,
                179
            ],
            [
                179,
                282
            ],
            [
                282,
                428
            ],
            [
                428,
                621
            ],
            [
                621,
                768
            ],
            [
                768,
                862
            ],
            [
                862,
                1344
            ],
            [
                1344,
                1413
            ],
            [
                1413,
                1619
            ],
            [
                1619,
                1799
            ],
            [
                1799,
                1971
            ],
            [
                1971,
                2242
            ],
            [
                2242,
                2425
            ],
            [
                2425,
                2738
            ],
            [
                2738,
                2893
            ],
            [
                2893,
                3021
            ],
            [
                3021,
                3167
            ],
            [
                3167,
                3274
            ],
            [
                3274,
                3340
            ],
            [
                3340,
                3508
            ],
            [
                3508,
                3693
            ],
            [
                3693,
                3785
            ],
            [
                3785,
                3972
            ],
            [
                3972,
                4040
            ],
            [
                4040,
                4127
            ],
            [
                4127,
                4297
            ],
            [
                4297,
                4367
            ],
            [
                4367,
                4448
            ],
            [
                4448,
                4534
            ],
            [
                4534,
                4634
            ],
            [
                4634,
                4727
            ],
            [
                4727,
                4776
            ],
            [
                4776,
                4939
            ],
            [
                4939,
                5094
            ],
            [
                5094,
                5182
            ],
            [
                5182,
                5291
            ],
            [
                5291,
                5325
            ],
            [
                5325,
                5334
            ],
            [
                5334,
                5356
            ],
            [
                5356,
                5414
            ],
            [
                5414,
                5440
            ],
            [
                5440,
                5502
            ],
            [
                5502,
                5528
            ],
            [
                5528,
                5602
            ],
            [
                5602,
                5728
            ],
            [
                5728,
                5795
            ],
            [
                5795,
                5912
            ],
            [
                5912,
                5989
            ],
            [
                5989,
                6062
            ],
            [
                6062,
                6092
            ],
            [
                6092,
                6172
            ],
            [
                6172,
                6210
            ],
            [
                6210,
                6265
            ],
            [
                6265,
                6272
            ],
            [
                6272,
                6300
            ],
            [
                6300,
                6319
            ],
            [
                6319,
                6458
            ],
            [
                6458,
                6538
            ],
            [
                6538,
                6564
            ],
            [
                6564,
                6598
            ],
            [
                6598,
                6678
            ],
            [
                6678,
                6699
            ],
            [
                6699,
                6756
            ],
            [
                6756,
                6803
            ],
            [
                6803,
                6894
            ],
            [
                6894,
                6993
            ],
            [
                6993,
                7072
            ],
            [
                7072,
                7096
            ],
            [
                7096,
                7191
            ],
            [
                7191,
                7219
            ],
            [
                7219,
                7235
            ],
            [
                7235,
                7273
            ],
            [
                7273,
                7311
            ],
            [
                7311,
                7382
            ],
            [
                7382,
                7494
            ],
            [
                7494,
                7545
            ],
            [
                7545,
                7628
            ],
            [
                7628,
                7640
            ],
            [
                7640,
                7767
            ],
            [
                7767,
                7817
            ],
            [
                7817,
                7983
            ],
            [
                7983,
                8053
            ],
            [
                8053,
                8112
            ],
            [
                8112,
                8304
            ],
            [
                8304,
                8554
            ],
            [
                8554,
                8629
            ],
            [
                8629,
                8675
            ],
            [
                8675,
                8749
            ],
            [
                8749,
                8761
            ],
            [
                8761,
                8829
            ],
            [
                8829,
                8903
            ],
            [
                8903,
                9020
            ],
            [
                9020,
                9075
            ],
            [
                9075,
                9086
            ],
            [
                9086,
                9186
            ],
            [
                9186,
                9347
            ],
            [
                9347,
                9557
            ],
            [
                9557,
                9633
            ],
            [
                9633,
                9769
            ],
            [
                9769,
                9808
            ],
            [
                9808,
                9880
            ],
            [
                9880,
                10027
            ],
            [
                10027,
                10198
            ],
            [
                10198,
                10346
            ],
            [
                10346,
                10496
            ],
            [
                10496,
                10539
            ],
            [
                10539,
                10589
            ],
            [
                10589,
                10754
            ],
            [
                10754,
                10895
            ],
            [
                10895,
                10987
            ],
            [
                10987,
                11091
            ],
            [
                11091,
                11208
            ],
            [
                11208,
                11286
            ],
            [
                11286,
                11413
            ],
            [
                11413,
                11540
            ],
            [
                11540,
                11677
            ],
            [
                11677,
                11700
            ],
            [
                11700,
                11853
            ],
            [
                11853,
                11934
            ],
            [
                11934,
                12037
            ],
            [
                12037,
                12117
            ],
            [
                12117,
                12271
            ],
            [
                12271,
                12467
            ],
            [
                12467,
                12621
            ],
            [
                12621,
                12808
            ],
            [
                12808,
                12944
            ],
            [
                12944,
                13164
            ],
            [
                13164,
                13260
            ],
            [
                13260,
                13436
            ],
            [
                13436,
                13494
            ],
            [
                13494,
                13594
            ],
            [
                13594,
                13664
            ],
            [
                13664,
                13745
            ],
            [
                13745,
                13752
            ],
            [
                13752,
                13819
            ],
            [
                13819,
                13938
            ],
            [
                13938,
                14018
            ],
            [
                14018,
                14098
            ],
            [
                14098,
                14172
            ],
            [
                14172,
                14354
            ],
            [
                14354,
                14430
            ],
            [
                14430,
                14519
            ],
            [
                14519,
                14654
            ],
            [
                14654,
                14701
            ],
            [
                14701,
                14784
            ],
            [
                14784,
                14831
            ],
            [
                14831,
                15052
            ],
            [
                15052,
                15214
            ],
            [
                15214,
                15278
            ],
            [
                15278,
                15372
            ],
            [
                15372,
                15522
            ],
            [
                15522,
                15661
            ],
            [
                15661,
                15779
            ],
            [
                15779,
                15896
            ],
            [
                15896,
                15974
            ],
            [
                15974,
                16073
            ],
            [
                16073,
                16125
            ],
            [
                16125,
                16307
            ],
            [
                16307,
                16400
            ],
            [
                16400,
                16606
            ],
            [
                16606,
                16764
            ],
            [
                16764,
                16909
            ],
            [
                16909,
                17020
            ],
            [
                17020,
                17118
            ],
            [
                17118,
                17404
            ],
            [
                17404,
                17437
            ],
            [
                17437,
                17559
            ],
            [
                17559,
                17836
            ],
            [
                17836,
                17902
            ],
            [
                17902,
                17952
            ],
            [
                17952,
                18012
            ],
            [
                18012,
                18080
            ],
            [
                18080,
                18438
            ],
            [
                18438,
                18488
            ],
            [
                18488,
                18518
            ],
            [
                18518,
                18722
            ],
            [
                18722,
                18778
            ],
            [
                18778,
                18825
            ],
            [
                18825,
                18875
            ],
            [
                18875,
                18932
            ],
            [
                18932,
                18990
            ],
            [
                18990,
                19013
            ],
            [
                19013,
                19086
            ],
            [
                19086,
                19117
            ],
            [
                19117,
                19190
            ],
            [
                19190,
                19233
            ],
            [
                19233,
                19351
            ],
            [
                19351,
                19535
            ],
            [
                19535,
                19589
            ],
            [
                19589,
                19635
            ],
            [
                19635,
                19672
            ],
            [
                19672,
                19686
            ],
            [
                19686,
                19770
            ],
            [
                19770,
                19999
            ],
            [
                19999,
                20050
            ],
            [
                20050,
                20187
            ],
            [
                20187,
                20219
            ],
            [
                20219,
                20296
            ],
            [
                20296,
                20443
            ],
            [
                20443,
                20468
            ],
            [
                20468,
                20478
            ],
            [
                20478,
                20533
            ],
            [
                20533,
                20602
            ],
            [
                20602,
                20663
            ],
            [
                20663,
                20692
            ],
            [
                20692,
                20771
            ],
            [
                20771,
                20879
            ],
            [
                20879,
                21028
            ],
            [
                21028,
                21159
            ],
            [
                21159,
                21204
            ],
            [
                21204,
                21246
            ],
            [
                21246,
                21266
            ],
            [
                21266,
                21291
            ],
            [
                21291,
                21310
            ],
            [
                21310,
                21367
            ],
            [
                21367,
                21389
            ],
            [
                21389,
                21400
            ],
            [
                21400,
                21518
            ],
            [
                21518,
                21772
            ]
        ],
        "overlap_chars": [
            [
                0,
                69
            ],
            [
                84,
                93
            ],
            [
                179,
                201
            ],
            [
                206,
                216
            ],
            [
                222,
                224
            ],
            [
                228,
                238
            ],
            [
                282,
                428
            ],
            [
                457,
                460
            ],
            [
                439,
                455
            ],
            [
                513,
                541
            ],
            [
                575,
                576
            ],
            [
                499,
                502
            ],
            [
                655,
                680
            ],
            [
                704,
                728
            ],
            [
                471,
                476
            ],
            [
                746,
                755
            ],
            [
                738,
                742
            ],
            [
                756,
                767
            ],
            [
                868,
                874
            ],
            [
                881,
                916
            ],
            [
                938,
                981
            ],
            [
                1029,
                1066
            ],
            [
                1069,
                1126
            ],
            [
                1252,
                1257
            ],
            [
                1187,
                1194
            ],
            [
                1213,
                1224
            ],
            [
                1342,
                1343
            ],
            [
                1413,
                1443
            ],
            [
                1577,
                1619
            ],
            [
                1619,
                1622
            ],
            [
                1664,
                1707
            ],
            [
                1714,
                1722
            ],
            [
                1729,
                1757
            ],
            [
                1766,
                1799
            ],
            [
                2113,
                2146
            ],
            [
                2152,
                2175
            ],
            [
                1997,
                1999
            ],
            [
                2194,
                2223
            ],
            [
                2022,
                2023
            ],
            [
                2250,
                2251
            ],
            [
                2259,
                2275
            ],
            [
                2277,
                2289
            ],
            [
                2423,
                2425
            ],
            [
                2435,
                2444
            ],
            [
                2458,
                2510
            ],
            [
                2722,
                2723
            ],
            [
                2596,
                2692
            ],
            [
                2736,
                2738
            ],
            [
                2900,
                2905
            ],
            [
                2906,
                2967
            ],
            [
                2972,
                3021
            ],
            [
                3021,
                3068
            ],
            [
                3165,
                3166
            ],
            [
                3167,
                3274
            ],
            [
                3274,
                3306
            ],
            [
                3312,
                3340
            ],
            [
                3340,
                3412
            ],
            [
                3436,
                3437
            ],
            [
                3471,
                3484
            ],
            [
                3491,
                3508
            ],
            [
                3508,
                3511
            ],
            [
                3530,
                3533
            ],
            [
                3552,
                3593
            ],
            [
                3605,
                3620
            ],
            [
                3622,
                3630
            ],
            [
                3659,
                3669
            ],
            [
                3675,
                3679
            ],
            [
                3683,
                3692
            ],
            [
                3693,
                3704
            ],
            [
                3717,
                3737
            ],
            [
                3748,
                3758
            ],
            [
                3767,
                3785
            ],
            [
                3972,
                3994
            ],
            [
                4000,
                4018
            ],
            [
                4030,
                4040
            ],
            [
                4040,
                4049
            ],
            [
                4063,
                4102
            ],
            [
                4113,
                4127
            ],
            [
                4367,
                4370
            ],
            [
                4381,
                4447
            ],
            [
                4448,
                4470
            ],
            [
                4483,
                4533
            ],
            [
                4534,
                4558
            ],
            [
                4600,
                4606
            ],
            [
                4580,
                4589
            ],
            [
                4610,
                4633
            ],
            [
                4634,
                4726
            ],
            [
                4727,
                4776
            ],
            [
                4776,
                4851
            ],
            [
                4872,
                4877
            ],
            [
                4852,
                4856
            ],
            [
                4891,
                4929
            ],
            [
                4937,
                4939
            ],
            [
                4990,
                4999
            ],
            [
                5060,
                5066
            ],
            [
                5000,
                5009
            ],
            [
                5017,
                5025
            ],
            [
                5010,
                5012
            ],
            [
                4943,
                4948
            ],
            [
                5026,
                5059
            ],
            [
                5067,
                5072
            ],
            [
                4951,
                4959
            ],
            [
                5078,
                5094
            ],
            [
                5182,
                5291
            ],
            [
                5291,
                5303
            ],
            [
                5304,
                5325
            ],
            [
                5325,
                5334
            ],
            [
                5334,
                5335
            ],
            [
                5353,
                5356
            ],
            [
                5356,
                5414
            ],
            [
                5414,
                5440
            ],
            [
                5440,
                5502
            ],
            [
                5502,
                5528
            ],
            [
                5528,
                5543
            ],
            [
                5546,
                5577
            ],
            [
                5582,
                5602
            ],
            [
                5602,
                5611
            ],
            [
                5652,
                5677
            ],
            [
                5689,
                5698
            ],
            [
                5622,
                5629
            ],
            [
                5701,
                5728
            ],
            [
                5728,
                5795
            ],
            [
                5795,
                5876
            ],
            [
                5885,
                5887
            ],
            [
                5895,
                5910
            ],
            [
                5989,
                6007
            ],
            [
                6025,
                6060
            ],
            [
                6092,
                6172
            ],
            [
                6172,
                6210
            ],
            [
                6210,
                6265
            ],
            [
                6265,
                6272
            ],
            [
                6276,
                6300
            ],
            [
                6300,
                6319
            ],
            [
                6319,
                6458
            ],
            [
                6458,
                6538
            ],
            [
                6538,
                6564
            ],
            [
                6564,
                6598
            ],
            [
                6598,
                6678
            ],
            [
                6678,
                6699
            ],
            [
                6699,
                6756
            ],
            [
                6756,
                6803
            ],
            [
                6803,
                6894
            ],
            [
                6894,
                6944
            ],
            [
                6991,
                6993
            ],
            [
                7012,
                7052
            ],
            [
                7055,
                7072
            ],
            [
                7072,
                7096
            ],
            [
                7096,
                7191
            ],
            [
                7191,
                7219
            ],
            [
                7219,
                7235
            ],
            [
                7235,
                7273
            ],
            [
                7273,
                7311
            ],
            [
                7311,
                7382
            ],
            [
                7494,
                7510
            ],
            [
                7543,
                7545
            ],
            [
                7545,
                7628
            ],
            [
                7628,
                7640
            ],
            [
                7640,
                7705
            ],
            [
                7708,
                7767
            ],
            [
                7767,
                7817
            ],
            [
                7817,
                7835
            ],
            [
                7847,
                7860
            ],
            [
                7881,
                7969
            ],
            [
                7981,
                7983
            ],
            [
                7983,
                8052
            ],
            [
                8304,
                8315
            ],
            [
                8334,
                8352
            ],
            [
                8373,
                8509
            ],
            [
                8538,
                8554
            ],
            [
                8554,
                8560
            ],
            [
                8576,
                8584
            ],
            [
                8587,
                8629
            ],
            [
                8675,
                8725
            ],
            [
                8747,
                8749
            ],
            [
                8749,
                8761
            ],
            [
                8761,
                8829
            ],
            [
                8829,
                8903
            ],
            [
                8941,
                9020
            ],
            [
                9020,
                9075
            ],
            [
                9075,
                9085
            ],
            [
                9103,
                9115
            ],
            [
                9124,
                9186
            ],
            [
                9186,
                9347
            ],
            [
                9347,
                9462
            ],
            [
                9481,
                9495
            ],
            [
                9469,
                9471
            ],
            [
                9553,
                9555
            ],
            [
                9531,
                9534
            ],
            [
                9521,
                9525
            ],
            [
                9555,
                9557
            ],
            [
                9557,
                9593
            ],
            [
                9605,
                9633
            ],
            [
                9633,
                9769
            ],
            [
                9774,
                9808
            ],
            [
                9902,
                9904
            ],
            [
                9912,
                9917
            ],
            [
                9950,
                10027
            ],
            [
                10027,
                10049
            ],
            [
                10073,
                10198
            ],
            [
                10198,
                10345
            ],
            [
                10346,
                10431
            ],
            [
                10494,
                10495
            ],
            [
                10496,
                10538
            ],
            [
                10539,
                10553
            ],
            [
                10566,
                10587
            ],
            [
                10708,
                10709
            ],
            [
                10599,
                10602
            ],
            [
                10614,
                10616
            ],
            [
                10626,
                10632
            ],
            [
                10718,
                10722
            ],
            [
                10697,
                10708
            ],
            [
                10727,
                10754
            ],
            [
                10811,
                10814
            ],
            [
                10847,
                10858
            ],
            [
                10832,
                10835
            ],
            [
                10883,
                10895
            ],
            [
                10987,
                11035
            ],
            [
                11062,
                11091
            ],
            [
                11091,
                11165
            ],
            [
                11166,
                11208
            ],
            [
                11208,
                11259
            ],
            [
                11269,
                11286
            ],
            [
                11286,
                11316
            ],
            [
                11324,
                11344
            ],
            [
                11349,
                11352
            ],
            [
                11345,
                11348
            ],
            [
                11362,
                11411
            ],
            [
                11470,
                11472
            ],
            [
                11478,
                11524
            ],
            [
                11418,
                11431
            ],
            [
                11538,
                11540
            ],
            [
                11775,
                11822
            ],
            [
                11835,
                11853
            ],
            [
                11853,
                11912
            ],
            [
                11923,
                11934
            ],
            [
                12043,
                12055
            ],
            [
                12013,
                12030
            ],
            [
                12031,
                12035
            ],
            [
                12082,
                12097
            ],
            [
                12005,
                12007
            ],
            [
                12103,
                12117
            ],
            [
                12117,
                12271
            ],
            [
                12467,
                12473
            ],
            [
                12494,
                12496
            ],
            [
                12506,
                12510
            ],
            [
                12482,
                12484
            ],
            [
                12489,
                12493
            ],
            [
                12619,
                12621
            ],
            [
                12621,
                12645
            ],
            [
                12656,
                12666
            ],
            [
                12687,
                12714
            ],
            [
                12718,
                12725
            ],
            [
                12735,
                12807
            ],
            [
                12808,
                12824
            ],
            [
                12835,
                12911
            ],
            [
                12923,
                12944
            ],
            [
                12944,
                12965
            ],
            [
                13003,
                13021
            ],
            [
                13063,
                13066
            ],
            [
                13164,
                13171
            ],
            [
                13212,
                13260
            ],
            [
                13260,
                13323
            ],
            [
                13343,
                13374
            ],
            [
                13413,
                13435
            ],
            [
                13494,
                13544
            ],
            [
                13556,
                13561
            ],
            [
                13580,
                13583
            ],
            [
                13584,
                13586
            ],
            [
                13587,
                13594
            ],
            [
                13664,
                13685
            ],
            [
                13694,
                13724
            ],
            [
                13743,
                13745
            ],
            [
                13745,
                13752
            ],
            [
                13752,
                13771
            ],
            [
                13817,
                13819
            ],
            [
                13819,
                13937
            ],
            [
                14036,
                14038
            ],
            [
                14056,
                14098
            ],
            [
                14098,
                14146
            ],
            [
                14163,
                14172
            ],
            [
                14172,
                14206
            ],
            [
                14231,
                14232
            ],
            [
                14301,
                14354
            ],
            [
                14354,
                14430
            ],
            [
                14430,
                14451
            ],
            [
                14458,
                14519
            ],
            [
                14519,
                14576
            ],
            [
                14592,
                14617
            ],
            [
                14652,
                14654
            ],
            [
                14701,
                14728
            ],
            [
                14729,
                14771
            ],
            [
                14782,
                14784
            ],
            [
                14784,
                14788
            ],
            [
                14817,
                14830
            ],
            [
                14932,
                14967
            ],
            [
                14976,
                15052
            ],
            [
                15173,
                15212
            ],
            [
                15226,
                15246
            ],
            [
                15254,
                15256
            ],
            [
                15266,
                15277
            ],
            [
                15278,
                15305
            ],
            [
                15324,
                15327
            ],
            [
                15310,
                15320
            ],
            [
                15333,
                15372
            ],
            [
                15372,
                15396
            ],
            [
                15439,
                15445
            ],
            [
                15469,
                15508
            ],
            [
                15520,
                15521
            ],
            [
                15522,
                15590
            ],
            [
                15604,
                15661
            ],
            [
                15661,
                15779
            ],
            [
                15779,
                15863
            ],
            [
                15868,
                15878
            ],
            [
                15894,
                15896
            ],
            [
                15896,
                15974
            ],
            [
                15978,
                15984
            ],
            [
                16003,
                16073
            ],
            [
                16307,
                16321
            ],
            [
                16339,
                16355
            ],
            [
                16378,
                16400
            ],
            [
                16400,
                16480
            ],
            [
                16507,
                16530
            ],
            [
                16604,
                16606
            ],
            [
                16658,
                16661
            ],
            [
                16668,
                16669
            ],
            [
                16612,
                16641
            ],
            [
                16679,
                16680
            ],
            [
                16754,
                16762
            ],
            [
                16681,
                16688
            ],
            [
                16645,
                16648
            ],
            [
                16762,
                16763
            ],
            [
                16764,
                16871
            ],
            [
                16873,
                16909
            ],
            [
                17020,
                17047
            ],
            [
                17122,
                17145
            ],
            [
                17216,
                17282
            ],
            [
                17296,
                17358
            ],
            [
                17090,
                17093
            ],
            [
                17370,
                17377
            ],
            [
                17381,
                17404
            ],
            [
                17404,
                17437
            ],
            [
                17437,
                17559
            ],
            [
                17616,
                17626
            ],
            [
                17563,
                17566
            ],
            [
                17571,
                17575
            ],
            [
                17633,
                17652
            ],
            [
                17716,
                17752
            ],
            [
                17804,
                17836
            ],
            [
                17836,
                17902
            ],
            [
                17952,
                17974
            ],
            [
                17988,
                17994
            ],
            [
                17978,
                17984
            ],
            [
                17995,
                18011
            ],
            [
                18080,
                18128
            ],
            [
                18135,
                18155
            ],
            [
                18160,
                18203
            ],
            [
                18206,
                18238
            ],
            [
                18248,
                18254
            ],
            [
                18265,
                18336
            ],
            [
                18383,
                18438
            ],
            [
                18438,
                18488
            ],
            [
                18488,
                18518
            ],
            [
                18545,
                18665
            ],
            [
                18699,
                18721
            ],
            [
                18722,
                18742
            ],
            [
                18778,
                18825
            ],
            [
                18825,
                18875
            ],
            [
                18875,
                18917
            ],
            [
                18930,
                18932
            ],
            [
                18932,
                18950
            ],
            [
                18953,
                18990
            ],
            [
                18990,
                19001
            ],
            [
                19011,
                19013
            ],
            [
                19117,
                19149
            ],
            [
                19151,
                19154
            ],
            [
                19163,
                19188
            ],
            [
                19233,
                19262
            ],
            [
                19267,
                19351
            ],
            [
                19351,
                19428
            ],
            [
                19438,
                19535
            ],
            [
                19535,
                19539
            ],
            [
                19566,
                19589
            ],
            [
                19589,
                19635
            ],
            [
                19635,
                19672
            ],
            [
                19672,
                19686
            ],
            [
                19686,
                19769
            ],
            [
                19999,
                20050
            ],
            [
                20050,
                20084
            ],
            [
                20187,
                20219
            ],
            [
                20219,
                20296
            ],
            [
                20296,
                20299
            ],
            [
                20383,
                20443
            ],
            [
                20443,
                20468
            ],
            [
                20468,
                20478
            ],
            [
                20478,
                20533
            ],
            [
                20533,
                20602
            ],
            [
                20602,
                20622
            ],
            [
                20642,
                20648
            ],
            [
                20661,
                20663
            ],
            [
                20663,
                20692
            ],
            [
                20692,
                20770
            ],
            [
                20771,
                20778
            ],
            [
                20797,
                20879
            ],
            [
                20879,
                20894
            ],
            [
                20905,
                21011
            ],
            [
                21026,
                21028
            ],
            [
                21040,
                21088
            ],
            [
                21090,
                21159
            ],
            [
                21159,
                21169
            ],
            [
                21174,
                21204
            ],
            [
                21204,
                21211
            ],
            [
                21217,
                21246
            ],
            [
                21252,
                21266
            ],
            [
                21266,
                21291
            ],
            [
                21291,
                21310
            ],
            [
                21310,
                21324
            ],
            [
                21326,
                21367
            ],
            [
                21367,
                21389
            ],
            [
                21389,
                21400
            ],
            [
                21400,
                21518
            ],
            [
                21518,
                21611
            ],
            [
                21614,
                21703
            ],
            [
                21728,
                21744
            ],
            [
                21750,
                21753
            ],
            [
                21763,
                21772
            ]
        ],
        "row_chars": [
            [
                0,
                93
            ],
            [
                93,
                179
            ],
            [
                179,
                428
            ],
            [
                428,
                768
            ],
            [
                768,
                862
            ],
            [
                862,
                1344
            ],
            [
                1344,
                1413
            ],
            [
                1413,
                1619
            ],
            [
                1619,
                1799
            ],
            [
                1799,
                1971
            ],
            [
                1971,
                2425
            ],
            [
                2425,
                2738
            ],
            [
                2738,
                2893
            ],
            [
                2893,
                3021
            ],
            [
                3021,
                3167
            ],
            [
                3167,
                3274
            ],
            [
                3274,
                3340
            ],
            [
                3340,
                3508
            ],
            [
                3508,
                3693
            ],
            [
                3693,
                3785
            ],
            [
                3785,
                3972
            ],
            [
                3972,
                4040
            ],
            [
                4040,
                4127
            ],
            [
                4127,
                4297
            ],
            [
                4297,
                4367
            ],
            [
                4367,
                4448
            ],
            [
                4448,
                4534
            ],
            [
                4534,
                4634
            ],
            [
                4634,
                4727
            ],
            [
                4727,
                4776
            ],
            [
                4776,
                4939
            ],
            [
                4939,
                5094
            ],
            [
                5094,
                5182
            ],
            [
                5182,
                5291
            ],
            [
                5291,
                5325
            ],
            [
                5325,
                5334
            ],
            [
                5334,
                5356
            ],
            [
                5356,
                5414
            ],
            [
                5414,
                5440
            ],
            [
                5440,
                5502
            ],
            [
                5502,
                5528
            ],
            [
                5528,
                5602
            ],
            [
                5602,
                5728
            ],
            [
                5728,
                5795
            ],
            [
                5795,
                5912
            ],
            [
                5912,
                5989
            ],
            [
                5989,
                6062
            ],
            [
                6062,
                6092
            ],
            [
                6092,
                6172
            ],
            [
                6172,
                6210
            ],
            [
                6210,
                6265
            ],
            [
                6265,
                6272
            ],
            [
                6272,
                6300
            ],
            [
                6300,
                6319
            ],
            [
                6319,
                6458
            ],
            [
                6458,
                6538
            ],
            [
                6538,
                6564
            ],
            [
                6564,
                6598
            ],
            [
                6598,
                6678
            ],
            [
                6678,
                6699
            ],
            [
                6699,
                6756
            ],
            [
                6756,
                6803
            ],
            [
                6803,
                6894
            ],
            [
                6894,
                6993
            ],
            [
                6993,
                7072
            ],
            [
                7072,
                7096
            ],
            [
                7096,
                7191
            ],
            [
                7191,
                7219
            ],
            [
                7219,
                7235
            ],
            [
                7235,
                7273
            ],
            [
                7273,
                7311
            ],
            [
                7311,
                7382
            ],
            [
                7382,
                7494
            ],
            [
                7494,
                7545
            ],
            [
                7545,
                7628
            ],
            [
                7628,
                7640
            ],
            [
                7640,
                7767
            ],
            [
                7767,
                7817
            ],
            [
                7817,
                7983
            ],
            [
                7983,
                8053
            ],
            [
                8053,
                8112
            ],
            [
                8112,
                8304
            ],
            [
                8304,
                8554
            ],
            [
                8554,
                8629
            ],
            [
                8629,
                8675
            ],
            [
                8675,
                8749
            ],
            [
                8749,
                8761
            ],
            [
                8761,
                8829
            ],
            [
                8829,
                8903
            ],
            [
                8903,
                9020
            ],
            [
                9020,
                9075
            ],
            [
                9075,
                9086
            ],
            [
                9086,
                9186
            ],
            [
                9186,
                9347
            ],
            [
                9347,
                9557
            ],
            [
                9557,
                9633
            ],
            [
                9633,
                9769
            ],
            [
                9769,
                9808
            ],
            [
                9808,
                9880
            ],
            [
                9880,
                10027
            ],
            [
                10027,
                10198
            ],
            [
                10198,
                10346
            ],
            [
                10346,
                10496
            ],
            [
                10496,
                10539
            ],
            [
                10539,
                10754
            ],
            [
                10754,
                10895
            ],
            [
                10895,
                10987
            ],
            [
                10987,
                11091
            ],
            [
                11091,
                11208
            ],
            [
                11208,
                11286
            ],
            [
                11286,
                11540
            ],
            [
                11540,
                11677
            ],
            [
                11677,
                11700
            ],
            [
                11700,
                11853
            ],
            [
                11853,
                11934
            ],
            [
                11934,
                12117
            ],
            [
                12117,
                12271
            ],
            [
                12271,
                12467
            ],
            [
                12467,
                12621
            ],
            [
                12621,
                12808
            ],
            [
                12808,
                12944
            ],
            [
                12944,
                13260
            ],
            [
                13260,
                13436
            ],
            [
                13436,
                13494
            ],
            [
                13494,
                13594
            ],
            [
                13594,
                13664
            ],
            [
                13664,
                13745
            ],
            [
                13745,
                13752
            ],
            [
                13752,
                13819
            ],
            [
                13819,
                13938
            ],
            [
                13938,
                14018
            ],
            [
                14018,
                14098
            ],
            [
                14098,
                14172
            ],
            [
                14172,
                14354
            ],
            [
                14354,
                14430
            ],
            [
                14430,
                14519
            ],
            [
                14519,
                14654
            ],
            [
                14654,
                14701
            ],
            [
                14701,
                14784
            ],
            [
                14784,
                14831
            ],
            [
                14831,
                15052
            ],
            [
                15052,
                15278
            ],
            [
                15278,
                15372
            ],
            [
                15372,
                15522
            ],
            [
                15522,
                15661
            ],
            [
                15661,
                15779
            ],
            [
                15779,
                15896
            ],
            [
                15896,
                15974
            ],
            [
                15974,
                16073
            ],
            [
                16073,
                16125
            ],
            [
                16125,
                16307
            ],
            [
                16307,
                16400
            ],
            [
                16400,
                16606
            ],
            [
                16606,
                16764
            ],
            [
                16764,
                16909
            ],
            [
                16909,
                17020
            ],
            [
                17020,
                17404
            ],
            [
                17404,
                17437
            ],
            [
                17437,
                17559
            ],
            [
                17559,
                17836
            ],
            [
                17836,
                17902
            ],
            [
                17902,
                17952
            ],
            [
                17952,
                18012
            ],
            [
                18012,
                18080
            ],
            [
                18080,
                18438
            ],
            [
                18438,
                18488
            ],
            [
                18488,
                18518
            ],
            [
                18518,
                18722
            ],
            [
                18722,
                18825
            ],
            [
                18825,
                18875
            ],
            [
                18875,
                18932
            ],
            [
                18932,
                18990
            ],
            [
                18990,
                19013
            ],
            [
                19013,
                19086
            ],
            [
                19086,
                19117
            ],
            [
                19117,
                19190
            ],
            [
                19190,
                19233
            ],
            [
                19233,
                19351
            ],
            [
                19351,
                19535
            ],
            [
                19535,
                19589
            ],
            [
                19589,
                19635
            ],
            [
                19635,
                19672
            ],
            [
                19672,
                19686
            ],
            [
                19686,
                19770
            ],
            [
                19770,
                19999
            ],
            [
                19999,
                20050
            ],
            [
                20050,
                20187
            ],
            [
                20187,
                20219
            ],
            [
                20219,
                20296
            ],
            [
                20296,
                20443
            ],
            [
                20443,
                20468
            ],
            [
                20468,
                20478
            ],
            [
                20478,
                20533
            ],
            [
                20533,
                20602
            ],
            [
                20602,
                20663
            ],
            [
                20663,
                20692
            ],
            [
                20692,
                20771
            ],
            [
                20771,
                20879
            ],
            [
                20879,
                21028
            ],
            [
                21028,
                21159
            ],
            [
                21159,
                21204
            ],
            [
                21204,
                21246
            ],
            [
                21246,
                21266
            ],
            [
                21266,
                21291
            ],
            [
                21291,
                21310
            ],
            [
                21310,
                21367
            ],
            [
                21367,
                21389
            ],
            [
                21389,
                21400
            ],
            [
                21400,
                21518
            ],
            [
                21518,
                21772
            ]
        ]
    },
    "abridged": {
        "text": "Lady Monk's house in Gloucester Square was admirably well adapted for parties. The hall was spacious, with the stairs going up the centre; round the top of the stairs there was a broad gallery, with an ornamented railing, and from this opened the doors into the three reception-rooms. The two on the right were connected by an archway; and there was a smaller room, very prettily furnished, which Lady Monk used when alone.\nDownstairs was the great dining-room, on which a huge buffet was erected for refreshments, attended by butlers and men in livery; and there was a smaller room looking out into the square, where maids could dispense tea and other good things.\nLady Monk, on these occasions, never came forward to receive her guests. She stayed in that room at the head of the stairs, and they who wished to see her made their way up and spoke their little speeches. She would rise from her chair and take a step towards the door to greet anyone very high in fashionable life, like a Cabinet Minister or a duchess. Of course the doorway of her chamber would become blocked; but a man in livery was employed to go backwards and forwards between his mistress and the outer world.\nBut ladies would also come into her small room and sit there by the hour, with whom Lady Monk had not the slightest wish to hold conversation. The Duchess of St. Bungay would always be there.\n\"I shouldn't care a straw about her,\" Lady Monk had been heard to complain, \"if she would talk to anybody. But nobody will talk to her, and she listens to everything.\"\nThere had been another word or two between Burgo Fitzgerald and his aunt, which she had spoken with some difficulty. She had the two hundred pounds for which he had asked - obtained with what wiles and lies I need not here describe.\nBut she was not willing to give this to her nephew without security. How could she bind him to spend it as she wanted it spent? Could she hand it to him as soon as Lady Glencora was in his power? That was not possible; she had no alternative but to entrust him with the bank-notes at once.\n\"Burgo,\" she said, \"if you deceive me now, I will never trust you again.\"\n\"All right,\" said Burgo, thrusting the money into his breast-pocket.\n\"It is lent to you for a certain purpose, should you happen to want it,\" she said, solemnly.\n\"I do happen to want it very much,\" he answered. She did not dare to say more; but as her nephew turned away from her with a light step, she almost felt that she was already tricked. There was always something ecstatic to Burgo in the touch of ready money which cured his troubles for the moment.\nOn the morning of Lady Monk's party a few very uncomfortable words passed between Mr. Palliser and his wife.\n\"Your cousin Alice is not going, then?\" said he.\n\"No.\"\n\"Then you can give Mrs. Marsham a seat in your carriage?\"\n\"Impossible, Plantagenet. I thought I had told you that I had promised my cousin Jane.\"\n\"But you can take three.\"\n\"Indeed I can't - unless you would like me to sit with the coachman.\"\nThere was a touch of what he called vulgarity in this which made him very angry. So he turned away from her, and looked as black as a thundercloud.\n\"You must know, Plantagenet,\" she went on, \"that it is impossible for three women in evening dress to fit in one carriage.\"\n\"You need not have asked Lady Jane when Miss Vavasor refused.\"\n\"And I had told you that I liked going with young women, and not with old ones. That's the long and the short of it.\"\n\"Glencora, I wish you would not use such expressions.\"\n\"What! the long and the short? It's good English. Quite as good as Mr. Bott's, when he said in the House the other night that the Government kept their accounts in a higgledy-piggledy way. You see, I have been studying the debates, and you shouldn't be angry with me.\"\n\"I am not angry with you. You speak like a child to say so. Then, I suppose, the carriage must go for Mrs. Marsham after it has taken you?\"\n\"It shall go before. Jane will not be in a hurry, and I am sure I shall not.\"\n\"She will think you very uncivil; that is all. I told her that she could go with you when I heard that Miss Vavasor was not to be there.\"\n\"Then, Plantagenet, you shouldn't have told her so. If you give me any orders I'll obey them - as far as I can. If I can't I'll say so. But if I'm left to go by my own judgement, it's not fair that I should be scolded afterwards.\"\n\"I have never scolded you.\"\n\"Yes, you have. You have told me that I was uncivil.\"\n\"I said that she would think you so.\"\n\"Then, if it's only what she thinks, I don't care two straws about it. I don't like her. My belief is that she follows me about to tell you if she thinks that I do wrong.\"\n\"Glencora!\"\n\"And that odious baboon with the red bristles does the same thing - only he goes to her because he doesn't dare to go to you.\"\nPlantagenet Palliser was struck wild with dismay. He understood well whom his wife meant; but that she should have spoken of any man as a baboon with red bristles, was terrible! He was beginning to think that he hardly knew how to manage his wife.\nIt was true that a word or two about domestic matters had filtered through to him from Mr. Bott, down at Matching Priory, but only in such a way as to enable him to see what advice he should give. As for spying on his wife - no man could despise it more than he did! And now his wife was accusing him of keeping spies.\n\"Glencora!\" he said again; and then he stopped, not knowing what to say to her.\n\"Well, my dear, it's better you should know at once what I feel about it. I dare say I'm bad enough, but these people about me won't make me any better. The duennas don't make the Spanish ladies worth much.\"\n\"Duennas!\"\nLady Glencora sat down, and Mr. Palliser stood for some moments looking at her.\nIt ended in his making her a long speech, in which he said a good deal of his own justice and forbearance, and something also of her frivolity and childishness. He told her that his only complaint of her was that she was too young, and, as he did so, she made a little grimace to herself, as if to say it was more than that. He did not notice it, or, if he did, it did not stop his eloquence. He assured her that he was far from keeping any watch over her, and declared that she had altogether mistaken Mrs. Marsham's character. At that, there was another little grimace. He ended by giving her a cold kiss, and saying that he would meet her at Lady Monk's.\nWhen the evening came, the carriage went first for Mrs. Marsham, and having deposited her at Lady Monk's, went back to Park Lane for Lady Glencora. Then she had herself driven to St. James's Square, to pick up Lady Jane, so that altogether the coachman and horses did not have a good time of it.\n\"I wish he'd keep a separate carriage for her,\" Lady Glencora said to her cousin Jane.\n\"That would be expensive,\" said Lady Jane.\n\"Yes, it would,\" said Lady Glencora, not deigning to remark that her husband's wealth was, in fact, hers. She put on no airs because she was an heiress. She was not softly delicate in all her ways; but she was altogether generous. I do not know that she was at all points a lady, but had Fate so willed it, she would have been a thorough gentleman.\nMrs. Marsham was by no means satisfied with the way she was treated. She would not have cared to go to Lady Monk's party if she had known that she would have to make her entry there alone, without a share of the homage which would certainly have been paid to Lady Glencora. If she resolved to be revenged, such resolution was only natural. When she reached Lady Monk's house, she had to make her way upstairs all alone. She sat down in the front drawing room, and meditated on her injuries.\nIt was past eleven before Lady Glencora arrived, and Burgo Fitzgerald had begun to think that his evil stars intended that he should never see her again. He had no definite plan in mind. He had attempted to make a plan; but, like all men to whom thinking is unusual, concluded at last that he had better leave it to the course of events.\nIt was, however, necessary that he should see Lady Glencora before the course of events could do anything for him. He had written to her boldly, and he felt that her silence seemed to show that consent was not impossible. From ten o'clock to past eleven he stood about on the staircase, waiting for the name which he desired yet almost feared to hear.\nHis aunt once called him into her room, and with a frown told him to go and dance. But he shook his head almost savagely, and went away. Dance! How was he to dance? Even to Burgo Fitzgerald the task of running away with another man's wife had in it something which prevented dancing.\nInstead he went down into the dining-room and drank. He took a large beer-glass full of champagne and then another. The drink did not flush his cheeks, but it added a peculiar brightness to his blue eyes. It was by the light of his eyes that men knew when Burgo had been drinking.\nAt last, while he was in the supper room, he heard Lady Glencora's name announced. He had already seen Mr. Palliser come in and make his way upstairs a quarter of an hour before. When the long-expected name now reached his ears, his heart seemed to jump. What should he do?\nHe hurried to the dining-room door, just in time to see and be seen as Lady Glencora was passing up the stairs. He looked up at her, and caught her eye, and moved his hand in salutation.\nShe looked down at him, and her expression altered visibly as her glance met his. She barely bowed to him, but he thought there was, at any rate, no anger in her face.\nHow beautiful he was as he gazed up at her, leaning against the wall and watching her as she made her slow way up the stairs! She felt that his eyes were on her, and where the stairs turned she could not restrain herself from one other glance. As her eyes fell on his again, his mouth opened, and she fancied that she could hear a faint sigh. It was a glorious mouth, such as the old sculptors gave to their marble gods! Burgo, though he had not heart enough to love truly, could look as though he loved. At this moment he looked as though he might die of love.\nLady Glencora was met at the top of the stairs by Lady Monk, who came out to her with her sweetest smile. Lady Glencora entered the small room, where sat the Duchess of St. Bungay, with Mr. Bott standing next to her.\nThere was another lady there, who stood very high in the world, and whom Lady Monk was very glad to welcome - the young Marchioness of Hartletop. Very beautiful she was, and never said silly things, was always gracious, yet was never led away into intimacies, was the best-dressed woman in London, and yet gave herself no airs - and she was exquisitely beautiful. Her smile was loveliness itself. There were, indeed, people who said that it meant nothing; but then, what should the smile of a young married woman mean? Her father had been a country clergyman; but she knew the ways of high life much better than poor Glencora. She would have spoken of no man as a baboon with a bristly beard. She did not wander out on winter nights among the ruins.\nShe had once, indeed, been approached by a lover after she had been married - Mr. Palliser himself having been the offender - but she had turned the affair to credit, had gained her husband's closest confidence by telling him of it all, and had even dismissed her lover without annoying him. But then Lady Hartletop was a miracle of a woman!\nLady Glencora was no miracle. She was made of ordinary flesh and blood, and as she entered Lady Monk's little room, hardly knew how to recover herself enough to make ordinary conversation.\n\"Dear Lady Glencora, we were so sorry not to have you at Monkshade. We heard such terrible things about your health.\" Lady Glencora said that it was only a cold. \"Oh, yes; we heard something about moonlight and ruins. So like you. I think you know Lady Hartletop; and the Duchess of St. Bungay.\" Then Lady Monk was obliged to go to her door again and Lady Glencora found herself standing close to Lady Hartletop.\n\"We saw Mr. Palliser just pass through,\" said Lady Hartletop, who was able to speak of the man who had dared to approach her with his love, without the slightest nervousness.\n\"Yes,\" said Lady Glencora.\n\"There's a great crowd,\" said Lady Hartletop. \"I didn't think London was so full.\"\n\"Very great.\" said Lady Glencora, and then they had said to each other all that society required.\n\"How very well you are looking,\" said the Duchess. \"And I heard you had been so ill.\"\n\"How d'ye do, Lady Glencowrer?\" sounded in her ear, and there was a great red paw stuck out for her to take. But she was determined that she would not take Mr. Bott's hand.\n\"How are you, Mr. Bott?\" she said. \"I think I'll look for Mr. Palliser in the back room.\"\n\"Dear Lady Glencora,\" whispered the Duchess, in an ecstasy of agony. Lady Glencora turned to her. \"Do let me go away with you. There's that woman, Mrs. Conway Sparkes, coming, and you know how I hate her.\"\nShe had to take the Duchess under her wing, and they passed into the large room together. It is, I think, probable that Mrs. Conway Sparkes had been brought in by Lady Monk as the only way of removing the Duchess.\nIn the dancing-room Lady Glencora found her husband standing in a corner, looking as though he were making calculations.\n\"I'm going,\" said he, coming up to her. \"I only came because I said I would. Will you be late?\"\n\"Oh, no; I suppose not.\"\n\"Shall you dance?\"\n\"Perhaps once, just to show that I'm not an old woman.\"\n\"Don't heat yourself. Good-bye.\" Then he went, and in the crush of the doorway he passed Burgo Fitzgerald, whose eye was intently fixed upon his wife. He looked at Burgo, and some thought of that young man's former hopes flashed across his mind - some remembrance, too, of a caution that had been whispered to him; but for no moment did he suspect that he ought to stay and guard his wife.",
        "paragraph_chars": [
            [
                0,
                424
            ],
            [
                424,
                666
            ],
            [
                666,
                1183
            ],
            [
                1183,
                1375
            ],
            [
                1375,
                1543
            ],
            [
                1543,
                1776
            ],
            [
                1776,
                2066
            ],
            [
                2066,
                2140
            ],
            [
                2140,
                2209
            ],
            [
                2209,
                2302
            ],
            [
                2302,
                2599
            ],
            [
                2599,
                2708
            ],
            [
                2708,
                2757
            ],
            [
                2757,
                2763
            ],
            [
                2763,
                2821
            ],
            [
                2821,
                2909
            ],
            [
                2909,
                2935
            ],
            [
                2935,
                3005
            ],
            [
                3005,
                3153
            ],
            [
                3153,
                3277
            ],
            [
                3277,
                3340
            ],
            [
                3340,
                3458
            ],
            [
                3458,
                3513
            ],
            [
                3513,
                3782
            ],
            [
                3782,
                3922
            ],
            [
                3922,
                4000
            ],
            [
                4000,
                4138
            ],
            [
                4138,
                4369
            ],
            [
                4369,
                4397
            ],
            [
                4397,
                4451
            ],
            [
                4451,
                4489
            ],
            [
                4489,
                4661
            ],
            [
                4661,
                4673
            ],
            [
                4673,
                4800
            ],
            [
                4800,
                5048
            ],
            [
                5048,
                5367
            ],
            [
                5367,
                5447
            ],
            [
                5447,
                5655
            ],
            [
                5655,
                5666
            ],
            [
                5666,
                5746
            ],
            [
                5746,
                6404
            ],
            [
                6404,
                6700
            ],
            [
                6700,
                6787
            ],
            [
                6787,
                6830
            ],
            [
                6830,
                7179
            ],
            [
                7179,
                7670
            ],
            [
                7670,
                8008
            ],
            [
                8008,
                8360
            ],
            [
                8360,
                8644
            ],
            [
                8644,
                8925
            ],
            [
                8925,
                9199
            ],
            [
                9199,
                9386
            ],
            [
                9386,
                9554
            ],
            [
                9554,
                10116
            ],
            [
                10116,
                10333
            ],
            [
                10333,
                11083
            ],
            [
                11083,
                11425
            ],
            [
                11425,
                11614
            ],
            [
                11614,
                12027
            ],
            [
                12027,
                12202
            ],
            [
                12202,
                12229
            ],
            [
                12229,
                12312
            ],
            [
                12312,
                12410
            ],
            [
                12410,
                12496
            ],
            [
                12496,
                12669
            ],
            [
                12669,
                12759
            ],
            [
                12759,
                12965
            ],
            [
                12965,
                13179
            ],
            [
                13179,
                13300
            ],
            [
                13300,
                13396
            ],
            [
                13396,
                13421
            ],
            [
                13421,
                13440
            ],
            [
                13440,
                13496
            ],
            [
                13496,
                13885
            ]
        ],
        "segment_chars": [
            [
                0,
                79
            ],
            [
                79,
                285
            ],
            [
                285,
                424
            ],
            [
                424,
                666
            ],
            [
                666,
                739
            ],
            [
                739,
                872
            ],
            [
                872,
                1020
            ],
            [
                1020,
                1183
            ],
            [
                1183,
                1326
            ],
            [
                1326,
                1375
            ],
            [
                1375,
                1482
            ],
            [
                1482,
                1543
            ],
            [
                1543,
                1660
            ],
            [
                1660,
                1776
            ],
            [
                1776,
                1845
            ],
            [
                1845,
                1904
            ],
            [
                1904,
                1972
            ],
            [
                1972,
                2066
            ],
            [
                2066,
                2140
            ],
            [
                2140,
                2209
            ],
            [
                2209,
                2302
            ],
            [
                2302,
                2351
            ],
            [
                2351,
                2485
            ],
            [
                2485,
                2599
            ],
            [
                2599,
                2708
            ],
            [
                2708,
                2748
            ],
            [
                2748,
                2757
            ],
            [
                2757,
                2763
            ],
            [
                2763,
                2821
            ],
            [
                2821,
                2847
            ],
            [
                2847,
                2909
            ],
            [
                2909,
                2935
            ],
            [
                2935,
                3005
            ],
            [
                3005,
                3086
            ],
            [
                3086,
                3153
            ],
            [
                3153,
                3277
            ],
            [
                3277,
                3340
            ],
            [
                3340,
                3420
            ],
            [
                3420,
                3458
            ],
            [
                3458,
                3513
            ],
            [
                3513,
                3520
            ],
            [
                3520,
                3544
            ],
            [
                3544,
                3563
            ],
            [
                3563,
                3702
            ],
            [
                3702,
                3782
            ],
            [
                3782,
                3808
            ],
            [
                3808,
                3842
            ],
            [
                3842,
                3922
            ],
            [
                3922,
                3943
            ],
            [
                3943,
                4000
            ],
            [
                4000,
                4047
            ],
            [
                4047,
                4138
            ],
            [
                4138,
                4190
            ],
            [
                4190,
                4250
            ],
            [
                4250,
                4274
            ],
            [
                4274,
                4369
            ],
            [
                4369,
                4397
            ],
            [
                4397,
                4413
            ],
            [
                4413,
                4451
            ],
            [
                4451,
                4489
            ],
            [
                4489,
                4560
            ],
            [
                4560,
                4578
            ],
            [
                4578,
                4661
            ],
            [
                4661,
                4673
            ],
            [
                4673,
                4800
            ],
            [
                4800,
                4850
            ],
            [
                4850,
                4978
            ],
            [
                4978,
                5048
            ],
            [
                5048,
                5245
            ],
            [
                5245,
                5315
            ],
            [
                5315,
                5367
            ],
            [
                5367,
                5379
            ],
            [
                5379,
                5447
            ],
            [
                5447,
                5521
            ],
            [
                5521,
                5600
            ],
            [
                5600,
                5655
            ],
            [
                5655,
                5666
            ],
            [
                5666,
                5746
            ],
            [
                5746,
                5907
            ],
            [
                5907,
                6071
            ],
            [
                6071,
                6139
            ],
            [
                6139,
                6275
            ],
            [
                6275,
                6318
            ],
            [
                6318,
                6404
            ],
            [
                6404,
                6552
            ],
            [
                6552,
                6700
            ],
            [
                6700,
                6787
            ],
            [
                6787,
                6830
            ],
            [
                6830,
                6936
            ],
            [
                6936,
                6983
            ],
            [
                6983,
                7061
            ],
            [
                7061,
                7179
            ],
            [
                7179,
                7248
            ],
            [
                7248,
                7453
            ],
            [
                7453,
                7519
            ],
            [
                7519,
                7599
            ],
            [
                7599,
                7670
            ],
            [
                7670,
                7824
            ],
            [
                7824,
                7857
            ],
            [
                7857,
                8008
            ],
            [
                8008,
                8123
            ],
            [
                8123,
                8230
            ],
            [
                8230,
                8360
            ],
            [
                8360,
                8443
            ],
            [
                8443,
                8497
            ],
            [
                8497,
                8504
            ],
            [
                8504,
                8525
            ],
            [
                8525,
                8644
            ],
            [
                8644,
                8697
            ],
            [
                8697,
                8760
            ],
            [
                8760,
                8849
            ],
            [
                8849,
                8925
            ],
            [
                8925,
                9008
            ],
            [
                9008,
                9104
            ],
            [
                9104,
                9180
            ],
            [
                9180,
                9199
            ],
            [
                9199,
                9311
            ],
            [
                9311,
                9386
            ],
            [
                9386,
                9468
            ],
            [
                9468,
                9554
            ],
            [
                9554,
                9680
            ],
            [
                9680,
                9798
            ],
            [
                9798,
                9897
            ],
            [
                9897,
                9975
            ],
            [
                9975,
                10059
            ],
            [
                10059,
                10116
            ],
            [
                10116,
                10222
            ],
            [
                10222,
                10333
            ],
            [
                10333,
                10479
            ],
            [
                10479,
                10697
            ],
            [
                10697,
                10730
            ],
            [
                10730,
                10852
            ],
            [
                10852,
                10960
            ],
            [
                10960,
                11026
            ],
            [
                11026,
                11083
            ],
            [
                11083,
                11375
            ],
            [
                11375,
                11425
            ],
            [
                11425,
                11455
            ],
            [
                11455,
                11614
            ],
            [
                11614,
                11682
            ],
            [
                11682,
                11732
            ],
            [
                11732,
                11776
            ],
            [
                11776,
                11832
            ],
            [
                11832,
                11845
            ],
            [
                11845,
                11910
            ],
            [
                11910,
                12027
            ],
            [
                12027,
                12202
            ],
            [
                12202,
                12229
            ],
            [
                12229,
                12275
            ],
            [
                12275,
                12312
            ],
            [
                12312,
                12326
            ],
            [
                12326,
                12410
            ],
            [
                12410,
                12461
            ],
            [
                12461,
                12496
            ],
            [
                12496,
                12528
            ],
            [
                12528,
                12605
            ],
            [
                12605,
                12669
            ],
            [
                12669,
                12694
            ],
            [
                12694,
                12704
            ],
            [
                12704,
                12759
            ],
            [
                12759,
                12828
            ],
            [
                12828,
                12857
            ],
            [
                12857,
                12886
            ],
            [
                12886,
                12965
            ],
            [
                12965,
                13055
            ],
            [
                13055,
                13179
            ],
            [
                13179,
                13300
            ],
            [
                13300,
                13340
            ],
            [
                13340,
                13377
            ],
            [
                13377,
                13396
            ],
            [
                13396,
                13421
            ],
            [
                13421,
                13440
            ],
            [
                13440,
                13496
            ],
            [
                13496,
                13518
            ],
            [
                13518,
                13529
            ],
            [
                13529,
                13647
            ],
            [
                13647,
                13885
            ]
        ],
        "overlap_chars": [
            [
                0,
                69
            ],
            [
                70,
                79
            ],
            [
                79,
                101
            ],
            [
                107,
                117
            ],
            [
                124,
                126
            ],
            [
                127,
                137
            ],
            [
                139,
                285
            ],
            [
                285,
                288
            ],
            [
                289,
                305
            ],
            [
                306,
                334
            ],
            [
                334,
                335
            ],
            [
                336,
                339
            ],
            [
                340,
                365
            ],
            [
                366,
                390
            ],
            [
                391,
                396
            ],
            [
                397,
                406
            ],
            [
                407,
                411
            ],
            [
                412,
                423
            ],
            [
                428,
                434
            ],
            [
                435,
                470
            ],
            [
                471,
                514
            ],
            [
                515,
                552
            ],
            [
                554,
                611
            ],
            [
                624,
                629
            ],
            [
                639,
                646
            ],
            [
                653,
                664
            ],
            [
                664,
                665
            ],
            [
                666,
                696
            ],
            [
                697,
                739
            ],
            [
                739,
                742
            ],
            [
                750,
                793
            ],
            [
                794,
                802
            ],
            [
                810,
                838
            ],
            [
                839,
                872
            ],
            [
                872,
                905
            ],
            [
                911,
                934
            ],
            [
                935,
                937
            ],
            [
                951,
                980
            ],
            [
                980,
                981
            ],
            [
                987,
                988
            ],
            [
                989,
                1005
            ],
            [
                1006,
                1018
            ],
            [
                1018,
                1020
            ],
            [
                1020,
                1029
            ],
            [
                1030,
                1082
            ],
            [
                1083,
                1084
            ],
            [
                1085,
                1181
            ],
            [
                1181,
                1183
            ],
            [
                1194,
                1199
            ],
            [
                1205,
                1266
            ],
            [
                1277,
                1326
            ],
            [
                1326,
                1373
            ],
            [
                1373,
                1374
            ],
            [
                1375,
                1482
            ],
            [
                1482,
                1514
            ],
            [
                1515,
                1543
            ],
            [
                1543,
                1615
            ],
            [
                1615,
                1616
            ],
            [
                1617,
                1630
            ],
            [
                1643,
                1660
            ],
            [
                1660,
                1663
            ],
            [
                1668,
                1671
            ],
            [
                1672,
                1713
            ],
            [
                1725,
                1740
            ],
            [
                1741,
                1749
            ],
            [
                1750,
                1760
            ],
            [
                1761,
                1765
            ],
            [
                1766,
                1775
            ],
            [
                1776,
                1787
            ],
            [
                1792,
                1812
            ],
            [
                1816,
                1826
            ],
            [
                1827,
                1845
            ],
            [
                1845,
                1867
            ],
            [
                1868,
                1886
            ],
            [
                1894,
                1904
            ],
            [
                1904,
                1913
            ],
            [
                1914,
                1953
            ],
            [
                1958,
                1972
            ],
            [
                1995,
                1998
            ],
            [
                1999,
                2065
            ],
            [
                2066,
                2088
            ],
            [
                2089,
                2139
            ],
            [
                2140,
                2164
            ],
            [
                2165,
                2171
            ],
            [
                2175,
                2184
            ],
            [
                2185,
                2208
            ],
            [
                2209,
                2301
            ],
            [
                2302,
                2351
            ],
            [
                2351,
                2426
            ],
            [
                2427,
                2432
            ],
            [
                2433,
                2437
            ],
            [
                2437,
                2475
            ],
            [
                2483,
                2485
            ],
            [
                2485,
                2494
            ],
            [
                2495,
                2501
            ],
            [
                2502,
                2511
            ],
            [
                2512,
                2520
            ],
            [
                2521,
                2523
            ],
            [
                2524,
                2529
            ],
            [
                2530,
                2563
            ],
            [
                2564,
                2569
            ],
            [
                2574,
                2582
            ],
            [
                2583,
                2599
            ],
            [
                2599,
                2708
            ],
            [
                2708,
                2720
            ],
            [
                2727,
                2748
            ],
            [
                2748,
                2757
            ],
            [
                2757,
                2758
            ],
            [
                2760,
                2763
            ],
            [
                2763,
                2821
            ],
            [
                2821,
                2847
            ],
            [
                2847,
                2909
            ],
            [
                2909,
                2935
            ],
            [
                2935,
                2950
            ],
            [
                2953,
                2984
            ],
            [
                2985,
                3005
            ],
            [
                3005,
                3014
            ],
            [
                3015,
                3040
            ],
            [
                3041,
                3050
            ],
            [
                3051,
                3058
            ],
            [
                3059,
                3086
            ],
            [
                3086,
                3153
            ],
            [
                3153,
                3234
            ],
            [
                3252,
                3254
            ],
            [
                3259,
                3274
            ],
            [
                3277,
                3295
            ],
            [
                3302,
                3337
            ],
            [
                3340,
                3420
            ],
            [
                3420,
                3458
            ],
            [
                3458,
                3513
            ],
            [
                3513,
                3520
            ],
            [
                3520,
                3544
            ],
            [
                3544,
                3563
            ],
            [
                3563,
                3702
            ],
            [
                3702,
                3782
            ],
            [
                3782,
                3808
            ],
            [
                3808,
                3842
            ],
            [
                3842,
                3922
            ],
            [
                3922,
                3943
            ],
            [
                3943,
                4000
            ],
            [
                4000,
                4047
            ],
            [
                4047,
                4138
            ],
            [
                4138,
                4188
            ],
            [
                4188,
                4190
            ],
            [
                4190,
                4230
            ],
            [
                4233,
                4250
            ],
            [
                4250,
                4274
            ],
            [
                4274,
                4369
            ],
            [
                4369,
                4397
            ],
            [
                4397,
                4413
            ],
            [
                4413,
                4451
            ],
            [
                4451,
                4489
            ],
            [
                4489,
                4560
            ],
            [
                4560,
                4576
            ],
            [
                4576,
                4578
            ],
            [
                4578,
                4661
            ],
            [
                4661,
                4673
            ],
            [
                4673,
                4738
            ],
            [
                4741,
                4800
            ],
            [
                4800,
                4850
            ],
            [
                4850,
                4868
            ],
            [
                4869,
                4882
            ],
            [
                4888,
                4976
            ],
            [
                4976,
                4978
            ],
            [
                4978,
                5047
            ],
            [
                5048,
                5059
            ],
            [
                5060,
                5078
            ],
            [
                5085,
                5221
            ],
            [
                5229,
                5245
            ],
            [
                5245,
                5251
            ],
            [
                5262,
                5270
            ],
            [
                5273,
                5315
            ],
            [
                5315,
                5365
            ],
            [
                5365,
                5367
            ],
            [
                5367,
                5379
            ],
            [
                5379,
                5447
            ],
            [
                5447,
                5521
            ],
            [
                5521,
                5600
            ],
            [
                5600,
                5655
            ],
            [
                5655,
                5665
            ],
            [
                5671,
                5683
            ],
            [
                5684,
                5746
            ],
            [
                5746,
                5907
            ],
            [
                5907,
                6022
            ],
            [
                6023,
                6037
            ],
            [
                6041,
                6043
            ],
            [
                6048,
                6050
            ],
            [
                6051,
                6054
            ],
            [
                6065,
                6069
            ],
            [
                6069,
                6071
            ],
            [
                6071,
                6107
            ],
            [
                6111,
                6139
            ],
            [
                6139,
                6275
            ],
            [
                6284,
                6318
            ],
            [
                6318,
                6320
            ],
            [
                6321,
                6326
            ],
            [
                6327,
                6404
            ],
            [
                6404,
                6426
            ],
            [
                6427,
                6552
            ],
            [
                6552,
                6699
            ],
            [
                6700,
                6785
            ],
            [
                6785,
                6786
            ],
            [
                6787,
                6829
            ],
            [
                6830,
                6844
            ],
            [
                6844,
                6865
            ],
            [
                6865,
                6866
            ],
            [
                6867,
                6870
            ],
            [
                6880,
                6882
            ],
            [
                6883,
                6889
            ],
            [
                6890,
                6894
            ],
            [
                6895,
                6906
            ],
            [
                6909,
                6936
            ],
            [
                6936,
                6939
            ],
            [
                6955,
                6966
            ],
            [
                6967,
                6970
            ],
            [
                6971,
                6983
            ],
            [
                6983,
                7031
            ],
            [
                7032,
                7061
            ],
            [
                7061,
                7135
            ],
            [
                7137,
                7179
            ],
            [
                7179,
                7230
            ],
            [
                7231,
                7248
            ],
            [
                7248,
                7278
            ],
            [
                7279,
                7299
            ],
            [
                7303,
                7306
            ],
            [
                7307,
                7310
            ],
            [
                7317,
                7366
            ],
            [
                7384,
                7386
            ],
            [
                7391,
                7437
            ],
            [
                7438,
                7451
            ],
            [
                7451,
                7453
            ],
            [
                7453,
                7500
            ],
            [
                7501,
                7519
            ],
            [
                7519,
                7578
            ],
            [
                7588,
                7599
            ],
            [
                7599,
                7611
            ],
            [
                7615,
                7632
            ],
            [
                7633,
                7637
            ],
            [
                7637,
                7652
            ],
            [
                7653,
                7655
            ],
            [
                7656,
                7670
            ],
            [
                7670,
                7824
            ],
            [
                7824,
                7830
            ],
            [
                7831,
                7833
            ],
            [
                7843,
                7847
            ],
            [
                7848,
                7850
            ],
            [
                7851,
                7855
            ],
            [
                7855,
                7857
            ],
            [
                7857,
                7881
            ],
            [
                7884,
                7894
            ],
            [
                7900,
                7927
            ],
            [
                7928,
                7935
            ],
            [
                7935,
                8007
            ],
            [
                8008,
                8024
            ],
            [
                8025,
                8101
            ],
            [
                8102,
                8123
            ],
            [
                8123,
                8144
            ],
            [
                8151,
                8169
            ],
            [
                8170,
                8173
            ],
            [
                8174,
                8181
            ],
            [
                8182,
                8230
            ],
            [
                8230,
                8293
            ],
            [
                8293,
                8324
            ],
            [
                8337,
                8359
            ],
            [
                8360,
                8410
            ],
            [
                8411,
                8416
            ],
            [
                8422,
                8425
            ],
            [
                8429,
                8431
            ],
            [
                8436,
                8443
            ],
            [
                8443,
                8464
            ],
            [
                8465,
                8495
            ],
            [
                8495,
                8497
            ],
            [
                8497,
                8504
            ],
            [
                8504,
                8523
            ],
            [
                8523,
                8525
            ],
            [
                8525,
                8643
            ],
            [
                8652,
                8654
            ],
            [
                8655,
                8697
            ],
            [
                8697,
                8745
            ],
            [
                8751,
                8760
            ],
            [
                8760,
                8794
            ],
            [
                8794,
                8795
            ],
            [
                8796,
                8849
            ],
            [
                8849,
                8925
            ],
            [
                8925,
                8946
            ],
            [
                8947,
                9008
            ],
            [
                9008,
                9065
            ],
            [
                9077,
                9102
            ],
            [
                9102,
                9104
            ],
            [
                9104,
                9131
            ],
            [
                9136,
                9178
            ],
            [
                9178,
                9180
            ],
            [
                9180,
                9184
            ],
            [
                9185,
                9198
            ],
            [
                9199,
                9234
            ],
            [
                9235,
                9311
            ],
            [
                9311,
                9350
            ],
            [
                9350,
                9370
            ],
            [
                9371,
                9373
            ],
            [
                9374,
                9385
            ],
            [
                9386,
                9413
            ],
            [
                9414,
                9417
            ],
            [
                9418,
                9428
            ],
            [
                9429,
                9468
            ],
            [
                9468,
                9492
            ],
            [
                9493,
                9499
            ],
            [
                9508,
                9547
            ],
            [
                9552,
                9553
            ],
            [
                9554,
                9622
            ],
            [
                9623,
                9680
            ],
            [
                9680,
                9798
            ],
            [
                9798,
                9882
            ],
            [
                9885,
                9895
            ],
            [
                9895,
                9897
            ],
            [
                9897,
                9975
            ],
            [
                9975,
                9981
            ],
            [
                9989,
                10059
            ],
            [
                10059,
                10073
            ],
            [
                10077,
                10093
            ],
            [
                10094,
                10116
            ],
            [
                10116,
                10196
            ],
            [
                10197,
                10220
            ],
            [
                10220,
                10222
            ],
            [
                10244,
                10247
            ],
            [
                10258,
                10259
            ],
            [
                10266,
                10295
            ],
            [
                10295,
                10296
            ],
            [
                10302,
                10310
            ],
            [
                10320,
                10327
            ],
            [
                10328,
                10331
            ],
            [
                10331,
                10332
            ],
            [
                10333,
                10440
            ],
            [
                10443,
                10479
            ],
            [
                10479,
                10506
            ],
            [
                10507,
                10530
            ],
            [
                10530,
                10596
            ],
            [
                10597,
                10659
            ],
            [
                10662,
                10665
            ],
            [
                10666,
                10673
            ],
            [
                10674,
                10697
            ],
            [
                10697,
                10730
            ],
            [
                10730,
                10852
            ],
            [
                10852,
                10862
            ],
            [
                10863,
                10866
            ],
            [
                10867,
                10871
            ],
            [
                10872,
                10891
            ],
            [
                10891,
                10927
            ],
            [
                10928,
                10960
            ],
            [
                10960,
                11026
            ],
            [
                11026,
                11048
            ],
            [
                11052,
                11058
            ],
            [
                11059,
                11065
            ],
            [
                11066,
                11082
            ],
            [
                11083,
                11131
            ],
            [
                11138,
                11158
            ],
            [
                11163,
                11206
            ],
            [
                11209,
                11241
            ],
            [
                11242,
                11248
            ],
            [
                11248,
                11319
            ],
            [
                11320,
                11375
            ],
            [
                11375,
                11425
            ],
            [
                11425,
                11455
            ],
            [
                11455,
                11575
            ],
            [
                11591,
                11613
            ],
            [
                11614,
                11634
            ],
            [
                11635,
                11682
            ],
            [
                11682,
                11732
            ],
            [
                11732,
                11774
            ],
            [
                11774,
                11776
            ],
            [
                11776,
                11794
            ],
            [
                11795,
                11832
            ],
            [
                11832,
                11843
            ],
            [
                11843,
                11845
            ],
            [
                11845,
                11877
            ],
            [
                11878,
                11881
            ],
            [
                11882,
                11907
            ],
            [
                11910,
                11939
            ],
            [
                11943,
                12027
            ],
            [
                12027,
                12104
            ],
            [
                12105,
                12202
            ],
            [
                12202,
                12206
            ],
            [
                12206,
                12229
            ],
            [
                12229,
                12275
            ],
            [
                12275,
                12312
            ],
            [
                12312,
                12326
            ],
            [
                12326,
                12409
            ],
            [
                12410,
                12461
            ],
            [
                12461,
                12495
            ],
            [
                12496,
                12528
            ],
            [
                12528,
                12605
            ],
            [
                12605,
                12608
            ],
            [
                12609,
                12669
            ],
            [
                12669,
                12694
            ],
            [
                12694,
                12704
            ],
            [
                12704,
                12759
            ],
            [
                12759,
                12828
            ],
            [
                12828,
                12848
            ],
            [
                12849,
                12855
            ],
            [
                12855,
                12857
            ],
            [
                12857,
                12886
            ],
            [
                12886,
                12964
            ],
            [
                12965,
                12972
            ],
            [
                12973,
                13055
            ],
            [
                13055,
                13070
            ],
            [
                13071,
                13177
            ],
            [
                13177,
                13179
            ],
            [
                13182,
                13230
            ],
            [
                13231,
                13300
            ],
            [
                13300,
                13310
            ],
            [
                13310,
                13340
            ],
            [
                13340,
                13347
            ],
            [
                13348,
                13377
            ],
            [
                13382,
                13396
            ],
            [
                13396,
                13421
            ],
            [
                13421,
                13440
            ],
            [
                13440,
                13454
            ],
            [
                13455,
                13496
            ],
            [
                13496,
                13518
            ],
            [
                13518,
                13529
            ],
            [
                13529,
                13647
            ],
            [
                13647,
                13740
            ],
            [
                13743,
                13832
            ],
            [
                13844,
                13860
            ],
            [
                13866,
                13869
            ],
            [
                13876,
                13885
            ]
        ],
        "row_chars": [
            [
                0,
                79
            ],
            [
                79,
                79
            ],
            [
                79,
                285
            ],
            [
                285,
                424
            ],
            [
                424,
                424
            ],
            [
                424,
                666
            ],
            [
                666,
                666
            ],
            [
                666,
                739
            ],
            [
                739,
                872
            ],
            [
                872,
                872
            ],
            [
                872,
                1020
            ],
            [
                1020,
                1183
            ],
            [
                1183,
                1183
            ],
            [
                1183,
                1326
            ],
            [
                1326,
                1375
            ],
            [
                1375,
                1482
            ],
            [
                1482,
                1543
            ],
            [
                1543,
                1660
            ],
            [
                1660,
                1776
            ],
            [
                1776,
                1845
            ],
            [
                1845,
                1845
            ],
            [
                1845,
                1904
            ],
            [
                1904,
                1972
            ],
            [
                1972,
                1972
            ],
            [
                1972,
                1972
            ],
            [
                1972,
                2066
            ],
            [
                2066,
                2140
            ],
            [
                2140,
                2209
            ],
            [
                2209,
                2302
            ],
            [
                2302,
                2351
            ],
            [
                2351,
                2485
            ],
            [
                2485,
                2599
            ],
            [
                2599,
                2599
            ],
            [
                2599,
                2708
            ],
            [
                2708,
                2748
            ],
            [
                2748,
                2757
            ],
            [
                2757,
                2763
            ],
            [
                2763,
                2821
            ],
            [
                2821,
                2847
            ],
            [
                2847,
                2909
            ],
            [
                2909,
                2935
            ],
            [
                2935,
                3005
            ],
            [
                3005,
                3086
            ],
            [
                3086,
                3153
            ],
            [
                3153,
                3277
            ],
            [
                3277,
                3277
            ],
            [
                3277,
                3340
            ],
            [
                3340,
                3340
            ],
            [
                3340,
                3420
            ],
            [
                3420,
                3458
            ],
            [
                3458,
                3513
            ],
            [
                3513,
                3520
            ],
            [
                3520,
                3544
            ],
            [
                3544,
                3563
            ],
            [
                3563,
                3702
            ],
            [
                3702,
                3782
            ],
            [
                3782,
                3808
            ],
            [
                3808,
                3842
            ],
            [
                3842,
                3922
            ],
            [
                3922,
                3943
            ],
            [
                3943,
                4000
            ],
            [
                4000,
                4047
            ],
            [
                4047,
                4138
            ],
            [
                4138,
                4190
            ],
            [
                4190,
                4250
            ],
            [
                4250,
                4274
            ],
            [
                4274,
                4369
            ],
            [
                4369,
                4397
            ],
            [
                4397,
                4413
            ],
            [
                4413,
                4451
            ],
            [
                4451,
                4489
            ],
            [
                4489,
                4560
            ],
            [
                4560,
                4560
            ],
            [
                4560,
                4578
            ],
            [
                4578,
                4661
            ],
            [
                4661,
                4673
            ],
            [
                4673,
                4800
            ],
            [
                4800,
                4850
            ],
            [
                4850,
                4978
            ],
            [
                4978,
                5048
            ],
            [
                5048,
                5048
            ],
            [
                5048,
                5048
            ],
            [
                5048,
                5245
            ],
            [
                5245,
                5315
            ],
            [
                5315,
                5315
            ],
            [
                5315,
                5367
            ],
            [
                5367,
                5379
            ],
            [
                5379,
                5447
            ],
            [
                5447,
                5521
            ],
            [
                5521,
                5600
            ],
            [
                5600,
                5655
            ],
            [
                5655,
                5666
            ],
            [
                5666,
                5746
            ],
            [
                5746,
                5907
            ],
            [
                5907,
                6071
            ],
            [
                6071,
                6139
            ],
            [
                6139,
                6275
            ],
            [
                6275,
                6318
            ],
            [
                6318,
                6318
            ],
            [
                6318,
                6404
            ],
            [
                6404,
                6552
            ],
            [
                6552,
                6700
            ],
            [
                6700,
                6787
            ],
            [
                6787,
                6830
            ],
            [
                6830,
                6936
            ],
            [
                6936,
                6983
            ],
            [
                6983,
                6983
            ],
            [
                6983,
                7061
            ],
            [
                7061,
                7179
            ],
            [
                7179,
                7248
            ],
            [
                7248,
                7453
            ],
            [
                7453,
                7453
            ],
            [
                7453,
                7453
            ],
            [
                7453,
                7519
            ],
            [
                7519,
                7599
            ],
            [
                7599,
                7670
            ],
            [
                7670,
                7824
            ],
            [
                7824,
                7824
            ],
            [
                7824,
                7857
            ],
            [
                7857,
                8008
            ],
            [
                8008,
                8123
            ],
            [
                8123,
                8230
            ],
            [
                8230,
                8360
            ],
            [
                8360,
                8360
            ],
            [
                8360,
                8443
            ],
            [
                8443,
                8443
            ],
            [
                8443,
                8497
            ],
            [
                8497,
                8504
            ],
            [
                8504,
                8525
            ],
            [
                8525,
                8644
            ],
            [
                8644,
                8644
            ],
            [
                8644,
                8697
            ],
            [
                8697,
                8760
            ],
            [
                8760,
                8849
            ],
            [
                8849,
                8925
            ],
            [
                8925,
                9008
            ],
            [
                9008,
                9104
            ],
            [
                9104,
                9104
            ],
            [
                9104,
                9180
            ],
            [
                9180,
                9199
            ],
            [
                9199,
                9311
            ],
            [
                9311,
                9386
            ],
            [
                9386,
                9468
            ],
            [
                9468,
                9554
            ],
            [
                9554,
                9680
            ],
            [
                9680,
                9798
            ],
            [
                9798,
                9897
            ],
            [
                9897,
                9975
            ],
            [
                9975,
                10059
            ],
            [
                10059,
                10059
            ],
            [
                10059,
                10059
            ],
            [
                10059,
                10116
            ],
            [
                10116,
                10222
            ],
            [
                10222,
                10333
            ],
            [
                10333,
                10479
            ],
            [
                10479,
                10479
            ],
            [
                10479,
                10697
            ],
            [
                10697,
                10730
            ],
            [
                10730,
                10852
            ],
            [
                10852,
                10960
            ],
            [
                10960,
                11026
            ],
            [
                11026,
                11026
            ],
            [
                11026,
                11083
            ],
            [
                11083,
                11083
            ],
            [
                11083,
                11375
            ],
            [
                11375,
                11425
            ],
            [
                11425,
                11455
            ],
            [
                11455,
                11614
            ],
            [
                11614,
                11682
            ],
            [
                11682,
                11732
            ],
            [
                11732,
                11776
            ],
            [
                11776,
                11832
            ],
            [
                11832,
                11845
            ],
            [
                11845,
                11845
            ],
            [
                11845,
                11845
            ],
            [
                11845,
                11910
            ],
            [
                11910,
                11910
            ],
            [
                11910,
                12027
            ],
            [
                12027,
                12202
            ],
            [
                12202,
                12229
            ],
            [
                12229,
                12275
            ],
            [
                12275,
                12312
            ],
            [
                12312,
                12326
            ],
            [
                12326,
                12410
            ],
            [
                12410,
                12410
            ],
            [
                12410,
                12461
            ],
            [
                12461,
                12496
            ],
            [
                12496,
                12528
            ],
            [
                12528,
                12605
            ],
            [
                12605,
                12669
            ],
            [
                12669,
                12694
            ],
            [
                12694,
                12704
            ],
            [
                12704,
                12759
            ],
            [
                12759,
                12828
            ],
            [
                12828,
                12857
            ],
            [
                12857,
                12886
            ],
            [
                12886,
                12965
            ],
            [
                12965,
                13055
            ],
            [
                13055,
                13179
            ],
            [
                13179,
                13300
            ],
            [
                13300,
                13340
            ],
            [
                13340,
                13377
            ],
            [
                13377,
                13396
            ],
            [
                13396,
                13421
            ],
            [
                13421,
                13440
            ],
            [
                13440,
                13496
            ],
            [
                13496,
                13518
            ],
            [
                13518,
                13529
            ],
            [
                13529,
                13647
            ],
            [
                13647,
                13885
            ]
        ]
    }
}