{
    "original": {
        "text": "Burgo Fitzgerald remained for a minute or two leaning where we last saw him,--against the dining-room wall at the bottom of the staircase; and as he did so some thoughts that were almost solemn passed across his mind, This thing that he was about to do, or to attempt,--was it in itself a good thing, and would it be good for her whom he pretended to love? What would be her future if she consented now to go with him, and to divide herself from her husband? Of his own future he thought not at all. He had never done so. Even when he had first found himself attracted by the reputation of her wealth, he cannot be said to have looked forward in any prudential way to coming years. His desire to put himself in possession of so magnificent a fortune had simply prompted him, as he might have been prompted to play for a high stake at a gaming-table. But now, during these moments, he did think a little of her. Would she be happy, simply because he loved her, when all women should cease to acknowledge her; when men would regard her as one degraded and dishonoured; when society should be closed against her; when she would be driven to live loudly because the softness and graces of quiet life would be denied to her? Burgo knew well what must be the nature of such a woman's life in such circumstances. Would Glencora be happy with him while living such a life simply because he loved her? And, under such circumstances, was it likely that he would continue to love her? Did he not know himself to be the most inconstant of men, and the least trustworthy? Leaning thus against the wall at the bottom of the stairs he did ask himself all these questions with something of true feeling about his heart, and almost persuaded himself that he had better take his hat and wander forth anywhere into the streets. It mattered little what might become of himself. If he could drink himself out of the world, it might be an end of things that would be not altogether undesirable.\nBut then the remembrance of his aunt's two hundred pounds came upon him, which money he even now had about him on his person, and a certain idea of honour told him that he was bound to do that for which the money had been given to him. As to telling his aunt that he had changed his mind, and, therefore, refunding the money--no such thought as that was possible to him! To give back two hundred pounds entire,--two hundred pounds which were already within his clutches, was not within the compass of Burgo's generosity. Remembering the cash, he told himself that hesitation was no longer possible to him. So he gathered himself up, stretched his hands over his head, uttered a sigh that was audible to all around him, and took himself up-stairs.\nHe looked in at his aunt's room, and then he saw her and was seen by her. \"Well, Burgo,\" she said, with her sweetest smile, \"have you been dancing?\" He turned away from her without answering her, muttering something between his teeth about a cold-blooded Jezebel,--which, if she had heard it, would have made her think him the most ungrateful of men. But she did not hear him, and smiled still as he went away, saying something to Mrs. Conway Sparkes as to the great change for the better which had taken place in her nephew's conduct.\n\"There's no knowing who may not reform,\" said Mrs. Sparkes, with an emphasis which seemed to Lady Monk to be almost uncourteous.\nBurgo made his way first into the front room and then into the larger room where the dancing was in progress, and there he saw Lady Glencora standing up in a quadrille with the Marquis of Hartletop. Lord Hartletop was a man not much more given to conversation than his wife, and Lady Glencora seemed to go through her work with very little gratification either in the dancing or in the society of her partner. She was simply standing up to dance, because, as she had told Mr. Palliser, ladies of her age generally do stand up on such occasions. Burgo watched her as she crossed and re-crossed the room, and at last she was aware of his presence. It made no change in her, except that she became even somewhat less animated than she had been before. She would not seem to see him, nor would she allow herself to be driven into a pretence of a conversation with her partner because he was there. \"I will go up to her at once, and ask her to waltz,\" Burgo said to himself, as soon as the last figure of the quadrille was in action. \"Why should I not ask her as well as any other woman?\" Then the music ceased, and after a minute's interval Lord Hartletop took away his partner on his arm into another room. Burgo, who had been standing near the door, followed them at once. The crowd was great, so that he could not get near them or even keep them in sight, but he was aware of the way in which they were going.\nIt was five minutes after this when he again saw her, and then she was seated on a cane bench in the gallery, and an old woman was standing close to her, talking to her. It was Mrs. Marsham cautioning her against some petty imprudence, and Lady Glencora was telling that lady that she needed no such advice, in words almost as curt as those I have used. Lord Hartletop had left her, feeling that, as far as that was concerned, he had done his duty for the night. Burgo knew nothing of Mrs. Marsham,--had never seen her before, and was quite unaware that she had any special connection with Mr. Palliser. It was impossible, he thought, to find Lady Glencora in a better position for his purpose, so he made his way up to her through the crowd, and muttering some slight inaudible word, offered her his hand.\n\"That will do very well thank you, Mrs. Marsham,\" Lady Glencora said at this moment. \"Pray, do not trouble yourself,\" and then she gave her hand to Fitzgerald. Mrs. Marsham, though unknown to him, knew with quite sufficient accuracy who he was, and all his history, as far as it concerned her friend's wife. She had learned the whole story of the loves of Burgo and Lady Glencora. Though Mr. Palliser had never mentioned that man's name to her, she was well aware that her duty as a duenna would make it expedient that she should keep a doubly wary eye upon him should he come near the sheepfold. And there he was, close to them, almost leaning over them, with the hand of his late lady love,--the hand of Mr. Palliser's wife,--within his own! How Lady Glencora might have carried herself at this moment had Mrs. Marsham not been there, it is bootless now to surmise; but it may be well understood that under Mrs. Marsham's immediate eye all her resolution would be in Burgo's favour. She looked at him softly and kindly, and though she uttered no articulate word, her countenance seemed to show that the meeting was not unpleasant to her.\n\"Will you waltz?\" said Burgo,--asking it not at all as though it were a special favour,--asking it exactly as he might have done had they been in the habit of dancing with each other every other night for the last three months.\n\"I don't think Lady Glencora will waltz to-night,\" said Mrs. Marsham, very stiffly. She certainly did not know her business as a duenna, or else the enormity of Burgo's proposition had struck her so forcibly as to take away from her all her presence of mind. Otherwise, she must have been aware that such an answer from her would surely drive her friend's wife into open hostility.\n\"And why not, Mrs. Marsham?\" said Lady Glencora rising from her seat. \"Why shouldn't I waltz to-night? I rather think I shall, the more especially as Mr. Fitzgerald waltzes very well.\" Thereupon she put her hand upon Burgo's arm.\nMrs. Marsham made still a little effort,--a little effort that was probably involuntary. She put out her hand, and laid it on Lady Glencora's left shoulder, looking into her face as she did so with all the severity of caution of which she was mistress. Lady Glencora shook her duenna off angrily. Whether she would put her fate into the hands of this man who was now touching her, or whether she would not, she had not as yet decided; but of this she was very sure, that nothing said or done by Mrs. Marsham should have any effect in restraining her.\nWhat could Mrs. Marsham do? Mr. Palliser was gone. Some rumour of that proposed visit to Monkshade, and the way in which it had been prevented, had reached her ear. Some whispers had come to her that Fitzgerald still dared to love, as married, the woman whom he had loved before she was married. There was a rumour about that he still had some hope. Mrs. Marsham had never believed that Mr. Palliser's wife would really be false to her vows. It was not in fear of any such catastrophe as a positive elopement that she had taken upon herself the duty of duenna. Lady Glencora would, no doubt, require to be pressed down into that decent mould which it would become the wife of a Mr. Palliser to assume as her form; and this pressing down, and this moulding, Mrs. Marsham thought that she could accomplish. It had not hitherto occurred to her that she might be required to guard Mr. Palliser from positive dishonour; but now--now she hardly knew what to think about it. What should she do? To whom should she go? And then she saw Mr. Bott looming large before her on the top of the staircase.\n[Illustration: Mr. Bott on the watch.]\nIn the meantime Lady Glencora went off towards the dancers, leaning on Burgo's arm. \"Who is that woman?\" said Burgo. They were the first words he spoke to her, though since he had last seen her he had written to her that letter which even now she carried about her. His voice in her ears sounded as it used to sound when their intimacy had been close, and questions such as that he had asked were common between them. And her answer was of the same nature. \"Oh, such an odious woman!\" she said. \"Her name is Mrs. Marsham; she is my bte noire.\" And then they were actually dancing, whirling round the room together, before a word had been said of that which was Burgo's settled purpose, and which at some moments was her settled purpose also.\nBurgo waltzed excellently, and in old days, before her marriage, Lady Glencora had been passionately fond of dancing. She seemed to give herself up to it now as though the old days had come back to her. Lady Monk, creeping to the intermediate door between her den and the dancing-room, looked in on them, and then crept back again. Mrs. Marsham and Mr. Bott standing together just inside the other door, near to the staircase, looked on also--in horror.\n\"He shouldn't have gone away and left her,\" said Mr. Bott, almost hoarsely.\n\"But who could have thought it?\" said Mrs. Marsham. \"I'm sure I didn't.\"\n\"I suppose you'd better tell him?\" said Mr. Bott.\n\"But I don't know where to find him,\" said Mrs. Marsham.\n\"I didn't mean now at once,\" said Mr. Bott;--and then he added, \"Do you think it is as bad as that?\"\n\"I don't know what to think,\" said Mrs. Marsham.\nThe waltzers went on till they were stopped by want of breath. \"I am so much out of practice,\" said Lady Glencora; \"I didn't think--I should have been able--to dance at all.\" Then she put up her face, and slightly opened her mouth, and stretched her nostrils,--as ladies do as well as horses when the running has been severe and they want air.\n\"You'll take another turn,\" said he.\n\"Presently,\" said she, beginning to have some thought in her mind as to whether Mrs. Marsham was watching her. Then there was a little pause, after which he spoke in an altered voice.\n\"Does it put you in mind of old days?\" said he.\nIt was, of course, necessary for him that he should bring her to some thought of the truth. It was all very sweet, that dancing with her, as they used to dance, without any question as to the reason why it was so; that sudden falling into the old habits, as though everything between this night and the former nights had been a dream; but this would not further his views. The opportunity had come to him which he must use, if he intended ever to use such opportunity. There was the two hundred pounds in his pocket, which he did not intend to give back. \"Does it put you in mind of 'old days?'\" he said.\nThe words roused her from her sleep at once, and dissipated her dream. The facts all rushed upon her in an instant; the letter in her pocket; the request which she had made to Alice, that Alice might be induced to guard her from this danger; the words which her husband had spoken to her in the morning, and her anger against him in that he had subjected her to the eyes of a Mrs. Marsham; her own unsettled mind--quite unsettled whether it would be best for her to go or to stay! It all came upon her now at the first word of tenderness which Burgo spoke to her.\nIt has often been said of woman that she who doubts is lost,--so often that they who say it now, say it simply because others have said it before them, never thinking whether or no there be any truth in the proverb. But they who have said so, thinking of their words as they were uttered, have known but little of women. Women doubt every day, who solve their doubts at last on the right side, driven to do so, some by fear, more by conscience, but most of them by that half-prudential, half-unconscious knowledge of what is fitting, useful, and best under the cirumstances, which rarely deserts either men or women till they have brought themselves to the Burgo Fitzgerald state of recklessness. Men when they have fallen even to that, will still keep up some outward show towards the world; but women in this condition defy the world, and declare themselves to be children of perdition. Lady Glencora was doubting sorely; but, though doubting, she was not as yet lost.\n\"Does it put you in mind of old days?\" said Burgo.\nShe was driven to answer, and she knew that much would be decided by the way in which she might now speak. \"You must not talk of that,\" she said, very softly.\n\"May I not?\" And now his tongue was unloosed, so that he began to speak quickly. \"May I not? And why not? They were happy days,--so happy! Were not you happy when you thought--? Ah, dear! I suppose it is best not even to think of them?\"\n\"Much the best.\"\n\"Only it is impossible. I wish I knew the inside of your heart, Cora, so that I could see what it is that you really wish.\"\nIn the old days he had always called her Cora, and now the name came from his lips upon her ears as a thing of custom, causing no surprise. They were standing back, behind the circle, almost in a corner, and Burgo knew well how to speak at such moments so that his words should be audible to none but her whom he addressed.\n\"You should not have come to me at all,\" she said.\n\"And why not? Who has a better right to come to you? Who has ever loved you as I have done? Cora, did you get my letter?\"\n\"Come and dance,\" she said; \"I see a pair of eyes looking at us.\" The pair of eyes which Lady Glencora saw were in the possession of Mr. Bott, who was standing alone, leaning against the side of the doorway, every now and then raising his heels from the ground, so that he might look down upon the sinners as from a vantage ground. He was quite alone. Mrs. Marsham had left him, and had gotten herself away in Lady Glencora's own carriage to Park Lane, in order that she might find Mr. Palliser there, if by chance he should be at home.\n\"Won't it be making mischief?\" Mrs. Marsham had said when Mr. Bott had suggested this line of conduct.\n\"There'll be worse mischief if you don't,\" Mr. Bott had answered. \"He can come back, and then he can do as he likes. I'll keep my eyes upon them.\" And so he did keep his eyes upon them.\nAgain they went round the room,--or that small portion of the room which the invading crowd had left to the dancers,--as though they were enjoying themselves thoroughly, and in all innocence. But there were others besides Mr. Bott who looked on and wondered. The Duchess of St. Bungay saw it, and shook her head sorrowing,--for the Duchess was good at heart. Mrs. Conway Sparkes saw it, and drank it down with keen appetite,--as a thirsty man with a longing for wine will drink champagne,--for Mrs. Conway Sparkes was not good at heart. Lady Hartletop saw it, and just raised her eyebrows. It was nothing to her. She liked to know what was going on, as such knowledge was sometimes useful; but, as for heart,--what she had was, in such a matter, neither good nor bad. Her blood circulated with its ordinary precision, and, in that respect, no woman ever had a better heart. Lady Monk saw it, and a frown gathered on her brow. \"The fool!\" she said to herself. She knew that Burgo would not help his success by drawing down the eyes of all her guests upon his attempt. In the meantime Mr. Bott stood there, mounting still higher on his toes, straightening his back against the wall.\n\"Did you get my letter?\" Burgo said again, as soon as a moment's pause gave him breath to speak. She did not answer him. Perhaps her breath did not return to her as rapidly as his. But, of course, he knew that she had received it. She would have quickly signified to him that no letter from him had come to her hands had it not reached her. \"Let us go out upon the stairs,\" he said, \"for I must speak to you. Oh, if you could know what I suffered when you did not come to Monkshade! Why did you not come?\"\n\"I wish I had not come here,\" she said.\n\"Because you have seen me? That, at any rate, is not kind of you.\"\nThey were now making their way slowly down the stairs, in the crowd, towards the supper-room. All the world was now intent on food and drink, and they were only doing as others did. Lady Glencora was not thinking where she went, but, glancing upwards, as she stood for a moment wedged upon the stairs, her eyes met those of Mr. Bott. \"A man that can treat me like that deserves that I should leave him.\" That was the thought that crossed her mind at the moment.\n\"I'll get you some champagne with water in it,\" said Burgo. \"I know that is what you like.\"\n\"Do not get me anything,\" she said. They had now got into the room, and had therefore escaped Mr. Bott's eyes for the moment. \"Mr. Fitzgerald,\"--and now her words had become a whisper in his ear,--\"do what I ask you. For the sake of the old days of which you spoke, the dear old days which can never come again--\"\n\"By G----! they can,\" said he. \"They can come back, and they shall.\"\n\"Never. But you can still do me a kindness. Go away, and leave me. Go to the sideboard, and then do not come back. You are doing me an injury while you remain with me.\"\n\"Cora,\" he said,\nBut she had now recovered her presence of mind, and understood what was going on. She was no longer in a dream, but words and things bore to her again their proper meaning. \"I will not have it, Mr. Fitzgerald,\" she answered, speaking almost passionately. \"I will not have it. Do as I bid you. Go and leave me, and do not return. I tell you that we are watched.\" This was still true, for Mr. Bott had now again got his eyes on them, round the supper-room door. Whatever was the reward for which he was working, private secretaryship or what else, it must be owned that he worked hard for it. But there are labours which are labours of love.\n\"Who is watching us?\" said Burgo; \"and what does it matter? If you are minded to do as I have asked you--\"\n\"But I am not so minded. Do you not know that you insult me by proposing it?\"\n\"Yes;--it is an insult, Cora,--unless such an offer be a joy to you. If you wish to be my wife instead of his, it is no insult.\"\n\"How can I be that?\" Her face was not turned to him, and her words were half-pronounced, and in the lowest whisper, but, nevertheless, he heard them.\n\"Come with me,--abroad, and you shall yet be my wife. You got my letter? Do what I asked you, then. Come with me--to-night.\"\nThe pressing instance of the suggestion, the fixing of a present hour, startled her back to her propriety. \"Mr. Fitzgerald,\" she said, \"I asked you to go and leave me. If you do not do so, I must get up and leave you. It will be much more difficult.\"\n\"And is that to be all?\"\n\"All;--at any rate, now.\" Oh, Glencora! how could you be so weak? Why did you add that word, \"now\"? In truth, she added it then, at that moment, simply feeling that she could thus best secure an immediate compliance with her request.\n\"I will not go,\" he said, looking at her sternly, and leaning before her, with earnest face, with utter indifference as to the eyes of any that might see them. \"I will not go till you tell me that you will see me again.\"\n\"I will,\" she said in that low, all-but-unuttered whisper.\n\"When,--when,--when?\" he asked.\nLooking up again towards the doorway, in fear of Mr. Bott's eyes, she saw the face of Mr. Palliser as he entered the room. Mr. Bott had also seen him, and had tried to clutch him by the arm; but Mr. Palliser had shaken him off, apparently with indifference,--had got rid of him, as it were, without noticing him. Lady Glencora, when she saw her husband, immediately recovered her courage. She would not cower before him, or show herself ashamed of what she had done. For the matter of that, if he pressed her on the subject, she could bring herself to tell him that she loved Burgo Fitzgerald much more easily than she could whisper such a word to Burgo himself. Mr. Bott's eyes were odious to her as they watched her; but her husband's glance she could meet without quailing before it. \"Here is Mr. Palliser,\" said she, speaking again in her ordinary clear-toned voice. Burgo immediately rose from his seat with a start, and turned quickly towards the door; but Lady Glencora kept her chair.\nMr. Palliser made his way as best he could through the crowd up to his wife. He, too, kept his countenance without betraying his secret. There was neither anger nor dismay in his face, nor was there any untoward hurry in his movement. Burgo stood aside as he came up, and Lady Glencora was the first to speak. \"I thought you were gone home hours ago,\" she said.\n\"I did go home,\" he answered, \"but I thought I might as well come back for you.\"\n\"What a model of a husband! Well; I am ready. Only, what shall we do about Jane? Mr. Fitzgerald, I left a scarf in your aunt's room,--a little black and yellow scarf,--would you mind getting it for me?\"\n\"I will fetch it,\" said Mr. Palliser; \"and I will tell your cousin that the carriage shall come back for her.\"\n\"If you will allow me--\" said Burgo.\n\"I will do it,\" said Mr. Palliser; and away he went, making his slow progress up through the crowd, ordering his carriage as he passed through the hall, and leaving Mr. Bott still watching at the door.\nLady Glencora resolved that she would say nothing to Burgo while her husband was gone. There was a touch of chivalry in his leaving them again together, which so far conquered her. He might have bade her leave the scarf, and come at once. She had seen, moreover, that he had not spoken to Mr. Bott, and was thankful to him also for that. Burgo also seemed to have become aware that his chance for that time was over. \"I will say good-night,\" he said. \"Good-night, Mr. Fitzgerald,\" she answered, giving him her hand. He pressed it for a moment, and then turned and went. When Mr. Palliser came back he was no more to be seen.\nLady Glencora was at the dining-room door when her husband returned, standing close to Mr. Bott. Mr. Bott had spoken to her, but she made no reply. He spoke again, but her face remained as immovable as though she had been deaf. \"And what shall we do about Mrs. Marsham?\" she said, quite out loud, as soon as she put her hand on her husband's arm. \"I had forgotten her.\"\n\"Mrs. Marsham has gone home,\" he replied.\n\"Have you seen her?\"\n\"Yes.\"\n\"When did you see her?\"\n\"She came to Park Lane.\"\n\"What made her do that?\"\nThese questions were asked and answered as he was putting her into the carriage. She got in just as she asked the last, and he, as he took his seat, did not find it necessary to answer it. But that would not serve her turn. \"What made Mrs. Marsham go to you at Park Lane after she left Lady Monk's?\" she asked again. Mr. Palliser sat silent, not having made up his mind what he would say on the subject. \"I suppose she went,\" continued Lady Glencora, \"to tell you that I was dancing with Mr. Fitzgerald. Was that it?\"\n\"I think, Glencora, we had better not discuss it now.\"\n\"I don't mean to discuss it now, or ever. If you did not wish me to see Mr. Fitzgerald you should not have sent me to Lady Monk's. But, Plantagenet, I hope you will forgive me if I say that no consideration shall induce me to receive again as a guest, in my own house, either Mrs. Marsham or Mr. Bott.\"\nMr. Palliser absolutely declined to say anything on the subject on that occasion, and the evening of Lady Monk's party in this way came to an end.",
        "paragraph_chars": [
            [
                0,
                1973
            ],
            [
                1973,
                2720
            ],
            [
                2720,
                3256
            ],
            [
                3256,
                3385
            ],
            [
                3385,
                4794
            ],
            [
                4794,
                5601
            ],
            [
                5601,
                6741
            ],
            [
                6741,
                6969
            ],
            [
                6969,
                7351
            ],
            [
                7351,
                7581
            ],
            [
                7581,
                8132
            ],
            [
                8132,
                9223
            ],
            [
                9223,
                9262
            ],
            [
                9262,
                10004
            ],
            [
                10004,
                10458
            ],
            [
                10458,
                10534
            ],
            [
                10534,
                10607
            ],
            [
                10607,
                10657
            ],
            [
                10657,
                10714
            ],
            [
                10714,
                10815
            ],
            [
                10815,
                10864
            ],
            [
                10864,
                11208
            ],
            [
                11208,
                11245
            ],
            [
                11245,
                11429
            ],
            [
                11429,
                11477
            ],
            [
                11477,
                12082
            ],
            [
                12082,
                12646
            ],
            [
                12646,
                13617
            ],
            [
                13617,
                13668
            ],
            [
                13668,
                13827
            ],
            [
                13827,
                14064
            ],
            [
                14064,
                14081
            ],
            [
                14081,
                14205
            ],
            [
                14205,
                14529
            ],
            [
                14529,
                14580
            ],
            [
                14580,
                14702
            ],
            [
                14702,
                15239
            ],
            [
                15239,
                15342
            ],
            [
                15342,
                15528
            ],
            [
                15528,
                16709
            ],
            [
                16709,
                17215
            ],
            [
                17215,
                17255
            ],
            [
                17255,
                17322
            ],
            [
                17322,
                17784
            ],
            [
                17784,
                17876
            ],
            [
                17876,
                18190
            ],
            [
                18190,
                18259
            ],
            [
                18259,
                18428
            ],
            [
                18428,
                18445
            ],
            [
                18445,
                19085
            ],
            [
                19085,
                19192
            ],
            [
                19192,
                19270
            ],
            [
                19270,
                19399
            ],
            [
                19399,
                19549
            ],
            [
                19549,
                19674
            ],
            [
                19674,
                19925
            ],
            [
                19925,
                19950
            ],
            [
                19950,
                20184
            ],
            [
                20184,
                20405
            ],
            [
                20405,
                20464
            ],
            [
                20464,
                20496
            ],
            [
                20496,
                21489
            ],
            [
                21489,
                21851
            ],
            [
                21851,
                21932
            ],
            [
                21932,
                22135
            ],
            [
                22135,
                22246
            ],
            [
                22246,
                22283
            ],
            [
                22283,
                22485
            ],
            [
                22485,
                23110
            ],
            [
                23110,
                23480
            ],
            [
                23480,
                23522
            ],
            [
                23522,
                23543
            ],
            [
                23543,
                23550
            ],
            [
                23550,
                23574
            ],
            [
                23574,
                23599
            ],
            [
                23599,
                23624
            ],
            [
                23624,
                24142
            ],
            [
                24142,
                24197
            ],
            [
                24197,
                24500
            ],
            [
                24500,
                24646
            ]
        ],
        "segment_chars": [
            [
                0,
                357
            ],
            [
                357,
                459
            ],
            [
                459,
                500
            ],
            [
                500,
                522
            ],
            [
                522,
                682
            ],
            [
                682,
                850
            ],
            [
                850,
                911
            ],
            [
                911,
                1220
            ],
            [
                1220,
                1306
            ],
            [
                1306,
                1393
            ],
            [
                1393,
                1474
            ],
            [
                1474,
                1559
            ],
            [
                1559,
                1809
            ],
            [
                1809,
                1858
            ],
            [
                1858,
                1973
            ],
            [
                1973,
                2209
            ],
            [
                2209,
                2344
            ],
            [
                2344,
                2494
            ],
            [
                2494,
                2579
            ],
            [
                2579,
                2720
            ],
            [
                2720,
                2794
            ],
            [
                2794,
                2869
            ],
            [
                2869,
                3071
            ],
            [
                3071,
                3256
            ],
            [
                3256,
                3385
            ],
            [
                3385,
                3584
            ],
            [
                3584,
                3795
            ],
            [
                3795,
                3930
            ],
            [
                3930,
                4031
            ],
            [
                4031,
                4134
            ],
            [
                4134,
                4279
            ],
            [
                4279,
                4414
            ],
            [
                4414,
                4469
            ],
            [
                4469,
                4589
            ],
            [
                4589,
                4656
            ],
            [
                4656,
                4794
            ],
            [
                4794,
                4964
            ],
            [
                4964,
                5148
            ],
            [
                5148,
                5257
            ],
            [
                5257,
                5398
            ],
            [
                5398,
                5601
            ],
            [
                5601,
                5686
            ],
            [
                5686,
                5761
            ],
            [
                5761,
                5909
            ],
            [
                5909,
                5982
            ],
            [
                5982,
                6198
            ],
            [
                6198,
                6345
            ],
            [
                6345,
                6586
            ],
            [
                6586,
                6741
            ],
            [
                6741,
                6759
            ],
            [
                6759,
                6969
            ],
            [
                6969,
                7053
            ],
            [
                7053,
                7228
            ],
            [
                7228,
                7351
            ],
            [
                7351,
                7380
            ],
            [
                7380,
                7421
            ],
            [
                7421,
                7454
            ],
            [
                7454,
                7536
            ],
            [
                7536,
                7581
            ],
            [
                7581,
                7670
            ],
            [
                7670,
                7834
            ],
            [
                7834,
                7878
            ],
            [
                7878,
                8132
            ],
            [
                8132,
                8160
            ],
            [
                8160,
                8183
            ],
            [
                8183,
                8297
            ],
            [
                8297,
                8428
            ],
            [
                8428,
                8482
            ],
            [
                8482,
                8574
            ],
            [
                8574,
                8693
            ],
            [
                8693,
                8937
            ],
            [
                8937,
                9100
            ],
            [
                9100,
                9120
            ],
            [
                9120,
                9143
            ],
            [
                9143,
                9223
            ],
            [
                9223,
                9262
            ],
            [
                9262,
                9346
            ],
            [
                9346,
                9367
            ],
            [
                9367,
                9379
            ],
            [
                9379,
                9528
            ],
            [
                9528,
                9680
            ],
            [
                9680,
                9719
            ],
            [
                9719,
                9747
            ],
            [
                9747,
                9757
            ],
            [
                9757,
                9806
            ],
            [
                9806,
                10004
            ],
            [
                10004,
                10122
            ],
            [
                10122,
                10207
            ],
            [
                10207,
                10336
            ],
            [
                10336,
                10458
            ],
            [
                10458,
                10534
            ],
            [
                10534,
                10567
            ],
            [
                10567,
                10586
            ],
            [
                10586,
                10607
            ],
            [
                10607,
                10642
            ],
            [
                10642,
                10657
            ],
            [
                10657,
                10714
            ],
            [
                10714,
                10815
            ],
            [
                10815,
                10864
            ],
            [
                10864,
                10927
            ],
            [
                10927,
                11039
            ],
            [
                11039,
                11208
            ],
            [
                11208,
                11245
            ],
            [
                11245,
                11356
            ],
            [
                11356,
                11429
            ],
            [
                11429,
                11468
            ],
            [
                11468,
                11477
            ],
            [
                11477,
                11569
            ],
            [
                11569,
                11850
            ],
            [
                11850,
                11946
            ],
            [
                11946,
                12032
            ],
            [
                12032,
                12073
            ],
            [
                12073,
                12082
            ],
            [
                12082,
                12153
            ],
            [
                12153,
                12563
            ],
            [
                12563,
                12646
            ],
            [
                12646,
                12862
            ],
            [
                12862,
                12967
            ],
            [
                12967,
                13343
            ],
            [
                13343,
                13535
            ],
            [
                13535,
                13617
            ],
            [
                13617,
                13656
            ],
            [
                13656,
                13668
            ],
            [
                13668,
                13775
            ],
            [
                13775,
                13827
            ],
            [
                13827,
                13840
            ],
            [
                13840,
                13908
            ],
            [
                13908,
                13920
            ],
            [
                13920,
                13933
            ],
            [
                13933,
                13966
            ],
            [
                13966,
                14005
            ],
            [
                14005,
                14015
            ],
            [
                14015,
                14064
            ],
            [
                14064,
                14081
            ],
            [
                14081,
                14105
            ],
            [
                14105,
                14205
            ],
            [
                14205,
                14345
            ],
            [
                14345,
                14529
            ],
            [
                14529,
                14580
            ],
            [
                14580,
                14594
            ],
            [
                14594,
                14633
            ],
            [
                14633,
                14672
            ],
            [
                14672,
                14702
            ],
            [
                14702,
                14768
            ],
            [
                14768,
                15034
            ],
            [
                15034,
                15054
            ],
            [
                15054,
                15239
            ],
            [
                15239,
                15270
            ],
            [
                15270,
                15342
            ],
            [
                15342,
                15408
            ],
            [
                15408,
                15459
            ],
            [
                15459,
                15489
            ],
            [
                15489,
                15528
            ],
            [
                15528,
                15720
            ],
            [
                15720,
                15787
            ],
            [
                15787,
                15887
            ],
            [
                15887,
                16065
            ],
            [
                16065,
                16118
            ],
            [
                16118,
                16141
            ],
            [
                16141,
                16296
            ],
            [
                16296,
                16402
            ],
            [
                16402,
                16454
            ],
            [
                16454,
                16466
            ],
            [
                16466,
                16487
            ],
            [
                16487,
                16595
            ],
            [
                16595,
                16709
            ],
            [
                16709,
                16734
            ],
            [
                16734,
                16806
            ],
            [
                16806,
                16830
            ],
            [
                16830,
                16890
            ],
            [
                16890,
                16940
            ],
            [
                16940,
                17050
            ],
            [
                17050,
                17118
            ],
            [
                17118,
                17192
            ],
            [
                17192,
                17215
            ],
            [
                17215,
                17255
            ],
            [
                17255,
                17282
            ],
            [
                17282,
                17322
            ],
            [
                17322,
                17416
            ],
            [
                17416,
                17504
            ],
            [
                17504,
                17656
            ],
            [
                17656,
                17726
            ],
            [
                17726,
                17784
            ],
            [
                17784,
                17844
            ],
            [
                17844,
                17876
            ],
            [
                17876,
                17912
            ],
            [
                17912,
                18002
            ],
            [
                18002,
                18093
            ],
            [
                18093,
                18190
            ],
            [
                18190,
                18201
            ],
            [
                18201,
                18221
            ],
            [
                18221,
                18259
            ],
            [
                18259,
                18267
            ],
            [
                18267,
                18303
            ],
            [
                18303,
                18326
            ],
            [
                18326,
                18374
            ],
            [
                18374,
                18428
            ],
            [
                18428,
                18445
            ],
            [
                18445,
                18527
            ],
            [
                18527,
                18618
            ],
            [
                18618,
                18700
            ],
            [
                18700,
                18721
            ],
            [
                18721,
                18738
            ],
            [
                18738,
                18774
            ],
            [
                18774,
                18807
            ],
            [
                18807,
                18905
            ],
            [
                18905,
                19036
            ],
            [
                19036,
                19085
            ],
            [
                19085,
                19107
            ],
            [
                19107,
                19145
            ],
            [
                19145,
                19192
            ],
            [
                19192,
                19217
            ],
            [
                19217,
                19270
            ],
            [
                19270,
                19339
            ],
            [
                19339,
                19399
            ],
            [
                19399,
                19420
            ],
            [
                19420,
                19549
            ],
            [
                19549,
                19603
            ],
            [
                19603,
                19622
            ],
            [
                19622,
                19649
            ],
            [
                19649,
                19674
            ],
            [
                19674,
                19781
            ],
            [
                19781,
                19842
            ],
            [
                19842,
                19892
            ],
            [
                19892,
                19925
            ],
            [
                19925,
                19950
            ],
            [
                19950,
                19976
            ],
            [
                19976,
                19990
            ],
            [
                19990,
                20016
            ],
            [
                20016,
                20050
            ],
            [
                20050,
                20184
            ],
            [
                20184,
                20344
            ],
            [
                20344,
                20405
            ],
            [
                20405,
                20464
            ],
            [
                20464,
                20486
            ],
            [
                20486,
                20496
            ],
            [
                20496,
                20619
            ],
            [
                20619,
                20809
            ],
            [
                20809,
                20885
            ],
            [
                20885,
                20963
            ],
            [
                20963,
                21159
            ],
            [
                21159,
                21283
            ],
            [
                21283,
                21367
            ],
            [
                21367,
                21489
            ],
            [
                21489,
                21566
            ],
            [
                21566,
                21626
            ],
            [
                21626,
                21724
            ],
            [
                21724,
                21799
            ],
            [
                21799,
                21851
            ],
            [
                21851,
                21932
            ],
            [
                21932,
                21960
            ],
            [
                21960,
                21978
            ],
            [
                21978,
                22013
            ],
            [
                22013,
                22135
            ],
            [
                22135,
                22246
            ],
            [
                22246,
                22283
            ],
            [
                22283,
                22485
            ],
            [
                22485,
                22572
            ],
            [
                22572,
                22666
            ],
            [
                22666,
                22724
            ],
            [
                22724,
                22823
            ],
            [
                22823,
                22902
            ],
            [
                22902,
                22936
            ],
            [
                22936,
                23001
            ],
            [
                23001,
                23055
            ],
            [
                23055,
                23110
            ],
            [
                23110,
                23207
            ],
            [
                23207,
                23258
            ],
            [
                23258,
                23338
            ],
            [
                23338,
                23381
            ],
            [
                23381,
                23457
            ],
            [
                23457,
                23480
            ],
            [
                23480,
                23522
            ],
            [
                23522,
                23543
            ],
            [
                23543,
                23550
            ],
            [
                23550,
                23574
            ],
            [
                23574,
                23599
            ],
            [
                23599,
                23624
            ],
            [
                23624,
                23705
            ],
            [
                23705,
                23813
            ],
            [
                23813,
                23848
            ],
            [
                23848,
                23924
            ],
            [
                23924,
                23941
            ],
            [
                23941,
                24028
            ],
            [
                24028,
                24128
            ],
            [
                24128,
                24142
            ],
            [
                24142,
                24197
            ],
            [
                24197,
                24239
            ],
            [
                24239,
                24328
            ],
            [
                24328,
                24500
            ],
            [
                24500,
                24646
            ]
        ],
        "overlap_chars": [
            [
                0,
                53
            ],
            [
                78,
                89
            ],
            [
                102,
                142
            ],
            [
                156,
                216
            ],
            [
                218,
                249
            ],
            [
                260,
                267
            ],
            [
                96,
                97
            ],
            [
                270,
                276
            ],
            [
                289,
                293
            ],
            [
                299,
                325
            ],
            [
                355,
                357
            ],
            [
                357,
                367
            ],
            [
                371,
                381
            ],
            [
                368,
                370
            ],
            [
                382,
                398
            ],
            [
                403,
                425
            ],
            [
                446,
                459
            ],
            [
                459,
                500
            ],
            [
                500,
                522
            ],
            [
                522,
                571
            ],
            [
                590,
                601
            ],
            [
                754,
                850
            ],
            [
                850,
                857
            ],
            [
                881,
                911
            ],
            [
                911,
                968
            ],
            [
                1030,
                1036
            ],
            [
                1041,
                1108
            ],
            [
                1218,
                1219
            ],
            [
                1393,
                1423
            ],
            [
                1446,
                1451
            ],
            [
                1443,
                1445
            ],
            [
                1452,
                1474
            ],
            [
                1474,
                1523
            ],
            [
                1532,
                1535
            ],
            [
                1524,
                1530
            ],
            [
                1557,
                1559
            ],
            [
                1617,
                1619
            ],
            [
                1628,
                1635
            ],
            [
                1640,
                1686
            ],
            [
                1702,
                1751
            ],
            [
                1769,
                1781
            ],
            [
                1791,
                1809
            ],
            [
                1858,
                1930
            ],
            [
                1971,
                1973
            ],
            [
                1973,
                1981
            ],
            [
                2058,
                2060
            ],
            [
                2001,
                2030
            ],
            [
                2097,
                2200
            ],
            [
                2207,
                2209
            ],
            [
                2209,
                2265
            ],
            [
                2278,
                2297
            ],
            [
                2318,
                2326
            ],
            [
                2342,
                2344
            ],
            [
                2448,
                2451
            ],
            [
                2347,
                2375
            ],
            [
                2492,
                2494
            ],
            [
                2579,
                2650
            ],
            [
                2651,
                2655
            ],
            [
                2690,
                2708
            ],
            [
                2718,
                2720
            ],
            [
                2720,
                2751
            ],
            [
                2792,
                2793
            ],
            [
                2794,
                2869
            ],
            [
                2869,
                2883
            ],
            [
                2914,
                2935
            ],
            [
                2954,
                2982
            ],
            [
                3069,
                3071
            ],
            [
                3071,
                3091
            ],
            [
                3095,
                3107
            ],
            [
                3114,
                3124
            ],
            [
                3254,
                3256
            ],
            [
                3385,
                3481
            ],
            [
                3493,
                3584
            ],
            [
                3669,
                3687
            ],
            [
                3749,
                3760
            ],
            [
                3767,
                3795
            ],
            [
                3795,
                3830
            ],
            [
                3832,
                3839
            ],
            [
                3899,
                3901
            ],
            [
                3928,
                3930
            ],
            [
                3930,
                3947
            ],
            [
                3986,
                4003
            ],
            [
                4008,
                4031
            ],
            [
                4031,
                4084
            ],
            [
                4094,
                4112
            ],
            [
                4126,
                4134
            ],
            [
                4134,
                4163
            ],
            [
                4277,
                4278
            ],
            [
                4279,
                4353
            ],
            [
                4412,
                4414
            ],
            [
                4469,
                4495
            ],
            [
                4522,
                4589
            ],
            [
                4589,
                4594
            ],
            [
                4633,
                4646
            ],
            [
                4654,
                4656
            ],
            [
                4656,
                4669
            ],
            [
                4677,
                4679
            ],
            [
                4670,
                4675
            ],
            [
                4680,
                4711
            ],
            [
                4738,
                4746
            ],
            [
                4771,
                4776
            ],
            [
                4764,
                4767
            ],
            [
                4777,
                4794
            ],
            [
                4801,
                4813
            ],
            [
                4830,
                4847
            ],
            [
                4865,
                4903
            ],
            [
                4908,
                4920
            ],
            [
                4925,
                4964
            ],
            [
                4964,
                4983
            ],
            [
                5100,
                5101
            ],
            [
                4984,
                5051
            ],
            [
                5121,
                5125
            ],
            [
                5052,
                5100
            ],
            [
                5146,
                5148
            ],
            [
                5148,
                5189
            ],
            [
                5221,
                5256
            ],
            [
                5257,
                5292
            ],
            [
                5321,
                5359
            ],
            [
                5368,
                5398
            ],
            [
                5489,
                5513
            ],
            [
                5437,
                5450
            ],
            [
                5518,
                5555
            ],
            [
                5563,
                5601
            ],
            [
                5601,
                5624
            ],
            [
                5625,
                5669
            ],
            [
                5684,
                5686
            ],
            [
                5686,
                5760
            ],
            [
                5761,
                5773
            ],
            [
                5798,
                5802
            ],
            [
                5834,
                5865
            ],
            [
                5907,
                5909
            ],
            [
                5982,
                6021
            ],
            [
                6033,
                6090
            ],
            [
                6115,
                6162
            ],
            [
                6196,
                6197
            ],
            [
                6198,
                6215
            ],
            [
                6238,
                6256
            ],
            [
                6295,
                6326
            ],
            [
                6343,
                6345
            ],
            [
                6345,
                6373
            ],
            [
                6390,
                6404
            ],
            [
                6409,
                6443
            ],
            [
                6457,
                6459
            ],
            [
                6467,
                6472
            ],
            [
                6504,
                6524
            ],
            [
                6535,
                6538
            ],
            [
                6539,
                6557
            ],
            [
                6567,
                6586
            ],
            [
                6586,
                6637
            ],
            [
                6664,
                6669
            ],
            [
                6682,
                6696
            ],
            [
                6739,
                6741
            ],
            [
                6741,
                6759
            ],
            [
                6759,
                6770
            ],
            [
                6772,
                6778
            ],
            [
                6793,
                6812
            ],
            [
                6967,
                6969
            ],
            [
                6969,
                7008
            ],
            [
                7017,
                7053
            ],
            [
                7053,
                7113
            ],
            [
                7239,
                7242
            ],
            [
                7293,
                7298
            ],
            [
                7248,
                7268
            ],
            [
                7277,
                7283
            ],
            [
                7306,
                7351
            ],
            [
                7351,
                7380
            ],
            [
                7380,
                7398
            ],
            [
                7399,
                7421
            ],
            [
                7421,
                7443
            ],
            [
                7452,
                7454
            ],
            [
                7454,
                7477
            ],
            [
                7487,
                7536
            ],
            [
                7546,
                7581
            ],
            [
                7581,
                7593
            ],
            [
                7696,
                7700
            ],
            [
                7605,
                7606
            ],
            [
                7686,
                7690
            ],
            [
                7704,
                7759
            ],
            [
                7774,
                7823
            ],
            [
                7832,
                7834
            ],
            [
                7834,
                7857
            ],
            [
                7865,
                7878
            ],
            [
                7878,
                7913
            ],
            [
                7918,
                7923
            ],
            [
                7986,
                7999
            ],
            [
                8003,
                8019
            ],
            [
                8028,
                8045
            ],
            [
                8047,
                8051
            ],
            [
                8076,
                8095
            ],
            [
                7983,
                7986
            ],
            [
                8127,
                8132
            ],
            [
                8132,
                8160
            ],
            [
                8160,
                8181
            ],
            [
                8181,
                8183
            ],
            [
                8297,
                8362
            ],
            [
                8426,
                8428
            ],
            [
                8482,
                8574
            ],
            [
                8574,
                8616
            ],
            [
                8641,
                8659
            ],
            [
                8673,
                8691
            ],
            [
                8780,
                8782
            ],
            [
                8732,
                8734
            ],
            [
                8768,
                8773
            ],
            [
                8836,
                8839
            ],
            [
                8751,
                8755
            ],
            [
                8620,
                8621
            ],
            [
                8840,
                8844
            ],
            [
                8796,
                8807
            ],
            [
                8810,
                8822
            ],
            [
                8935,
                8937
            ],
            [
                8937,
                8947
            ],
            [
                8957,
                8987
            ],
            [
                9000,
                9054
            ],
            [
                9060,
                9089
            ],
            [
                9098,
                9100
            ],
            [
                9100,
                9120
            ],
            [
                9120,
                9143
            ],
            [
                9143,
                9168
            ],
            [
                9197,
                9223
            ],
            [
                9262,
                9345
            ],
            [
                9346,
                9367
            ],
            [
                9367,
                9379
            ],
            [
                9528,
                9612
            ],
            [
                9678,
                9679
            ],
            [
                9719,
                9747
            ],
            [
                9747,
                9757
            ],
            [
                9757,
                9806
            ],
            [
                9806,
                9904
            ],
            [
                9923,
                9930
            ],
            [
                9939,
                9946
            ],
            [
                10002,
                10004
            ],
            [
                10004,
                10034
            ],
            [
                10048,
                10122
            ],
            [
                10122,
                10207
            ],
            [
                10207,
                10226
            ],
            [
                10260,
                10267
            ],
            [
                10227,
                10229
            ],
            [
                10272,
                10336
            ],
            [
                10336,
                10361
            ],
            [
                10429,
                10430
            ],
            [
                10362,
                10407
            ],
            [
                10431,
                10445
            ],
            [
                10447,
                10458
            ],
            [
                10458,
                10534
            ],
            [
                10534,
                10567
            ],
            [
                10567,
                10586
            ],
            [
                10586,
                10607
            ],
            [
                10607,
                10642
            ],
            [
                10642,
                10657
            ],
            [
                10657,
                10714
            ],
            [
                10714,
                10732
            ],
            [
                10776,
                10777
            ],
            [
                10733,
                10756
            ],
            [
                10778,
                10815
            ],
            [
                10815,
                10864
            ],
            [
                10864,
                10926
            ],
            [
                10927,
                10994
            ],
            [
                10996,
                11019
            ],
            [
                11021,
                11039
            ],
            [
                11039,
                11099
            ],
            [
                11206,
                11208
            ],
            [
                11208,
                11245
            ],
            [
                11245,
                11280
            ],
            [
                11317,
                11356
            ],
            [
                11356,
                11427
            ],
            [
                11427,
                11429
            ],
            [
                11429,
                11437
            ],
            [
                11442,
                11445
            ],
            [
                11454,
                11467
            ],
            [
                12082,
                12153
            ],
            [
                12153,
                12263
            ],
            [
                12265,
                12269
            ],
            [
                12276,
                12284
            ],
            [
                12306,
                12399
            ],
            [
                12458,
                12470
            ],
            [
                12561,
                12563
            ],
            [
                12563,
                12637
            ],
            [
                12644,
                12646
            ],
            [
                12646,
                12705
            ],
            [
                12860,
                12862
            ],
            [
                12862,
                12887
            ],
            [
                12935,
                12945
            ],
            [
                12950,
                12967
            ],
            [
                12967,
                12989
            ],
            [
                12994,
                13055
            ],
            [
                13062,
                13070
            ],
            [
                13253,
                13255
            ],
            [
                13079,
                13094
            ],
            [
                13108,
                13115
            ],
            [
                13133,
                13206
            ],
            [
                13341,
                13343
            ],
            [
                13535,
                13617
            ],
            [
                13617,
                13625
            ],
            [
                13630,
                13633
            ],
            [
                13642,
                13656
            ],
            [
                13656,
                13668
            ],
            [
                13775,
                13827
            ],
            [
                13827,
                13840
            ],
            [
                13840,
                13908
            ],
            [
                13908,
                13920
            ],
            [
                13924,
                13933
            ],
            [
                13933,
                13953
            ],
            [
                13956,
                13966
            ],
            [
                13966,
                14001
            ],
            [
                14005,
                14015
            ],
            [
                14015,
                14064
            ],
            [
                14064,
                14081
            ],
            [
                14081,
                14105
            ],
            [
                14105,
                14205
            ],
            [
                14205,
                14273
            ],
            [
                14302,
                14304
            ],
            [
                14332,
                14345
            ],
            [
                14345,
                14368
            ],
            [
                14387,
                14423
            ],
            [
                14466,
                14475
            ],
            [
                14486,
                14529
            ],
            [
                14529,
                14580
            ],
            [
                14580,
                14594
            ],
            [
                14594,
                14633
            ],
            [
                14633,
                14672
            ],
            [
                14672,
                14702
            ],
            [
                14702,
                14768
            ],
            [
                14768,
                14790
            ],
            [
                14805,
                14813
            ],
            [
                14835,
                14843
            ],
            [
                14849,
                14867
            ],
            [
                14814,
                14816
            ],
            [
                14897,
                15007
            ],
            [
                15011,
                15015
            ],
            [
                15032,
                15034
            ],
            [
                15054,
                15088
            ],
            [
                15109,
                15163
            ],
            [
                15197,
                15202
            ],
            [
                15184,
                15196
            ],
            [
                15237,
                15239
            ],
            [
                15239,
                15270
            ],
            [
                15270,
                15324
            ],
            [
                15340,
                15342
            ],
            [
                15342,
                15408
            ],
            [
                15408,
                15435
            ],
            [
                15443,
                15459
            ],
            [
                15459,
                15489
            ],
            [
                15489,
                15502
            ],
            [
                15526,
                15528
            ],
            [
                15528,
                15558
            ],
            [
                15646,
                15720
            ],
            [
                15720,
                15787
            ],
            [
                15787,
                15850
            ],
            [
                15852,
                15887
            ],
            [
                15887,
                15951
            ],
            [
                16018,
                16065
            ],
            [
                16065,
                16118
            ],
            [
                16118,
                16141
            ],
            [
                16141,
                16176
            ],
            [
                16216,
                16229
            ],
            [
                16230,
                16236
            ],
            [
                16238,
                16254
            ],
            [
                16274,
                16295
            ],
            [
                16402,
                16454
            ],
            [
                16454,
                16466
            ],
            [
                16466,
                16487
            ],
            [
                16487,
                16544
            ],
            [
                16550,
                16576
            ],
            [
                16593,
                16594
            ],
            [
                16709,
                16734
            ],
            [
                16734,
                16750
            ],
            [
                16804,
                16806
            ],
            [
                16810,
                16824
            ],
            [
                16828,
                16830
            ],
            [
                16890,
                16940
            ],
            [
                17050,
                17118
            ],
            [
                17118,
                17190
            ],
            [
                17215,
                17255
            ],
            [
                17255,
                17282
            ],
            [
                17282,
                17286
            ],
            [
                17301,
                17322
            ],
            [
                17322,
                17414
            ],
            [
                17416,
                17462
            ],
            [
                17502,
                17504
            ],
            [
                17504,
                17517
            ],
            [
                17565,
                17623
            ],
            [
                17624,
                17655
            ],
            [
                17656,
                17726
            ],
            [
                17726,
                17768
            ],
            [
                17782,
                17784
            ],
            [
                17784,
                17844
            ],
            [
                17844,
                17876
            ],
            [
                17876,
                17912
            ],
            [
                17912,
                17937
            ],
            [
                17938,
                17951
            ],
            [
                17962,
                18002
            ],
            [
                18002,
                18019
            ],
            [
                18021,
                18028
            ],
            [
                18073,
                18093
            ],
            [
                18093,
                18121
            ],
            [
                18160,
                18186
            ],
            [
                18190,
                18195
            ],
            [
                18199,
                18201
            ],
            [
                18201,
                18220
            ],
            [
                18259,
                18267
            ],
            [
                18267,
                18303
            ],
            [
                18303,
                18326
            ],
            [
                18326,
                18374
            ],
            [
                18374,
                18428
            ],
            [
                18428,
                18443
            ],
            [
                18445,
                18527
            ],
            [
                18527,
                18555
            ],
            [
                18616,
                18618
            ],
            [
                18618,
                18700
            ],
            [
                18700,
                18721
            ],
            [
                18721,
                18738
            ],
            [
                18738,
                18774
            ],
            [
                18774,
                18807
            ],
            [
                18807,
                18904
            ],
            [
                19085,
                19107
            ],
            [
                19107,
                19145
            ],
            [
                19145,
                19188
            ],
            [
                19192,
                19217
            ],
            [
                19217,
                19270
            ],
            [
                19339,
                19399
            ],
            [
                19399,
                19420
            ],
            [
                19420,
                19470
            ],
            [
                19492,
                19549
            ],
            [
                19549,
                19563
            ],
            [
                19571,
                19586
            ],
            [
                19591,
                19603
            ],
            [
                19603,
                19622
            ],
            [
                19622,
                19649
            ],
            [
                19649,
                19661
            ],
            [
                19665,
                19666
            ],
            [
                19671,
                19674
            ],
            [
                19781,
                19842
            ],
            [
                19842,
                19892
            ],
            [
                19892,
                19925
            ],
            [
                19925,
                19950
            ],
            [
                19950,
                19955
            ],
            [
                19957,
                19976
            ],
            [
                19976,
                19990
            ],
            [
                19990,
                20016
            ],
            [
                20016,
                20050
            ],
            [
                20050,
                20072
            ],
            [
                20095,
                20114
            ],
            [
                20130,
                20134
            ],
            [
                20182,
                20184
            ],
            [
                20184,
                20232
            ],
            [
                20234,
                20237
            ],
            [
                20263,
                20270
            ],
            [
                20232,
                20233
            ],
            [
                20304,
                20306
            ],
            [
                20319,
                20322
            ],
            [
                20311,
                20315
            ],
            [
                20342,
                20344
            ],
            [
                20344,
                20405
            ],
            [
                20405,
                20435
            ],
            [
                20455,
                20464
            ],
            [
                20464,
                20469
            ],
            [
                20479,
                20485
            ],
            [
                20496,
                20619
            ],
            [
                20619,
                20631
            ],
            [
                20655,
                20670
            ],
            [
                20682,
                20734
            ],
            [
                20787,
                20808
            ],
            [
                20809,
                20885
            ],
            [
                20885,
                20963
            ],
            [
                20963,
                20966
            ],
            [
                20981,
                20985
            ],
            [
                20971,
                20977
            ],
            [
                20985,
                21128
            ],
            [
                21141,
                21159
            ],
            [
                21159,
                21189
            ],
            [
                21210,
                21271
            ],
            [
                21281,
                21282
            ],
            [
                21283,
                21325
            ],
            [
                21332,
                21367
            ],
            [
                21367,
                21489
            ],
            [
                21489,
                21514
            ],
            [
                21532,
                21566
            ],
            [
                21566,
                21626
            ],
            [
                21626,
                21677
            ],
            [
                21692,
                21724
            ],
            [
                21724,
                21755
            ],
            [
                21797,
                21798
            ],
            [
                21845,
                21849
            ],
            [
                21799,
                21838
            ],
            [
                21851,
                21932
            ],
            [
                21932,
                21960
            ],
            [
                21960,
                21978
            ],
            [
                21978,
                21982
            ],
            [
                21984,
                22013
            ],
            [
                22013,
                22063
            ],
            [
                22066,
                22097
            ],
            [
                22100,
                22135
            ],
            [
                22135,
                22246
            ],
            [
                22246,
                22267
            ],
            [
                22271,
                22283
            ],
            [
                22283,
                22360
            ],
            [
                22364,
                22382
            ],
            [
                22440,
                22485
            ],
            [
                22485,
                22572
            ],
            [
                22572,
                22621
            ],
            [
                22628,
                22636
            ],
            [
                22664,
                22666
            ],
            [
                22666,
                22679
            ],
            [
                22685,
                22688
            ],
            [
                22689,
                22704
            ],
            [
                22704,
                22724
            ],
            [
                22724,
                22822
            ],
            [
                22823,
                22877
            ],
            [
                22892,
                22900
            ],
            [
                22878,
                22881
            ],
            [
                22900,
                22901
            ],
            [
                22902,
                22935
            ],
            [
                22936,
                23001
            ],
            [
                23001,
                23014
            ],
            [
                23027,
                23055
            ],
            [
                23055,
                23110
            ],
            [
                23110,
                23151
            ],
            [
                23177,
                23178
            ],
            [
                23197,
                23205
            ],
            [
                23152,
                23177
            ],
            [
                23205,
                23207
            ],
            [
                23207,
                23256
            ],
            [
                23338,
                23381
            ],
            [
                23381,
                23390
            ],
            [
                23397,
                23406
            ],
            [
                23415,
                23457
            ],
            [
                23457,
                23480
            ],
            [
                23480,
                23522
            ],
            [
                23522,
                23543
            ],
            [
                23543,
                23550
            ],
            [
                23550,
                23574
            ],
            [
                23574,
                23599
            ],
            [
                23599,
                23624
            ],
            [
                23624,
                23705
            ],
            [
                23705,
                23780
            ],
            [
                23802,
                23808
            ],
            [
                23811,
                23812
            ],
            [
                23901,
                23904
            ],
            [
                23848,
                23894
            ],
            [
                23921,
                23923
            ],
            [
                23941,
                24028
            ],
            [
                24028,
                24128
            ],
            [
                24128,
                24142
            ],
            [
                24142,
                24197
            ],
            [
                24197,
                24239
            ],
            [
                24239,
                24328
            ],
            [
                24328,
                24500
            ],
            [
                24500,
                24512
            ],
            [
                24586,
                24618
            ],
            [
                24631,
                24646
            ]
        ],
        "row_chars": [
            [
                0,
                357
            ],
            [
                357,
                459
            ],
            [
                459,
                500
            ],
            [
                500,
                522
            ],
            [
                522,
                850
            ],
            [
                850,
                911
            ],
            [
                911,
                1220
            ],
            [
                1220,
                1306
            ],
            [
                1306,
                1393
            ],
            [
                1393,
                1474
            ],
            [
                1474,
                1559
            ],
            [
                1559,
                1809
            ],
            [
                1809,
                1858
            ],
            [
                1858,
                1973
            ],
            [
                1973,
                2209
            ],
            [
                2209,
                2344
            ],
            [
                2344,
                2494
            ],
            [
                2494,
                2579
            ],
            [
                2579,
                2720
            ],
            [
                2720,
                2794
            ],
            [
                2794,
                2869
            ],
            [
                2869,
                3071
            ],
            [
                3071,
                3256
            ],
            [
                3256,
                3385
            ],
            [
                3385,
                3584
            ],
            [
                3584,
                3795
            ],
            [
                3795,
                3930
            ],
            [
                3930,
                4031
            ],
            [
                4031,
                4134
            ],
            [
                4134,
                4279
            ],
            [
                4279,
                4414
            ],
            [
                4414,
                4469
            ],
            [
                4469,
                4589
            ],
            [
                4589,
                4656
            ],
            [
                4656,
                4794
            ],
            [
                4794,
                4964
            ],
            [
                4964,
                5148
            ],
            [
                5148,
                5257
            ],
            [
                5257,
                5398
            ],
            [
                5398,
                5601
            ],
            [
                5601,
                5686
            ],
            [
                5686,
                5761
            ],
            [
                5761,
                5909
            ],
            [
                5909,
                5982
            ],
            [
                5982,
                6198
            ],
            [
                6198,
                6345
            ],
            [
                6345,
                6586
            ],
            [
                6586,
                6741
            ],
            [
                6741,
                6759
            ],
            [
                6759,
                6969
            ],
            [
                6969,
                7053
            ],
            [
                7053,
                7351
            ],
            [
                7351,
                7380
            ],
            [
                7380,
                7421
            ],
            [
                7421,
                7454
            ],
            [
                7454,
                7536
            ],
            [
                7536,
                7581
            ],
            [
                7581,
                7834
            ],
            [
                7834,
                7878
            ],
            [
                7878,
                8132
            ],
            [
                8132,
                8160
            ],
            [
                8160,
                8183
            ],
            [
                8183,
                8297
            ],
            [
                8297,
                8428
            ],
            [
                8428,
                8482
            ],
            [
                8482,
                8574
            ],
            [
                8574,
                8937
            ],
            [
                8937,
                9100
            ],
            [
                9100,
                9120
            ],
            [
                9120,
                9143
            ],
            [
                9143,
                9223
            ],
            [
                9223,
                9262
            ],
            [
                9262,
                9346
            ],
            [
                9346,
                9367
            ],
            [
                9367,
                9379
            ],
            [
                9379,
                9528
            ],
            [
                9528,
                9680
            ],
            [
                9680,
                9719
            ],
            [
                9719,
                9747
            ],
            [
                9747,
                9757
            ],
            [
                9757,
                9806
            ],
            [
                9806,
                10004
            ],
            [
                10004,
                10122
            ],
            [
                10122,
                10207
            ],
            [
                10207,
                10336
            ],
            [
                10336,
                10458
            ],
            [
                10458,
                10534
            ],
            [
                10534,
                10567
            ],
            [
                10567,
                10586
            ],
            [
                10586,
                10607
            ],
            [
                10607,
                10642
            ],
            [
                10642,
                10657
            ],
            [
                10657,
                10714
            ],
            [
                10714,
                10815
            ],
            [
                10815,
                10864
            ],
            [
                10864,
                10927
            ],
            [
                10927,
                11039
            ],
            [
                11039,
                11208
            ],
            [
                11208,
                11245
            ],
            [
                11245,
                11356
            ],
            [
                11356,
                11429
            ],
            [
                11429,
                11468
            ],
            [
                11468,
                11477
            ],
            [
                11477,
                11569
            ],
            [
                11569,
                11850
            ],
            [
                11850,
                11946
            ],
            [
                11946,
                12032
            ],
            [
                12032,
                12073
            ],
            [
                12073,
                12082
            ],
            [
                12082,
                12153
            ],
            [
                12153,
                12563
            ],
            [
                12563,
                12646
            ],
            [
                12646,
                12862
            ],
            [
                12862,
                12967
            ],
            [
                12967,
                13343
            ],
            [
                13343,
                13535
            ],
            [
                13535,
                13617
            ],
            [
                13617,
                13656
            ],
            [
                13656,
                13668
            ],
            [
                13668,
                13775
            ],
            [
                13775,
                13827
            ],
            [
                13827,
                13840
            ],
            [
                13840,
                13908
            ],
            [
                13908,
                13920
            ],
            [
                13920,
                13933
            ],
            [
                13933,
                13966
            ],
            [
                13966,
                14015
            ],
            [
                14015,
                14064
            ],
            [
                14064,
                14081
            ],
            [
                14081,
                14105
            ],
            [
                14105,
                14205
            ],
            [
                14205,
                14345
            ],
            [
                14345,
                14529
            ],
            [
                14529,
                14580
            ],
            [
                14580,
                14594
            ],
            [
                14594,
                14633
            ],
            [
                14633,
                14672
            ],
            [
                14672,
                14702
            ],
            [
                14702,
                14768
            ],
            [
                14768,
                15034
            ],
            [
                15034,
                15054
            ],
            [
                15054,
                15239
            ],
            [
                15239,
                15270
            ],
            [
                15270,
                15342
            ],
            [
                15342,
                15408
            ],
            [
                15408,
                15459
            ],
            [
                15459,
                15489
            ],
            [
                15489,
                15528
            ],
            [
                15528,
                15720
            ],
            [
                15720,
                15787
            ],
            [
                15787,
                15887
            ],
            [
                15887,
                16065
            ],
            [
                16065,
                16118
            ],
            [
                16118,
                16141
            ],
            [
                16141,
                16296
            ],
            [
                16296,
                16402
            ],
            [
                16402,
                16454
            ],
            [
                16454,
                16466
            ],
            [
                16466,
                16487
            ],
            [
                16487,
                16595
            ],
            [
                16595,
                16709
            ],
            [
                16709,
                16734
            ],
            [
                16734,
                16806
            ],
            [
                16806,
                16830
            ],
            [
                16830,
                16890
            ],
            [
                16890,
                16940
            ],
            [
                16940,
                17050
            ],
            [
                17050,
                17118
            ],
            [
                17118,
                17192
            ],
            [
                17192,
                17215
            ],
            [
                17215,
                17255
            ],
            [
                17255,
                17282
            ],
            [
                17282,
                17322
            ],
            [
                17322,
                17504
            ],
            [
                17504,
                17656
            ],
            [
                17656,
                17726
            ],
            [
                17726,
                17784
            ],
            [
                17784,
                17844
            ],
            [
                17844,
                17876
            ],
            [
                17876,
                17912
            ],
            [
                17912,
                18002
            ],
            [
                18002,
                18093
            ],
            [
                18093,
                18190
            ],
            [
                18190,
                18201
            ],
            [
                18201,
                18221
            ],
            [
                18221,
                18259
            ],
            [
                18259,
                18267
            ],
            [
                18267,
                18303
            ],
            [
                18303,
                18326
            ],
            [
                18326,
                18374
            ],
            [
                18374,
                18428
            ],
            [
                18428,
                18445
            ],
            [
                18445,
                18527
            ],
            [
                18527,
                18618
            ],
            [
                18618,
                18700
            ],
            [
                18700,
                18721
            ],
            [
                18721,
                18738
            ],
            [
                18738,
                18774
            ],
            [
                18774,
                18807
            ],
            [
                18807,
                18905
            ],
            [
                18905,
                19036
            ],
            [
                19036,
                19085
            ],
            [
                19085,
                19107
            ],
            [
                19107,
                19145
            ],
            [
                19145,
                19192
            ],
            [
                19192,
                19217
            ],
            [
                19217,
                19270
            ],
            [
                19270,
                19339
            ],
            [
                19339,
                19399
            ],
            [
                19399,
                19420
            ],
            [
                19420,
                19549
            ],
            [
                19549,
                19603
            ],
            [
                19603,
                19622
            ],
            [
                19622,
                19649
            ],
            [
                19649,
                19674
            ],
            [
                19674,
                19781
            ],
            [
                19781,
                19842
            ],
            [
                19842,
                19892
            ],
            [
                19892,
                19925
            ],
            [
                19925,
                19950
            ],
            [
                19950,
                19976
            ],
            [
                19976,
                19990
            ],
            [
                19990,
                20016
            ],
            [
                20016,
                20050
            ],
            [
                20050,
                20184
            ],
            [
                20184,
                20344
            ],
            [
                20344,
                20405
            ],
            [
                20405,
                20464
            ],
            [
                20464,
                20486
            ],
            [
                20486,
                20496
            ],
            [
                20496,
                20619
            ],
            [
                20619,
                20809
            ],
            [
                20809,
                20885
            ],
            [
                20885,
                20963
            ],
            [
                20963,
                21159
            ],
            [
                21159,
                21283
            ],
            [
                21283,
                21367
            ],
            [
                21367,
                21489
            ],
            [
                21489,
                21566
            ],
            [
                21566,
                21626
            ],
            [
                21626,
                21724
            ],
            [
                21724,
                21799
            ],
            [
                21799,
                21851
            ],
            [
                21851,
                21932
            ],
            [
                21932,
                21960
            ],
            [
                21960,
                21978
            ],
            [
                21978,
                22013
            ],
            [
                22013,
                22135
            ],
            [
                22135,
                22246
            ],
            [
                22246,
                22283
            ],
            [
                22283,
                22485
            ],
            [
                22485,
                22572
            ],
            [
                22572,
                22666
            ],
            [
                22666,
                22724
            ],
            [
                22724,
                22823
            ],
            [
                22823,
                22902
            ],
            [
                22902,
                22936
            ],
            [
                22936,
                23001
            ],
            [
                23001,
                23055
            ],
            [
                23055,
                23110
            ],
            [
                23110,
                23207
            ],
            [
                23207,
                23258
            ],
            [
                23258,
                23338
            ],
            [
                23338,
                23381
            ],
            [
                23381,
                23457
            ],
            [
                23457,
                23480
            ],
            [
                23480,
                23522
            ],
            [
                23522,
                23543
            ],
            [
                23543,
                23550
            ],
            [
                23550,
                23574
            ],
            [
                23574,
                23599
            ],
            [
                23599,
                23624
            ],
            [
                23624,
                23705
            ],
            [
                23705,
                23813
            ],
            [
                23813,
                23848
            ],
            [
                23848,
                23941
            ],
            [
                23941,
                24028
            ],
            [
                24028,
                24128
            ],
            [
                24128,
                24142
            ],
            [
                24142,
                24197
            ],
            [
                24197,
                24239
            ],
            [
                24239,
                24328
            ],
            [
                24328,
                24500
            ],
            [
                24500,
                24646
            ]
        ]
    },
    "abridged": {
        "text": "Burgo Fitzgerald remained for a minute or two leaning against the wall at the bottom of the staircase; and some thoughts that were almost solemn passed across his mind.\nThis thing that he was about to attempt - was it good, and would it be good for Glencora? What would her future be if she consented to go with him, and to leave her husband? Of his own future he thought not at all. He had never done so. Even when he had first found himself attracted by her wealth, it simply prompted him, as he might have been prompted to play for a high stake at a gaming-table. But now he did think a little of her. Would she be happy, simply because he loved her, when all regarded her as degraded and dishonoured; when society should be closed against her?\nAnd, under such circumstances, would he continue to love her? Did he not know himself to be the most inconstant and untrustworthy of men? He asked himself these questions with something of true feeling, and almost persuaded himself that he had better wander forth into the streets. If he could drink himself out of the world, it might be an end of things.\nBut then he remembered his aunt's two hundred pounds, and a certain idea of honour told him that he was bound to do that for which the money had been given. As to telling his aunt that he had changed his mind, and refunding the money - that was impossible! He could not give back two hundred pounds. So he gathered himself up, stretched his hands over his head, uttered a deep sigh, and took himself upstairs.\nHe looked in at his aunt's room.\n\"Well, Burgo,\" she said, with her sweetest smile, \"have you been dancing?\" He turned away, muttering something about a cold-blooded Jezebel. But she did not hear, and smiled as he went.\nBurgo made his way first into the front room and then into the larger room where the dancing was, and there he saw Lady Glencora standing up in a quadrille with the Marquis of Hartletop. Lady Glencora seemed to enjoy neither the dancing nor the society of her partner. She was simply standing up to dance because it was the correct thing to do. Burgo watched her, and at last she became aware of his presence. It made no change in her, except that she became even less animated than before. She would not seem to see him.\n\"I will go up to her at once, and ask her to waltz,\" Burgo said to himself. Then the music ceased, and Lord Hartletop took away his partner on his arm into another room. Burgo followed them. The crowd was so great that he could not get near them, but he knew which way they were going.\nFive minutes later he again saw her, seated on a cane bench in the gallery, with an old woman standing close to her, talking to her. It was Mrs. Marsham, cautioning her against some petty imprudence, and Lady Glencora was curtly telling that lady that she needed no such advice. Lord Hartletop had left her, feeling that he had done his duty for the night.\nBurgo knew nothing of Mrs. Marsham, and was quite unaware that she had any connection with Mr. Palliser. So he made his way up to Lady Glencora through the crowd, and muttering some inaudible word, offered her his hand.\n\"That will do very well, thank you, Mrs. Marsham,\" Lady Glencora said. \"Pray, do not trouble yourself,\" and then she gave her hand to Fitzgerald.\nMrs. Marsham knew who he was, and all his history. Though Mr. Palliser had never mentioned his name to her, she was well aware that her duty as a duenna meant that she should keep a doubly wary eye upon him.\nAnd there he was, leaning over them, taking the hand of Mr. Palliser's wife! How Lady Glencora might have behaved at this moment if Mrs. Marsham not been there, it is pointless to guess; but under Mrs. Marsham's eye, all her resolution was in Burgo's favour. She looked at him softly and kindly, and though she said nothing, her face seemed to show pleasure.\n\"Will you waltz?\" said Burgo, asking as though it were a commonplace event.\n\"I don't think Lady Glencora will waltz tonight,\" said Mrs. Marsham, very stiffly. She certainly did not know her business as a duenna, or else she would have been aware that this answer would drive her friend's wife into open hostility.\n\"And why not, Mrs. Marsham?\" said Lady Glencora, rising from her seat. \"Why shouldn't I waltz tonight? I rather think I shall, especially as Mr. Fitzgerald waltzes very well.\" She put her hand upon Burgo's arm.\nMrs. Marsham laid a hand on Lady Glencora's left shoulder, looking into her face with all the severity of caution of which she was capable. Lady Glencora shook her off angrily. Whether she would put her fate into Burgo's hands, she had not yet decided; but she was very sure that Mrs. Marsham should not restrain her.\nWhat could Mrs. Marsham do? Mr. Palliser was gone home. Some whispers had come to her that Fitzgerald still dared to love Lady Glencora. Mrs. Marsham had never believed that Mr. Palliser's wife would really be false to her vows. It was not in fear of any such catastrophe that she had taken on the duty of duenna: it was merely to mould her into a form appropriate for the wife of Mr. Palliser. It had not occurred to her that she might need to guard Mr. Palliser from positive dishonour; but now she hardly knew what to think. What should she do? To whom should she go? And then she saw Mr. Bott at the top of the staircase.\nIn the meantime Lady Glencora went off towards the dancers, leaning on Burgo's arm.\n\"Who is that woman?\" said Burgo. His voice in her ears sounded as it used to sound when their intimacy had been close.\n\"Oh, such an odious woman!\" she said. \"Her name is Mrs. Marsham; she is my bte noire.\" And then they were actually dancing, whirling round the room together, before a word had been said about Burgo's purpose.\nBurgo waltzed excellently, and before her marriage, Lady Glencora had been passionately fond of dancing. She seemed to give herself up to it now as though the old days had come back to her. Lady Monk, creeping from her den to the dancing-room, looked in on them, and then crept back again. Mrs. Marsham and Mr. Bott, standing together just inside the other door, looked on also - in horror.\n\"He shouldn't have gone away and left her,\" said Mr. Bott, almost hoarsely.\n\"But who could have thought it?\" said Mrs. Marsham. \"I'm sure I didn't.\"\n\"I suppose you'd better tell him?\" said Mr. Bott.\n\"But I don't know where to find him,\" said Mrs. Marsham.\n\"I didn't mean now, at once,\" said Mr. Bott. \"Do you think it is as bad as that?\"\n\"I don't know what to think,\" said Mrs. Marsham.\nThe waltzers went on till they were stopped by want of breath.\n\"I am so much out of practice,\" said Lady Glencora; \"I didn't think I should have been able - to dance at all.\" Then she put up her face, and slightly opened her mouth, and breathed deep.\n\"You'll take another turn,\" said he.\n\"Presently,\" said she, beginning to wonder whether Mrs. Marsham was watching her. Then there was a little pause, after which he spoke in an altered voice, knowing that he must use this opportunity.\n\"Does it remind you of old days?\"\nThe words roused her from her sleep at once, and dissipated her dream. The facts all rushed upon her in an instant; the letter in her pocket; the request which she had made to Alice so that she might be guarded from this danger; the words which her husband had spoken to her in the morning, and her anger about Mrs. Marsham! It all came upon her now at the first word of tenderness which Burgo spoke.\nIt has often been said of woman that she who doubts is lost. But they who have said so have known little of women. Women doubt every day, and many solve their doubts at last on the right side, driven to do so by fear, or conscience, but mostly by that half-unconscious knowledge of what is fitting, useful, and best under the circumstances. Lady Glencora was doubting sorely; but, though doubting, she was not as yet lost.\n\"Does it remind you of old days?\" said Burgo.\n\"You must not talk of that,\" she said, very softly.\n\"May I not?\" And now his tongue was unloosed, so that he began to speak quickly. \"May I not? Why not? They were happy days - so happy! Were not you happy when you thought Ah, dear! I suppose it is best not even to think of them?\"\n\"Much the best.\"\n\"Only it is impossible. I wish I knew the inside of your heart, Cora, so that I could see what it is that you really wish.\"\nIn the old days he had always called her Cora, and now the name came as no surprise. They were standing back, almost in a corner, and Burgo knew his words were audible to none but her whom he addressed.\n\"You should not have come to me at all,\" she said.\n\"And why not? Who has a better right to come to you? Who has ever loved you as I have done? Cora, did you get my letter?\"\n\"Come and dance,\" she said; \"I see a pair of eyes looking at us.\" The pair of eyes which she saw were Mr. Bott's. He was standing alone in the doorway, every now and then raising his heels from the ground, so that he might look down upon the sinners from above. Mrs. Marsham had left him, and had gone in Lady Glencora's own carriage to Park Lane, in order to look there for Mr. Palliser.\n\"Won't it be making mischief?\" Mrs. Marsham had said when Mr. Bott had suggested this.\n\"There'll be worse mischief if you don't,\" Mr. Bott had answered. \"He can come back, and then do as he likes. I'll keep my eyes upon them.\" And so he did.\nAgain they went round the room as though they were enjoying themselves thoroughly, and in all innocence. But there were others besides Mr. Bott who looked on and wondered. The Duchess of St. Bungay saw it, and shook her head sorrowing, for the Duchess was good at heart. Mrs. Conway Sparkes saw it, and drank it down with keen appetite; for Mrs. Conway Sparkes was not good at heart. Lady Hartletop saw it, and just raised her eyebrows. It was nothing to her. She liked to know what was going on; but, as for her heart, what she had was neither good nor bad.\nLady Monk saw it, and a frown gathered on her brow. \"The fool!\" she said to herself. She knew that Burgo would not help his success by drawing the eyes of all her guests.\n\"Did you get my letter?\" Burgo said again. Glencora did not answer. But, of course, he knew that she had received it. \"Let us go out upon the stairs,\" he said, \"for I must speak to you. Oh, if you could know what I suffered when you did not come to Monkshade!\"\n\"I wish I had not come here,\" she said.\n\"Because you have seen me? That is not kind of you.\"\nThey were now making their way slowly down the stairs, in the crowd, towards the supper-room; for all the world was now intent on food and drink. Lady Glencora glanced upwards, as she stood for a moment wedged upon the stairs, and her eyes met those of Mr. Bott.\n\"A man that can treat me like that deserves that I should leave him.\" That was the thought that crossed her mind.\n\"I'll get you some champagne with water in it,\" said Burgo. \"I know that is what you like.\"\n\"Do not get me anything,\" she said. They had now got into the supper-room, and had escaped Mr. Bott's eyes for the moment. \"Mr. Fitzgerald,\" - and now she whispered - \"do what I ask you. For the sake of the old days which can never come again-\"\n\"By G--! they can,\" said he.\n\"Never. But you can still do me a kindness. Go away, and leave me. Go to the sideboard, and then do not come back. You are doing me an injury while you remain with me.\"\n\"Cora,\" he said.\nBut she had now recovered her presence of mind, and understood what was going on. She was no longer in a dream. \"I will not have it, Mr. Fitzgerald,\" she answered, speaking almost passionately. \"I will not have it. Do as I bid you. Go and leave me, and do not return. I tell you that we are watched.\" This was still true, for Mr. Bott had now again got his eyes on them, round the supper-room door.\n\"Who is watching us?\" said Burgo; \"and what does it matter? If you are minded to do as I have asked you-\"\n\"But I am not so minded. Do you not know that you insult me by proposing it?\"\n\"If you wish to be my wife instead of his, it is no insult.\"\n\"How can I be that?\" Her face was not turned to him, and her words were in the lowest whisper, but, nevertheless, he heard them.\n\"Come with me, abroad, and you shall be my wife. You got my letter? Do what I asked you, then. Come with me - tonight.\"\n\"Mr. Fitzgerald,\" she said, \"I asked you to go and leave me. If you do not do so, I must get up and leave you. It will be much more difficult.\"\n\"And is that to be all?\"\n\"All; at any rate, now.\" Oh, Glencora! how could you be so weak? Why did you add that word, \"now\"? In truth, she added it simply feeling that it was the best way to make him obey.\n\"I will not go,\" he said, looking at her sternly and earnestly, utterly indifferent to any watching eyes. \"I will not go till you tell me that you will see me again.\"\n\"I will,\" she said in that low whisper.\n\"When - when?\"\nLooking up again towards the doorway, in fear of Mr. Bott's eyes, she saw the face of Mr. Palliser as he entered the room. Mr. Bott had tried to clutch his arm; but Mr. Palliser had shaken him off, apparently without noticing him.\nLady Glencora, when she saw her husband, immediately recovered her courage. She would not cower before him, or show herself ashamed of what she had done. For that matter, if he pressed her on the subject, she could bring herself to tell him that she loved Burgo Fitzgerald much more easily than she could whisper it to Burgo himself. Mr. Bott's eyes were odious to her; but her husband's glance she could meet without quailing.\n\"Here is Mr. Palliser,\" said she, speaking in her ordinary clear-toned voice. Burgo immediately rose from his seat with a start, and turned quickly towards the door; but Lady Glencora kept her chair.\nMr. Palliser made his way through the crowd up to his wife. He, too, kept his countenance without betraying his secret. There was neither anger nor dismay in his face, nor untoward hurry in his movement. Burgo stood aside as he came up.\nLady Glencora said, \"I thought you were gone home hours ago.\"\n\"I did go home,\" he answered, \"but I thought I might as well come back for you.\"\n\"What a model of a husband! Well; I am ready. Only what shall we do about Jane? Mr. Fitzgerald, I left a scarf in your aunt's room - a little black and yellow scarf - would you mind getting it for me?\"\n\"I will fetch it,\" said Mr. Palliser; \"and I will tell your cousin that the carriage shall come back for her.\"\n\"If you will allow me-\" said Burgo.\n\"I will do it,\" said Mr. Palliser; and away he went, making his slow progress through the crowd, leaving Mr. Bott still watching at the door.\nLady Glencora resolved that she would say nothing to Burgo while her husband was gone. There was a touch of chivalry in his leaving them together. He might have ordered her to leave the scarf behind, and come at once. She had seen, moreover, that he had not spoken to Mr. Bott, and was thankful to him also for that.\nBurgo also seemed to have become aware that his chance was over, for the moment.\n\"I will say good-night,\" he said.\n\"Good-night, Mr. Fitzgerald,\" she answered, giving him her hand. He pressed it, and then turned and went. When Mr. Palliser came back he was no more to be seen.\nLady Glencora was at the dining-room door, near Mr. Bott, when her husband returned. Mr. Bott had spoken to her, but she made no reply\n\"And what shall we do about Mrs. Marsham?\" she said, out loud, as she put her hand on her husband's arm. \"I had forgotten her.\"\n\"Mrs. Marsham has gone home,\" he replied.\n\"Have you seen her?\"\n\"Yes.\"\n\"When did you see her?\"\n\"She came to Park Lane.\"\n\"What made her do that?\"\nThese questions were asked and answered as he was putting her into the carriage. She got in just as she asked the last, and he, as he took his seat, did not answer.\nBut she repeated, \"What made Mrs. Marsham go to you at Park Lane?\" Mr. Palliser sat silent, not having made up his mind what he would say on the subject. \"I suppose she went,\" continued Lady Glencora, \"to tell you that I was dancing with Mr. Fitzgerald. Was that it?\"\n\"I think, Glencora, we had better not discuss it now.\"\n\"I don't mean to discuss it now, or ever. If you did not wish me to see Mr. Fitzgerald you should not have sent me to Lady Monk's. But, Plantagenet, I hope you will forgive me if I say that no consideration shall induce me to receive again as a guest, in my own house, either Mrs. Marsham or Mr. Bott.\"\nMr. Palliser did not reply. Thus the evening of Lady Monk's party came to an end.",
        "paragraph_chars": [
            [
                0,
                169
            ],
            [
                169,
                748
            ],
            [
                748,
                1104
            ],
            [
                1104,
                1514
            ],
            [
                1514,
                1547
            ],
            [
                1547,
                1733
            ],
            [
                1733,
                2255
            ],
            [
                2255,
                2541
            ],
            [
                2541,
                2898
            ],
            [
                2898,
                3118
            ],
            [
                3118,
                3264
            ],
            [
                3264,
                3472
            ],
            [
                3472,
                3831
            ],
            [
                3831,
                3907
            ],
            [
                3907,
                4145
            ],
            [
                4145,
                4356
            ],
            [
                4356,
                4674
            ],
            [
                4674,
                5300
            ],
            [
                5300,
                5384
            ],
            [
                5384,
                5503
            ],
            [
                5503,
                5712
            ],
            [
                5712,
                6103
            ],
            [
                6103,
                6179
            ],
            [
                6179,
                6252
            ],
            [
                6252,
                6302
            ],
            [
                6302,
                6359
            ],
            [
                6359,
                6441
            ],
            [
                6441,
                6490
            ],
            [
                6490,
                6553
            ],
            [
                6553,
                6741
            ],
            [
                6741,
                6778
            ],
            [
                6778,
                6976
            ],
            [
                6976,
                7010
            ],
            [
                7010,
                7411
            ],
            [
                7411,
                7834
            ],
            [
                7834,
                7880
            ],
            [
                7880,
                7932
            ],
            [
                7932,
                8162
            ],
            [
                8162,
                8179
            ],
            [
                8179,
                8303
            ],
            [
                8303,
                8506
            ],
            [
                8506,
                8557
            ],
            [
                8557,
                8679
            ],
            [
                8679,
                9068
            ],
            [
                9068,
                9155
            ],
            [
                9155,
                9310
            ],
            [
                9310,
                9869
            ],
            [
                9869,
                10040
            ],
            [
                10040,
                10301
            ],
            [
                10301,
                10341
            ],
            [
                10341,
                10394
            ],
            [
                10394,
                10657
            ],
            [
                10657,
                10771
            ],
            [
                10771,
                10863
            ],
            [
                10863,
                11108
            ],
            [
                11108,
                11137
            ],
            [
                11137,
                11306
            ],
            [
                11306,
                11323
            ],
            [
                11323,
                11722
            ],
            [
                11722,
                11828
            ],
            [
                11828,
                11906
            ],
            [
                11906,
                11967
            ],
            [
                11967,
                12096
            ],
            [
                12096,
                12216
            ],
            [
                12216,
                12360
            ],
            [
                12360,
                12385
            ],
            [
                12385,
                12565
            ],
            [
                12565,
                12732
            ],
            [
                12732,
                12772
            ],
            [
                12772,
                12787
            ],
            [
                12787,
                13018
            ],
            [
                13018,
                13446
            ],
            [
                13446,
                13646
            ],
            [
                13646,
                13883
            ],
            [
                13883,
                13945
            ],
            [
                13945,
                14026
            ],
            [
                14026,
                14228
            ],
            [
                14228,
                14339
            ],
            [
                14339,
                14375
            ],
            [
                14375,
                14517
            ],
            [
                14517,
                14834
            ],
            [
                14834,
                14915
            ],
            [
                14915,
                14949
            ],
            [
                14949,
                15110
            ],
            [
                15110,
                15245
            ],
            [
                15245,
                15373
            ],
            [
                15373,
                15415
            ],
            [
                15415,
                15436
            ],
            [
                15436,
                15443
            ],
            [
                15443,
                15467
            ],
            [
                15467,
                15492
            ],
            [
                15492,
                15517
            ],
            [
                15517,
                15682
            ],
            [
                15682,
                15950
            ],
            [
                15950,
                16005
            ],
            [
                16005,
                16308
            ],
            [
                16308,
                16389
            ]
        ],
        "segment_chars": [
            [
                0,
                169
            ],
            [
                169,
                259
            ],
            [
                259,
                343
            ],
            [
                343,
                384
            ],
            [
                384,
                406
            ],
            [
                406,
                567
            ],
            [
                567,
                605
            ],
            [
                605,
                748
            ],
            [
                748,
                810
            ],
            [
                810,
                886
            ],
            [
                886,
                1030
            ],
            [
                1030,
                1104
            ],
            [
                1104,
                1261
            ],
            [
                1261,
                1361
            ],
            [
                1361,
                1404
            ],
            [
                1404,
                1514
            ],
            [
                1514,
                1547
            ],
            [
                1547,
                1622
            ],
            [
                1622,
                1688
            ],
            [
                1688,
                1733
            ],
            [
                1733,
                1920
            ],
            [
                1920,
                2002
            ],
            [
                2002,
                2078
            ],
            [
                2078,
                2143
            ],
            [
                2143,
                2224
            ],
            [
                2224,
                2255
            ],
            [
                2255,
                2331
            ],
            [
                2331,
                2425
            ],
            [
                2425,
                2446
            ],
            [
                2446,
                2541
            ],
            [
                2541,
                2674
            ],
            [
                2674,
                2820
            ],
            [
                2820,
                2898
            ],
            [
                2898,
                3003
            ],
            [
                3003,
                3118
            ],
            [
                3118,
                3189
            ],
            [
                3189,
                3264
            ],
            [
                3264,
                3315
            ],
            [
                3315,
                3472
            ],
            [
                3472,
                3549
            ],
            [
                3549,
                3731
            ],
            [
                3731,
                3831
            ],
            [
                3831,
                3849
            ],
            [
                3849,
                3907
            ],
            [
                3907,
                3990
            ],
            [
                3990,
                4145
            ],
            [
                4145,
                4174
            ],
            [
                4174,
                4216
            ],
            [
                4216,
                4248
            ],
            [
                4248,
                4321
            ],
            [
                4321,
                4356
            ],
            [
                4356,
                4496
            ],
            [
                4496,
                4533
            ],
            [
                4533,
                4674
            ],
            [
                4674,
                4702
            ],
            [
                4702,
                4730
            ],
            [
                4730,
                4811
            ],
            [
                4811,
                4903
            ],
            [
                4903,
                5069
            ],
            [
                5069,
                5202
            ],
            [
                5202,
                5222
            ],
            [
                5222,
                5245
            ],
            [
                5245,
                5300
            ],
            [
                5300,
                5384
            ],
            [
                5384,
                5405
            ],
            [
                5405,
                5417
            ],
            [
                5417,
                5503
            ],
            [
                5503,
                5531
            ],
            [
                5531,
                5541
            ],
            [
                5541,
                5590
            ],
            [
                5590,
                5712
            ],
            [
                5712,
                5817
            ],
            [
                5817,
                5902
            ],
            [
                5902,
                6002
            ],
            [
                6002,
                6103
            ],
            [
                6103,
                6179
            ],
            [
                6179,
                6212
            ],
            [
                6212,
                6231
            ],
            [
                6231,
                6252
            ],
            [
                6252,
                6287
            ],
            [
                6287,
                6302
            ],
            [
                6302,
                6359
            ],
            [
                6359,
                6404
            ],
            [
                6404,
                6441
            ],
            [
                6441,
                6490
            ],
            [
                6490,
                6553
            ],
            [
                6553,
                6665
            ],
            [
                6665,
                6741
            ],
            [
                6741,
                6778
            ],
            [
                6778,
                6860
            ],
            [
                6860,
                6976
            ],
            [
                6976,
                7010
            ],
            [
                7010,
                7081
            ],
            [
                7081,
                7335
            ],
            [
                7335,
                7411
            ],
            [
                7411,
                7472
            ],
            [
                7472,
                7526
            ],
            [
                7526,
                7752
            ],
            [
                7752,
                7834
            ],
            [
                7834,
                7868
            ],
            [
                7868,
                7880
            ],
            [
                7880,
                7932
            ],
            [
                7932,
                7945
            ],
            [
                7945,
                8013
            ],
            [
                8013,
                8025
            ],
            [
                8025,
                8034
            ],
            [
                8034,
                8067
            ],
            [
                8067,
                8113
            ],
            [
                8113,
                8162
            ],
            [
                8162,
                8179
            ],
            [
                8179,
                8203
            ],
            [
                8203,
                8303
            ],
            [
                8303,
                8388
            ],
            [
                8388,
                8506
            ],
            [
                8506,
                8557
            ],
            [
                8557,
                8571
            ],
            [
                8571,
                8610
            ],
            [
                8610,
                8649
            ],
            [
                8649,
                8679
            ],
            [
                8679,
                8745
            ],
            [
                8745,
                8793
            ],
            [
                8793,
                8941
            ],
            [
                8941,
                9068
            ],
            [
                9068,
                9099
            ],
            [
                9099,
                9155
            ],
            [
                9155,
                9221
            ],
            [
                9221,
                9265
            ],
            [
                9265,
                9295
            ],
            [
                9295,
                9310
            ],
            [
                9310,
                9415
            ],
            [
                9415,
                9482
            ],
            [
                9482,
                9581
            ],
            [
                9581,
                9694
            ],
            [
                9694,
                9747
            ],
            [
                9747,
                9770
            ],
            [
                9770,
                9869
            ],
            [
                9869,
                9921
            ],
            [
                9921,
                9933
            ],
            [
                9933,
                9954
            ],
            [
                9954,
                10040
            ],
            [
                10040,
                10065
            ],
            [
                10065,
                10083
            ],
            [
                10083,
                10108
            ],
            [
                10108,
                10158
            ],
            [
                10158,
                10226
            ],
            [
                10226,
                10301
            ],
            [
                10301,
                10341
            ],
            [
                10341,
                10368
            ],
            [
                10368,
                10394
            ],
            [
                10394,
                10540
            ],
            [
                10540,
                10657
            ],
            [
                10657,
                10727
            ],
            [
                10727,
                10771
            ],
            [
                10771,
                10831
            ],
            [
                10831,
                10863
            ],
            [
                10863,
                10899
            ],
            [
                10899,
                10986
            ],
            [
                10986,
                11050
            ],
            [
                11050,
                11108
            ],
            [
                11108,
                11117
            ],
            [
                11117,
                11137
            ],
            [
                11137,
                11145
            ],
            [
                11145,
                11181
            ],
            [
                11181,
                11204
            ],
            [
                11204,
                11252
            ],
            [
                11252,
                11306
            ],
            [
                11306,
                11323
            ],
            [
                11323,
                11405
            ],
            [
                11405,
                11435
            ],
            [
                11435,
                11517
            ],
            [
                11517,
                11538
            ],
            [
                11538,
                11555
            ],
            [
                11555,
                11591
            ],
            [
                11591,
                11624
            ],
            [
                11624,
                11722
            ],
            [
                11722,
                11744
            ],
            [
                11744,
                11782
            ],
            [
                11782,
                11828
            ],
            [
                11828,
                11853
            ],
            [
                11853,
                11906
            ],
            [
                11906,
                11967
            ],
            [
                11967,
                11988
            ],
            [
                11988,
                12096
            ],
            [
                12096,
                12145
            ],
            [
                12145,
                12164
            ],
            [
                12164,
                12191
            ],
            [
                12191,
                12216
            ],
            [
                12216,
                12277
            ],
            [
                12277,
                12327
            ],
            [
                12327,
                12360
            ],
            [
                12360,
                12385
            ],
            [
                12385,
                12410
            ],
            [
                12410,
                12424
            ],
            [
                12424,
                12450
            ],
            [
                12450,
                12484
            ],
            [
                12484,
                12565
            ],
            [
                12565,
                12671
            ],
            [
                12671,
                12732
            ],
            [
                12732,
                12772
            ],
            [
                12772,
                12787
            ],
            [
                12787,
                12910
            ],
            [
                12910,
                13018
            ],
            [
                13018,
                13094
            ],
            [
                13094,
                13172
            ],
            [
                13172,
                13352
            ],
            [
                13352,
                13446
            ],
            [
                13446,
                13524
            ],
            [
                13524,
                13646
            ],
            [
                13646,
                13706
            ],
            [
                13706,
                13766
            ],
            [
                13766,
                13850
            ],
            [
                13850,
                13883
            ],
            [
                13883,
                13945
            ],
            [
                13945,
                14026
            ],
            [
                14026,
                14054
            ],
            [
                14054,
                14072
            ],
            [
                14072,
                14106
            ],
            [
                14106,
                14228
            ],
            [
                14228,
                14339
            ],
            [
                14339,
                14375
            ],
            [
                14375,
                14517
            ],
            [
                14517,
                14604
            ],
            [
                14604,
                14664
            ],
            [
                14664,
                14735
            ],
            [
                14735,
                14834
            ],
            [
                14834,
                14915
            ],
            [
                14915,
                14949
            ],
            [
                14949,
                15014
            ],
            [
                15014,
                15055
            ],
            [
                15055,
                15110
            ],
            [
                15110,
                15195
            ],
            [
                15195,
                15245
            ],
            [
                15245,
                15288
            ],
            [
                15288,
                15350
            ],
            [
                15350,
                15373
            ],
            [
                15373,
                15415
            ],
            [
                15415,
                15436
            ],
            [
                15436,
                15443
            ],
            [
                15443,
                15467
            ],
            [
                15467,
                15492
            ],
            [
                15492,
                15517
            ],
            [
                15517,
                15598
            ],
            [
                15598,
                15682
            ],
            [
                15682,
                15749
            ],
            [
                15749,
                15836
            ],
            [
                15836,
                15936
            ],
            [
                15936,
                15950
            ],
            [
                15950,
                16005
            ],
            [
                16005,
                16047
            ],
            [
                16047,
                16136
            ],
            [
                16136,
                16308
            ],
            [
                16308,
                16336
            ],
            [
                16336,
                16389
            ]
        ],
        "overlap_chars": [
            [
                0,
                53
            ],
            [
                54,
                65
            ],
            [
                66,
                106
            ],
            [
                107,
                167
            ],
            [
                169,
                200
            ],
            [
                201,
                208
            ],
            [
                209,
                210
            ],
            [
                211,
                217
            ],
            [
                218,
                222
            ],
            [
                222,
                248
            ],
            [
                257,
                259
            ],
            [
                259,
                269
            ],
            [
                270,
                280
            ],
            [
                281,
                283
            ],
            [
                284,
                300
            ],
            [
                301,
                323
            ],
            [
                330,
                343
            ],
            [
                343,
                384
            ],
            [
                384,
                406
            ],
            [
                406,
                455
            ],
            [
                456,
                467
            ],
            [
                471,
                567
            ],
            [
                567,
                574
            ],
            [
                575,
                605
            ],
            [
                605,
                662
            ],
            [
                672,
                678
            ],
            [
                679,
                746
            ],
            [
                746,
                747
            ],
            [
                748,
                778
            ],
            [
                779,
                784
            ],
            [
                785,
                787
            ],
            [
                788,
                810
            ],
            [
                810,
                859
            ],
            [
                860,
                863
            ],
            [
                878,
                884
            ],
            [
                884,
                886
            ],
            [
                886,
                888
            ],
            [
                895,
                902
            ],
            [
                903,
                949
            ],
            [
                949,
                998
            ],
            [
                999,
                1011
            ],
            [
                1012,
                1030
            ],
            [
                1030,
                1102
            ],
            [
                1102,
                1104
            ],
            [
                1104,
                1112
            ],
            [
                1113,
                1115
            ],
            [
                1127,
                1156
            ],
            [
                1156,
                1259
            ],
            [
                1259,
                1261
            ],
            [
                1261,
                1317
            ],
            [
                1318,
                1337
            ],
            [
                1340,
                1348
            ],
            [
                1359,
                1361
            ],
            [
                1370,
                1373
            ],
            [
                1374,
                1402
            ],
            [
                1402,
                1404
            ],
            [
                1404,
                1475
            ],
            [
                1481,
                1485
            ],
            [
                1485,
                1503
            ],
            [
                1512,
                1514
            ],
            [
                1514,
                1545
            ],
            [
                1545,
                1546
            ],
            [
                1547,
                1622
            ],
            [
                1622,
                1636
            ],
            [
                1636,
                1657
            ],
            [
                1658,
                1686
            ],
            [
                1686,
                1688
            ],
            [
                1688,
                1708
            ],
            [
                1708,
                1720
            ],
            [
                1721,
                1731
            ],
            [
                1731,
                1733
            ],
            [
                1733,
                1829
            ],
            [
                1829,
                1920
            ],
            [
                1925,
                1943
            ],
            [
                1958,
                1969
            ],
            [
                1974,
                2002
            ],
            [
                2002,
                2037
            ],
            [
                2038,
                2045
            ],
            [
                2074,
                2076
            ],
            [
                2076,
                2078
            ],
            [
                2078,
                2095
            ],
            [
                2095,
                2112
            ],
            [
                2120,
                2143
            ],
            [
                2143,
                2196
            ],
            [
                2197,
                2215
            ],
            [
                2216,
                2224
            ],
            [
                2224,
                2253
            ],
            [
                2253,
                2254
            ],
            [
                2255,
                2329
            ],
            [
                2329,
                2331
            ],
            [
                2331,
                2357
            ],
            [
                2358,
                2425
            ],
            [
                2425,
                2430
            ],
            [
                2431,
                2444
            ],
            [
                2444,
                2446
            ],
            [
                2446,
                2459
            ],
            [
                2460,
                2462
            ],
            [
                2463,
                2468
            ],
            [
                2469,
                2500
            ],
            [
                2500,
                2508
            ],
            [
                2514,
                2519
            ],
            [
                2520,
                2523
            ],
            [
                2524,
                2541
            ],
            [
                2541,
                2553
            ],
            [
                2560,
                2577
            ],
            [
                2578,
                2616
            ],
            [
                2622,
                2634
            ],
            [
                2635,
                2674
            ],
            [
                2674,
                2693
            ],
            [
                2693,
                2694
            ],
            [
                2695,
                2762
            ],
            [
                2763,
                2767
            ],
            [
                2770,
                2818
            ],
            [
                2818,
                2820
            ],
            [
                2820,
                2861
            ],
            [
                2862,
                2897
            ],
            [
                2898,
                2933
            ],
            [
                2934,
                2972
            ],
            [
                2973,
                3003
            ],
            [
                3003,
                3027
            ],
            [
                3028,
                3041
            ],
            [
                3042,
                3079
            ],
            [
                3080,
                3118
            ],
            [
                3118,
                3141
            ],
            [
                3143,
                3187
            ],
            [
                3187,
                3189
            ],
            [
                3189,
                3263
            ],
            [
                3264,
                3276
            ],
            [
                3277,
                3281
            ],
            [
                3282,
                3313
            ],
            [
                3313,
                3315
            ],
            [
                3315,
                3354
            ],
            [
                3359,
                3416
            ],
            [
                3423,
                3470
            ],
            [
                3470,
                3471
            ],
            [
                3472,
                3489
            ],
            [
                3490,
                3508
            ],
            [
                3516,
                3547
            ],
            [
                3547,
                3549
            ],
            [
                3549,
                3577
            ],
            [
                3586,
                3600
            ],
            [
                3604,
                3638
            ],
            [
                3649,
                3651
            ],
            [
                3657,
                3662
            ],
            [
                3663,
                3683
            ],
            [
                3684,
                3687
            ],
            [
                3689,
                3707
            ],
            [
                3712,
                3731
            ],
            [
                3731,
                3782
            ],
            [
                3795,
                3800
            ],
            [
                3806,
                3820
            ],
            [
                3829,
                3831
            ],
            [
                3831,
                3849
            ],
            [
                3849,
                3860
            ],
            [
                3861,
                3867
            ],
            [
                3868,
                3887
            ],
            [
                3905,
                3907
            ],
            [
                3907,
                3946
            ],
            [
                3954,
                3990
            ],
            [
                3990,
                4050
            ],
            [
                4051,
                4054
            ],
            [
                4055,
                4060
            ],
            [
                4061,
                4081
            ],
            [
                4087,
                4093
            ],
            [
                4100,
                4145
            ],
            [
                4145,
                4174
            ],
            [
                4174,
                4192
            ],
            [
                4194,
                4216
            ],
            [
                4216,
                4238
            ],
            [
                4246,
                4248
            ],
            [
                4248,
                4271
            ],
            [
                4272,
                4321
            ],
            [
                4321,
                4356
            ],
            [
                4356,
                4368
            ],
            [
                4369,
                4373
            ],
            [
                4374,
                4375
            ],
            [
                4376,
                4380
            ],
            [
                4381,
                4436
            ],
            [
                4437,
                4486
            ],
            [
                4494,
                4496
            ],
            [
                4496,
                4519
            ],
            [
                4520,
                4533
            ],
            [
                4533,
                4568
            ],
            [
                4577,
                4582
            ],
            [
                4582,
                4595
            ],
            [
                4596,
                4612
            ],
            [
                4613,
                4630
            ],
            [
                4631,
                4635
            ],
            [
                4636,
                4655
            ],
            [
                4656,
                4659
            ],
            [
                4669,
                4674
            ],
            [
                4674,
                4702
            ],
            [
                4702,
                4723
            ],
            [
                4728,
                4730
            ],
            [
                4730,
                4795
            ],
            [
                4809,
                4811
            ],
            [
                4811,
                4903
            ],
            [
                4903,
                4945
            ],
            [
                4946,
                4964
            ],
            [
                4968,
                4986
            ],
            [
                4988,
                4990
            ],
            [
                5002,
                5004
            ],
            [
                5005,
                5010
            ],
            [
                5011,
                5014
            ],
            [
                5015,
                5019
            ],
            [
                5020,
                5021
            ],
            [
                5022,
                5026
            ],
            [
                5043,
                5054
            ],
            [
                5055,
                5067
            ],
            [
                5067,
                5069
            ],
            [
                5069,
                5079
            ],
            [
                5080,
                5110
            ],
            [
                5116,
                5170
            ],
            [
                5171,
                5200
            ],
            [
                5200,
                5202
            ],
            [
                5202,
                5222
            ],
            [
                5222,
                5245
            ],
            [
                5245,
                5270
            ],
            [
                5274,
                5300
            ],
            [
                5300,
                5383
            ],
            [
                5384,
                5405
            ],
            [
                5405,
                5417
            ],
            [
                5417,
                5501
            ],
            [
                5501,
                5502
            ],
            [
                5503,
                5531
            ],
            [
                5531,
                5541
            ],
            [
                5541,
                5590
            ],
            [
                5590,
                5688
            ],
            [
                5695,
                5702
            ],
            [
                5703,
                5710
            ],
            [
                5710,
                5712
            ],
            [
                5712,
                5742
            ],
            [
                5743,
                5817
            ],
            [
                5817,
                5902
            ],
            [
                5902,
                5921
            ],
            [
                5927,
                5934
            ],
            [
                5935,
                5937
            ],
            [
                5938,
                6002
            ],
            [
                6002,
                6027
            ],
            [
                6027,
                6028
            ],
            [
                6029,
                6074
            ],
            [
                6075,
                6089
            ],
            [
                6092,
                6103
            ],
            [
                6103,
                6179
            ],
            [
                6179,
                6212
            ],
            [
                6212,
                6231
            ],
            [
                6231,
                6252
            ],
            [
                6252,
                6287
            ],
            [
                6287,
                6302
            ],
            [
                6302,
                6359
            ],
            [
                6359,
                6377
            ],
            [
                6377,
                6378
            ],
            [
                6379,
                6402
            ],
            [
                6404,
                6441
            ],
            [
                6441,
                6490
            ],
            [
                6490,
                6552
            ],
            [
                6553,
                6620
            ],
            [
                6621,
                6644
            ],
            [
                6647,
                6665
            ],
            [
                6665,
                6725
            ],
            [
                6739,
                6741
            ],
            [
                6741,
                6778
            ],
            [
                6778,
                6813
            ],
            [
                6821,
                6860
            ],
            [
                6860,
                6931
            ],
            [
                6974,
                6976
            ],
            [
                6976,
                6984
            ],
            [
                6992,
                6995
            ],
            [
                6996,
                7009
            ],
            [
                7010,
                7081
            ],
            [
                7081,
                7191
            ],
            [
                7195,
                7199
            ],
            [
                7204,
                7212
            ],
            [
                7221,
                7314
            ],
            [
                7321,
                7333
            ],
            [
                7333,
                7335
            ],
            [
                7335,
                7409
            ],
            [
                7409,
                7411
            ],
            [
                7411,
                7470
            ],
            [
                7470,
                7472
            ],
            [
                7472,
                7497
            ],
            [
                7498,
                7508
            ],
            [
                7509,
                7526
            ],
            [
                7526,
                7548
            ],
            [
                7558,
                7619
            ],
            [
                7620,
                7628
            ],
            [
                7629,
                7631
            ],
            [
                7632,
                7647
            ],
            [
                7655,
                7662
            ],
            [
                7663,
                7736
            ],
            [
                7750,
                7752
            ],
            [
                7752,
                7834
            ],
            [
                7834,
                7842
            ],
            [
                7850,
                7853
            ],
            [
                7854,
                7868
            ],
            [
                7868,
                7880
            ],
            [
                7880,
                7932
            ],
            [
                7932,
                7945
            ],
            [
                7945,
                8013
            ],
            [
                8013,
                8025
            ],
            [
                8025,
                8034
            ],
            [
                8034,
                8054
            ],
            [
                8057,
                8067
            ],
            [
                8067,
                8102
            ],
            [
                8103,
                8113
            ],
            [
                8113,
                8162
            ],
            [
                8162,
                8179
            ],
            [
                8179,
                8203
            ],
            [
                8203,
                8303
            ],
            [
                8303,
                8371
            ],
            [
                8372,
                8374
            ],
            [
                8375,
                8388
            ],
            [
                8388,
                8411
            ],
            [
                8411,
                8447
            ],
            [
                8448,
                8457
            ],
            [
                8463,
                8506
            ],
            [
                8506,
                8557
            ],
            [
                8557,
                8571
            ],
            [
                8571,
                8610
            ],
            [
                8610,
                8649
            ],
            [
                8649,
                8679
            ],
            [
                8679,
                8745
            ],
            [
                8745,
                8767
            ],
            [
                8772,
                8780
            ],
            [
                8781,
                8789
            ],
            [
                8796,
                8814
            ],
            [
                8815,
                8817
            ],
            [
                8818,
                8928
            ],
            [
                8929,
                8933
            ],
            [
                8939,
                8941
            ],
            [
                8941,
                8975
            ],
            [
                8981,
                9035
            ],
            [
                9044,
                9049
            ],
            [
                9054,
                9066
            ],
            [
                9066,
                9068
            ],
            [
                9068,
                9099
            ],
            [
                9099,
                9153
            ],
            [
                9153,
                9155
            ],
            [
                9155,
                9221
            ],
            [
                9221,
                9248
            ],
            [
                9249,
                9265
            ],
            [
                9265,
                9295
            ],
            [
                9295,
                9308
            ],
            [
                9308,
                9310
            ],
            [
                9310,
                9340
            ],
            [
                9341,
                9415
            ],
            [
                9415,
                9482
            ],
            [
                9482,
                9545
            ],
            [
                9546,
                9581
            ],
            [
                9581,
                9645
            ],
            [
                9647,
                9694
            ],
            [
                9694,
                9747
            ],
            [
                9747,
                9770
            ],
            [
                9770,
                9805
            ],
            [
                9805,
                9818
            ],
            [
                9823,
                9829
            ],
            [
                9830,
                9846
            ],
            [
                9847,
                9868
            ],
            [
                9869,
                9921
            ],
            [
                9921,
                9933
            ],
            [
                9933,
                9954
            ],
            [
                9954,
                10011
            ],
            [
                10012,
                10038
            ],
            [
                10038,
                10039
            ],
            [
                10040,
                10065
            ],
            [
                10065,
                10081
            ],
            [
                10081,
                10083
            ],
            [
                10092,
                10106
            ],
            [
                10106,
                10108
            ],
            [
                10108,
                10158
            ],
            [
                10158,
                10226
            ],
            [
                10226,
                10298
            ],
            [
                10301,
                10341
            ],
            [
                10341,
                10368
            ],
            [
                10368,
                10372
            ],
            [
                10373,
                10394
            ],
            [
                10394,
                10486
            ],
            [
                10492,
                10538
            ],
            [
                10538,
                10540
            ],
            [
                10540,
                10553
            ],
            [
                10562,
                10620
            ],
            [
                10625,
                10656
            ],
            [
                10657,
                10727
            ],
            [
                10727,
                10769
            ],
            [
                10769,
                10771
            ],
            [
                10771,
                10831
            ],
            [
                10831,
                10863
            ],
            [
                10863,
                10899
            ],
            [
                10899,
                10924
            ],
            [
                10932,
                10945
            ],
            [
                10946,
                10986
            ],
            [
                10986,
                11003
            ],
            [
                11006,
                11013
            ],
            [
                11030,
                11050
            ],
            [
                11050,
                11078
            ],
            [
                11079,
                11105
            ],
            [
                11108,
                11113
            ],
            [
                11115,
                11117
            ],
            [
                11117,
                11136
            ],
            [
                11137,
                11145
            ],
            [
                11145,
                11181
            ],
            [
                11181,
                11204
            ],
            [
                11204,
                11252
            ],
            [
                11252,
                11306
            ],
            [
                11306,
                11321
            ],
            [
                11323,
                11405
            ],
            [
                11405,
                11433
            ],
            [
                11433,
                11435
            ],
            [
                11435,
                11517
            ],
            [
                11517,
                11538
            ],
            [
                11538,
                11555
            ],
            [
                11555,
                11591
            ],
            [
                11591,
                11624
            ],
            [
                11624,
                11721
            ],
            [
                11722,
                11744
            ],
            [
                11744,
                11782
            ],
            [
                11782,
                11825
            ],
            [
                11828,
                11853
            ],
            [
                11853,
                11906
            ],
            [
                11907,
                11967
            ],
            [
                11967,
                11988
            ],
            [
                11988,
                12038
            ],
            [
                12039,
                12096
            ],
            [
                12096,
                12110
            ],
            [
                12117,
                12132
            ],
            [
                12133,
                12145
            ],
            [
                12145,
                12164
            ],
            [
                12164,
                12191
            ],
            [
                12191,
                12203
            ],
            [
                12204,
                12205
            ],
            [
                12213,
                12216
            ],
            [
                12216,
                12277
            ],
            [
                12277,
                12327
            ],
            [
                12327,
                12360
            ],
            [
                12360,
                12385
            ],
            [
                12385,
                12390
            ],
            [
                12391,
                12410
            ],
            [
                12410,
                12424
            ],
            [
                12424,
                12450
            ],
            [
                12450,
                12484
            ],
            [
                12484,
                12506
            ],
            [
                12507,
                12526
            ],
            [
                12538,
                12542
            ],
            [
                12563,
                12565
            ],
            [
                12565,
                12613
            ],
            [
                12614,
                12617
            ],
            [
                12618,
                12625
            ],
            [
                12627,
                12628
            ],
            [
                12649,
                12651
            ],
            [
                12652,
                12655
            ],
            [
                12665,
                12669
            ],
            [
                12669,
                12671
            ],
            [
                12671,
                12732
            ],
            [
                12732,
                12762
            ],
            [
                12763,
                12772
            ],
            [
                12772,
                12777
            ],
            [
                12780,
                12786
            ],
            [
                12787,
                12910
            ],
            [
                12910,
                12922
            ],
            [
                12923,
                12938
            ],
            [
                12943,
                12995
            ],
            [
                12996,
                13017
            ],
            [
                13018,
                13094
            ],
            [
                13094,
                13172
            ],
            [
                13172,
                13175
            ],
            [
                13176,
                13180
            ],
            [
                13181,
                13187
            ],
            [
                13187,
                13330
            ],
            [
                13334,
                13352
            ],
            [
                13352,
                13382
            ],
            [
                13383,
                13444
            ],
            [
                13444,
                13445
            ],
            [
                13446,
                13488
            ],
            [
                13489,
                13524
            ],
            [
                13524,
                13646
            ],
            [
                13646,
                13671
            ],
            [
                13672,
                13706
            ],
            [
                13706,
                13766
            ],
            [
                13766,
                13817
            ],
            [
                13818,
                13850
            ],
            [
                13850,
                13881
            ],
            [
                13881,
                13882
            ],
            [
                13897,
                13901
            ],
            [
                13903,
                13942
            ],
            [
                13945,
                14026
            ],
            [
                14026,
                14054
            ],
            [
                14054,
                14072
            ],
            [
                14072,
                14076
            ],
            [
                14077,
                14106
            ],
            [
                14106,
                14156
            ],
            [
                14159,
                14190
            ],
            [
                14193,
                14228
            ],
            [
                14228,
                14339
            ],
            [
                14339,
                14360
            ],
            [
                14363,
                14375
            ],
            [
                14375,
                14452
            ],
            [
                14453,
                14471
            ],
            [
                14472,
                14517
            ],
            [
                14517,
                14604
            ],
            [
                14604,
                14653
            ],
            [
                14654,
                14662
            ],
            [
                14662,
                14664
            ],
            [
                14664,
                14677
            ],
            [
                14686,
                14689
            ],
            [
                14693,
                14708
            ],
            [
                14715,
                14735
            ],
            [
                14735,
                14833
            ],
            [
                14834,
                14888
            ],
            [
                14889,
                14897
            ],
            [
                14899,
                14902
            ],
            [
                14913,
                14914
            ],
            [
                14915,
                14948
            ],
            [
                14949,
                15014
            ],
            [
                15014,
                15027
            ],
            [
                15027,
                15055
            ],
            [
                15055,
                15110
            ],
            [
                15110,
                15151
            ],
            [
                15151,
                15152
            ],
            [
                15158,
                15166
            ],
            [
                15168,
                15193
            ],
            [
                15193,
                15195
            ],
            [
                15195,
                15244
            ],
            [
                15245,
                15288
            ],
            [
                15288,
                15297
            ],
            [
                15298,
                15307
            ],
            [
                15308,
                15350
            ],
            [
                15350,
                15373
            ],
            [
                15373,
                15415
            ],
            [
                15415,
                15436
            ],
            [
                15436,
                15443
            ],
            [
                15443,
                15467
            ],
            [
                15467,
                15492
            ],
            [
                15492,
                15517
            ],
            [
                15517,
                15598
            ],
            [
                15598,
                15673
            ],
            [
                15674,
                15680
            ],
            [
                15680,
                15681
            ],
            [
                15686,
                15689
            ],
            [
                15700,
                15746
            ],
            [
                15746,
                15748
            ],
            [
                15749,
                15836
            ],
            [
                15836,
                15936
            ],
            [
                15936,
                15950
            ],
            [
                15950,
                16005
            ],
            [
                16005,
                16047
            ],
            [
                16047,
                16136
            ],
            [
                16136,
                16308
            ],
            [
                16308,
                16320
            ],
            [
                16341,
                16373
            ],
            [
                16374,
                16389
            ]
        ],
        "row_chars": [
            [
                0,
                259
            ],
            [
                259,
                343
            ],
            [
                343,
                384
            ],
            [
                384,
                406
            ],
            [
                406,
                567
            ],
            [
                567,
                605
            ],
            [
                605,
                748
            ],
            [
                748,
                748
            ],
            [
                748,
                748
            ],
            [
                748,
                810
            ],
            [
                810,
                886
            ],
            [
                886,
                1030
            ],
            [
                1030,
                1030
            ],
            [
                1030,
                1104
            ],
            [
                1104,
                1261
            ],
            [
                1261,
                1361
            ],
            [
                1361,
                1404
            ],
            [
                1404,
                1404
            ],
            [
                1404,
                1514
            ],
            [
                1514,
                1547
            ],
            [
                1547,
                1622
            ],
            [
                1622,
                1688
            ],
            [
                1688,
                1733
            ],
            [
                1733,
                1733
            ],
            [
                1733,
                1920
            ],
            [
                1920,
                2002
            ],
            [
                2002,
                2078
            ],
            [
                2078,
                2143
            ],
            [
                2143,
                2224
            ],
            [
                2224,
                2255
            ],
            [
                2255,
                2331
            ],
            [
                2331,
                2331
            ],
            [
                2331,
                2425
            ],
            [
                2425,
                2446
            ],
            [
                2446,
                2541
            ],
            [
                2541,
                2674
            ],
            [
                2674,
                2820
            ],
            [
                2820,
                2898
            ],
            [
                2898,
                3003
            ],
            [
                3003,
                3118
            ],
            [
                3118,
                3189
            ],
            [
                3189,
                3264
            ],
            [
                3264,
                3315
            ],
            [
                3315,
                3315
            ],
            [
                3315,
                3472
            ],
            [
                3472,
                3549
            ],
            [
                3549,
                3731
            ],
            [
                3731,
                3831
            ],
            [
                3831,
                3849
            ],
            [
                3849,
                3907
            ],
            [
                3907,
                3990
            ],
            [
                3990,
                4145
            ],
            [
                4145,
                4174
            ],
            [
                4174,
                4216
            ],
            [
                4216,
                4248
            ],
            [
                4248,
                4321
            ],
            [
                4321,
                4356
            ],
            [
                4356,
                4496
            ],
            [
                4496,
                4533
            ],
            [
                4533,
                4674
            ],
            [
                4674,
                4702
            ],
            [
                4702,
                4730
            ],
            [
                4730,
                4730
            ],
            [
                4730,
                4811
            ],
            [
                4811,
                4811
            ],
            [
                4811,
                4903
            ],
            [
                4903,
                5069
            ],
            [
                5069,
                5202
            ],
            [
                5202,
                5222
            ],
            [
                5222,
                5245
            ],
            [
                5245,
                5300
            ],
            [
                5300,
                5300
            ],
            [
                5300,
                5384
            ],
            [
                5384,
                5405
            ],
            [
                5405,
                5417
            ],
            [
                5417,
                5417
            ],
            [
                5417,
                5503
            ],
            [
                5503,
                5503
            ],
            [
                5503,
                5531
            ],
            [
                5531,
                5541
            ],
            [
                5541,
                5590
            ],
            [
                5590,
                5712
            ],
            [
                5712,
                5817
            ],
            [
                5817,
                5902
            ],
            [
                5902,
                6002
            ],
            [
                6002,
                6103
            ],
            [
                6103,
                6179
            ],
            [
                6179,
                6212
            ],
            [
                6212,
                6231
            ],
            [
                6231,
                6252
            ],
            [
                6252,
                6287
            ],
            [
                6287,
                6302
            ],
            [
                6302,
                6359
            ],
            [
                6359,
                6441
            ],
            [
                6441,
                6490
            ],
            [
                6490,
                6553
            ],
            [
                6553,
                6665
            ],
            [
                6665,
                6741
            ],
            [
                6741,
                6778
            ],
            [
                6778,
                6860
            ],
            [
                6860,
                6976
            ],
            [
                6976,
                7010
            ],
            [
                7010,
                7010
            ],
            [
                7010,
                7010
            ],
            [
                7010,
                7010
            ],
            [
                7010,
                7010
            ],
            [
                7010,
                7010
            ],
            [
                7010,
                7010
            ],
            [
                7010,
                7010
            ],
            [
                7010,
                7081
            ],
            [
                7081,
                7335
            ],
            [
                7335,
                7411
            ],
            [
                7411,
                7472
            ],
            [
                7472,
                7526
            ],
            [
                7526,
                7752
            ],
            [
                7752,
                7752
            ],
            [
                7752,
                7834
            ],
            [
                7834,
                7868
            ],
            [
                7868,
                7880
            ],
            [
                7880,
                7880
            ],
            [
                7880,
                7932
            ],
            [
                7932,
                7945
            ],
            [
                7945,
                8013
            ],
            [
                8013,
                8025
            ],
            [
                8025,
                8034
            ],
            [
                8034,
                8067
            ],
            [
                8067,
                8113
            ],
            [
                8113,
                8162
            ],
            [
                8162,
                8179
            ],
            [
                8179,
                8203
            ],
            [
                8203,
                8303
            ],
            [
                8303,
                8388
            ],
            [
                8388,
                8506
            ],
            [
                8506,
                8557
            ],
            [
                8557,
                8571
            ],
            [
                8571,
                8610
            ],
            [
                8610,
                8649
            ],
            [
                8649,
                8679
            ],
            [
                8679,
                8745
            ],
            [
                8745,
                8941
            ],
            [
                8941,
                8941
            ],
            [
                8941,
                9068
            ],
            [
                9068,
                9099
            ],
            [
                9099,
                9155
            ],
            [
                9155,
                9221
            ],
            [
                9221,
                9265
            ],
            [
                9265,
                9295
            ],
            [
                9295,
                9310
            ],
            [
                9310,
                9415
            ],
            [
                9415,
                9482
            ],
            [
                9482,
                9581
            ],
            [
                9581,
                9694
            ],
            [
                9694,
                9747
            ],
            [
                9747,
                9770
            ],
            [
                9770,
                9869
            ],
            [
                9869,
                9869
            ],
            [
                9869,
                9921
            ],
            [
                9921,
                9933
            ],
            [
                9933,
                9954
            ],
            [
                9954,
                10040
            ],
            [
                10040,
                10040
            ],
            [
                10040,
                10065
            ],
            [
                10065,
                10083
            ],
            [
                10083,
                10108
            ],
            [
                10108,
                10108
            ],
            [
                10108,
                10158
            ],
            [
                10158,
                10158
            ],
            [
                10158,
                10226
            ],
            [
                10226,
                10301
            ],
            [
                10301,
                10301
            ],
            [
                10301,
                10341
            ],
            [
                10341,
                10368
            ],
            [
                10368,
                10394
            ],
            [
                10394,
                10540
            ],
            [
                10540,
                10657
            ],
            [
                10657,
                10727
            ],
            [
                10727,
                10771
            ],
            [
                10771,
                10831
            ],
            [
                10831,
                10863
            ],
            [
                10863,
                10899
            ],
            [
                10899,
                10986
            ],
            [
                10986,
                11050
            ],
            [
                11050,
                11108
            ],
            [
                11108,
                11117
            ],
            [
                11117,
                11137
            ],
            [
                11137,
                11137
            ],
            [
                11137,
                11145
            ],
            [
                11145,
                11181
            ],
            [
                11181,
                11204
            ],
            [
                11204,
                11252
            ],
            [
                11252,
                11306
            ],
            [
                11306,
                11323
            ],
            [
                11323,
                11405
            ],
            [
                11405,
                11435
            ],
            [
                11435,
                11517
            ],
            [
                11517,
                11538
            ],
            [
                11538,
                11555
            ],
            [
                11555,
                11591
            ],
            [
                11591,
                11624
            ],
            [
                11624,
                11722
            ],
            [
                11722,
                11722
            ],
            [
                11722,
                11722
            ],
            [
                11722,
                11744
            ],
            [
                11744,
                11782
            ],
            [
                11782,
                11828
            ],
            [
                11828,
                11853
            ],
            [
                11853,
                11906
            ],
            [
                11906,
                11906
            ],
            [
                11906,
                11967
            ],
            [
                11967,
                11988
            ],
            [
                11988,
                12096
            ],
            [
                12096,
                12145
            ],
            [
                12145,
                12164
            ],
            [
                12164,
                12191
            ],
            [
                12191,
                12216
            ],
            [
                12216,
                12216
            ],
            [
                12216,
                12277
            ],
            [
                12277,
                12327
            ],
            [
                12327,
                12360
            ],
            [
                12360,
                12385
            ],
            [
                12385,
                12410
            ],
            [
                12410,
                12424
            ],
            [
                12424,
                12450
            ],
            [
                12450,
                12484
            ],
            [
                12484,
                12565
            ],
            [
                12565,
                12671
            ],
            [
                12671,
                12732
            ],
            [
                12732,
                12772
            ],
            [
                12772,
                12787
            ],
            [
                12787,
                12787
            ],
            [
                12787,
                12910
            ],
            [
                12910,
                13018
            ],
            [
                13018,
                13094
            ],
            [
                13094,
                13172
            ],
            [
                13172,
                13352
            ],
            [
                13352,
                13446
            ],
            [
                13446,
                13524
            ],
            [
                13524,
                13646
            ],
            [
                13646,
                13706
            ],
            [
                13706,
                13766
            ],
            [
                13766,
                13850
            ],
            [
                13850,
                13883
            ],
            [
                13883,
                13945
            ],
            [
                13945,
                14026
            ],
            [
                14026,
                14054
            ],
            [
                14054,
                14072
            ],
            [
                14072,
                14106
            ],
            [
                14106,
                14228
            ],
            [
                14228,
                14339
            ],
            [
                14339,
                14375
            ],
            [
                14375,
                14517
            ],
            [
                14517,
                14604
            ],
            [
                14604,
                14664
            ],
            [
                14664,
                14735
            ],
            [
                14735,
                14834
            ],
            [
                14834,
                14915
            ],
            [
                14915,
                14949
            ],
            [
                14949,
                15014
            ],
            [
                15014,
                15055
            ],
            [
                15055,
                15110
            ],
            [
                15110,
                15195
            ],
            [
                15195,
                15245
            ],
            [
                15245,
                15245
            ],
            [
                15245,
                15288
            ],
            [
                15288,
                15350
            ],
            [
                15350,
                15373
            ],
            [
                15373,
                15415
            ],
            [
                15415,
                15436
            ],
            [
                15436,
                15443
            ],
            [
                15443,
                15467
            ],
            [
                15467,
                15492
            ],
            [
                15492,
                15517
            ],
            [
                15517,
                15598
            ],
            [
                15598,
                15682
            ],
            [
                15682,
                15682
            ],
            [
                15682,
                15749
            ],
            [
                15749,
                15836
            ],
            [
                15836,
                15936
            ],
            [
                15936,
                15950
            ],
            [
                15950,
                16005
            ],
            [
                16005,
                16047
            ],
            [
                16047,
                16136
            ],
            [
                16136,
                16308
            ],
            [
                16308,
                16389
            ]
        ]
    }
}