{
    "original": {
        "text": "\"George,\" said Kate, speaking before she quite got up to them, \"will you tell me whether you have been preparing all your things for an open sale by auction?\" Then she stole a look at Alice, and having learned from that glance that something had occurred which prevented Alice from joining her in her raillery, she went on with it herself rapidly, as though to cover Alice's confusion, and give her time to rally before they should all move. \"Would you believe it? he had three razors laid out on his table--\"\n\"A man must shave,--even at Basle.\"\n\"But not with three razors at once; and three hair-brushes, and half a dozen toothbrushes, and a small collection of combs, and four or five little glass bottles, looking as though they contained poison,--all with silver tops. I can only suppose you desired to startle the weak mind of the chambermaid. I have put them all up; but remember this, if they are taken out again you are responsible. And I will not put up your boots, George. What can you have wanted with three pairs of boots at Basle?\"\n\"When you have completed the list of my wardrobe we'll go out upon the bridge. That is, if Alice likes it.\"\n\"Oh, yes; I shall like it.\"\n\"Come along then,\" said Kate. And so they moved away. When they got upon the bridge Alice and Kate were together, while George strolled behind them, close to them, but not taking any part in their conversation,--as though he had merely gone with them as an escort. Kate seemed to be perfectly content with this arrangement, chattering to Alice, so that she might show that there was nothing serious on the minds of any of them. It need hardly be said that Alice at this time made no appeal to George to join them. He followed them at their heels, with his hands behind his back, looking down upon the pavement and simply waiting upon their pleasure.\n\"Do you know,\" said Kate, \"I have a very great mind to run away.\"\n\"Where do you want to run to?\"\n\"Well;--that wouldn't much signify. Perhaps I'd go to the little inn at Handek. It's a lonely place, where nobody would hear of me,--and I should have the waterfall. I'm afraid they'd want to have their bill paid. That would be the worst of it.\"\n\"But why run away just now?\"\n\"I won't, because you wouldn't like going home with George alone,--and I suppose he'd be bound to look after me, as he's doing now. I wonder what he thinks of having to walk over the bridge after us girls. I suppose he'd be in that place down there drinking beer, if we weren't here.\"\n\"If he wanted to go, I dare say he would, in spite of us.\"\n\"That's ungrateful of you, for I'm sure we've never been kept in a moment by his failing us. But as I was saying, I do dread going home. You are going to John Grey, which may be pleasant enough; but I'm going--to Aunt Greenow.\"\n\"It's your own choice.\"\n\"No, it's not. I haven't any choice in the matter. Of course I might refuse to speak to Aunt Greenow, and nobody could make me;--but practically I haven't any choice in the matter. Fancy a month at Yarmouth with no companion but such a woman as that!\"\n\"I shouldn't mind it. Aunt Greenow always seems to me to be a very good sort of woman.\"\n\"She may be a good woman, but I must say I think she's of a bad sort. You've never heard her talk about her husband?\"\n\"No, never; I think she did cry a little the first day she came to Queen Anne Street, but that wasn't unnatural.\"\n\"He was thirty years older than herself.\"\n\"But still he was her husband. And even if her tears are assumed, what of that? What's a woman to do? Of course she was wrong to marry him. She was thirty-five, and had nothing, while he was sixty-five, and was very rich. According to all accounts she made him a very good wife, and now that she's got all his money, you wouldn't have her go about laughing within three months of his death.\"\n\"No; I wouldn't have her laugh; but neither would I have her cry. And she's quite right to wear weeds; but she needn't be so very outrageous in the depth of her hems, or so very careful that her caps are becoming. Her eyes will be worn out by their double service. They are always red with weeping, and yet she is ready every minute with a full battery of execution for any man that she sees.\"\n\"Then why have you consented to go to Yarmouth with her?\"\n\"Just because she's got forty thousand pounds. If Mr. Greenow had left her with a bare maintenance I don't suppose I should ever have held out my hand to her.\"\n\"Then you're as bad as she is.\"\n\"Quite as bad;--and that's what makes me want to run away. But it isn't my own fault altogether. It's the fault of the world at large. Does anybody ever drop their rich relatives? When she proposed to take me to Yarmouth, wasn't it natural that the squire should ask me to go? When I told George, wasn't it natural that he should say, 'Oh, go by all means. She's got forty thousand pounds!' One can't pretend to be wiser or better than one's relatives. And after all what can I expect from her money?\"\n\"Nothing, I should say.\"\n\"Not a halfpenny. I'm nearly thirty and she's only forty, and of course she'll marry again. I will say of myself, too, that no person living cares less for money.\"\n\"I should think no one.\"\n\"Yet one sticks to one's rich relatives. It's the way of the world.\" Then she paused a moment. \"But shall I tell you, Alice, why I do stick to her? Perhaps you'll think the object as mean as though I wanted her money myself.\"\n\"Why is it?\"\n\"Because it is on the cards that she may help George in his career. I do not want money, but he may. And for such purposes as his, I think it fair that all the family should contribute. I feel sure that he would make a name for himself in Parliament; and if I had my way I would spend every shilling of Vavasor money in putting him there. When I told the squire so I thought he would have eaten me. I really did think he would have turned me out of the house.\"\n\"And serve you right too after what had happened.\"\n\"I didn't care. Let him turn me out. I was determined he should know what I thought. He swore at me; and then he was so unhappy at what he had done that he came and kissed me that night in my bedroom, and gave me a ten-pound note. What do you think I did with it? I sent it as a contribution to the next election and George has it now locked up in a box. Don't you tell him that I told you.\"\nThen they stopped and leaned for a while over the parapet of the bridge. \"Come here, George,\" said Kate; and she made room for him between herself and Alice. \"Wouldn't you like to be swimming down there as those boys were doing when we went out into the balcony? The water looks so enticing.\"\n\"I can't say I should;--unless it might be a pleasant way of swimming into the next world.\"\n\"I should so like to feel myself going with the stream,\" said Kate; \"particularly by this light. I can't fancy in the least that I should be drowned.\"\n\"I can't fancy anything else,\" said Alice.\n\"It would be so pleasant to feel the water gliding along one's limbs, and to be carried away headlong,--knowing that you were on the direct road to Rotterdam.\"\n\"And so arrive there without your clothes,\" said George.\n\"They would be brought after in a boat. Didn't you see that those boys had a boat with them? But if I lived here, I'd never do it except by moonlight. The water looks so clear and bright now, and the rushing sound of it is so soft! The sea at Yarmouth won't be anything like that I suppose.\"\nNeither of them any longer answered her, and yet she went on talking about the river, and their aunt, and her prospects at Yarmouth. Neither of them answered her, and yet it seemed that they had not a word to say to each other. But still they stood there looking down upon the river, and every now and then Kate's voice was to be heard, preventing the feeling which might otherwise have arisen that their hearts were too full for speech.\nAt last Alice seemed to shiver. There was a slight trembling in her arms, which George felt rather than saw. \"You are cold,\" he said.\n\"No indeed.\"\n\"If you are let us go in. I thought you shivered with the night air.\"\n\"It wasn't that. I was thinking of something. Don't you ever think of things that make you shiver?\"\n\"Indeed I do, very often;--so often that I have to do my shiverings inwardly. Otherwise people would think I had the palsy.\"\n\"I don't mean things of moment,\" said Alice. \"Little bits of things make me do it;--perhaps a word that I said and ought not to have said ten years ago;--the most ordinary little mistakes, even my own past thoughts to myself about the merest trifles. They are always making me shiver.\"\n\"It's not because you have committed any murder then.\"\n\"No; but it's my conscience all the same, I suppose.\"\n\"Ah! I'm not so good as you. I doubt it's not my conscience at all. When I think of a chance I've let go by, as I have thousands, then it is that I shiver. But, as I tell you, I shiver inwardly. I've been in one long shiver ever since we came out because of one chance that I let go by. Come, we'll go in. We've to be up at five o'clock, and now it's eleven. I'll do the rest of my shivering in bed.\"\n\"Are you tired of being out?\" said Kate, when the other two began to move.\n\"Not tired of being out, but George reminds me that we have to be up at five.\"\n\"I wish George would hold his tongue. We can't come to the bridge at Basle every night in our lives. If one found oneself at the top of Sinai I'm afraid the first feeling would be one of fear lest one wouldn't be down in time to dress for dinner. Are you aware, George, that the king of rivers is running beneath your feet, and that the moon is shining with a brilliance you never see at home?\"\n\"I'll stay here all night if you'll put off going to-morrow,\" said George.\n\"Our money wouldn't hold out,\" said Kate.\n\"Don't talk about Sinai any more after that,\" said he, \"but let's go in to bed.\"\nThey walked across the bridge back to the hotel in the same manner as before, the two girls going together with the young man after them, and so they went up the front steps of the hotel, through the hall, and on to the stairs. Here George handed Alice her candle, and as he did so he whispered a few words to her. \"My shivering fit has to come yet,\" said he, \"and will last me the whole night.\" She would have given much to be able to answer him lightly, as though what he had said had meant nothing;--but she couldn't do it; the light speech would not come to her. She was conscious of all this, and went away to her own room without answering him at all. Here she sat down at the window looking out upon the river till Kate should join her. Their rooms opened through from one to the other, and she would not begin her packing till her cousin should come.\nBut Kate had gone with her brother, promising, as she did so, that she would be back in half a minute. That half minute was protracted beyond half an hour. \"If you'll take my advice,\" said Kate, at last, standing up with her candle in her hand, \"you'll ask her in plain words to give you another chance. Do it to-morrow at Strasbourg; you'll never have a better opportunity.\"\n\"And bid her throw John Grey over!\"\n\"Don't say anything about John Grey; leave her to settle that matter with herself. Believe me that she has quite courage enough to dispose of John Grey, if she has courage enough to accept your offer.\"\n\"Kate, you women never understand each other. If I were to do that, all her most powerful feelings would be arrayed in arms against me. I must leave her to find out first that she wishes to be rid of her engagement.\"\n\"She has found that out long ago. Do you think I don't know what she wishes? But if you can't bring yourself to speak to her, she'll marry him in spite of her wishes.\"\n\"Bring myself! I've never been very slow in bringing myself to speak to any one when there was need. It isn't very pleasant sometimes, but I do it, if I find occasion.\"\n\"But surely it must be pleasant with her. You must be glad to find that she still loves you. You still love her, I suppose?\"\n\"Upon my word I don't know.\"\n\"Don't provoke me, George. I'm moving heaven and earth to bring you two together; but if I didn't think you loved her, I'd go to her at once and bid her never see you again.\"\n\"Upon my word, Kate, I sometimes think it would be better if you'd leave heaven and earth alone.\"\n\"Then I will. But of all human beings, surely you're the most ungrateful.\"\n\"Why shouldn't she marry John Grey if she likes him?\"\n\"But she doesn't like him. And I hate him. I hate the sound of his voice, and the turn of his eye, and that slow, steady movement of his,--as though he was always bethinking himself that he wouldn't wear out his clothes.\"\n\"I don't see that your hating him ought to have anything to do with it.\"\n\"If you're going to preach morals, I'll leave you. It's the darling wish of my heart that she should be your wife. If you ever loved anybody,--and I sometimes doubt whether you ever did,--but if you did, you loved her.\"\n\"Did and do are different things.\"\n\"Very well, George; then I have done. It has been the same in every twist and turn of my life. In everything that I have striven to do for you, you have thrown yourself over, in order that I might be thrown over too. But I believe you say this merely to vex me.\"\n\"Upon my word, Kate, I think you'd better go to bed.\"\n\"But not till I've told her everything. I won't leave her to be deceived and ill-used again.\"\n\"Who is ill-using her now? Is it not the worst of ill-usage, trying to separate her from that man?\"\n\"No;--if I thought so, I would have no hand in doing it. She would be miserable with him, and make him miserable as well. She does not really love him. He loves her, but I've nothing to do with that. It's nothing to me if he breaks his heart.\"\n\"I shall break mine if you don't let me go to bed.\"\nWith that she went away and hurried along the corridor, till she came to her cousin's room. She found Alice still seated at the window, or rather kneeling on the chair, with her head out through the lattice. \"Why, you lazy creature,\" said Kate; \"I declare you haven't touched a thing.\"\n\"You said we'd do it together.\"\n\"But he has kept me. Oh, what a man he is! If he ever does get married, what will his wife do with him?\"\n\"I don't think he ever will,\" said Alice.\n\"Don't you? I dare say you understand him better than I do. Sometimes I think that the only thing wanting to make him thoroughly good, is a wife. But it isn't every woman that would do for him. And the woman who marries him should have high courage. There are moments with him when he is very wild; but he never is cruel and never hard. Is Mr. Grey ever hard?\"\n\"Never; nor yet wild.\"\n\"Oh, certainly not that. I'm quite sure he's never wild.\"\n\"When you say that, Kate, I know that you mean to abuse him.\"\n\"No; upon my word. What's the good of abusing him to you? I like a man to be wild,--wild in my sense. You knew that before.\"\n\"I wonder whether you'd like a wild man for yourself?\"\n\"Ah! that's a question I've never asked myself. I've been often curious to consider what sort of husband would suit you, but I've had very few thoughts about a husband for myself. The truth is, I'm married to George. Ever since--\"\n\"Ever since what?\"\n\"Since you and he were parted, I've had nothing to do in life but to stick to him. And I shall do so to the end,--unless one thing should happen.\"\n\"And what's that?\"\n\"Unless you should become his wife after all. He will never marry anybody else.\"\n\"Kate, you shouldn't allude to such a thing now. You know that it's impossible.\"\n\"Well, perhaps so. As far as I'm concerned, it is all the better for me. If George ever married, I should have nothing to do in the world;--literally nothing--nothing--nothing--nothing!\"\n\"Kate, don't talk in that way,\" and Alice came up to her and embraced her.\n\"Go away,\" said she. \"Go, Alice; you and I must part. I cannot bear it any longer. You must know it all. When you are married to John Grey, our friendship must be over. If you became George's wife I should become nobody. I've nothing else in the world. You and he would be so all-sufficient for each other, that I should drop away from you like an old garment. But I'd give up all, everything, every hope I have, to see you become George's wife. I know myself not to be good. I know myself to be very bad, and yet I care nothing for myself. Don't Alice, don't; I don't want your caresses. Caress him, and I'll kneel at your feet and cover them with kisses.\" She had now thrown herself upon a sofa, and had turned her face away to the wall.\n\"Kate, you shouldn't speak in that way.\"\n\"Of course I shouldn't,--but I do.\"\n\"You, who know everything, must know that I cannot marry your brother,--even if he wished it.\"\n\"He does wish it.\"\n\"Not though I were under no other engagement.\"\n\"And why not?\" said Kate, again starting up. \"What is there to separate you from George now, but that unfortunate affair, that will end in the misery of you all. Do you think I can't see? Don't I know which of the two men you like best?\"\n\"You are making me sorry, Kate, that I have ventured to come here in your brother's company. It is not only unkind of you to talk to me in this way, but worse than that--it is indelicate.\"\n\"Oh, indelicate! How I do hate that word. If any word in the language reminds me of a whited sepulchre it is that;--all clean and polished outside with filth and rottenness within. Are your thoughts delicate? that's the thing. You are engaged to marry John Grey. That may be delicate enough if you love him truly, and feel yourself fitted to be his wife; but it's about the most indelicate thing you can do, if you love any one better than him. Delicacy with many women is like their cleanliness. Nothing can be nicer than the whole outside get-up, but you wouldn't wish to answer for anything beneath.\"\n\"If you think ill of me like that--\"\n\"No; I don't think ill of you. How can I think ill of you when I know that all your difficulties have come from him? It hasn't been your fault; it has been his throughout. It is he who has driven you to sacrifice yourself on this altar. If we can, both of us, manage to lay aside all delicacy and pretence, and dare to speak the truth, we shall acknowledge that it is so. Had Mr. Grey come to you while things were smooth between you and George, would you have thought it possible that he could be George's rival in your estimation? It is Hyperion to Satyr.\"\n\"And which is the Satyr?\"\n\"I'll leave your heart to tell you. You know what is the darling wish of my heart. But, Alice, if I thought that Mr. Grey was to you Hyperion,--if I thought that you could marry him with that sort of worshipping, idolatrous love which makes a girl proud as well as happy in her marriage, I wouldn't raise a little finger to prevent it.\"\nTo this Alice made no answer, and then Kate allowed the matter to drop. Alice made no answer, though she felt that she was allowing judgement to go against her by default in not doing so. She had intended to fight bravely, and to have maintained the excellence of her present position as the affianced bride of Mr. Grey, but she felt that she had failed. She felt that she had, in some sort, acknowledged that the match was one to be deplored;--that her words in her own defence would by no means have satisfied Mr. Grey, if Mr. Grey could have heard them;--that they would have induced him to offer her back her troth rather than have made him happy as a lover. But she had nothing further to say. She could do something. She would hurry home and bid him name the earliest day he pleased. After that her cousin would cease to disturb her in her career.\nIt was nearly one o'clock before the two girls began to prepare for their morning start, and Alice, when they had finished their packing, seemed to be worn out with fatigue. \"If you are tired, dear, we'll put it off,\" said Kate. \"Not for worlds,\" said Alice. \"For half a word we'll do it,\" continued Kate. \"I'll slip out to George and tell him, and there's nothing he'd like so much.\" But Alice would not consent.\nAbout two they got into bed, and punctually at six they were at the railway station. \"Don't speak to me,\" said George, when he met them at their door in the passage. \"I shall only yawn in your face.\" However, they were in time,--which means abroad that they were at the station half an hour before their train started,--and they went on upon their journey to Strasbourg.\nThere is nothing further to be told of their tour. They were but two days and nights on the road from Basle to London; and during those two days and nights neither George nor Kate spoke a word to Alice of her marriage, nor was any allusion made to the balcony at the inn, or to the bridge over the river.",
        "paragraph_chars": [
            [
                0,
                510
            ],
            [
                510,
                546
            ],
            [
                546,
                1045
            ],
            [
                1045,
                1153
            ],
            [
                1153,
                1181
            ],
            [
                1181,
                1831
            ],
            [
                1831,
                1897
            ],
            [
                1897,
                1928
            ],
            [
                1928,
                2174
            ],
            [
                2174,
                2203
            ],
            [
                2203,
                2488
            ],
            [
                2488,
                2547
            ],
            [
                2547,
                2775
            ],
            [
                2775,
                2799
            ],
            [
                2799,
                3051
            ],
            [
                3051,
                3139
            ],
            [
                3139,
                3257
            ],
            [
                3257,
                3371
            ],
            [
                3371,
                3413
            ],
            [
                3413,
                3805
            ],
            [
                3805,
                4199
            ],
            [
                4199,
                4257
            ],
            [
                4257,
                4417
            ],
            [
                4417,
                4449
            ],
            [
                4449,
                4951
            ],
            [
                4951,
                4976
            ],
            [
                4976,
                5140
            ],
            [
                5140,
                5165
            ],
            [
                5165,
                5391
            ],
            [
                5391,
                5404
            ],
            [
                5404,
                5865
            ],
            [
                5865,
                5916
            ],
            [
                5916,
                6308
            ],
            [
                6308,
                6601
            ],
            [
                6601,
                6693
            ],
            [
                6693,
                6844
            ],
            [
                6844,
                6887
            ],
            [
                6887,
                7047
            ],
            [
                7047,
                7104
            ],
            [
                7104,
                7396
            ],
            [
                7396,
                7834
            ],
            [
                7834,
                7968
            ],
            [
                7968,
                7981
            ],
            [
                7981,
                8051
            ],
            [
                8051,
                8151
            ],
            [
                8151,
                8276
            ],
            [
                8276,
                8562
            ],
            [
                8562,
                8617
            ],
            [
                8617,
                8671
            ],
            [
                8671,
                9072
            ],
            [
                9072,
                9147
            ],
            [
                9147,
                9226
            ],
            [
                9226,
                9621
            ],
            [
                9621,
                9696
            ],
            [
                9696,
                9738
            ],
            [
                9738,
                9819
            ],
            [
                9819,
                10678
            ],
            [
                10678,
                11054
            ],
            [
                11054,
                11090
            ],
            [
                11090,
                11292
            ],
            [
                11292,
                11509
            ],
            [
                11509,
                11677
            ],
            [
                11677,
                11846
            ],
            [
                11846,
                11971
            ],
            [
                11971,
                12000
            ],
            [
                12000,
                12175
            ],
            [
                12175,
                12273
            ],
            [
                12273,
                12348
            ],
            [
                12348,
                12402
            ],
            [
                12402,
                12624
            ],
            [
                12624,
                12697
            ],
            [
                12697,
                12917
            ],
            [
                12917,
                12952
            ],
            [
                12952,
                13215
            ],
            [
                13215,
                13269
            ],
            [
                13269,
                13363
            ],
            [
                13363,
                13463
            ],
            [
                13463,
                13707
            ],
            [
                13707,
                13759
            ],
            [
                13759,
                14045
            ],
            [
                14045,
                14077
            ],
            [
                14077,
                14182
            ],
            [
                14182,
                14224
            ],
            [
                14224,
                14585
            ],
            [
                14585,
                14608
            ],
            [
                14608,
                14666
            ],
            [
                14666,
                14728
            ],
            [
                14728,
                14853
            ],
            [
                14853,
                14908
            ],
            [
                14908,
                15139
            ],
            [
                15139,
                15158
            ],
            [
                15158,
                15305
            ],
            [
                15305,
                15324
            ],
            [
                15324,
                15405
            ],
            [
                15405,
                15486
            ],
            [
                15486,
                15673
            ],
            [
                15673,
                15748
            ],
            [
                15748,
                16488
            ],
            [
                16488,
                16529
            ],
            [
                16529,
                16565
            ],
            [
                16565,
                16660
            ],
            [
                16660,
                16679
            ],
            [
                16679,
                16726
            ],
            [
                16726,
                16964
            ],
            [
                16964,
                17153
            ],
            [
                17153,
                17757
            ],
            [
                17757,
                17794
            ],
            [
                17794,
                18353
            ],
            [
                18353,
                18379
            ],
            [
                18379,
                18716
            ],
            [
                18716,
                19570
            ],
            [
                19570,
                19984
            ],
            [
                19984,
                20355
            ],
            [
                20355,
                20659
            ]
        ],
        "segment_chars": [
            [
                0,
                159
            ],
            [
                159,
                442
            ],
            [
                442,
                465
            ],
            [
                465,
                510
            ],
            [
                510,
                546
            ],
            [
                546,
                773
            ],
            [
                773,
                849
            ],
            [
                849,
                941
            ],
            [
                941,
                983
            ],
            [
                983,
                1045
            ],
            [
                1045,
                1124
            ],
            [
                1124,
                1153
            ],
            [
                1153,
                1181
            ],
            [
                1181,
                1211
            ],
            [
                1211,
                1235
            ],
            [
                1235,
                1446
            ],
            [
                1446,
                1609
            ],
            [
                1609,
                1695
            ],
            [
                1695,
                1831
            ],
            [
                1831,
                1897
            ],
            [
                1897,
                1928
            ],
            [
                1928,
                1964
            ],
            [
                1964,
                2008
            ],
            [
                2008,
                2094
            ],
            [
                2094,
                2142
            ],
            [
                2142,
                2174
            ],
            [
                2174,
                2203
            ],
            [
                2203,
                2335
            ],
            [
                2335,
                2409
            ],
            [
                2409,
                2488
            ],
            [
                2488,
                2547
            ],
            [
                2547,
                2640
            ],
            [
                2640,
                2684
            ],
            [
                2684,
                2775
            ],
            [
                2775,
                2799
            ],
            [
                2799,
                2814
            ],
            [
                2814,
                2850
            ],
            [
                2850,
                2980
            ],
            [
                2980,
                3051
            ],
            [
                3051,
                3073
            ],
            [
                3073,
                3139
            ],
            [
                3139,
                3209
            ],
            [
                3209,
                3257
            ],
            [
                3257,
                3371
            ],
            [
                3371,
                3413
            ],
            [
                3413,
                3444
            ],
            [
                3444,
                3493
            ],
            [
                3493,
                3515
            ],
            [
                3515,
                3553
            ],
            [
                3553,
                3635
            ],
            [
                3635,
                3805
            ],
            [
                3805,
                3871
            ],
            [
                3871,
                4019
            ],
            [
                4019,
                4070
            ],
            [
                4070,
                4199
            ],
            [
                4199,
                4257
            ],
            [
                4257,
                4304
            ],
            [
                4304,
                4417
            ],
            [
                4417,
                4449
            ],
            [
                4449,
                4508
            ],
            [
                4508,
                4546
            ],
            [
                4546,
                4584
            ],
            [
                4584,
                4629
            ],
            [
                4629,
                4726
            ],
            [
                4726,
                4806
            ],
            [
                4806,
                4840
            ],
            [
                4840,
                4902
            ],
            [
                4902,
                4951
            ],
            [
                4951,
                4976
            ],
            [
                4976,
                4994
            ],
            [
                4994,
                5068
            ],
            [
                5068,
                5140
            ],
            [
                5140,
                5165
            ],
            [
                5165,
                5206
            ],
            [
                5206,
                5234
            ],
            [
                5234,
                5260
            ],
            [
                5260,
                5313
            ],
            [
                5313,
                5391
            ],
            [
                5391,
                5404
            ],
            [
                5404,
                5472
            ],
            [
                5472,
                5505
            ],
            [
                5505,
                5590
            ],
            [
                5590,
                5743
            ],
            [
                5743,
                5803
            ],
            [
                5803,
                5865
            ],
            [
                5865,
                5916
            ],
            [
                5916,
                5932
            ],
            [
                5932,
                5953
            ],
            [
                5953,
                6001
            ],
            [
                6001,
                6147
            ],
            [
                6147,
                6180
            ],
            [
                6180,
                6271
            ],
            [
                6271,
                6308
            ],
            [
                6308,
                6381
            ],
            [
                6381,
                6466
            ],
            [
                6466,
                6571
            ],
            [
                6571,
                6601
            ],
            [
                6601,
                6693
            ],
            [
                6693,
                6790
            ],
            [
                6790,
                6844
            ],
            [
                6844,
                6887
            ],
            [
                6887,
                7047
            ],
            [
                7047,
                7104
            ],
            [
                7104,
                7144
            ],
            [
                7144,
                7197
            ],
            [
                7197,
                7255
            ],
            [
                7255,
                7336
            ],
            [
                7336,
                7396
            ],
            [
                7396,
                7529
            ],
            [
                7529,
                7624
            ],
            [
                7624,
                7834
            ],
            [
                7834,
                7866
            ],
            [
                7866,
                7943
            ],
            [
                7943,
                7968
            ],
            [
                7968,
                7981
            ],
            [
                7981,
                8007
            ],
            [
                8007,
                8051
            ],
            [
                8051,
                8068
            ],
            [
                8068,
                8097
            ],
            [
                8097,
                8151
            ],
            [
                8151,
                8229
            ],
            [
                8229,
                8276
            ],
            [
                8276,
                8321
            ],
            [
                8321,
                8527
            ],
            [
                8527,
                8562
            ],
            [
                8562,
                8617
            ],
            [
                8617,
                8671
            ],
            [
                8671,
                8676
            ],
            [
                8676,
                8700
            ],
            [
                8700,
                8739
            ],
            [
                8739,
                8827
            ],
            [
                8827,
                8866
            ],
            [
                8866,
                8958
            ],
            [
                8958,
                8977
            ],
            [
                8977,
                9030
            ],
            [
                9030,
                9072
            ],
            [
                9072,
                9102
            ],
            [
                9102,
                9147
            ],
            [
                9147,
                9226
            ],
            [
                9226,
                9264
            ],
            [
                9264,
                9327
            ],
            [
                9327,
                9473
            ],
            [
                9473,
                9621
            ],
            [
                9621,
                9696
            ],
            [
                9696,
                9738
            ],
            [
                9738,
                9819
            ],
            [
                9819,
                10047
            ],
            [
                10047,
                10134
            ],
            [
                10134,
                10215
            ],
            [
                10215,
                10386
            ],
            [
                10386,
                10477
            ],
            [
                10477,
                10563
            ],
            [
                10563,
                10678
            ],
            [
                10678,
                10781
            ],
            [
                10781,
                10834
            ],
            [
                10834,
                10982
            ],
            [
                10982,
                11054
            ],
            [
                11054,
                11090
            ],
            [
                11090,
                11173
            ],
            [
                11173,
                11292
            ],
            [
                11292,
                11338
            ],
            [
                11338,
                11428
            ],
            [
                11428,
                11509
            ],
            [
                11509,
                11543
            ],
            [
                11543,
                11586
            ],
            [
                11586,
                11677
            ],
            [
                11677,
                11692
            ],
            [
                11692,
                11778
            ],
            [
                11778,
                11846
            ],
            [
                11846,
                11888
            ],
            [
                11888,
                11939
            ],
            [
                11939,
                11971
            ],
            [
                11971,
                12000
            ],
            [
                12000,
                12027
            ],
            [
                12027,
                12175
            ],
            [
                12175,
                12273
            ],
            [
                12273,
                12287
            ],
            [
                12287,
                12348
            ],
            [
                12348,
                12402
            ],
            [
                12402,
                12429
            ],
            [
                12429,
                12445
            ],
            [
                12445,
                12624
            ],
            [
                12624,
                12697
            ],
            [
                12697,
                12748
            ],
            [
                12748,
                12812
            ],
            [
                12812,
                12917
            ],
            [
                12917,
                12952
            ],
            [
                12952,
                12990
            ],
            [
                12990,
                13047
            ],
            [
                13047,
                13169
            ],
            [
                13169,
                13215
            ],
            [
                13215,
                13269
            ],
            [
                13269,
                13309
            ],
            [
                13309,
                13363
            ],
            [
                13363,
                13390
            ],
            [
                13390,
                13463
            ],
            [
                13463,
                13520
            ],
            [
                13520,
                13585
            ],
            [
                13585,
                13615
            ],
            [
                13615,
                13663
            ],
            [
                13663,
                13707
            ],
            [
                13707,
                13759
            ],
            [
                13759,
                13851
            ],
            [
                13851,
                13967
            ],
            [
                13967,
                14045
            ],
            [
                14045,
                14077
            ],
            [
                14077,
                14098
            ],
            [
                14098,
                14120
            ],
            [
                14120,
                14182
            ],
            [
                14182,
                14224
            ],
            [
                14224,
                14236
            ],
            [
                14236,
                14284
            ],
            [
                14284,
                14370
            ],
            [
                14370,
                14418
            ],
            [
                14418,
                14474
            ],
            [
                14474,
                14561
            ],
            [
                14561,
                14585
            ],
            [
                14585,
                14608
            ],
            [
                14608,
                14633
            ],
            [
                14633,
                14666
            ],
            [
                14666,
                14728
            ],
            [
                14728,
                14747
            ],
            [
                14747,
                14786
            ],
            [
                14786,
                14830
            ],
            [
                14830,
                14853
            ],
            [
                14853,
                14908
            ],
            [
                14908,
                14913
            ],
            [
                14913,
                14956
            ],
            [
                14956,
                15088
            ],
            [
                15088,
                15125
            ],
            [
                15125,
                15139
            ],
            [
                15139,
                15158
            ],
            [
                15158,
                15241
            ],
            [
                15241,
                15305
            ],
            [
                15305,
                15324
            ],
            [
                15324,
                15370
            ],
            [
                15370,
                15405
            ],
            [
                15405,
                15454
            ],
            [
                15454,
                15486
            ],
            [
                15486,
                15505
            ],
            [
                15505,
                15559
            ],
            [
                15559,
                15673
            ],
            [
                15673,
                15748
            ],
            [
                15748,
                15769
            ],
            [
                15769,
                15802
            ],
            [
                15802,
                15831
            ],
            [
                15831,
                15853
            ],
            [
                15853,
                15917
            ],
            [
                15917,
                15969
            ],
            [
                15969,
                16001
            ],
            [
                16001,
                16109
            ],
            [
                16109,
                16194
            ],
            [
                16194,
                16224
            ],
            [
                16224,
                16289
            ],
            [
                16289,
                16337
            ],
            [
                16337,
                16406
            ],
            [
                16406,
                16488
            ],
            [
                16488,
                16529
            ],
            [
                16529,
                16565
            ],
            [
                16565,
                16660
            ],
            [
                16660,
                16679
            ],
            [
                16679,
                16726
            ],
            [
                16726,
                16741
            ],
            [
                16741,
                16771
            ],
            [
                16771,
                16888
            ],
            [
                16888,
                16914
            ],
            [
                16914,
                16964
            ],
            [
                16964,
                17057
            ],
            [
                17057,
                17153
            ],
            [
                17153,
                17170
            ],
            [
                17170,
                17195
            ],
            [
                17195,
                17334
            ],
            [
                17334,
                17362
            ],
            [
                17362,
                17380
            ],
            [
                17380,
                17416
            ],
            [
                17416,
                17598
            ],
            [
                17598,
                17650
            ],
            [
                17650,
                17757
            ],
            [
                17757,
                17794
            ],
            [
                17794,
                17825
            ],
            [
                17825,
                17911
            ],
            [
                17911,
                17966
            ],
            [
                17966,
                18031
            ],
            [
                18031,
                18166
            ],
            [
                18166,
                18327
            ],
            [
                18327,
                18353
            ],
            [
                18353,
                18379
            ],
            [
                18379,
                18415
            ],
            [
                18415,
                18462
            ],
            [
                18462,
                18716
            ],
            [
                18716,
                18788
            ],
            [
                18788,
                18904
            ],
            [
                18904,
                19071
            ],
            [
                19071,
                19379
            ],
            [
                19379,
                19415
            ],
            [
                19415,
                19439
            ],
            [
                19439,
                19506
            ],
            [
                19506,
                19570
            ],
            [
                19570,
                19744
            ],
            [
                19744,
                19799
            ],
            [
                19799,
                19829
            ],
            [
                19829,
                19876
            ],
            [
                19876,
                19955
            ],
            [
                19955,
                19984
            ],
            [
                19984,
                20069
            ],
            [
                20069,
                20150
            ],
            [
                20150,
                20184
            ],
            [
                20184,
                20355
            ],
            [
                20355,
                20406
            ],
            [
                20406,
                20659
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                37,
                40
            ],
            [
                57,
                64
            ],
            [
                93,
                97
            ],
            [
                69,
                72
            ],
            [
                98,
                132
            ],
            [
                141,
                159
            ],
            [
                159,
                194
            ],
            [
                227,
                254
            ],
            [
                309,
                322
            ],
            [
                339,
                385
            ],
            [
                442,
                465
            ],
            [
                465,
                506
            ],
            [
                510,
                528
            ],
            [
                530,
                546
            ],
            [
                546,
                640
            ],
            [
                663,
                668
            ],
            [
                670,
                673
            ],
            [
                687,
                707
            ],
            [
                771,
                773
            ],
            [
                849,
                855
            ],
            [
                860,
                868
            ],
            [
                871,
                876
            ],
            [
                920,
                939
            ],
            [
                939,
                941
            ],
            [
                941,
                955
            ],
            [
                963,
                983
            ],
            [
                983,
                1033
            ],
            [
                1042,
                1045
            ],
            [
                1045,
                1124
            ],
            [
                1124,
                1153
            ],
            [
                1153,
                1181
            ],
            [
                1181,
                1192
            ],
            [
                1193,
                1211
            ],
            [
                1211,
                1233
            ],
            [
                1390,
                1391
            ],
            [
                1265,
                1279
            ],
            [
                1285,
                1323
            ],
            [
                1328,
                1352
            ],
            [
                1369,
                1390
            ],
            [
                1393,
                1446
            ],
            [
                1446,
                1450
            ],
            [
                1505,
                1524
            ],
            [
                1458,
                1460
            ],
            [
                1544,
                1582
            ],
            [
                1587,
                1592
            ],
            [
                1607,
                1609
            ],
            [
                1674,
                1680
            ],
            [
                1698,
                1711
            ],
            [
                1728,
                1772
            ],
            [
                1643,
                1645
            ],
            [
                1778,
                1790
            ],
            [
                1829,
                1831
            ],
            [
                1831,
                1894
            ],
            [
                1964,
                1971
            ],
            [
                1979,
                2008
            ],
            [
                2008,
                2058
            ],
            [
                2061,
                2092
            ],
            [
                2174,
                2203
            ],
            [
                2203,
                2211
            ],
            [
                2333,
                2335
            ],
            [
                2640,
                2643
            ],
            [
                2661,
                2684
            ],
            [
                2684,
                2755
            ],
            [
                2757,
                2775
            ],
            [
                2775,
                2799
            ],
            [
                2799,
                2814
            ],
            [
                2814,
                2827
            ],
            [
                2828,
                2850
            ],
            [
                2980,
                3027
            ],
            [
                3048,
                3051
            ],
            [
                3051,
                3073
            ],
            [
                3073,
                3085
            ],
            [
                3093,
                3098
            ],
            [
                3105,
                3139
            ],
            [
                3139,
                3193
            ],
            [
                3197,
                3209
            ],
            [
                3209,
                3257
            ],
            [
                3257,
                3341
            ],
            [
                3341,
                3351
            ],
            [
                3368,
                3371
            ],
            [
                3371,
                3402
            ],
            [
                3410,
                3413
            ],
            [
                3413,
                3444
            ],
            [
                3444,
                3493
            ],
            [
                3493,
                3515
            ],
            [
                3515,
                3553
            ],
            [
                3553,
                3619
            ],
            [
                3624,
                3635
            ],
            [
                3635,
                3695
            ],
            [
                3730,
                3805
            ],
            [
                3805,
                3808
            ],
            [
                3906,
                3929
            ],
            [
                3935,
                3948
            ],
            [
                3826,
                3829
            ],
            [
                3970,
                3999
            ],
            [
                3878,
                3880
            ],
            [
                4000,
                4019
            ],
            [
                4075,
                4124
            ],
            [
                4175,
                4182
            ],
            [
                4188,
                4199
            ],
            [
                4199,
                4257
            ],
            [
                4257,
                4258
            ],
            [
                4263,
                4276
            ],
            [
                4302,
                4304
            ],
            [
                4546,
                4573
            ],
            [
                4582,
                4584
            ],
            [
                4584,
                4629
            ],
            [
                4726,
                4806
            ],
            [
                4806,
                4840
            ],
            [
                4902,
                4905
            ],
            [
                4916,
                4951
            ],
            [
                4951,
                4976
            ],
            [
                4976,
                4994
            ],
            [
                4994,
                5068
            ],
            [
                5088,
                5089
            ],
            [
                5117,
                5137
            ],
            [
                5166,
                5206
            ],
            [
                5206,
                5234
            ],
            [
                5234,
                5260
            ],
            [
                5260,
                5311
            ],
            [
                5391,
                5395
            ],
            [
                5401,
                5404
            ],
            [
                5404,
                5415
            ],
            [
                5432,
                5472
            ],
            [
                5472,
                5480
            ],
            [
                5486,
                5505
            ],
            [
                5505,
                5590
            ],
            [
                5590,
                5743
            ],
            [
                5743,
                5787
            ],
            [
                5843,
                5862
            ],
            [
                5801,
                5802
            ],
            [
                6001,
                6046
            ],
            [
                6064,
                6090
            ],
            [
                6117,
                6147
            ],
            [
                6147,
                6180
            ],
            [
                6180,
                6189
            ],
            [
                6233,
                6239
            ],
            [
                6190,
                6228
            ],
            [
                6269,
                6271
            ],
            [
                6271,
                6276
            ],
            [
                6281,
                6308
            ],
            [
                6313,
                6336
            ],
            [
                6349,
                6380
            ],
            [
                6381,
                6411
            ],
            [
                6426,
                6466
            ],
            [
                6466,
                6510
            ],
            [
                6569,
                6571
            ],
            [
                6571,
                6601
            ],
            [
                6601,
                6623
            ],
            [
                6625,
                6693
            ],
            [
                6693,
                6759
            ],
            [
                6788,
                6790
            ],
            [
                6790,
                6797
            ],
            [
                6817,
                6844
            ],
            [
                6844,
                6852
            ],
            [
                6859,
                6887
            ],
            [
                6887,
                6914
            ],
            [
                6964,
                6988
            ],
            [
                7032,
                7047
            ],
            [
                7047,
                7051
            ],
            [
                7055,
                7104
            ],
            [
                7104,
                7144
            ],
            [
                7255,
                7290
            ],
            [
                7294,
                7303
            ],
            [
                7312,
                7336
            ],
            [
                7336,
                7383
            ],
            [
                7384,
                7396
            ],
            [
                7445,
                7501
            ],
            [
                7519,
                7529
            ],
            [
                7628,
                7644
            ],
            [
                7651,
                7719
            ],
            [
                7726,
                7834
            ],
            [
                7834,
                7865
            ],
            [
                7943,
                7958
            ],
            [
                7962,
                7966
            ],
            [
                7914,
                7920
            ],
            [
                7966,
                7968
            ],
            [
                8051,
                8068
            ],
            [
                8068,
                8097
            ],
            [
                8097,
                8151
            ],
            [
                8151,
                8163
            ],
            [
                8178,
                8227
            ],
            [
                8276,
                8289
            ],
            [
                8290,
                8296
            ],
            [
                8306,
                8321
            ],
            [
                8321,
                8358
            ],
            [
                8360,
                8381
            ],
            [
                8391,
                8427
            ],
            [
                8525,
                8526
            ],
            [
                8430,
                8463
            ],
            [
                8532,
                8562
            ],
            [
                8671,
                8676
            ],
            [
                8739,
                8805
            ],
            [
                8817,
                8825
            ],
            [
                8825,
                8827
            ],
            [
                8866,
                8958
            ],
            [
                8958,
                8977
            ],
            [
                8977,
                8979
            ],
            [
                8983,
                9030
            ],
            [
                9030,
                9072
            ],
            [
                9819,
                9830
            ],
            [
                9849,
                9866
            ],
            [
                10045,
                10047
            ],
            [
                10052,
                10133
            ],
            [
                10134,
                10214
            ],
            [
                10215,
                10284
            ],
            [
                10290,
                10292
            ],
            [
                10302,
                10320
            ],
            [
                10322,
                10338
            ],
            [
                10384,
                10386
            ],
            [
                10386,
                10389
            ],
            [
                10421,
                10425
            ],
            [
                10431,
                10477
            ],
            [
                10477,
                10563
            ],
            [
                10563,
                10574
            ],
            [
                10611,
                10664
            ],
            [
                10676,
                10678
            ],
            [
                10678,
                10686
            ],
            [
                10696,
                10712
            ],
            [
                10779,
                10780
            ],
            [
                10834,
                10871
            ],
            [
                10871,
                10872
            ],
            [
                10894,
                10938
            ],
            [
                10954,
                10982
            ],
            [
                10982,
                10987
            ],
            [
                10998,
                11054
            ],
            [
                11054,
                11090
            ],
            [
                11090,
                11125
            ],
            [
                11127,
                11151
            ],
            [
                11164,
                11173
            ],
            [
                11189,
                11292
            ],
            [
                11292,
                11338
            ],
            [
                11430,
                11434
            ],
            [
                11448,
                11509
            ],
            [
                11509,
                11541
            ],
            [
                11541,
                11543
            ],
            [
                11586,
                11674
            ],
            [
                11888,
                11939
            ],
            [
                11939,
                11971
            ],
            [
                11971,
                12000
            ],
            [
                12000,
                12027
            ],
            [
                12027,
                12122
            ],
            [
                12149,
                12158
            ],
            [
                12126,
                12128
            ],
            [
                12159,
                12175
            ],
            [
                12175,
                12270
            ],
            [
                12349,
                12402
            ],
            [
                12402,
                12429
            ],
            [
                12429,
                12445
            ],
            [
                12445,
                12538
            ],
            [
                12541,
                12564
            ],
            [
                12576,
                12583
            ],
            [
                12601,
                12624
            ],
            [
                12624,
                12697
            ],
            [
                12697,
                12723
            ],
            [
                12730,
                12748
            ],
            [
                12748,
                12812
            ],
            [
                12812,
                12838
            ],
            [
                12901,
                12917
            ],
            [
                12917,
                12952
            ],
            [
                12952,
                12971
            ],
            [
                12977,
                12990
            ],
            [
                12990,
                13047
            ],
            [
                13047,
                13169
            ],
            [
                13169,
                13215
            ],
            [
                13215,
                13216
            ],
            [
                13230,
                13269
            ],
            [
                13269,
                13309
            ],
            [
                13309,
                13363
            ],
            [
                13363,
                13390
            ],
            [
                13390,
                13463
            ],
            [
                13463,
                13466
            ],
            [
                13518,
                13520
            ],
            [
                13520,
                13585
            ],
            [
                13585,
                13615
            ],
            [
                13615,
                13632
            ],
            [
                13663,
                13707
            ],
            [
                13707,
                13759
            ],
            [
                13759,
                13782
            ],
            [
                13829,
                13851
            ],
            [
                13851,
                13894
            ],
            [
                13928,
                13966
            ],
            [
                13967,
                14045
            ],
            [
                14045,
                14077
            ],
            [
                14077,
                14098
            ],
            [
                14098,
                14120
            ],
            [
                14120,
                14182
            ],
            [
                14182,
                14224
            ],
            [
                14224,
                14236
            ],
            [
                14284,
                14321
            ],
            [
                14330,
                14357
            ],
            [
                14359,
                14370
            ],
            [
                14370,
                14418
            ],
            [
                14418,
                14474
            ],
            [
                14474,
                14491
            ],
            [
                14501,
                14529
            ],
            [
                14536,
                14538
            ],
            [
                14530,
                14535
            ],
            [
                14539,
                14544
            ],
            [
                14555,
                14561
            ],
            [
                14561,
                14585
            ],
            [
                14585,
                14596
            ],
            [
                14601,
                14608
            ],
            [
                14633,
                14666
            ],
            [
                14666,
                14728
            ],
            [
                14728,
                14747
            ],
            [
                14747,
                14786
            ],
            [
                14786,
                14810
            ],
            [
                14812,
                14830
            ],
            [
                14830,
                14833
            ],
            [
                14839,
                14843
            ],
            [
                14850,
                14853
            ],
            [
                14853,
                14908
            ],
            [
                14908,
                14913
            ],
            [
                14931,
                14954
            ],
            [
                14992,
                15012
            ],
            [
                14956,
                14957
            ],
            [
                15013,
                15018
            ],
            [
                15086,
                15088
            ],
            [
                15088,
                15125
            ],
            [
                15125,
                15135
            ],
            [
                15139,
                15158
            ],
            [
                15158,
                15241
            ],
            [
                15241,
                15270
            ],
            [
                15272,
                15305
            ],
            [
                15305,
                15324
            ],
            [
                15324,
                15370
            ],
            [
                15370,
                15405
            ],
            [
                15405,
                15425
            ],
            [
                15436,
                15448
            ],
            [
                15452,
                15454
            ],
            [
                15454,
                15486
            ],
            [
                15486,
                15505
            ],
            [
                15530,
                15532
            ],
            [
                15536,
                15559
            ],
            [
                15559,
                15624
            ],
            [
                15626,
                15635
            ],
            [
                15663,
                15673
            ],
            [
                15673,
                15714
            ],
            [
                15734,
                15748
            ],
            [
                15748,
                15763
            ],
            [
                15767,
                15769
            ],
            [
                15769,
                15770
            ],
            [
                15772,
                15779
            ],
            [
                15802,
                15831
            ],
            [
                15831,
                15853
            ],
            [
                15853,
                15917
            ],
            [
                16109,
                16124
            ],
            [
                16130,
                16140
            ],
            [
                16161,
                16194
            ],
            [
                16194,
                16200
            ],
            [
                16208,
                16211
            ],
            [
                16218,
                16224
            ],
            [
                16289,
                16294
            ],
            [
                16300,
                16301
            ],
            [
                16295,
                16300
            ],
            [
                16307,
                16337
            ],
            [
                16337,
                16406
            ],
            [
                16406,
                16488
            ],
            [
                16488,
                16529
            ],
            [
                16529,
                16551
            ],
            [
                16554,
                16565
            ],
            [
                16565,
                16569
            ],
            [
                16597,
                16634
            ],
            [
                16637,
                16660
            ],
            [
                16660,
                16679
            ],
            [
                16679,
                16683
            ],
            [
                16691,
                16697
            ],
            [
                16704,
                16726
            ],
            [
                16726,
                16741
            ],
            [
                16741,
                16771
            ],
            [
                16771,
                16772
            ],
            [
                16823,
                16827
            ],
            [
                16853,
                16864
            ],
            [
                16869,
                16875
            ],
            [
                16886,
                16888
            ],
            [
                16888,
                16912
            ],
            [
                16927,
                16964
            ],
            [
                16964,
                17002
            ],
            [
                17008,
                17029
            ],
            [
                17033,
                17045
            ],
            [
                17055,
                17057
            ],
            [
                17057,
                17085
            ],
            [
                17111,
                17112
            ],
            [
                17134,
                17153
            ],
            [
                17153,
                17170
            ],
            [
                17170,
                17175
            ],
            [
                17179,
                17195
            ],
            [
                17334,
                17362
            ],
            [
                17362,
                17380
            ],
            [
                17380,
                17416
            ],
            [
                17444,
                17455
            ],
            [
                17581,
                17587
            ],
            [
                17465,
                17466
            ],
            [
                17456,
                17459
            ],
            [
                17517,
                17559
            ],
            [
                17757,
                17790
            ],
            [
                17794,
                17825
            ],
            [
                17911,
                17953
            ],
            [
                17964,
                17966
            ],
            [
                17966,
                18031
            ],
            [
                18031,
                18166
            ],
            [
                18170,
                18178
            ],
            [
                18166,
                18169
            ],
            [
                18179,
                18306
            ],
            [
                18724,
                18744
            ],
            [
                18786,
                18788
            ],
            [
                18904,
                18950
            ],
            [
                18962,
                18983
            ],
            [
                18992,
                19003
            ],
            [
                19027,
                19035
            ],
            [
                19035,
                19071
            ],
            [
                19071,
                19092
            ],
            [
                19108,
                19139
            ],
            [
                19144,
                19158
            ],
            [
                19377,
                19379
            ],
            [
                19439,
                19467
            ],
            [
                19472,
                19506
            ],
            [
                19506,
                19554
            ],
            [
                19568,
                19570
            ],
            [
                19570,
                19625
            ],
            [
                19657,
                19662
            ],
            [
                19984,
                19993
            ],
            [
                19670,
                19674
            ],
            [
                19994,
                20011
            ],
            [
                19742,
                19743
            ],
            [
                20028,
                20069
            ],
            [
                20262,
                20274
            ],
            [
                20193,
                20202
            ],
            [
                20318,
                20320
            ],
            [
                20282,
                20287
            ],
            [
                20340,
                20355
            ],
            [
                20355,
                20406
            ],
            [
                20406,
                20415
            ],
            [
                20420,
                20629
            ],
            [
                20633,
                20659
            ]
        ],
        "row_chars": [
            [
                0,
                159
            ],
            [
                159,
                465
            ],
            [
                465,
                510
            ],
            [
                510,
                546
            ],
            [
                546,
                773
            ],
            [
                773,
                849
            ],
            [
                849,
                941
            ],
            [
                941,
                983
            ],
            [
                983,
                1045
            ],
            [
                1045,
                1124
            ],
            [
                1124,
                1153
            ],
            [
                1153,
                1181
            ],
            [
                1181,
                1211
            ],
            [
                1211,
                1446
            ],
            [
                1446,
                1609
            ],
            [
                1609,
                1831
            ],
            [
                1831,
                2008
            ],
            [
                2008,
                2094
            ],
            [
                2094,
                2142
            ],
            [
                2142,
                2174
            ],
            [
                2174,
                2203
            ],
            [
                2203,
                2335
            ],
            [
                2335,
                2409
            ],
            [
                2409,
                2488
            ],
            [
                2488,
                2547
            ],
            [
                2547,
                2640
            ],
            [
                2640,
                2684
            ],
            [
                2684,
                2775
            ],
            [
                2775,
                2799
            ],
            [
                2799,
                2814
            ],
            [
                2814,
                2850
            ],
            [
                2850,
                2980
            ],
            [
                2980,
                3051
            ],
            [
                3051,
                3073
            ],
            [
                3073,
                3139
            ],
            [
                3139,
                3209
            ],
            [
                3209,
                3257
            ],
            [
                3257,
                3371
            ],
            [
                3371,
                3413
            ],
            [
                3413,
                3444
            ],
            [
                3444,
                3493
            ],
            [
                3493,
                3515
            ],
            [
                3515,
                3553
            ],
            [
                3553,
                3635
            ],
            [
                3635,
                3805
            ],
            [
                3805,
                4019
            ],
            [
                4019,
                4070
            ],
            [
                4070,
                4199
            ],
            [
                4199,
                4257
            ],
            [
                4257,
                4304
            ],
            [
                4304,
                4417
            ],
            [
                4417,
                4449
            ],
            [
                4449,
                4508
            ],
            [
                4508,
                4546
            ],
            [
                4546,
                4584
            ],
            [
                4584,
                4629
            ],
            [
                4629,
                4726
            ],
            [
                4726,
                4806
            ],
            [
                4806,
                4840
            ],
            [
                4840,
                4902
            ],
            [
                4902,
                4951
            ],
            [
                4951,
                4976
            ],
            [
                4976,
                4994
            ],
            [
                4994,
                5068
            ],
            [
                5068,
                5140
            ],
            [
                5140,
                5165
            ],
            [
                5165,
                5206
            ],
            [
                5206,
                5234
            ],
            [
                5234,
                5260
            ],
            [
                5260,
                5313
            ],
            [
                5313,
                5391
            ],
            [
                5391,
                5404
            ],
            [
                5404,
                5472
            ],
            [
                5472,
                5505
            ],
            [
                5505,
                5590
            ],
            [
                5590,
                5743
            ],
            [
                5743,
                5865
            ],
            [
                5865,
                5916
            ],
            [
                5916,
                5932
            ],
            [
                5932,
                5953
            ],
            [
                5953,
                6001
            ],
            [
                6001,
                6147
            ],
            [
                6147,
                6180
            ],
            [
                6180,
                6271
            ],
            [
                6271,
                6308
            ],
            [
                6308,
                6381
            ],
            [
                6381,
                6466
            ],
            [
                6466,
                6571
            ],
            [
                6571,
                6601
            ],
            [
                6601,
                6693
            ],
            [
                6693,
                6790
            ],
            [
                6790,
                6844
            ],
            [
                6844,
                6887
            ],
            [
                6887,
                7047
            ],
            [
                7047,
                7104
            ],
            [
                7104,
                7144
            ],
            [
                7144,
                7197
            ],
            [
                7197,
                7255
            ],
            [
                7255,
                7336
            ],
            [
                7336,
                7396
            ],
            [
                7396,
                7529
            ],
            [
                7529,
                7624
            ],
            [
                7624,
                7834
            ],
            [
                7834,
                7866
            ],
            [
                7866,
                7968
            ],
            [
                7968,
                7981
            ],
            [
                7981,
                8007
            ],
            [
                8007,
                8051
            ],
            [
                8051,
                8068
            ],
            [
                8068,
                8097
            ],
            [
                8097,
                8151
            ],
            [
                8151,
                8229
            ],
            [
                8229,
                8276
            ],
            [
                8276,
                8321
            ],
            [
                8321,
                8562
            ],
            [
                8562,
                8617
            ],
            [
                8617,
                8671
            ],
            [
                8671,
                8676
            ],
            [
                8676,
                8700
            ],
            [
                8700,
                8739
            ],
            [
                8739,
                8827
            ],
            [
                8827,
                8866
            ],
            [
                8866,
                8958
            ],
            [
                8958,
                8977
            ],
            [
                8977,
                9030
            ],
            [
                9030,
                9072
            ],
            [
                9072,
                9102
            ],
            [
                9102,
                9147
            ],
            [
                9147,
                9226
            ],
            [
                9226,
                9264
            ],
            [
                9264,
                9327
            ],
            [
                9327,
                9473
            ],
            [
                9473,
                9621
            ],
            [
                9621,
                9696
            ],
            [
                9696,
                9738
            ],
            [
                9738,
                9819
            ],
            [
                9819,
                10047
            ],
            [
                10047,
                10134
            ],
            [
                10134,
                10215
            ],
            [
                10215,
                10386
            ],
            [
                10386,
                10477
            ],
            [
                10477,
                10563
            ],
            [
                10563,
                10678
            ],
            [
                10678,
                10781
            ],
            [
                10781,
                10834
            ],
            [
                10834,
                10982
            ],
            [
                10982,
                11054
            ],
            [
                11054,
                11090
            ],
            [
                11090,
                11173
            ],
            [
                11173,
                11292
            ],
            [
                11292,
                11338
            ],
            [
                11338,
                11428
            ],
            [
                11428,
                11509
            ],
            [
                11509,
                11543
            ],
            [
                11543,
                11586
            ],
            [
                11586,
                11677
            ],
            [
                11677,
                11692
            ],
            [
                11692,
                11778
            ],
            [
                11778,
                11846
            ],
            [
                11846,
                11888
            ],
            [
                11888,
                11939
            ],
            [
                11939,
                11971
            ],
            [
                11971,
                12000
            ],
            [
                12000,
                12027
            ],
            [
                12027,
                12175
            ],
            [
                12175,
                12273
            ],
            [
                12273,
                12287
            ],
            [
                12287,
                12348
            ],
            [
                12348,
                12402
            ],
            [
                12402,
                12429
            ],
            [
                12429,
                12445
            ],
            [
                12445,
                12624
            ],
            [
                12624,
                12697
            ],
            [
                12697,
                12748
            ],
            [
                12748,
                12812
            ],
            [
                12812,
                12917
            ],
            [
                12917,
                12952
            ],
            [
                12952,
                12990
            ],
            [
                12990,
                13047
            ],
            [
                13047,
                13169
            ],
            [
                13169,
                13215
            ],
            [
                13215,
                13269
            ],
            [
                13269,
                13309
            ],
            [
                13309,
                13363
            ],
            [
                13363,
                13390
            ],
            [
                13390,
                13463
            ],
            [
                13463,
                13520
            ],
            [
                13520,
                13585
            ],
            [
                13585,
                13615
            ],
            [
                13615,
                13707
            ],
            [
                13707,
                13759
            ],
            [
                13759,
                13851
            ],
            [
                13851,
                13967
            ],
            [
                13967,
                14045
            ],
            [
                14045,
                14077
            ],
            [
                14077,
                14098
            ],
            [
                14098,
                14120
            ],
            [
                14120,
                14182
            ],
            [
                14182,
                14224
            ],
            [
                14224,
                14236
            ],
            [
                14236,
                14284
            ],
            [
                14284,
                14370
            ],
            [
                14370,
                14418
            ],
            [
                14418,
                14474
            ],
            [
                14474,
                14561
            ],
            [
                14561,
                14585
            ],
            [
                14585,
                14608
            ],
            [
                14608,
                14633
            ],
            [
                14633,
                14666
            ],
            [
                14666,
                14728
            ],
            [
                14728,
                14747
            ],
            [
                14747,
                14786
            ],
            [
                14786,
                14830
            ],
            [
                14830,
                14853
            ],
            [
                14853,
                14908
            ],
            [
                14908,
                14913
            ],
            [
                14913,
                15088
            ],
            [
                15088,
                15125
            ],
            [
                15125,
                15139
            ],
            [
                15139,
                15158
            ],
            [
                15158,
                15241
            ],
            [
                15241,
                15305
            ],
            [
                15305,
                15324
            ],
            [
                15324,
                15370
            ],
            [
                15370,
                15405
            ],
            [
                15405,
                15454
            ],
            [
                15454,
                15486
            ],
            [
                15486,
                15505
            ],
            [
                15505,
                15559
            ],
            [
                15559,
                15673
            ],
            [
                15673,
                15748
            ],
            [
                15748,
                15769
            ],
            [
                15769,
                15831
            ],
            [
                15831,
                15853
            ],
            [
                15853,
                15917
            ],
            [
                15917,
                15969
            ],
            [
                15969,
                16001
            ],
            [
                16001,
                16109
            ],
            [
                16109,
                16194
            ],
            [
                16194,
                16224
            ],
            [
                16224,
                16289
            ],
            [
                16289,
                16337
            ],
            [
                16337,
                16406
            ],
            [
                16406,
                16488
            ],
            [
                16488,
                16529
            ],
            [
                16529,
                16565
            ],
            [
                16565,
                16660
            ],
            [
                16660,
                16679
            ],
            [
                16679,
                16726
            ],
            [
                16726,
                16741
            ],
            [
                16741,
                16771
            ],
            [
                16771,
                16888
            ],
            [
                16888,
                16964
            ],
            [
                16964,
                17057
            ],
            [
                17057,
                17153
            ],
            [
                17153,
                17170
            ],
            [
                17170,
                17195
            ],
            [
                17195,
                17334
            ],
            [
                17334,
                17362
            ],
            [
                17362,
                17380
            ],
            [
                17380,
                17416
            ],
            [
                17416,
                17598
            ],
            [
                17598,
                17650
            ],
            [
                17650,
                17757
            ],
            [
                17757,
                17794
            ],
            [
                17794,
                17825
            ],
            [
                17825,
                17911
            ],
            [
                17911,
                17966
            ],
            [
                17966,
                18031
            ],
            [
                18031,
                18166
            ],
            [
                18166,
                18327
            ],
            [
                18327,
                18353
            ],
            [
                18353,
                18379
            ],
            [
                18379,
                18415
            ],
            [
                18415,
                18462
            ],
            [
                18462,
                18716
            ],
            [
                18716,
                18788
            ],
            [
                18788,
                18904
            ],
            [
                18904,
                19071
            ],
            [
                19071,
                19379
            ],
            [
                19379,
                19415
            ],
            [
                19415,
                19439
            ],
            [
                19439,
                19506
            ],
            [
                19506,
                19570
            ],
            [
                19570,
                20069
            ],
            [
                20069,
                20150
            ],
            [
                20150,
                20184
            ],
            [
                20184,
                20355
            ],
            [
                20355,
                20406
            ],
            [
                20406,
                20659
            ]
        ]
    },
    "abridged": {
        "text": "\"George,\" said Kate as she approached them, \"have you been preparing all your things for sale by auction?\" Then she stole a look at Alice, and gathering that something had occurred, she went on rapidly, as though to cover Alice's confusion, \"Would you believe it? he had three razors laid out on his table-\"\n\"A man must shave, even at Basle.\"\n\"But not with three razors at once; and three hair-brushes, and half a dozen toothbrushes, and several combs and little glass bottles. I have packed them all; but now you are responsible for them. And I will not pack your boots, George. What can you have wanted with three pairs of boots?\"\n\"When you have completed the list of my wardrobe we'll go out upon the bridge. That is, if Alice likes it.\"\n\"Oh, yes; I shall like it.\"\n\"Come along, then,\" said Kate. And so they moved away, Alice and Kate together, while George strolled behind, close to them, but not joining in their conversation - as though he had merely gone with them as an escort. Kate was chattering to Alice to show that there was nothing serious on their minds. George followed them with his hands behind his back, looking down at the pavement.\n\"Do you know,\" said Kate, \"I have a very great mind to run away - perhaps to the little inn at Handek. It's a lonely place, where nobody would hear of me - and I should have the waterfall.\"\n\"But why run away just now?\"\n\"I won't. But I do dread going home. You are going to John Grey, which may be pleasant enough; but I'm going to Aunt Greenow.\"\n\"It's your own choice.\"\n\"No, it's not. I haven't any real choice in the matter. Fancy a month at Yarmouth with no companion but her!\"\n\"I shouldn't mind it. Aunt Greenow seems to be a very good sort of woman.\"\n\"She may be a good woman, but I must say I think she's a bad sort. You've never heard her talk about her husband?\"\n\"No, never; I think she did cry a little the first day she came to Queen Anne Street after he died, but that was natural.\"\n\"He was thirty years older than her.\"\n\"But still he was her husband. And even if her tears are assumed, what of that? What's a woman to do? Of course she was wrong to marry him. She was thirty-five, and had nothing, while he was sixty-five, and very rich. But according to all accounts she made him a very good wife, and you wouldn't have her go about laughing within three months of his death.\"\n\"No; but she needn't be so outrageous in wearing her mourning, or so very careful that her widow's caps are becoming. Her eyes are always red with weeping, and yet she is ready to flutter her eyelids at any man she sees.\"\n\"Then why have you consented to go to Yarmouth with her?\"\n\"Because she's rich. It's the fault of the world. Does anybody ever drop their rich relatives? When I told George, wasn't it natural that he should say, 'Oh, go by all means. She's got forty thousand pounds!' And what can I expect from her money?\"\n\"Nothing, I should say.\"\n\"Not a halfpenny. I'm nearly thirty and she's only forty, and of course she'll marry again. As for me, nobody cares less for money. Yet one sticks to one's rich relatives. It's the way of the world.\" Then she paused a moment. \"But shall I tell you, Alice, why I do stick to her?\"\n\"Why?\"\n\"Because it's possible that she may help George in his career. I do not need money, but he may. And for such purposes as his, I think it fair that all the family should contribute. I feel sure that he would make a name for himself in Parliament; and if I had my way I would spend every shilling of Vavasor money in putting him there. When I told the squire so I thought he would turn me out of the house. He swore at me; and then he was so unhappy at swearing that he came and kissed me and gave me a ten-pound note. What do you think I did with it? I sent it to George as a contribution to the next election. Don't tell him that I told you.\"\nThey stopped and leaned over the parapet of the bridge.\n\"Come here, George,\" said Kate, making room for him between herself and Alice. \"Wouldn't you like to be swimming down there? The water looks so enticing.\"\n\"I can't say I should; unless it might be a pleasant way of swimming into the next world.\"\n\"I should so like to feel myself going with the stream,\" said Kate. \"I can't imagine that I should be drowned.\"\n\"I can't imagine anything else,\" said Alice.\n\"It would be so pleasant to be carried away headlong to Rotterdam.\"\n\"And arrive there without your clothes,\" said George.\n\"They would be brought after in a boat. The water looks so clear and bright in the moonlight, and the sound of it is so soft! The sea at Yarmouth won't be anything like that, I suppose.\"\nShe went on talking about the river, and their aunt, and Yarmouth. Still they stood looking down upon the river, and every now and then Kate's voice was heard, preventing the feeling which might otherwise have arisen that their hearts were too full for speech.\nAt last Alice seemed to shiver.\n\"You are cold,\" said George.\n\"It wasn't that. I was thinking of something. Don't you ever think of things that make you shiver?\"\n\"Indeed I do - so often that I have to do my shiverings inwardly.\"\n\"I don't mean important things,\" said Alice. \"Little bits of things make me do it; perhaps a word that I ought not to have said ten years ago. The most ordinary little mistakes are always making me shiver.\"\n\"Ah! When I think of a chance I've let go by, as I have thousands, then I shiver - but inwardly. I've been in one long shiver ever since we came out because of one chance that I let go by. Come, we'll go in. We have to be up at five o'clock, and now it's eleven. I'll do the rest of my shivering in bed.\"\nThey walked back to the hotel. On the stairs George handed Alice her candle, and as he did so he whispered a few words to her.\n\"My shivering fit has to come yet,\" said he, \"and will last me the whole night.\"\nShe would have given much to be able to answer him lightly, as though he had meant nothing; but she couldn't. She went to her own room without answering him at all. Here she sat down at the window looking out upon the river till Kate should join her. Their rooms adjoined, and she would not begin her packing till her cousin came.\nBut Kate was with her brother.\n\"If you'll take my advice,\" said Kate to him, with her candle in her hand, \"you'll ask her to give you another chance. Do it tomorrow at Strasbourg; you'll never have a better opportunity.\"\n\"And bid her throw John Grey over!\"\n\"Don't say anything about John Grey. Leave her to settle that herself. She has quite courage enough to dispose of John Grey, if she has courage enough to accept your offer.\"\n\"Kate, you women never understand each other. She must find out first that she wishes to be rid of her engagement.\"\n\"She has found that out long ago, I am sure of it. But if you can't bring yourself to speak to her, she'll marry him in spite of her wishes. You must be glad to find that she still loves you. You still love her, I suppose?\"\n\"Upon my word I don't know.\"\n\"Don't provoke me, George. I'm moving heaven and earth to bring you two together; but if I didn't think you loved her, I'd tell her never to see you again.\"\n\"Upon my word, Kate, I sometimes think it would be better if you'd leave heaven and earth alone. Why shouldn't she marry John Grey if she likes him?\"\n\"But she doesn't like him. And I hate him. I hate the sound of his voice, and the turn of his eye, and that slow, steady movement of his - as though he was always reminding himself not to wear out his clothes.\"\n\"I don't see that your hating him ought to have anything to do with it.\"\n\"If you're going to preach, I'll leave you. It's the darling wish of my heart that she should be your wife. If you ever loved anybody, you loved her.\"\n\"Did and do are different things.\"\n\"Very well, George; I have done. It has been the same in every twist and turn of my life. In everything that I have striven to do for you, you have thrown yourself over, in order that I might be thrown over too. But I believe you say this merely to vex me.\"\n\"Kate, I think you'd better go to bed.\"\n\"But not till I've told her everything. I won't leave her to be deceived and ill-used again.\"\n\"Who is ill-using her now? Is it not the worst of ill-usage, trying to separate her from that man?\"\n\"No. She would be miserable with him, and make him miserable as well. She does not really love him. He loves her, but it's nothing to me if he breaks his heart.\"\n\"I shall break mine if you don't let me go to bed.\"\nWith that she went away to her cousin's room. She found Alice still seated at the window, with her head out through the lattice.\n\"Why, you lazy creature,\" said Kate; \"I declare you haven't touched a thing.\"\n\"You said we'd do it together.\"\n\"But he has kept me. Oh, what a man he is! If he ever does get married, what will his wife do with him?\"\n\"I don't think he ever will,\" said Alice.\n\"Don't you? Sometimes I think that the only thing needed to make him thoroughly good is a wife. But it isn't every woman that would do for him. And the woman who marries him should have high courage. There are moments when he is very wild; but he is never cruel or hard. Is Mr. Grey ever hard?\"\n\"Never; nor wild.\"\n\"Oh, I'm quite sure he's never wild.\"\n\"When you say that, Kate, I know that you mean to abuse him.\"\n\"No; upon my word. What's the good of abusing him to you? I like a man to be wild, wild in my sense. You know that.\"\n\"I wonder whether you'd like a wild man for yourself?\"\n\"Ah! I've never asked myself what sort of husband I would like. The truth is, I'm married to George. Ever since-\"\n\"Ever since what?\"\n\"Since you and he were parted, I've had nothing to do in life but to stick to him. And I shall do so to the end, unless one thing should happen.\"\n\"And what's that?\"\n\"Unless you should become his wife after all. He will never marry anybody else.\"\n\"Kate, you shouldn't say such a thing. You know that it's impossible.\"\n\"Well, perhaps so. And it's all the better for me. If George ever married, I should have nothing to do in the world; literally nothing!\"\n\"Kate, don't talk in that way,\" and Alice embraced her.\n\"Go away,\" said Kate. \"Oh, Alice, I cannot bear it any longer. You must know it all. When you are married to John Grey, our friendship must be over. But I'd give up everything to see you become George's wife. I know I'm not good. Don't, Alice; I don't want your caresses. Caress him, and I'll kneel at your feet and cover them with kisses.\" She had now thrown herself upon a sofa, and had turned her face away to the wall.\n\"Kate, you shouldn't speak in that way.\"\n\"Of course I shouldn't - but I do.\"\n\"You know that I cannot marry your brother - even if he wished it.\"\n\"He does wish it.\"\n\"Not even if I were bound to no other engagement.\"\n\"And why not?\" said Kate, again starting up. \"That engagement will end in misery. Do you think I can't see which of the two men you like best?\"\n\"You are making me sorry, Kate, that I ventured to come here with your brother. It is not only unkind of you, it is indelicate.\"\n\"Oh, indelicate! How I hate that word. Are your thoughts delicate? that's the thing. You are engaged to marry John Grey. If you love anyone better, marrying him is about the most indelicate thing you can do.\"\n\"If you think ill of me like that-\"\n\"No; I don't think ill of you. It hasn't been your fault; it has been his. It is he who has driven you to sacrifice yourself on this altar. If we can, both of us, manage to lay aside all delicacy and pretence, and dare to speak the truth, we shall acknowledge that it is so. If Mr. Grey had come to you while things were smooth between you and George, would you have thought it possible that he could be George's rival?\"\nAlice made no answer. She had intended to fight bravely, and to have shown the excellence of her position as Mr. Grey's fiance, but she felt that she had failed. She felt that she had somehow acknowledged that the match was to be deplored. But she would hurry home and bid Mr. Grey name the earliest day he pleased. After that her cousin would cease to disturb her.\nIt was nearly one o'clock before the two girls began to pack, and about two when they got into bed. At six they were at the railway station. Half an hour later they were on their way to Strasbourg.\nThere is nothing further to be told of their tour. They were two days and nights on the road from Basle to London; and during those two days and nights neither George nor Kate spoke a word to Alice of her marriage, nor was any allusion made to the balcony at the inn, or the bridge over the river.",
        "paragraph_chars": [
            [
                0,
                308
            ],
            [
                308,
                343
            ],
            [
                343,
                633
            ],
            [
                633,
                741
            ],
            [
                741,
                769
            ],
            [
                769,
                1154
            ],
            [
                1154,
                1344
            ],
            [
                1344,
                1373
            ],
            [
                1373,
                1500
            ],
            [
                1500,
                1524
            ],
            [
                1524,
                1634
            ],
            [
                1634,
                1709
            ],
            [
                1709,
                1824
            ],
            [
                1824,
                1947
            ],
            [
                1947,
                1985
            ],
            [
                1985,
                2343
            ],
            [
                2343,
                2565
            ],
            [
                2565,
                2623
            ],
            [
                2623,
                2871
            ],
            [
                2871,
                2896
            ],
            [
                2896,
                3176
            ],
            [
                3176,
                3183
            ],
            [
                3183,
                3826
            ],
            [
                3826,
                3882
            ],
            [
                3882,
                4037
            ],
            [
                4037,
                4128
            ],
            [
                4128,
                4240
            ],
            [
                4240,
                4285
            ],
            [
                4285,
                4353
            ],
            [
                4353,
                4407
            ],
            [
                4407,
                4594
            ],
            [
                4594,
                4855
            ],
            [
                4855,
                4887
            ],
            [
                4887,
                4916
            ],
            [
                4916,
                5016
            ],
            [
                5016,
                5083
            ],
            [
                5083,
                5290
            ],
            [
                5290,
                5595
            ],
            [
                5595,
                5722
            ],
            [
                5722,
                5803
            ],
            [
                5803,
                6134
            ],
            [
                6134,
                6165
            ],
            [
                6165,
                6355
            ],
            [
                6355,
                6391
            ],
            [
                6391,
                6565
            ],
            [
                6565,
                6681
            ],
            [
                6681,
                6905
            ],
            [
                6905,
                6934
            ],
            [
                6934,
                7091
            ],
            [
                7091,
                7241
            ],
            [
                7241,
                7452
            ],
            [
                7452,
                7525
            ],
            [
                7525,
                7676
            ],
            [
                7676,
                7711
            ],
            [
                7711,
                7969
            ],
            [
                7969,
                8009
            ],
            [
                8009,
                8103
            ],
            [
                8103,
                8203
            ],
            [
                8203,
                8365
            ],
            [
                8365,
                8417
            ],
            [
                8417,
                8546
            ],
            [
                8546,
                8624
            ],
            [
                8624,
                8656
            ],
            [
                8656,
                8761
            ],
            [
                8761,
                8803
            ],
            [
                8803,
                9098
            ],
            [
                9098,
                9117
            ],
            [
                9117,
                9155
            ],
            [
                9155,
                9217
            ],
            [
                9217,
                9334
            ],
            [
                9334,
                9389
            ],
            [
                9389,
                9503
            ],
            [
                9503,
                9522
            ],
            [
                9522,
                9668
            ],
            [
                9668,
                9687
            ],
            [
                9687,
                9768
            ],
            [
                9768,
                9839
            ],
            [
                9839,
                9976
            ],
            [
                9976,
                10032
            ],
            [
                10032,
                10455
            ],
            [
                10455,
                10496
            ],
            [
                10496,
                10532
            ],
            [
                10532,
                10600
            ],
            [
                10600,
                10619
            ],
            [
                10619,
                10670
            ],
            [
                10670,
                10814
            ],
            [
                10814,
                10943
            ],
            [
                10943,
                11152
            ],
            [
                11152,
                11188
            ],
            [
                11188,
                11609
            ],
            [
                11609,
                11975
            ],
            [
                11975,
                12173
            ],
            [
                12173,
                12470
            ]
        ],
        "segment_chars": [
            [
                0,
                107
            ],
            [
                107,
                264
            ],
            [
                264,
                308
            ],
            [
                308,
                343
            ],
            [
                343,
                478
            ],
            [
                478,
                540
            ],
            [
                540,
                580
            ],
            [
                580,
                633
            ],
            [
                633,
                712
            ],
            [
                712,
                741
            ],
            [
                741,
                769
            ],
            [
                769,
                800
            ],
            [
                800,
                987
            ],
            [
                987,
                1071
            ],
            [
                1071,
                1154
            ],
            [
                1154,
                1257
            ],
            [
                1257,
                1344
            ],
            [
                1344,
                1373
            ],
            [
                1373,
                1383
            ],
            [
                1383,
                1410
            ],
            [
                1410,
                1500
            ],
            [
                1500,
                1524
            ],
            [
                1524,
                1539
            ],
            [
                1539,
                1580
            ],
            [
                1580,
                1634
            ],
            [
                1634,
                1656
            ],
            [
                1656,
                1709
            ],
            [
                1709,
                1776
            ],
            [
                1776,
                1824
            ],
            [
                1824,
                1947
            ],
            [
                1947,
                1985
            ],
            [
                1985,
                2016
            ],
            [
                2016,
                2065
            ],
            [
                2065,
                2087
            ],
            [
                2087,
                2125
            ],
            [
                2125,
                2203
            ],
            [
                2203,
                2343
            ],
            [
                2343,
                2461
            ],
            [
                2461,
                2565
            ],
            [
                2565,
                2623
            ],
            [
                2623,
                2644
            ],
            [
                2644,
                2673
            ],
            [
                2673,
                2718
            ],
            [
                2718,
                2798
            ],
            [
                2798,
                2832
            ],
            [
                2832,
                2871
            ],
            [
                2871,
                2896
            ],
            [
                2896,
                2914
            ],
            [
                2914,
                2988
            ],
            [
                2988,
                3028
            ],
            [
                3028,
                3068
            ],
            [
                3068,
                3096
            ],
            [
                3096,
                3122
            ],
            [
                3122,
                3176
            ],
            [
                3176,
                3183
            ],
            [
                3183,
                3246
            ],
            [
                3246,
                3279
            ],
            [
                3279,
                3364
            ],
            [
                3364,
                3517
            ],
            [
                3517,
                3588
            ],
            [
                3588,
                3700
            ],
            [
                3700,
                3733
            ],
            [
                3733,
                3793
            ],
            [
                3793,
                3826
            ],
            [
                3826,
                3882
            ],
            [
                3882,
                3961
            ],
            [
                3961,
                4007
            ],
            [
                4007,
                4037
            ],
            [
                4037,
                4128
            ],
            [
                4128,
                4196
            ],
            [
                4196,
                4240
            ],
            [
                4240,
                4285
            ],
            [
                4285,
                4353
            ],
            [
                4353,
                4407
            ],
            [
                4407,
                4447
            ],
            [
                4447,
                4533
            ],
            [
                4533,
                4594
            ],
            [
                4594,
                4661
            ],
            [
                4661,
                4855
            ],
            [
                4855,
                4887
            ],
            [
                4887,
                4916
            ],
            [
                4916,
                4933
            ],
            [
                4933,
                4962
            ],
            [
                4962,
                5016
            ],
            [
                5016,
                5083
            ],
            [
                5083,
                5128
            ],
            [
                5128,
                5226
            ],
            [
                5226,
                5290
            ],
            [
                5290,
                5295
            ],
            [
                5295,
                5387
            ],
            [
                5387,
                5479
            ],
            [
                5479,
                5498
            ],
            [
                5498,
                5553
            ],
            [
                5553,
                5595
            ],
            [
                5595,
                5626
            ],
            [
                5626,
                5722
            ],
            [
                5722,
                5803
            ],
            [
                5803,
                5913
            ],
            [
                5913,
                5968
            ],
            [
                5968,
                6054
            ],
            [
                6054,
                6134
            ],
            [
                6134,
                6165
            ],
            [
                6165,
                6284
            ],
            [
                6284,
                6355
            ],
            [
                6355,
                6391
            ],
            [
                6391,
                6428
            ],
            [
                6428,
                6462
            ],
            [
                6462,
                6565
            ],
            [
                6565,
                6611
            ],
            [
                6611,
                6681
            ],
            [
                6681,
                6732
            ],
            [
                6732,
                6822
            ],
            [
                6822,
                6873
            ],
            [
                6873,
                6905
            ],
            [
                6905,
                6934
            ],
            [
                6934,
                6961
            ],
            [
                6961,
                7091
            ],
            [
                7091,
                7188
            ],
            [
                7188,
                7241
            ],
            [
                7241,
                7268
            ],
            [
                7268,
                7284
            ],
            [
                7284,
                7452
            ],
            [
                7452,
                7525
            ],
            [
                7525,
                7569
            ],
            [
                7569,
                7633
            ],
            [
                7633,
                7676
            ],
            [
                7676,
                7711
            ],
            [
                7711,
                7744
            ],
            [
                7744,
                7801
            ],
            [
                7801,
                7923
            ],
            [
                7923,
                7969
            ],
            [
                7969,
                8009
            ],
            [
                8009,
                8049
            ],
            [
                8049,
                8103
            ],
            [
                8103,
                8130
            ],
            [
                8130,
                8203
            ],
            [
                8203,
                8208
            ],
            [
                8208,
                8273
            ],
            [
                8273,
                8303
            ],
            [
                8303,
                8365
            ],
            [
                8365,
                8417
            ],
            [
                8417,
                8463
            ],
            [
                8463,
                8546
            ],
            [
                8546,
                8624
            ],
            [
                8624,
                8656
            ],
            [
                8656,
                8677
            ],
            [
                8677,
                8699
            ],
            [
                8699,
                8761
            ],
            [
                8761,
                8803
            ],
            [
                8803,
                8815
            ],
            [
                8815,
                8899
            ],
            [
                8899,
                8947
            ],
            [
                8947,
                9003
            ],
            [
                9003,
                9074
            ],
            [
                9074,
                9098
            ],
            [
                9098,
                9117
            ],
            [
                9117,
                9155
            ],
            [
                9155,
                9217
            ],
            [
                9217,
                9236
            ],
            [
                9236,
                9275
            ],
            [
                9275,
                9318
            ],
            [
                9318,
                9334
            ],
            [
                9334,
                9389
            ],
            [
                9389,
                9394
            ],
            [
                9394,
                9453
            ],
            [
                9453,
                9490
            ],
            [
                9490,
                9503
            ],
            [
                9503,
                9522
            ],
            [
                9522,
                9605
            ],
            [
                9605,
                9668
            ],
            [
                9668,
                9687
            ],
            [
                9687,
                9733
            ],
            [
                9733,
                9768
            ],
            [
                9768,
                9807
            ],
            [
                9807,
                9839
            ],
            [
                9839,
                9858
            ],
            [
                9858,
                9890
            ],
            [
                9890,
                9976
            ],
            [
                9976,
                10032
            ],
            [
                10032,
                10054
            ],
            [
                10054,
                10095
            ],
            [
                10095,
                10117
            ],
            [
                10117,
                10181
            ],
            [
                10181,
                10241
            ],
            [
                10241,
                10262
            ],
            [
                10262,
                10304
            ],
            [
                10304,
                10373
            ],
            [
                10373,
                10455
            ],
            [
                10455,
                10496
            ],
            [
                10496,
                10532
            ],
            [
                10532,
                10600
            ],
            [
                10600,
                10619
            ],
            [
                10619,
                10670
            ],
            [
                10670,
                10685
            ],
            [
                10685,
                10715
            ],
            [
                10715,
                10752
            ],
            [
                10752,
                10814
            ],
            [
                10814,
                10894
            ],
            [
                10894,
                10943
            ],
            [
                10943,
                10960
            ],
            [
                10960,
                10982
            ],
            [
                10982,
                11010
            ],
            [
                11010,
                11028
            ],
            [
                11028,
                11064
            ],
            [
                11064,
                11152
            ],
            [
                11152,
                11188
            ],
            [
                11188,
                11219
            ],
            [
                11219,
                11263
            ],
            [
                11263,
                11328
            ],
            [
                11328,
                11463
            ],
            [
                11463,
                11609
            ],
            [
                11609,
                11631
            ],
            [
                11631,
                11771
            ],
            [
                11771,
                11849
            ],
            [
                11849,
                11925
            ],
            [
                11925,
                11975
            ],
            [
                11975,
                12075
            ],
            [
                12075,
                12116
            ],
            [
                12116,
                12173
            ],
            [
                12173,
                12224
            ],
            [
                12224,
                12470
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                23,
                26
            ],
            [
                38,
                45
            ],
            [
                45,
                49
            ],
            [
                50,
                53
            ],
            [
                54,
                88
            ],
            [
                89,
                107
            ],
            [
                107,
                142
            ],
            [
                153,
                180
            ],
            [
                180,
                193
            ],
            [
                194,
                240
            ],
            [
                241,
                264
            ],
            [
                264,
                305
            ],
            [
                308,
                326
            ],
            [
                327,
                343
            ],
            [
                343,
                437
            ],
            [
                446,
                451
            ],
            [
                452,
                455
            ],
            [
                456,
                476
            ],
            [
                476,
                478
            ],
            [
                478,
                484
            ],
            [
                492,
                500
            ],
            [
                500,
                505
            ],
            [
                510,
                529
            ],
            [
                538,
                540
            ],
            [
                540,
                554
            ],
            [
                560,
                580
            ],
            [
                580,
                630
            ],
            [
                630,
                633
            ],
            [
                633,
                712
            ],
            [
                712,
                741
            ],
            [
                741,
                769
            ],
            [
                769,
                780
            ],
            [
                782,
                800
            ],
            [
                800,
                822
            ],
            [
                822,
                823
            ],
            [
                824,
                838
            ],
            [
                839,
                877
            ],
            [
                877,
                901
            ],
            [
                910,
                931
            ],
            [
                934,
                987
            ],
            [
                987,
                991
            ],
            [
                996,
                1015
            ],
            [
                1016,
                1018
            ],
            [
                1019,
                1057
            ],
            [
                1064,
                1069
            ],
            [
                1069,
                1071
            ],
            [
                1071,
                1077
            ],
            [
                1078,
                1091
            ],
            [
                1092,
                1136
            ],
            [
                1137,
                1139
            ],
            [
                1140,
                1152
            ],
            [
                1152,
                1154
            ],
            [
                1154,
                1217
            ],
            [
                1220,
                1227
            ],
            [
                1228,
                1257
            ],
            [
                1257,
                1307
            ],
            [
                1310,
                1341
            ],
            [
                1344,
                1373
            ],
            [
                1373,
                1381
            ],
            [
                1381,
                1383
            ],
            [
                1383,
                1386
            ],
            [
                1387,
                1410
            ],
            [
                1410,
                1481
            ],
            [
                1482,
                1500
            ],
            [
                1500,
                1524
            ],
            [
                1524,
                1539
            ],
            [
                1539,
                1552
            ],
            [
                1558,
                1580
            ],
            [
                1580,
                1627
            ],
            [
                1631,
                1634
            ],
            [
                1634,
                1656
            ],
            [
                1656,
                1668
            ],
            [
                1669,
                1674
            ],
            [
                1675,
                1709
            ],
            [
                1709,
                1763
            ],
            [
                1764,
                1776
            ],
            [
                1776,
                1824
            ],
            [
                1824,
                1908
            ],
            [
                1922,
                1932
            ],
            [
                1944,
                1947
            ],
            [
                1947,
                1978
            ],
            [
                1982,
                1985
            ],
            [
                1985,
                2016
            ],
            [
                2016,
                2065
            ],
            [
                2065,
                2087
            ],
            [
                2087,
                2125
            ],
            [
                2125,
                2191
            ],
            [
                2192,
                2203
            ],
            [
                2207,
                2267
            ],
            [
                2268,
                2343
            ],
            [
                2343,
                2346
            ],
            [
                2346,
                2369
            ],
            [
                2370,
                2383
            ],
            [
                2392,
                2395
            ],
            [
                2404,
                2433
            ],
            [
                2439,
                2441
            ],
            [
                2442,
                2461
            ],
            [
                2470,
                2519
            ],
            [
                2546,
                2553
            ],
            [
                2554,
                2565
            ],
            [
                2565,
                2623
            ],
            [
                2623,
                2624
            ],
            [
                2624,
                2637
            ],
            [
                2642,
                2644
            ],
            [
                2644,
                2671
            ],
            [
                2671,
                2673
            ],
            [
                2673,
                2718
            ],
            [
                2718,
                2798
            ],
            [
                2798,
                2832
            ],
            [
                2832,
                2835
            ],
            [
                2836,
                2871
            ],
            [
                2871,
                2896
            ],
            [
                2896,
                2914
            ],
            [
                2914,
                2988
            ],
            [
                2997,
                2998
            ],
            [
                3006,
                3026
            ],
            [
                3028,
                3068
            ],
            [
                3068,
                3096
            ],
            [
                3096,
                3122
            ],
            [
                3122,
                3173
            ],
            [
                3176,
                3180
            ],
            [
                3180,
                3183
            ],
            [
                3183,
                3194
            ],
            [
                3206,
                3246
            ],
            [
                3246,
                3254
            ],
            [
                3260,
                3279
            ],
            [
                3279,
                3364
            ],
            [
                3364,
                3517
            ],
            [
                3517,
                3561
            ],
            [
                3567,
                3586
            ],
            [
                3586,
                3587
            ],
            [
                3588,
                3633
            ],
            [
                3643,
                3669
            ],
            [
                3670,
                3700
            ],
            [
                3700,
                3733
            ],
            [
                3733,
                3742
            ],
            [
                3746,
                3752
            ],
            [
                3753,
                3791
            ],
            [
                3791,
                3793
            ],
            [
                3793,
                3798
            ],
            [
                3799,
                3826
            ],
            [
                3826,
                3849
            ],
            [
                3850,
                3881
            ],
            [
                3882,
                3912
            ],
            [
                3921,
                3961
            ],
            [
                3961,
                4005
            ],
            [
                4005,
                4007
            ],
            [
                4007,
                4037
            ],
            [
                4037,
                4059
            ],
            [
                4060,
                4128
            ],
            [
                4128,
                4194
            ],
            [
                4194,
                4196
            ],
            [
                4197,
                4204
            ],
            [
                4213,
                4240
            ],
            [
                4240,
                4248
            ],
            [
                4257,
                4285
            ],
            [
                4285,
                4312
            ],
            [
                4313,
                4337
            ],
            [
                4338,
                4353
            ],
            [
                4353,
                4357
            ],
            [
                4358,
                4407
            ],
            [
                4407,
                4447
            ],
            [
                4447,
                4482
            ],
            [
                4499,
                4508
            ],
            [
                4509,
                4533
            ],
            [
                4533,
                4580
            ],
            [
                4582,
                4594
            ],
            [
                4594,
                4650
            ],
            [
                4651,
                4661
            ],
            [
                4661,
                4677
            ],
            [
                4678,
                4746
            ],
            [
                4747,
                4855
            ],
            [
                4855,
                4886
            ],
            [
                4887,
                4902
            ],
            [
                4903,
                4907
            ],
            [
                4908,
                4914
            ],
            [
                4914,
                4916
            ],
            [
                4916,
                4933
            ],
            [
                4933,
                4962
            ],
            [
                4962,
                5016
            ],
            [
                5016,
                5028
            ],
            [
                5031,
                5080
            ],
            [
                5083,
                5096
            ],
            [
                5107,
                5113
            ],
            [
                5113,
                5128
            ],
            [
                5128,
                5165
            ],
            [
                5166,
                5187
            ],
            [
                5188,
                5224
            ],
            [
                5224,
                5225
            ],
            [
                5226,
                5259
            ],
            [
                5260,
                5290
            ],
            [
                5290,
                5295
            ],
            [
                5295,
                5361
            ],
            [
                5362,
                5370
            ],
            [
                5385,
                5387
            ],
            [
                5387,
                5479
            ],
            [
                5479,
                5498
            ],
            [
                5498,
                5500
            ],
            [
                5506,
                5553
            ],
            [
                5553,
                5595
            ],
            [
                5595,
                5606
            ],
            [
                5607,
                5624
            ],
            [
                5624,
                5626
            ],
            [
                5640,
                5721
            ],
            [
                5722,
                5802
            ],
            [
                5803,
                5872
            ],
            [
                5873,
                5875
            ],
            [
                5876,
                5894
            ],
            [
                5895,
                5911
            ],
            [
                5911,
                5913
            ],
            [
                5913,
                5916
            ],
            [
                5917,
                5921
            ],
            [
                5922,
                5968
            ],
            [
                5968,
                6054
            ],
            [
                6054,
                6065
            ],
            [
                6074,
                6127
            ],
            [
                6132,
                6134
            ],
            [
                6134,
                6142
            ],
            [
                6147,
                6163
            ],
            [
                6163,
                6164
            ],
            [
                6165,
                6202
            ],
            [
                6209,
                6210
            ],
            [
                6211,
                6255
            ],
            [
                6256,
                6284
            ],
            [
                6284,
                6289
            ],
            [
                6299,
                6355
            ],
            [
                6355,
                6391
            ],
            [
                6391,
                6426
            ],
            [
                6428,
                6452
            ],
            [
                6453,
                6462
            ],
            [
                6462,
                6565
            ],
            [
                6565,
                6611
            ],
            [
                6615,
                6619
            ],
            [
                6620,
                6681
            ],
            [
                6681,
                6713
            ],
            [
                6730,
                6732
            ],
            [
                6732,
                6820
            ],
            [
                6822,
                6873
            ],
            [
                6873,
                6905
            ],
            [
                6905,
                6934
            ],
            [
                6934,
                6961
            ],
            [
                6961,
                7056
            ],
            [
                7062,
                7071
            ],
            [
                7072,
                7074
            ],
            [
                7075,
                7091
            ],
            [
                7091,
                7186
            ],
            [
                7188,
                7241
            ],
            [
                7241,
                7268
            ],
            [
                7268,
                7284
            ],
            [
                7284,
                7377
            ],
            [
                7380,
                7403
            ],
            [
                7414,
                7421
            ],
            [
                7429,
                7452
            ],
            [
                7452,
                7525
            ],
            [
                7525,
                7551
            ],
            [
                7551,
                7569
            ],
            [
                7569,
                7633
            ],
            [
                7633,
                7659
            ],
            [
                7660,
                7676
            ],
            [
                7676,
                7711
            ],
            [
                7711,
                7730
            ],
            [
                7731,
                7744
            ],
            [
                7744,
                7801
            ],
            [
                7801,
                7923
            ],
            [
                7923,
                7969
            ],
            [
                7969,
                7970
            ],
            [
                7970,
                8009
            ],
            [
                8009,
                8049
            ],
            [
                8049,
                8103
            ],
            [
                8103,
                8130
            ],
            [
                8130,
                8203
            ],
            [
                8203,
                8206
            ],
            [
                8206,
                8208
            ],
            [
                8208,
                8273
            ],
            [
                8273,
                8303
            ],
            [
                8303,
                8320
            ],
            [
                8321,
                8365
            ],
            [
                8365,
                8417
            ],
            [
                8417,
                8440
            ],
            [
                8441,
                8463
            ],
            [
                8463,
                8506
            ],
            [
                8507,
                8545
            ],
            [
                8546,
                8624
            ],
            [
                8624,
                8656
            ],
            [
                8656,
                8677
            ],
            [
                8677,
                8699
            ],
            [
                8699,
                8761
            ],
            [
                8761,
                8803
            ],
            [
                8803,
                8815
            ],
            [
                8815,
                8852
            ],
            [
                8860,
                8887
            ],
            [
                8888,
                8899
            ],
            [
                8899,
                8947
            ],
            [
                8947,
                9003
            ],
            [
                9003,
                9020
            ],
            [
                9021,
                9049
            ],
            [
                9050,
                9052
            ],
            [
                9053,
                9058
            ],
            [
                9059,
                9064
            ],
            [
                9068,
                9074
            ],
            [
                9074,
                9098
            ],
            [
                9098,
                9109
            ],
            [
                9110,
                9117
            ],
            [
                9122,
                9155
            ],
            [
                9155,
                9217
            ],
            [
                9217,
                9236
            ],
            [
                9236,
                9275
            ],
            [
                9275,
                9299
            ],
            [
                9300,
                9318
            ],
            [
                9318,
                9321
            ],
            [
                9327,
                9331
            ],
            [
                9331,
                9334
            ],
            [
                9334,
                9389
            ],
            [
                9389,
                9394
            ],
            [
                9394,
                9417
            ],
            [
                9418,
                9438
            ],
            [
                9439,
                9440
            ],
            [
                9441,
                9446
            ],
            [
                9451,
                9453
            ],
            [
                9453,
                9490
            ],
            [
                9490,
                9500
            ],
            [
                9503,
                9522
            ],
            [
                9522,
                9605
            ],
            [
                9605,
                9634
            ],
            [
                9635,
                9668
            ],
            [
                9668,
                9687
            ],
            [
                9687,
                9733
            ],
            [
                9733,
                9768
            ],
            [
                9768,
                9788
            ],
            [
                9793,
                9805
            ],
            [
                9805,
                9807
            ],
            [
                9807,
                9839
            ],
            [
                9839,
                9858
            ],
            [
                9862,
                9864
            ],
            [
                9867,
                9890
            ],
            [
                9890,
                9955
            ],
            [
                9956,
                9965
            ],
            [
                9966,
                9976
            ],
            [
                9976,
                10017
            ],
            [
                10018,
                10032
            ],
            [
                10032,
                10047
            ],
            [
                10052,
                10054
            ],
            [
                10054,
                10055
            ],
            [
                10057,
                10064
            ],
            [
                10066,
                10095
            ],
            [
                10095,
                10117
            ],
            [
                10117,
                10181
            ],
            [
                10181,
                10196
            ],
            [
                10197,
                10207
            ],
            [
                10208,
                10241
            ],
            [
                10241,
                10247
            ],
            [
                10252,
                10255
            ],
            [
                10256,
                10262
            ],
            [
                10262,
                10267
            ],
            [
                10267,
                10268
            ],
            [
                10269,
                10274
            ],
            [
                10274,
                10304
            ],
            [
                10304,
                10373
            ],
            [
                10373,
                10455
            ],
            [
                10455,
                10496
            ],
            [
                10496,
                10518
            ],
            [
                10521,
                10532
            ],
            [
                10532,
                10536
            ],
            [
                10537,
                10574
            ],
            [
                10577,
                10600
            ],
            [
                10600,
                10619
            ],
            [
                10619,
                10623
            ],
            [
                10632,
                10638
            ],
            [
                10648,
                10670
            ],
            [
                10670,
                10685
            ],
            [
                10685,
                10715
            ],
            [
                10715,
                10716
            ],
            [
                10716,
                10720
            ],
            [
                10732,
                10743
            ],
            [
                10744,
                10750
            ],
            [
                10750,
                10752
            ],
            [
                10752,
                10776
            ],
            [
                10777,
                10814
            ],
            [
                10814,
                10852
            ],
            [
                10853,
                10874
            ],
            [
                10880,
                10892
            ],
            [
                10892,
                10894
            ],
            [
                10894,
                10922
            ],
            [
                10922,
                10923
            ],
            [
                10924,
                10943
            ],
            [
                10943,
                10960
            ],
            [
                10960,
                10965
            ],
            [
                10966,
                10982
            ],
            [
                10982,
                11010
            ],
            [
                11010,
                11028
            ],
            [
                11028,
                11064
            ],
            [
                11064,
                11075
            ],
            [
                11083,
                11089
            ],
            [
                11089,
                11090
            ],
            [
                11100,
                11103
            ],
            [
                11107,
                11149
            ],
            [
                11152,
                11185
            ],
            [
                11188,
                11219
            ],
            [
                11219,
                11261
            ],
            [
                11261,
                11263
            ],
            [
                11263,
                11328
            ],
            [
                11328,
                11463
            ],
            [
                11466,
                11474
            ],
            [
                11475,
                11478
            ],
            [
                11479,
                11606
            ],
            [
                11609,
                11629
            ],
            [
                11629,
                11631
            ],
            [
                11631,
                11677
            ],
            [
                11684,
                11705
            ],
            [
                11706,
                11717
            ],
            [
                11718,
                11726
            ],
            [
                11735,
                11771
            ],
            [
                11771,
                11792
            ],
            [
                11801,
                11832
            ],
            [
                11833,
                11847
            ],
            [
                11847,
                11849
            ],
            [
                11853,
                11881
            ],
            [
                11891,
                11925
            ],
            [
                11925,
                11973
            ],
            [
                11973,
                11975
            ],
            [
                11975,
                12030
            ],
            [
                12035,
                12040
            ],
            [
                12041,
                12050
            ],
            [
                12051,
                12055
            ],
            [
                12056,
                12073
            ],
            [
                12073,
                12074
            ],
            [
                12075,
                12116
            ],
            [
                12116,
                12128
            ],
            [
                12135,
                12144
            ],
            [
                12145,
                12147
            ],
            [
                12148,
                12153
            ],
            [
                12158,
                12173
            ],
            [
                12173,
                12224
            ],
            [
                12224,
                12233
            ],
            [
                12234,
                12443
            ],
            [
                12444,
                12470
            ]
        ],
        "row_chars": [
            [
                0,
                107
            ],
            [
                107,
                264
            ],
            [
                264,
                308
            ],
            [
                308,
                343
            ],
            [
                343,
                478
            ],
            [
                478,
                478
            ],
            [
                478,
                540
            ],
            [
                540,
                580
            ],
            [
                580,
                633
            ],
            [
                633,
                712
            ],
            [
                712,
                741
            ],
            [
                741,
                769
            ],
            [
                769,
                800
            ],
            [
                800,
                987
            ],
            [
                987,
                1071
            ],
            [
                1071,
                1154
            ],
            [
                1154,
                1257
            ],
            [
                1257,
                1344
            ],
            [
                1344,
                1344
            ],
            [
                1344,
                1344
            ],
            [
                1344,
                1373
            ],
            [
                1373,
                1383
            ],
            [
                1383,
                1383
            ],
            [
                1383,
                1383
            ],
            [
                1383,
                1383
            ],
            [
                1383,
                1383
            ],
            [
                1383,
                1410
            ],
            [
                1410,
                1500
            ],
            [
                1500,
                1524
            ],
            [
                1524,
                1539
            ],
            [
                1539,
                1580
            ],
            [
                1580,
                1580
            ],
            [
                1580,
                1634
            ],
            [
                1634,
                1656
            ],
            [
                1656,
                1709
            ],
            [
                1709,
                1776
            ],
            [
                1776,
                1824
            ],
            [
                1824,
                1947
            ],
            [
                1947,
                1985
            ],
            [
                1985,
                2016
            ],
            [
                2016,
                2065
            ],
            [
                2065,
                2087
            ],
            [
                2087,
                2125
            ],
            [
                2125,
                2203
            ],
            [
                2203,
                2343
            ],
            [
                2343,
                2461
            ],
            [
                2461,
                2461
            ],
            [
                2461,
                2565
            ],
            [
                2565,
                2623
            ],
            [
                2623,
                2644
            ],
            [
                2644,
                2644
            ],
            [
                2644,
                2644
            ],
            [
                2644,
                2644
            ],
            [
                2644,
                2644
            ],
            [
                2644,
                2673
            ],
            [
                2673,
                2718
            ],
            [
                2718,
                2718
            ],
            [
                2718,
                2798
            ],
            [
                2798,
                2832
            ],
            [
                2832,
                2832
            ],
            [
                2832,
                2871
            ],
            [
                2871,
                2896
            ],
            [
                2896,
                2914
            ],
            [
                2914,
                2988
            ],
            [
                2988,
                3028
            ],
            [
                3028,
                3028
            ],
            [
                3028,
                3068
            ],
            [
                3068,
                3096
            ],
            [
                3096,
                3122
            ],
            [
                3122,
                3176
            ],
            [
                3176,
                3176
            ],
            [
                3176,
                3183
            ],
            [
                3183,
                3246
            ],
            [
                3246,
                3279
            ],
            [
                3279,
                3364
            ],
            [
                3364,
                3517
            ],
            [
                3517,
                3588
            ],
            [
                3588,
                3588
            ],
            [
                3588,
                3588
            ],
            [
                3588,
                3588
            ],
            [
                3588,
                3588
            ],
            [
                3588,
                3700
            ],
            [
                3700,
                3733
            ],
            [
                3733,
                3793
            ],
            [
                3793,
                3826
            ],
            [
                3826,
                3882
            ],
            [
                3882,
                3961
            ],
            [
                3961,
                4007
            ],
            [
                4007,
                4037
            ],
            [
                4037,
                4128
            ],
            [
                4128,
                4196
            ],
            [
                4196,
                4240
            ],
            [
                4240,
                4285
            ],
            [
                4285,
                4353
            ],
            [
                4353,
                4407
            ],
            [
                4407,
                4447
            ],
            [
                4447,
                4447
            ],
            [
                4447,
                4447
            ],
            [
                4447,
                4533
            ],
            [
                4533,
                4594
            ],
            [
                4594,
                4661
            ],
            [
                4661,
                4661
            ],
            [
                4661,
                4855
            ],
            [
                4855,
                4887
            ],
            [
                4887,
                4916
            ],
            [
                4916,
                4916
            ],
            [
                4916,
                4916
            ],
            [
                4916,
                4916
            ],
            [
                4916,
                4933
            ],
            [
                4933,
                4962
            ],
            [
                4962,
                5016
            ],
            [
                5016,
                5083
            ],
            [
                5083,
                5083
            ],
            [
                5083,
                5128
            ],
            [
                5128,
                5290
            ],
            [
                5290,
                5290
            ],
            [
                5290,
                5290
            ],
            [
                5290,
                5295
            ],
            [
                5295,
                5295
            ],
            [
                5295,
                5295
            ],
            [
                5295,
                5387
            ],
            [
                5387,
                5387
            ],
            [
                5387,
                5479
            ],
            [
                5479,
                5498
            ],
            [
                5498,
                5553
            ],
            [
                5553,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5626
            ],
            [
                5626,
                5722
            ],
            [
                5722,
                5803
            ],
            [
                5803,
                5913
            ],
            [
                5913,
                5968
            ],
            [
                5968,
                6054
            ],
            [
                6054,
                6134
            ],
            [
                6134,
                6165
            ],
            [
                6165,
                6165
            ],
            [
                6165,
                6284
            ],
            [
                6284,
                6355
            ],
            [
                6355,
                6391
            ],
            [
                6391,
                6462
            ],
            [
                6462,
                6565
            ],
            [
                6565,
                6611
            ],
            [
                6611,
                6611
            ],
            [
                6611,
                6681
            ],
            [
                6681,
                6732
            ],
            [
                6732,
                6732
            ],
            [
                6732,
                6822
            ],
            [
                6822,
                6822
            ],
            [
                6822,
                6822
            ],
            [
                6822,
                6822
            ],
            [
                6822,
                6822
            ],
            [
                6822,
                6873
            ],
            [
                6873,
                6905
            ],
            [
                6905,
                6934
            ],
            [
                6934,
                6961
            ],
            [
                6961,
                7091
            ],
            [
                7091,
                7188
            ],
            [
                7188,
                7188
            ],
            [
                7188,
                7188
            ],
            [
                7188,
                7241
            ],
            [
                7241,
                7268
            ],
            [
                7268,
                7284
            ],
            [
                7284,
                7452
            ],
            [
                7452,
                7525
            ],
            [
                7525,
                7569
            ],
            [
                7569,
                7633
            ],
            [
                7633,
                7676
            ],
            [
                7676,
                7711
            ],
            [
                7711,
                7744
            ],
            [
                7744,
                7801
            ],
            [
                7801,
                7923
            ],
            [
                7923,
                7969
            ],
            [
                7969,
                8009
            ],
            [
                8009,
                8049
            ],
            [
                8049,
                8103
            ],
            [
                8103,
                8130
            ],
            [
                8130,
                8203
            ],
            [
                8203,
                8208
            ],
            [
                8208,
                8273
            ],
            [
                8273,
                8303
            ],
            [
                8303,
                8365
            ],
            [
                8365,
                8417
            ],
            [
                8417,
                8463
            ],
            [
                8463,
                8546
            ],
            [
                8546,
                8624
            ],
            [
                8624,
                8656
            ],
            [
                8656,
                8677
            ],
            [
                8677,
                8699
            ],
            [
                8699,
                8761
            ],
            [
                8761,
                8803
            ],
            [
                8803,
                8815
            ],
            [
                8815,
                8815
            ],
            [
                8815,
                8899
            ],
            [
                8899,
                8947
            ],
            [
                8947,
                9003
            ],
            [
                9003,
                9074
            ],
            [
                9074,
                9098
            ],
            [
                9098,
                9117
            ],
            [
                9117,
                9117
            ],
            [
                9117,
                9155
            ],
            [
                9155,
                9217
            ],
            [
                9217,
                9236
            ],
            [
                9236,
                9275
            ],
            [
                9275,
                9318
            ],
            [
                9318,
                9334
            ],
            [
                9334,
                9389
            ],
            [
                9389,
                9394
            ],
            [
                9394,
                9453
            ],
            [
                9453,
                9490
            ],
            [
                9490,
                9503
            ],
            [
                9503,
                9522
            ],
            [
                9522,
                9605
            ],
            [
                9605,
                9668
            ],
            [
                9668,
                9687
            ],
            [
                9687,
                9733
            ],
            [
                9733,
                9768
            ],
            [
                9768,
                9807
            ],
            [
                9807,
                9839
            ],
            [
                9839,
                9858
            ],
            [
                9858,
                9890
            ],
            [
                9890,
                9976
            ],
            [
                9976,
                10032
            ],
            [
                10032,
                10054
            ],
            [
                10054,
                10095
            ],
            [
                10095,
                10117
            ],
            [
                10117,
                10181
            ],
            [
                10181,
                10181
            ],
            [
                10181,
                10181
            ],
            [
                10181,
                10181
            ],
            [
                10181,
                10241
            ],
            [
                10241,
                10262
            ],
            [
                10262,
                10262
            ],
            [
                10262,
                10304
            ],
            [
                10304,
                10373
            ],
            [
                10373,
                10455
            ],
            [
                10455,
                10496
            ],
            [
                10496,
                10532
            ],
            [
                10532,
                10600
            ],
            [
                10600,
                10619
            ],
            [
                10619,
                10670
            ],
            [
                10670,
                10685
            ],
            [
                10685,
                10715
            ],
            [
                10715,
                10752
            ],
            [
                10752,
                10814
            ],
            [
                10814,
                10894
            ],
            [
                10894,
                10943
            ],
            [
                10943,
                10960
            ],
            [
                10960,
                10982
            ],
            [
                10982,
                10982
            ],
            [
                10982,
                11010
            ],
            [
                11010,
                11028
            ],
            [
                11028,
                11064
            ],
            [
                11064,
                11152
            ],
            [
                11152,
                11152
            ],
            [
                11152,
                11152
            ],
            [
                11152,
                11188
            ],
            [
                11188,
                11219
            ],
            [
                11219,
                11219
            ],
            [
                11219,
                11263
            ],
            [
                11263,
                11328
            ],
            [
                11328,
                11463
            ],
            [
                11463,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11609
            ],
            [
                11609,
                11631
            ],
            [
                11631,
                11631
            ],
            [
                11631,
                11771
            ],
            [
                11771,
                11849
            ],
            [
                11849,
                11849
            ],
            [
                11849,
                11849
            ],
            [
                11849,
                11925
            ],
            [
                11925,
                11975
            ],
            [
                11975,
                12116
            ],
            [
                12116,
                12116
            ],
            [
                12116,
                12116
            ],
            [
                12116,
                12173
            ],
            [
                12173,
                12224
            ],
            [
                12224,
                12470
            ]
        ]
    }
}