{
    "original": {
        "text": "Mr. Tombe had gained nothing for the cause by his crafty silence. George Vavasor felt perfectly certain, as he walked out from the little street which runs at the back of Doctors' Commons, that the money which he had been using had come, in some shape, through the hands of John Grey. He did not care much to calculate whether the payments had been made from the personal funds of his rival, or whether that rival had been employed to dispense Alice's fortune. Under either view of the case his position was sufficiently bitter. The truth never for a moment occurred to him. He never dreamed that there might be a conspiracy in the matter, of which Alice was as ignorant as he himself had been. He never reflected that his uncle John, together with John, the lover, whom he so hated, might be the conspirators. To him it seemed to be certain that Alice and Mr. Grey were in league;--and if they were in league, what must he think of Alice, and of her engagement with himself!\nThere are men who rarely think well of women,--who hardly think well of any woman. They put their mothers and sisters into the background,--as though they belonged to some sex or race apart,--and then declare to themselves and to their friends that all women are false,--that no woman can be trusted unless her ugliness protect her; and that every woman may be attacked as fairly as may game in a cover, or deer on a mountain, What man does not know men who have so thought? I cannot say that such had been Vavasor's creed,--not entirely such. There had been periods of his life when he had believed implicitly in his cousin Alice;--but then there had been other moments in which he had ridiculed himself for his Quixotism in believing in any woman. And as he had grown older the moments of his Quixotism had become more rare. There would have been no such Quixotism left with him now, had not the various circumstances which I have attempted to describe, filled him, during the last twelve months, with a renewed desire to marry his cousin. Every man tries to believe in the honesty of his future wife; and, therefore, Vavasor had tried, and had in his way, believed. He had flattered himself, too, that Alice's heart had, in truth, been more prone to him than to that other suitor. Grey, as he thought, had been accepted by her cold prudence; but he thought, also, that she had found her prudence to be too cold, and had therefore returned where she had truly loved. Vavasor, though he did not love much himself, was willing enough to be the object of love.\nThis idea of his, however, had been greatly shaken by Alice's treatment of himself personally; but still he had not, hitherto, believed that she was false to him. Now, what could he believe of her? What was there within the compass of such a one to believe? As he walked out into St. Paul's Churchyard he called her by every name which is most offensive to a woman's ears. He hated her at this moment with even a more bitter hatred than that which he felt towards John Grey. She must have deceived him with unparalleled hypocrisy, and lied to him and to his sister Kate as hardly any woman had ever lied before. Or could it be that Kate, also, was lying to him? If so, Kate also should be included in the punishment.\nBut why should they have conspired to feed him with these moneys? There had been no deceit, at any rate, in reference to the pounds sterling which Scruby had already swallowed. They had been supplied, whatever had been the motives of the suppliers; and he had no doubt that more would be supplied if he would only keep himself quiet. He was still walking westward as he thought of this, down Ludgate Hill, on his direct line towards Suffolk Street; and he tried to persuade himself that it would be well that he should hide his wrath till after provision should have been made for this other election. They were his enemies,--Alice and Mr. Grey,--and why should he keep any terms with his enemies? It was still a trouble to him to think that he should have been in any way beholden to John Grey; but the terrible thing had been done, the evil had occurred. What would he gain by staying his hand now? Still, however, he walked on quickly along Fleet Street, and along the Strand, and was already crossing under the Picture Galleries towards Pall Mall East before he had definitely decided what steps he would take on this very day. Exactly at the corner of Suffolk Street he met John Grey.\n\"Mr. Grey,\" he said, stopping himself suddenly, \"I was this moment going to call on you at your lodgings.\"\n\"At my lodgings, were you? Shall I return with you?\"\n\"If you please,\" said Vavasor, leading the way up Suffolk Street. There had been no other greeting than this between them. Mr. Grey himself, though a man very courteous in his general demeanour, would probably have passed Vavasor in the street with no more than the barest salutation. Situated as they were towards each other there could hardly be any show of friendship between them; but when Vavasor had spoken to him, he had dressed his face in that guise of civility which men always use who do not intend to be offensive;--but Vavasor dressed his as men dress theirs who do mean to be offensive; and Mr. Grey had thoroughly appreciated the dressing.\n\"If you will allow me, I have the key,\" said Grey. Then they both entered the house, and Vavasor followed his host up-stairs. Mr. Grey, as he went up, felt almost angry with himself in having admitted his enemy into his lodgings. He was sure that no good could come of it, and remembered, when it was too late, that he might easily have saved himself from giving the invitation while he was still in the street. There they were, however, together in the sitting-room, and Grey had nothing to do but to listen. \"Will you take a chair, Mr. Vavasor?\" he said. \"No,\" said Vavasor; \"I will stand up.\" And he stood up, holding his hat behind his back with his left hand, with his right leg forward, and the thumb of his right hand in his waistcoat-pocket. He looked full into Grey's face, and Grey looked full into his; and as he looked the great cicatrice seemed to open itself and to become purple with fresh blood stains.\n\"I have come here from Mr. Tombe's office in the City,\" said Vavasor, \"to ask you of what nature has been the interference which you have taken in my money matters?\"\nThis was a question which Mr. Grey could not answer very quickly. In the first place it was altogether unexpected; in the next place he did not know what Mr. Tombe had told, and what he had not told; and then, before he replied, he must think how much of the truth he was bound to tell in answer to a question so put to him.\n\"Do you say that you have come from Mr. Tombe?\" he asked.\n\"I think you heard me say so. I have come here direct from Mr. Tombe's chambers. He is your lawyer, I believe?\"\n\"He is so.\"\n\"And I have come from him to ask you what interference you have lately taken in my money matters. When you have answered that, I shall have other questions to ask you.\"\n\"But, Mr. Vavasor, has it occurred to you that I may not be disposed to answer questions so asked?\"\n\"It has not occurred to me to think that you will prevaricate. If there has been no such interference, I will ask your pardon, and go away; but if there has been such interference on your part, I have a right to demand that you shall explain to me its nature.\"\nGrey had now made up his mind that it would be better that he should tell the whole story,--better not only for himself, but for all the Vavasors, including this angry man himself. The angry man evidently knew something, and it would be better that he should know the truth. \"There has been such interference, Mr. Vavasor, if you choose to call it so. Money, to the extent of two thousand pounds, I think, has by my directions been paid to your credit by Mr. Tombe.\"\n\"Well,\" said Vavasor, taking his right hand away from his waistcoat, and tapping the round table with his fingers impatiently.\n\"I hardly know how to explain all the circumstances under which this has been done.\"\n\"I dare say not; but, nevertheless, you must explain them.\"\nGrey was a man tranquil in temperament, very little prone to quarrelling, with perhaps an exaggerated idea of the evil results of a row,--a man who would take infinite trouble to avoid any such scene as that which now seemed to be imminent; but he was a man whose courage was quite as high as that of his opponent. To bully or be bullied were alike contrary to his nature. It was clear enough now that Vavasor intended to bully him, and he made up his mind at once that if the quarrel were forced upon him it should find him ready to take his own part. \"My difficulty in explaining it comes from consideration for you,\" he said.\n\"Then I beg that your difficulty will cease, and that you will have no consideration for me. We are so circumstanced towards each other that any consideration must be humbug and nonsense. At any rate, I intend to have none for you. Now, let me know why you have meddled with my matters.\"\n\"I think I might, perhaps, better refer you to your uncle.\"\n\"No, sir; Mr. Tombe is not my uncle's lawyer. My uncle never heard his name, unless he heard of it from you.\"\n\"But it was by agreement with your uncle that I commissioned Mr. Tombe to raise for you the money you were desirous of borrowing from your cousin. We thought it better that her fortune should not be for the moment disturbed.\"\n\"But what had you to do with it? Why should you have done it? In the first place, I don't believe your story; it is altogether improbable. But why should he come to you of all men to raise money on his daughter's behalf?\"\n\"Unless you can behave yourself with more discretion, Mr. Vavasor, you must leave the room,\" said Mr. Grey. Then, as Vavasor simply sneered at him, but spoke nothing, he went on. \"It was I who suggested to your uncle that this arrangement should be made. I did not wish to see Miss Vavasor's fortune squandered.\"\n\"And what was her fortune to you, sir? Are you aware that she is engaged to me as my wife? I ask you, sir, whether you are aware that Miss Vavasor is to be my wife?\"\n\"I must altogether decline to discuss with you Miss Vavasor's present or future position.\"\n\"By heavens, then, you shall hear me discuss it! She was engaged to you, and she has given you your dismissal. If you had understood anything of the conduct which is usual among gentlemen, or if you had had any particle of pride in you, sir, you would have left her and never mentioned her name again. I now find you meddling with her money matters, so as to get a hold upon her fortune.\"\n\"I have no hold upon her fortune.\"\n\"Yes, sir, you have. You do not advance two thousand pounds without knowing that you have security. She has rejected you; and in order that you may be revenged, or that you may have some further hold upon her,--that she may be in some sort within your power, you have contrived this rascally pettifogging way of obtaining power over her income. The money shall be repaid at once, with any interest that can be due; and if I find you interfering again, I will expose you.\"\n\"Mr. Vavasor,\" said Grey very slowly, in a low tone of voice, but with something in his eye which would have told any bystander that he was much in earnest, \"you have used words in your anger which I cannot allow to pass. You must recall them.\"\n\"What were the words? I said that you were a pettifogging rascal. I now repeat them.\" As he spoke he put on his hat, so as to leave both his hands ready for action if action should be required.\nGrey was much the larger man and much the stronger. It may be doubted whether he knew himself the extent of his own strength, but such as it was he resolved that he must now use it. \"There is no help for it,\" he said, as he also prepared for action. The first thing he did was to open the door, and as he did so he became conscious that his mouth was full of blood from a sharp blow upon his face. Vavasor had struck him with his fist, and had cut his lip against his teeth. Then there came a scramble, and Grey was soon aware that he had his opponent in his hands. I doubt whether he had attempted to strike a blow, or whether he had so much as clenched his fist. Vavasor had struck him repeatedly, but the blows had fallen on his body or his head, and he was unconscious of them. He had but one object now in his mind, and that object was the kicking his assailant down the stairs. Then came a scramble, as I have said, and Grey had a hold of the smaller man by the nape of his neck. So holding him he forced him back through the door on to the landing, and there succeeded in pushing him down the first flight of steps. Grey kicked at him as he went, but the kick was impotent. He had, however, been so far successful that he had thrust his enemy out of the room, and had the satisfaction of seeing him sprawling on the landing-place.\nVavasor, when he raised himself, prepared to make another rush at the room, but before he could do so a man from below, hearing the noise, had come upon him and interrupted him. \"Mr. Jones,\" said Grey, speaking from above, \"if that gentleman does not leave the house, I must get you to search for a policeman.\"\nVavasor, though the lodging-house man had hold of the collar of his coat, made no attempt to turn upon his new enemy. When two dogs are fighting, any bystander may attempt to separate them with impunity. The brutes are so anxious to tear each other that they have no energies left for other purposes. It never occurs to them to turn their teeth upon newcomers in the quarrel. So it was with George Vavasor. Jones was sufficient to prevent his further attack upon the foe up-stairs, and therefore he had no alternative but to relinquish the fight.\n\"What's it all about, sir?\" said Jones, who kept a tailor's establishment, and, as a tailor, was something of a fighting man himself. Of all tradesmen in London the tailors are, no doubt, the most combative,--as might be expected from the necessity which lies upon them of living down the general bad character in this respect which the world has wrongly given them. \"What's it all about, sir?\" said Jones, still holding Vavasor by his coat.\n\"That man has ill-used me, and I've punished him; that's all.\"\n\"I don't know much about punishing,\" said the tailor. \"It seems to me he pitched you down pretty clean out of the room above. I think the best thing you can do now is to walk yourself off.\"\nIt was the only thing that Vavasor could do, and he did walk himself off. He walked himself off, and went home to his own lodgings in Cecil Street, that he might smooth his feathers after the late encounter before he went down to Westminster to take his seat in the House of Commons. I do not think that he was comfortable when he got there, or that he felt himself very well able to fight another battle that night on behalf of the River Bank. He had not been hurt, but he had been worsted. Grey had probably received more personal damage than had fallen to his share; but Grey had succeeded in expelling him from the room, and he knew that he had been found prostrate on the landing-place when the tailor first saw him.\nBut he might probably have got over the annoyance of this feeling had he not been overwhelmed by a consciousness that everything was going badly with him. He was already beginning to hate his seat in Parliament. What good had it done for him, or was it likely to do for him? He found himself to be associated there with Mr. Bott, and a few others of the same class,--men whom he despised; and even they did not admit him among them without a certain show of superiority on their part. Who has not ascertained by his own experience the different lights through which the same events may be seen, according to the success, or want of success, which pervades the atmosphere at the moment? At the present time everything was unsuccessful with George Vavasor; and though he told himself, almost from hour to hour, that he would go on with the thing which he had begun,--that he would persevere in Parliament till he had obtained a hearing there and created for himself success, he could not himself believe in the promises which he had made to himself. He had looked forward to his entrance into that Chamber as the hour of his triumph; but he had entered it with Mr. Bott, and there had been no triumph to him in doing so. He had sworn to himself that when there he would find men to hear him. Hitherto, indeed, he could not accuse himself of having missed his opportunities; his election had been so recent that he could hardly yet have made the attempt. But he had been there long enough to learn to fancy that there was no glory in attempting. This art of speaking in Parliament, which had appeared to him to be so grand, seemed already to be a humdrum, homely, dull affair. No one seemed to listen much to what was said. To such as himself,--Members without an acquired name,--men did not seem to listen at all. Mr. Palliser had once, in his hearing, spoken for two hours together, and all the House had treated his speech with respect,--had declared that it was useful, solid, conscientious, and what not; but more than half the House had been asleep more than half the time that he was on his legs. Vavasor had not as yet commenced his career as an orator; but night after night, as he sat there, the chance of commencing it with brilliance seemed to be further from him, and still further. Two thousand pounds of his own money, and two thousand more of Alice's money,--or of Mr. Grey's,--he had already spent to make his way into that assembly. He must spend, at any rate, two thousand more if he intended that his career should be prolonged beyond a three months' sitting;--and how was he to get this further sum after what had taken place to-day?\nHe would get it. That was his resolve as he walked in by the apple-woman's stall, under the shadow of the great policeman, and between the two august lamps. He would get it;--as long as Alice had a pound over which he could obtain mastery by any act or violence within his compass. He would get it; even though it should come through the hands of John Grey and Mr. Tombe. He would get it; though in doing so he might destroy his cousin Alice and ruin his sister Kate. He had gone too far to stick at any scruples. Had he not often declared how great had been that murderer who had been able to divest himself of all such scruples,--who had scoured his bosom free from all fears of the hereafter, and, as regarded the present, had dared to trust for everything to success? He would go to Alice and demand the money from her with threats, and with that violence in his eyes which he knew so well how to assume. He believed that when he so demanded it, the money would be forthcoming so as to satisfy, at any rate, his present emergencies.\nThat wretched old man in Westmoreland! If he would but die, there might yet be a hope remaining of permanent success! Even though the estate might be entailed so as to give him no more than a life-interest, still money might be raised on it. His life-interest in it would be worth ten or twelve years' purchase. He had an idea that his grandfather had not as yet made any such will when he left the place in Westmoreland. What a boon it would be if death could be made to overtake the old man before he did so! On this very night he walked about the lobbies of the House, thinking of all this. He went by himself from room to room, roaming along passages, sitting now for ten minutes in the gallery, and then again for a short space in the body of the House,--till he would get up and wander again out into the lobby, impatient of the neighbourhood of Mr. Bott. Certainly just at this time he felt no desire to bring before the House the subject of the River Embankment.\nNor was Mr. Grey much happier when he was left alone, than was his assailant. To give Vavasor his due, the memory of the affray itself did not long trouble him much. The success between the combatants had been nearly equal, and he had, at any rate, spoken his mind freely. His misery had come from other sources. But the reflection that he had been concerned in a row was in itself enough to make John Grey wretched for the time. Such a misfortune had never hitherto befallen him. In all his dealings with men words had been sufficient, and generally words of courtesy had sufficed. To have been personally engaged in a fighting scramble with such a man as George Vavasor was to him terrible. When ordering that his money might be expended with the possible object of saving Alice from her cousin, he had never felt a moment's regret; he had never thought that he was doing more than circumstances fairly demanded of him. But now he was almost driven to utter reproach. \"Oh, Alice! that this thing should have come upon me through thy fault!\"\nWhen Vavasor was led away down stairs by the tailor, and Grey found that no more actual fighting would be required of him, he retired into his bedroom, that he might wash his mouth and free himself from the stains of the combat. He had heard the front door closed, and knew that the miscreant was gone,--the miscreant who had disturbed his quiet. Then he began to think what was the accusation with which Vavasor had charged him. He had been told that he had advanced money on behalf of Alice, in order that he might obtain some power over Alice's fortune, and thus revenge himself upon Alice for her treatment of him. Nothing could be more damnably false than this accusation. Of that he was well aware. But were not the circumstances of a nature to make it appear that the accusation was true? Security for the money advanced by him, of course, he had none;--of course he had desired none;--of course the money had been given out of his own pocket with the sole object of saving Alice, if that might be possible; but of all those who might hear of this affair, how many would know or even guess the truth?\nWhile he was in this wretched state of mind, washing his mouth, and disturbing his spirit, Mr. Jones, his landlord, came up to him. Mr. Jones had known him for some years, and entertained a most profound respect for his character. A rather sporting man than otherwise was Mr. Jones. His father had been a tradesman at Cambridge, and in this way Jones had become known to Mr. Grey. But though given to sport, by which he meant modern prize-fighting and the Epsom course on the Derby day, Mr. Jones was a man who dearly loved respectable customers and respectable lodgers. Mr. Grey, with his property at Nethercoats, and his august manners, and his reputation at Cambridge, was a most respectable lodger, and Mr. Jones could hardly understand how any one could presume to raise his hand against such a man.\n\"Dear, dear, sir--this is a terrible affair!\" he said, as he made his way into the room.\n\"It was very disagreeable, certainly,\" said Grey.\n\"Was the gentleman known to you?\" asked the tailor.\n\"Yes; I know who he is.\"\n\"Any quarrel, sir?\"\n\"Well, yes. I should not have pushed him down stairs had he not quarrelled with me.\"\n\"We can have the police after him if you wish it, sir?\"\n\"I don't wish it at all.\"\n\"Or we might manage to polish him off in any other way, you know.\"\nIt was some time before Mr. Grey could get rid of the tailor, but he did so at last without having told any part of the story to that warlike, worthy, and very anxious individual.",
        "paragraph_chars": [
            [
                0,
                976
            ],
            [
                976,
                2536
            ],
            [
                2536,
                3253
            ],
            [
                3253,
                4443
            ],
            [
                4443,
                4550
            ],
            [
                4550,
                4603
            ],
            [
                4603,
                5258
            ],
            [
                5258,
                6177
            ],
            [
                6177,
                6343
            ],
            [
                6343,
                6668
            ],
            [
                6668,
                6726
            ],
            [
                6726,
                6838
            ],
            [
                6838,
                6850
            ],
            [
                6850,
                7019
            ],
            [
                7019,
                7119
            ],
            [
                7119,
                7380
            ],
            [
                7380,
                7847
            ],
            [
                7847,
                7974
            ],
            [
                7974,
                8059
            ],
            [
                8059,
                8119
            ],
            [
                8119,
                8748
            ],
            [
                8748,
                9036
            ],
            [
                9036,
                9096
            ],
            [
                9096,
                9206
            ],
            [
                9206,
                9432
            ],
            [
                9432,
                9654
            ],
            [
                9654,
                9967
            ],
            [
                9967,
                10133
            ],
            [
                10133,
                10224
            ],
            [
                10224,
                10613
            ],
            [
                10613,
                10648
            ],
            [
                10648,
                11120
            ],
            [
                11120,
                11365
            ],
            [
                11365,
                11559
            ],
            [
                11559,
                12897
            ],
            [
                12897,
                13208
            ],
            [
                13208,
                13755
            ],
            [
                13755,
                14197
            ],
            [
                14197,
                14260
            ],
            [
                14260,
                14450
            ],
            [
                14450,
                15172
            ],
            [
                15172,
                17824
            ],
            [
                17824,
                18861
            ],
            [
                18861,
                19832
            ],
            [
                19832,
                20875
            ],
            [
                20875,
                21983
            ],
            [
                21983,
                22788
            ],
            [
                22788,
                22877
            ],
            [
                22877,
                22927
            ],
            [
                22927,
                22979
            ],
            [
                22979,
                23004
            ],
            [
                23004,
                23024
            ],
            [
                23024,
                23109
            ],
            [
                23109,
                23165
            ],
            [
                23165,
                23191
            ],
            [
                23191,
                23258
            ],
            [
                23258,
                23437
            ]
        ],
        "segment_chars": [
            [
                0,
                66
            ],
            [
                66,
                285
            ],
            [
                285,
                461
            ],
            [
                461,
                529
            ],
            [
                529,
                575
            ],
            [
                575,
                695
            ],
            [
                695,
                811
            ],
            [
                811,
                976
            ],
            [
                976,
                1059
            ],
            [
                1059,
                1451
            ],
            [
                1451,
                1520
            ],
            [
                1520,
                1726
            ],
            [
                1726,
                1803
            ],
            [
                1803,
                2018
            ],
            [
                2018,
                2145
            ],
            [
                2145,
                2260
            ],
            [
                2260,
                2445
            ],
            [
                2445,
                2536
            ],
            [
                2536,
                2699
            ],
            [
                2699,
                2734
            ],
            [
                2734,
                2794
            ],
            [
                2794,
                2909
            ],
            [
                2909,
                3011
            ],
            [
                3011,
                3148
            ],
            [
                3148,
                3198
            ],
            [
                3198,
                3253
            ],
            [
                3253,
                3319
            ],
            [
                3319,
                3430
            ],
            [
                3430,
                3587
            ],
            [
                3587,
                3855
            ],
            [
                3855,
                3951
            ],
            [
                3951,
                4110
            ],
            [
                4110,
                4154
            ],
            [
                4154,
                4385
            ],
            [
                4385,
                4443
            ],
            [
                4443,
                4550
            ],
            [
                4550,
                4577
            ],
            [
                4577,
                4603
            ],
            [
                4603,
                4669
            ],
            [
                4669,
                4726
            ],
            [
                4726,
                4888
            ],
            [
                4888,
                5258
            ],
            [
                5258,
                5309
            ],
            [
                5309,
                5384
            ],
            [
                5384,
                5488
            ],
            [
                5488,
                5670
            ],
            [
                5670,
                5768
            ],
            [
                5768,
                5806
            ],
            [
                5806,
                5815
            ],
            [
                5815,
                5854
            ],
            [
                5854,
                6008
            ],
            [
                6008,
                6177
            ],
            [
                6177,
                6343
            ],
            [
                6343,
                6409
            ],
            [
                6409,
                6668
            ],
            [
                6668,
                6716
            ],
            [
                6716,
                6726
            ],
            [
                6726,
                6756
            ],
            [
                6756,
                6807
            ],
            [
                6807,
                6838
            ],
            [
                6838,
                6850
            ],
            [
                6850,
                6948
            ],
            [
                6948,
                7019
            ],
            [
                7019,
                7119
            ],
            [
                7119,
                7182
            ],
            [
                7182,
                7380
            ],
            [
                7380,
                7561
            ],
            [
                7561,
                7655
            ],
            [
                7655,
                7732
            ],
            [
                7732,
                7847
            ],
            [
                7847,
                7974
            ],
            [
                7974,
                8059
            ],
            [
                8059,
                8119
            ],
            [
                8119,
                8434
            ],
            [
                8434,
                8492
            ],
            [
                8492,
                8672
            ],
            [
                8672,
                8748
            ],
            [
                8748,
                8841
            ],
            [
                8841,
                8936
            ],
            [
                8936,
                8980
            ],
            [
                8980,
                9036
            ],
            [
                9036,
                9096
            ],
            [
                9096,
                9142
            ],
            [
                9142,
                9206
            ],
            [
                9206,
                9353
            ],
            [
                9353,
                9432
            ],
            [
                9432,
                9465
            ],
            [
                9465,
                9494
            ],
            [
                9494,
                9571
            ],
            [
                9571,
                9654
            ],
            [
                9654,
                9762
            ],
            [
                9762,
                9833
            ],
            [
                9833,
                9909
            ],
            [
                9909,
                9967
            ],
            [
                9967,
                10006
            ],
            [
                10006,
                10058
            ],
            [
                10058,
                10133
            ],
            [
                10133,
                10224
            ],
            [
                10224,
                10273
            ],
            [
                10273,
                10335
            ],
            [
                10335,
                10526
            ],
            [
                10526,
                10613
            ],
            [
                10613,
                10648
            ],
            [
                10648,
                10669
            ],
            [
                10669,
                10748
            ],
            [
                10748,
                10993
            ],
            [
                10993,
                11120
            ],
            [
                11120,
                11342
            ],
            [
                11342,
                11365
            ],
            [
                11365,
                11387
            ],
            [
                11387,
                11431
            ],
            [
                11431,
                11451
            ],
            [
                11451,
                11559
            ],
            [
                11559,
                11611
            ],
            [
                11611,
                11741
            ],
            [
                11741,
                11809
            ],
            [
                11809,
                11957
            ],
            [
                11957,
                12034
            ],
            [
                12034,
                12125
            ],
            [
                12125,
                12224
            ],
            [
                12224,
                12341
            ],
            [
                12341,
                12443
            ],
            [
                12443,
                12545
            ],
            [
                12545,
                12682
            ],
            [
                12682,
                12740
            ],
            [
                12740,
                12897
            ],
            [
                12897,
                13075
            ],
            [
                13075,
                13208
            ],
            [
                13208,
                13326
            ],
            [
                13326,
                13412
            ],
            [
                13412,
                13509
            ],
            [
                13509,
                13584
            ],
            [
                13584,
                13615
            ],
            [
                13615,
                13755
            ],
            [
                13755,
                13783
            ],
            [
                13783,
                13889
            ],
            [
                13889,
                14122
            ],
            [
                14122,
                14150
            ],
            [
                14150,
                14197
            ],
            [
                14197,
                14260
            ],
            [
                14260,
                14314
            ],
            [
                14314,
                14386
            ],
            [
                14386,
                14450
            ],
            [
                14450,
                14524
            ],
            [
                14524,
                14734
            ],
            [
                14734,
                14895
            ],
            [
                14895,
                14942
            ],
            [
                14942,
                15172
            ],
            [
                15172,
                15327
            ],
            [
                15327,
                15384
            ],
            [
                15384,
                15447
            ],
            [
                15447,
                15657
            ],
            [
                15657,
                15858
            ],
            [
                15858,
                16220
            ],
            [
                16220,
                16391
            ],
            [
                16391,
                16462
            ],
            [
                16462,
                16624
            ],
            [
                16624,
                16715
            ],
            [
                16715,
                16846
            ],
            [
                16846,
                16893
            ],
            [
                16893,
                16984
            ],
            [
                16984,
                17273
            ],
            [
                17273,
                17465
            ],
            [
                17465,
                17620
            ],
            [
                17620,
                17824
            ],
            [
                17824,
                17841
            ],
            [
                17841,
                17981
            ],
            [
                17981,
                18106
            ],
            [
                18106,
                18196
            ],
            [
                18196,
                18292
            ],
            [
                18292,
                18338
            ],
            [
                18338,
                18596
            ],
            [
                18596,
                18733
            ],
            [
                18733,
                18861
            ],
            [
                18861,
                18900
            ],
            [
                18900,
                18979
            ],
            [
                18979,
                19103
            ],
            [
                19103,
                19173
            ],
            [
                19173,
                19283
            ],
            [
                19283,
                19372
            ],
            [
                19372,
                19455
            ],
            [
                19455,
                19723
            ],
            [
                19723,
                19832
            ],
            [
                19832,
                19910
            ],
            [
                19910,
                19998
            ],
            [
                19998,
                20105
            ],
            [
                20105,
                20145
            ],
            [
                20145,
                20262
            ],
            [
                20262,
                20313
            ],
            [
                20313,
                20415
            ],
            [
                20415,
                20525
            ],
            [
                20525,
                20754
            ],
            [
                20754,
                20802
            ],
            [
                20802,
                20814
            ],
            [
                20814,
                20875
            ],
            [
                20875,
                21104
            ],
            [
                21104,
                21222
            ],
            [
                21222,
                21305
            ],
            [
                21305,
                21494
            ],
            [
                21494,
                21553
            ],
            [
                21553,
                21580
            ],
            [
                21580,
                21671
            ],
            [
                21671,
                21983
            ],
            [
                21983,
                22115
            ],
            [
                22115,
                22214
            ],
            [
                22214,
                22266
            ],
            [
                22266,
                22364
            ],
            [
                22364,
                22554
            ],
            [
                22554,
                22788
            ],
            [
                22788,
                22834
            ],
            [
                22834,
                22877
            ],
            [
                22877,
                22927
            ],
            [
                22927,
                22961
            ],
            [
                22961,
                22979
            ],
            [
                22979,
                23004
            ],
            [
                23004,
                23024
            ],
            [
                23024,
                23036
            ],
            [
                23036,
                23109
            ],
            [
                23109,
                23165
            ],
            [
                23165,
                23191
            ],
            [
                23191,
                23258
            ],
            [
                23258,
                23437
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                43,
                66
            ],
            [
                66,
                121
            ],
            [
                187,
                203
            ],
            [
                228,
                236
            ],
            [
                253,
                285
            ],
            [
                285,
                300
            ],
            [
                306,
                308
            ],
            [
                319,
                358
            ],
            [
                381,
                390
            ],
            [
                363,
                377
            ],
            [
                390,
                402
            ],
            [
                408,
                422
            ],
            [
                444,
                461
            ],
            [
                467,
                473
            ],
            [
                486,
                490
            ],
            [
                491,
                507
            ],
            [
                521,
                527
            ],
            [
                527,
                528
            ],
            [
                529,
                575
            ],
            [
                575,
                684
            ],
            [
                693,
                695
            ],
            [
                818,
                827
            ],
            [
                834,
                841
            ],
            [
                811,
                817
            ],
            [
                842,
                881
            ],
            [
                883,
                976
            ],
            [
                976,
                1014
            ],
            [
                1048,
                1059
            ],
            [
                1059,
                1113
            ],
            [
                1116,
                1147
            ],
            [
                1155,
                1165
            ],
            [
                1168,
                1184
            ],
            [
                1220,
                1244
            ],
            [
                1247,
                1295
            ],
            [
                1304,
                1358
            ],
            [
                1371,
                1372
            ],
            [
                1383,
                1401
            ],
            [
                1520,
                1545
            ],
            [
                1550,
                1607
            ],
            [
                1609,
                1684
            ],
            [
                1702,
                1726
            ],
            [
                1730,
                1770
            ],
            [
                1781,
                1802
            ],
            [
                2018,
                2145
            ],
            [
                2145,
                2198
            ],
            [
                2229,
                2232
            ],
            [
                2215,
                2219
            ],
            [
                2233,
                2260
            ],
            [
                2269,
                2279
            ],
            [
                2343,
                2365
            ],
            [
                2260,
                2264
            ],
            [
                2381,
                2445
            ],
            [
                2445,
                2536
            ],
            [
                2536,
                2545
            ],
            [
                2563,
                2610
            ],
            [
                2629,
                2651
            ],
            [
                2672,
                2699
            ],
            [
                2699,
                2734
            ],
            [
                2794,
                2909
            ],
            [
                2909,
                2921
            ],
            [
                2942,
                2946
            ],
            [
                2949,
                2953
            ],
            [
                2968,
                2972
            ],
            [
                3000,
                3011
            ],
            [
                3011,
                3070
            ],
            [
                3071,
                3148
            ],
            [
                3148,
                3198
            ],
            [
                3198,
                3253
            ],
            [
                3253,
                3290
            ],
            [
                3296,
                3299
            ],
            [
                3317,
                3319
            ],
            [
                3319,
                3343
            ],
            [
                3374,
                3384
            ],
            [
                3394,
                3430
            ],
            [
                3430,
                3452
            ],
            [
                3500,
                3555
            ],
            [
                3580,
                3587
            ],
            [
                3617,
                3622
            ],
            [
                3638,
                3639
            ],
            [
                3706,
                3739
            ],
            [
                3762,
                3780
            ],
            [
                3787,
                3797
            ],
            [
                3820,
                3833
            ],
            [
                3845,
                3855
            ],
            [
                3951,
                3963
            ],
            [
                3981,
                4004
            ],
            [
                4035,
                4052
            ],
            [
                4110,
                4131
            ],
            [
                4149,
                4153
            ],
            [
                4170,
                4179
            ],
            [
                4183,
                4209
            ],
            [
                4211,
                4214
            ],
            [
                4221,
                4240
            ],
            [
                4294,
                4322
            ],
            [
                4334,
                4346
            ],
            [
                4383,
                4385
            ],
            [
                4393,
                4443
            ],
            [
                4443,
                4462
            ],
            [
                4489,
                4550
            ],
            [
                4550,
                4551
            ],
            [
                4567,
                4577
            ],
            [
                4577,
                4603
            ],
            [
                4603,
                4669
            ],
            [
                4669,
                4674
            ],
            [
                4684,
                4701
            ],
            [
                4712,
                4726
            ],
            [
                4726,
                4752
            ],
            [
                4762,
                4771
            ],
            [
                4753,
                4756
            ],
            [
                4796,
                4875
            ],
            [
                4986,
                4991
            ],
            [
                4997,
                5022
            ],
            [
                5022,
                5023
            ],
            [
                4897,
                4899
            ],
            [
                5024,
                5026
            ],
            [
                5102,
                5128
            ],
            [
                5256,
                5258
            ],
            [
                5307,
                5308
            ],
            [
                5303,
                5307
            ],
            [
                5288,
                5291
            ],
            [
                5364,
                5367
            ],
            [
                5336,
                5363
            ],
            [
                5382,
                5384
            ],
            [
                5384,
                5392
            ],
            [
                5409,
                5439
            ],
            [
                5459,
                5468
            ],
            [
                5486,
                5488
            ],
            [
                5488,
                5529
            ],
            [
                5668,
                5670
            ],
            [
                5670,
                5724
            ],
            [
                5766,
                5767
            ],
            [
                5768,
                5806
            ],
            [
                5806,
                5814
            ],
            [
                5815,
                5848
            ],
            [
                5851,
                5853
            ],
            [
                5854,
                5902
            ],
            [
                5949,
                5954
            ],
            [
                6011,
                6039
            ],
            [
                6070,
                6075
            ],
            [
                6089,
                6098
            ],
            [
                6109,
                6134
            ],
            [
                6138,
                6177
            ],
            [
                6177,
                6258
            ],
            [
                6306,
                6314
            ],
            [
                6278,
                6282
            ],
            [
                6321,
                6343
            ],
            [
                6371,
                6394
            ],
            [
                6343,
                6347
            ],
            [
                6354,
                6362
            ],
            [
                6395,
                6409
            ],
            [
                6476,
                6510
            ],
            [
                6541,
                6546
            ],
            [
                6526,
                6528
            ],
            [
                6639,
                6641
            ],
            [
                6586,
                6638
            ],
            [
                6666,
                6668
            ],
            [
                6668,
                6716
            ],
            [
                6716,
                6726
            ],
            [
                6726,
                6727
            ],
            [
                6735,
                6756
            ],
            [
                6756,
                6784
            ],
            [
                6797,
                6807
            ],
            [
                6807,
                6838
            ],
            [
                6838,
                6844
            ],
            [
                6847,
                6850
            ],
            [
                6850,
                6866
            ],
            [
                6876,
                6948
            ],
            [
                6948,
                7019
            ],
            [
                7019,
                7119
            ],
            [
                7119,
                7145
            ],
            [
                7155,
                7182
            ],
            [
                7182,
                7360
            ],
            [
                7361,
                7366
            ],
            [
                7377,
                7380
            ],
            [
                7380,
                7433
            ],
            [
                7505,
                7512
            ],
            [
                7434,
                7469
            ],
            [
                7559,
                7561
            ],
            [
                7561,
                7654
            ],
            [
                7655,
                7732
            ],
            [
                7732,
                7847
            ],
            [
                7847,
                7868
            ],
            [
                7920,
                7931
            ],
            [
                7938,
                7974
            ],
            [
                7974,
                8059
            ],
            [
                8059,
                8060
            ],
            [
                8093,
                8119
            ],
            [
                8119,
                8129
            ],
            [
                8134,
                8142
            ],
            [
                8130,
                8133
            ],
            [
                8157,
                8158
            ],
            [
                8263,
                8277
            ],
            [
                8287,
                8303
            ],
            [
                8249,
                8250
            ],
            [
                8358,
                8363
            ],
            [
                8383,
                8411
            ],
            [
                8420,
                8432
            ],
            [
                8432,
                8434
            ],
            [
                8492,
                8504
            ],
            [
                8516,
                8588
            ],
            [
                8644,
                8649
            ],
            [
                8596,
                8603
            ],
            [
                8670,
                8671
            ],
            [
                8672,
                8748
            ],
            [
                8748,
                8759
            ],
            [
                8802,
                8805
            ],
            [
                8811,
                8841
            ],
            [
                8949,
                8965
            ],
            [
                8971,
                8980
            ],
            [
                8980,
                9017
            ],
            [
                9033,
                9036
            ],
            [
                9036,
                9037
            ],
            [
                9045,
                9096
            ],
            [
                9096,
                9140
            ],
            [
                9206,
                9285
            ],
            [
                9294,
                9307
            ],
            [
                9335,
                9353
            ],
            [
                9353,
                9432
            ],
            [
                9432,
                9465
            ],
            [
                9465,
                9494
            ],
            [
                9494,
                9529
            ],
            [
                9540,
                9571
            ],
            [
                9571,
                9654
            ],
            [
                9654,
                9762
            ],
            [
                9762,
                9805
            ],
            [
                9812,
                9833
            ],
            [
                9833,
                9909
            ],
            [
                9909,
                9967
            ],
            [
                9967,
                10006
            ],
            [
                10006,
                10056
            ],
            [
                10133,
                10135
            ],
            [
                10152,
                10224
            ],
            [
                10224,
                10273
            ],
            [
                10273,
                10335
            ],
            [
                10335,
                10452
            ],
            [
                10459,
                10526
            ],
            [
                10526,
                10613
            ],
            [
                10613,
                10648
            ],
            [
                10648,
                10669
            ],
            [
                10669,
                10748
            ],
            [
                10748,
                10857
            ],
            [
                10907,
                10993
            ],
            [
                10993,
                11026
            ],
            [
                11061,
                11120
            ],
            [
                11120,
                11166
            ],
            [
                11175,
                11185
            ],
            [
                11260,
                11342
            ],
            [
                11342,
                11365
            ],
            [
                11365,
                11387
            ],
            [
                11387,
                11431
            ],
            [
                11431,
                11443
            ],
            [
                11448,
                11451
            ],
            [
                11451,
                11531
            ],
            [
                11549,
                11559
            ],
            [
                11559,
                11583
            ],
            [
                11588,
                11591
            ],
            [
                11597,
                11609
            ],
            [
                11584,
                11587
            ],
            [
                11609,
                11611
            ],
            [
                11611,
                11644
            ],
            [
                11653,
                11688
            ],
            [
                11704,
                11740
            ],
            [
                11741,
                11782
            ],
            [
                11807,
                11809
            ],
            [
                11858,
                11957
            ],
            [
                11957,
                11993
            ],
            [
                12032,
                12033
            ],
            [
                12034,
                12125
            ],
            [
                12125,
                12174
            ],
            [
                12222,
                12224
            ],
            [
                12224,
                12262
            ],
            [
                12313,
                12334
            ],
            [
                12263,
                12272
            ],
            [
                12273,
                12286
            ],
            [
                12339,
                12341
            ],
            [
                12341,
                12347
            ],
            [
                12352,
                12399
            ],
            [
                12426,
                12443
            ],
            [
                12490,
                12545
            ],
            [
                12560,
                12573
            ],
            [
                12579,
                12595
            ],
            [
                12613,
                12618
            ],
            [
                12625,
                12682
            ],
            [
                12740,
                12742
            ],
            [
                12830,
                12889
            ],
            [
                12895,
                12897
            ],
            [
                12897,
                13035
            ],
            [
                13054,
                13074
            ],
            [
                13075,
                13097
            ],
            [
                13108,
                13208
            ],
            [
                13208,
                13257
            ],
            [
                13311,
                13314
            ],
            [
                13262,
                13310
            ],
            [
                13324,
                13326
            ],
            [
                13475,
                13483
            ],
            [
                13507,
                13508
            ],
            [
                13755,
                13783
            ],
            [
                13783,
                13798
            ],
            [
                13848,
                13851
            ],
            [
                13838,
                13847
            ],
            [
                13830,
                13833
            ],
            [
                13852,
                13888
            ],
            [
                14197,
                14257
            ],
            [
                14260,
                14314
            ],
            [
                14314,
                14386
            ],
            [
                14386,
                14450
            ],
            [
                14450,
                14524
            ],
            [
                14524,
                14526
            ],
            [
                14551,
                14567
            ],
            [
                14572,
                14597
            ],
            [
                14612,
                14641
            ],
            [
                14647,
                14734
            ],
            [
                14734,
                14895
            ],
            [
                14895,
                14942
            ],
            [
                15092,
                15098
            ],
            [
                14951,
                14959
            ],
            [
                14942,
                14946
            ],
            [
                15018,
                15045
            ],
            [
                15056,
                15059
            ],
            [
                15170,
                15172
            ],
            [
                15176,
                15184
            ],
            [
                15194,
                15327
            ],
            [
                15327,
                15384
            ],
            [
                15384,
                15413
            ],
            [
                15445,
                15447
            ],
            [
                15447,
                15463
            ],
            [
                15470,
                15480
            ],
            [
                15487,
                15505
            ],
            [
                15512,
                15536
            ],
            [
                15539,
                15592
            ],
            [
                15604,
                15613
            ],
            [
                15622,
                15641
            ],
            [
                15655,
                15657
            ],
            [
                15931,
                15953
            ],
            [
                15981,
                16034
            ],
            [
                16037,
                16086
            ],
            [
                16145,
                16157
            ],
            [
                16166,
                16219
            ],
            [
                16220,
                16370
            ],
            [
                16378,
                16380
            ],
            [
                16389,
                16391
            ],
            [
                16480,
                16482
            ],
            [
                16557,
                16560
            ],
            [
                16468,
                16470
            ],
            [
                16597,
                16600
            ],
            [
                16542,
                16543
            ],
            [
                16624,
                16715
            ],
            [
                16715,
                16824
            ],
            [
                16833,
                16846
            ],
            [
                16846,
                16893
            ],
            [
                16984,
                17005
            ],
            [
                17023,
                17107
            ],
            [
                17110,
                17223
            ],
            [
                17271,
                17272
            ],
            [
                17273,
                17280
            ],
            [
                17375,
                17384
            ],
            [
                17404,
                17465
            ],
            [
                17563,
                17583
            ],
            [
                17465,
                17535
            ],
            [
                17544,
                17546
            ],
            [
                17550,
                17560
            ],
            [
                17618,
                17620
            ],
            [
                17620,
                17633
            ],
            [
                17648,
                17665
            ],
            [
                17816,
                17818
            ],
            [
                17686,
                17696
            ],
            [
                17747,
                17748
            ],
            [
                17750,
                17771
            ],
            [
                17681,
                17685
            ],
            [
                17789,
                17815
            ],
            [
                17822,
                17824
            ],
            [
                17824,
                17841
            ],
            [
                17841,
                17874
            ],
            [
                17951,
                17981
            ],
            [
                17981,
                17997
            ],
            [
                17999,
                18027
            ],
            [
                18106,
                18121
            ],
            [
                18123,
                18127
            ],
            [
                18135,
                18137
            ],
            [
                18150,
                18157
            ],
            [
                18171,
                18180
            ],
            [
                18162,
                18167
            ],
            [
                18181,
                18184
            ],
            [
                18209,
                18211
            ],
            [
                18235,
                18292
            ],
            [
                18292,
                18338
            ],
            [
                18596,
                18732
            ],
            [
                18861,
                18890
            ],
            [
                18894,
                18900
            ],
            [
                18900,
                18902
            ],
            [
                18903,
                18911
            ],
            [
                18916,
                18919
            ],
            [
                18977,
                18979
            ],
            [
                19391,
                19453
            ],
            [
                19455,
                19462
            ],
            [
                19474,
                19491
            ],
            [
                19515,
                19569
            ],
            [
                19653,
                19677
            ],
            [
                19453,
                19454
            ],
            [
                19832,
                19861
            ],
            [
                19908,
                19910
            ],
            [
                19935,
                19952
            ],
            [
                19960,
                19974
            ],
            [
                19980,
                19987
            ],
            [
                19918,
                19925
            ],
            [
                19992,
                19996
            ],
            [
                20145,
                20148
            ],
            [
                20229,
                20238
            ],
            [
                20200,
                20203
            ],
            [
                20239,
                20247
            ],
            [
                20260,
                20262
            ],
            [
                20348,
                20351
            ],
            [
                20352,
                20356
            ],
            [
                20313,
                20315
            ],
            [
                20413,
                20415
            ],
            [
                20525,
                20562
            ],
            [
                20607,
                20666
            ],
            [
                20754,
                20785
            ],
            [
                20792,
                20801
            ],
            [
                20802,
                20814
            ],
            [
                20814,
                20823
            ],
            [
                20830,
                20862
            ],
            [
                20867,
                20875
            ],
            [
                20880,
                20887
            ],
            [
                20926,
                20927
            ],
            [
                20932,
                20936
            ],
            [
                21001,
                21025
            ],
            [
                21041,
                21049
            ],
            [
                21102,
                21104
            ],
            [
                21222,
                21244
            ],
            [
                21280,
                21287
            ],
            [
                21258,
                21268
            ],
            [
                21367,
                21368
            ],
            [
                21322,
                21351
            ],
            [
                21415,
                21422
            ],
            [
                21352,
                21358
            ],
            [
                21369,
                21377
            ],
            [
                21392,
                21414
            ],
            [
                21430,
                21435
            ],
            [
                21441,
                21456
            ],
            [
                21468,
                21494
            ],
            [
                21494,
                21553
            ],
            [
                21580,
                21583
            ],
            [
                21631,
                21633
            ],
            [
                21589,
                21592
            ],
            [
                21634,
                21640
            ],
            [
                21623,
                21625
            ],
            [
                21665,
                21671
            ],
            [
                21863,
                21865
            ],
            [
                21922,
                21952
            ],
            [
                21966,
                21983
            ],
            [
                21983,
                22026
            ],
            [
                22072,
                22115
            ],
            [
                22115,
                22158
            ],
            [
                22171,
                22198
            ],
            [
                22212,
                22213
            ],
            [
                22788,
                22804
            ],
            [
                22806,
                22834
            ],
            [
                22834,
                22848
            ],
            [
                22867,
                22876
            ],
            [
                22927,
                22960
            ],
            [
                22979,
                22983
            ],
            [
                23001,
                23004
            ],
            [
                23004,
                23024
            ],
            [
                23024,
                23036
            ],
            [
                23036,
                23064
            ],
            [
                23106,
                23109
            ],
            [
                23109,
                23165
            ],
            [
                23165,
                23191
            ],
            [
                23191,
                23258
            ],
            [
                23258,
                23333
            ],
            [
                23342,
                23349
            ],
            [
                23362,
                23391
            ],
            [
                23401,
                23407
            ],
            [
                23409,
                23425
            ],
            [
                23436,
                23437
            ]
        ],
        "row_chars": [
            [
                0,
                66
            ],
            [
                66,
                285
            ],
            [
                285,
                461
            ],
            [
                461,
                529
            ],
            [
                529,
                575
            ],
            [
                575,
                695
            ],
            [
                695,
                811
            ],
            [
                811,
                976
            ],
            [
                976,
                1059
            ],
            [
                1059,
                1451
            ],
            [
                1451,
                1520
            ],
            [
                1520,
                1726
            ],
            [
                1726,
                1803
            ],
            [
                1803,
                2018
            ],
            [
                2018,
                2145
            ],
            [
                2145,
                2260
            ],
            [
                2260,
                2445
            ],
            [
                2445,
                2536
            ],
            [
                2536,
                2699
            ],
            [
                2699,
                2734
            ],
            [
                2734,
                2794
            ],
            [
                2794,
                2909
            ],
            [
                2909,
                3011
            ],
            [
                3011,
                3148
            ],
            [
                3148,
                3198
            ],
            [
                3198,
                3253
            ],
            [
                3253,
                3319
            ],
            [
                3319,
                3430
            ],
            [
                3430,
                3587
            ],
            [
                3587,
                3855
            ],
            [
                3855,
                3951
            ],
            [
                3951,
                4154
            ],
            [
                4154,
                4385
            ],
            [
                4385,
                4443
            ],
            [
                4443,
                4550
            ],
            [
                4550,
                4577
            ],
            [
                4577,
                4603
            ],
            [
                4603,
                4669
            ],
            [
                4669,
                4726
            ],
            [
                4726,
                5258
            ],
            [
                5258,
                5384
            ],
            [
                5384,
                5488
            ],
            [
                5488,
                5670
            ],
            [
                5670,
                5768
            ],
            [
                5768,
                5806
            ],
            [
                5806,
                5815
            ],
            [
                5815,
                5854
            ],
            [
                5854,
                6177
            ],
            [
                6177,
                6343
            ],
            [
                6343,
                6409
            ],
            [
                6409,
                6668
            ],
            [
                6668,
                6716
            ],
            [
                6716,
                6726
            ],
            [
                6726,
                6756
            ],
            [
                6756,
                6807
            ],
            [
                6807,
                6838
            ],
            [
                6838,
                6850
            ],
            [
                6850,
                6948
            ],
            [
                6948,
                7019
            ],
            [
                7019,
                7119
            ],
            [
                7119,
                7182
            ],
            [
                7182,
                7380
            ],
            [
                7380,
                7561
            ],
            [
                7561,
                7655
            ],
            [
                7655,
                7732
            ],
            [
                7732,
                7847
            ],
            [
                7847,
                7974
            ],
            [
                7974,
                8059
            ],
            [
                8059,
                8119
            ],
            [
                8119,
                8434
            ],
            [
                8434,
                8492
            ],
            [
                8492,
                8672
            ],
            [
                8672,
                8748
            ],
            [
                8748,
                8841
            ],
            [
                8841,
                8936
            ],
            [
                8936,
                8980
            ],
            [
                8980,
                9036
            ],
            [
                9036,
                9096
            ],
            [
                9096,
                9142
            ],
            [
                9142,
                9206
            ],
            [
                9206,
                9353
            ],
            [
                9353,
                9432
            ],
            [
                9432,
                9465
            ],
            [
                9465,
                9494
            ],
            [
                9494,
                9571
            ],
            [
                9571,
                9654
            ],
            [
                9654,
                9762
            ],
            [
                9762,
                9833
            ],
            [
                9833,
                9909
            ],
            [
                9909,
                9967
            ],
            [
                9967,
                10006
            ],
            [
                10006,
                10058
            ],
            [
                10058,
                10133
            ],
            [
                10133,
                10224
            ],
            [
                10224,
                10273
            ],
            [
                10273,
                10335
            ],
            [
                10335,
                10526
            ],
            [
                10526,
                10613
            ],
            [
                10613,
                10648
            ],
            [
                10648,
                10669
            ],
            [
                10669,
                10748
            ],
            [
                10748,
                10993
            ],
            [
                10993,
                11120
            ],
            [
                11120,
                11342
            ],
            [
                11342,
                11365
            ],
            [
                11365,
                11387
            ],
            [
                11387,
                11431
            ],
            [
                11431,
                11451
            ],
            [
                11451,
                11559
            ],
            [
                11559,
                11611
            ],
            [
                11611,
                11741
            ],
            [
                11741,
                11809
            ],
            [
                11809,
                11957
            ],
            [
                11957,
                12034
            ],
            [
                12034,
                12125
            ],
            [
                12125,
                12224
            ],
            [
                12224,
                12341
            ],
            [
                12341,
                12443
            ],
            [
                12443,
                12545
            ],
            [
                12545,
                12682
            ],
            [
                12682,
                12740
            ],
            [
                12740,
                12897
            ],
            [
                12897,
                13075
            ],
            [
                13075,
                13208
            ],
            [
                13208,
                13326
            ],
            [
                13326,
                13412
            ],
            [
                13412,
                13509
            ],
            [
                13509,
                13584
            ],
            [
                13584,
                13615
            ],
            [
                13615,
                13755
            ],
            [
                13755,
                13783
            ],
            [
                13783,
                13889
            ],
            [
                13889,
                14122
            ],
            [
                14122,
                14150
            ],
            [
                14150,
                14197
            ],
            [
                14197,
                14260
            ],
            [
                14260,
                14314
            ],
            [
                14314,
                14386
            ],
            [
                14386,
                14450
            ],
            [
                14450,
                14524
            ],
            [
                14524,
                14734
            ],
            [
                14734,
                14895
            ],
            [
                14895,
                14942
            ],
            [
                14942,
                15172
            ],
            [
                15172,
                15327
            ],
            [
                15327,
                15384
            ],
            [
                15384,
                15447
            ],
            [
                15447,
                15657
            ],
            [
                15657,
                15858
            ],
            [
                15858,
                16220
            ],
            [
                16220,
                16391
            ],
            [
                16391,
                16462
            ],
            [
                16462,
                16715
            ],
            [
                16715,
                16846
            ],
            [
                16846,
                16893
            ],
            [
                16893,
                16984
            ],
            [
                16984,
                17273
            ],
            [
                17273,
                17465
            ],
            [
                17465,
                17620
            ],
            [
                17620,
                17824
            ],
            [
                17824,
                17841
            ],
            [
                17841,
                17981
            ],
            [
                17981,
                18292
            ],
            [
                18292,
                18338
            ],
            [
                18338,
                18596
            ],
            [
                18596,
                18733
            ],
            [
                18733,
                18861
            ],
            [
                18861,
                18900
            ],
            [
                18900,
                18979
            ],
            [
                18979,
                19103
            ],
            [
                19103,
                19173
            ],
            [
                19173,
                19283
            ],
            [
                19283,
                19372
            ],
            [
                19372,
                19723
            ],
            [
                19723,
                19832
            ],
            [
                19832,
                19910
            ],
            [
                19910,
                20262
            ],
            [
                20262,
                20313
            ],
            [
                20313,
                20415
            ],
            [
                20415,
                20525
            ],
            [
                20525,
                20802
            ],
            [
                20802,
                20814
            ],
            [
                20814,
                20875
            ],
            [
                20875,
                21104
            ],
            [
                21104,
                21222
            ],
            [
                21222,
                21494
            ],
            [
                21494,
                21553
            ],
            [
                21553,
                21580
            ],
            [
                21580,
                21671
            ],
            [
                21671,
                21983
            ],
            [
                21983,
                22115
            ],
            [
                22115,
                22214
            ],
            [
                22214,
                22266
            ],
            [
                22266,
                22364
            ],
            [
                22364,
                22554
            ],
            [
                22554,
                22788
            ],
            [
                22788,
                22834
            ],
            [
                22834,
                22877
            ],
            [
                22877,
                22927
            ],
            [
                22927,
                22961
            ],
            [
                22961,
                22979
            ],
            [
                22979,
                23004
            ],
            [
                23004,
                23024
            ],
            [
                23024,
                23036
            ],
            [
                23036,
                23109
            ],
            [
                23109,
                23165
            ],
            [
                23165,
                23191
            ],
            [
                23191,
                23258
            ],
            [
                23258,
                23437
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Tombe had gained nothing by his crafty silence. George Vavasor felt perfectly certain, as he walked out, that the money had come through the hands of John Grey. He did not care to speculate whether the payments had been made from his rival's personal funds, or whether his rival had been dispensing Alice's fortune. In either case, his position was bitter enough.\nThe truth never for a moment occurred to him. He never dreamed that there might be a conspiracy in the matter, of which Alice was as ignorant as he himself. It seemed certain to him that Alice and Mr. Grey were in league; and if they were in league, what must he think of Alice, and of her engagement with himself!\nThere are men who rarely think well of any woman. They put their mothers and sisters into the background - as though they belonged to some race apart - and then declare that all women are false; that no woman can be trusted unless her ugliness protects her; and that every woman may be attacked as fairly as a deer on a mountain. There had been periods of Vavasor's life when he had believed implicitly in his cousin Alice; but then there had been other moments in which he had ridiculed himself for believing in any woman. As he had grown older the moments of his belief had become more rare.\nEvery man tries to believe in the honesty of his future wife; and, therefore, Vavasor had tried, and had in his way, believed. He had flattered himself, too, that Alice's heart had leaned towards him more than to that other suitor. He thought that she had found her feelings for Grey were too cold, and had therefore returned where she had truly loved. Vavasor, though he did not love much himself, was willing enough to be the object of love.\nThis idea had been greatly shaken by Alice's treatment of him; but still he had not thought that she was false to him. Now, what could he believe of her? As he walked out into St. Paul's Churchyard he called her by every name which is most offensive to a woman's ears. He hated her just then even more bitterly than John Grey. She must have deceived him with unparalleled hypocrisy, and have lied to him and to his sister Kate as hardly any woman had ever lied before. Or could it be that Kate, also, was lying to him? If so, Kate also should be included in the punishment.\nBut why should they have conspired to give him money? There had been no deceit about the pounds which Scruby had already swallowed. They had been supplied; and he had no doubt that more would be supplied if he kept quiet. As he walked, he tried to persuade himself that he should hide his anger till after payment had been made for the next election. It was still troubling to think that he should owe anything to John Grey; but what would he gain by stopping now?\nHe walked quickly along Fleet Street and the Strand, and was near Pall Mall East before he had decided what to do. At the corner of Suffolk Street he met John Grey.\n\"Mr. Grey,\" he said, \"I was this moment going to call on you at your lodgings.\"\n\"Were you? Shall I return with you?\"\n\"If you please,\" said Vavasor, leading the way up Suffolk Street. There was no other greeting between them. Mr. Grey himself, though a courteous man generally, would probably have passed Vavasor in the street with no more than the barest greeting; but Vavasor had spoken to him with a civil appearance, as if he did not intend to be offensive.\nMr. Grey unlocked the door of his house, and Vavasor followed him upstairs. Mr. Grey felt almost angry with himself for admitting his enemy. He was sure that no good could come of it. There they were, however, together in the sitting-room.\n\"Will you take a chair, Mr. Vavasor?\" he said.\n\"No,\" said Vavasor; \"I will stand.\"\nAnd he stood up, holding his hat behind his back, and looked full into Grey's face; and the great scar seemed to open itself and become purple with fresh blood stains.\n\"I have come here from Mr. Tombe's office in the City,\" said Vavasor, \"to ask you how you have been interfering in my money matters?\"\nMr. Grey could not answer this unexpected question very quickly. He did not know what Mr. Tombe had said; and he needed to consider how much of the truth he was bound to tell in answer.\n\"Do you say that you have come from Mr. Tombe?\" he asked.\n\"You heard me say so. I have come here direct from his chambers. He is your lawyer, I believe?\"\n\"He is.\"\n\"And I have come to ask you what interference you have lately taken in my money matters. When you have answered that, I shall have other questions to ask you.\"\n\"But, Mr. Vavasor, has it occurred to you that I may not be disposed to answer questions so asked?\"\n\"It has not occurred to me that you will prevaricate. If there has been no such interference, I will ask your pardon, and go away; but if there has been such interference on your part, I have a right to demand that you shall explain it to me.\"\nGrey had now made up his mind that it would be better for all concerned that he should tell the whole story. The angry man evidently knew something, and it would be better that he should know the truth.\n\"There has been such interference, Mr. Vavasor, if you choose to call it so. Money, to the extent of two thousand pounds, I think, has by my directions been paid to your credit by Mr. Tombe.\"\n\"Well,\" said Vavasor, tapping the table with his fingers impatiently.\n\"I hardly know how to explain all the circumstances under which this has been done.\"\n\"Nevertheless, you must explain them.\"\nGrey was a tranquil man, who would take trouble to avoid a quarrel; but his courage was quite as high as his opponent's. It was clear that Vavasor intended to bully him, and he made up his mind at once that he was ready for a quarrel.\n\"My difficulty in explaining it comes from consideration for you,\" he said.\n\"Then I beg you to have no consideration for me. I intend to have no consideration for you. Now, let me know why you have meddled.\"\n\"I might, perhaps, better refer you to your uncle.\"\n\"No, sir; Mr. Tombe is not my uncle's lawyer.\"\n\"But it was by agreement with your uncle that I commissioned Mr. Tombe to raise the money you wished to borrow from your cousin. We thought it better that her fortune should not be for the moment disturbed.\"\n\"But what had you to do with it? Why should you have done it? In the first place, I don't believe it; it is altogether improbable. But why should he come to you of all men to raise money on his daughter's behalf?\"\n\"Unless you can behave yourself with more discretion, Mr. Vavasor, you must leave the room,\" said Mr. Grey. Then, as Vavasor simply sneered at him, but said nothing, he went on. \"It was I who suggested to your uncle that this arrangement should be made. I did not wish to see Miss Vavasor's fortune squandered.\"\n\"And what was her fortune to you, sir? Are you aware that she is engaged to me as my wife?\"\n\"I decline to discuss with you Miss Vavasor's present or future position.\"\n\"By heavens, then, you shall hear me discuss it! She was engaged to you, and she has given you your dismissal. If you had understood anything of the conduct which is usual among gentlemen, or if you had had any particle of pride, sir, you would have left her and never mentioned her name again. I now find you meddling with her money matters, so as to get a hold upon her fortune.\"\n\"I have no hold upon her fortune.\"\n\"Yes, sir, you have. You do not advance two thousand pounds without knowing that you have security. She has rejected you; and in order that you may be revenged, or that you may have some further hold upon her, you have contrived this rascally pettifogging way of obtaining power over her income. The money shall be repaid at once; and if I find you interfering again, I will expose you.\"\n\"Mr. Vavasor,\" said Grey very slowly, in a low voice, but very much in earnest, \"you have used words in your anger which I cannot allow to pass. You must recall them.\"\n\"What were the words? I said that you were a pettifogging rascal. I now repeat that.\" As he spoke he put on his hat, so as to leave both his hands ready for action if required.\nGrey was much the larger and the stronger man. It may be doubted whether he knew the extent of his own strength, but he resolved that he must now use it.\n\"There is no help for it,\" he said, as he opened the door. As he did so he became conscious that his mouth was full of blood from a sharp blow upon his face. Vavasor had struck him with his fist.\nThen there came a scramble, and Grey was soon aware that he had his opponent in his hands. I doubt whether he had attempted to strike a blow. Vavasor had struck him repeatedly, but he was unconscious of the blows that had fallen on him. He had only one object now in his mind, and that object was to kick Vavasor down the stairs. Now he had a hold of the smaller man by the nape of his neck. He forced him through the door, and succeeded in pushing him down the first flight of steps. He had the satisfaction of seeing him sprawling on the landing.\nVavasor, when he raised himself, prepared to make another rush at the room, but before he could do so a man from below, hearing the noise, came out and interrupted him.\n\"Mr. Jones,\" said Grey from above, \"if that gentleman does not leave the house, I must get you to search for a policeman.\"\nVavasor, though the lodging-house man had hold of his collar of his coat, made no attempt to turn upon him. All his energies were bent on John Grey.\n\"What's it all about, sir?\" said Jones, who was a tailor, and something of a fighting man himself.\n\"That man has ill-used me, and I've punished him; that's all,\" said Vavasor.\n\"I don't know much about punishing,\" said the tailor. \"It seems to me he pitched you down pretty clean out of the room above. I think the best thing you can do now is to walk yourself off.\"\nIt was the only thing that Vavasor could do, and he did walk himself off. He went home to his lodgings in Cecil Street, to smooth his feathers after the encounter before he went down to Westminster to take his seat in the House of Commons. I do not think that he was comfortable when he got there, or that he felt himself very well able to fight another battle that night on behalf of the River Bank. He had not been hurt, but he had been worsted. He had probably hurt Grey; but Grey had succeeded in throwing him out.\nHe might have got over the annoyance of this feeling had he not been overwhelmed by a consciousness that everything was going badly with him. He was already beginning to hate his seat in Parliament. What good had it done for him? He found himself associated with Mr. Bott, and others of the same class - men whom he despised; and even they did not admit him without a show of superiority. Though he told himself that he would go on with the thing which he had begun - that he would persevere in Parliament till he had become successful - he could not believe in the promises which he had made to himself.\nHe had looked forward to his entrance into that Chamber as the hour of his triumph; but he had entered it with Mr. Bott, and there had been no triumph in that. He had had no time to speak in Parliament yet; but he had been there long enough to learn to fancy that there was no glory in attempting. This art of speaking in Parliament, which had appeared to him to be so grand, seemed already to be a humdrum, dull affair. No one seemed to listen much to what was said. Mr. Palliser had once spoken for two hours together, and all the House had treated his speech with respect - had declared that it was useful, solid, conscientious, and what not; but more than half the House had been asleep during it.\nVavasor's chance of brilliance seemed to be further from him, and still further. He had already spent two thousand pounds of his own money, and two thousand more of Alice's - or Mr. Grey's. He must spend two thousand more to prolong his career; and how was he to get that after what had taken place today?\nHe would get it. That was his resolve as he walked into Westminster between the two august lamps. He would get it; as long as Alice had a pound, he would get it, even if it came through John Grey's hands - and even if it might destroy his cousin Alice and ruin his sister Kate. He had gone too far to stick at any scruples. He would go to Alice and demand the money from her with threats, and with that violence in his eyes which he knew so well how to assume.\nThat wretched old man in Westmorland! If only he would die! He walked about the lobbies of the House, thinking of all this as he went from room to room, sitting now for ten minutes in the gallery, and then wandering again out into the lobby.\nNor was Mr. Grey much happier. The memory of the fight itself did not trouble Vavasor much; but John Grey was made wretched by reflecting on it. He had never been involved in physical violence before. When ordering that his money might be spent to save Alice from her cousin, he had never felt a moment's regret; but now he was almost driven to reproach.\n\"Oh, Alice! that this should have come upon me through your fault!\"\nOnce Vavasor had gone, Grey retired into his bedroom to wash his face. Then he began to think about Vavasor's accusation, that he had advanced money on Alice's behalf in order to obtain some power over her, and revenge himself for her treatment of him. Nothing could be more damnably false than this accusation. But might it not appear to be true? If people heard of this affair, how many would guess the truth?\nWhile he was in this wretched state of mind, Mr. Jones, his landlord, came up to him. Mr. Jones had known him for some years, and had a most profound respect for him.\n\"Dear, dear, sir, this is a terrible affair!\" he said, as he entered the room. \"Was the gentleman known to you?\"\n\"Yes.\"\n\"Any quarrel, sir?\"\n\"Well, yes. I should not have pushed him downstairs otherwise.\"\n\"We can have the police after him if you wish it, sir?\"\n\"I don't wish it at all.\"\n\"Or we might manage to polish him off in any other way, you know.\"\nIt was some time before Mr. Grey could get rid of the tailor, but he did so without telling any part of the story to that worthy and very anxious man.",
        "paragraph_chars": [
            [
                0,
                368
            ],
            [
                368,
                683
            ],
            [
                683,
                1277
            ],
            [
                1277,
                1721
            ],
            [
                1721,
                2295
            ],
            [
                2295,
                2760
            ],
            [
                2760,
                2925
            ],
            [
                2925,
                3005
            ],
            [
                3005,
                3042
            ],
            [
                3042,
                3386
            ],
            [
                3386,
                3626
            ],
            [
                3626,
                3673
            ],
            [
                3673,
                3709
            ],
            [
                3709,
                3877
            ],
            [
                3877,
                4011
            ],
            [
                4011,
                4197
            ],
            [
                4197,
                4255
            ],
            [
                4255,
                4351
            ],
            [
                4351,
                4360
            ],
            [
                4360,
                4520
            ],
            [
                4520,
                4620
            ],
            [
                4620,
                4864
            ],
            [
                4864,
                5067
            ],
            [
                5067,
                5259
            ],
            [
                5259,
                5329
            ],
            [
                5329,
                5414
            ],
            [
                5414,
                5453
            ],
            [
                5453,
                5688
            ],
            [
                5688,
                5764
            ],
            [
                5764,
                5896
            ],
            [
                5896,
                5948
            ],
            [
                5948,
                5995
            ],
            [
                5995,
                6203
            ],
            [
                6203,
                6417
            ],
            [
                6417,
                6729
            ],
            [
                6729,
                6821
            ],
            [
                6821,
                6896
            ],
            [
                6896,
                7278
            ],
            [
                7278,
                7313
            ],
            [
                7313,
                7701
            ],
            [
                7701,
                7869
            ],
            [
                7869,
                8046
            ],
            [
                8046,
                8200
            ],
            [
                8200,
                8396
            ],
            [
                8396,
                8945
            ],
            [
                8945,
                9114
            ],
            [
                9114,
                9237
            ],
            [
                9237,
                9386
            ],
            [
                9386,
                9485
            ],
            [
                9485,
                9562
            ],
            [
                9562,
                9752
            ],
            [
                9752,
                10271
            ],
            [
                10271,
                10876
            ],
            [
                10876,
                11578
            ],
            [
                11578,
                11884
            ],
            [
                11884,
                12345
            ],
            [
                12345,
                12587
            ],
            [
                12587,
                12942
            ],
            [
                12942,
                13010
            ],
            [
                13010,
                13422
            ],
            [
                13422,
                13589
            ],
            [
                13589,
                13702
            ],
            [
                13702,
                13709
            ],
            [
                13709,
                13729
            ],
            [
                13729,
                13793
            ],
            [
                13793,
                13849
            ],
            [
                13849,
                13875
            ],
            [
                13875,
                13942
            ],
            [
                13942,
                14092
            ]
        ],
        "segment_chars": [
            [
                0,
                52
            ],
            [
                52,
                165
            ],
            [
                165,
                320
            ],
            [
                320,
                368
            ],
            [
                368,
                414
            ],
            [
                414,
                525
            ],
            [
                525,
                683
            ],
            [
                683,
                733
            ],
            [
                733,
                1013
            ],
            [
                1013,
                1207
            ],
            [
                1207,
                1277
            ],
            [
                1277,
                1404
            ],
            [
                1404,
                1509
            ],
            [
                1509,
                1630
            ],
            [
                1630,
                1721
            ],
            [
                1721,
                1840
            ],
            [
                1840,
                1875
            ],
            [
                1875,
                1990
            ],
            [
                1990,
                2048
            ],
            [
                2048,
                2190
            ],
            [
                2190,
                2240
            ],
            [
                2240,
                2295
            ],
            [
                2295,
                2349
            ],
            [
                2349,
                2427
            ],
            [
                2427,
                2517
            ],
            [
                2517,
                2646
            ],
            [
                2646,
                2760
            ],
            [
                2760,
                2875
            ],
            [
                2875,
                2925
            ],
            [
                2925,
                3005
            ],
            [
                3005,
                3016
            ],
            [
                3016,
                3042
            ],
            [
                3042,
                3108
            ],
            [
                3108,
                3150
            ],
            [
                3150,
                3386
            ],
            [
                3386,
                3462
            ],
            [
                3462,
                3527
            ],
            [
                3527,
                3570
            ],
            [
                3570,
                3626
            ],
            [
                3626,
                3664
            ],
            [
                3664,
                3673
            ],
            [
                3673,
                3709
            ],
            [
                3709,
                3877
            ],
            [
                3877,
                4011
            ],
            [
                4011,
                4076
            ],
            [
                4076,
                4197
            ],
            [
                4197,
                4245
            ],
            [
                4245,
                4255
            ],
            [
                4255,
                4277
            ],
            [
                4277,
                4320
            ],
            [
                4320,
                4351
            ],
            [
                4351,
                4360
            ],
            [
                4360,
                4449
            ],
            [
                4449,
                4520
            ],
            [
                4520,
                4620
            ],
            [
                4620,
                4674
            ],
            [
                4674,
                4864
            ],
            [
                4864,
                4973
            ],
            [
                4973,
                5067
            ],
            [
                5067,
                5144
            ],
            [
                5144,
                5259
            ],
            [
                5259,
                5329
            ],
            [
                5329,
                5414
            ],
            [
                5414,
                5453
            ],
            [
                5453,
                5574
            ],
            [
                5574,
                5688
            ],
            [
                5688,
                5764
            ],
            [
                5764,
                5813
            ],
            [
                5813,
                5856
            ],
            [
                5856,
                5896
            ],
            [
                5896,
                5948
            ],
            [
                5948,
                5995
            ],
            [
                5995,
                6124
            ],
            [
                6124,
                6203
            ],
            [
                6203,
                6236
            ],
            [
                6236,
                6265
            ],
            [
                6265,
                6334
            ],
            [
                6334,
                6417
            ],
            [
                6417,
                6525
            ],
            [
                6525,
                6595
            ],
            [
                6595,
                6671
            ],
            [
                6671,
                6729
            ],
            [
                6729,
                6768
            ],
            [
                6768,
                6821
            ],
            [
                6821,
                6896
            ],
            [
                6896,
                6945
            ],
            [
                6945,
                7007
            ],
            [
                7007,
                7191
            ],
            [
                7191,
                7278
            ],
            [
                7278,
                7313
            ],
            [
                7313,
                7334
            ],
            [
                7334,
                7413
            ],
            [
                7413,
                7609
            ],
            [
                7609,
                7701
            ],
            [
                7701,
                7846
            ],
            [
                7846,
                7869
            ],
            [
                7869,
                7891
            ],
            [
                7891,
                7935
            ],
            [
                7935,
                7955
            ],
            [
                7955,
                8046
            ],
            [
                8046,
                8093
            ],
            [
                8093,
                8200
            ],
            [
                8200,
                8259
            ],
            [
                8259,
                8358
            ],
            [
                8358,
                8396
            ],
            [
                8396,
                8487
            ],
            [
                8487,
                8538
            ],
            [
                8538,
                8633
            ],
            [
                8633,
                8726
            ],
            [
                8726,
                8788
            ],
            [
                8788,
                8881
            ],
            [
                8881,
                8945
            ],
            [
                8945,
                9114
            ],
            [
                9114,
                9237
            ],
            [
                9237,
                9345
            ],
            [
                9345,
                9386
            ],
            [
                9386,
                9414
            ],
            [
                9414,
                9485
            ],
            [
                9485,
                9562
            ],
            [
                9562,
                9616
            ],
            [
                9616,
                9688
            ],
            [
                9688,
                9752
            ],
            [
                9752,
                9826
            ],
            [
                9826,
                9992
            ],
            [
                9992,
                10153
            ],
            [
                10153,
                10200
            ],
            [
                10200,
                10271
            ],
            [
                10271,
                10413
            ],
            [
                10413,
                10470
            ],
            [
                10470,
                10501
            ],
            [
                10501,
                10660
            ],
            [
                10660,
                10876
            ],
            [
                10876,
                11036
            ],
            [
                11036,
                11174
            ],
            [
                11174,
                11297
            ],
            [
                11297,
                11344
            ],
            [
                11344,
                11578
            ],
            [
                11578,
                11659
            ],
            [
                11659,
                11768
            ],
            [
                11768,
                11884
            ],
            [
                11884,
                11901
            ],
            [
                11901,
                11982
            ],
            [
                11982,
                12162
            ],
            [
                12162,
                12208
            ],
            [
                12208,
                12345
            ],
            [
                12345,
                12383
            ],
            [
                12383,
                12405
            ],
            [
                12405,
                12587
            ],
            [
                12587,
                12618
            ],
            [
                12618,
                12732
            ],
            [
                12732,
                12788
            ],
            [
                12788,
                12942
            ],
            [
                12942,
                12954
            ],
            [
                12954,
                13010
            ],
            [
                13010,
                13081
            ],
            [
                13081,
                13263
            ],
            [
                13263,
                13322
            ],
            [
                13322,
                13358
            ],
            [
                13358,
                13422
            ],
            [
                13422,
                13508
            ],
            [
                13508,
                13589
            ],
            [
                13589,
                13635
            ],
            [
                13635,
                13668
            ],
            [
                13668,
                13702
            ],
            [
                13702,
                13709
            ],
            [
                13709,
                13729
            ],
            [
                13729,
                13741
            ],
            [
                13741,
                13793
            ],
            [
                13793,
                13849
            ],
            [
                13849,
                13875
            ],
            [
                13875,
                13942
            ],
            [
                13942,
                14092
            ]
        ],
        "overlap_chars": [
            [
                0,
                28
            ],
            [
                29,
                52
            ],
            [
                52,
                107
            ],
            [
                107,
                123
            ],
            [
                124,
                132
            ],
            [
                133,
                165
            ],
            [
                165,
                180
            ],
            [
                181,
                183
            ],
            [
                194,
                233
            ],
            [
                234,
                243
            ],
            [
                246,
                260
            ],
            [
                260,
                272
            ],
            [
                277,
                291
            ],
            [
                303,
                320
            ],
            [
                323,
                329
            ],
            [
                330,
                334
            ],
            [
                336,
                352
            ],
            [
                353,
                359
            ],
            [
                366,
                367
            ],
            [
                368,
                414
            ],
            [
                414,
                523
            ],
            [
                523,
                525
            ],
            [
                525,
                534
            ],
            [
                535,
                542
            ],
            [
                543,
                549
            ],
            [
                550,
                589
            ],
            [
                590,
                683
            ],
            [
                683,
                721
            ],
            [
                722,
                733
            ],
            [
                733,
                787
            ],
            [
                790,
                821
            ],
            [
                822,
                832
            ],
            [
                835,
                851
            ],
            [
                852,
                876
            ],
            [
                878,
                926
            ],
            [
                936,
                990
            ],
            [
                991,
                992
            ],
            [
                993,
                1011
            ],
            [
                1013,
                1038
            ],
            [
                1049,
                1106
            ],
            [
                1107,
                1182
            ],
            [
                1183,
                1207
            ],
            [
                1207,
                1247
            ],
            [
                1255,
                1276
            ],
            [
                1277,
                1404
            ],
            [
                1404,
                1457
            ],
            [
                1473,
                1476
            ],
            [
                1477,
                1481
            ],
            [
                1482,
                1509
            ],
            [
                1509,
                1519
            ],
            [
                1520,
                1542
            ],
            [
                1556,
                1560
            ],
            [
                1566,
                1630
            ],
            [
                1630,
                1721
            ],
            [
                1721,
                1730
            ],
            [
                1731,
                1778
            ],
            [
                1782,
                1804
            ],
            [
                1813,
                1840
            ],
            [
                1840,
                1875
            ],
            [
                1875,
                1990
            ],
            [
                1990,
                2002
            ],
            [
                2013,
                2017
            ],
            [
                2018,
                2022
            ],
            [
                2032,
                2036
            ],
            [
                2037,
                2048
            ],
            [
                2048,
                2107
            ],
            [
                2113,
                2190
            ],
            [
                2190,
                2240
            ],
            [
                2240,
                2295
            ],
            [
                2295,
                2332
            ],
            [
                2338,
                2341
            ],
            [
                2347,
                2349
            ],
            [
                2349,
                2373
            ],
            [
                2380,
                2390
            ],
            [
                2391,
                2427
            ],
            [
                2427,
                2449
            ],
            [
                2449,
                2504
            ],
            [
                2510,
                2517
            ],
            [
                2517,
                2522
            ],
            [
                2529,
                2530
            ],
            [
                2531,
                2564
            ],
            [
                2565,
                2583
            ],
            [
                2590,
                2600
            ],
            [
                2613,
                2626
            ],
            [
                2636,
                2646
            ],
            [
                2646,
                2658
            ],
            [
                2669,
                2692
            ],
            [
                2706,
                2723
            ],
            [
                2724,
                2745
            ],
            [
                2755,
                2759
            ],
            [
                2760,
                2769
            ],
            [
                2770,
                2796
            ],
            [
                2797,
                2800
            ],
            [
                2801,
                2820
            ],
            [
                2826,
                2854
            ],
            [
                2855,
                2867
            ],
            [
                2873,
                2875
            ],
            [
                2875,
                2925
            ],
            [
                2925,
                2944
            ],
            [
                2944,
                3005
            ],
            [
                3005,
                3006
            ],
            [
                3006,
                3016
            ],
            [
                3016,
                3042
            ],
            [
                3042,
                3108
            ],
            [
                3108,
                3113
            ],
            [
                3118,
                3135
            ],
            [
                3136,
                3150
            ],
            [
                3150,
                3176
            ],
            [
                3177,
                3186
            ],
            [
                3187,
                3190
            ],
            [
                3200,
                3279
            ],
            [
                3288,
                3293
            ],
            [
                3294,
                3319
            ],
            [
                3343,
                3344
            ],
            [
                3345,
                3347
            ],
            [
                3351,
                3353
            ],
            [
                3358,
                3384
            ],
            [
                3384,
                3386
            ],
            [
                3388,
                3389
            ],
            [
                3390,
                3394
            ],
            [
                3404,
                3407
            ],
            [
                3416,
                3419
            ],
            [
                3420,
                3447
            ],
            [
                3460,
                3462
            ],
            [
                3462,
                3470
            ],
            [
                3471,
                3501
            ],
            [
                3516,
                3525
            ],
            [
                3525,
                3527
            ],
            [
                3527,
                3568
            ],
            [
                3568,
                3570
            ],
            [
                3570,
                3624
            ],
            [
                3624,
                3625
            ],
            [
                3626,
                3664
            ],
            [
                3664,
                3672
            ],
            [
                3673,
                3706
            ],
            [
                3706,
                3708
            ],
            [
                3709,
                3757
            ],
            [
                3757,
                3762
            ],
            [
                3763,
                3791
            ],
            [
                3791,
                3796
            ],
            [
                3797,
                3806
            ],
            [
                3812,
                3837
            ],
            [
                3838,
                3877
            ],
            [
                3877,
                3958
            ],
            [
                3963,
                3971
            ],
            [
                3972,
                3976
            ],
            [
                3989,
                4011
            ],
            [
                4013,
                4036
            ],
            [
                4037,
                4041
            ],
            [
                4053,
                4061
            ],
            [
                4062,
                4076
            ],
            [
                4076,
                4110
            ],
            [
                4115,
                4120
            ],
            [
                4121,
                4123
            ],
            [
                4131,
                4133
            ],
            [
                4143,
                4195
            ],
            [
                4195,
                4197
            ],
            [
                4197,
                4245
            ],
            [
                4245,
                4255
            ],
            [
                4255,
                4256
            ],
            [
                4256,
                4277
            ],
            [
                4277,
                4305
            ],
            [
                4310,
                4320
            ],
            [
                4320,
                4351
            ],
            [
                4351,
                4357
            ],
            [
                4357,
                4360
            ],
            [
                4360,
                4376
            ],
            [
                4377,
                4449
            ],
            [
                4449,
                4520
            ],
            [
                4520,
                4620
            ],
            [
                4620,
                4646
            ],
            [
                4647,
                4674
            ],
            [
                4674,
                4852
            ],
            [
                4856,
                4861
            ],
            [
                4861,
                4864
            ],
            [
                4864,
                4917
            ],
            [
                4918,
                4925
            ],
            [
                4936,
                4971
            ],
            [
                4971,
                4973
            ],
            [
                4973,
                5066
            ],
            [
                5067,
                5144
            ],
            [
                5144,
                5259
            ],
            [
                5259,
                5280
            ],
            [
                5281,
                5292
            ],
            [
                5293,
                5329
            ],
            [
                5329,
                5414
            ],
            [
                5414,
                5415
            ],
            [
                5427,
                5453
            ],
            [
                5453,
                5463
            ],
            [
                5464,
                5472
            ],
            [
                5473,
                5476
            ],
            [
                5476,
                5477
            ],
            [
                5478,
                5492
            ],
            [
                5493,
                5509
            ],
            [
                5510,
                5511
            ],
            [
                5519,
                5524
            ],
            [
                5529,
                5557
            ],
            [
                5558,
                5570
            ],
            [
                5572,
                5574
            ],
            [
                5574,
                5586
            ],
            [
                5587,
                5659
            ],
            [
                5667,
                5672
            ],
            [
                5679,
                5686
            ],
            [
                5686,
                5687
            ],
            [
                5688,
                5764
            ],
            [
                5764,
                5775
            ],
            [
                5776,
                5779
            ],
            [
                5783,
                5813
            ],
            [
                5813,
                5829
            ],
            [
                5847,
                5856
            ],
            [
                5856,
                5893
            ],
            [
                5893,
                5896
            ],
            [
                5896,
                5897
            ],
            [
                5897,
                5948
            ],
            [
                5948,
                5992
            ],
            [
                5995,
                6074
            ],
            [
                6075,
                6088
            ],
            [
                6106,
                6124
            ],
            [
                6124,
                6203
            ],
            [
                6203,
                6236
            ],
            [
                6236,
                6265
            ],
            [
                6265,
                6300
            ],
            [
                6303,
                6334
            ],
            [
                6334,
                6417
            ],
            [
                6417,
                6525
            ],
            [
                6525,
                6568
            ],
            [
                6574,
                6595
            ],
            [
                6595,
                6671
            ],
            [
                6671,
                6729
            ],
            [
                6729,
                6768
            ],
            [
                6768,
                6818
            ],
            [
                6821,
                6823
            ],
            [
                6824,
                6896
            ],
            [
                6896,
                6945
            ],
            [
                6945,
                7007
            ],
            [
                7007,
                7124
            ],
            [
                7124,
                7191
            ],
            [
                7191,
                7278
            ],
            [
                7278,
                7313
            ],
            [
                7313,
                7334
            ],
            [
                7334,
                7413
            ],
            [
                7413,
                7522
            ],
            [
                7523,
                7609
            ],
            [
                7609,
                7642
            ],
            [
                7642,
                7701
            ],
            [
                7701,
                7747
            ],
            [
                7748,
                7758
            ],
            [
                7764,
                7846
            ],
            [
                7846,
                7869
            ],
            [
                7869,
                7891
            ],
            [
                7891,
                7935
            ],
            [
                7935,
                7947
            ],
            [
                7952,
                7955
            ],
            [
                7955,
                8035
            ],
            [
                8036,
                8046
            ],
            [
                8046,
                8070
            ],
            [
                8071,
                8074
            ],
            [
                8075,
                8087
            ],
            [
                8088,
                8091
            ],
            [
                8091,
                8093
            ],
            [
                8093,
                8126
            ],
            [
                8127,
                8162
            ],
            [
                8163,
                8199
            ],
            [
                8200,
                8241
            ],
            [
                8257,
                8259
            ],
            [
                8259,
                8358
            ],
            [
                8358,
                8394
            ],
            [
                8394,
                8395
            ],
            [
                8396,
                8487
            ],
            [
                8487,
                8536
            ],
            [
                8536,
                8538
            ],
            [
                8538,
                8576
            ],
            [
                8577,
                8598
            ],
            [
                8599,
                8608
            ],
            [
                8614,
                8627
            ],
            [
                8631,
                8633
            ],
            [
                8633,
                8639
            ],
            [
                8645,
                8692
            ],
            [
                8709,
                8726
            ],
            [
                8733,
                8788
            ],
            [
                8788,
                8801
            ],
            [
                8802,
                8818
            ],
            [
                8818,
                8823
            ],
            [
                8824,
                8881
            ],
            [
                8881,
                8883
            ],
            [
                8884,
                8943
            ],
            [
                8943,
                8945
            ],
            [
                8945,
                9083
            ],
            [
                9093,
                9113
            ],
            [
                9114,
                9136
            ],
            [
                9137,
                9237
            ],
            [
                9237,
                9286
            ],
            [
                9287,
                9290
            ],
            [
                9291,
                9339
            ],
            [
                9343,
                9345
            ],
            [
                9353,
                9361
            ],
            [
                9384,
                9385
            ],
            [
                9386,
                9414
            ],
            [
                9414,
                9429
            ],
            [
                9430,
                9433
            ],
            [
                9434,
                9443
            ],
            [
                9444,
                9447
            ],
            [
                9448,
                9484
            ],
            [
                9485,
                9545
            ],
            [
                9562,
                9616
            ],
            [
                9616,
                9688
            ],
            [
                9688,
                9752
            ],
            [
                9752,
                9826
            ],
            [
                9826,
                9828
            ],
            [
                9829,
                9845
            ],
            [
                9846,
                9871
            ],
            [
                9875,
                9904
            ],
            [
                9905,
                9992
            ],
            [
                9992,
                10153
            ],
            [
                10153,
                10200
            ],
            [
                10200,
                10206
            ],
            [
                10207,
                10215
            ],
            [
                10221,
                10225
            ],
            [
                10225,
                10252
            ],
            [
                10262,
                10265
            ],
            [
                10269,
                10271
            ],
            [
                10271,
                10279
            ],
            [
                10280,
                10413
            ],
            [
                10413,
                10470
            ],
            [
                10470,
                10499
            ],
            [
                10499,
                10501
            ],
            [
                10501,
                10517
            ],
            [
                10518,
                10528
            ],
            [
                10529,
                10547
            ],
            [
                10548,
                10572
            ],
            [
                10575,
                10628
            ],
            [
                10629,
                10638
            ],
            [
                10639,
                10658
            ],
            [
                10658,
                10660
            ],
            [
                10660,
                10682
            ],
            [
                10683,
                10736
            ],
            [
                10739,
                10788
            ],
            [
                10809,
                10821
            ],
            [
                10822,
                10875
            ],
            [
                10876,
                11026
            ],
            [
                11027,
                11029
            ],
            [
                11034,
                11036
            ],
            [
                11036,
                11038
            ],
            [
                11039,
                11042
            ],
            [
                11055,
                11057
            ],
            [
                11078,
                11081
            ],
            [
                11081,
                11082
            ],
            [
                11083,
                11174
            ],
            [
                11174,
                11283
            ],
            [
                11284,
                11297
            ],
            [
                11297,
                11344
            ],
            [
                11344,
                11365
            ],
            [
                11366,
                11450
            ],
            [
                11453,
                11566
            ],
            [
                11576,
                11577
            ],
            [
                11578,
                11585
            ],
            [
                11588,
                11597
            ],
            [
                11598,
                11659
            ],
            [
                11659,
                11679
            ],
            [
                11680,
                11750
            ],
            [
                11753,
                11755
            ],
            [
                11756,
                11766
            ],
            [
                11766,
                11768
            ],
            [
                11768,
                11781
            ],
            [
                11782,
                11799
            ],
            [
                11800,
                11802
            ],
            [
                11811,
                11821
            ],
            [
                11821,
                11822
            ],
            [
                11823,
                11844
            ],
            [
                11845,
                11849
            ],
            [
                11850,
                11876
            ],
            [
                11882,
                11884
            ],
            [
                11884,
                11901
            ],
            [
                11901,
                11934
            ],
            [
                11952,
                11982
            ],
            [
                11982,
                11998
            ],
            [
                11999,
                12027
            ],
            [
                12029,
                12044
            ],
            [
                12046,
                12050
            ],
            [
                12054,
                12056
            ],
            [
                12062,
                12069
            ],
            [
                12070,
                12079
            ],
            [
                12082,
                12087
            ],
            [
                12090,
                12093
            ],
            [
                12102,
                12104
            ],
            [
                12105,
                12162
            ],
            [
                12162,
                12208
            ],
            [
                12208,
                12344
            ],
            [
                12345,
                12374
            ],
            [
                12377,
                12383
            ],
            [
                12383,
                12385
            ],
            [
                12391,
                12399
            ],
            [
                12400,
                12403
            ],
            [
                12403,
                12405
            ],
            [
                12405,
                12467
            ],
            [
                12471,
                12478
            ],
            [
                12479,
                12496
            ],
            [
                12496,
                12550
            ],
            [
                12561,
                12585
            ],
            [
                12585,
                12586
            ],
            [
                12587,
                12616
            ],
            [
                12616,
                12618
            ],
            [
                12618,
                12635
            ],
            [
                12642,
                12656
            ],
            [
                12657,
                12664
            ],
            [
                12665,
                12672
            ],
            [
                12673,
                12677
            ],
            [
                12679,
                12682
            ],
            [
                12683,
                12692
            ],
            [
                12693,
                12696
            ],
            [
                12702,
                12710
            ],
            [
                12730,
                12732
            ],
            [
                12735,
                12738
            ],
            [
                12745,
                12749
            ],
            [
                12759,
                12761
            ],
            [
                12786,
                12788
            ],
            [
                12788,
                12825
            ],
            [
                12840,
                12899
            ],
            [
                12900,
                12931
            ],
            [
                12932,
                12941
            ],
            [
                12942,
                12954
            ],
            [
                12954,
                12963
            ],
            [
                12964,
                12996
            ],
            [
                13002,
                13010
            ],
            [
                13015,
                13022
            ],
            [
                13031,
                13032
            ],
            [
                13033,
                13037
            ],
            [
                13038,
                13062
            ],
            [
                13066,
                13074
            ],
            [
                13079,
                13081
            ],
            [
                13081,
                13103
            ],
            [
                13110,
                13117
            ],
            [
                13120,
                13130
            ],
            [
                13130,
                13131
            ],
            [
                13132,
                13161
            ],
            [
                13162,
                13169
            ],
            [
                13170,
                13176
            ],
            [
                13177,
                13185
            ],
            [
                13189,
                13211
            ],
            [
                13215,
                13220
            ],
            [
                13221,
                13236
            ],
            [
                13237,
                13263
            ],
            [
                13263,
                13322
            ],
            [
                13322,
                13325
            ],
            [
                13332,
                13334
            ],
            [
                13335,
                13338
            ],
            [
                13339,
                13345
            ],
            [
                13346,
                13348
            ],
            [
                13352,
                13358
            ],
            [
                13358,
                13360
            ],
            [
                13374,
                13404
            ],
            [
                13405,
                13422
            ],
            [
                13422,
                13465
            ],
            [
                13465,
                13508
            ],
            [
                13508,
                13551
            ],
            [
                13556,
                13583
            ],
            [
                13587,
                13588
            ],
            [
                13589,
                13605
            ],
            [
                13607,
                13635
            ],
            [
                13635,
                13649
            ],
            [
                13658,
                13667
            ],
            [
                13668,
                13701
            ],
            [
                13702,
                13706
            ],
            [
                13706,
                13709
            ],
            [
                13709,
                13729
            ],
            [
                13729,
                13741
            ],
            [
                13741,
                13769
            ],
            [
                13790,
                13793
            ],
            [
                13793,
                13849
            ],
            [
                13849,
                13875
            ],
            [
                13875,
                13942
            ],
            [
                13942,
                14017
            ],
            [
                14018,
                14025
            ],
            [
                14034,
                14063
            ],
            [
                14064,
                14070
            ],
            [
                14071,
                14087
            ],
            [
                14091,
                14092
            ]
        ],
        "row_chars": [
            [
                0,
                52
            ],
            [
                52,
                165
            ],
            [
                165,
                320
            ],
            [
                320,
                368
            ],
            [
                368,
                414
            ],
            [
                414,
                525
            ],
            [
                525,
                525
            ],
            [
                525,
                683
            ],
            [
                683,
                733
            ],
            [
                733,
                1013
            ],
            [
                1013,
                1013
            ],
            [
                1013,
                1207
            ],
            [
                1207,
                1277
            ],
            [
                1277,
                1277
            ],
            [
                1277,
                1404
            ],
            [
                1404,
                1509
            ],
            [
                1509,
                1630
            ],
            [
                1630,
                1721
            ],
            [
                1721,
                1840
            ],
            [
                1840,
                1875
            ],
            [
                1875,
                1875
            ],
            [
                1875,
                1990
            ],
            [
                1990,
                2048
            ],
            [
                2048,
                2190
            ],
            [
                2190,
                2240
            ],
            [
                2240,
                2295
            ],
            [
                2295,
                2349
            ],
            [
                2349,
                2427
            ],
            [
                2427,
                2517
            ],
            [
                2517,
                2646
            ],
            [
                2646,
                2646
            ],
            [
                2646,
                2760
            ],
            [
                2760,
                2875
            ],
            [
                2875,
                2925
            ],
            [
                2925,
                3005
            ],
            [
                3005,
                3016
            ],
            [
                3016,
                3042
            ],
            [
                3042,
                3108
            ],
            [
                3108,
                3150
            ],
            [
                3150,
                3386
            ],
            [
                3386,
                3462
            ],
            [
                3462,
                3527
            ],
            [
                3527,
                3570
            ],
            [
                3570,
                3626
            ],
            [
                3626,
                3664
            ],
            [
                3664,
                3673
            ],
            [
                3673,
                3709
            ],
            [
                3709,
                3877
            ],
            [
                3877,
                4011
            ],
            [
                4011,
                4076
            ],
            [
                4076,
                4197
            ],
            [
                4197,
                4245
            ],
            [
                4245,
                4255
            ],
            [
                4255,
                4277
            ],
            [
                4277,
                4320
            ],
            [
                4320,
                4351
            ],
            [
                4351,
                4360
            ],
            [
                4360,
                4449
            ],
            [
                4449,
                4520
            ],
            [
                4520,
                4620
            ],
            [
                4620,
                4674
            ],
            [
                4674,
                4864
            ],
            [
                4864,
                4973
            ],
            [
                4973,
                5067
            ],
            [
                5067,
                5144
            ],
            [
                5144,
                5259
            ],
            [
                5259,
                5329
            ],
            [
                5329,
                5414
            ],
            [
                5414,
                5453
            ],
            [
                5453,
                5574
            ],
            [
                5574,
                5574
            ],
            [
                5574,
                5688
            ],
            [
                5688,
                5764
            ],
            [
                5764,
                5813
            ],
            [
                5813,
                5813
            ],
            [
                5813,
                5856
            ],
            [
                5856,
                5896
            ],
            [
                5896,
                5948
            ],
            [
                5948,
                5995
            ],
            [
                5995,
                5995
            ],
            [
                5995,
                6124
            ],
            [
                6124,
                6203
            ],
            [
                6203,
                6236
            ],
            [
                6236,
                6265
            ],
            [
                6265,
                6334
            ],
            [
                6334,
                6417
            ],
            [
                6417,
                6525
            ],
            [
                6525,
                6595
            ],
            [
                6595,
                6671
            ],
            [
                6671,
                6729
            ],
            [
                6729,
                6768
            ],
            [
                6768,
                6821
            ],
            [
                6821,
                6821
            ],
            [
                6821,
                6896
            ],
            [
                6896,
                6945
            ],
            [
                6945,
                7007
            ],
            [
                7007,
                7191
            ],
            [
                7191,
                7278
            ],
            [
                7278,
                7313
            ],
            [
                7313,
                7334
            ],
            [
                7334,
                7413
            ],
            [
                7413,
                7609
            ],
            [
                7609,
                7701
            ],
            [
                7701,
                7846
            ],
            [
                7846,
                7869
            ],
            [
                7869,
                7891
            ],
            [
                7891,
                7935
            ],
            [
                7935,
                7955
            ],
            [
                7955,
                8046
            ],
            [
                8046,
                8093
            ],
            [
                8093,
                8200
            ],
            [
                8200,
                8259
            ],
            [
                8259,
                8358
            ],
            [
                8358,
                8396
            ],
            [
                8396,
                8487
            ],
            [
                8487,
                8538
            ],
            [
                8538,
                8633
            ],
            [
                8633,
                8726
            ],
            [
                8726,
                8788
            ],
            [
                8788,
                8881
            ],
            [
                8881,
                8881
            ],
            [
                8881,
                8945
            ],
            [
                8945,
                9114
            ],
            [
                9114,
                9237
            ],
            [
                9237,
                9345
            ],
            [
                9345,
                9345
            ],
            [
                9345,
                9386
            ],
            [
                9386,
                9386
            ],
            [
                9386,
                9386
            ],
            [
                9386,
                9386
            ],
            [
                9386,
                9414
            ],
            [
                9414,
                9485
            ],
            [
                9485,
                9485
            ],
            [
                9485,
                9485
            ],
            [
                9485,
                9485
            ],
            [
                9485,
                9562
            ],
            [
                9562,
                9616
            ],
            [
                9616,
                9688
            ],
            [
                9688,
                9752
            ],
            [
                9752,
                9826
            ],
            [
                9826,
                9992
            ],
            [
                9992,
                10153
            ],
            [
                10153,
                10200
            ],
            [
                10200,
                10271
            ],
            [
                10271,
                10413
            ],
            [
                10413,
                10470
            ],
            [
                10470,
                10501
            ],
            [
                10501,
                10660
            ],
            [
                10660,
                10660
            ],
            [
                10660,
                10876
            ],
            [
                10876,
                11036
            ],
            [
                11036,
                11036
            ],
            [
                11036,
                11174
            ],
            [
                11174,
                11297
            ],
            [
                11297,
                11344
            ],
            [
                11344,
                11344
            ],
            [
                11344,
                11578
            ],
            [
                11578,
                11659
            ],
            [
                11659,
                11768
            ],
            [
                11768,
                11884
            ],
            [
                11884,
                11901
            ],
            [
                11901,
                11982
            ],
            [
                11982,
                12162
            ],
            [
                12162,
                12208
            ],
            [
                12208,
                12208
            ],
            [
                12208,
                12345
            ],
            [
                12345,
                12345
            ],
            [
                12345,
                12383
            ],
            [
                12383,
                12405
            ],
            [
                12405,
                12405
            ],
            [
                12405,
                12405
            ],
            [
                12405,
                12405
            ],
            [
                12405,
                12405
            ],
            [
                12405,
                12587
            ],
            [
                12587,
                12587
            ],
            [
                12587,
                12618
            ],
            [
                12618,
                12732
            ],
            [
                12732,
                12732
            ],
            [
                12732,
                12788
            ],
            [
                12788,
                12788
            ],
            [
                12788,
                12942
            ],
            [
                12942,
                12954
            ],
            [
                12954,
                13010
            ],
            [
                13010,
                13081
            ],
            [
                13081,
                13081
            ],
            [
                13081,
                13263
            ],
            [
                13263,
                13322
            ],
            [
                13322,
                13322
            ],
            [
                13322,
                13358
            ],
            [
                13358,
                13422
            ],
            [
                13422,
                13508
            ],
            [
                13508,
                13589
            ],
            [
                13589,
                13589
            ],
            [
                13589,
                13589
            ],
            [
                13589,
                13589
            ],
            [
                13589,
                13589
            ],
            [
                13589,
                13635
            ],
            [
                13635,
                13668
            ],
            [
                13668,
                13668
            ],
            [
                13668,
                13702
            ],
            [
                13702,
                13702
            ],
            [
                13702,
                13709
            ],
            [
                13709,
                13729
            ],
            [
                13729,
                13741
            ],
            [
                13741,
                13793
            ],
            [
                13793,
                13849
            ],
            [
                13849,
                13875
            ],
            [
                13875,
                13942
            ],
            [
                13942,
                14092
            ]
        ]
    }
}