{
    "original": {
        "text": "The coming of Mrs. Greenow at this very moment was a great comfort to Kate. Without her she would hardly have known how to bear herself with her uncle and her brother. As it was, they were all restrained by something of the courtesy which strangers are bound to show to each other. George had never seen his aunt since he was a child, and some sort of introduction was necessary between them.\n\"So you are George,\" said Mrs. Greenow, putting out her hand and smiling.\n\"Yes; I'm George,\" said he.\n\"And a Member of Parliament!\" said Mrs. Greenow. \"It's quite an honour to the family. I felt so proud when I heard it!\" She said this pleasantly, meaning it to be taken for truth, and then turned away to her brother. \"Papa's time was fully come,\" she said, \"though, to tell the truth, I had no idea that he was so weak as Kate describes him to have been.\"\n\"Nor I, either,\" said John Vavasor. \"He went to church with us here on Christmas-day.\"\n\"Did he, indeed? Dear, dear! He seems at last to have gone off just like poor Greenow.\" Here she put her handkerchief up to her face. \"I think you didn't know Greenow, John?\"\n\"I met him once,\" said her brother.\n\"Ah! he wasn't to be known and understood in that way. I'm aware there was a little prejudice, because of his being in trade, but we won't talk of that now. Where should I have been without him, tradesman or no tradesman?\"\n\"I've no doubt he was an excellent man.\"\n\"You may say that, John. Ah, well! we can't keep everything in this life for ever.\" It may, perhaps, be as well to explain now that Mrs. Greenow had told Captain Bellfield at their last meeting before she left Norwich, that, under certain circumstances, if he behaved himself well, there might possibly be ground of hope. Whereupon Captain Bellfield had immediately gone to the best tailor in that city, had told the man of his coming marriage, and had given an extensive order. But the tailor had not as yet supplied the goods, waiting for more credible evidence of the Captain's good fortune. \"We're all grass of the field,\" said Mrs. Greenow, lightly brushing a tear from her eye, \"and must be cut down and put into the oven in our turns.\" Her brother uttered a slight sympathetic groan, shaking his head in testimony of the uncertainty of human affairs, and then said that he would go out and look about the place. George, in the meantime, had asked his sister to show him his room, and the two were already together up-stairs.\nKate had made up her mind that she would say nothing about Alice at the present moment,--nothing, if it could be avoided, till after the funeral. She led the way up-stairs, almost trembling with fear, for she knew that that other subject of the will would also give rise to trouble and sorrow,--perhaps, also, to determined quarrelling.\n\"What has brought that woman here?\" was the first question that George asked.\n\"I asked her to come,\" said Kate.\n\"And why did you ask her to come here?\" said George, angrily. Kate immediately felt that he was speaking as though he were master of the house, and also as though he intended to be master of her. As regarded the former idea, she had no objection to it. She thoroughly and honestly wished that he might be the master; and though she feared that he might find himself mistaken in his assumption, she herself was not disposed to deny any appearance of right that he might take upon himself in that respect. But she had already begun to tell herself that she must not submit herself to his masterdom. She had gradually so taught herself since he had compelled her to write the first letter in which Alice had been asked to give her money.\n\"I asked her, George, before my poor grandfather's death, when I thought that he would linger perhaps for weeks. My life here alone with him, without any other woman in the house beside the servants, was very melancholy.\"\n\"Why did you not ask Alice to come to you?\"\n\"Alice could not have come,\" said Kate, after a short pause.\n\"I don't know why she shouldn't have come. I won't have that woman about the place. She disgraced herself by marrying a blacksmith--.\"\n\"Why, George, it was you yourself who advised me to go and stay with her.\"\n\"That's a very different thing. Now that he's dead, and she's got his money, it's all very well that you should go to her occasionally; but I won't have her here.\"\n\"It's natural that she should come to her father's house at her father's death-bed.\"\n\"I hate to be told that things are natural. It always means humbug. I don't suppose she cared for the old man any more than I did,--or than she cared for the other old man who married her. People are such intense hypocrites. There's my uncle John, pulling a long face because he has come into this house, and he will pull it as long as the body lies up there; and yet for the last twenty years there's nothing on earth he has so much hated as going to see his father. When are they going to bury him?\"\n\"On Saturday, the day after to-morrow.\"\n\"Why couldn't they do it to-morrow, so that we could get away before Sunday?\"\n\"He only died on Monday, George,\" said Kate, solemnly.\n\"Psha! Who has got the will?\"\n\"Mr. Gogram. He was here yesterday, and told me to tell you and uncle John that he would have it with him when he came back from the funeral.\"\n\"What has my uncle John to do with it?\" said George, sharply. \"I shall go over to Penrith this afternoon and make Gogram give it up to me.\"\n\"I don't think he'll do that, George.\"\n\"What right has he to keep it? What right has he to it at all? How do I know that he has really got the old man's last will? Where did my grandfather keep his papers?\"\n\"In that old secretary, as he used to call it; the one that stands in the dining-room. It is sealed up.\"\n\"Who sealed it?\"\n\"Mr. Gogram did,--Mr. Gogram and I together.\"\n\"What the deuce made you meddle with it?\"\n\"I merely assisted him. But I believe he was quite right. I think it is usual in such cases.\"\n\"Balderdash! You are thinking of some old trumpery of former days. Till I know to the contrary, everything here belongs to me as heir-at-law, and I do not mean to allow of any interference till I know for certain that my rights have been taken from me. And I won't accept a death-bed will. What a man chooses to write when his fingers will hardly hold the pen, goes for nothing.\"\n\"You can't suppose that I wish to interfere with your rights?\"\n\"I hope not.\"\n\"Oh, George!\"\n\"Well; I say, I hope not. But I know there are those who would. Do you think my uncle John would not interfere with me if he could? By ----! if he does, he shall find that he does it to his cost. I'll lead him such a life through the courts, for the next two or three years, that he'll wish that he had remained in Chancery Lane, and had never left it.\"\nA message was now brought up by the nurse, saying that Mrs. Greenow and Mr. Vavasor were going into the room where the old Squire was lying, \"Would Miss Kate and Mr. George go with them?\"\n\"Mr. Vavasor!\" shouted out George, making the old woman jump. She did not understand his meaning in the least. \"Yes, sir; the old Squire,\" she said.\n\"Will you come, George?\" Kate asked.\n\"No; what should I go there for? Why should I pretend an interest in the dead body of a man whom I hated and who hated me;--whose very last act, as far as I know as yet, was an attempt to rob me? I won't go and see him.\"\nKate went, and was glad of an opportunity of getting away from her brother. Every hour the idea was becoming stronger in her mind that she must in some way separate herself from him. There had come upon him of late a hard ferocity which made him unendurable. And then he carried to such a pitch that hatred, as he called it, of conventional rules, that he allowed himself to be controlled by none of the ordinary bonds of society. She had felt this heretofore, with a nervous consciousness that she was doing wrong in endeavouring to bring about a marriage between him and Alice; but this demeanour and mode of talking had now so grown upon him that Kate began to feel herself thankful that Alice had been saved.\nKate went up with her uncle and aunt, and saw the face of her grandfather for the last time. \"Poor, dear old man!\" said Mrs. Greenow, as the easy tears ran down her face. \"Do you remember, John, how he used to scold me, and say that I should never come to good. He has said the same thing to you, Kate, I dare say?\"\n\"He has been very kind to me,\" said Kate, standing at the foot of the bed. She was not one of those whose tears stand near their eyes.\n\"He was a fine old gentleman,\" said John Vavasor;--\"belonging to days that are now gone by, but by no means the less of a gentleman on that account. I don't know that he ever did an unjust or ungenerous act to any one. Come, Kate, we may as well go down.\" Mrs. Greenow lingered to say a word or two to the nurse, of the manner in which Greenow's body was treated when Greenow was lying dead, and then she followed her brother and niece.\nGeorge did not go into Penrith, nor did he see Mr. Gogram till that worthy attorney came out to Vavasor Hall on the morning of the funeral. He said nothing more on the subject, nor did he break the seals on the old upright desk that stood in the parlour. The two days before the funeral were very wretched for all the party, except, perhaps, for Mrs. Greenow, who affected not to understand that her nephew was in a bad humour. She called him \"poor George,\" and treated all his incivility to herself as though it were the effect of his grief. She asked him questions about Parliament, which, of course, he didn't answer, and told him little stories about poor dear Greenow, not heeding his expressions of unmistakable disgust.\nThe two days at last went by, and the hour of the funeral came. There was the doctor and Gogram, and the uncle and the nephew, to follow the corpse,--the nephew taking upon himself ostentatiously the foremost place, as though he could thereby help to maintain his pretensions as heir. The clergyman met them at the little wicket-gate of the churchyard, having, by some reasoning, which we hope was satisfactory to himself, overcome a resolution which he at first formed, that he would not read the burial service over an unrepentant sinner. But he did read it, having mentioned his scruples to none but one confidential clerical friend in the same diocese.\n\"I'm told that you have got my grandfather's will,\" George said to the attorney as soon as he saw him.\n\"I have it in my pocket,\" said Mr. Gogram, \"and purpose to read it as soon as we return from church.\"\n\"Is it usual to take a will away from a man's house in that way?\" George asked.\n\"Quite usual,\" said the attorney; \"and in this case it was done at the express desire of the testator.\"\n\"I think it is the common practice,\" said John Vavasor.\nGeorge upon this turned round at his uncle as though about to attack him, but he restrained himself and said nothing, though he showed his teeth.\nThe funeral was very plain, and not a word was spoken by George Vavasor during the journey there and back. John Vavasor asked a few questions of the doctor as to the last weeks of his father's life; and it was incidentally mentioned, both by the doctor and by the attorney, that the old Squire's intellect had remained unimpaired up to the last moment that he had been seen by either of them. When they returned to the hall Mrs. Greenow met them with an invitation to lunch. They all went to the dining-room, and drank each a glass of sherry. George took two or three glasses. The doctor then withdrew, and drove himself back to Penrith, where he lived.\n\"Shall we go into the other room now?\" said the attorney.\nThe three gentlemen then rose up, and went across to the drawing-room, George leading the way. The attorney followed him, and John Vavasor closed the door behind them. Had any observer been there to watch them he might have seen by the faces of the two latter that they expected an unpleasant meeting. Mr. Gogram, as he had walked across the hall, had pulled a document out of his pocket, and held it in his hand as he took a chair. John Vavasor stood behind one of the chairs which had been placed at the table, and leaned upon it, looking across the room, up at the ceiling. George stood on the rug before the fire, with his hands in the pockets of his trousers, and his coat tails over his arms.\n\"Gentlemen, will you sit down?\" said Mr. Gogram.\nJohn Vavasor immediately sat down.\n\"I prefer to stand here,\" said George.\nMr. Gogram then opened the document before him.\n\"Before that paper is read,\" said George, \"I think it right to say a few words. I don't know what it contains, but I believe it to have been executed by my grandfather only an hour or two before his death.\"\n\"On the day before he died,--early in the day,\" said the attorney.\n\"Well,--the day before he died; it is the same thing,--while he was dying, in fact. He never got out of bed afterwards.\"\n\"He was not in bed at the time, Mr. Vavasor. Not that it would have mattered if he had been. And he came down to dinner on that day. I don't understand, however, why you make these observations.\"\n\"If you'll listen to me you will understand. I make them because I deny my grandfather's fitness to make a will in the last moments of his existence, and at such an age. I saw him a few weeks ago, and he was not fit to be trusted with the management of property then.\"\n\"I do not think this is the time, George, to put forward such objections,\" said the uncle.\n\"I think it is,\" said George. \"I believe that that paper purports to be an instrument by which I should be villanously defrauded if it were allowed to be held as good. Therefore I protest against it now, and shall question it at law if action be taken on it. You can read it now, if you please.\"\n\"Oh, yes, I shall read,\" said Mr. Gogram; \"and I say that it is as valid a will as ever a man signed.\"\n\"And I say it's not. That's the difference between us.\"\nThe will was read amidst sundry interjections and expressions of anger from George, which it is not necessary to repeat. Nor need I trouble my readers with the will at length. It began by expressing the testator's great desire that his property might descend in his own family, and that the house might be held and inhabited by some one bearing the name of Vavasor. He then declared that he felt himself obliged to pass over his natural heir, believing that the property would not be safe in his hands; he therefore left it in trust to his son John Vavasor, whom he appointed to be sole executor of his will. He devised it to George's eldest son,--should George ever marry and have a son,--as soon as he might reach the age of twenty-five. In the meantime the property should remain in the hands of John Vavasor for his use and benefit, with a lien on it of five hundred a year to be paid annually to his granddaughter Kate. In the event of George having no son, the property was to go to the eldest son of Kate, or failing that to the eldest son of his other granddaughter who might take the name of Vavasor. All his personal property he left to his son, John Vavasor. \"And, Mr. Vavasor,\" said the attorney, as he finished his reading, \"you will, I fear, get very little by that latter clause. The estate now owes nothing; but I doubt whether the Squire had fifty pounds in his banker's hands when he died, and the value of the property about the place is very small. He has been unwilling to spend anything during the last ten years, but has paid off every shilling that the property owed.\"\n\"It is as I supposed,\" said George. His voice was very unpleasant, and so was the fire of his eyes and the ghastly rage of his scarred face. \"The old man has endeavoured in his anger to rob me of everything because I would not obey him in his wickedness when I was here with him a short while before he died. Such a will as that can stand nowhere.\"\n\"As to that I have nothing to say at present,\" said the attorney.\n\"Where is his other will,--the one he made before that?\"\n\"If I remember rightly we executed two before this.\"\n\"And where are they?\"\n\"It is not my business to know, Mr. Vavasor. I believe that I saw him destroy one, but I have no absolute knowledge. As to the other, I can say nothing.\"\n\"And what do you mean to do?\" said George, turning to his uncle.\n\"Do! I shall carry out the will. I have no alternative. Your sister is the person chiefly interested under it. She gets five hundred a year for her life; and if she marries and you don't, or if she has a son and you don't, her son will have the whole property.\"\nGeorge stood for a few moments thinking. Might it not be possible that by means of Alice and Kate together,--by marrying the former,--perhaps, he might still obtain possession of the property? But that which he wanted was the command of the property at once,--the power of raising money upon it instantly. The will had been so framed as to make that impossible in any way. Kate's share in it had not been left to her unconditionally, but was to be received even by her through the hands of her uncle John. Such a will shut him out from all his hopes. \"It is a piece of d---- roguery,\" he said.\n\"What do you mean by that, sir?\" said Gogram, turning round towards him.\n\"I mean exactly what I say. It is a piece of d---- roguery. Who was in the room when that thing was written?\"\n\"The signature was witnessed by--\"\n\"I don't ask as to the signature. Who was in the room when the thing was written?\"\n\"I was here with your grandfather.\"\n\"And no one else?\"\n\"No one else. The presence of any one else at such a time would be very unusual.\"\n\"Then I regard the document simply as waste paper.\" After saying this, George Vavasor left the room, and slammed the door after him.\n\"I never was insulted in such a way before,\" said the attorney, almost with tears in his eyes.\n\"He is a disappointed and I fear a ruined man,\" said John Vavasor. \"I do not think you need regard what he says.\"\n\"But he should not on that account insult me. I have only done my duty. I did not even advise his grandfather. It is mean on his part and unmanly. If he comes in my way again I shall tell him so.\"\n\"He probably will not put himself in your way again, Mr. Gogram.\"\nThen the attorney went, having suggested to Mr. Vavasor that he should instruct his attorney in London to take steps in reference to the proving of the will. \"It's as good a will as ever was made,\" said Mr. Gogram. \"If he can set that aside, I'll give up making wills altogether.\"\nWho was to tell Kate? That was John Vavasor's first thought when he was left alone at the hall-door, after seeing the lawyer start away. And how was he to get himself back to London without further quarrelling with his nephew? And what was he to do at once with reference to the immediate duties of proprietorship which were entailed upon him as executor? It was by no means improbable, as he thought, that George might assume to himself the position of master of the house; that he might demand the keys, for instance, which no doubt were in Kate's hands at present, and that he would take possession with violence. What should he do under such circumstances? It was clear that he could not run away and get back to his club by the night mail train. He had duties there at the Hall, and these duties were of a nature to make him almost regret the position in which his father's will had placed him. Eventually he would gain some considerable increase to his means, but the immediate effect would be terribly troublesome. As he looked up at the melancholy pines which were slowly waving their heads in the wind before the door he declared to himself that he would sell his inheritance and his executorship very cheaply, if such a sale were possible.\nIn the dining-room he found his sister alone. \"Well, John,\" said she; \"well? How is it left?\"\n\"Where is Kate?\" he asked.\n\"She has gone out with her brother.\"\n\"Did he take his hat?\"\n\"Oh, yes. He asked her to walk, and she went with him at once.\"\n\"Then, I suppose, he will tell her,\" said John Vavasor. After that he explained the circumstances of the will to Mrs. Greenow. \"Bravo,\" exclaimed the widow. \"I'm delighted. I love Kate dearly: and now she can marry almost whom she pleases.\"",
        "paragraph_chars": [
            [
                0,
                393
            ],
            [
                393,
                467
            ],
            [
                467,
                495
            ],
            [
                495,
                851
            ],
            [
                851,
                938
            ],
            [
                938,
                1113
            ],
            [
                1113,
                1149
            ],
            [
                1149,
                1372
            ],
            [
                1372,
                1413
            ],
            [
                1413,
                2445
            ],
            [
                2445,
                2782
            ],
            [
                2782,
                2860
            ],
            [
                2860,
                2894
            ],
            [
                2894,
                3629
            ],
            [
                3629,
                3851
            ],
            [
                3851,
                3895
            ],
            [
                3895,
                3956
            ],
            [
                3956,
                4091
            ],
            [
                4091,
                4166
            ],
            [
                4166,
                4330
            ],
            [
                4330,
                4415
            ],
            [
                4415,
                4917
            ],
            [
                4917,
                4957
            ],
            [
                4957,
                5035
            ],
            [
                5035,
                5090
            ],
            [
                5090,
                5120
            ],
            [
                5120,
                5263
            ],
            [
                5263,
                5403
            ],
            [
                5403,
                5442
            ],
            [
                5442,
                5610
            ],
            [
                5610,
                5715
            ],
            [
                5715,
                5732
            ],
            [
                5732,
                5778
            ],
            [
                5778,
                5820
            ],
            [
                5820,
                5914
            ],
            [
                5914,
                6294
            ],
            [
                6294,
                6357
            ],
            [
                6357,
                6371
            ],
            [
                6371,
                6385
            ],
            [
                6385,
                6739
            ],
            [
                6739,
                6927
            ],
            [
                6927,
                7076
            ],
            [
                7076,
                7113
            ],
            [
                7113,
                7334
            ],
            [
                7334,
                8047
            ],
            [
                8047,
                8363
            ],
            [
                8363,
                8498
            ],
            [
                8498,
                8935
            ],
            [
                8935,
                9662
            ],
            [
                9662,
                10319
            ],
            [
                10319,
                10422
            ],
            [
                10422,
                10524
            ],
            [
                10524,
                10604
            ],
            [
                10604,
                10708
            ],
            [
                10708,
                10764
            ],
            [
                10764,
                10910
            ],
            [
                10910,
                11564
            ],
            [
                11564,
                11622
            ],
            [
                11622,
                12321
            ],
            [
                12321,
                12370
            ],
            [
                12370,
                12405
            ],
            [
                12405,
                12444
            ],
            [
                12444,
                12492
            ],
            [
                12492,
                12699
            ],
            [
                12699,
                12766
            ],
            [
                12766,
                12887
            ],
            [
                12887,
                13083
            ],
            [
                13083,
                13352
            ],
            [
                13352,
                13443
            ],
            [
                13443,
                13739
            ],
            [
                13739,
                13842
            ],
            [
                13842,
                13898
            ],
            [
                13898,
                15491
            ],
            [
                15491,
                15840
            ],
            [
                15840,
                15906
            ],
            [
                15906,
                15963
            ],
            [
                15963,
                16016
            ],
            [
                16016,
                16038
            ],
            [
                16038,
                16192
            ],
            [
                16192,
                16257
            ],
            [
                16257,
                16519
            ],
            [
                16519,
                17113
            ],
            [
                17113,
                17186
            ],
            [
                17186,
                17296
            ],
            [
                17296,
                17331
            ],
            [
                17331,
                17414
            ],
            [
                17414,
                17450
            ],
            [
                17450,
                17469
            ],
            [
                17469,
                17551
            ],
            [
                17551,
                17684
            ],
            [
                17684,
                17779
            ],
            [
                17779,
                17893
            ],
            [
                17893,
                18090
            ],
            [
                18090,
                18156
            ],
            [
                18156,
                18437
            ],
            [
                18437,
                19687
            ],
            [
                19687,
                19781
            ],
            [
                19781,
                19808
            ],
            [
                19808,
                19845
            ],
            [
                19845,
                19868
            ],
            [
                19868,
                19932
            ],
            [
                19932,
                20172
            ]
        ],
        "segment_chars": [
            [
                0,
                76
            ],
            [
                76,
                168
            ],
            [
                168,
                282
            ],
            [
                282,
                393
            ],
            [
                393,
                467
            ],
            [
                467,
                495
            ],
            [
                495,
                525
            ],
            [
                525,
                544
            ],
            [
                544,
                581
            ],
            [
                581,
                615
            ],
            [
                615,
                712
            ],
            [
                712,
                851
            ],
            [
                851,
                887
            ],
            [
                887,
                938
            ],
            [
                938,
                955
            ],
            [
                955,
                967
            ],
            [
                967,
                1026
            ],
            [
                1026,
                1072
            ],
            [
                1072,
                1113
            ],
            [
                1113,
                1149
            ],
            [
                1149,
                1154
            ],
            [
                1154,
                1204
            ],
            [
                1204,
                1306
            ],
            [
                1306,
                1372
            ],
            [
                1372,
                1413
            ],
            [
                1413,
                1438
            ],
            [
                1438,
                1448
            ],
            [
                1448,
                1497
            ],
            [
                1497,
                1735
            ],
            [
                1735,
                1892
            ],
            [
                1892,
                2008
            ],
            [
                2008,
                2156
            ],
            [
                2156,
                2332
            ],
            [
                2332,
                2445
            ],
            [
                2445,
                2591
            ],
            [
                2591,
                2782
            ],
            [
                2782,
                2818
            ],
            [
                2818,
                2860
            ],
            [
                2860,
                2894
            ],
            [
                2894,
                2934
            ],
            [
                2934,
                2956
            ],
            [
                2956,
                3090
            ],
            [
                3090,
                3147
            ],
            [
                3147,
                3398
            ],
            [
                3398,
                3491
            ],
            [
                3491,
                3629
            ],
            [
                3629,
                3742
            ],
            [
                3742,
                3851
            ],
            [
                3851,
                3895
            ],
            [
                3895,
                3956
            ],
            [
                3956,
                3999
            ],
            [
                3999,
                4040
            ],
            [
                4040,
                4091
            ],
            [
                4091,
                4166
            ],
            [
                4166,
                4198
            ],
            [
                4198,
                4330
            ],
            [
                4330,
                4415
            ],
            [
                4415,
                4459
            ],
            [
                4459,
                4483
            ],
            [
                4483,
                4604
            ],
            [
                4604,
                4640
            ],
            [
                4640,
                4883
            ],
            [
                4883,
                4917
            ],
            [
                4917,
                4957
            ],
            [
                4957,
                5035
            ],
            [
                5035,
                5090
            ],
            [
                5090,
                5097
            ],
            [
                5097,
                5120
            ],
            [
                5120,
                5133
            ],
            [
                5133,
                5263
            ],
            [
                5263,
                5303
            ],
            [
                5303,
                5325
            ],
            [
                5325,
                5403
            ],
            [
                5403,
                5442
            ],
            [
                5442,
                5473
            ],
            [
                5473,
                5505
            ],
            [
                5505,
                5567
            ],
            [
                5567,
                5610
            ],
            [
                5610,
                5697
            ],
            [
                5697,
                5715
            ],
            [
                5715,
                5732
            ],
            [
                5732,
                5778
            ],
            [
                5778,
                5820
            ],
            [
                5820,
                5844
            ],
            [
                5844,
                5878
            ],
            [
                5878,
                5914
            ],
            [
                5914,
                5927
            ],
            [
                5927,
                5981
            ],
            [
                5981,
                6167
            ],
            [
                6167,
                6204
            ],
            [
                6204,
                6294
            ],
            [
                6294,
                6357
            ],
            [
                6357,
                6371
            ],
            [
                6371,
                6385
            ],
            [
                6385,
                6411
            ],
            [
                6411,
                6449
            ],
            [
                6449,
                6517
            ],
            [
                6517,
                6526
            ],
            [
                6526,
                6581
            ],
            [
                6581,
                6739
            ],
            [
                6739,
                6927
            ],
            [
                6927,
                6932
            ],
            [
                6932,
                6942
            ],
            [
                6942,
                6989
            ],
            [
                6989,
                7038
            ],
            [
                7038,
                7076
            ],
            [
                7076,
                7101
            ],
            [
                7101,
                7113
            ],
            [
                7113,
                7146
            ],
            [
                7146,
                7309
            ],
            [
                7309,
                7334
            ],
            [
                7334,
                7410
            ],
            [
                7410,
                7517
            ],
            [
                7517,
                7593
            ],
            [
                7593,
                7765
            ],
            [
                7765,
                8047
            ],
            [
                8047,
                8140
            ],
            [
                8140,
                8162
            ],
            [
                8162,
                8218
            ],
            [
                8218,
                8309
            ],
            [
                8309,
                8363
            ],
            [
                8363,
                8438
            ],
            [
                8438,
                8498
            ],
            [
                8498,
                8647
            ],
            [
                8647,
                8717
            ],
            [
                8717,
                8754
            ],
            [
                8754,
                8935
            ],
            [
                8935,
                9075
            ],
            [
                9075,
                9190
            ],
            [
                9190,
                9363
            ],
            [
                9363,
                9478
            ],
            [
                9478,
                9662
            ],
            [
                9662,
                9726
            ],
            [
                9726,
                9947
            ],
            [
                9947,
                10203
            ],
            [
                10203,
                10319
            ],
            [
                10319,
                10422
            ],
            [
                10422,
                10524
            ],
            [
                10524,
                10590
            ],
            [
                10590,
                10604
            ],
            [
                10604,
                10708
            ],
            [
                10708,
                10764
            ],
            [
                10764,
                10910
            ],
            [
                10910,
                11017
            ],
            [
                11017,
                11303
            ],
            [
                11303,
                11385
            ],
            [
                11385,
                11453
            ],
            [
                11453,
                11487
            ],
            [
                11487,
                11564
            ],
            [
                11564,
                11603
            ],
            [
                11603,
                11622
            ],
            [
                11622,
                11717
            ],
            [
                11717,
                11790
            ],
            [
                11790,
                11924
            ],
            [
                11924,
                12055
            ],
            [
                12055,
                12199
            ],
            [
                12199,
                12321
            ],
            [
                12321,
                12353
            ],
            [
                12353,
                12370
            ],
            [
                12370,
                12405
            ],
            [
                12405,
                12444
            ],
            [
                12444,
                12492
            ],
            [
                12492,
                12572
            ],
            [
                12572,
                12699
            ],
            [
                12699,
                12766
            ],
            [
                12766,
                12850
            ],
            [
                12850,
                12887
            ],
            [
                12887,
                12932
            ],
            [
                12932,
                12980
            ],
            [
                12980,
                13020
            ],
            [
                13020,
                13083
            ],
            [
                13083,
                13128
            ],
            [
                13128,
                13253
            ],
            [
                13253,
                13352
            ],
            [
                13352,
                13443
            ],
            [
                13443,
                13473
            ],
            [
                13473,
                13611
            ],
            [
                13611,
                13702
            ],
            [
                13702,
                13739
            ],
            [
                13739,
                13842
            ],
            [
                13842,
                13863
            ],
            [
                13863,
                13898
            ],
            [
                13898,
                14019
            ],
            [
                14019,
                14074
            ],
            [
                14074,
                14264
            ],
            [
                14264,
                14507
            ],
            [
                14507,
                14638
            ],
            [
                14638,
                14823
            ],
            [
                14823,
                15008
            ],
            [
                15008,
                15068
            ],
            [
                15068,
                15193
            ],
            [
                15193,
                15367
            ],
            [
                15367,
                15491
            ],
            [
                15491,
                15527
            ],
            [
                15527,
                15632
            ],
            [
                15632,
                15800
            ],
            [
                15800,
                15840
            ],
            [
                15840,
                15906
            ],
            [
                15906,
                15963
            ],
            [
                15963,
                16016
            ],
            [
                16016,
                16038
            ],
            [
                16038,
                16083
            ],
            [
                16083,
                16155
            ],
            [
                16155,
                16192
            ],
            [
                16192,
                16222
            ],
            [
                16222,
                16257
            ],
            [
                16257,
                16262
            ],
            [
                16262,
                16290
            ],
            [
                16290,
                16313
            ],
            [
                16313,
                16368
            ],
            [
                16368,
                16519
            ],
            [
                16519,
                16560
            ],
            [
                16560,
                16712
            ],
            [
                16712,
                16825
            ],
            [
                16825,
                16892
            ],
            [
                16892,
                17025
            ],
            [
                17025,
                17070
            ],
            [
                17070,
                17113
            ],
            [
                17113,
                17146
            ],
            [
                17146,
                17186
            ],
            [
                17186,
                17214
            ],
            [
                17214,
                17246
            ],
            [
                17246,
                17296
            ],
            [
                17296,
                17331
            ],
            [
                17331,
                17365
            ],
            [
                17365,
                17414
            ],
            [
                17414,
                17450
            ],
            [
                17450,
                17469
            ],
            [
                17469,
                17483
            ],
            [
                17483,
                17551
            ],
            [
                17551,
                17603
            ],
            [
                17603,
                17684
            ],
            [
                17684,
                17779
            ],
            [
                17779,
                17846
            ],
            [
                17846,
                17893
            ],
            [
                17893,
                17939
            ],
            [
                17939,
                17965
            ],
            [
                17965,
                18004
            ],
            [
                18004,
                18040
            ],
            [
                18040,
                18090
            ],
            [
                18090,
                18156
            ],
            [
                18156,
                18314
            ],
            [
                18314,
                18371
            ],
            [
                18371,
                18437
            ],
            [
                18437,
                18459
            ],
            [
                18459,
                18574
            ],
            [
                18574,
                18664
            ],
            [
                18664,
                18793
            ],
            [
                18793,
                19054
            ],
            [
                19054,
                19098
            ],
            [
                19098,
                19188
            ],
            [
                19188,
                19337
            ],
            [
                19337,
                19459
            ],
            [
                19459,
                19687
            ],
            [
                19687,
                19733
            ],
            [
                19733,
                19764
            ],
            [
                19764,
                19781
            ],
            [
                19781,
                19798
            ],
            [
                19798,
                19808
            ],
            [
                19808,
                19845
            ],
            [
                19845,
                19868
            ],
            [
                19868,
                19878
            ],
            [
                19878,
                19932
            ],
            [
                19932,
                19988
            ],
            [
                19988,
                20059
            ],
            [
                20059,
                20089
            ],
            [
                20089,
                20105
            ],
            [
                20105,
                20172
            ]
        ],
        "overlap_chars": [
            [
                0,
                26
            ],
            [
                47,
                76
            ],
            [
                76,
                122
            ],
            [
                141,
                154
            ],
            [
                159,
                168
            ],
            [
                168,
                206
            ],
            [
                220,
                266
            ],
            [
                270,
                280
            ],
            [
                333,
                334
            ],
            [
                282,
                292
            ],
            [
                299,
                333
            ],
            [
                391,
                393
            ],
            [
                393,
                467
            ],
            [
                467,
                495
            ],
            [
                495,
                525
            ],
            [
                525,
                544
            ],
            [
                544,
                581
            ],
            [
                581,
                615
            ],
            [
                615,
                640
            ],
            [
                675,
                690
            ],
            [
                696,
                712
            ],
            [
                712,
                813
            ],
            [
                848,
                851
            ],
            [
                851,
                857
            ],
            [
                865,
                887
            ],
            [
                887,
                931
            ],
            [
                932,
                938
            ],
            [
                955,
                967
            ],
            [
                967,
                1026
            ],
            [
                1031,
                1072
            ],
            [
                1438,
                1448
            ],
            [
                1448,
                1496
            ],
            [
                1497,
                1535
            ],
            [
                1540,
                1544
            ],
            [
                1607,
                1631
            ],
            [
                1545,
                1584
            ],
            [
                1632,
                1636
            ],
            [
                1667,
                1718
            ],
            [
                1729,
                1735
            ],
            [
                1735,
                1892
            ],
            [
                1892,
                1914
            ],
            [
                1918,
                2007
            ],
            [
                2008,
                2118
            ],
            [
                2141,
                2147
            ],
            [
                2153,
                2156
            ],
            [
                2156,
                2202
            ],
            [
                2269,
                2314
            ],
            [
                2321,
                2331
            ],
            [
                2332,
                2424
            ],
            [
                2443,
                2445
            ],
            [
                2445,
                2470
            ],
            [
                2486,
                2509
            ],
            [
                2541,
                2591
            ],
            [
                2591,
                2606
            ],
            [
                2616,
                2663
            ],
            [
                2686,
                2705
            ],
            [
                2719,
                2726
            ],
            [
                2780,
                2782
            ],
            [
                2782,
                2818
            ],
            [
                2818,
                2860
            ],
            [
                2860,
                2894
            ],
            [
                2894,
                2934
            ],
            [
                2934,
                2956
            ],
            [
                2956,
                3090
            ],
            [
                3119,
                3142
            ],
            [
                3102,
                3105
            ],
            [
                3113,
                3117
            ],
            [
                3145,
                3147
            ],
            [
                3147,
                3150
            ],
            [
                3175,
                3209
            ],
            [
                3396,
                3398
            ],
            [
                3398,
                3417
            ],
            [
                3440,
                3491
            ],
            [
                3491,
                3609
            ],
            [
                3622,
                3629
            ],
            [
                3629,
                3709
            ],
            [
                3716,
                3722
            ],
            [
                3731,
                3742
            ],
            [
                3742,
                3851
            ],
            [
                3851,
                3895
            ],
            [
                3895,
                3956
            ],
            [
                3956,
                3973
            ],
            [
                3997,
                3999
            ],
            [
                3999,
                4040
            ],
            [
                4040,
                4086
            ],
            [
                4088,
                4091
            ],
            [
                4091,
                4104
            ],
            [
                4112,
                4115
            ],
            [
                4129,
                4166
            ],
            [
                4166,
                4198
            ],
            [
                4198,
                4330
            ],
            [
                4330,
                4380
            ],
            [
                4403,
                4415
            ],
            [
                4415,
                4459
            ],
            [
                4459,
                4483
            ],
            [
                4483,
                4544
            ],
            [
                4547,
                4572
            ],
            [
                4579,
                4604
            ],
            [
                4604,
                4640
            ],
            [
                4640,
                4682
            ],
            [
                4773,
                4808
            ],
            [
                4691,
                4697
            ],
            [
                4849,
                4854
            ],
            [
                4858,
                4883
            ],
            [
                4883,
                4917
            ],
            [
                4917,
                4944
            ],
            [
                4954,
                4957
            ],
            [
                4957,
                4981
            ],
            [
                4991,
                5035
            ],
            [
                5035,
                5078
            ],
            [
                5080,
                5090
            ],
            [
                5090,
                5097
            ],
            [
                5097,
                5120
            ],
            [
                5120,
                5133
            ],
            [
                5133,
                5263
            ],
            [
                5263,
                5303
            ],
            [
                5303,
                5325
            ],
            [
                5325,
                5403
            ],
            [
                5403,
                5442
            ],
            [
                5442,
                5473
            ],
            [
                5505,
                5567
            ],
            [
                5567,
                5610
            ],
            [
                5610,
                5655
            ],
            [
                5677,
                5697
            ],
            [
                5697,
                5715
            ],
            [
                5715,
                5732
            ],
            [
                5732,
                5748
            ],
            [
                5761,
                5766
            ],
            [
                5775,
                5778
            ],
            [
                5778,
                5820
            ],
            [
                5848,
                5857
            ],
            [
                5886,
                5914
            ],
            [
                5914,
                5927
            ],
            [
                5927,
                5981
            ],
            [
                5981,
                6047
            ],
            [
                6054,
                6082
            ],
            [
                6086,
                6167
            ],
            [
                6167,
                6204
            ],
            [
                6204,
                6273
            ],
            [
                6275,
                6294
            ],
            [
                6294,
                6357
            ],
            [
                6357,
                6371
            ],
            [
                6371,
                6385
            ],
            [
                6415,
                6449
            ],
            [
                6449,
                6517
            ],
            [
                6517,
                6519
            ],
            [
                6524,
                6526
            ],
            [
                6526,
                6537
            ],
            [
                6581,
                6585
            ],
            [
                6591,
                6594
            ],
            [
                6607,
                6625
            ],
            [
                6736,
                6739
            ],
            [
                6739,
                6878
            ],
            [
                6880,
                6927
            ],
            [
                6927,
                6932
            ],
            [
                6932,
                6942
            ],
            [
                6942,
                6949
            ],
            [
                6954,
                6989
            ],
            [
                6989,
                7023
            ],
            [
                7036,
                7037
            ],
            [
                7038,
                7076
            ],
            [
                7076,
                7101
            ],
            [
                7101,
                7113
            ],
            [
                7113,
                7116
            ],
            [
                7146,
                7221
            ],
            [
                7237,
                7256
            ],
            [
                7287,
                7307
            ],
            [
                7334,
                7357
            ],
            [
                7387,
                7410
            ],
            [
                7410,
                7477
            ],
            [
                7490,
                7517
            ],
            [
                7517,
                7593
            ],
            [
                7687,
                7765
            ],
            [
                7765,
                7782
            ],
            [
                7793,
                7851
            ],
            [
                7865,
                7922
            ],
            [
                7953,
                7960
            ],
            [
                7964,
                7969
            ],
            [
                7961,
                7963
            ],
            [
                7979,
                8002
            ],
            [
                8011,
                8047
            ],
            [
                8060,
                8084
            ],
            [
                8047,
                8051
            ],
            [
                8089,
                8139
            ],
            [
                8140,
                8162
            ],
            [
                8162,
                8218
            ],
            [
                8218,
                8309
            ],
            [
                8309,
                8363
            ],
            [
                8363,
                8403
            ],
            [
                8436,
                8437
            ],
            [
                8498,
                8546
            ],
            [
                8645,
                8647
            ],
            [
                8647,
                8707
            ],
            [
                8715,
                8717
            ],
            [
                8717,
                8753
            ],
            [
                8935,
                8997
            ],
            [
                9010,
                9023
            ],
            [
                9028,
                9075
            ],
            [
                9190,
                9248
            ],
            [
                9258,
                9276
            ],
            [
                9281,
                9298
            ],
            [
                9308,
                9363
            ],
            [
                9363,
                9423
            ],
            [
                9435,
                9466
            ],
            [
                9471,
                9477
            ],
            [
                9675,
                9682
            ],
            [
                9696,
                9726
            ],
            [
                9726,
                9731
            ],
            [
                9736,
                9809
            ],
            [
                9812,
                9822
            ],
            [
                9843,
                9857
            ],
            [
                9823,
                9829
            ],
            [
                9858,
                9876
            ],
            [
                9945,
                9946
            ],
            [
                10319,
                10422
            ],
            [
                10422,
                10469
            ],
            [
                10478,
                10488
            ],
            [
                10500,
                10524
            ],
            [
                10524,
                10590
            ],
            [
                10590,
                10604
            ],
            [
                10604,
                10708
            ],
            [
                10708,
                10764
            ],
            [
                10764,
                10837
            ],
            [
                10899,
                10910
            ],
            [
                10910,
                10941
            ],
            [
                10967,
                10973
            ],
            [
                10942,
                10952
            ],
            [
                10982,
                11017
            ],
            [
                11017,
                11065
            ],
            [
                11072,
                11119
            ],
            [
                11133,
                11142
            ],
            [
                11149,
                11151
            ],
            [
                11144,
                11148
            ],
            [
                11152,
                11166
            ],
            [
                11170,
                11182
            ],
            [
                11184,
                11261
            ],
            [
                11301,
                11302
            ],
            [
                11303,
                11355
            ],
            [
                11385,
                11428
            ],
            [
                11434,
                11453
            ],
            [
                11453,
                11487
            ],
            [
                11487,
                11502
            ],
            [
                11562,
                11564
            ],
            [
                11564,
                11603
            ],
            [
                11603,
                11622
            ],
            [
                11622,
                11641
            ],
            [
                11660,
                11717
            ],
            [
                11717,
                11790
            ],
            [
                11798,
                11806
            ],
            [
                11790,
                11793
            ],
            [
                11807,
                11811
            ],
            [
                11832,
                11923
            ],
            [
                11924,
                11934
            ],
            [
                12015,
                12019
            ],
            [
                11981,
                11991
            ],
            [
                12023,
                12055
            ],
            [
                12055,
                12178
            ],
            [
                12197,
                12199
            ],
            [
                12199,
                12257
            ],
            [
                12273,
                12276
            ],
            [
                12262,
                12269
            ],
            [
                12319,
                12321
            ],
            [
                12321,
                12353
            ],
            [
                12353,
                12369
            ],
            [
                12370,
                12405
            ],
            [
                12405,
                12444
            ],
            [
                12444,
                12479
            ],
            [
                12490,
                12492
            ],
            [
                12492,
                12572
            ],
            [
                12572,
                12699
            ],
            [
                12699,
                12700
            ],
            [
                12728,
                12733
            ],
            [
                12700,
                12725
            ],
            [
                12744,
                12766
            ],
            [
                12766,
                12772
            ],
            [
                12798,
                12818
            ],
            [
                12821,
                12839
            ],
            [
                12848,
                12850
            ],
            [
                12850,
                12887
            ],
            [
                12887,
                12932
            ],
            [
                12932,
                12980
            ],
            [
                12980,
                13020
            ],
            [
                13020,
                13083
            ],
            [
                13128,
                13253
            ],
            [
                13253,
                13352
            ],
            [
                13352,
                13443
            ],
            [
                13443,
                13473
            ],
            [
                13473,
                13483
            ],
            [
                13489,
                13511
            ],
            [
                13556,
                13565
            ],
            [
                13609,
                13611
            ],
            [
                13611,
                13641
            ],
            [
                13645,
                13675
            ],
            [
                13700,
                13702
            ],
            [
                13702,
                13739
            ],
            [
                13739,
                13761
            ],
            [
                13761,
                13842
            ],
            [
                13842,
                13861
            ],
            [
                13898,
                13922
            ],
            [
                13939,
                13943
            ],
            [
                13969,
                14019
            ],
            [
                14019,
                14074
            ],
            [
                14074,
                14203
            ],
            [
                14213,
                14225
            ],
            [
                14235,
                14263
            ],
            [
                14267,
                14473
            ],
            [
                14480,
                14507
            ],
            [
                14518,
                14520
            ],
            [
                14521,
                14543
            ],
            [
                14546,
                14585
            ],
            [
                14588,
                14638
            ],
            [
                14638,
                14739
            ],
            [
                14756,
                14775
            ],
            [
                14753,
                14755
            ],
            [
                14750,
                14752
            ],
            [
                14776,
                14822
            ],
            [
                14823,
                15008
            ],
            [
                15008,
                15024
            ],
            [
                15034,
                15067
            ],
            [
                15068,
                15106
            ],
            [
                15107,
                15177
            ],
            [
                15185,
                15193
            ],
            [
                15193,
                15272
            ],
            [
                15292,
                15326
            ],
            [
                15327,
                15367
            ],
            [
                15367,
                15369
            ],
            [
                15379,
                15437
            ],
            [
                15442,
                15491
            ],
            [
                15491,
                15527
            ],
            [
                15527,
                15568
            ],
            [
                15594,
                15632
            ],
            [
                15632,
                15648
            ],
            [
                15674,
                15800
            ],
            [
                15800,
                15840
            ],
            [
                15840,
                15906
            ],
            [
                15906,
                15930
            ],
            [
                15933,
                15963
            ],
            [
                15963,
                16016
            ],
            [
                16016,
                16038
            ],
            [
                16038,
                16083
            ],
            [
                16083,
                16155
            ],
            [
                16155,
                16192
            ],
            [
                16192,
                16222
            ],
            [
                16222,
                16257
            ],
            [
                16257,
                16262
            ],
            [
                16262,
                16290
            ],
            [
                16290,
                16313
            ],
            [
                16313,
                16368
            ],
            [
                16368,
                16414
            ],
            [
                16448,
                16519
            ],
            [
                16519,
                16560
            ],
            [
                16560,
                16625
            ],
            [
                16628,
                16650
            ],
            [
                16662,
                16676
            ],
            [
                16695,
                16712
            ],
            [
                16712,
                16715
            ],
            [
                16727,
                16736
            ],
            [
                16756,
                16776
            ],
            [
                16779,
                16825
            ],
            [
                16825,
                16879
            ],
            [
                16890,
                16892
            ],
            [
                16892,
                16975
            ],
            [
                16988,
                17025
            ],
            [
                17025,
                17069
            ],
            [
                17070,
                17089
            ],
            [
                17094,
                17113
            ],
            [
                17113,
                17146
            ],
            [
                17146,
                17157
            ],
            [
                17184,
                17186
            ],
            [
                17186,
                17214
            ],
            [
                17246,
                17296
            ],
            [
                17296,
                17327
            ],
            [
                17331,
                17343
            ],
            [
                17350,
                17365
            ],
            [
                17365,
                17414
            ],
            [
                17414,
                17450
            ],
            [
                17450,
                17469
            ],
            [
                17469,
                17483
            ],
            [
                17483,
                17498
            ],
            [
                17507,
                17551
            ],
            [
                17551,
                17603
            ],
            [
                17616,
                17684
            ],
            [
                17684,
                17779
            ],
            [
                17779,
                17846
            ],
            [
                17846,
                17893
            ],
            [
                17893,
                17911
            ],
            [
                17928,
                17939
            ],
            [
                17939,
                17965
            ],
            [
                17965,
                18004
            ],
            [
                18004,
                18014
            ],
            [
                18027,
                18040
            ],
            [
                18040,
                18090
            ],
            [
                18090,
                18156
            ],
            [
                18156,
                18173
            ],
            [
                18178,
                18272
            ],
            [
                18293,
                18300
            ],
            [
                18304,
                18314
            ],
            [
                18314,
                18370
            ],
            [
                18437,
                18459
            ],
            [
                18459,
                18508
            ],
            [
                18514,
                18519
            ],
            [
                18572,
                18574
            ],
            [
                18574,
                18595
            ],
            [
                18604,
                18664
            ],
            [
                18664,
                18693
            ],
            [
                18726,
                18732
            ],
            [
                18780,
                18792
            ],
            [
                18793,
                18863
            ],
            [
                18875,
                19054
            ],
            [
                19054,
                19071
            ],
            [
                19078,
                19098
            ],
            [
                19098,
                19162
            ],
            [
                19186,
                19188
            ],
            [
                19188,
                19201
            ],
            [
                19208,
                19219
            ],
            [
                19263,
                19337
            ],
            [
                19337,
                19366
            ],
            [
                19380,
                19458
            ],
            [
                19687,
                19732
            ],
            [
                19733,
                19755
            ],
            [
                19764,
                19781
            ],
            [
                19781,
                19797
            ],
            [
                19808,
                19825
            ],
            [
                19891,
                19898
            ],
            [
                19826,
                19845
            ],
            [
                19932,
                19937
            ],
            [
                19939,
                19948
            ],
            [
                19950,
                19988
            ],
            [
                19999,
                20058
            ],
            [
                20059,
                20089
            ],
            [
                20089,
                20105
            ],
            [
                20105,
                20172
            ]
        ],
        "row_chars": [
            [
                0,
                76
            ],
            [
                76,
                168
            ],
            [
                168,
                393
            ],
            [
                393,
                467
            ],
            [
                467,
                495
            ],
            [
                495,
                525
            ],
            [
                525,
                544
            ],
            [
                544,
                581
            ],
            [
                581,
                615
            ],
            [
                615,
                712
            ],
            [
                712,
                851
            ],
            [
                851,
                887
            ],
            [
                887,
                938
            ],
            [
                938,
                955
            ],
            [
                955,
                967
            ],
            [
                967,
                1026
            ],
            [
                1026,
                1072
            ],
            [
                1072,
                1113
            ],
            [
                1113,
                1149
            ],
            [
                1149,
                1154
            ],
            [
                1154,
                1204
            ],
            [
                1204,
                1306
            ],
            [
                1306,
                1372
            ],
            [
                1372,
                1413
            ],
            [
                1413,
                1438
            ],
            [
                1438,
                1448
            ],
            [
                1448,
                1497
            ],
            [
                1497,
                1735
            ],
            [
                1735,
                1892
            ],
            [
                1892,
                2008
            ],
            [
                2008,
                2156
            ],
            [
                2156,
                2332
            ],
            [
                2332,
                2445
            ],
            [
                2445,
                2591
            ],
            [
                2591,
                2782
            ],
            [
                2782,
                2818
            ],
            [
                2818,
                2860
            ],
            [
                2860,
                2894
            ],
            [
                2894,
                2934
            ],
            [
                2934,
                2956
            ],
            [
                2956,
                3090
            ],
            [
                3090,
                3147
            ],
            [
                3147,
                3398
            ],
            [
                3398,
                3491
            ],
            [
                3491,
                3629
            ],
            [
                3629,
                3742
            ],
            [
                3742,
                3851
            ],
            [
                3851,
                3895
            ],
            [
                3895,
                3956
            ],
            [
                3956,
                3999
            ],
            [
                3999,
                4040
            ],
            [
                4040,
                4091
            ],
            [
                4091,
                4166
            ],
            [
                4166,
                4198
            ],
            [
                4198,
                4330
            ],
            [
                4330,
                4415
            ],
            [
                4415,
                4459
            ],
            [
                4459,
                4483
            ],
            [
                4483,
                4604
            ],
            [
                4604,
                4640
            ],
            [
                4640,
                4883
            ],
            [
                4883,
                4917
            ],
            [
                4917,
                4957
            ],
            [
                4957,
                5035
            ],
            [
                5035,
                5090
            ],
            [
                5090,
                5097
            ],
            [
                5097,
                5120
            ],
            [
                5120,
                5133
            ],
            [
                5133,
                5263
            ],
            [
                5263,
                5303
            ],
            [
                5303,
                5325
            ],
            [
                5325,
                5403
            ],
            [
                5403,
                5442
            ],
            [
                5442,
                5473
            ],
            [
                5473,
                5505
            ],
            [
                5505,
                5567
            ],
            [
                5567,
                5610
            ],
            [
                5610,
                5697
            ],
            [
                5697,
                5715
            ],
            [
                5715,
                5732
            ],
            [
                5732,
                5778
            ],
            [
                5778,
                5820
            ],
            [
                5820,
                5844
            ],
            [
                5844,
                5914
            ],
            [
                5914,
                5927
            ],
            [
                5927,
                5981
            ],
            [
                5981,
                6167
            ],
            [
                6167,
                6204
            ],
            [
                6204,
                6294
            ],
            [
                6294,
                6357
            ],
            [
                6357,
                6371
            ],
            [
                6371,
                6385
            ],
            [
                6385,
                6411
            ],
            [
                6411,
                6449
            ],
            [
                6449,
                6517
            ],
            [
                6517,
                6526
            ],
            [
                6526,
                6739
            ],
            [
                6739,
                6927
            ],
            [
                6927,
                6932
            ],
            [
                6932,
                6942
            ],
            [
                6942,
                6989
            ],
            [
                6989,
                7038
            ],
            [
                7038,
                7076
            ],
            [
                7076,
                7101
            ],
            [
                7101,
                7113
            ],
            [
                7113,
                7146
            ],
            [
                7146,
                7309
            ],
            [
                7309,
                7334
            ],
            [
                7334,
                7410
            ],
            [
                7410,
                7517
            ],
            [
                7517,
                7593
            ],
            [
                7593,
                7765
            ],
            [
                7765,
                8047
            ],
            [
                8047,
                8140
            ],
            [
                8140,
                8162
            ],
            [
                8162,
                8218
            ],
            [
                8218,
                8309
            ],
            [
                8309,
                8363
            ],
            [
                8363,
                8438
            ],
            [
                8438,
                8498
            ],
            [
                8498,
                8647
            ],
            [
                8647,
                8717
            ],
            [
                8717,
                8754
            ],
            [
                8754,
                8935
            ],
            [
                8935,
                9075
            ],
            [
                9075,
                9190
            ],
            [
                9190,
                9363
            ],
            [
                9363,
                9478
            ],
            [
                9478,
                9662
            ],
            [
                9662,
                9726
            ],
            [
                9726,
                9947
            ],
            [
                9947,
                10203
            ],
            [
                10203,
                10319
            ],
            [
                10319,
                10422
            ],
            [
                10422,
                10524
            ],
            [
                10524,
                10590
            ],
            [
                10590,
                10604
            ],
            [
                10604,
                10708
            ],
            [
                10708,
                10764
            ],
            [
                10764,
                10910
            ],
            [
                10910,
                11017
            ],
            [
                11017,
                11303
            ],
            [
                11303,
                11453
            ],
            [
                11453,
                11487
            ],
            [
                11487,
                11564
            ],
            [
                11564,
                11603
            ],
            [
                11603,
                11622
            ],
            [
                11622,
                11717
            ],
            [
                11717,
                11790
            ],
            [
                11790,
                11924
            ],
            [
                11924,
                12055
            ],
            [
                12055,
                12199
            ],
            [
                12199,
                12321
            ],
            [
                12321,
                12353
            ],
            [
                12353,
                12370
            ],
            [
                12370,
                12405
            ],
            [
                12405,
                12444
            ],
            [
                12444,
                12492
            ],
            [
                12492,
                12572
            ],
            [
                12572,
                12699
            ],
            [
                12699,
                12766
            ],
            [
                12766,
                12850
            ],
            [
                12850,
                12887
            ],
            [
                12887,
                12932
            ],
            [
                12932,
                12980
            ],
            [
                12980,
                13020
            ],
            [
                13020,
                13083
            ],
            [
                13083,
                13128
            ],
            [
                13128,
                13253
            ],
            [
                13253,
                13352
            ],
            [
                13352,
                13443
            ],
            [
                13443,
                13473
            ],
            [
                13473,
                13611
            ],
            [
                13611,
                13702
            ],
            [
                13702,
                13739
            ],
            [
                13739,
                13842
            ],
            [
                13842,
                13863
            ],
            [
                13863,
                13898
            ],
            [
                13898,
                14019
            ],
            [
                14019,
                14074
            ],
            [
                14074,
                14264
            ],
            [
                14264,
                14507
            ],
            [
                14507,
                14638
            ],
            [
                14638,
                14823
            ],
            [
                14823,
                15008
            ],
            [
                15008,
                15068
            ],
            [
                15068,
                15193
            ],
            [
                15193,
                15367
            ],
            [
                15367,
                15491
            ],
            [
                15491,
                15527
            ],
            [
                15527,
                15632
            ],
            [
                15632,
                15800
            ],
            [
                15800,
                15840
            ],
            [
                15840,
                15906
            ],
            [
                15906,
                15963
            ],
            [
                15963,
                16016
            ],
            [
                16016,
                16038
            ],
            [
                16038,
                16083
            ],
            [
                16083,
                16155
            ],
            [
                16155,
                16192
            ],
            [
                16192,
                16222
            ],
            [
                16222,
                16257
            ],
            [
                16257,
                16262
            ],
            [
                16262,
                16290
            ],
            [
                16290,
                16313
            ],
            [
                16313,
                16368
            ],
            [
                16368,
                16519
            ],
            [
                16519,
                16560
            ],
            [
                16560,
                16712
            ],
            [
                16712,
                16825
            ],
            [
                16825,
                16892
            ],
            [
                16892,
                17025
            ],
            [
                17025,
                17070
            ],
            [
                17070,
                17113
            ],
            [
                17113,
                17146
            ],
            [
                17146,
                17186
            ],
            [
                17186,
                17214
            ],
            [
                17214,
                17246
            ],
            [
                17246,
                17296
            ],
            [
                17296,
                17331
            ],
            [
                17331,
                17365
            ],
            [
                17365,
                17414
            ],
            [
                17414,
                17450
            ],
            [
                17450,
                17469
            ],
            [
                17469,
                17483
            ],
            [
                17483,
                17551
            ],
            [
                17551,
                17603
            ],
            [
                17603,
                17684
            ],
            [
                17684,
                17779
            ],
            [
                17779,
                17846
            ],
            [
                17846,
                17893
            ],
            [
                17893,
                17939
            ],
            [
                17939,
                17965
            ],
            [
                17965,
                18004
            ],
            [
                18004,
                18040
            ],
            [
                18040,
                18090
            ],
            [
                18090,
                18156
            ],
            [
                18156,
                18314
            ],
            [
                18314,
                18371
            ],
            [
                18371,
                18437
            ],
            [
                18437,
                18459
            ],
            [
                18459,
                18574
            ],
            [
                18574,
                18664
            ],
            [
                18664,
                18793
            ],
            [
                18793,
                19054
            ],
            [
                19054,
                19098
            ],
            [
                19098,
                19188
            ],
            [
                19188,
                19337
            ],
            [
                19337,
                19459
            ],
            [
                19459,
                19687
            ],
            [
                19687,
                19733
            ],
            [
                19733,
                19764
            ],
            [
                19764,
                19781
            ],
            [
                19781,
                19798
            ],
            [
                19798,
                19808
            ],
            [
                19808,
                19932
            ],
            [
                19932,
                19988
            ],
            [
                19988,
                20059
            ],
            [
                20059,
                20089
            ],
            [
                20089,
                20105
            ],
            [
                20105,
                20172
            ]
        ]
    },
    "abridged": {
        "text": "The coming of Mrs. Greenow was a great comfort to Kate. Without her she would hardly have known how to talk to her uncle and brother. As it was, they were all restrained by the courtesy which strangers are bound to show each other, for George had not seen his aunt since he was a child.\n\"So you are George,\" said Mrs. Greenow, putting out her hand and smiling.\n\"Yes; I'm George,\" said he.\n\"And a Member of Parliament!\" said Mrs. Greenow. \"It's quite an honour to the family. I felt so proud when I heard it!\" She said this pleasantly, and then turned to her brother. \"Papa's time was fully come,\" she said, \"though, to tell the truth, I had no idea that he was so weak.\"\n\"Nor I,\" said John Vavasor. \"He went to church with us here on Christmas Day.\"\n\"Dear, dear! He seems at last to have gone off just like poor Greenow.\" She put her handkerchief up to her face. \"Ah, well! we can't keep everything in this life for ever.\"\nIt may, perhaps, be as well to explain that before she left Norwich, Mrs. Greenow had told Captain Bellfield that if he behaved himself well, there might possibly be hope. Whereupon Captain Bellfield had immediately gone to the best tailor in that city, had told the man of his coming marriage, and had given an extensive order. But the tailor had not yet supplied the goods, waiting for more credible evidence of the Captain's good fortune.\n\"We're all grass of the field,\" said Mrs. Greenow, lightly brushing a tear from her eye, \"and must be cut down in our turn.\" Her brother uttered a slight sympathetic groan, and then said that he would go out and look around the place.\nGeorge, in the meantime, had asked his sister to show him his room, and the two were already upstairs.\nKate had made up her mind to say nothing about Alice, if it could be avoided, till after the funeral. She led the way upstairs, almost trembling with fear, for she knew that the will would also cause trouble.\n\"What has brought that woman here?\" was the first question that George asked.\n\"I asked her to come,\" said Kate.\n\"And why did you ask her to come here?\" said George, angrily. Kate immediately felt that he was speaking as though he were master of the house, and also as though he intended to be master of her. She had no objection to the first idea. She wished that he might be the master. But she had already decided that she must not submit herself to his masterdom. She had gradually so taught herself since he had compelled her to write the first letter in which Alice had been asked for money.\n\"I asked her, George, before my poor grandfather's death, when I thought that he might linger for weeks. My life here alone with him, without any other woman in the house beside the servants, was very melancholy.\"\n\"Why did you not ask Alice to come to you?\"\n\"Alice could not have come,\" said Kate, after a short pause.\n\"I don't know why not. I won't have that woman about the place. She disgraced herself by marrying a blacksmith-.\"\n\"Why, George, you advised me to go and stay with her.\"\n\"That's a very different thing. Now that he's dead, and she's got his money, it's all very well that you should go to her occasionally; but I won't have her here.\"\n\"It's natural that she should come to her father's death-bed.\"\n\"I hate to be told that things are natural. It always means humbug. I don't suppose she cared for the old man any more than I did - or than she cared for the old man who married her. People are such intense hypocrites. There's my uncle John, pulling a long face; and yet for the last twenty years he has hated going to see his father. When are they going to bury him?\"\n\"On Saturday, the day after tomorrow.\"\n\"Why couldn't they do it tomorrow, so that we could get away before Sunday?\"\n\"He only died on Monday, George,\" said Kate solemnly.\n\"Psha! Who has got the will?\"\n\"Mr. Gogram. He was here yesterday, and told me to tell you and uncle John that he would have it with him when he came back from the funeral.\"\n\"What has my uncle John to do with it?\" said George, sharply. \"I shall go over to Penrith this afternoon and make Gogram give it up to me.\"\n\"I don't think he'll do that, George.\"\n\"What right has he to keep it? How do I know that he has really got the old man's last will? Where did my grandfather keep his papers?\"\n\"In that old secretary, as he used to call it, in the dining-room. It is sealed up.\"\n\"Who sealed it?\"\n\"Mr. Gogram did, and I assisted him.\"\n\"What the deuce made you meddle with it?\"\n\"I believe it is usual in such cases.\"\n\"Balderdash! You are thinking of some old trumpery of former days. Till I know to the contrary, everything here belongs to me as heir, and I do not mean to allow any interference till I know for certain that my rights have been taken from me. And I won't accept a death-bed will. What a man chooses to write when his fingers will hardly hold the pen goes for nothing.\"\n\"You can't suppose that I wish to interfere with your rights?\"\n\"I hope not.\"\n\"Oh, George!\"\n\"I know there are those who would. Do you think my uncle John would not interfere with me if he could? By ---! if he does, I'll drag him through the courts.\"\nA message was now brought up by the nurse, saying that Mrs. Greenow and Mr. Vavasor were going into the room where the old Squire was lying. \"Would Miss Kate and Mr. George go with them?\"\n\"Mr. Vavasor!\" shouted George, making the old woman jump. She did not understand his meaning.\n\"Yes, sir; the old Squire,\" she said.\n\"Will you come, George?\" Kate asked.\n\"No. Why should I pretend an interest in the dead body of a man whom I hated and whose very last act may have been an attempt to rob me?\"\nKate went, and was glad to get away from her brother. Every hour the idea was becoming stronger in her mind that she must somehow separate herself from him. There had come upon him of late a hard ferocity which made him unendurable. He allowed himself to be controlled by none of the ordinary bonds of society. She had felt this before, with a nervous consciousness that she was doing wrong in trying to bring about a marriage between him and Alice; but this manner had now grown so much that Kate began to feel thankful that Alice had been saved.\nWith her uncle and aunt, Kate saw the face of her grandfather for the last time.\n\"Poor, dear old man!\" said Mrs. Greenow, as the easy tears ran down her face. \"Do you remember, John, how he used to scold me, and say that I should never come to good. He has said the same thing to you, Kate, I dare say?\"\n\"He has been very kind to me,\" said Kate.\n\"He was a fine old gentleman,\" said John Vavasor. \"I don't know that he ever did an unjust or ungenerous act to anyone. Come, Kate, we may as well go down.\"\nGeorge did not go into Penrith, nor did he see Mr. Gogram till the attorney came to Vavasor Hall on the morning of the funeral. The two days before the funeral were very wretched for all, except, perhaps, Mrs. Greenow, who pretended not to understand that her nephew was in a bad humour. She called him \"poor George,\" and treated all his incivility as though it were the effect of grief.\nAt last the hour of the funeral came. There were the doctor and Gogram, and the uncle and the nephew, to follow the corpse - the nephew ostentatiously taking the foremost place.\n\"I'm told that you have got my grandfather's will,\" George said to the attorney as soon as he saw him.\n\"I have it in my pocket,\" said Mr. Gogram, \"and intend to read it after we return from church.\"\n\"Is it usual to take a will away from a man's house in that way?\" George asked.\n\"Quite usual,\" said the attorney; \"and in this case it was done at the express desire of the testator.\"\n\"I think it is the common practice,\" said John Vavasor.\nGeorge upon this turned round at his uncle as though about to attack him, showing his teeth.\nThe funeral was very plain, and George spoke not a word during the journey there and back. John Vavasor asked a few questions of the doctor about the last weeks of his father's life; and it was mentioned by both the doctor and the attorney that the old Squire's intellect had remained unimpaired up to the last moment.\nWhen they returned to the hall Mrs. Greenow met them; they all went to the dining-room, and drank a glass of sherry. George took two or three glasses. The doctor then left.\n\"Shall we go into the other room now?\" said the attorney.\nThe three gentlemen went across to the drawing-room, George leading the way. The attorney followed him, and John Vavasor closed the door behind them. If an observer had been watching, he might have seen by the faces of the two latter that they expected an unpleasant meeting.\nMr. Gogram held a document in his hand as he took a chair. John Vavasor stood behind one of the chairs which had been placed at the table, and leaned upon it, looking across the room. George stood on the rug before the fire, with his hands in his trouser pockets.\n\"Gentlemen, will you sit down?\" said Mr. Gogram. John Vavasor immediately sat down.\n\"I prefer to stand here,\" said George.\nMr. Gogram then opened the document.\n\"Before that paper is read,\" said George, \"I think it right to say a few words. I don't know what it contains, but I believe it to have been executed by my grandfather only an hour or two before his death.\"\n\"Early on the day before he died,\" said the attorney.\n\"Well, it is the same thing - while he was dying. He never got out of bed afterwards.\"\n\"He was not in bed at the time, Mr. Vavasor. Not that it would have mattered if he had been. And he came down to dinner on that day. I don't understand, however, why you make these observations.\"\n\"I make them because I deny my grandfather's fitness to make a will in the last moments of his existence, and at such an age. I saw him a few weeks ago, and he was not fit to be trusted with the management of property then.\"\n\"I do not think this is the time, George, to put forward such objections,\" said the uncle.\n\"I think it is,\" said George. \"I believe that paper purports to villainously defraud me. Therefore I protest against it, and shall question it at law. You can read it now, if you please.\"\n\"Oh, yes, I shall read it,\" said Mr. Gogram; \"and I say that it is as valid a will as ever a man signed.\"\n\"And I say it's not.\"\nThe will was read amidst angry interruptions from George, which it is not necessary to repeat. Nor need I trouble my readers with the will at length. It began by expressing the testator's great desire that his property might descend in his own family, and that the house might be inhabited by someone bearing the name of Vavasor.\nThe testator then declared that he felt himself obliged to pass over his natural heir, believing that the property would not be safe in his hands; he therefore left it in trust to his son John Vavasor, whom he appointed sole executor of his will. It would go to George's eldest son - should George ever marry and have a son - as soon as he might reach the age of twenty-five. In the meantime the property should remain in the hands of John Vavasor for his use and benefit, with five hundred a year out of it to be paid annually to his granddaughter Kate.\nIn the event of George having no son, the property was to go to the eldest son of Kate, or failing that to the eldest son of his other granddaughter who might take the name of Vavasor. All his personal effects he left to his son, John Vavasor.\n\"And, Mr. Vavasor,\" said the attorney, addressing John Vavasor as he finished his reading, \"you will, I fear, get very little by that last clause. The estate now owes nothing; but I doubt whether the Squire had fifty pounds in the bank when he died, and the value of the personal property about the place is very small. He was unwilling to spend anything during the last ten years, but paid off every shilling that the property owed.\"\n\"It is as I supposed,\" said George. His voice was very unpleasant, and so was the ghastly rage of his scarred face. \"The old man has tried to rob me of everything because I would not obey him in his wickedness when I was here with him a short while before he died. Such a will as that can stand nowhere.\"\n\"As to that I have nothing to say at present,\" said the attorney.\n\"Where is his other will - the one he made before that?\"\n\"If I remember rightly we executed two before this.\"\n\"And where are they?\"\n\"It is not my business to know, Mr. Vavasor. I believe that I saw him destroy one, but I have no absolute knowledge. As to the other, I can say nothing.\"\n\"And what do you mean to do?\" said George, turning to his uncle.\n\"Do! I shall carry out the will. I have no alternative. Your sister is the person chiefly interested under it. She gets five hundred a year for her life; and if she has a son and you don't, her son will have the whole property.\"\nGeorge stood for a few moments thinking. Might it not be possible that by means of Alice and Kate together - by marrying the former - he might still get hold of the property? But he wanted the property at once - he wanted the power of raising money upon it instantly. The will had been so framed as to make that impossible. Kate's share in it had not been left to her unconditionally, but was to be received through the hands of her uncle John. Such a will shut him out from all his hopes.\n\"It is a piece of d--- roguery,\" he said.\n\"What do you mean by that, sir?\" said Gogram.\n\"I mean exactly what I say. Who was in the room when that thing was written?\"\n\"The signature was witnessed by-\"\n\"I don't ask about the signature. Who was in the room when the thing was written?\"\n\"I was here with your grandfather.\"\n\"And no one else?\"\n\"No one else. The presence of anyone else at such a time would be very unusual.\"\n\"Then I regard the document simply as waste paper.\" With this, George Vavasor left the room, and slammed the door after him.\n\"I never was insulted in such a way before,\" said the attorney, almost with tears in his eyes.\n\"He is a disappointed and I fear a ruined man,\" said John Vavasor. \"I do not think you need regard what he says.\"\n\"But he should not insult me. I have only done my duty. I did not even advise his grandfather. It is mean and unmanly. If he comes in my way again I shall tell him so.\"\n\"He probably will not put himself in your way again, Mr. Gogram.\"\nThen the attorney left, having suggested to Mr. Vavasor that he should instruct his attorney in London to take steps towards proving the will. \"It's as good a will as ever was made,\" said Mr. Gogram.\nWho was to tell Kate? That was John Vavasor's first thought when he was alone. And how was he to get back to London without further quarrelling with his nephew? And what was he to do at once about his duties as executor?\nIt was by no means improbable, as he thought, that George might assume the position of master of the house; that he might demand the keys, for instance, which no doubt were in Kate's hands at present, and that he would take possession with violence. What should he do in such circumstances? It was clear that he could not run away and get back to his club. He had duties at the Hall which made him almost regret the position in which his father's will had placed him. Eventually he would gain some increase to his means, but the immediate effect would be terribly troublesome.\nIn the dining-room he found his sister alone.\n\"Well, John,\" said she. \"How is it left?\"\n\"Where is Kate?\"\n\"She has gone out to walk with her brother.\"\n\"Then I suppose he will tell her,\" said John Vavasor. He explained the circumstances of the will to Mrs. Greenow.\n\"Bravo,\" exclaimed the widow. \"I'm delighted. I love Kate dearly: and now she can marry almost whom she pleases.\"",
        "paragraph_chars": [
            [
                0,
                287
            ],
            [
                287,
                361
            ],
            [
                361,
                389
            ],
            [
                389,
                671
            ],
            [
                671,
                750
            ],
            [
                750,
                923
            ],
            [
                923,
                1365
            ],
            [
                1365,
                1600
            ],
            [
                1600,
                1703
            ],
            [
                1703,
                1912
            ],
            [
                1912,
                1990
            ],
            [
                1990,
                2024
            ],
            [
                2024,
                2509
            ],
            [
                2509,
                2723
            ],
            [
                2723,
                2767
            ],
            [
                2767,
                2828
            ],
            [
                2828,
                2942
            ],
            [
                2942,
                2997
            ],
            [
                2997,
                3161
            ],
            [
                3161,
                3224
            ],
            [
                3224,
                3593
            ],
            [
                3593,
                3632
            ],
            [
                3632,
                3709
            ],
            [
                3709,
                3763
            ],
            [
                3763,
                3793
            ],
            [
                3793,
                3936
            ],
            [
                3936,
                4076
            ],
            [
                4076,
                4115
            ],
            [
                4115,
                4251
            ],
            [
                4251,
                4336
            ],
            [
                4336,
                4353
            ],
            [
                4353,
                4391
            ],
            [
                4391,
                4433
            ],
            [
                4433,
                4472
            ],
            [
                4472,
                4841
            ],
            [
                4841,
                4904
            ],
            [
                4904,
                4918
            ],
            [
                4918,
                4932
            ],
            [
                4932,
                5090
            ],
            [
                5090,
                5278
            ],
            [
                5278,
                5372
            ],
            [
                5372,
                5410
            ],
            [
                5410,
                5447
            ],
            [
                5447,
                5585
            ],
            [
                5585,
                6133
            ],
            [
                6133,
                6214
            ],
            [
                6214,
                6437
            ],
            [
                6437,
                6479
            ],
            [
                6479,
                6636
            ],
            [
                6636,
                7024
            ],
            [
                7024,
                7202
            ],
            [
                7202,
                7305
            ],
            [
                7305,
                7401
            ],
            [
                7401,
                7481
            ],
            [
                7481,
                7585
            ],
            [
                7585,
                7641
            ],
            [
                7641,
                7734
            ],
            [
                7734,
                8053
            ],
            [
                8053,
                8226
            ],
            [
                8226,
                8284
            ],
            [
                8284,
                8560
            ],
            [
                8560,
                8824
            ],
            [
                8824,
                8908
            ],
            [
                8908,
                8947
            ],
            [
                8947,
                8984
            ],
            [
                8984,
                9191
            ],
            [
                9191,
                9245
            ],
            [
                9245,
                9332
            ],
            [
                9332,
                9528
            ],
            [
                9528,
                9753
            ],
            [
                9753,
                9844
            ],
            [
                9844,
                10032
            ],
            [
                10032,
                10138
            ],
            [
                10138,
                10160
            ],
            [
                10160,
                10490
            ],
            [
                10490,
                11045
            ],
            [
                11045,
                11289
            ],
            [
                11289,
                11724
            ],
            [
                11724,
                12029
            ],
            [
                12029,
                12095
            ],
            [
                12095,
                12152
            ],
            [
                12152,
                12205
            ],
            [
                12205,
                12227
            ],
            [
                12227,
                12381
            ],
            [
                12381,
                12446
            ],
            [
                12446,
                12675
            ],
            [
                12675,
                13165
            ],
            [
                13165,
                13207
            ],
            [
                13207,
                13253
            ],
            [
                13253,
                13331
            ],
            [
                13331,
                13365
            ],
            [
                13365,
                13448
            ],
            [
                13448,
                13484
            ],
            [
                13484,
                13503
            ],
            [
                13503,
                13584
            ],
            [
                13584,
                13709
            ],
            [
                13709,
                13804
            ],
            [
                13804,
                13918
            ],
            [
                13918,
                14087
            ],
            [
                14087,
                14153
            ],
            [
                14153,
                14353
            ],
            [
                14353,
                14574
            ],
            [
                14574,
                15151
            ],
            [
                15151,
                15197
            ],
            [
                15197,
                15239
            ],
            [
                15239,
                15256
            ],
            [
                15256,
                15301
            ],
            [
                15301,
                15415
            ],
            [
                15415,
                15528
            ]
        ],
        "segment_chars": [
            [
                0,
                56
            ],
            [
                56,
                134
            ],
            [
                134,
                287
            ],
            [
                287,
                361
            ],
            [
                361,
                389
            ],
            [
                389,
                419
            ],
            [
                419,
                438
            ],
            [
                438,
                475
            ],
            [
                475,
                509
            ],
            [
                509,
                567
            ],
            [
                567,
                671
            ],
            [
                671,
                699
            ],
            [
                699,
                750
            ],
            [
                750,
                763
            ],
            [
                763,
                822
            ],
            [
                822,
                863
            ],
            [
                863,
                874
            ],
            [
                874,
                923
            ],
            [
                923,
                1095
            ],
            [
                1095,
                1252
            ],
            [
                1252,
                1365
            ],
            [
                1365,
                1490
            ],
            [
                1490,
                1600
            ],
            [
                1600,
                1703
            ],
            [
                1703,
                1805
            ],
            [
                1805,
                1912
            ],
            [
                1912,
                1948
            ],
            [
                1948,
                1990
            ],
            [
                1990,
                2024
            ],
            [
                2024,
                2064
            ],
            [
                2064,
                2086
            ],
            [
                2086,
                2220
            ],
            [
                2220,
                2260
            ],
            [
                2260,
                2300
            ],
            [
                2300,
                2379
            ],
            [
                2379,
                2509
            ],
            [
                2509,
                2614
            ],
            [
                2614,
                2723
            ],
            [
                2723,
                2767
            ],
            [
                2767,
                2828
            ],
            [
                2828,
                2851
            ],
            [
                2851,
                2892
            ],
            [
                2892,
                2942
            ],
            [
                2942,
                2997
            ],
            [
                2997,
                3029
            ],
            [
                3029,
                3161
            ],
            [
                3161,
                3224
            ],
            [
                3224,
                3268
            ],
            [
                3268,
                3292
            ],
            [
                3292,
                3407
            ],
            [
                3407,
                3443
            ],
            [
                3443,
                3559
            ],
            [
                3559,
                3593
            ],
            [
                3593,
                3632
            ],
            [
                3632,
                3709
            ],
            [
                3709,
                3763
            ],
            [
                3763,
                3770
            ],
            [
                3770,
                3793
            ],
            [
                3793,
                3806
            ],
            [
                3806,
                3936
            ],
            [
                3936,
                3976
            ],
            [
                3976,
                3998
            ],
            [
                3998,
                4076
            ],
            [
                4076,
                4115
            ],
            [
                4115,
                4146
            ],
            [
                4146,
                4208
            ],
            [
                4208,
                4251
            ],
            [
                4251,
                4318
            ],
            [
                4318,
                4336
            ],
            [
                4336,
                4353
            ],
            [
                4353,
                4391
            ],
            [
                4391,
                4433
            ],
            [
                4433,
                4472
            ],
            [
                4472,
                4485
            ],
            [
                4485,
                4539
            ],
            [
                4539,
                4715
            ],
            [
                4715,
                4752
            ],
            [
                4752,
                4841
            ],
            [
                4841,
                4904
            ],
            [
                4904,
                4918
            ],
            [
                4918,
                4932
            ],
            [
                4932,
                4967
            ],
            [
                4967,
                5035
            ],
            [
                5035,
                5043
            ],
            [
                5043,
                5090
            ],
            [
                5090,
                5231
            ],
            [
                5231,
                5278
            ],
            [
                5278,
                5283
            ],
            [
                5283,
                5293
            ],
            [
                5293,
                5336
            ],
            [
                5336,
                5372
            ],
            [
                5372,
                5410
            ],
            [
                5410,
                5435
            ],
            [
                5435,
                5447
            ],
            [
                5447,
                5452
            ],
            [
                5452,
                5585
            ],
            [
                5585,
                5639
            ],
            [
                5639,
                5742
            ],
            [
                5742,
                5818
            ],
            [
                5818,
                5896
            ],
            [
                5896,
                6133
            ],
            [
                6133,
                6214
            ],
            [
                6214,
                6236
            ],
            [
                6236,
                6292
            ],
            [
                6292,
                6383
            ],
            [
                6383,
                6437
            ],
            [
                6437,
                6479
            ],
            [
                6479,
                6529
            ],
            [
                6529,
                6599
            ],
            [
                6599,
                6636
            ],
            [
                6636,
                6764
            ],
            [
                6764,
                6924
            ],
            [
                6924,
                7024
            ],
            [
                7024,
                7062
            ],
            [
                7062,
                7202
            ],
            [
                7202,
                7305
            ],
            [
                7305,
                7401
            ],
            [
                7401,
                7467
            ],
            [
                7467,
                7481
            ],
            [
                7481,
                7585
            ],
            [
                7585,
                7641
            ],
            [
                7641,
                7734
            ],
            [
                7734,
                7825
            ],
            [
                7825,
                8053
            ],
            [
                8053,
                8170
            ],
            [
                8170,
                8204
            ],
            [
                8204,
                8226
            ],
            [
                8226,
                8265
            ],
            [
                8265,
                8284
            ],
            [
                8284,
                8361
            ],
            [
                8361,
                8434
            ],
            [
                8434,
                8560
            ],
            [
                8560,
                8619
            ],
            [
                8619,
                8744
            ],
            [
                8744,
                8824
            ],
            [
                8824,
                8856
            ],
            [
                8856,
                8873
            ],
            [
                8873,
                8908
            ],
            [
                8908,
                8947
            ],
            [
                8947,
                8984
            ],
            [
                8984,
                9064
            ],
            [
                9064,
                9191
            ],
            [
                9191,
                9245
            ],
            [
                9245,
                9295
            ],
            [
                9295,
                9332
            ],
            [
                9332,
                9377
            ],
            [
                9377,
                9425
            ],
            [
                9425,
                9465
            ],
            [
                9465,
                9528
            ],
            [
                9528,
                9654
            ],
            [
                9654,
                9753
            ],
            [
                9753,
                9844
            ],
            [
                9844,
                9874
            ],
            [
                9874,
                9933
            ],
            [
                9933,
                9995
            ],
            [
                9995,
                10032
            ],
            [
                10032,
                10138
            ],
            [
                10138,
                10160
            ],
            [
                10160,
                10255
            ],
            [
                10255,
                10310
            ],
            [
                10310,
                10490
            ],
            [
                10490,
                10737
            ],
            [
                10737,
                10866
            ],
            [
                10866,
                11045
            ],
            [
                11045,
                11230
            ],
            [
                11230,
                11289
            ],
            [
                11289,
                11436
            ],
            [
                11436,
                11609
            ],
            [
                11609,
                11724
            ],
            [
                11724,
                11760
            ],
            [
                11760,
                11840
            ],
            [
                11840,
                11989
            ],
            [
                11989,
                12029
            ],
            [
                12029,
                12095
            ],
            [
                12095,
                12152
            ],
            [
                12152,
                12205
            ],
            [
                12205,
                12227
            ],
            [
                12227,
                12272
            ],
            [
                12272,
                12344
            ],
            [
                12344,
                12381
            ],
            [
                12381,
                12411
            ],
            [
                12411,
                12446
            ],
            [
                12446,
                12451
            ],
            [
                12451,
                12479
            ],
            [
                12479,
                12502
            ],
            [
                12502,
                12557
            ],
            [
                12557,
                12675
            ],
            [
                12675,
                12716
            ],
            [
                12716,
                12850
            ],
            [
                12850,
                12943
            ],
            [
                12943,
                12999
            ],
            [
                12999,
                13120
            ],
            [
                13120,
                13165
            ],
            [
                13165,
                13207
            ],
            [
                13207,
                13240
            ],
            [
                13240,
                13253
            ],
            [
                13253,
                13281
            ],
            [
                13281,
                13331
            ],
            [
                13331,
                13365
            ],
            [
                13365,
                13399
            ],
            [
                13399,
                13448
            ],
            [
                13448,
                13484
            ],
            [
                13484,
                13503
            ],
            [
                13503,
                13517
            ],
            [
                13517,
                13584
            ],
            [
                13584,
                13636
            ],
            [
                13636,
                13709
            ],
            [
                13709,
                13804
            ],
            [
                13804,
                13871
            ],
            [
                13871,
                13918
            ],
            [
                13918,
                13948
            ],
            [
                13948,
                13974
            ],
            [
                13974,
                14013
            ],
            [
                14013,
                14037
            ],
            [
                14037,
                14087
            ],
            [
                14087,
                14153
            ],
            [
                14153,
                14296
            ],
            [
                14296,
                14353
            ],
            [
                14353,
                14375
            ],
            [
                14375,
                14432
            ],
            [
                14432,
                14514
            ],
            [
                14514,
                14574
            ],
            [
                14574,
                14824
            ],
            [
                14824,
                14865
            ],
            [
                14865,
                14931
            ],
            [
                14931,
                15042
            ],
            [
                15042,
                15151
            ],
            [
                15151,
                15197
            ],
            [
                15197,
                15221
            ],
            [
                15221,
                15239
            ],
            [
                15239,
                15256
            ],
            [
                15256,
                15301
            ],
            [
                15301,
                15355
            ],
            [
                15355,
                15415
            ],
            [
                15415,
                15445
            ],
            [
                15445,
                15461
            ],
            [
                15461,
                15528
            ]
        ],
        "overlap_chars": [
            [
                0,
                26
            ],
            [
                27,
                56
            ],
            [
                56,
                102
            ],
            [
                111,
                124
            ],
            [
                125,
                134
            ],
            [
                134,
                172
            ],
            [
                173,
                219
            ],
            [
                220,
                230
            ],
            [
                230,
                231
            ],
            [
                236,
                246
            ],
            [
                251,
                285
            ],
            [
                285,
                287
            ],
            [
                287,
                361
            ],
            [
                361,
                389
            ],
            [
                389,
                419
            ],
            [
                419,
                438
            ],
            [
                438,
                475
            ],
            [
                475,
                509
            ],
            [
                509,
                534
            ],
            [
                535,
                550
            ],
            [
                551,
                567
            ],
            [
                567,
                668
            ],
            [
                668,
                671
            ],
            [
                671,
                677
            ],
            [
                677,
                699
            ],
            [
                699,
                743
            ],
            [
                744,
                750
            ],
            [
                751,
                763
            ],
            [
                763,
                822
            ],
            [
                822,
                863
            ],
            [
                864,
                874
            ],
            [
                874,
                922
            ],
            [
                923,
                961
            ],
            [
                962,
                966
            ],
            [
                967,
                991
            ],
            [
                992,
                1031
            ],
            [
                1032,
                1036
            ],
            [
                1037,
                1088
            ],
            [
                1089,
                1095
            ],
            [
                1095,
                1252
            ],
            [
                1252,
                1274
            ],
            [
                1275,
                1364
            ],
            [
                1365,
                1475
            ],
            [
                1476,
                1482
            ],
            [
                1487,
                1490
            ],
            [
                1490,
                1536
            ],
            [
                1536,
                1581
            ],
            [
                1589,
                1599
            ],
            [
                1600,
                1692
            ],
            [
                1701,
                1703
            ],
            [
                1703,
                1728
            ],
            [
                1732,
                1755
            ],
            [
                1755,
                1805
            ],
            [
                1805,
                1820
            ],
            [
                1829,
                1876
            ],
            [
                1877,
                1896
            ],
            [
                1903,
                1910
            ],
            [
                1910,
                1912
            ],
            [
                1912,
                1948
            ],
            [
                1948,
                1990
            ],
            [
                1990,
                2024
            ],
            [
                2024,
                2064
            ],
            [
                2064,
                2086
            ],
            [
                2086,
                2220
            ],
            [
                2220,
                2243
            ],
            [
                2244,
                2247
            ],
            [
                2254,
                2258
            ],
            [
                2258,
                2260
            ],
            [
                2260,
                2263
            ],
            [
                2264,
                2298
            ],
            [
                2298,
                2300
            ],
            [
                2300,
                2319
            ],
            [
                2328,
                2379
            ],
            [
                2379,
                2497
            ],
            [
                2502,
                2509
            ],
            [
                2509,
                2589
            ],
            [
                2596,
                2602
            ],
            [
                2603,
                2614
            ],
            [
                2614,
                2723
            ],
            [
                2723,
                2767
            ],
            [
                2767,
                2828
            ],
            [
                2828,
                2845
            ],
            [
                2849,
                2851
            ],
            [
                2851,
                2892
            ],
            [
                2892,
                2938
            ],
            [
                2939,
                2942
            ],
            [
                2942,
                2955
            ],
            [
                2956,
                2959
            ],
            [
                2960,
                2997
            ],
            [
                2997,
                3029
            ],
            [
                3029,
                3161
            ],
            [
                3161,
                3211
            ],
            [
                3212,
                3224
            ],
            [
                3224,
                3268
            ],
            [
                3268,
                3292
            ],
            [
                3292,
                3353
            ],
            [
                3356,
                3381
            ],
            [
                3382,
                3407
            ],
            [
                3407,
                3443
            ],
            [
                3443,
                3485
            ],
            [
                3485,
                3520
            ],
            [
                3521,
                3527
            ],
            [
                3528,
                3533
            ],
            [
                3534,
                3559
            ],
            [
                3559,
                3593
            ],
            [
                3593,
                3620
            ],
            [
                3629,
                3632
            ],
            [
                3632,
                3656
            ],
            [
                3665,
                3709
            ],
            [
                3709,
                3752
            ],
            [
                3753,
                3763
            ],
            [
                3763,
                3770
            ],
            [
                3770,
                3793
            ],
            [
                3793,
                3806
            ],
            [
                3806,
                3936
            ],
            [
                3936,
                3976
            ],
            [
                3976,
                3998
            ],
            [
                3998,
                4076
            ],
            [
                4076,
                4115
            ],
            [
                4115,
                4146
            ],
            [
                4146,
                4208
            ],
            [
                4208,
                4251
            ],
            [
                4251,
                4296
            ],
            [
                4298,
                4318
            ],
            [
                4318,
                4336
            ],
            [
                4336,
                4353
            ],
            [
                4353,
                4369
            ],
            [
                4370,
                4375
            ],
            [
                4388,
                4391
            ],
            [
                4391,
                4433
            ],
            [
                4434,
                4443
            ],
            [
                4444,
                4472
            ],
            [
                4472,
                4485
            ],
            [
                4485,
                4539
            ],
            [
                4539,
                4605
            ],
            [
                4605,
                4633
            ],
            [
                4634,
                4715
            ],
            [
                4715,
                4752
            ],
            [
                4752,
                4821
            ],
            [
                4822,
                4841
            ],
            [
                4841,
                4904
            ],
            [
                4904,
                4918
            ],
            [
                4918,
                4932
            ],
            [
                4933,
                4967
            ],
            [
                4967,
                5035
            ],
            [
                5035,
                5037
            ],
            [
                5041,
                5043
            ],
            [
                5043,
                5054
            ],
            [
                5055,
                5059
            ],
            [
                5065,
                5068
            ],
            [
                5069,
                5087
            ],
            [
                5087,
                5090
            ],
            [
                5090,
                5229
            ],
            [
                5231,
                5278
            ],
            [
                5278,
                5283
            ],
            [
                5283,
                5293
            ],
            [
                5293,
                5300
            ],
            [
                5301,
                5336
            ],
            [
                5336,
                5370
            ],
            [
                5370,
                5371
            ],
            [
                5372,
                5410
            ],
            [
                5410,
                5435
            ],
            [
                5435,
                5447
            ],
            [
                5447,
                5450
            ],
            [
                5452,
                5527
            ],
            [
                5528,
                5547
            ],
            [
                5562,
                5582
            ],
            [
                5585,
                5608
            ],
            [
                5616,
                5639
            ],
            [
                5639,
                5706
            ],
            [
                5715,
                5742
            ],
            [
                5742,
                5818
            ],
            [
                5818,
                5896
            ],
            [
                5896,
                5913
            ],
            [
                5920,
                5978
            ],
            [
                5986,
                6043
            ],
            [
                6051,
                6058
            ],
            [
                6059,
                6064
            ],
            [
                6065,
                6067
            ],
            [
                6073,
                6096
            ],
            [
                6097,
                6133
            ],
            [
                6133,
                6157
            ],
            [
                6158,
                6162
            ],
            [
                6163,
                6213
            ],
            [
                6214,
                6236
            ],
            [
                6236,
                6292
            ],
            [
                6292,
                6383
            ],
            [
                6383,
                6437
            ],
            [
                6437,
                6477
            ],
            [
                6477,
                6478
            ],
            [
                6479,
                6527
            ],
            [
                6527,
                6529
            ],
            [
                6530,
                6590
            ],
            [
                6597,
                6599
            ],
            [
                6599,
                6635
            ],
            [
                6636,
                6698
            ],
            [
                6703,
                6716
            ],
            [
                6717,
                6764
            ],
            [
                6764,
                6822
            ],
            [
                6822,
                6840
            ],
            [
                6841,
                6858
            ],
            [
                6869,
                6924
            ],
            [
                6924,
                6984
            ],
            [
                6985,
                7016
            ],
            [
                7017,
                7023
            ],
            [
                7024,
                7031
            ],
            [
                7032,
                7062
            ],
            [
                7062,
                7067
            ],
            [
                7073,
                7146
            ],
            [
                7149,
                7159
            ],
            [
                7160,
                7174
            ],
            [
                7175,
                7181
            ],
            [
                7182,
                7200
            ],
            [
                7200,
                7201
            ],
            [
                7202,
                7305
            ],
            [
                7305,
                7352
            ],
            [
                7360,
                7370
            ],
            [
                7377,
                7401
            ],
            [
                7401,
                7467
            ],
            [
                7467,
                7481
            ],
            [
                7481,
                7585
            ],
            [
                7585,
                7641
            ],
            [
                7641,
                7714
            ],
            [
                7723,
                7734
            ],
            [
                7734,
                7765
            ],
            [
                7766,
                7772
            ],
            [
                7779,
                7789
            ],
            [
                7790,
                7825
            ],
            [
                7825,
                7873
            ],
            [
                7880,
                7927
            ],
            [
                7928,
                7937
            ],
            [
                7938,
                7940
            ],
            [
                7941,
                7945
            ],
            [
                7946,
                7960
            ],
            [
                7961,
                7973
            ],
            [
                7974,
                8051
            ],
            [
                8051,
                8052
            ],
            [
                8053,
                8105
            ],
            [
                8107,
                8150
            ],
            [
                8151,
                8170
            ],
            [
                8170,
                8204
            ],
            [
                8204,
                8219
            ],
            [
                8224,
                8226
            ],
            [
                8226,
                8265
            ],
            [
                8265,
                8284
            ],
            [
                8284,
                8303
            ],
            [
                8304,
                8361
            ],
            [
                8361,
                8434
            ],
            [
                8440,
                8448
            ],
            [
                8449,
                8452
            ],
            [
                8453,
                8457
            ],
            [
                8468,
                8559
            ],
            [
                8560,
                8570
            ],
            [
                8571,
                8575
            ],
            [
                8576,
                8586
            ],
            [
                8587,
                8619
            ],
            [
                8619,
                8742
            ],
            [
                8742,
                8744
            ],
            [
                8744,
                8802
            ],
            [
                8803,
                8806
            ],
            [
                8815,
                8822
            ],
            [
                8822,
                8824
            ],
            [
                8824,
                8856
            ],
            [
                8856,
                8872
            ],
            [
                8873,
                8908
            ],
            [
                8908,
                8947
            ],
            [
                8947,
                8982
            ],
            [
                8982,
                8984
            ],
            [
                8984,
                9064
            ],
            [
                9064,
                9191
            ],
            [
                9191,
                9192
            ],
            [
                9192,
                9197
            ],
            [
                9198,
                9223
            ],
            [
                9223,
                9245
            ],
            [
                9245,
                9251
            ],
            [
                9252,
                9272
            ],
            [
                9275,
                9293
            ],
            [
                9293,
                9295
            ],
            [
                9295,
                9332
            ],
            [
                9332,
                9377
            ],
            [
                9377,
                9425
            ],
            [
                9425,
                9465
            ],
            [
                9465,
                9528
            ],
            [
                9529,
                9654
            ],
            [
                9654,
                9753
            ],
            [
                9753,
                9844
            ],
            [
                9844,
                9874
            ],
            [
                9874,
                9884
            ],
            [
                9885,
                9907
            ],
            [
                9915,
                9924
            ],
            [
                9931,
                9933
            ],
            [
                9933,
                9963
            ],
            [
                9963,
                9993
            ],
            [
                9993,
                9995
            ],
            [
                9995,
                10032
            ],
            [
                10032,
                10054
            ],
            [
                10057,
                10138
            ],
            [
                10138,
                10157
            ],
            [
                10160,
                10184
            ],
            [
                10200,
                10204
            ],
            [
                10205,
                10255
            ],
            [
                10255,
                10310
            ],
            [
                10310,
                10439
            ],
            [
                10440,
                10452
            ],
            [
                10461,
                10489
            ],
            [
                10503,
                10709
            ],
            [
                10710,
                10737
            ],
            [
                10737,
                10739
            ],
            [
                10749,
                10771
            ],
            [
                10774,
                10813
            ],
            [
                10816,
                10866
            ],
            [
                10866,
                10967
            ],
            [
                10968,
                10987
            ],
            [
                10992,
                10994
            ],
            [
                10995,
                10997
            ],
            [
                10998,
                11044
            ],
            [
                11045,
                11230
            ],
            [
                11230,
                11246
            ],
            [
                11255,
                11288
            ],
            [
                11289,
                11327
            ],
            [
                11352,
                11422
            ],
            [
                11428,
                11436
            ],
            [
                11436,
                11515
            ],
            [
                11525,
                11559
            ],
            [
                11569,
                11609
            ],
            [
                11609,
                11611
            ],
            [
                11616,
                11674
            ],
            [
                11675,
                11724
            ],
            [
                11724,
                11760
            ],
            [
                11760,
                11801
            ],
            [
                11802,
                11840
            ],
            [
                11840,
                11856
            ],
            [
                11863,
                11989
            ],
            [
                11989,
                12029
            ],
            [
                12029,
                12095
            ],
            [
                12095,
                12119
            ],
            [
                12122,
                12152
            ],
            [
                12152,
                12205
            ],
            [
                12205,
                12227
            ],
            [
                12227,
                12272
            ],
            [
                12272,
                12344
            ],
            [
                12344,
                12381
            ],
            [
                12381,
                12411
            ],
            [
                12411,
                12446
            ],
            [
                12446,
                12451
            ],
            [
                12451,
                12479
            ],
            [
                12479,
                12502
            ],
            [
                12502,
                12557
            ],
            [
                12557,
                12603
            ],
            [
                12604,
                12675
            ],
            [
                12675,
                12716
            ],
            [
                12716,
                12781
            ],
            [
                12784,
                12806
            ],
            [
                12809,
                12823
            ],
            [
                12833,
                12850
            ],
            [
                12850,
                12853
            ],
            [
                12854,
                12863
            ],
            [
                12864,
                12884
            ],
            [
                12897,
                12943
            ],
            [
                12943,
                12997
            ],
            [
                12997,
                12999
            ],
            [
                12999,
                13082
            ],
            [
                13083,
                13120
            ],
            [
                13120,
                13164
            ],
            [
                13165,
                13184
            ],
            [
                13188,
                13207
            ],
            [
                13207,
                13240
            ],
            [
                13240,
                13251
            ],
            [
                13251,
                13253
            ],
            [
                13253,
                13281
            ],
            [
                13281,
                13331
            ],
            [
                13331,
                13362
            ],
            [
                13365,
                13377
            ],
            [
                13384,
                13399
            ],
            [
                13399,
                13448
            ],
            [
                13448,
                13484
            ],
            [
                13484,
                13503
            ],
            [
                13503,
                13517
            ],
            [
                13517,
                13532
            ],
            [
                13540,
                13584
            ],
            [
                13584,
                13636
            ],
            [
                13641,
                13709
            ],
            [
                13709,
                13804
            ],
            [
                13804,
                13871
            ],
            [
                13871,
                13918
            ],
            [
                13918,
                13936
            ],
            [
                13937,
                13948
            ],
            [
                13948,
                13974
            ],
            [
                13974,
                14013
            ],
            [
                14013,
                14023
            ],
            [
                14024,
                14037
            ],
            [
                14037,
                14087
            ],
            [
                14087,
                14153
            ],
            [
                14153,
                14170
            ],
            [
                14175,
                14269
            ],
            [
                14278,
                14285
            ],
            [
                14286,
                14296
            ],
            [
                14296,
                14352
            ],
            [
                14353,
                14375
            ],
            [
                14375,
                14424
            ],
            [
                14425,
                14430
            ],
            [
                14430,
                14432
            ],
            [
                14432,
                14453
            ],
            [
                14454,
                14514
            ],
            [
                14514,
                14543
            ],
            [
                14554,
                14560
            ],
            [
                14561,
                14573
            ],
            [
                14574,
                14644
            ],
            [
                14645,
                14824
            ],
            [
                14824,
                14841
            ],
            [
                14845,
                14865
            ],
            [
                14865,
                14929
            ],
            [
                14929,
                14931
            ],
            [
                14931,
                14944
            ],
            [
                14945,
                14956
            ],
            [
                14968,
                15042
            ],
            [
                15042,
                15071
            ],
            [
                15072,
                15150
            ],
            [
                15151,
                15196
            ],
            [
                15197,
                15219
            ],
            [
                15222,
                15239
            ],
            [
                15239,
                15255
            ],
            [
                15256,
                15273
            ],
            [
                15274,
                15281
            ],
            [
                15282,
                15301
            ],
            [
                15301,
                15306
            ],
            [
                15307,
                15316
            ],
            [
                15317,
                15355
            ],
            [
                15355,
                15414
            ],
            [
                15415,
                15445
            ],
            [
                15445,
                15461
            ],
            [
                15461,
                15528
            ]
        ],
        "row_chars": [
            [
                0,
                56
            ],
            [
                56,
                134
            ],
            [
                134,
                287
            ],
            [
                287,
                361
            ],
            [
                361,
                389
            ],
            [
                389,
                419
            ],
            [
                419,
                438
            ],
            [
                438,
                475
            ],
            [
                475,
                509
            ],
            [
                509,
                567
            ],
            [
                567,
                671
            ],
            [
                671,
                699
            ],
            [
                699,
                750
            ],
            [
                750,
                750
            ],
            [
                750,
                763
            ],
            [
                763,
                822
            ],
            [
                822,
                863
            ],
            [
                863,
                863
            ],
            [
                863,
                863
            ],
            [
                863,
                863
            ],
            [
                863,
                863
            ],
            [
                863,
                863
            ],
            [
                863,
                863
            ],
            [
                863,
                863
            ],
            [
                863,
                863
            ],
            [
                863,
                874
            ],
            [
                874,
                923
            ],
            [
                923,
                1095
            ],
            [
                1095,
                1252
            ],
            [
                1252,
                1365
            ],
            [
                1365,
                1490
            ],
            [
                1490,
                1600
            ],
            [
                1600,
                1703
            ],
            [
                1703,
                1805
            ],
            [
                1805,
                1912
            ],
            [
                1912,
                1948
            ],
            [
                1948,
                1990
            ],
            [
                1990,
                2024
            ],
            [
                2024,
                2064
            ],
            [
                2064,
                2086
            ],
            [
                2086,
                2220
            ],
            [
                2220,
                2260
            ],
            [
                2260,
                2300
            ],
            [
                2300,
                2379
            ],
            [
                2379,
                2509
            ],
            [
                2509,
                2614
            ],
            [
                2614,
                2723
            ],
            [
                2723,
                2767
            ],
            [
                2767,
                2828
            ],
            [
                2828,
                2851
            ],
            [
                2851,
                2892
            ],
            [
                2892,
                2942
            ],
            [
                2942,
                2997
            ],
            [
                2997,
                3029
            ],
            [
                3029,
                3161
            ],
            [
                3161,
                3224
            ],
            [
                3224,
                3268
            ],
            [
                3268,
                3292
            ],
            [
                3292,
                3407
            ],
            [
                3407,
                3443
            ],
            [
                3443,
                3559
            ],
            [
                3559,
                3593
            ],
            [
                3593,
                3632
            ],
            [
                3632,
                3709
            ],
            [
                3709,
                3763
            ],
            [
                3763,
                3770
            ],
            [
                3770,
                3793
            ],
            [
                3793,
                3806
            ],
            [
                3806,
                3936
            ],
            [
                3936,
                3976
            ],
            [
                3976,
                3998
            ],
            [
                3998,
                4076
            ],
            [
                4076,
                4115
            ],
            [
                4115,
                4146
            ],
            [
                4146,
                4146
            ],
            [
                4146,
                4208
            ],
            [
                4208,
                4251
            ],
            [
                4251,
                4318
            ],
            [
                4318,
                4336
            ],
            [
                4336,
                4353
            ],
            [
                4353,
                4391
            ],
            [
                4391,
                4433
            ],
            [
                4433,
                4433
            ],
            [
                4433,
                4472
            ],
            [
                4472,
                4485
            ],
            [
                4485,
                4539
            ],
            [
                4539,
                4715
            ],
            [
                4715,
                4752
            ],
            [
                4752,
                4841
            ],
            [
                4841,
                4904
            ],
            [
                4904,
                4918
            ],
            [
                4918,
                4932
            ],
            [
                4932,
                4932
            ],
            [
                4932,
                4967
            ],
            [
                4967,
                5035
            ],
            [
                5035,
                5043
            ],
            [
                5043,
                5090
            ],
            [
                5090,
                5278
            ],
            [
                5278,
                5283
            ],
            [
                5283,
                5293
            ],
            [
                5293,
                5336
            ],
            [
                5336,
                5372
            ],
            [
                5372,
                5410
            ],
            [
                5410,
                5435
            ],
            [
                5435,
                5447
            ],
            [
                5447,
                5452
            ],
            [
                5452,
                5585
            ],
            [
                5585,
                5585
            ],
            [
                5585,
                5639
            ],
            [
                5639,
                5742
            ],
            [
                5742,
                5818
            ],
            [
                5818,
                5896
            ],
            [
                5896,
                6133
            ],
            [
                6133,
                6214
            ],
            [
                6214,
                6236
            ],
            [
                6236,
                6292
            ],
            [
                6292,
                6383
            ],
            [
                6383,
                6437
            ],
            [
                6437,
                6479
            ],
            [
                6479,
                6479
            ],
            [
                6479,
                6529
            ],
            [
                6529,
                6599
            ],
            [
                6599,
                6636
            ],
            [
                6636,
                6636
            ],
            [
                6636,
                6764
            ],
            [
                6764,
                6764
            ],
            [
                6764,
                6924
            ],
            [
                6924,
                7024
            ],
            [
                7024,
                7024
            ],
            [
                7024,
                7062
            ],
            [
                7062,
                7202
            ],
            [
                7202,
                7202
            ],
            [
                7202,
                7202
            ],
            [
                7202,
                7305
            ],
            [
                7305,
                7401
            ],
            [
                7401,
                7467
            ],
            [
                7467,
                7481
            ],
            [
                7481,
                7585
            ],
            [
                7585,
                7641
            ],
            [
                7641,
                7734
            ],
            [
                7734,
                7825
            ],
            [
                7825,
                8053
            ],
            [
                8053,
                8170
            ],
            [
                8170,
                8204
            ],
            [
                8204,
                8226
            ],
            [
                8226,
                8265
            ],
            [
                8265,
                8284
            ],
            [
                8284,
                8361
            ],
            [
                8361,
                8434
            ],
            [
                8434,
                8560
            ],
            [
                8560,
                8619
            ],
            [
                8619,
                8744
            ],
            [
                8744,
                8824
            ],
            [
                8824,
                8856
            ],
            [
                8856,
                8873
            ],
            [
                8873,
                8908
            ],
            [
                8908,
                8947
            ],
            [
                8947,
                8984
            ],
            [
                8984,
                9064
            ],
            [
                9064,
                9191
            ],
            [
                9191,
                9245
            ],
            [
                9245,
                9295
            ],
            [
                9295,
                9332
            ],
            [
                9332,
                9377
            ],
            [
                9377,
                9425
            ],
            [
                9425,
                9465
            ],
            [
                9465,
                9528
            ],
            [
                9528,
                9528
            ],
            [
                9528,
                9654
            ],
            [
                9654,
                9753
            ],
            [
                9753,
                9844
            ],
            [
                9844,
                9874
            ],
            [
                9874,
                9933
            ],
            [
                9933,
                9995
            ],
            [
                9995,
                10032
            ],
            [
                10032,
                10138
            ],
            [
                10138,
                10160
            ],
            [
                10160,
                10160
            ],
            [
                10160,
                10255
            ],
            [
                10255,
                10310
            ],
            [
                10310,
                10490
            ],
            [
                10490,
                10737
            ],
            [
                10737,
                10866
            ],
            [
                10866,
                11045
            ],
            [
                11045,
                11230
            ],
            [
                11230,
                11289
            ],
            [
                11289,
                11436
            ],
            [
                11436,
                11609
            ],
            [
                11609,
                11724
            ],
            [
                11724,
                11760
            ],
            [
                11760,
                11840
            ],
            [
                11840,
                11989
            ],
            [
                11989,
                12029
            ],
            [
                12029,
                12095
            ],
            [
                12095,
                12152
            ],
            [
                12152,
                12205
            ],
            [
                12205,
                12227
            ],
            [
                12227,
                12272
            ],
            [
                12272,
                12344
            ],
            [
                12344,
                12381
            ],
            [
                12381,
                12411
            ],
            [
                12411,
                12446
            ],
            [
                12446,
                12451
            ],
            [
                12451,
                12479
            ],
            [
                12479,
                12502
            ],
            [
                12502,
                12557
            ],
            [
                12557,
                12675
            ],
            [
                12675,
                12716
            ],
            [
                12716,
                12850
            ],
            [
                12850,
                12943
            ],
            [
                12943,
                12999
            ],
            [
                12999,
                13120
            ],
            [
                13120,
                13165
            ],
            [
                13165,
                13207
            ],
            [
                13207,
                13240
            ],
            [
                13240,
                13253
            ],
            [
                13253,
                13281
            ],
            [
                13281,
                13281
            ],
            [
                13281,
                13331
            ],
            [
                13331,
                13365
            ],
            [
                13365,
                13399
            ],
            [
                13399,
                13448
            ],
            [
                13448,
                13484
            ],
            [
                13484,
                13503
            ],
            [
                13503,
                13517
            ],
            [
                13517,
                13584
            ],
            [
                13584,
                13636
            ],
            [
                13636,
                13709
            ],
            [
                13709,
                13804
            ],
            [
                13804,
                13871
            ],
            [
                13871,
                13918
            ],
            [
                13918,
                13948
            ],
            [
                13948,
                13974
            ],
            [
                13974,
                14013
            ],
            [
                14013,
                14037
            ],
            [
                14037,
                14087
            ],
            [
                14087,
                14153
            ],
            [
                14153,
                14296
            ],
            [
                14296,
                14353
            ],
            [
                14353,
                14353
            ],
            [
                14353,
                14375
            ],
            [
                14375,
                14432
            ],
            [
                14432,
                14514
            ],
            [
                14514,
                14574
            ],
            [
                14574,
                14824
            ],
            [
                14824,
                14865
            ],
            [
                14865,
                14931
            ],
            [
                14931,
                15042
            ],
            [
                15042,
                15151
            ],
            [
                15151,
                15151
            ],
            [
                15151,
                15197
            ],
            [
                15197,
                15221
            ],
            [
                15221,
                15239
            ],
            [
                15239,
                15256
            ],
            [
                15256,
                15256
            ],
            [
                15256,
                15301
            ],
            [
                15301,
                15355
            ],
            [
                15355,
                15415
            ],
            [
                15415,
                15445
            ],
            [
                15445,
                15461
            ],
            [
                15461,
                15528
            ]
        ]
    }
}