{
    "original": {
        "text": "About eleven o'clock on that night,--the night of the day on which Kate Vavasor's arm had been broken,--there came a gentle knock at Kate's bedroom door. There was nothing surprising in this, as of all the household Kate only was in bed. Her aunt was sitting at this time by her bedside, and the doctor, who had been summoned from Penrith and who had set her broken arm, was still in the house, talking over the accident with John Vavasor in the dining-room, before he proceeded back on his journey home.\n\"She will do very well,\" said the doctor. \"It's only a simple fracture. I'll see her the day after to-morrow.\"\n\"Is it not odd that such an accident should come from a fall whilst walking?\" asked Mr. Vavasor.\nThe doctor shrugged his shoulders. \"One never can say how anything may occur,\" said he. \"I know a young woman who broke the os femoris by just kicking her cat;--at least, she said she did.\"\n\"Indeed! I suppose you didn't take any trouble to inquire?\"\n\"Not much. My business was with the injury, not with the way she got it. Somebody did make inquiry, but she stuck to her story and nothing came of it. Good night, Mr. Vavasor. Don't trouble her with questions till she has had some hours' sleep, at any rate.\" Then the doctor went, and John Vavasor was left alone, standing with his back to the dining-room fire.\nThere had been so much trouble and confusion in the house since Kate had fainted, almost immediately upon her reaching home, that Mr. Vavasor had not yet had time to make up his mind as to the nature of the accident which had occurred. Mrs. Greenow had at once ascertained that the bone was broken, and the doctor had been sent for. Luckily he had been found at home, and had reached the Hall a little before ten o'clock. In the meantime, as soon as Kate recovered her senses, she volunteered her account of what had occurred.\nHer brother had quarrelled with her about the will, she said, and had left her abruptly on the mountain. She had fallen, she went on to say, as she turned from him, and had at once found that she had hurt herself. But she had been too angry with him to let him know it; and, indeed, she had not known the extent herself till he had passed out of her sight. This was her story; and there was nothing in it that was false by the letter, though there was much that was false in the spirit. It was certainly true that George had not known that she was injured. It was true that she had asked him for no help. It was true, in one sense, that she had fallen, and it was true that she had not herself known how severe had been the injury done to her till he had gone beyond the reach of her voice. But she repressed all mention of his violence, and when she was pressed as to the nature of the quarrel, she declined to speak further on that matter.\nNeither her uncle nor her aunt believed her. That was a matter of course, and she knew that they did not believe her. George's absence, their recent experience of his moods, and the violence by which her arm must have been broken, made them certain that Kate had more to tell if she chose to tell it. But in her present condition they could not question her. Mrs. Greenow did ask as to the probability of her nephew's return.\n\"I can only tell you,\" said Kate, \"that he went away across the Fell in the direction of Bampton. Perhaps he has gone on to Penrith. He was very angry with us all; and as the house is not his own, he has probably resolved that he will not stay another night under the roof. But, who can say? He is not in his senses when he is angered.\"\nJohn Vavasor, as he stood alone after the doctor's departure, endeavoured to ascertain the truth by thinking of it. \"I am sure,\" he said to himself, \"that the doctor suspects that there has been violence. I know it from his tone, and I can see it in his eye. But how to prove it? and would there be good in proving it? Poor girl! Will it not be better for her to let it pass as though we believed her story?\" He made up his mind that it would be better. Why should he take upon himself the terrible task of calling this insane relation to account for an act which he could not prove? The will itself, without that trouble, would give him trouble enough. Then he began to long that he was back at his club, and to think that the signing-room in Chancery Lane was not so bad. And so he went up to his bed, calling at Kate's door to ask after the patient.\nIn the meantime there had come a messenger to Mrs. Greenow, who had stationed herself with her niece. One of the girls of the house brought up a scrap of paper to the door, saying that a boy had brought it over with a cart from Shap, and that it was intended for Miss Vavasor, and it was she who knocked at the sickroom door. The note was open and was not addressed; indeed, the words were written on a scrap of paper that was crumpled up rather than folded, and were as follows: \"Send me my clothes by the bearer. I shall not return to the house.\" Mrs. Greenow took it in to Kate, and then went away to see her nephew's things duly put into his portmanteau. This was sent away in the cart, and Mr. Vavasor, as he went up-stairs, was told what had been done.\nNeither on that night or on the following day did Mrs. Greenow ask any further questions; but on the morning after that, when the doctor had left them with a good account of the broken limb, her curiosity would brook no further delay. And, indeed, indignation as well as curiosity urged her on. In disposition she was less easy, and, perhaps, less selfish, than her brother. If it were the case that that man had ill-treated his sister, she would have sacrificed much to bring him to punishment. \"Kate,\" she said, when the doctor was gone, \"I expect that you will tell me the whole truth as to what occurred between you and your brother when you had this accident.\"\n\"I have told you the truth.\"\n\"But not the whole truth.\"\n\"All the truth I mean to tell, aunt. He has quarrelled with me, as I think, most unnecessarily, but you don't suppose that I am going to give an exact account of the quarrel? We were both wrong, probably, and so let there be an end of it.\"\n\"Was he violent to you when he quarrelled with you?\"\n\"When he is angry he is always violent in his language.\"\n\"But, did he strike you?\"\n\"Dear aunt, don't be angry with me if I say that I won't be cross-examined. I would rather answer no more questions about it. I know that questioning can do no good.\"\nMrs. Greenow knew her niece well enough to be aware that nothing more would be told her, but she was quite sure now that Kate had not broken her arm by a simple fall. She was certain that the injury had come from positive violence. Had it not been so, Kate would not have contented herself with refusing to answer the last question that had been asked, but would also have repelled the charge made against her brother with indignation.\n\"You must have it your own way,\" said Mrs. Greenow; \"but let me just tell you this, that your brother George had better keep out of my way.\"\n\"It is probable that he will,\" said Kate. \"Especially if you remain here to nurse me.\"\nKate's conduct in answering all the questions made to her was not difficult, but she found that there was much difficulty in planning her own future behaviour towards her own brother. Must she abandon him altogether from henceforth; divide herself from him, as it were; have perfectly separate interests, and interests that were indeed hostile? and must she see him ruined and overwhelmed by want of money, while she had been made a rich woman by her grandfather's will? It will be remembered that her life had hitherto been devoted to him; that all her schemes and plans had had his success as their object; that she had taught herself to consider it to be her duty to sacrifice everything to his welfare. It is very sad to abandon the only object of a life! It is very hard to tear out from one's heart and fling away from it the only love that one has cherished! What was she to say to Alice about all this--to Alice whom she had cheated of a husband worthy of her, that she might allure her into the arms of one so utterly unworthy? Luckily for Kate, her accident was of such a nature that any writing to Alice was now out of the question.\nBut a blow! What woman can bear a blow from a man, and afterwards return to him with love? A wife may have to bear it and to return. And she may return with that sort of love which is a thing of custom. The man is the father of her children, and earns the bread which they eat and which she eats. Habit and the ways of the world require that she should be careful in his interests, and that she should live with him in what amity is possible to them. But as for love,--all that we mean by love when we speak of it and write of it,--a blow given by the defender to the defenceless crushes it all! A woman may forgive deceit, treachery, desertion,--even the preference given to a rival. She may forgive them and forget them; but I do not think that a woman can forget a blow. And as for forgiveness,--it is not the blow that she cannot forgive, but the meanness of spirit that made it possible.\nKate, as she thought of it, told herself that everything in life was over for her. She had long feared her brother's nature,--had feared that he was hard and heartless; but still there had been some hope with her fear. Success, if he could be made to achieve it, would soften him, and then all might be right. But now all was wrong, and she knew that it was so. When he had compelled her to write to Alice for money, her faith in him had almost succumbed. That had been very mean, and the meanness had shocked her. But now he had asked her to perjure herself that he might have his own way, and had threatened to murder her, and had raised his hand against her because she had refused to obey him. And he had accused her of treachery to himself,--had accused her of premeditated deceit in obtaining this property for herself!\n\"But he does not believe it,\" said Kate to herself. \"He said that because he thought it would vex me; but I know he does not think it.\" Kate had watched her brother longing for money all his life,--had thoroughly understood the intensity of his wish for it,--the agony of his desire. But so far removed was she from any such longing on her own account, that she could not believe that her brother would in his heart accuse her of it. How often had she offered to give him, on the instant, every shilling that she had in the world! At this moment she resolved, in her mind, that she never wished to see him more; but even now, had it been practicable, she would have made over to him, without any drawback, all her interest in the Vavasor estate.\nBut any such making over was impossible. John Vavasor remained in Westmoreland for a week, and during that time many discussions were, of course, held about the property. Mr. Round came down from London, and met Mr. Gogram at Penrith. As to the validity of the will Mr. Round said that there was no shadow of a doubt. So an agent was appointed for receiving the rents, and it was agreed that the old Hall should be let in six months from that date. In the meantime Kate was to remain there till her arm should become strong, and she could make her plans for the future. Aunt Greenow promised to remain at the Hall for the present, and offered, indeed, indefinite services for the future, as though she were quite forgetful of Captain Bellfield. Of Mr. Cheesacre she was not forgetful, for she still continued to speak of that gentleman to Kate, as though he were Kate's suitor. But she did not now press upon her niece the acceptance of Mr. Cheesacre's hand as an absolute duty. Kate was mistress of a considerable fortune, and though such a marriage might be comfortable, it was no longer necessary. Mrs. Greenow called him poor Cheesacre, pointing out how easily he might be managed, and how indubitable were his possessions; but she no longer spoke of Kate's chances in the marriage market as desperate, even though she should decline the Cheesacre alliance.\n\"A young woman, with six hundred a year, my dear, may do pretty nearly what she pleases,\" said aunt Greenow. \"It's better than having ten years' grace given you.\"\n\"And will last longer, certainly,\" said Kate.\nKate's desire was that Alice should come down to her for a while in Westmoreland, before the six months were over, and this desire she mentioned to her uncle. He promised to carry the message up to Alice, but could not be got to say more than that upon the subject. Then Mr. Vavasor went away, leaving the aunt and niece together at the Hall.\n\"What on earth shall we do if that wild beast shows himself suddenly among us women?\" asked Mrs. Greenow of her brother.\nThe brother could only say, \"that he hoped the wild beast would keep his distance.\"\nAnd the wild beast did keep his distance, at any rate as long as Mrs. Greenow remained at the Hall. We will now go back to the wild beast, and tell how he walked across the mountains, in the rain, to Bampton, a little village at the foot of Haweswater. It will be remembered that after he had struck his sister, he turned away from her, and walked with quick steps down the mountain-side, never turning back to look at her. He had found himself to be without any power of persuasion over her, as regarded her evidence to be given, if the will were questioned. The more he threatened her the steadier she had been in asserting her belief in her grandfather's capacity. She had looked into his eye and defied him, and he had felt himself to be worsted. What was he to do? In truth, there was nothing for him to do. He had told her that he would murder her; and in the state of mind to which his fury had driven him, murder had suggested itself to him as a resource to which he might apply himself. But what could he gain by murdering her,--or, at any rate, by murdering her then, out on the mountain-side? Nothing but a hanging! There would be no gratification even to his revenge. If, indeed, he had murdered that old man, who was now, unfortunately, gone beyond the reach of murder;--if he could have poisoned the old man's cup before that last will had been made--there might have been something in such a deed! But he had merely thought of it, letting \"I dare not wait upon I would\"--as he now told himself, with much self-reproach. Nothing was to be got by killing his sister. So he restrained himself in his passion, and walked away from her, solitary, down the mountain.\nThe rain soon came on, and found him exposed on the hill-side. He thought little about it, but buttoned his coat, as I have said before, and strode on. It was a storm of rain, so that he was forced to hold his head to one side, as it hit him from the north. But with his hand to his hat, and his head bent against the wind, he went on till he had reached the valley at the foot, and found that the track by which he had been led thither had become a road. He had never known the mountains round the Hall as Kate had known them, and was not aware whither he was going. On one thing only had he made up his mind since he had left his sister, and that was that he would not return to the house. He knew that he could do nothing there to serve his purpose; his threats would be vain impotence; he had no longer any friend in the house. He could hardly tell himself what line of conduct he would pursue, but he thought that he would hurry back to London, and grasp at whatever money he could get from Alice. He was still, at this moment, a Member of Parliament; and as the rain drenched him through and through, he endeavoured to get consolation from the remembrance of that fact in his favour.\nAs he got near the village he overtook a shepherd boy coming down from the hills, and learned his whereabouts from him. \"Baampton,\" said the boy, with an accent that was almost Scotch, when he was asked the name of the place. When Vavasor further asked whether a gig were kept there, the boy simply stared at him, not knowing a gig by that name. At last, however, he was made to understand the nature of his companion's want, and expressed his belief that \"John Applethwaite, up at the Craigs yon, had got a mickle cart.\" But the Craigs was a farm-house, which now came in view about a mile off, up across the valley; and Vavasor, hoping that he might still find a speedier conveyance than John Applethwaite's mickle cart, went on to the public-house in the village. But, in truth, neither there, nor yet from John Applethwaite, to whom at last an application was sent, could he get any vehicle; and between six and seven he started off again, through the rain, to make his weary way on foot to Shap. The distance was about five miles, and the little byways, lying between walls, were sticky, and almost glutinous with light-coloured, chalky mud. Before he started he took a glass of hot rum-and-water, but the effect of that soon passed away from him, and then he became colder and weaker than he had been before.\nWearily and wretchedly he plodded on. A man may be very weary in such a walk as that, and yet be by no means wretched. Tired, hungry, cold, wet, and nearly penniless, I have sat me down and slept among those mountain tracks,--have slept because nature refused to allow longer wakefulness. But my heart has been as light as my purse, and there has been something in the air of the hills that made me buoyant and happy in the midst of my weariness. But George Vavasor was wretched as well as weary, and every step that he took, plodding through the mud, was a new misfortune to him. What are five miles of a walk to a young man, even though the rain be falling and the ways be dirty? what, though they may come after some other ten that he has already traversed on his feet? His sister Kate would have thought nothing of the distance. But George stopped on his way from time to time, leaning on the loose walls, and cursing the misfortune that had brought him to such a pass. He cursed his grandfather, his uncle, his sister, his cousin, and himself. He cursed the place in which his forefathers had lived, and he cursed the whole county. He cursed the rain, and the wind, and his town-made boots, which would not keep out the wet slush. He cursed the light as it faded, and the darkness as it came. Over and over again he cursed the will that had robbed him, and the attorney that had made it. He cursed the mother that had borne him and the father that had left him poor. He thought of Scruby, and cursed him, thinking how that money would be again required of him by that stern agent. He cursed the House of Commons, which had cost him so much, and the greedy electors who would not send him there without his paying for it. He cursed John Grey, as he thought of those two thousand pounds, with double curses. He cursed this world, and all worlds beyond; and thus, cursing everything, he made his way at last up to the inn at Shap.\nIt was nearly nine when he got there. He had wasted over an hour at Bampton in his endeavour to get John Applethwaite's cart to carry him on, and he had been two hours on his walk from Bampton to Shap,--two hours amidst his cursing. He ordered supper and brandy-and-water, and, as we know, sent off a Mercury for his clothes. But the Mercuries of Westmoreland do not move on quick wings, and it was past midnight before he got his possessions. During all this time he had, by no means, ceased from cursing, but continued it over his broiled ham and while he swallowed his brandy-and-water. He swore aloud, so that the red-armed servant at the inn could not but hear him, that those thieves at the Hall intended to rob him of his clothes;--that they would not send him his property. He could not restrain himself, though he knew that every word he uttered would injure his cause, as regarded the property in Westmoreland, if ever he could make a cause. He knew that he had been mad to strike his sister, and cursed himself for his madness. Yet he could not restrain himself. He told himself that the battle for him was over, and he thought of poison for himself. He thought of poison, and a pistol,--of the pistols he had ever loaded at home, each with six shots, good for a life apiece. He thought of an express train, rushing along at its full career, and of the instant annihilation which it would produce. But if that was to be the end of him, he would not go alone. No, indeed! why should he go alone, leaving those pistols ready loaded in his desk? Among them they had brought him to ruin and to death. Was he a man to pardon his enemies when it was within his power to take them with him, down, down, down--? What were the last words upon his impious lips, as with bloodshot eyes, half drunk, and driven by the Fury, he took himself off to the bed prepared for him, cursing aloud the poor red-haired girl as he went, I may not utter here.",
        "paragraph_chars": [
            [
                0,
                505
            ],
            [
                505,
                616
            ],
            [
                616,
                713
            ],
            [
                713,
                903
            ],
            [
                903,
                963
            ],
            [
                963,
                1325
            ],
            [
                1325,
                1852
            ],
            [
                1852,
                2794
            ],
            [
                2794,
                3220
            ],
            [
                3220,
                3557
            ],
            [
                3557,
                4410
            ],
            [
                4410,
                5169
            ],
            [
                5169,
                5835
            ],
            [
                5835,
                5864
            ],
            [
                5864,
                5891
            ],
            [
                5891,
                6131
            ],
            [
                6131,
                6184
            ],
            [
                6184,
                6241
            ],
            [
                6241,
                6267
            ],
            [
                6267,
                6434
            ],
            [
                6434,
                6870
            ],
            [
                6870,
                7011
            ],
            [
                7011,
                7098
            ],
            [
                7098,
                8242
            ],
            [
                8242,
                9135
            ],
            [
                9135,
                9961
            ],
            [
                9961,
                10707
            ],
            [
                10707,
                12069
            ],
            [
                12069,
                12232
            ],
            [
                12232,
                12278
            ],
            [
                12278,
                12621
            ],
            [
                12621,
                12742
            ],
            [
                12742,
                12826
            ],
            [
                12826,
                14502
            ],
            [
                14502,
                15692
            ],
            [
                15692,
                17007
            ],
            [
                17007,
                18940
            ],
            [
                18940,
                20884
            ]
        ],
        "segment_chars": [
            [
                0,
                154
            ],
            [
                154,
                238
            ],
            [
                238,
                505
            ],
            [
                505,
                547
            ],
            [
                547,
                577
            ],
            [
                577,
                616
            ],
            [
                616,
                694
            ],
            [
                694,
                713
            ],
            [
                713,
                748
            ],
            [
                748,
                801
            ],
            [
                801,
                903
            ],
            [
                903,
                912
            ],
            [
                912,
                963
            ],
            [
                963,
                974
            ],
            [
                974,
                1036
            ],
            [
                1036,
                1114
            ],
            [
                1114,
                1139
            ],
            [
                1139,
                1222
            ],
            [
                1222,
                1325
            ],
            [
                1325,
                1561
            ],
            [
                1561,
                1658
            ],
            [
                1658,
                1747
            ],
            [
                1747,
                1852
            ],
            [
                1852,
                1957
            ],
            [
                1957,
                2066
            ],
            [
                2066,
                2209
            ],
            [
                2209,
                2339
            ],
            [
                2339,
                2409
            ],
            [
                2409,
                2457
            ],
            [
                2457,
                2643
            ],
            [
                2643,
                2794
            ],
            [
                2794,
                2839
            ],
            [
                2839,
                2912
            ],
            [
                2912,
                3095
            ],
            [
                3095,
                3153
            ],
            [
                3153,
                3220
            ],
            [
                3220,
                3318
            ],
            [
                3318,
                3353
            ],
            [
                3353,
                3494
            ],
            [
                3494,
                3512
            ],
            [
                3512,
                3557
            ],
            [
                3557,
                3673
            ],
            [
                3673,
                3762
            ],
            [
                3762,
                3816
            ],
            [
                3816,
                3837
            ],
            [
                3837,
                3876
            ],
            [
                3876,
                3887
            ],
            [
                3887,
                3966
            ],
            [
                3966,
                4011
            ],
            [
                4011,
                4141
            ],
            [
                4141,
                4211
            ],
            [
                4211,
                4331
            ],
            [
                4331,
                4410
            ],
            [
                4410,
                4512
            ],
            [
                4512,
                4736
            ],
            [
                4736,
                4925
            ],
            [
                4925,
                4959
            ],
            [
                4959,
                5069
            ],
            [
                5069,
                5169
            ],
            [
                5169,
                5404
            ],
            [
                5404,
                5464
            ],
            [
                5464,
                5544
            ],
            [
                5544,
                5665
            ],
            [
                5665,
                5835
            ],
            [
                5835,
                5864
            ],
            [
                5864,
                5891
            ],
            [
                5891,
                5928
            ],
            [
                5928,
                6066
            ],
            [
                6066,
                6131
            ],
            [
                6131,
                6184
            ],
            [
                6184,
                6241
            ],
            [
                6241,
                6267
            ],
            [
                6267,
                6343
            ],
            [
                6343,
                6393
            ],
            [
                6393,
                6434
            ],
            [
                6434,
                6601
            ],
            [
                6601,
                6666
            ],
            [
                6666,
                6870
            ],
            [
                6870,
                7011
            ],
            [
                7011,
                7053
            ],
            [
                7053,
                7098
            ],
            [
                7098,
                7282
            ],
            [
                7282,
                7443
            ],
            [
                7443,
                7569
            ],
            [
                7569,
                7805
            ],
            [
                7805,
                7858
            ],
            [
                7858,
                7964
            ],
            [
                7964,
                8135
            ],
            [
                8135,
                8242
            ],
            [
                8242,
                8254
            ],
            [
                8254,
                8333
            ],
            [
                8333,
                8375
            ],
            [
                8375,
                8445
            ],
            [
                8445,
                8539
            ],
            [
                8539,
                8693
            ],
            [
                8693,
                8838
            ],
            [
                8838,
                8927
            ],
            [
                8927,
                9016
            ],
            [
                9016,
                9135
            ],
            [
                9135,
                9218
            ],
            [
                9218,
                9354
            ],
            [
                9354,
                9445
            ],
            [
                9445,
                9497
            ],
            [
                9497,
                9591
            ],
            [
                9591,
                9650
            ],
            [
                9650,
                9833
            ],
            [
                9833,
                9961
            ],
            [
                9961,
                10013
            ],
            [
                10013,
                10097
            ],
            [
                10097,
                10245
            ],
            [
                10245,
                10395
            ],
            [
                10395,
                10492
            ],
            [
                10492,
                10707
            ],
            [
                10707,
                10748
            ],
            [
                10748,
                10878
            ],
            [
                10878,
                10942
            ],
            [
                10942,
                11025
            ],
            [
                11025,
                11156
            ],
            [
                11156,
                11277
            ],
            [
                11277,
                11452
            ],
            [
                11452,
                11585
            ],
            [
                11585,
                11686
            ],
            [
                11686,
                11808
            ],
            [
                11808,
                12069
            ],
            [
                12069,
                12178
            ],
            [
                12178,
                12232
            ],
            [
                12232,
                12278
            ],
            [
                12278,
                12437
            ],
            [
                12437,
                12544
            ],
            [
                12544,
                12621
            ],
            [
                12621,
                12707
            ],
            [
                12707,
                12742
            ],
            [
                12742,
                12826
            ],
            [
                12826,
                12926
            ],
            [
                12926,
                13079
            ],
            [
                13079,
                13250
            ],
            [
                13250,
                13386
            ],
            [
                13386,
                13494
            ],
            [
                13494,
                13577
            ],
            [
                13577,
                13596
            ],
            [
                13596,
                13639
            ],
            [
                13639,
                13822
            ],
            [
                13822,
                13930
            ],
            [
                13930,
                13953
            ],
            [
                13953,
                14006
            ],
            [
                14006,
                14239
            ],
            [
                14239,
                14361
            ],
            [
                14361,
                14406
            ],
            [
                14406,
                14502
            ],
            [
                14502,
                14565
            ],
            [
                14565,
                14654
            ],
            [
                14654,
                14760
            ],
            [
                14760,
                14958
            ],
            [
                14958,
                15070
            ],
            [
                15070,
                15194
            ],
            [
                15194,
                15334
            ],
            [
                15334,
                15505
            ],
            [
                15505,
                15692
            ],
            [
                15692,
                15812
            ],
            [
                15812,
                15918
            ],
            [
                15918,
                16038
            ],
            [
                16038,
                16214
            ],
            [
                16214,
                16459
            ],
            [
                16459,
                16693
            ],
            [
                16693,
                16839
            ],
            [
                16839,
                17007
            ],
            [
                17007,
                17045
            ],
            [
                17045,
                17126
            ],
            [
                17126,
                17296
            ],
            [
                17296,
                17454
            ],
            [
                17454,
                17588
            ],
            [
                17588,
                17689
            ],
            [
                17689,
                17780
            ],
            [
                17780,
                17840
            ],
            [
                17840,
                17981
            ],
            [
                17981,
                18056
            ],
            [
                18056,
                18144
            ],
            [
                18144,
                18243
            ],
            [
                18243,
                18305
            ],
            [
                18305,
                18400
            ],
            [
                18400,
                18479
            ],
            [
                18479,
                18593
            ],
            [
                18593,
                18733
            ],
            [
                18733,
                18818
            ],
            [
                18818,
                18940
            ],
            [
                18940,
                18978
            ],
            [
                18978,
                19173
            ],
            [
                19173,
                19266
            ],
            [
                19266,
                19384
            ],
            [
                19384,
                19530
            ],
            [
                19530,
                19722
            ],
            [
                19722,
                19892
            ],
            [
                19892,
                19979
            ],
            [
                19979,
                20014
            ],
            [
                20014,
                20102
            ],
            [
                20102,
                20227
            ],
            [
                20227,
                20349
            ],
            [
                20349,
                20410
            ],
            [
                20410,
                20422
            ],
            [
                20422,
                20494
            ],
            [
                20494,
                20548
            ],
            [
                20548,
                20655
            ],
            [
                20655,
                20884
            ]
        ],
        "overlap_chars": [
            [
                0,
                20
            ],
            [
                24,
                35
            ],
            [
                104,
                154
            ],
            [
                238,
                258
            ],
            [
                272,
                457
            ],
            [
                503,
                505
            ],
            [
                505,
                547
            ],
            [
                547,
                577
            ],
            [
                577,
                603
            ],
            [
                613,
                616
            ],
            [
                616,
                694
            ],
            [
                694,
                713
            ],
            [
                713,
                748
            ],
            [
                748,
                783
            ],
            [
                799,
                801
            ],
            [
                1114,
                1139
            ],
            [
                1139,
                1193
            ],
            [
                1201,
                1206
            ],
            [
                1219,
                1221
            ],
            [
                1222,
                1275
            ],
            [
                1303,
                1318
            ],
            [
                1323,
                1324
            ],
            [
                1325,
                1347
            ],
            [
                1360,
                1405
            ],
            [
                1450,
                1454
            ],
            [
                1467,
                1507
            ],
            [
                1514,
                1540
            ],
            [
                1559,
                1561
            ],
            [
                1561,
                1577
            ],
            [
                1678,
                1683
            ],
            [
                1598,
                1656
            ],
            [
                1691,
                1692
            ],
            [
                1709,
                1747
            ],
            [
                1747,
                1779
            ],
            [
                1780,
                1805
            ],
            [
                1818,
                1852
            ],
            [
                1904,
                1912
            ],
            [
                1852,
                1903
            ],
            [
                1914,
                1957
            ],
            [
                1957,
                1971
            ],
            [
                1993,
                2024
            ],
            [
                2033,
                2066
            ],
            [
                2066,
                2208
            ],
            [
                2209,
                2265
            ],
            [
                2266,
                2271
            ],
            [
                2337,
                2339
            ],
            [
                2457,
                2508
            ],
            [
                2530,
                2537
            ],
            [
                2546,
                2582
            ],
            [
                2595,
                2611
            ],
            [
                2641,
                2643
            ],
            [
                2643,
                2693
            ],
            [
                2752,
                2777
            ],
            [
                2735,
                2746
            ],
            [
                2792,
                2794
            ],
            [
                2794,
                2837
            ],
            [
                2866,
                2880
            ],
            [
                2910,
                2912
            ],
            [
                2912,
                3069
            ],
            [
                3093,
                3095
            ],
            [
                3095,
                3153
            ],
            [
                3153,
                3173
            ],
            [
                3177,
                3179
            ],
            [
                3212,
                3220
            ],
            [
                3220,
                3272
            ],
            [
                3289,
                3318
            ],
            [
                3318,
                3353
            ],
            [
                3353,
                3387
            ],
            [
                3417,
                3441
            ],
            [
                3404,
                3407
            ],
            [
                3459,
                3483
            ],
            [
                3488,
                3494
            ],
            [
                3494,
                3497
            ],
            [
                3499,
                3512
            ],
            [
                3512,
                3557
            ],
            [
                3557,
                3618
            ],
            [
                3704,
                3707
            ],
            [
                3737,
                3742
            ],
            [
                3631,
                3633
            ],
            [
                3814,
                3816
            ],
            [
                3816,
                3837
            ],
            [
                3837,
                3855
            ],
            [
                3856,
                3876
            ],
            [
                3876,
                3887
            ],
            [
                3887,
                3966
            ],
            [
                4211,
                4261
            ],
            [
                4263,
                4266
            ],
            [
                4338,
                4359
            ],
            [
                4408,
                4410
            ],
            [
                4410,
                4425
            ],
            [
                4441,
                4452
            ],
            [
                4510,
                4512
            ],
            [
                4512,
                4541
            ],
            [
                4553,
                4572
            ],
            [
                4581,
                4659
            ],
            [
                4669,
                4685
            ],
            [
                4734,
                4736
            ],
            [
                4736,
                4753
            ],
            [
                4775,
                4776
            ],
            [
                4758,
                4761
            ],
            [
                4800,
                4812
            ],
            [
                4837,
                4845
            ],
            [
                4813,
                4827
            ],
            [
                4867,
                4872
            ],
            [
                4878,
                4889
            ],
            [
                4890,
                4925
            ],
            [
                4925,
                4958
            ],
            [
                4959,
                4979
            ],
            [
                4983,
                5042
            ],
            [
                5067,
                5069
            ],
            [
                5078,
                5128
            ],
            [
                5138,
                5169
            ],
            [
                5169,
                5373
            ],
            [
                5404,
                5407
            ],
            [
                5417,
                5428
            ],
            [
                5450,
                5464
            ],
            [
                5479,
                5491
            ],
            [
                5517,
                5524
            ],
            [
                5526,
                5544
            ],
            [
                5544,
                5546
            ],
            [
                5578,
                5664
            ],
            [
                5665,
                5756
            ],
            [
                5819,
                5835
            ],
            [
                5835,
                5864
            ],
            [
                5864,
                5891
            ],
            [
                5891,
                5928
            ],
            [
                5991,
                6052
            ],
            [
                6057,
                6066
            ],
            [
                6066,
                6131
            ],
            [
                6131,
                6153
            ],
            [
                6181,
                6184
            ],
            [
                6184,
                6241
            ],
            [
                6241,
                6245
            ],
            [
                6247,
                6267
            ],
            [
                6267,
                6293
            ],
            [
                6343,
                6391
            ],
            [
                6434,
                6446
            ],
            [
                6531,
                6601
            ],
            [
                6601,
                6664
            ],
            [
                6684,
                6685
            ],
            [
                6686,
                6696
            ],
            [
                6701,
                6705
            ],
            [
                6670,
                6672
            ],
            [
                6868,
                6870
            ],
            [
                6870,
                6871
            ],
            [
                6880,
                6933
            ],
            [
                6939,
                6947
            ],
            [
                6954,
                7004
            ],
            [
                7008,
                7011
            ],
            [
                7011,
                7012
            ],
            [
                7032,
                7034
            ],
            [
                7035,
                7052
            ],
            [
                7098,
                7102
            ],
            [
                7183,
                7188
            ],
            [
                7204,
                7268
            ],
            [
                7273,
                7282
            ],
            [
                7282,
                7290
            ],
            [
                7331,
                7354
            ],
            [
                7441,
                7443
            ],
            [
                7443,
                7470
            ],
            [
                7487,
                7489
            ],
            [
                7495,
                7528
            ],
            [
                7531,
                7535
            ],
            [
                7542,
                7569
            ],
            [
                7569,
                7608
            ],
            [
                7618,
                7638
            ],
            [
                7644,
                7659
            ],
            [
                7678,
                7689
            ],
            [
                7705,
                7706
            ],
            [
                7712,
                7749
            ],
            [
                7756,
                7805
            ],
            [
                7858,
                7917
            ],
            [
                7926,
                7963
            ],
            [
                7964,
                8007
            ],
            [
                8009,
                8017
            ],
            [
                8065,
                8066
            ],
            [
                8018,
                8043
            ],
            [
                8052,
                8058
            ],
            [
                8044,
                8051
            ],
            [
                8082,
                8135
            ],
            [
                8135,
                8156
            ],
            [
                8187,
                8191
            ],
            [
                8196,
                8216
            ],
            [
                8221,
                8242
            ],
            [
                8254,
                8333
            ],
            [
                8333,
                8375
            ],
            [
                8445,
                8518
            ],
            [
                8537,
                8539
            ],
            [
                8539,
                8578
            ],
            [
                8628,
                8693
            ],
            [
                8693,
                8708
            ],
            [
                8774,
                8786
            ],
            [
                8803,
                8832
            ],
            [
                8838,
                8886
            ],
            [
                8963,
                9016
            ],
            [
                9041,
                9059
            ],
            [
                9060,
                9135
            ],
            [
                9135,
                9139
            ],
            [
                9163,
                9218
            ],
            [
                9218,
                9258
            ],
            [
                9284,
                9313
            ],
            [
                9261,
                9264
            ],
            [
                9272,
                9276
            ],
            [
                9354,
                9361
            ],
            [
                9398,
                9445
            ],
            [
                9445,
                9466
            ],
            [
                9495,
                9497
            ],
            [
                9497,
                9551
            ],
            [
                9624,
                9650
            ],
            [
                9650,
                9693
            ],
            [
                9724,
                9767
            ],
            [
                9792,
                9827
            ],
            [
                9831,
                9833
            ],
            [
                9833,
                9868
            ],
            [
                9898,
                9900
            ],
            [
                9914,
                9933
            ],
            [
                9939,
                9961
            ],
            [
                9961,
                9990
            ],
            [
                9996,
                10000
            ],
            [
                10011,
                10013
            ],
            [
                10013,
                10026
            ],
            [
                10055,
                10097
            ],
            [
                10102,
                10156
            ],
            [
                10243,
                10245
            ],
            [
                10395,
                10432
            ],
            [
                10450,
                10492
            ],
            [
                10492,
                10506
            ],
            [
                10539,
                10566
            ],
            [
                10571,
                10586
            ],
            [
                10507,
                10510
            ],
            [
                10610,
                10643
            ],
            [
                10667,
                10707
            ],
            [
                10707,
                10748
            ],
            [
                10748,
                10777
            ],
            [
                10781,
                10840
            ],
            [
                10853,
                10878
            ],
            [
                10878,
                10892
            ],
            [
                10898,
                10910
            ],
            [
                10915,
                10929
            ],
            [
                10911,
                10914
            ],
            [
                10983,
                10987
            ],
            [
                10993,
                11005
            ],
            [
                11018,
                11023
            ],
            [
                10948,
                10972
            ],
            [
                11023,
                11025
            ],
            [
                11080,
                11139
            ],
            [
                11154,
                11156
            ],
            [
                11156,
                11216
            ],
            [
                11230,
                11276
            ],
            [
                11277,
                11320
            ],
            [
                11393,
                11452
            ],
            [
                11452,
                11499
            ],
            [
                11506,
                11527
            ],
            [
                11552,
                11585
            ],
            [
                11585,
                11600
            ],
            [
                11605,
                11610
            ],
            [
                11626,
                11664
            ],
            [
                11611,
                11625
            ],
            [
                11684,
                11686
            ],
            [
                11686,
                11729
            ],
            [
                11729,
                11734
            ],
            [
                11742,
                11757
            ],
            [
                11783,
                11808
            ],
            [
                11808,
                11820
            ],
            [
                11857,
                11891
            ],
            [
                11933,
                12012
            ],
            [
                12067,
                12069
            ],
            [
                12069,
                12083
            ],
            [
                12085,
                12177
            ],
            [
                12278,
                12282
            ],
            [
                12296,
                12306
            ],
            [
                12314,
                12318
            ],
            [
                12324,
                12350
            ],
            [
                12354,
                12359
            ],
            [
                12393,
                12396
            ],
            [
                12426,
                12435
            ],
            [
                12440,
                12457
            ],
            [
                12397,
                12401
            ],
            [
                12462,
                12469
            ],
            [
                12473,
                12481
            ],
            [
                12542,
                12544
            ],
            [
                12544,
                12621
            ],
            [
                12621,
                12666
            ],
            [
                12681,
                12689
            ],
            [
                12704,
                12707
            ],
            [
                12713,
                12725
            ],
            [
                12729,
                12742
            ],
            [
                12754,
                12768
            ],
            [
                12771,
                12823
            ],
            [
                12826,
                12925
            ],
            [
                12926,
                12948
            ],
            [
                12963,
                13036
            ],
            [
                13044,
                13079
            ],
            [
                13079,
                13152
            ],
            [
                13163,
                13173
            ],
            [
                13191,
                13213
            ],
            [
                13248,
                13250
            ],
            [
                13250,
                13317
            ],
            [
                13384,
                13386
            ],
            [
                13386,
                13412
            ],
            [
                13413,
                13438
            ],
            [
                13492,
                13494
            ],
            [
                13494,
                13577
            ],
            [
                13577,
                13595
            ],
            [
                13596,
                13639
            ],
            [
                13639,
                13680
            ],
            [
                13822,
                13861
            ],
            [
                13904,
                13930
            ],
            [
                13930,
                13953
            ],
            [
                14006,
                14046
            ],
            [
                14110,
                14189
            ],
            [
                14197,
                14222
            ],
            [
                14237,
                14239
            ],
            [
                14361,
                14406
            ],
            [
                14406,
                14411
            ],
            [
                14451,
                14471
            ],
            [
                14483,
                14502
            ],
            [
                14502,
                14528
            ],
            [
                14565,
                14567
            ],
            [
                14597,
                14615
            ],
            [
                14639,
                14652
            ],
            [
                14837,
                14844
            ],
            [
                14849,
                14867
            ],
            [
                14879,
                14905
            ],
            [
                14939,
                14958
            ],
            [
                14958,
                14976
            ],
            [
                14981,
                14990
            ],
            [
                15006,
                15013
            ],
            [
                15024,
                15047
            ],
            [
                15056,
                15070
            ],
            [
                15118,
                15124
            ],
            [
                15095,
                15111
            ],
            [
                15155,
                15194
            ],
            [
                15405,
                15505
            ],
            [
                15505,
                15595
            ],
            [
                15607,
                15611
            ],
            [
                15624,
                15647
            ],
            [
                15667,
                15676
            ],
            [
                15690,
                15692
            ],
            [
                15692,
                15785
            ],
            [
                15810,
                15812
            ],
            [
                15812,
                15836
            ],
            [
                15916,
                15917
            ],
            [
                15918,
                15930
            ],
            [
                15939,
                16004
            ],
            [
                16036,
                16038
            ],
            [
                16038,
                16081
            ],
            [
                16116,
                16121
            ],
            [
                16143,
                16214
            ],
            [
                16314,
                16343
            ],
            [
                16350,
                16458
            ],
            [
                16459,
                16462
            ],
            [
                16474,
                16492
            ],
            [
                16497,
                16693
            ],
            [
                16693,
                16735
            ],
            [
                16772,
                16783
            ],
            [
                16785,
                16810
            ],
            [
                16825,
                16839
            ],
            [
                16839,
                16934
            ],
            [
                16943,
                16948
            ],
            [
                16954,
                17007
            ],
            [
                17007,
                17045
            ],
            [
                17045,
                17124
            ],
            [
                17131,
                17132
            ],
            [
                17303,
                17308
            ],
            [
                17321,
                17326
            ],
            [
                17452,
                17454
            ],
            [
                17840,
                17850
            ],
            [
                17851,
                17858
            ],
            [
                17870,
                17928
            ],
            [
                17862,
                17865
            ],
            [
                17933,
                17943
            ],
            [
                17979,
                17980
            ],
            [
                17981,
                18056
            ],
            [
                18056,
                18144
            ],
            [
                18144,
                18243
            ],
            [
                18243,
                18305
            ],
            [
                18305,
                18400
            ],
            [
                18593,
                18733
            ],
            [
                18733,
                18752
            ],
            [
                18798,
                18818
            ],
            [
                18867,
                18940
            ],
            [
                18940,
                18978
            ],
            [
                19173,
                19240
            ],
            [
                19249,
                19266
            ],
            [
                19266,
                19269
            ],
            [
                19332,
                19384
            ],
            [
                19384,
                19411
            ],
            [
                19426,
                19488
            ],
            [
                19512,
                19530
            ],
            [
                19530,
                19557
            ],
            [
                19568,
                19575
            ],
            [
                19587,
                19596
            ],
            [
                19609,
                19676
            ],
            [
                19720,
                19722
            ],
            [
                19722,
                19817
            ],
            [
                19890,
                19892
            ],
            [
                19892,
                19979
            ],
            [
                19979,
                20014
            ],
            [
                20068,
                20100
            ],
            [
                20062,
                20067
            ],
            [
                20113,
                20115
            ],
            [
                20146,
                20153
            ],
            [
                20225,
                20227
            ],
            [
                20227,
                20257
            ],
            [
                20291,
                20348
            ],
            [
                20349,
                20352
            ],
            [
                20387,
                20410
            ],
            [
                20410,
                20422
            ],
            [
                20422,
                20494
            ],
            [
                20548,
                20587
            ],
            [
                20615,
                20651
            ],
            [
                20653,
                20655
            ],
            [
                20706,
                20785
            ],
            [
                20790,
                20793
            ],
            [
                20810,
                20819
            ],
            [
                20826,
                20834
            ],
            [
                20851,
                20861
            ],
            [
                20883,
                20884
            ]
        ],
        "row_chars": [
            [
                0,
                154
            ],
            [
                154,
                238
            ],
            [
                238,
                505
            ],
            [
                505,
                547
            ],
            [
                547,
                577
            ],
            [
                577,
                616
            ],
            [
                616,
                694
            ],
            [
                694,
                713
            ],
            [
                713,
                748
            ],
            [
                748,
                801
            ],
            [
                801,
                903
            ],
            [
                903,
                912
            ],
            [
                912,
                963
            ],
            [
                963,
                974
            ],
            [
                974,
                1036
            ],
            [
                1036,
                1114
            ],
            [
                1114,
                1139
            ],
            [
                1139,
                1222
            ],
            [
                1222,
                1325
            ],
            [
                1325,
                1561
            ],
            [
                1561,
                1747
            ],
            [
                1747,
                1852
            ],
            [
                1852,
                1957
            ],
            [
                1957,
                2066
            ],
            [
                2066,
                2209
            ],
            [
                2209,
                2339
            ],
            [
                2339,
                2409
            ],
            [
                2409,
                2457
            ],
            [
                2457,
                2643
            ],
            [
                2643,
                2794
            ],
            [
                2794,
                2912
            ],
            [
                2912,
                3095
            ],
            [
                3095,
                3153
            ],
            [
                3153,
                3220
            ],
            [
                3220,
                3318
            ],
            [
                3318,
                3353
            ],
            [
                3353,
                3494
            ],
            [
                3494,
                3512
            ],
            [
                3512,
                3557
            ],
            [
                3557,
                3816
            ],
            [
                3816,
                3837
            ],
            [
                3837,
                3876
            ],
            [
                3876,
                3887
            ],
            [
                3887,
                3966
            ],
            [
                3966,
                4011
            ],
            [
                4011,
                4141
            ],
            [
                4141,
                4211
            ],
            [
                4211,
                4410
            ],
            [
                4410,
                4512
            ],
            [
                4512,
                4736
            ],
            [
                4736,
                4925
            ],
            [
                4925,
                4959
            ],
            [
                4959,
                5069
            ],
            [
                5069,
                5169
            ],
            [
                5169,
                5464
            ],
            [
                5464,
                5544
            ],
            [
                5544,
                5665
            ],
            [
                5665,
                5835
            ],
            [
                5835,
                5864
            ],
            [
                5864,
                5891
            ],
            [
                5891,
                5928
            ],
            [
                5928,
                6066
            ],
            [
                6066,
                6131
            ],
            [
                6131,
                6184
            ],
            [
                6184,
                6241
            ],
            [
                6241,
                6267
            ],
            [
                6267,
                6393
            ],
            [
                6393,
                6434
            ],
            [
                6434,
                6601
            ],
            [
                6601,
                6870
            ],
            [
                6870,
                7011
            ],
            [
                7011,
                7053
            ],
            [
                7053,
                7098
            ],
            [
                7098,
                7282
            ],
            [
                7282,
                7443
            ],
            [
                7443,
                7569
            ],
            [
                7569,
                7805
            ],
            [
                7805,
                7858
            ],
            [
                7858,
                7964
            ],
            [
                7964,
                8135
            ],
            [
                8135,
                8242
            ],
            [
                8242,
                8254
            ],
            [
                8254,
                8333
            ],
            [
                8333,
                8375
            ],
            [
                8375,
                8445
            ],
            [
                8445,
                8539
            ],
            [
                8539,
                8693
            ],
            [
                8693,
                8838
            ],
            [
                8838,
                9016
            ],
            [
                9016,
                9135
            ],
            [
                9135,
                9218
            ],
            [
                9218,
                9445
            ],
            [
                9445,
                9497
            ],
            [
                9497,
                9650
            ],
            [
                9650,
                9833
            ],
            [
                9833,
                9961
            ],
            [
                9961,
                10013
            ],
            [
                10013,
                10097
            ],
            [
                10097,
                10245
            ],
            [
                10245,
                10395
            ],
            [
                10395,
                10492
            ],
            [
                10492,
                10707
            ],
            [
                10707,
                10748
            ],
            [
                10748,
                10878
            ],
            [
                10878,
                11025
            ],
            [
                11025,
                11156
            ],
            [
                11156,
                11277
            ],
            [
                11277,
                11452
            ],
            [
                11452,
                11585
            ],
            [
                11585,
                11686
            ],
            [
                11686,
                11808
            ],
            [
                11808,
                12069
            ],
            [
                12069,
                12178
            ],
            [
                12178,
                12232
            ],
            [
                12232,
                12278
            ],
            [
                12278,
                12544
            ],
            [
                12544,
                12621
            ],
            [
                12621,
                12707
            ],
            [
                12707,
                12742
            ],
            [
                12742,
                12826
            ],
            [
                12826,
                12926
            ],
            [
                12926,
                13079
            ],
            [
                13079,
                13250
            ],
            [
                13250,
                13386
            ],
            [
                13386,
                13494
            ],
            [
                13494,
                13577
            ],
            [
                13577,
                13596
            ],
            [
                13596,
                13639
            ],
            [
                13639,
                13930
            ],
            [
                13930,
                13953
            ],
            [
                13953,
                14006
            ],
            [
                14006,
                14239
            ],
            [
                14239,
                14361
            ],
            [
                14361,
                14406
            ],
            [
                14406,
                14502
            ],
            [
                14502,
                14958
            ],
            [
                14958,
                15070
            ],
            [
                15070,
                15194
            ],
            [
                15194,
                15334
            ],
            [
                15334,
                15505
            ],
            [
                15505,
                15692
            ],
            [
                15692,
                15812
            ],
            [
                15812,
                15918
            ],
            [
                15918,
                16038
            ],
            [
                16038,
                16214
            ],
            [
                16214,
                16459
            ],
            [
                16459,
                16693
            ],
            [
                16693,
                16839
            ],
            [
                16839,
                17007
            ],
            [
                17007,
                17045
            ],
            [
                17045,
                17454
            ],
            [
                17454,
                17588
            ],
            [
                17588,
                17689
            ],
            [
                17689,
                17780
            ],
            [
                17780,
                17840
            ],
            [
                17840,
                17981
            ],
            [
                17981,
                18056
            ],
            [
                18056,
                18144
            ],
            [
                18144,
                18243
            ],
            [
                18243,
                18305
            ],
            [
                18305,
                18400
            ],
            [
                18400,
                18479
            ],
            [
                18479,
                18593
            ],
            [
                18593,
                18733
            ],
            [
                18733,
                18818
            ],
            [
                18818,
                18940
            ],
            [
                18940,
                18978
            ],
            [
                18978,
                19173
            ],
            [
                19173,
                19266
            ],
            [
                19266,
                19384
            ],
            [
                19384,
                19530
            ],
            [
                19530,
                19722
            ],
            [
                19722,
                19892
            ],
            [
                19892,
                19979
            ],
            [
                19979,
                20014
            ],
            [
                20014,
                20227
            ],
            [
                20227,
                20349
            ],
            [
                20349,
                20410
            ],
            [
                20410,
                20422
            ],
            [
                20422,
                20494
            ],
            [
                20494,
                20548
            ],
            [
                20548,
                20655
            ],
            [
                20655,
                20884
            ]
        ]
    },
    "abridged": {
        "text": "About eleven o'clock that night, there came a gentle knock at Kate's bedroom door. Her aunt was sitting by her bedside, and the doctor, who had been summoned from Penrith and who had set her broken arm, was still in the house, talking over the accident with John Vavasor in the dining-room.\n\"She will do very well,\" said the doctor. \"It's only a simple fracture. I'll see her the day after tomorrow.\"\n\"Is it not odd that such an accident should come from a fall whilst walking?\" asked Mr. Vavasor.\nThe doctor shrugged his shoulders. \"One never can say how anything may happen. Good night, Mr. Vavasor. Don't trouble her with questions till she has had some sleep.\"\nThen the doctor went, and John Vavasor was left alone in the dining-room. There had been so much confusion in the house since Kate had fainted that he had not yet had time to make up his mind about the nature of the accident. Mrs. Greenow had found that the bone was broken, and the doctor had been sent for, reaching the Hall a little before ten o'clock. In the meantime, as soon as Kate had recovered her senses, she gave her account of what had occurred.\nShe said that her brother had quarrelled with her about the will, and had left her abruptly on the mountain. She had fallen as she turned from him, and had found that she had hurt herself. But she had been too angry with him to let him know it; and, indeed, she had not known the extent herself till he had passed out of her sight.\nThis was her story; and there was nothing in it that was literally false. It was true, in one sense, that she had fallen, and had not known how severe had been the injury till he had gone. But she repressed all mention of his violence, and declined to speak further about the quarrel.\nNeither her uncle nor her aunt believed her, and she knew it. George's absence, their recent experience of his moods, and the violence by which her arm must have been broken, made them certain that Kate had more to tell. But in her present condition they could not question her. Mrs. Greenow did ask whether George was likely to return.\n\"I can only tell you,\" said Kate, \"that he went away in the direction of Bampton. Perhaps he has gone on to Penrith. He was very angry with us all; and he has probably resolved not to stay another night under this roof. But who can say? He is not in his senses when he is angered.\"\nJohn Vavasor, as he stood alone after the doctor's departure, thought, \"There is more to this. But how to prove it? and would there be any good in proving it? Poor girl! Will it not be better for her to let it pass as though we believed her story?\" Then he began to long that he was back at his club; and he went up to his bed.\nIn the meantime a messenger came knocking at Kate's bedroom door. One of the girls of the house handed a scrap of paper to Mrs. Greenow, saying that a boy had brought it over with a cart from Shap, and that it was for Miss Vavasor. The note was open; it was written on a crumpled scrap of paper, and read as follows:\n\"Send me my clothes by the bearer. I shall not return to the house.\"\nMrs. Greenow took it to Kate, and then went away to see her nephew's things duly packed up. They were sent away in the cart, and Mr. Vavasor, as he went upstairs, was told what had been done.\nNeither on that night or on the following day did Mrs. Greenow ask any further questions; but on the morning after that, when the doctor had left them with a good account of the broken limb, her curiosity and indignation urged her on. She was less selfish than her brother. If George had ill-treated his sister, she would have sacrificed much to bring him to punishment.\n\"Kate,\" she said, when the doctor was gone, \"I expect that you will tell me the whole truth about this accident.\"\n\"I have told you the truth.\"\n\"But not the whole truth.\"\n\"All the truth I mean to tell, aunt. You don't suppose that I am going to give an exact account of our quarrel? We were both wrong, probably, and so let there be an end of it.\"\n\"Was he violent to you?\"\n\"When he is angry he is always violent in his language.\"\n\"But did he strike you?\"\n\"Dear aunt, don't be angry, but I would rather answer no more questions about it.\"\nMrs. Greenow was quite sure now that Kate had not broken her arm by a simple fall. She was certain that the injury had come from positive violence, or Kate would have denied it indignantly.\n\"Have it your own way,\" said Mrs. Greenow; \"but let me tell you that your brother George had better keep out of my path.\"\n\"He probably will,\" said Kate.\nKate found much difficulty in planning her own future behaviour towards her brother. Must she divide herself from him entirely? and must she see him ruined by lack of money, while she had been made rich by her grandfather's will? It will be remembered that her life had until now been devoted to him; all her schemes were for his success; she had taught herself to consider it her duty to sacrifice everything to his welfare. It is very hard to tear out from one's heart and fling away the only love that one has cherished!\nAnd what was she to say to Alice about all this - to Alice, whom she had cheated of a worthy husband, to allure her into the arms of one so utterly unworthy? Luckily for Kate, her broken arm meant that writing to Alice was out of the question.\nBut what woman can bear a blow from a man, and afterwards return to him with love? A wife may have to bear it and to return. The man is the father of her children, and earns the bread which they eat. Habit and the ways of the world require that she should live with him in what amity is possible to them. But as for love - a blow given to the defenceless crushes it. A woman may forgive deceit, treachery, desertion; but I do not think that a woman can forget a blow. It is not the blow itself that she cannot forgive, but the meanness of spirit that made it possible.\nKate told herself that everything in life was over for her. She had long feared her brother's nature as hard and heartless; but still she had hoped that success would soften him, and then all might be right. But now all was wrong. When he had compelled her to write to Alice for money, his meanness had shocked her. But now he had asked her to perjure herself, and had threatened to murder her, and had hit her because she had refused to obey. And he had accused her of treachery - of deceit in obtaining the property for herself!\n\"But he does not believe it,\" thought Kate. \"He said that to vex me; but I know he does not think it.\" She had watched her brother longing for money all his life. How often had she offered to give him every shilling that she had in the world! At this moment she never wished to see him again; but even now, if she could, she would have made over to him all her interest in the Vavasor estate.\nBut any such making over was impossible. John Vavasor remained in Westmorland for a week, and during that time many discussions were held about the property. Mr. Round came from London, met Mr. Gogram and said there was no doubt about the validity of the will. It was agreed that the old Hall should be let in six months. In the meantime Kate was to remain there till her arm should mend, and she could make her plans for the future.\nAunt Greenow promised to remain at the Hall, as though she were quite forgetful of Captain Bellfield. Of Mr. Cheesacre she was not forgetful, for she continued to speak of him as though he were Kate's suitor. But she did not press the acceptance of Mr. Cheesacre's hand upon her niece. Kate was mistress of a considerable fortune now, and such a marriage was no longer necessary. Mrs. Greenow pointed out how easily he might be managed; but she no longer spoke of Kate's chances in the marriage market as desperate.\n\"A young woman with six hundred a year, my dear, may do pretty nearly what she pleases,\" said aunt Greenow.\nKate hoped that Alice would come to her for a while in Westmorland, and her uncle promised to carry this message to Alice. Then Mr. Vavasor went away, leaving the aunt and niece together at the Hall.\n\"What on earth shall we do if that wild beast suddenly appears?\" Mrs. Greenow had asked her brother.\nHe could only say that he hoped the wild beast would keep his distance. And the wild beast did keep his distance, at any rate as long as Mrs. Greenow remained at the Hall.\nWe will now go back to him, and tell how he walked across the mountains, in the rain, to Bampton, a village at the foot of Haweswater. It will be remembered that after he had struck his sister, he turned away and walked quickly down the mountain-side. He had found himself to be without any power of persuasion over her. The more he threatened her, the steadier she had been. She had looked into his eye and defied him, and he had felt himself to be worsted. What was he to do?\nIn truth, there was nothing for him to do. He had told her that he would murder her; but what could he gain by murdering her out on the mountain-side? Nothing but a hanging! If, indeed, he had murdered that old man - if he could have poisoned the old man's cup before that last will had been made - that might have been something! But nothing was to be got by killing his sister. So he walked away from her down the mountain.\nThe rain soon came on, and he buttoned his coat, and strode on till he reached the valley, and found that the track had become a road. He had never known these mountains as Kate knew them, and was not aware of where he was going. He had simply made up his mind that he would not return to the house. He thought that he would hurry back to London, and grasp at whatever money he could get from Alice. He was still, at this moment, a Member of Parliament; and as the rain drenched him through, he tried to get consolation from remembering that fact.\nAs he got near the village he overtook a shepherd boy coming down from the hills, and learned here he was. \"Baampton,\" said the boy.\nWhen Vavasor asked whether a gig were kept there, the boy simply stared at him. At last, however, he was made to understand, and said that \"John Applethwaite, up at the Craigs yon, had got a mickle cart.\" Vavasor, hoping that he might find a speedier conveyance than John Applethwaite's mickle cart, went on to the public-house in the village.\nBut neither there, nor from John Applethwaite, to whom at last an application was sent, could he get any vehicle; and between six and seven he started off again, through the rain, to make his weary way on foot to Shap. The distance was about five miles, and the paths were sticky and almost glutinous with pale, chalky mud. Before he started he took a glass of hot rum-and-water, but the effect of that soon passed away, and he became colder and weaker than he had been before.\nWearily and wretchedly he plodded on. A man may be very weary in such a walk as that, and yet be by no means wretched, if his heart is light. But George Vavasor was wretched as well as weary, and he stopped from time to time, leaning on the loose walls, and cursing his misfortune.\nHe cursed his grandfather, his uncle, his sister, his cousin, and himself. He cursed the place in which his forefathers had lived, and he cursed the whole county. He cursed the rain, and the wind, and his town-made boots, which would not keep out the wet slush. He cursed the light as it faded, and the darkness as it came. Over and over again he cursed the will that had robbed him, and the attorney that had made it. He cursed the House of Commons, which had cost him so much, and the greedy electors who would not send him there without his paying for it. He cursed John Grey with double curses. Thus, cursing everything, he made his way at last up to the inn at Shap.\nIt was nearly nine when he got there. He ordered supper and brandy-and-water, and, as we know, sent off a messenger for his clothes. But it was past midnight before he got his possessions. During all this time he had not ceased from cursing, but continued it over his broiled ham and brandy-and-water. He swore aloud, so that the servant could not help hearing, that those thieves at the Hall intended to rob him of his clothes. He could not restrain himself, though he knew that every word he uttered would injure his cause. He knew that he had been mad to strike his sister, and cursed himself for his madness. Yet he could not restrain himself. He thought of poison for himself, and of his pistols. He thought of an express train, and of the instant annihilation which it would produce.\nBut he would not go alone. No, indeed! why should he go alone, leaving those pistols ready loaded in his desk? Was he a man to pardon his enemies when he could take them with him, down, down, down? With bloodshot eyes, half drunk, and driven by the Fury, he took himself off to bed, cursing the poor servant as he went.",
        "paragraph_chars": [
            [
                0,
                291
            ],
            [
                291,
                401
            ],
            [
                401,
                498
            ],
            [
                498,
                665
            ],
            [
                665,
                1123
            ],
            [
                1123,
                1455
            ],
            [
                1455,
                1740
            ],
            [
                1740,
                2077
            ],
            [
                2077,
                2359
            ],
            [
                2359,
                2687
            ],
            [
                2687,
                3004
            ],
            [
                3004,
                3073
            ],
            [
                3073,
                3265
            ],
            [
                3265,
                3636
            ],
            [
                3636,
                3750
            ],
            [
                3750,
                3779
            ],
            [
                3779,
                3806
            ],
            [
                3806,
                3983
            ],
            [
                3983,
                4008
            ],
            [
                4008,
                4065
            ],
            [
                4065,
                4090
            ],
            [
                4090,
                4173
            ],
            [
                4173,
                4363
            ],
            [
                4363,
                4485
            ],
            [
                4485,
                4516
            ],
            [
                4516,
                5040
            ],
            [
                5040,
                5284
            ],
            [
                5284,
                5853
            ],
            [
                5853,
                6384
            ],
            [
                6384,
                6777
            ],
            [
                6777,
                7211
            ],
            [
                7211,
                7727
            ],
            [
                7727,
                7835
            ],
            [
                7835,
                8035
            ],
            [
                8035,
                8136
            ],
            [
                8136,
                8308
            ],
            [
                8308,
                8786
            ],
            [
                8786,
                9212
            ],
            [
                9212,
                9760
            ],
            [
                9760,
                9893
            ],
            [
                9893,
                10237
            ],
            [
                10237,
                10715
            ],
            [
                10715,
                10997
            ],
            [
                10997,
                11669
            ],
            [
                11669,
                12459
            ],
            [
                12459,
                12778
            ]
        ],
        "segment_chars": [
            [
                0,
                83
            ],
            [
                83,
                291
            ],
            [
                291,
                333
            ],
            [
                333,
                363
            ],
            [
                363,
                401
            ],
            [
                401,
                479
            ],
            [
                479,
                498
            ],
            [
                498,
                533
            ],
            [
                533,
                577
            ],
            [
                577,
                602
            ],
            [
                602,
                665
            ],
            [
                665,
                739
            ],
            [
                739,
                891
            ],
            [
                891,
                1021
            ],
            [
                1021,
                1123
            ],
            [
                1123,
                1232
            ],
            [
                1232,
                1312
            ],
            [
                1312,
                1455
            ],
            [
                1455,
                1529
            ],
            [
                1529,
                1644
            ],
            [
                1644,
                1740
            ],
            [
                1740,
                1802
            ],
            [
                1802,
                1961
            ],
            [
                1961,
                2019
            ],
            [
                2019,
                2077
            ],
            [
                2077,
                2159
            ],
            [
                2159,
                2194
            ],
            [
                2194,
                2297
            ],
            [
                2297,
                2314
            ],
            [
                2314,
                2359
            ],
            [
                2359,
                2454
            ],
            [
                2454,
                2475
            ],
            [
                2475,
                2518
            ],
            [
                2518,
                2529
            ],
            [
                2529,
                2608
            ],
            [
                2608,
                2687
            ],
            [
                2687,
                2753
            ],
            [
                2753,
                2919
            ],
            [
                2919,
                3004
            ],
            [
                3004,
                3039
            ],
            [
                3039,
                3073
            ],
            [
                3073,
                3165
            ],
            [
                3165,
                3265
            ],
            [
                3265,
                3500
            ],
            [
                3500,
                3539
            ],
            [
                3539,
                3636
            ],
            [
                3636,
                3750
            ],
            [
                3750,
                3779
            ],
            [
                3779,
                3806
            ],
            [
                3806,
                3843
            ],
            [
                3843,
                3918
            ],
            [
                3918,
                3983
            ],
            [
                3983,
                4008
            ],
            [
                4008,
                4065
            ],
            [
                4065,
                4090
            ],
            [
                4090,
                4173
            ],
            [
                4173,
                4256
            ],
            [
                4256,
                4363
            ],
            [
                4363,
                4485
            ],
            [
                4485,
                4516
            ],
            [
                4516,
                4601
            ],
            [
                4601,
                4644
            ],
            [
                4644,
                4746
            ],
            [
                4746,
                4942
            ],
            [
                4942,
                5040
            ],
            [
                5040,
                5198
            ],
            [
                5198,
                5284
            ],
            [
                5284,
                5367
            ],
            [
                5367,
                5409
            ],
            [
                5409,
                5484
            ],
            [
                5484,
                5589
            ],
            [
                5589,
                5651
            ],
            [
                5651,
                5752
            ],
            [
                5752,
                5853
            ],
            [
                5853,
                5913
            ],
            [
                5913,
                6061
            ],
            [
                6061,
                6084
            ],
            [
                6084,
                6169
            ],
            [
                6169,
                6297
            ],
            [
                6297,
                6384
            ],
            [
                6384,
                6428
            ],
            [
                6428,
                6487
            ],
            [
                6487,
                6547
            ],
            [
                6547,
                6627
            ],
            [
                6627,
                6777
            ],
            [
                6777,
                6818
            ],
            [
                6818,
                6935
            ],
            [
                6935,
                7038
            ],
            [
                7038,
                7099
            ],
            [
                7099,
                7211
            ],
            [
                7211,
                7313
            ],
            [
                7313,
                7420
            ],
            [
                7420,
                7497
            ],
            [
                7497,
                7591
            ],
            [
                7591,
                7727
            ],
            [
                7727,
                7835
            ],
            [
                7835,
                7958
            ],
            [
                7958,
                8035
            ],
            [
                8035,
                8100
            ],
            [
                8100,
                8136
            ],
            [
                8136,
                8208
            ],
            [
                8208,
                8308
            ],
            [
                8308,
                8443
            ],
            [
                8443,
                8560
            ],
            [
                8560,
                8629
            ],
            [
                8629,
                8684
            ],
            [
                8684,
                8767
            ],
            [
                8767,
                8786
            ],
            [
                8786,
                8829
            ],
            [
                8829,
                8937
            ],
            [
                8937,
                8960
            ],
            [
                8960,
                9117
            ],
            [
                9117,
                9166
            ],
            [
                9166,
                9212
            ],
            [
                9212,
                9347
            ],
            [
                9347,
                9442
            ],
            [
                9442,
                9512
            ],
            [
                9512,
                9612
            ],
            [
                9612,
                9760
            ],
            [
                9760,
                9867
            ],
            [
                9867,
                9893
            ],
            [
                9893,
                9973
            ],
            [
                9973,
                10098
            ],
            [
                10098,
                10237
            ],
            [
                10237,
                10456
            ],
            [
                10456,
                10561
            ],
            [
                10561,
                10715
            ],
            [
                10715,
                10753
            ],
            [
                10753,
                10857
            ],
            [
                10857,
                10997
            ],
            [
                10997,
                11072
            ],
            [
                11072,
                11160
            ],
            [
                11160,
                11259
            ],
            [
                11259,
                11321
            ],
            [
                11321,
                11416
            ],
            [
                11416,
                11556
            ],
            [
                11556,
                11596
            ],
            [
                11596,
                11669
            ],
            [
                11669,
                11707
            ],
            [
                11707,
                11802
            ],
            [
                11802,
                11858
            ],
            [
                11858,
                11971
            ],
            [
                11971,
                12098
            ],
            [
                12098,
                12195
            ],
            [
                12195,
                12282
            ],
            [
                12282,
                12317
            ],
            [
                12317,
                12371
            ],
            [
                12371,
                12459
            ],
            [
                12459,
                12486
            ],
            [
                12486,
                12498
            ],
            [
                12498,
                12570
            ],
            [
                12570,
                12657
            ],
            [
                12657,
                12778
            ]
        ],
        "overlap_chars": [
            [
                0,
                20
            ],
            [
                21,
                32
            ],
            [
                33,
                83
            ],
            [
                83,
                103
            ],
            [
                104,
                289
            ],
            [
                289,
                291
            ],
            [
                291,
                333
            ],
            [
                333,
                363
            ],
            [
                363,
                389
            ],
            [
                398,
                401
            ],
            [
                401,
                479
            ],
            [
                479,
                498
            ],
            [
                498,
                533
            ],
            [
                533,
                568
            ],
            [
                575,
                577
            ],
            [
                577,
                602
            ],
            [
                602,
                656
            ],
            [
                657,
                662
            ],
            [
                662,
                664
            ],
            [
                665,
                718
            ],
            [
                722,
                737
            ],
            [
                737,
                738
            ],
            [
                739,
                761
            ],
            [
                762,
                807
            ],
            [
                808,
                812
            ],
            [
                816,
                856
            ],
            [
                863,
                889
            ],
            [
                889,
                891
            ],
            [
                891,
                907
            ],
            [
                908,
                913
            ],
            [
                914,
                972
            ],
            [
                972,
                973
            ],
            [
                983,
                1021
            ],
            [
                1021,
                1053
            ],
            [
                1058,
                1083
            ],
            [
                1089,
                1123
            ],
            [
                1123,
                1131
            ],
            [
                1137,
                1188
            ],
            [
                1189,
                1232
            ],
            [
                1232,
                1246
            ],
            [
                1247,
                1278
            ],
            [
                1279,
                1312
            ],
            [
                1312,
                1454
            ],
            [
                1455,
                1511
            ],
            [
                1522,
                1527
            ],
            [
                1527,
                1529
            ],
            [
                1529,
                1580
            ],
            [
                1581,
                1588
            ],
            [
                1589,
                1625
            ],
            [
                1626,
                1642
            ],
            [
                1642,
                1644
            ],
            [
                1644,
                1694
            ],
            [
                1695,
                1720
            ],
            [
                1727,
                1738
            ],
            [
                1738,
                1740
            ],
            [
                1740,
                1783
            ],
            [
                1783,
                1797
            ],
            [
                1800,
                1802
            ],
            [
                1802,
                1959
            ],
            [
                1959,
                1961
            ],
            [
                1961,
                2019
            ],
            [
                2019,
                2039
            ],
            [
                2066,
                2068
            ],
            [
                2069,
                2077
            ],
            [
                2077,
                2129
            ],
            [
                2130,
                2159
            ],
            [
                2159,
                2194
            ],
            [
                2194,
                2228
            ],
            [
                2229,
                2253
            ],
            [
                2254,
                2257
            ],
            [
                2261,
                2285
            ],
            [
                2291,
                2297
            ],
            [
                2297,
                2300
            ],
            [
                2301,
                2314
            ],
            [
                2314,
                2359
            ],
            [
                2359,
                2420
            ],
            [
                2428,
                2431
            ],
            [
                2431,
                2436
            ],
            [
                2445,
                2447
            ],
            [
                2452,
                2454
            ],
            [
                2454,
                2475
            ],
            [
                2475,
                2493
            ],
            [
                2498,
                2518
            ],
            [
                2518,
                2529
            ],
            [
                2529,
                2608
            ],
            [
                2608,
                2658
            ],
            [
                2660,
                2663
            ],
            [
                2664,
                2685
            ],
            [
                2685,
                2687
            ],
            [
                2687,
                2702
            ],
            [
                2703,
                2714
            ],
            [
                2751,
                2753
            ],
            [
                2753,
                2782
            ],
            [
                2790,
                2809
            ],
            [
                2822,
                2900
            ],
            [
                2901,
                2917
            ],
            [
                2917,
                2919
            ],
            [
                2919,
                2936
            ],
            [
                2936,
                2937
            ],
            [
                2941,
                2944
            ],
            [
                2945,
                2957
            ],
            [
                2958,
                2966
            ],
            [
                2967,
                2981
            ],
            [
                2981,
                2986
            ],
            [
                2992,
                3003
            ],
            [
                3004,
                3039
            ],
            [
                3039,
                3072
            ],
            [
                3073,
                3093
            ],
            [
                3094,
                3153
            ],
            [
                3163,
                3165
            ],
            [
                3175,
                3225
            ],
            [
                3234,
                3265
            ],
            [
                3265,
                3469
            ],
            [
                3470,
                3473
            ],
            [
                3474,
                3485
            ],
            [
                3486,
                3500
            ],
            [
                3500,
                3512
            ],
            [
                3513,
                3520
            ],
            [
                3521,
                3539
            ],
            [
                3539,
                3541
            ],
            [
                3549,
                3635
            ],
            [
                3636,
                3727
            ],
            [
                3734,
                3750
            ],
            [
                3750,
                3779
            ],
            [
                3779,
                3806
            ],
            [
                3806,
                3843
            ],
            [
                3843,
                3904
            ],
            [
                3909,
                3918
            ],
            [
                3918,
                3983
            ],
            [
                3983,
                4005
            ],
            [
                4005,
                4008
            ],
            [
                4008,
                4065
            ],
            [
                4065,
                4069
            ],
            [
                4070,
                4090
            ],
            [
                4090,
                4116
            ],
            [
                4122,
                4170
            ],
            [
                4173,
                4185
            ],
            [
                4186,
                4256
            ],
            [
                4256,
                4319
            ],
            [
                4319,
                4320
            ],
            [
                4324,
                4334
            ],
            [
                4335,
                4339
            ],
            [
                4347,
                4349
            ],
            [
                4361,
                4363
            ],
            [
                4363,
                4364
            ],
            [
                4364,
                4417
            ],
            [
                4418,
                4426
            ],
            [
                4427,
                4477
            ],
            [
                4482,
                4485
            ],
            [
                4485,
                4486
            ],
            [
                4486,
                4488
            ],
            [
                4498,
                4515
            ],
            [
                4516,
                4520
            ],
            [
                4521,
                4526
            ],
            [
                4527,
                4591
            ],
            [
                4592,
                4601
            ],
            [
                4601,
                4609
            ],
            [
                4610,
                4633
            ],
            [
                4642,
                4644
            ],
            [
                4644,
                4671
            ],
            [
                4672,
                4674
            ],
            [
                4680,
                4713
            ],
            [
                4714,
                4718
            ],
            [
                4719,
                4746
            ],
            [
                4746,
                4785
            ],
            [
                4796,
                4816
            ],
            [
                4817,
                4832
            ],
            [
                4842,
                4853
            ],
            [
                4853,
                4854
            ],
            [
                4855,
                4892
            ],
            [
                4893,
                4942
            ],
            [
                4942,
                5001
            ],
            [
                5002,
                5039
            ],
            [
                5044,
                5087
            ],
            [
                5090,
                5098
            ],
            [
                5098,
                5099
            ],
            [
                5100,
                5125
            ],
            [
                5126,
                5132
            ],
            [
                5133,
                5140
            ],
            [
                5145,
                5198
            ],
            [
                5198,
                5219
            ],
            [
                5237,
                5241
            ],
            [
                5242,
                5262
            ],
            [
                5263,
                5284
            ],
            [
                5288,
                5367
            ],
            [
                5367,
                5409
            ],
            [
                5409,
                5482
            ],
            [
                5482,
                5484
            ],
            [
                5484,
                5523
            ],
            [
                5524,
                5589
            ],
            [
                5589,
                5604
            ],
            [
                5607,
                5619
            ],
            [
                5620,
                5649
            ],
            [
                5651,
                5699
            ],
            [
                5699,
                5752
            ],
            [
                5752,
                5770
            ],
            [
                5778,
                5853
            ],
            [
                5853,
                5857
            ],
            [
                5858,
                5913
            ],
            [
                5913,
                5953
            ],
            [
                5957,
                5986
            ],
            [
                5991,
                5994
            ],
            [
                6001,
                6005
            ],
            [
                6006,
                6013
            ],
            [
                6014,
                6061
            ],
            [
                6061,
                6082
            ],
            [
                6082,
                6084
            ],
            [
                6084,
                6138
            ],
            [
                6143,
                6169
            ],
            [
                6169,
                6212
            ],
            [
                6212,
                6255
            ],
            [
                6260,
                6295
            ],
            [
                6295,
                6297
            ],
            [
                6297,
                6332
            ],
            [
                6335,
                6337
            ],
            [
                6338,
                6357
            ],
            [
                6362,
                6384
            ],
            [
                6384,
                6413
            ],
            [
                6422,
                6426
            ],
            [
                6426,
                6428
            ],
            [
                6428,
                6441
            ],
            [
                6445,
                6487
            ],
            [
                6491,
                6545
            ],
            [
                6545,
                6547
            ],
            [
                6547,
                6584
            ],
            [
                6585,
                6627
            ],
            [
                6627,
                6641
            ],
            [
                6642,
                6669
            ],
            [
                6675,
                6690
            ],
            [
                6694,
                6697
            ],
            [
                6703,
                6736
            ],
            [
                6737,
                6777
            ],
            [
                6777,
                6818
            ],
            [
                6818,
                6847
            ],
            [
                6850,
                6909
            ],
            [
                6910,
                6935
            ],
            [
                6935,
                6949
            ],
            [
                6950,
                6962
            ],
            [
                6963,
                6977
            ],
            [
                6978,
                6981
            ],
            [
                6982,
                6986
            ],
            [
                6987,
                6999
            ],
            [
                7000,
                7005
            ],
            [
                7012,
                7036
            ],
            [
                7036,
                7038
            ],
            [
                7038,
                7097
            ],
            [
                7097,
                7099
            ],
            [
                7099,
                7159
            ],
            [
                7164,
                7210
            ],
            [
                7211,
                7254
            ],
            [
                7254,
                7313
            ],
            [
                7313,
                7360
            ],
            [
                7361,
                7382
            ],
            [
                7387,
                7420
            ],
            [
                7420,
                7435
            ],
            [
                7436,
                7441
            ],
            [
                7442,
                7480
            ],
            [
                7481,
                7495
            ],
            [
                7495,
                7497
            ],
            [
                7497,
                7540
            ],
            [
                7544,
                7549
            ],
            [
                7550,
                7565
            ],
            [
                7566,
                7591
            ],
            [
                7591,
                7603
            ],
            [
                7612,
                7646
            ],
            [
                7646,
                7725
            ],
            [
                7725,
                7727
            ],
            [
                7727,
                7741
            ],
            [
                7742,
                7834
            ],
            [
                7835,
                7839
            ],
            [
                7846,
                7856
            ],
            [
                7863,
                7867
            ],
            [
                7868,
                7894
            ],
            [
                7897,
                7902
            ],
            [
                7903,
                7906
            ],
            [
                7907,
                7916
            ],
            [
                7917,
                7934
            ],
            [
                7935,
                7939
            ],
            [
                7940,
                7947
            ],
            [
                7948,
                7956
            ],
            [
                7956,
                7958
            ],
            [
                7958,
                8035
            ],
            [
                8035,
                8080
            ],
            [
                8081,
                8089
            ],
            [
                8097,
                8100
            ],
            [
                8100,
                8112
            ],
            [
                8123,
                8136
            ],
            [
                8139,
                8153
            ],
            [
                8154,
                8206
            ],
            [
                8208,
                8307
            ],
            [
                8308,
                8330
            ],
            [
                8334,
                8407
            ],
            [
                8408,
                8443
            ],
            [
                8443,
                8516
            ],
            [
                8517,
                8527
            ],
            [
                8536,
                8558
            ],
            [
                8558,
                8560
            ],
            [
                8560,
                8627
            ],
            [
                8627,
                8629
            ],
            [
                8629,
                8655
            ],
            [
                8657,
                8682
            ],
            [
                8682,
                8684
            ],
            [
                8684,
                8767
            ],
            [
                8767,
                8785
            ],
            [
                8786,
                8829
            ],
            [
                8829,
                8870
            ],
            [
                8871,
                8910
            ],
            [
                8911,
                8937
            ],
            [
                8937,
                8960
            ],
            [
                8960,
                9000
            ],
            [
                9003,
                9082
            ],
            [
                9090,
                9115
            ],
            [
                9115,
                9117
            ],
            [
                9121,
                9166
            ],
            [
                9166,
                9171
            ],
            [
                9172,
                9192
            ],
            [
                9193,
                9212
            ],
            [
                9212,
                9238
            ],
            [
                9239,
                9241
            ],
            [
                9242,
                9260
            ],
            [
                9261,
                9274
            ],
            [
                9275,
                9282
            ],
            [
                9283,
                9301
            ],
            [
                9301,
                9327
            ],
            [
                9328,
                9347
            ],
            [
                9347,
                9365
            ],
            [
                9372,
                9381
            ],
            [
                9382,
                9389
            ],
            [
                9395,
                9418
            ],
            [
                9428,
                9442
            ],
            [
                9442,
                9448
            ],
            [
                9456,
                9472
            ],
            [
                9473,
                9512
            ],
            [
                9512,
                9612
            ],
            [
                9612,
                9702
            ],
            [
                9702,
                9706
            ],
            [
                9713,
                9736
            ],
            [
                9749,
                9758
            ],
            [
                9758,
                9760
            ],
            [
                9760,
                9853
            ],
            [
                9865,
                9867
            ],
            [
                9867,
                9891
            ],
            [
                9891,
                9892
            ],
            [
                9893,
                9905
            ],
            [
                9906,
                9971
            ],
            [
                9971,
                9973
            ],
            [
                9973,
                10016
            ],
            [
                10016,
                10021
            ],
            [
                10027,
                10098
            ],
            [
                10098,
                10127
            ],
            [
                10128,
                10236
            ],
            [
                10237,
                10240
            ],
            [
                10241,
                10259
            ],
            [
                10260,
                10456
            ],
            [
                10456,
                10498
            ],
            [
                10505,
                10516
            ],
            [
                10517,
                10542
            ],
            [
                10547,
                10561
            ],
            [
                10561,
                10656
            ],
            [
                10656,
                10661
            ],
            [
                10662,
                10715
            ],
            [
                10715,
                10753
            ],
            [
                10753,
                10832
            ],
            [
                10832,
                10833
            ],
            [
                10841,
                10846
            ],
            [
                10850,
                10855
            ],
            [
                10855,
                10857
            ],
            [
                10857,
                10867
            ],
            [
                10914,
                10921
            ],
            [
                10922,
                10980
            ],
            [
                10981,
                10984
            ],
            [
                10985,
                10995
            ],
            [
                10995,
                10996
            ],
            [
                10997,
                11072
            ],
            [
                11072,
                11160
            ],
            [
                11160,
                11259
            ],
            [
                11259,
                11321
            ],
            [
                11321,
                11416
            ],
            [
                11416,
                11556
            ],
            [
                11556,
                11575
            ],
            [
                11576,
                11596
            ],
            [
                11596,
                11669
            ],
            [
                11669,
                11707
            ],
            [
                11707,
                11774
            ],
            [
                11785,
                11802
            ],
            [
                11802,
                11805
            ],
            [
                11806,
                11858
            ],
            [
                11858,
                11885
            ],
            [
                11890,
                11952
            ],
            [
                11953,
                11971
            ],
            [
                11971,
                11998
            ],
            [
                11999,
                12006
            ],
            [
                12007,
                12016
            ],
            [
                12029,
                12096
            ],
            [
                12096,
                12098
            ],
            [
                12098,
                12193
            ],
            [
                12193,
                12195
            ],
            [
                12195,
                12282
            ],
            [
                12282,
                12317
            ],
            [
                12317,
                12349
            ],
            [
                12349,
                12354
            ],
            [
                12355,
                12357
            ],
            [
                12362,
                12369
            ],
            [
                12369,
                12371
            ],
            [
                12371,
                12401
            ],
            [
                12401,
                12458
            ],
            [
                12459,
                12462
            ],
            [
                12463,
                12486
            ],
            [
                12486,
                12498
            ],
            [
                12498,
                12570
            ],
            [
                12570,
                12609
            ],
            [
                12619,
                12655
            ],
            [
                12655,
                12657
            ],
            [
                12657,
                12736
            ],
            [
                12737,
                12740
            ],
            [
                12740,
                12749
            ],
            [
                12750,
                12758
            ],
            [
                12767,
                12777
            ],
            [
                12777,
                12778
            ]
        ],
        "row_chars": [
            [
                0,
                83
            ],
            [
                83,
                83
            ],
            [
                83,
                291
            ],
            [
                291,
                333
            ],
            [
                333,
                363
            ],
            [
                363,
                401
            ],
            [
                401,
                479
            ],
            [
                479,
                498
            ],
            [
                498,
                533
            ],
            [
                533,
                577
            ],
            [
                577,
                577
            ],
            [
                577,
                577
            ],
            [
                577,
                577
            ],
            [
                577,
                577
            ],
            [
                577,
                577
            ],
            [
                577,
                577
            ],
            [
                577,
                602
            ],
            [
                602,
                665
            ],
            [
                665,
                739
            ],
            [
                739,
                891
            ],
            [
                891,
                1021
            ],
            [
                1021,
                1123
            ],
            [
                1123,
                1232
            ],
            [
                1232,
                1312
            ],
            [
                1312,
                1455
            ],
            [
                1455,
                1529
            ],
            [
                1529,
                1529
            ],
            [
                1529,
                1529
            ],
            [
                1529,
                1644
            ],
            [
                1644,
                1740
            ],
            [
                1740,
                1802
            ],
            [
                1802,
                1961
            ],
            [
                1961,
                2019
            ],
            [
                2019,
                2077
            ],
            [
                2077,
                2159
            ],
            [
                2159,
                2194
            ],
            [
                2194,
                2297
            ],
            [
                2297,
                2314
            ],
            [
                2314,
                2359
            ],
            [
                2359,
                2454
            ],
            [
                2454,
                2475
            ],
            [
                2475,
                2518
            ],
            [
                2518,
                2529
            ],
            [
                2529,
                2608
            ],
            [
                2608,
                2608
            ],
            [
                2608,
                2608
            ],
            [
                2608,
                2608
            ],
            [
                2608,
                2687
            ],
            [
                2687,
                2753
            ],
            [
                2753,
                2919
            ],
            [
                2919,
                3039
            ],
            [
                3039,
                3073
            ],
            [
                3073,
                3165
            ],
            [
                3165,
                3265
            ],
            [
                3265,
                3500
            ],
            [
                3500,
                3539
            ],
            [
                3539,
                3636
            ],
            [
                3636,
                3750
            ],
            [
                3750,
                3779
            ],
            [
                3779,
                3806
            ],
            [
                3806,
                3843
            ],
            [
                3843,
                3918
            ],
            [
                3918,
                3983
            ],
            [
                3983,
                4008
            ],
            [
                4008,
                4065
            ],
            [
                4065,
                4090
            ],
            [
                4090,
                4173
            ],
            [
                4173,
                4173
            ],
            [
                4173,
                4256
            ],
            [
                4256,
                4363
            ],
            [
                4363,
                4485
            ],
            [
                4485,
                4516
            ],
            [
                4516,
                4516
            ],
            [
                4516,
                4601
            ],
            [
                4601,
                4644
            ],
            [
                4644,
                4746
            ],
            [
                4746,
                4942
            ],
            [
                4942,
                4942
            ],
            [
                4942,
                5040
            ],
            [
                5040,
                5198
            ],
            [
                5198,
                5284
            ],
            [
                5284,
                5284
            ],
            [
                5284,
                5367
            ],
            [
                5367,
                5409
            ],
            [
                5409,
                5409
            ],
            [
                5409,
                5484
            ],
            [
                5484,
                5589
            ],
            [
                5589,
                5651
            ],
            [
                5651,
                5752
            ],
            [
                5752,
                5853
            ],
            [
                5853,
                5913
            ],
            [
                5913,
                6061
            ],
            [
                6061,
                6084
            ],
            [
                6084,
                6169
            ],
            [
                6169,
                6297
            ],
            [
                6297,
                6384
            ],
            [
                6384,
                6428
            ],
            [
                6428,
                6487
            ],
            [
                6487,
                6547
            ],
            [
                6547,
                6547
            ],
            [
                6547,
                6627
            ],
            [
                6627,
                6777
            ],
            [
                6777,
                6818
            ],
            [
                6818,
                6935
            ],
            [
                6935,
                7038
            ],
            [
                7038,
                7099
            ],
            [
                7099,
                7211
            ],
            [
                7211,
                7313
            ],
            [
                7313,
                7420
            ],
            [
                7420,
                7497
            ],
            [
                7497,
                7591
            ],
            [
                7591,
                7727
            ],
            [
                7727,
                7835
            ],
            [
                7835,
                7835
            ],
            [
                7835,
                7835
            ],
            [
                7835,
                7958
            ],
            [
                7958,
                8035
            ],
            [
                8035,
                8100
            ],
            [
                8100,
                8136
            ],
            [
                8136,
                8208
            ],
            [
                8208,
                8308
            ],
            [
                8308,
                8443
            ],
            [
                8443,
                8560
            ],
            [
                8560,
                8629
            ],
            [
                8629,
                8684
            ],
            [
                8684,
                8767
            ],
            [
                8767,
                8786
            ],
            [
                8786,
                8829
            ],
            [
                8829,
                8937
            ],
            [
                8937,
                8960
            ],
            [
                8960,
                8960
            ],
            [
                8960,
                9117
            ],
            [
                9117,
                9117
            ],
            [
                9117,
                9166
            ],
            [
                9166,
                9212
            ],
            [
                9212,
                9347
            ],
            [
                9347,
                9442
            ],
            [
                9442,
                9512
            ],
            [
                9512,
                9512
            ],
            [
                9512,
                9612
            ],
            [
                9612,
                9760
            ],
            [
                9760,
                9867
            ],
            [
                9867,
                9893
            ],
            [
                9893,
                9973
            ],
            [
                9973,
                10098
            ],
            [
                10098,
                10237
            ],
            [
                10237,
                10456
            ],
            [
                10456,
                10561
            ],
            [
                10561,
                10715
            ],
            [
                10715,
                10753
            ],
            [
                10753,
                10857
            ],
            [
                10857,
                10857
            ],
            [
                10857,
                10857
            ],
            [
                10857,
                10857
            ],
            [
                10857,
                10857
            ],
            [
                10857,
                10997
            ],
            [
                10997,
                11072
            ],
            [
                11072,
                11160
            ],
            [
                11160,
                11259
            ],
            [
                11259,
                11321
            ],
            [
                11321,
                11416
            ],
            [
                11416,
                11416
            ],
            [
                11416,
                11416
            ],
            [
                11416,
                11556
            ],
            [
                11556,
                11596
            ],
            [
                11596,
                11669
            ],
            [
                11669,
                11707
            ],
            [
                11707,
                11707
            ],
            [
                11707,
                11802
            ],
            [
                11802,
                11858
            ],
            [
                11858,
                11971
            ],
            [
                11971,
                12098
            ],
            [
                12098,
                12195
            ],
            [
                12195,
                12282
            ],
            [
                12282,
                12317
            ],
            [
                12317,
                12371
            ],
            [
                12371,
                12459
            ],
            [
                12459,
                12486
            ],
            [
                12486,
                12498
            ],
            [
                12498,
                12570
            ],
            [
                12570,
                12570
            ],
            [
                12570,
                12657
            ],
            [
                12657,
                12778
            ]
        ]
    }
}