{
    "original": {
        "text": "Gentle reader, do you remember Lady Monk's party, and how it ended,--how it ended, at least as regards those special guests with whom we are concerned? Mr. Palliser went away early, Mrs. Marsham followed him to his house in Park Lane, caught him at home, and told her tale. He returned to his wife, found her sitting with Burgo in the dining-room, under the Argus eyes of the constant Bott, and bore her away home. Burgo disappeared utterly from the scene, and Mr. Bott, complaining inwardly that virtue was too frequently allowed to be its own reward, comforted himself with champagne, and then walked off to his lodgings. Lady Monk, when Mr. Palliser made his way into her room up-stairs, seeking his wife's scarf,--which little incident, also, the reader may perhaps remember,--saw that the game was up, and thought with regret of the loss of her two hundred pounds. Such was the ending of Lady Monk's party.\nLady Glencora, on her journey home in the carriage with her husband, had openly suggested that Mrs. Marsham had gone to Park Lane to tell of her doings with Burgo, and had declared her resolution never again to see either that lady or Mr. Bott in her own house. This she said with more of defiance in her tone than Mr. Palliser had ever hitherto heard. He was by nature less ready than her, and knowing his own deficiency in that respect, abstained from all answer on the subject. Indeed, during that drive home very few further words were spoken between them. \"I will breakfast with you to-morrow,\" he said to her, as she prepared to go up-stairs. \"I have work still to do to-night, and I will not disturb you by coming to your room.\"\n\"You won't want me to be very early?\" said his wife.\n\"No,\" said he, with more of anger in his voice than he had yet shown. \"What hour will suit you? I must say something of what has occurred to-night before I leave you to-morrow.\"\n\"I don't know what you can have got to say about to-night, but I'll be down by half-past eleven, if that will do?\" Mr. Palliser said that he would make it do, and then they parted.\nLady Glencora had played her part very well before her husband. She had declined to be frightened by him; had been the first to mention Burgo's name, and had done so with no tremor in her voice, and had boldly declared her irreconcilable enmity to the male and female duennas who had dared to take her in charge. While she was in the carriage with her husband she felt some triumph in her own strength; and as she wished him good night on the staircase, and slowly walked up to her room, without having once lowered her eyes before his, something of this consciousness of triumph still supported her. And even while her maid remained with her she held herself up, as it were, inwardly, telling herself that she would not yield,--that she would not be cowed either by her husband or by his spies. But when she was left alone all her triumph departed from her.\nShe bade her maid go while she was still sitting in her dressing-gown; and when the girl was gone she got close over the fire, sitting with her slippers on the fender, with her elbows on her knees, and her face resting on her hands. In this position she remained for an hour, with her eyes fixed on the altering shapes of the hot coals. During this hour her spirit was by no means defiant, and her thoughts of herself anything but triumphant. Mr. Bott and Mrs. Marsham she had forgotten altogether. After all, they were but buzzing flies, who annoyed her by their presence. Should she choose to leave her husband, they could not prevent her leaving him. It was of her husband and of Burgo that she was thinking,--weighing them one against the other, and connecting her own existence with theirs, not as expecting joy or the comfort of love from either of them, but with an assured conviction that on either side there must be misery for her. But of that shame before all the world which must be hers for ever, should she break her vows and consent to live with a man who was not her husband, she thought hardly at all. That which in the estimation of Alice was everything, to her, at this moment, was almost nothing. For herself, she had been sacrificed; and,--as she told herself with bitter denunciations against herself,--had been sacrificed through her own weakness. But that was done. Whatever way she might go, she was lost. They had married her to a man who cared nothing for a wife, nothing for any woman,--so at least she declared to herself,--but who had wanted a wife that he might have an heir. Had it been given to her to have a child, she thought that she might have been happy,--sufficiently happy in sharing her husband's joy in that respect. But everything had gone against her. There was nothing in her home to give her comfort. \"He looks at me every time he sees me as the cause of his misfortune,\" she said to herself. Of her husband's rank, of the future possession of his title and his estates, she thought much. But of her own wealth she thought nothing. It did not occur to her that she had given him enough in that respect to make his marriage with her a comfort to him. She took it for granted that that marriage was now one distasteful to him, as it was to herself, and that he would eventually be the gainer if she should so conduct herself that her marriage might be dissolved.\n[Illustration: Lady Glencora.]\nAs to Burgo, I doubt whether she deceived herself much as to his character. She knew well enough that he was a man infinitely less worthy than her husband. She knew that he was a spendthrift, idle, given to bad courses,--that he drank, that he gambled, that he lived the life of the loosest man about the town. She knew also that whatever chance she might have had to redeem him, had she married him honestly before all the world, there could be no such chance if she went to him as his mistress, abandoning her husband and all her duties, and making herself vile in the eyes of all women. Burgo Fitzgerald would not be influenced for good by such a woman as she would then be. She knew much of the world and its ways, and told herself no lies about this. But, as I have said before, she did not count herself for much. What though she were ruined? What though Burgo were false, mean, and untrustworthy? She loved him, and he was the only man she ever had loved! Lower and lower she crouched before the fire; and then, when the coals were no longer red, and the shapes altered themselves no more, she crept into bed. As to what she should say to her husband on the following morning,--she had not yet begun to think of that.\nExactly at half-past eleven she entered the little breakfast parlour which looked out over the park. It was the prettiest room in the house, and now, at this springtide, when the town trees were putting out their earliest greens, and were fresh and bright almost as country trees, it might be hard to find a prettier chamber. Mr. Palliser was there already, sitting with the morning paper in his hand. He rose when she entered, and, coming up to her, just touched her with his lips. She put her cheek up to him, and then took her place at the breakfast table.\n\"Have you any headache this morning?\" he asked.\n\"Oh, no,\" she said. Then he took his tea and his toast, spoke some word to her about the fineness of the weather, told her some scraps of news, and soon returned to the absorbing interest of a speech made by the leader of the Opposition in the House of Lords. The speech was very interesting to Mr. Palliser, because in it the noble lord alluded to a break-up in the present Cabinet, as to which the rumours were, he said, so rife through the country as to have destroyed all that feeling of security in the existing Government which the country so much valued and desired. Mr. Palliser had as yet heard no official tidings of such a rupture; but if such rupture were to take place, it must be in his favour. He felt himself at this moment to be full of politics,--to be near the object of his ambition, to have affairs upon his hands which required all his attention. Was it absolutely incumbent on him to refer again to the incidents of last night? The doing so would be odious to him. The remembrance of the task now immediately before him destroyed all his political satisfaction. He did not believe that his wife was in any serious danger. Might it not yet be possible for him to escape from the annoyance, and to wash his mind clean of all suspicion? He was not jealous; he was indeed incapable of jealousy. He knew what it would be to be dishonoured, and he knew that under certain circumstances the world would expect him to exert himself in a certain way. But the thing that he had now to do was a great trouble to him. He would rather have to address the House of Commons with ten columns of figures than utter a word of remonstrance to his wife. But she had defied him,--defied him by saying that she would see his friends no more; and it was the remembrance of this, as he sat behind his newspaper, that made him ultimately feel that he could not pass in silence over what had been done.\nNevertheless, he went on reading, or pretending to read, as long as the continuance of the breakfast made it certain that his wife would remain with him. Every now and then he said some word to her of what he was reading, endeavouring to use the tone of voice that was customary to him in his domestic teachings of politics. But through it all there was a certain hesitation,--there were the sure signs of an attempt being made, of which he was himself conscious, and which she understood with the most perfect accuracy. He was deferring the evil moment, and vainly endeavouring to make himself believe that he was comfortably employed the while. She had no newspaper, and made no endeavour to deceive herself. She, therefore, was the first to begin the conversation.\n\"Plantagenet,\" she said, \"you told me last night, as I was going to bed, that you had something to say about Lady Monk's party.\"\nHe put down the newspaper slowly, and turned towards her. \"Yes, my dear. After what happened, I believe that I must say something.\"\n\"If you think anything, pray say it,\" said Glencora.\n\"It is not always easy for a man to show what he thinks by what he says,\" he replied. \"My fear is that you should suppose me to think more than I do. And it was for that reason that I determined to sleep on it before I spoke to you.\"\n\"If anybody is angry with me I'd much rather they should have it out with me while their anger is hot. I hate cold anger.\"\n\"But I am not angry.\"\n\"That's what husbands always say when they're going to scold.\"\n\"But I am not going to scold. I am only going to advise you.\"\n\"I'd sooner be scolded. Advice is to anger just what cold anger is to hot.\"\n\"But, my dear Glencora, surely if I find it necessary to speak--\"\n\"I don't want to stop you, Plantagenet. Pray, go on. Only it will be so nice to have it over.\"\nHe was now more than ever averse to the task before him. Husbands, when they give their wives a talking, should do it out of hand, uttering their words hard, sharp, and quick,--and should then go. There are some works that won't bear a preface, and this work of marital fault-finding is one of them. Mr. Palliser was already beginning to find out the truth of this. \"Glencora,\" he said, \"I wish you to be serious with me.\"\n\"I am very serious,\" she replied, as she settled herself in her chair with an air of mockery, while her eyes and mouth were bright and eloquent with a spirit which her husband did not love to see. Poor girl! There was seriousness enough in store for her before she would be able to leave the room.\n\"You ought to be serious. Do you know why Mrs. Marsham came here from Lady Monk's last night?\"\n\"Of course I do. She came to tell you that I was waltzing with Burgo Fitzgerald. You might as well ask me whether I knew why Mr. Bott was standing at all the doors, glaring at me.\"\n\"I don't know anything about Mr. Bott.\"\n\"I know something about him though,\" she said, again moving herself in her chair.\n\"I am speaking now of Mrs. Marsham.\"\n\"You should speak of them both together as they hunt in couples.\"\n\"Glencora, will you listen to me, or will you not? If you say that you will not, I shall know what to do.\"\n\"I don't think you would, Plantagenet.\" And she nodded her little head at him, as she spoke. \"I'm sure I don't know what you would do. But I will listen to you. Only, as I said before, it will be very nice when it's over.\"\n\"Mrs. Marsham came here, not simply to tell me that you were waltzing with Mr. Fitzgerald,--and I wish that when you mention his name you would call him Mr. Fitzgerald.\"\n\"So I do.\"\n\"You generally prefix his Christian name, which it would be much better that you should omit.\"\n\"I will try,\" she said, very gently; \"but it's hard to drop an old habit. Before you married me you knew that I had learned to call him Burgo.\"\n\"Let me go on,\" said Mr. Palliser.\n\"Oh, certainly.\"\n\"It was not simply to tell me that you were waltzing that Mrs. Marsham came here.\"\n\"And it was not simply to see me waltzing that Mr. Bott stood in the doorways, for he followed me about, and came down after me to the supper-room.\"\n\"Glencora, will you oblige me by not speaking of Mr. Bott?\"\n\"I wish you would oblige me by not speaking of Mrs. Marsham.\" Mr. Palliser rose quickly from his chair with a gesture of anger, stood upright for half a minute, and then sat down again. \"I beg your pardon, Plantagenet,\" she said. \"I think I know what you want, and I'll hold my tongue till you bid me speak.\"\n\"Mrs. Marsham came here because she saw that every one in the room was regarding you with wonder.\" Lady Glencora twisted herself about in her chair, but she said nothing. \"She saw that you were not only dancing with Mr. Fitzgerald, but that you were dancing with him,--what shall I say?\"\n\"Upon my word I can't tell you.\"\n\"Recklessly.\"\n\"Oh! recklessly, was I? What was I reckless of?\"\n\"Reckless of what people might say; reckless of what I might feel about it; reckless of your own position.\"\n\"Am I to speak now?\"\n\"Perhaps you had better let me go on. I think she was right to come to me.\"\n\"That's of course. What's the good of having spies, if they don't run and tell as soon as they see anything, especially anything--reckless.\"\n\"Glencora, you are determined to make me angry. I am angry now,--very angry. I have employed no spies. When rumours have reached me, not from spies, as you choose to call them, but through your dearest friends and mine--\"\n\"What do you mean by rumours from my dearest friends?\"\n\"Never mind. Let me go on.\"\n\"No; not when you say my dear friends have spread rumours about me. Tell me who they are. I have no dear friends. Do you mean Alice Vavasor?\"\n\"It does not signify. But when I was warned that you had better not go to any house in which you could meet that man, I would not listen to it. I said that you were my wife, and that as such I could trust you anywhere, everywhere, with any person. Others might distrust you, but I would not do so. When I wished you to go to Monkshade, were there to be any spies there? When I left you last night at Lady Monk's, do you believe in your heart that I trusted to Mrs. Marsham's eyes rather than to your own truth? Do you think that I have lived in fear of Mr. Fitzgerald?\"\n\"No, Plantagenet; I do not think so.\"\n\"Do you believe that I have commissioned Mr. Bott to watch your conduct? Answer me, Glencora.\"\nShe paused a moment, thinking what actually was her true belief on that subject. \"He does watch me, certainly,\" she said.\n\"That does not answer my question. Do you believe that I have commissioned him to do so?\"\n\"No; I do not.\"\n\"Then it is ignoble in you to talk to me of spies. I have employed no spies. If it were ever to come to that, that I thought spies necessary, it would be all over with me.\"\nThere was something of feeling in his voice as he said this,--something that almost approached to passion which touched his wife's heart. Whether or not spies would be of any avail, she knew that she had in truth done that of which he had declared that he had never suspected her. She had listened to words of love from her former lover. She had received, and now carried about with her a letter from this man, in which he asked her to elope with him. She had by no means resolved that she would not do this thing. She had been false to her husband; and as her husband spoke of his confidence in her, her own spirit rebelled against the deceit which she herself was practising.\n\"I know that I have never made you happy,\" she said. \"I know that I never can make you happy.\"\nHe looked at her, struck by her altered tone, and saw that her whole manner and demeanour were changed. \"I do not understand what you mean,\" he said. \"I have never complained. You have not made me unhappy.\" He was one of those men to whom this was enough. If his wife caused him no uneasiness, what more was he to expect from her? No doubt she might have done much more for him. She might have given him an heir. But he was a just man, and knew that the blank he had drawn was his misfortune, and not her fault.\nBut now her heart was loosed and she spoke out, at first slowly, but after a while with all the quietness of strong passion. \"No, Plantagenet; I shall never make you happy. You have never loved me, nor I you. We have never loved each other for a single moment. I have been wrong to talk to you about spies; I was wrong to go to Lady Monk's; I have been wrong in everything that I have done; but never so wrong as when I let them persuade me to be your wife!\"\n\"Glencora!\"\n\"Let me speak now, Plantagenet, It is better that I should tell you everything; and I will. I will tell you everything;--everything! I do love Burgo Fitzgerald. I do! I do! I do! How can I help loving him? Have I not loved him from the first,--before I had seen you? Did you not know that it was so? I do love Burgo Fitzgerald, and when I went to Lady Monk's last night, I had almost made up my mind that I must tell him so, and that I must go away with him and hide myself. But when he came to speak to me--\"\n\"He has asked you to go with him, then?\" said the husband, in whose bosom the poison was beginning to take effect, thereby showing that he was neither above nor below humanity.\nGlencora was immediately reminded that though she might, if she pleased, tell her own secrets, she ought not, in accordance with her ideas of honour, tell those of her lover. \"What need is there of asking, do you think, when people have loved each other as we have done?\"\n\"You wanted to go with him, then?\"\n\"Would it not have been the best for you? Plantagenet, I do not love you;--not as women love their husbands when they do love them. But, before God, my first wish is to free you from the misfortune that I have brought on you.\" As she made this attestation she started up from her chair, and coming close to him, took him by the coat. He was startled, and stepped back a pace, but did not speak; and then stood looking at her as she went on.\n[Illustration: \"Before God, my first wish is to free you from the misfortune that I have brought on you.\"]\n\"What matters it whether I drown myself, or throw myself away by going with such a one as him, so that you might marry again, and have a child? I'd die;--I'd die willingly. How I wish I could die! Plantagenet, I would kill myself if I dared.\"\nHe was a tall man and she was short of stature, so that he stood over her and looked upon her, and now she was looking up into his face with all her eyes. \"I would,\" she said. \"I would--I would! What is there left for me that I should wish to live?\"\nSoftly, slowly, very gradually, as though he were afraid of what he was doing, he put his arm round her waist. \"You are wrong in one thing,\" he said. \"I do love you.\"\nShe shook her head, touching his breast with her hair as she did so.\n\"I do love you,\" he repeated. \"If you mean that I am not apt at telling you so, it is true, I know. My mind is running on other things.\"\n\"Yes,\" she said; \"your mind is running on other things.\"\n\"But I do love you. If you cannot love me, it is a great misfortune to us both. But we need not therefore be disgraced. As for that other thing of which you spoke,--of our having, as yet, no child\"--and in saying this he pressed her somewhat closer with his arm--\"you allow yourself to think too much of it;--much more of it than I do. I have made no complaints on that head, even within my own breast.\"\n\"I know what your thoughts are, Plantagenet.\"\n\"Believe me that you wrong my thoughts. Of course I have been anxious, and have, perhaps, shown my anxiety by the struggle I have made to hide it. I have never told you what is false, Glencora.\"\n\"No; you are not false!\"\n\"I would rather have you for my wife, childless,--if you will try to love me,--than any other woman, though another might give me an heir. Will you try to love me?\"\nShe was silent. At this moment, after the confession that she had made, she could not bring herself to say that she would even try. Had she said so, she would have seemed to have accepted his forgiveness too easily.\n\"I think, dear,\" he said, still holding her by her waist, \"that we had better leave England for a while. I will give up politics for this season. Should you like to go to Switzerland for the summer, or perhaps to some of the German baths, and then on to Italy when the weather is cold enough?\" Still she was silent. \"Perhaps your friend, Miss Vavasor, would go with us?\"\nHe was killing her by his goodness. She could not speak to him yet; but now, as he mentioned Alice's name, she gently put up her hand and rested it on the back of his.\nAt that moment there came a knock at the door;--a sharp knock, which was quickly repeated.\n\"Come in,\" said Mr. Palliser, dropping his arm from his wife's waist, and standing away from her a few yards.",
        "paragraph_chars": [
            [
                0,
                912
            ],
            [
                912,
                1648
            ],
            [
                1648,
                1701
            ],
            [
                1701,
                1879
            ],
            [
                1879,
                2060
            ],
            [
                2060,
                2919
            ],
            [
                2919,
                5326
            ],
            [
                5326,
                5357
            ],
            [
                5357,
                6582
            ],
            [
                6582,
                7142
            ],
            [
                7142,
                7190
            ],
            [
                7190,
                9090
            ],
            [
                9090,
                9858
            ],
            [
                9858,
                9987
            ],
            [
                9987,
                10119
            ],
            [
                10119,
                10172
            ],
            [
                10172,
                10406
            ],
            [
                10406,
                10529
            ],
            [
                10529,
                10551
            ],
            [
                10551,
                10614
            ],
            [
                10614,
                10676
            ],
            [
                10676,
                10752
            ],
            [
                10752,
                10818
            ],
            [
                10818,
                10913
            ],
            [
                10913,
                11336
            ],
            [
                11336,
                11634
            ],
            [
                11634,
                11729
            ],
            [
                11729,
                11910
            ],
            [
                11910,
                11950
            ],
            [
                11950,
                12032
            ],
            [
                12032,
                12069
            ],
            [
                12069,
                12135
            ],
            [
                12135,
                12242
            ],
            [
                12242,
                12465
            ],
            [
                12465,
                12635
            ],
            [
                12635,
                12646
            ],
            [
                12646,
                12741
            ],
            [
                12741,
                12885
            ],
            [
                12885,
                12920
            ],
            [
                12920,
                12937
            ],
            [
                12937,
                13020
            ],
            [
                13020,
                13169
            ],
            [
                13169,
                13229
            ],
            [
                13229,
                13538
            ],
            [
                13538,
                13826
            ],
            [
                13826,
                13859
            ],
            [
                13859,
                13873
            ],
            [
                13873,
                13922
            ],
            [
                13922,
                14030
            ],
            [
                14030,
                14051
            ],
            [
                14051,
                14127
            ],
            [
                14127,
                14268
            ],
            [
                14268,
                14490
            ],
            [
                14490,
                14545
            ],
            [
                14545,
                14573
            ],
            [
                14573,
                14715
            ],
            [
                14715,
                15285
            ],
            [
                15285,
                15323
            ],
            [
                15323,
                15418
            ],
            [
                15418,
                15540
            ],
            [
                15540,
                15630
            ],
            [
                15630,
                15646
            ],
            [
                15646,
                15819
            ],
            [
                15819,
                16497
            ],
            [
                16497,
                16592
            ],
            [
                16592,
                17104
            ],
            [
                17104,
                17563
            ],
            [
                17563,
                17575
            ],
            [
                17575,
                18085
            ],
            [
                18085,
                18262
            ],
            [
                18262,
                18534
            ],
            [
                18534,
                18569
            ],
            [
                18569,
                19010
            ],
            [
                19010,
                19117
            ],
            [
                19117,
                19360
            ],
            [
                19360,
                19610
            ],
            [
                19610,
                19777
            ],
            [
                19777,
                19846
            ],
            [
                19846,
                19983
            ],
            [
                19983,
                20040
            ],
            [
                20040,
                20444
            ],
            [
                20444,
                20490
            ],
            [
                20490,
                20685
            ],
            [
                20685,
                20710
            ],
            [
                20710,
                20875
            ],
            [
                20875,
                21091
            ],
            [
                21091,
                21462
            ],
            [
                21462,
                21630
            ],
            [
                21630,
                21721
            ],
            [
                21721,
                21830
            ]
        ],
        "segment_chars": [
            [
                0,
                152
            ],
            [
                152,
                274
            ],
            [
                274,
                415
            ],
            [
                415,
                624
            ],
            [
                624,
                870
            ],
            [
                870,
                912
            ],
            [
                912,
                1174
            ],
            [
                1174,
                1265
            ],
            [
                1265,
                1393
            ],
            [
                1393,
                1473
            ],
            [
                1473,
                1561
            ],
            [
                1561,
                1648
            ],
            [
                1648,
                1686
            ],
            [
                1686,
                1701
            ],
            [
                1701,
                1771
            ],
            [
                1771,
                1797
            ],
            [
                1797,
                1879
            ],
            [
                1879,
                1994
            ],
            [
                1994,
                2060
            ],
            [
                2060,
                2124
            ],
            [
                2124,
                2373
            ],
            [
                2373,
                2661
            ],
            [
                2661,
                2856
            ],
            [
                2856,
                2919
            ],
            [
                2919,
                3152
            ],
            [
                3152,
                3256
            ],
            [
                3256,
                3362
            ],
            [
                3362,
                3418
            ],
            [
                3418,
                3493
            ],
            [
                3493,
                3573
            ],
            [
                3573,
                3861
            ],
            [
                3861,
                4038
            ],
            [
                4038,
                4136
            ],
            [
                4136,
                4290
            ],
            [
                4290,
                4309
            ],
            [
                4309,
                4350
            ],
            [
                4350,
                4526
            ],
            [
                4526,
                4678
            ],
            [
                4678,
                4715
            ],
            [
                4715,
                4766
            ],
            [
                4766,
                4858
            ],
            [
                4858,
                4954
            ],
            [
                4954,
                4997
            ],
            [
                4997,
                5115
            ],
            [
                5115,
                5326
            ],
            [
                5326,
                5357
            ],
            [
                5357,
                5433
            ],
            [
                5433,
                5513
            ],
            [
                5513,
                5668
            ],
            [
                5668,
                5947
            ],
            [
                5947,
                6035
            ],
            [
                6035,
                6113
            ],
            [
                6113,
                6177
            ],
            [
                6177,
                6206
            ],
            [
                6206,
                6261
            ],
            [
                6261,
                6320
            ],
            [
                6320,
                6474
            ],
            [
                6474,
                6582
            ],
            [
                6582,
                6683
            ],
            [
                6683,
                6908
            ],
            [
                6908,
                6984
            ],
            [
                6984,
                7065
            ],
            [
                7065,
                7142
            ],
            [
                7142,
                7180
            ],
            [
                7180,
                7190
            ],
            [
                7190,
                7210
            ],
            [
                7210,
                7450
            ],
            [
                7450,
                7764
            ],
            [
                7764,
                7899
            ],
            [
                7899,
                8059
            ],
            [
                8059,
                8141
            ],
            [
                8141,
                8178
            ],
            [
                8178,
                8275
            ],
            [
                8275,
                8335
            ],
            [
                8335,
                8447
            ],
            [
                8447,
                8504
            ],
            [
                8504,
                8655
            ],
            [
                8655,
                8719
            ],
            [
                8719,
                8847
            ],
            [
                8847,
                9090
            ],
            [
                9090,
                9244
            ],
            [
                9244,
                9415
            ],
            [
                9415,
                9611
            ],
            [
                9611,
                9737
            ],
            [
                9737,
                9801
            ],
            [
                9801,
                9858
            ],
            [
                9858,
                9987
            ],
            [
                9987,
                10045
            ],
            [
                10045,
                10060
            ],
            [
                10060,
                10119
            ],
            [
                10119,
                10172
            ],
            [
                10172,
                10258
            ],
            [
                10258,
                10322
            ],
            [
                10322,
                10406
            ],
            [
                10406,
                10509
            ],
            [
                10509,
                10529
            ],
            [
                10529,
                10551
            ],
            [
                10551,
                10614
            ],
            [
                10614,
                10644
            ],
            [
                10644,
                10676
            ],
            [
                10676,
                10700
            ],
            [
                10700,
                10752
            ],
            [
                10752,
                10818
            ],
            [
                10818,
                10858
            ],
            [
                10858,
                10871
            ],
            [
                10871,
                10913
            ],
            [
                10913,
                10970
            ],
            [
                10970,
                11110
            ],
            [
                11110,
                11213
            ],
            [
                11213,
                11279
            ],
            [
                11279,
                11336
            ],
            [
                11336,
                11533
            ],
            [
                11533,
                11544
            ],
            [
                11544,
                11634
            ],
            [
                11634,
                11660
            ],
            [
                11660,
                11729
            ],
            [
                11729,
                11746
            ],
            [
                11746,
                11810
            ],
            [
                11810,
                11910
            ],
            [
                11910,
                11950
            ],
            [
                11950,
                12032
            ],
            [
                12032,
                12069
            ],
            [
                12069,
                12135
            ],
            [
                12135,
                12186
            ],
            [
                12186,
                12242
            ],
            [
                12242,
                12282
            ],
            [
                12282,
                12335
            ],
            [
                12335,
                12377
            ],
            [
                12377,
                12403
            ],
            [
                12403,
                12465
            ],
            [
                12465,
                12635
            ],
            [
                12635,
                12646
            ],
            [
                12646,
                12741
            ],
            [
                12741,
                12815
            ],
            [
                12815,
                12885
            ],
            [
                12885,
                12920
            ],
            [
                12920,
                12937
            ],
            [
                12937,
                13020
            ],
            [
                13020,
                13169
            ],
            [
                13169,
                13229
            ],
            [
                13229,
                13291
            ],
            [
                13291,
                13415
            ],
            [
                13415,
                13459
            ],
            [
                13459,
                13538
            ],
            [
                13538,
                13637
            ],
            [
                13637,
                13709
            ],
            [
                13709,
                13826
            ],
            [
                13826,
                13859
            ],
            [
                13859,
                13873
            ],
            [
                13873,
                13878
            ],
            [
                13878,
                13897
            ],
            [
                13897,
                13922
            ],
            [
                13922,
                14030
            ],
            [
                14030,
                14051
            ],
            [
                14051,
                14089
            ],
            [
                14089,
                14127
            ],
            [
                14127,
                14146
            ],
            [
                14146,
                14268
            ],
            [
                14268,
                14316
            ],
            [
                14316,
                14345
            ],
            [
                14345,
                14371
            ],
            [
                14371,
                14490
            ],
            [
                14490,
                14545
            ],
            [
                14545,
                14558
            ],
            [
                14558,
                14573
            ],
            [
                14573,
                14641
            ],
            [
                14641,
                14663
            ],
            [
                14663,
                14687
            ],
            [
                14687,
                14715
            ],
            [
                14715,
                14737
            ],
            [
                14737,
                14859
            ],
            [
                14859,
                14963
            ],
            [
                14963,
                15013
            ],
            [
                15013,
                15085
            ],
            [
                15085,
                15226
            ],
            [
                15226,
                15285
            ],
            [
                15285,
                15323
            ],
            [
                15323,
                15396
            ],
            [
                15396,
                15418
            ],
            [
                15418,
                15499
            ],
            [
                15499,
                15540
            ],
            [
                15540,
                15575
            ],
            [
                15575,
                15630
            ],
            [
                15630,
                15646
            ],
            [
                15646,
                15697
            ],
            [
                15697,
                15723
            ],
            [
                15723,
                15819
            ],
            [
                15819,
                15957
            ],
            [
                15957,
                16100
            ],
            [
                16100,
                16157
            ],
            [
                16157,
                16271
            ],
            [
                16271,
                16334
            ],
            [
                16334,
                16497
            ],
            [
                16497,
                16550
            ],
            [
                16550,
                16592
            ],
            [
                16592,
                16696
            ],
            [
                16696,
                16742
            ],
            [
                16742,
                16768
            ],
            [
                16768,
                16799
            ],
            [
                16799,
                16848
            ],
            [
                16848,
                16923
            ],
            [
                16923,
                16971
            ],
            [
                16971,
                17005
            ],
            [
                17005,
                17104
            ],
            [
                17104,
                17229
            ],
            [
                17229,
                17277
            ],
            [
                17277,
                17313
            ],
            [
                17313,
                17365
            ],
            [
                17365,
                17563
            ],
            [
                17563,
                17575
            ],
            [
                17575,
                17667
            ],
            [
                17667,
                17708
            ],
            [
                17708,
                17736
            ],
            [
                17736,
                17742
            ],
            [
                17742,
                17748
            ],
            [
                17748,
                17754
            ],
            [
                17754,
                17781
            ],
            [
                17781,
                17842
            ],
            [
                17842,
                17875
            ],
            [
                17875,
                18050
            ],
            [
                18050,
                18085
            ],
            [
                18085,
                18126
            ],
            [
                18126,
                18262
            ],
            [
                18262,
                18437
            ],
            [
                18437,
                18534
            ],
            [
                18534,
                18569
            ],
            [
                18569,
                18611
            ],
            [
                18611,
                18701
            ],
            [
                18701,
                18796
            ],
            [
                18796,
                18903
            ],
            [
                18903,
                19010
            ],
            [
                19010,
                19117
            ],
            [
                19117,
                19261
            ],
            [
                19261,
                19290
            ],
            [
                19290,
                19314
            ],
            [
                19314,
                19360
            ],
            [
                19360,
                19515
            ],
            [
                19515,
                19536
            ],
            [
                19536,
                19555
            ],
            [
                19555,
                19610
            ],
            [
                19610,
                19721
            ],
            [
                19721,
                19760
            ],
            [
                19760,
                19777
            ],
            [
                19777,
                19846
            ],
            [
                19846,
                19876
            ],
            [
                19876,
                19946
            ],
            [
                19946,
                19983
            ],
            [
                19983,
                20040
            ],
            [
                20040,
                20060
            ],
            [
                20060,
                20120
            ],
            [
                20120,
                20160
            ],
            [
                20160,
                20376
            ],
            [
                20376,
                20444
            ],
            [
                20444,
                20490
            ],
            [
                20490,
                20530
            ],
            [
                20530,
                20637
            ],
            [
                20637,
                20685
            ],
            [
                20685,
                20710
            ],
            [
                20710,
                20849
            ],
            [
                20849,
                20875
            ],
            [
                20875,
                20891
            ],
            [
                20891,
                21007
            ],
            [
                21007,
                21091
            ],
            [
                21091,
                21196
            ],
            [
                21196,
                21237
            ],
            [
                21237,
                21385
            ],
            [
                21385,
                21407
            ],
            [
                21407,
                21462
            ],
            [
                21462,
                21498
            ],
            [
                21498,
                21630
            ],
            [
                21630,
                21721
            ],
            [
                21721,
                21830
            ]
        ],
        "overlap_chars": [
            [
                0,
                66
            ],
            [
                150,
                152
            ],
            [
                152,
                181
            ],
            [
                182,
                233
            ],
            [
                255,
                274
            ],
            [
                274,
                357
            ],
            [
                369,
                371
            ],
            [
                385,
                415
            ],
            [
                415,
                432
            ],
            [
                455,
                469
            ],
            [
                553,
                624
            ],
            [
                624,
                633
            ],
            [
                781,
                870
            ],
            [
                870,
                892
            ],
            [
                905,
                912
            ],
            [
                912,
                984
            ],
            [
                1084,
                1133
            ],
            [
                1007,
                1019
            ],
            [
                1144,
                1174
            ],
            [
                1174,
                1197
            ],
            [
                1201,
                1248
            ],
            [
                1258,
                1265
            ],
            [
                1265,
                1292
            ],
            [
                1293,
                1306
            ],
            [
                1370,
                1376
            ],
            [
                1391,
                1393
            ],
            [
                1393,
                1418
            ],
            [
                1424,
                1432
            ],
            [
                1441,
                1458
            ],
            [
                1471,
                1472
            ],
            [
                1473,
                1499
            ],
            [
                1509,
                1519
            ],
            [
                1526,
                1549
            ],
            [
                1559,
                1561
            ],
            [
                1561,
                1585
            ],
            [
                1594,
                1648
            ],
            [
                1648,
                1686
            ],
            [
                1686,
                1701
            ],
            [
                1701,
                1725
            ],
            [
                1729,
                1771
            ],
            [
                1771,
                1797
            ],
            [
                1797,
                1817
            ],
            [
                1848,
                1866
            ],
            [
                1876,
                1879
            ],
            [
                1879,
                1910
            ],
            [
                1915,
                1921
            ],
            [
                1936,
                1993
            ],
            [
                1994,
                2016
            ],
            [
                2031,
                2033
            ],
            [
                2020,
                2025
            ],
            [
                2036,
                2060
            ],
            [
                2060,
                2124
            ],
            [
                2124,
                2164
            ],
            [
                2253,
                2282
            ],
            [
                2298,
                2307
            ],
            [
                2210,
                2213
            ],
            [
                2371,
                2373
            ],
            [
                2420,
                2547
            ],
            [
                2610,
                2661
            ],
            [
                2856,
                2919
            ],
            [
                2919,
                2939
            ],
            [
                2990,
                2993
            ],
            [
                2946,
                2949
            ],
            [
                3025,
                3045
            ],
            [
                3054,
                3086
            ],
            [
                3092,
                3152
            ],
            [
                3152,
                3221
            ],
            [
                3249,
                3256
            ],
            [
                3313,
                3325
            ],
            [
                3337,
                3362
            ],
            [
                3388,
                3405
            ],
            [
                3364,
                3387
            ],
            [
                3406,
                3418
            ],
            [
                3573,
                3629
            ],
            [
                3641,
                3718
            ],
            [
                3722,
                3770
            ],
            [
                3778,
                3788
            ],
            [
                3800,
                3860
            ],
            [
                3861,
                3899
            ],
            [
                3927,
                3928
            ],
            [
                3936,
                3939
            ],
            [
                3929,
                3935
            ],
            [
                3940,
                3958
            ],
            [
                3970,
                4038
            ],
            [
                4116,
                4134
            ],
            [
                4092,
                4098
            ],
            [
                4134,
                4136
            ],
            [
                4136,
                4177
            ],
            [
                4180,
                4186
            ],
            [
                4187,
                4199
            ],
            [
                4264,
                4289
            ],
            [
                4290,
                4309
            ],
            [
                4309,
                4350
            ],
            [
                4350,
                4431
            ],
            [
                4434,
                4436
            ],
            [
                4446,
                4469
            ],
            [
                4472,
                4483
            ],
            [
                4491,
                4497
            ],
            [
                4498,
                4526
            ],
            [
                4526,
                4529
            ],
            [
                4559,
                4610
            ],
            [
                4676,
                4678
            ],
            [
                4715,
                4765
            ],
            [
                4766,
                4767
            ],
            [
                4793,
                4858
            ],
            [
                4858,
                4894
            ],
            [
                4906,
                4954
            ],
            [
                4954,
                4997
            ],
            [
                4997,
                5050
            ],
            [
                5067,
                5087
            ],
            [
                5097,
                5115
            ],
            [
                5115,
                5143
            ],
            [
                5149,
                5165
            ],
            [
                5170,
                5261
            ],
            [
                5312,
                5326
            ],
            [
                5357,
                5359
            ],
            [
                5363,
                5369
            ],
            [
                5433,
                5471
            ],
            [
                5407,
                5411
            ],
            [
                5483,
                5513
            ],
            [
                5513,
                5533
            ],
            [
                5549,
                5553
            ],
            [
                5536,
                5547
            ],
            [
                5578,
                5592
            ],
            [
                5601,
                5609
            ],
            [
                5618,
                5657
            ],
            [
                5662,
                5668
            ],
            [
                5668,
                5686
            ],
            [
                5703,
                5706
            ],
            [
                5794,
                5799
            ],
            [
                5725,
                5735
            ],
            [
                5818,
                5895
            ],
            [
                5945,
                5947
            ],
            [
                5947,
                6035
            ],
            [
                6035,
                6038
            ],
            [
                6080,
                6112
            ],
            [
                6113,
                6177
            ],
            [
                6177,
                6206
            ],
            [
                6206,
                6228
            ],
            [
                6246,
                6261
            ],
            [
                6261,
                6303
            ],
            [
                6309,
                6312
            ],
            [
                6304,
                6308
            ],
            [
                6313,
                6320
            ],
            [
                6320,
                6405
            ],
            [
                6452,
                6474
            ],
            [
                6474,
                6540
            ],
            [
                6542,
                6582
            ],
            [
                6582,
                6625
            ],
            [
                6626,
                6683
            ],
            [
                6908,
                6984
            ],
            [
                6984,
                7065
            ],
            [
                7065,
                7142
            ],
            [
                7142,
                7180
            ],
            [
                7180,
                7190
            ],
            [
                7190,
                7210
            ],
            [
                7210,
                7234
            ],
            [
                7239,
                7251
            ],
            [
                7257,
                7261
            ],
            [
                7269,
                7450
            ],
            [
                7450,
                7573
            ],
            [
                7580,
                7585
            ],
            [
                7590,
                7602
            ],
            [
                7616,
                7620
            ],
            [
                7762,
                7764
            ],
            [
                7764,
                7780
            ],
            [
                7788,
                7805
            ],
            [
                7814,
                7839
            ],
            [
                7853,
                7899
            ],
            [
                7899,
                7914
            ],
            [
                7955,
                8058
            ],
            [
                8094,
                8141
            ],
            [
                8145,
                8178
            ],
            [
                8275,
                8335
            ],
            [
                8447,
                8504
            ],
            [
                8504,
                8653
            ],
            [
                8655,
                8719
            ],
            [
                8719,
                8734
            ],
            [
                8743,
                8847
            ],
            [
                8847,
                8865
            ],
            [
                8879,
                8943
            ],
            [
                8963,
                8967
            ],
            [
                9001,
                9014
            ],
            [
                9026,
                9053
            ],
            [
                9065,
                9069
            ],
            [
                9054,
                9064
            ],
            [
                9088,
                9090
            ],
            [
                9090,
                9114
            ],
            [
                9127,
                9145
            ],
            [
                9242,
                9244
            ],
            [
                9244,
                9311
            ],
            [
                9325,
                9331
            ],
            [
                9379,
                9382
            ],
            [
                9336,
                9349
            ],
            [
                9413,
                9415
            ],
            [
                9415,
                9418
            ],
            [
                9434,
                9464
            ],
            [
                9493,
                9495
            ],
            [
                9519,
                9583
            ],
            [
                9593,
                9611
            ],
            [
                9611,
                9617
            ],
            [
                9628,
                9643
            ],
            [
                9735,
                9737
            ],
            [
                9801,
                9858
            ],
            [
                9858,
                9906
            ],
            [
                9931,
                9987
            ],
            [
                9987,
                10045
            ],
            [
                10045,
                10058
            ],
            [
                10119,
                10172
            ],
            [
                10172,
                10258
            ],
            [
                10258,
                10322
            ],
            [
                10322,
                10406
            ],
            [
                10406,
                10509
            ],
            [
                10509,
                10529
            ],
            [
                10529,
                10551
            ],
            [
                10551,
                10614
            ],
            [
                10614,
                10644
            ],
            [
                10644,
                10676
            ],
            [
                10676,
                10700
            ],
            [
                10700,
                10752
            ],
            [
                10752,
                10814
            ],
            [
                10818,
                10858
            ],
            [
                10858,
                10871
            ],
            [
                10871,
                10913
            ],
            [
                10913,
                10970
            ],
            [
                11110,
                11212
            ],
            [
                11279,
                11336
            ],
            [
                11336,
                11368
            ],
            [
                11406,
                11532
            ],
            [
                11634,
                11660
            ],
            [
                11660,
                11729
            ],
            [
                11729,
                11746
            ],
            [
                11746,
                11810
            ],
            [
                11810,
                11910
            ],
            [
                11910,
                11947
            ],
            [
                12033,
                12046
            ],
            [
                12051,
                12069
            ],
            [
                12069,
                12094
            ],
            [
                12100,
                12135
            ],
            [
                12135,
                12167
            ],
            [
                12184,
                12186
            ],
            [
                12186,
                12242
            ],
            [
                12242,
                12282
            ],
            [
                12282,
                12335
            ],
            [
                12377,
                12401
            ],
            [
                12465,
                12554
            ],
            [
                12557,
                12635
            ],
            [
                12635,
                12646
            ],
            [
                12646,
                12660
            ],
            [
                12668,
                12741
            ],
            [
                12741,
                12815
            ],
            [
                12815,
                12885
            ],
            [
                12885,
                12919
            ],
            [
                12937,
                13020
            ],
            [
                13020,
                13133
            ],
            [
                13139,
                13169
            ],
            [
                13169,
                13229
            ],
            [
                13229,
                13290
            ],
            [
                13291,
                13414
            ],
            [
                13415,
                13459
            ],
            [
                13459,
                13460
            ],
            [
                13494,
                13538
            ],
            [
                13538,
                13582
            ],
            [
                13593,
                13637
            ],
            [
                13637,
                13666
            ],
            [
                13673,
                13709
            ],
            [
                13709,
                13804
            ],
            [
                13807,
                13826
            ],
            [
                13826,
                13859
            ],
            [
                13859,
                13873
            ],
            [
                13873,
                13878
            ],
            [
                13878,
                13897
            ],
            [
                13897,
                13922
            ],
            [
                13922,
                14027
            ],
            [
                14089,
                14127
            ],
            [
                14127,
                14128
            ],
            [
                14135,
                14146
            ],
            [
                14146,
                14255
            ],
            [
                14265,
                14268
            ],
            [
                14268,
                14316
            ],
            [
                14316,
                14331
            ],
            [
                14333,
                14345
            ],
            [
                14345,
                14371
            ],
            [
                14371,
                14486
            ],
            [
                14490,
                14545
            ],
            [
                14545,
                14558
            ],
            [
                14558,
                14573
            ],
            [
                14573,
                14641
            ],
            [
                14641,
                14663
            ],
            [
                14687,
                14715
            ],
            [
                14715,
                14727
            ],
            [
                14735,
                14737
            ],
            [
                14737,
                14859
            ],
            [
                14859,
                14963
            ],
            [
                14963,
                15013
            ],
            [
                15013,
                15085
            ],
            [
                15085,
                15226
            ],
            [
                15226,
                15285
            ],
            [
                15285,
                15323
            ],
            [
                15323,
                15396
            ],
            [
                15396,
                15418
            ],
            [
                15418,
                15499
            ],
            [
                15499,
                15540
            ],
            [
                15540,
                15575
            ],
            [
                15575,
                15630
            ],
            [
                15630,
                15646
            ],
            [
                15646,
                15697
            ],
            [
                15697,
                15723
            ],
            [
                15723,
                15754
            ],
            [
                15786,
                15819
            ],
            [
                15819,
                15879
            ],
            [
                15925,
                15957
            ],
            [
                16001,
                16031
            ],
            [
                16108,
                16157
            ],
            [
                16157,
                16173
            ],
            [
                16206,
                16271
            ],
            [
                16271,
                16321
            ],
            [
                16332,
                16334
            ],
            [
                16334,
                16451
            ],
            [
                16456,
                16462
            ],
            [
                16495,
                16497
            ],
            [
                16497,
                16550
            ],
            [
                16550,
                16592
            ],
            [
                16592,
                16667
            ],
            [
                16687,
                16696
            ],
            [
                16696,
                16742
            ],
            [
                16742,
                16768
            ],
            [
                16768,
                16798
            ],
            [
                16799,
                16848
            ],
            [
                16848,
                16923
            ],
            [
                16923,
                16931
            ],
            [
                16971,
                17005
            ],
            [
                17005,
                17041
            ],
            [
                17065,
                17104
            ],
            [
                17104,
                17132
            ],
            [
                17137,
                17172
            ],
            [
                17187,
                17229
            ],
            [
                17229,
                17277
            ],
            [
                17277,
                17313
            ],
            [
                17313,
                17365
            ],
            [
                17365,
                17563
            ],
            [
                17563,
                17575
            ],
            [
                17575,
                17605
            ],
            [
                17607,
                17667
            ],
            [
                17708,
                17736
            ],
            [
                17736,
                17742
            ],
            [
                17742,
                17748
            ],
            [
                17754,
                17768
            ],
            [
                17779,
                17781
            ],
            [
                17781,
                17817
            ],
            [
                17819,
                17842
            ],
            [
                17842,
                17875
            ],
            [
                17875,
                18050
            ],
            [
                18050,
                18081
            ],
            [
                18085,
                18126
            ],
            [
                18126,
                18142
            ],
            [
                18260,
                18262
            ],
            [
                18262,
                18317
            ],
            [
                18335,
                18370
            ],
            [
                18412,
                18437
            ],
            [
                18437,
                18534
            ],
            [
                18534,
                18569
            ],
            [
                18569,
                18611
            ],
            [
                18611,
                18641
            ],
            [
                18648,
                18676
            ],
            [
                18699,
                18701
            ],
            [
                18701,
                18796
            ],
            [
                18796,
                18802
            ],
            [
                18808,
                18812
            ],
            [
                18825,
                18903
            ],
            [
                18903,
                18918
            ],
            [
                18943,
                18967
            ],
            [
                18973,
                19010
            ],
            [
                19117,
                19261
            ],
            [
                19271,
                19290
            ],
            [
                19290,
                19314
            ],
            [
                19314,
                19360
            ],
            [
                19360,
                19395
            ],
            [
                19406,
                19429
            ],
            [
                19450,
                19515
            ],
            [
                19515,
                19536
            ],
            [
                19536,
                19537
            ],
            [
                19546,
                19555
            ],
            [
                19555,
                19610
            ],
            [
                19610,
                19721
            ],
            [
                19721,
                19760
            ],
            [
                19760,
                19777
            ],
            [
                19777,
                19846
            ],
            [
                19846,
                19876
            ],
            [
                19876,
                19946
            ],
            [
                19946,
                19983
            ],
            [
                19983,
                20040
            ],
            [
                20040,
                20060
            ],
            [
                20060,
                20120
            ],
            [
                20120,
                20160
            ],
            [
                20160,
                20183
            ],
            [
                20208,
                20237
            ],
            [
                20239,
                20301
            ],
            [
                20303,
                20347
            ],
            [
                20349,
                20376
            ],
            [
                20376,
                20420
            ],
            [
                20441,
                20444
            ],
            [
                20444,
                20490
            ],
            [
                20490,
                20501
            ],
            [
                20528,
                20530
            ],
            [
                20530,
                20637
            ],
            [
                20637,
                20685
            ],
            [
                20685,
                20710
            ],
            [
                20710,
                20757
            ],
            [
                20760,
                20786
            ],
            [
                20789,
                20849
            ],
            [
                20849,
                20875
            ],
            [
                20875,
                20891
            ],
            [
                20891,
                20912
            ],
            [
                20917,
                20927
            ],
            [
                20945,
                21007
            ],
            [
                21007,
                21091
            ],
            [
                21091,
                21196
            ],
            [
                21196,
                21237
            ],
            [
                21237,
                21303
            ],
            [
                21312,
                21322
            ],
            [
                21328,
                21338
            ],
            [
                21342,
                21385
            ],
            [
                21385,
                21407
            ],
            [
                21407,
                21462
            ],
            [
                21462,
                21498
            ],
            [
                21498,
                21630
            ],
            [
                21630,
                21675
            ],
            [
                21678,
                21702
            ],
            [
                21711,
                21721
            ],
            [
                21721,
                21817
            ],
            [
                21829,
                21830
            ]
        ],
        "row_chars": [
            [
                0,
                152
            ],
            [
                152,
                274
            ],
            [
                274,
                415
            ],
            [
                415,
                624
            ],
            [
                624,
                870
            ],
            [
                870,
                912
            ],
            [
                912,
                1174
            ],
            [
                1174,
                1265
            ],
            [
                1265,
                1393
            ],
            [
                1393,
                1473
            ],
            [
                1473,
                1561
            ],
            [
                1561,
                1648
            ],
            [
                1648,
                1686
            ],
            [
                1686,
                1701
            ],
            [
                1701,
                1771
            ],
            [
                1771,
                1797
            ],
            [
                1797,
                1879
            ],
            [
                1879,
                1994
            ],
            [
                1994,
                2060
            ],
            [
                2060,
                2124
            ],
            [
                2124,
                2373
            ],
            [
                2373,
                2661
            ],
            [
                2661,
                2856
            ],
            [
                2856,
                2919
            ],
            [
                2919,
                3152
            ],
            [
                3152,
                3256
            ],
            [
                3256,
                3362
            ],
            [
                3362,
                3418
            ],
            [
                3418,
                3493
            ],
            [
                3493,
                3573
            ],
            [
                3573,
                3861
            ],
            [
                3861,
                4038
            ],
            [
                4038,
                4136
            ],
            [
                4136,
                4290
            ],
            [
                4290,
                4309
            ],
            [
                4309,
                4350
            ],
            [
                4350,
                4526
            ],
            [
                4526,
                4678
            ],
            [
                4678,
                4715
            ],
            [
                4715,
                4766
            ],
            [
                4766,
                4858
            ],
            [
                4858,
                4954
            ],
            [
                4954,
                4997
            ],
            [
                4997,
                5115
            ],
            [
                5115,
                5326
            ],
            [
                5326,
                5357
            ],
            [
                5357,
                5513
            ],
            [
                5513,
                5668
            ],
            [
                5668,
                5947
            ],
            [
                5947,
                6035
            ],
            [
                6035,
                6113
            ],
            [
                6113,
                6177
            ],
            [
                6177,
                6206
            ],
            [
                6206,
                6261
            ],
            [
                6261,
                6320
            ],
            [
                6320,
                6474
            ],
            [
                6474,
                6582
            ],
            [
                6582,
                6683
            ],
            [
                6683,
                6908
            ],
            [
                6908,
                6984
            ],
            [
                6984,
                7065
            ],
            [
                7065,
                7142
            ],
            [
                7142,
                7180
            ],
            [
                7180,
                7190
            ],
            [
                7190,
                7210
            ],
            [
                7210,
                7450
            ],
            [
                7450,
                7764
            ],
            [
                7764,
                7899
            ],
            [
                7899,
                8059
            ],
            [
                8059,
                8141
            ],
            [
                8141,
                8178
            ],
            [
                8178,
                8275
            ],
            [
                8275,
                8335
            ],
            [
                8335,
                8447
            ],
            [
                8447,
                8504
            ],
            [
                8504,
                8655
            ],
            [
                8655,
                8719
            ],
            [
                8719,
                8847
            ],
            [
                8847,
                9090
            ],
            [
                9090,
                9244
            ],
            [
                9244,
                9415
            ],
            [
                9415,
                9611
            ],
            [
                9611,
                9737
            ],
            [
                9737,
                9801
            ],
            [
                9801,
                9858
            ],
            [
                9858,
                9987
            ],
            [
                9987,
                10045
            ],
            [
                10045,
                10060
            ],
            [
                10060,
                10119
            ],
            [
                10119,
                10172
            ],
            [
                10172,
                10258
            ],
            [
                10258,
                10322
            ],
            [
                10322,
                10406
            ],
            [
                10406,
                10509
            ],
            [
                10509,
                10529
            ],
            [
                10529,
                10551
            ],
            [
                10551,
                10614
            ],
            [
                10614,
                10644
            ],
            [
                10644,
                10676
            ],
            [
                10676,
                10700
            ],
            [
                10700,
                10752
            ],
            [
                10752,
                10818
            ],
            [
                10818,
                10858
            ],
            [
                10858,
                10871
            ],
            [
                10871,
                10913
            ],
            [
                10913,
                10970
            ],
            [
                10970,
                11110
            ],
            [
                11110,
                11213
            ],
            [
                11213,
                11279
            ],
            [
                11279,
                11336
            ],
            [
                11336,
                11533
            ],
            [
                11533,
                11544
            ],
            [
                11544,
                11634
            ],
            [
                11634,
                11660
            ],
            [
                11660,
                11729
            ],
            [
                11729,
                11746
            ],
            [
                11746,
                11810
            ],
            [
                11810,
                11910
            ],
            [
                11910,
                11950
            ],
            [
                11950,
                12032
            ],
            [
                12032,
                12069
            ],
            [
                12069,
                12135
            ],
            [
                12135,
                12186
            ],
            [
                12186,
                12242
            ],
            [
                12242,
                12282
            ],
            [
                12282,
                12335
            ],
            [
                12335,
                12377
            ],
            [
                12377,
                12403
            ],
            [
                12403,
                12465
            ],
            [
                12465,
                12635
            ],
            [
                12635,
                12646
            ],
            [
                12646,
                12741
            ],
            [
                12741,
                12815
            ],
            [
                12815,
                12885
            ],
            [
                12885,
                12920
            ],
            [
                12920,
                12937
            ],
            [
                12937,
                13020
            ],
            [
                13020,
                13169
            ],
            [
                13169,
                13229
            ],
            [
                13229,
                13291
            ],
            [
                13291,
                13415
            ],
            [
                13415,
                13459
            ],
            [
                13459,
                13538
            ],
            [
                13538,
                13637
            ],
            [
                13637,
                13709
            ],
            [
                13709,
                13826
            ],
            [
                13826,
                13859
            ],
            [
                13859,
                13873
            ],
            [
                13873,
                13878
            ],
            [
                13878,
                13897
            ],
            [
                13897,
                13922
            ],
            [
                13922,
                14030
            ],
            [
                14030,
                14051
            ],
            [
                14051,
                14089
            ],
            [
                14089,
                14127
            ],
            [
                14127,
                14146
            ],
            [
                14146,
                14268
            ],
            [
                14268,
                14316
            ],
            [
                14316,
                14345
            ],
            [
                14345,
                14371
            ],
            [
                14371,
                14490
            ],
            [
                14490,
                14545
            ],
            [
                14545,
                14558
            ],
            [
                14558,
                14573
            ],
            [
                14573,
                14641
            ],
            [
                14641,
                14663
            ],
            [
                14663,
                14687
            ],
            [
                14687,
                14715
            ],
            [
                14715,
                14737
            ],
            [
                14737,
                14859
            ],
            [
                14859,
                14963
            ],
            [
                14963,
                15013
            ],
            [
                15013,
                15085
            ],
            [
                15085,
                15226
            ],
            [
                15226,
                15285
            ],
            [
                15285,
                15323
            ],
            [
                15323,
                15396
            ],
            [
                15396,
                15418
            ],
            [
                15418,
                15499
            ],
            [
                15499,
                15540
            ],
            [
                15540,
                15575
            ],
            [
                15575,
                15630
            ],
            [
                15630,
                15646
            ],
            [
                15646,
                15697
            ],
            [
                15697,
                15723
            ],
            [
                15723,
                15819
            ],
            [
                15819,
                15957
            ],
            [
                15957,
                16157
            ],
            [
                16157,
                16271
            ],
            [
                16271,
                16334
            ],
            [
                16334,
                16497
            ],
            [
                16497,
                16550
            ],
            [
                16550,
                16592
            ],
            [
                16592,
                16696
            ],
            [
                16696,
                16742
            ],
            [
                16742,
                16768
            ],
            [
                16768,
                16799
            ],
            [
                16799,
                16848
            ],
            [
                16848,
                16923
            ],
            [
                16923,
                17005
            ],
            [
                17005,
                17104
            ],
            [
                17104,
                17229
            ],
            [
                17229,
                17277
            ],
            [
                17277,
                17313
            ],
            [
                17313,
                17365
            ],
            [
                17365,
                17563
            ],
            [
                17563,
                17575
            ],
            [
                17575,
                17667
            ],
            [
                17667,
                17708
            ],
            [
                17708,
                17736
            ],
            [
                17736,
                17742
            ],
            [
                17742,
                17748
            ],
            [
                17748,
                17754
            ],
            [
                17754,
                17781
            ],
            [
                17781,
                17842
            ],
            [
                17842,
                17875
            ],
            [
                17875,
                18050
            ],
            [
                18050,
                18085
            ],
            [
                18085,
                18126
            ],
            [
                18126,
                18262
            ],
            [
                18262,
                18437
            ],
            [
                18437,
                18534
            ],
            [
                18534,
                18569
            ],
            [
                18569,
                18611
            ],
            [
                18611,
                18701
            ],
            [
                18701,
                18796
            ],
            [
                18796,
                18903
            ],
            [
                18903,
                19010
            ],
            [
                19010,
                19117
            ],
            [
                19117,
                19261
            ],
            [
                19261,
                19290
            ],
            [
                19290,
                19314
            ],
            [
                19314,
                19360
            ],
            [
                19360,
                19515
            ],
            [
                19515,
                19536
            ],
            [
                19536,
                19555
            ],
            [
                19555,
                19610
            ],
            [
                19610,
                19721
            ],
            [
                19721,
                19760
            ],
            [
                19760,
                19777
            ],
            [
                19777,
                19846
            ],
            [
                19846,
                19876
            ],
            [
                19876,
                19946
            ],
            [
                19946,
                19983
            ],
            [
                19983,
                20040
            ],
            [
                20040,
                20060
            ],
            [
                20060,
                20120
            ],
            [
                20120,
                20160
            ],
            [
                20160,
                20376
            ],
            [
                20376,
                20444
            ],
            [
                20444,
                20490
            ],
            [
                20490,
                20530
            ],
            [
                20530,
                20637
            ],
            [
                20637,
                20685
            ],
            [
                20685,
                20710
            ],
            [
                20710,
                20849
            ],
            [
                20849,
                20875
            ],
            [
                20875,
                20891
            ],
            [
                20891,
                21007
            ],
            [
                21007,
                21091
            ],
            [
                21091,
                21196
            ],
            [
                21196,
                21237
            ],
            [
                21237,
                21385
            ],
            [
                21385,
                21407
            ],
            [
                21407,
                21462
            ],
            [
                21462,
                21498
            ],
            [
                21498,
                21630
            ],
            [
                21630,
                21721
            ],
            [
                21721,
                21830
            ]
        ]
    },
    "abridged": {
        "text": "Gentle reader, do you remember Lady Monk's party, and how it ended? Mr. Palliser went away early, and Mrs. Marsham followed him to his house in Park Lane and told her tale. He returned to his wife, found her sitting with Burgo in the dining-room, under the eye of Mr. Bott, and bore her away home. Burgo disappeared, and Mr. Bott comforted himself with champagne, and then walked off to his lodgings. Lady Monk saw that the game was up, and thought with regret of the loss of her two hundred pounds. Such was the ending of her party.\nLady Glencora, on her journey home in the carriage with her husband, had declared her resolution never again to see either Mrs. Marsham or Mr. Bott in her own house. This she said with more defiance in her tone than Mr. Palliser had ever heard. He was by nature less ready with words than her, and did not answer. Indeed, during that drive very few words were spoken.\n\"I will breakfast with you tomorrow,\" he said, as she prepared to go upstairs. \"I have work still to do tonight, and I will not disturb you by coming to your room.\"\n\"You won't want me to be very early?\" said his wife.\n\"No,\" said he, with more anger in his voice than he had yet shown. \"What hour will suit you? I must say something about tonight before I leave you tomorrow.\"\n\"I don't know what you can have to say, but I'll be down by half-past eleven, if that will do?\"\nMr. Palliser said that it would, and then they parted.\nLady Glencora had played her part very well before her husband. She had declined to be frightened by him, and had boldly declared her enmity to Mrs. Marsham and Mr. Bott. She felt some triumph in her own strength; and as she wished him good night on the staircase, and slowly walked up to her room, this consciousness of triumph still supported her. But when she was left alone all her triumph departed from her.\nShe bade her maid go, and then she sat close over the fire, with her slippers on the fender, her elbows on her knees, and her face resting on her hands. In this position she remained for an hour, with her eyes fixed on the coals. Her thoughts were anything but triumphant. She had forgotten Mr. Bott and Mrs. Marsham altogether. It was of her husband and of Burgo that she was thinking - weighing them one against the other, and connecting her own existence with theirs, not expecting joy or the comfort of love from either, but with a conviction that on either side there must be misery for her.\nBut of that shame before all the world, if she should break her vows and live with a man who was not her husband, she thought hardly at all. It was almost nothing to her. For herself, she had been sacrificed; and - as she bitterly told herself - through her own weakness.\nBut that was done. Whatever way she might go, she was lost. They had married her to a man who cared nothing for a wife, nothing for any woman - so she declared to herself - but who had needed a wife so that he might have an heir. If she had had a child, she thought that she might have been happy enough. But there was nothing in her home to give her comfort.\n\"He sees me as the cause of his misfortune,\" she said to herself. Of her husband's rank, of the future of his title and his estates, she thought much. But of her own wealth she thought nothing. It did not occur to her that she had given him enough wealth to make his marriage a comfort to him. She took it for granted that the marriage was now distasteful to him, as it was to herself, and that he would eventually be the gainer if she led it to be dissolved.\nAs for Burgo, she knew well enough that he was a man much less worthy than her husband. She knew that he was an idle spendthrift - that he drank, gambled, and lived the life of the loosest man about town. She knew also that she could not redeem him if she went to him as his mistress, abandoning her husband and all her duties. Burgo Fitzgerald would not be influenced for good by such a woman as she would then be. She told herself no lies about this.\nBut, as I have said before, she did not count herself for much. What though she were ruined? What though Burgo were untrustworthy? She loved him, and he was the only man she had ever loved! Lower and lower she crouched before the fire; and then, when the coals were no longer glowing, she crept into bed. As to what she should say to her husband on the following morning, she had not yet begun to think of that.\nExactly at half-past eleven she entered the pretty little breakfast parlour which looked out over the park. Mr. Palliser was there already, sitting with the morning paper in his hand. He rose when she entered, and, coming up to her, just touched her with his lips. She put her cheek up to him, and then took her place at the breakfast table.\n\"Have you any headache this morning?\" he asked.\n\"Oh, no,\" she said. Then he took his tea and toast, spoke a word about the fineness of the weather, told her some scraps of news, and soon returned to the absorbing interest of a speech made by the leader of the Opposition in the House of Lords. The speech was very interesting to Mr. Palliser, because in it the noble lord alluded to a break-up in the present Cabinet, about which rumours were rife. Mr. Palliser had heard no official news of such a rupture; but if one were to take place, it must be in his favour. He felt himself to be near the object of his ambition, to have affairs upon his hands which required all his attention.\nDid he really need to refer again to the incidents of last night? Doing so would be odious to him. He did not believe that his wife was in any serious danger. He was not jealous; he was indeed incapable of jealousy. He knew what it would be to be dishonoured, and he knew that under certain circumstances the world would expect him to exert himself in a certain way\nBut the thing that he had now to do was a great trouble to him. He would rather address the House of Commons with ten columns of figures than utter a word of remonstrance to his wife. But she had defied him by saying that she would see his friends no more; and it was this that made him feel that he could not pass over it in silence.\nNevertheless, he went on pretending to read. Every now and then he said some word to her of what he was reading, trying to use his usual tone of voice. But there was a certain hesitation - a sign of effort - of which he was himself conscious, and which she understood with perfect accuracy. He was putting off the evil moment. She, therefore, was the first to begin the conversation.\n\"Plantagenet,\" she said, \"you told me last night that you had something to say about Lady Monk's party.\"\nHe put down the newspaper slowly, and turned towards her. \"Yes, my dear.\"\n\"If you think anything, pray say it,\" said Glencora.\n\"It is not always easy for a man to show what he thinks by what he says,\" he replied. \"My fear is that you should suppose me to think more than I do. And it was for that reason that I determined to sleep on it before I spoke to you.\"\n\"If anybody is angry with me I'd much rather they should have it out with me while their anger is hot. I hate cold anger.\"\n\"But I am not angry.\"\n\"That's what husbands always say when they're going to scold.\"\n\"But I am not going to scold. I am only going to advise you.\"\n\"I'd sooner be scolded. Advice is to anger just what cold anger is to hot.\"\n\"But, my dear Glencora, surely if I find it necessary to speak-\"\n\"I don't want to stop you, Plantagenet. Pray, go on. Only it will be so nice to have it over.\"\nHe was now more than ever averse to the task before him. There are some works that won't bear a preface, and this work of marital fault-finding is one of them.\n\"Glencora,\" he said, \"I wish you to be serious with me.\"\n\"I am very serious,\" she replied with an air of mockery, while her eyes and mouth were bright and eloquent with a spirit which her husband did not love to see.\n\"You ought to be serious. Do you know why Mrs. Marsham came here from Lady Monk's last night?\"\n\"Of course I do. She came to tell you that I was waltzing with Burgo Fitzgerald. You might as well ask me whether I knew why Mr. Bott was standing at all the doors, glaring at me.\"\n\"I don't know anything about Mr. Bott. I am speaking of Mrs. Marsham.\"\n\"You should speak of them together as they hunt in couples.\"\n\"Glencora, will you listen to me? If you say that you will not, I shall know what to do.\"\n\"I don't think you would, Plantagenet.\" And she nodded her little head at him, as she spoke. \"But I will listen to you.\"\n\"Mrs. Marsham came here, not simply to tell me that you were waltzing with Mr. Fitzgerald - and I wish that when you mention his name you would call him Mr. Fitzgerald.\"\n\"So I do.\"\n\"You generally use his Christian name, which it would be much better that you should omit.\"\n\"I will try,\" she said, very gently; \"but it's hard to drop an old habit. Before you married me you knew that I had learned to call him Burgo.\"\n\"Let me go on,\" said Mr. Palliser. \"It was not simply to tell me that you were waltzing that Mrs. Marsham came here.\"\n\"And it was not simply to see me waltzing that Mr. Bott stood in the doorways, for he followed me about, and came after me to the supper-room.\"\n\"Glencora, will you oblige me by not speaking of Mr. Bott?\"\n\"I wish you would oblige me by not speaking of Mrs. Marsham.\"\nMr. Palliser rose quickly from his chair with a gesture of anger, stood upright for half a minute, and then sat down again.\n\"I beg your pardon, Plantagenet,\" she said. \"I'll hold my tongue till you bid me speak.\"\n\"Mrs. Marsham came here because she saw that everyone in the room was regarding you with wonder.\" Lady Glencora twisted herself in her chair, but she said nothing. \"She saw that you were not only dancing with Mr. Fitzgerald, but that you were dancing with him - what shall I say?\"\n\"Upon my word I can't tell you.\"\n\"Recklessly.\"\n\"Oh! recklessly, was I? What was I reckless of?\"\n\"Reckless of what people might say; reckless of what I might feel about it; reckless of your own position. I think she was right to come to me.\"\n\"Of course. What's the good of having spies, if they don't run and tell as soon as they see anything, especially anything reckless.\"\n\"Glencora, you are determined to make me angry. I am angry now, very angry. I have employed no spies. When rumours have reached me, not from spies, as you choose to call them, but through your dearest friends and mine-\"\n\"What do you mean by rumours from my dearest friends?\"\n\"Never mind. Let me go on.\"\n\"No; not when you say my dear friends have spread rumours about me. Tell me who they are. Do you mean Alice Vavasor?\"\n\"It does not matter. But when I was warned that you had better not go to any house in which you could meet that man, I would not listen to it. I said that you were my wife, and that as such I could trust you anywhere, everywhere, with any person. Others might distrust you, but I would not do so. When I wished you to go to Monkshade, were there to be any spies there? When I left you last night at Lady Monk's, do you believe in your heart that I trusted to Mrs. Marsham's eyes rather than to your own truth? Do you think that I have lived in fear of Mr. Fitzgerald?\"\n\"No, Plantagenet; I do not think so.\"\n\"Do you believe that I have commissioned Mr. Bott to watch your conduct? Answer me, Glencora.\"\nShe paused a moment, thinking what actually was her true belief on that subject. \"He does watch me, certainly,\" she said.\n\"That does not answer my question. Do you believe that I have commissioned him to do so?\"\n\"No; I do not.\"\n\"Then it is ignoble in you to talk to me of spies. I have employed no spies. If it were ever to come to that, it would be all over with me.\"\nThere was something of feeling in his voice as he said this, which touched his wife's heart. She knew that she had in truth listened to words of love from her former lover. She had received a letter from this man, in which he asked her to elope with him. She had by no means resolved that she would not do it. She had been false to her husband; and as her husband spoke of his confidence in her, her own spirit rebelled against her own deceit.\n\"I know that I have never made you happy,\" she said. \"I know that I never can make you happy.\"\nHe looked at her, struck by her altered tone, and saw that her whole manner was changed. \"I do not understand what you mean,\" he said. \"I have never complained. You have not made me unhappy.\"\nHe was one of those men to whom this was enough. If his wife caused him no uneasiness, what more was he to expect from her? No doubt she might have given him an heir. But he was a just man, and knew that was his misfortune, and not her fault.\nBut now her heart was loosed. She spoke out, at first slowly, but with all the quietness of strong passion. \"No, Plantagenet; I shall never make you happy. You have never loved me, nor I you. We have never loved each other for a single moment. I have been wrong to talk to you about spies; I was wrong to go to Lady Monk's; I have been wrong in everything that I have done; but never so wrong as when I let them persuade me to be your wife!\"\n\"Glencora!\"\n\"Let me speak now, Plantagenet. It is better that I should tell you everything; and I will. I do love Burgo Fitzgerald. I do! I do! How can I help it? Have I not loved him from the first, before I had seen you? Did you not know that it was so? I do love Burgo Fitzgerald, and when I went to Lady Monk's last night, I had almost made up my mind that I must tell him so, and that I must go away with him and hide myself. But when he came to speak to me-\"\n\"He has asked you to go with him, then?\" said the husband.\nGlencora was immediately reminded that though she might tell her own secrets, she ought not to tell those of her lover. \"What need is there of asking, do you think, when people have loved each other as we have done?\"\n\"You wanted to go with him, then?\"\n\"Would it not have been the best for you? Plantagenet, I do not love you as women love their husbands. But, before God, my first wish is to free you from the misfortune that I have brought on you.\" As she said this she started up from her chair, and coming close to him, took him by the coat. He was startled, but did not speak; and he stood looking at her as she went on.\n\"What matters it whether I drown myself, or throw myself away by going with such a one as him, so that you might marry again, and have a child? I'd die willingly. How I wish I could die! Plantagenet, I would kill myself if I dared.\"\nHe was a tall man and she was short, so that he stood over her, and now she was looking up into his face with all her eyes. \"I would,\" she said. \"I would! What is there left for me that I should wish to live?\"\nSoftly, slowly, very gradually, as though he were afraid of what he was doing, he put his arm round her waist. \"You are wrong in one thing,\" he said. \"I do love you.\"\nShe shook her head, touching his breast with her hair as she did so.\n\"I do love you,\" he repeated. \"If you mean that I am not apt at telling you so, it is true, I know. My mind is running on other things.\"\n\"Yes,\" she said; \"your mind is running on other things.\"\n\"But I do love you. If you cannot love me, it is a great misfortune to us both. But we need not therefore be disgraced. As for that other thing - our having, as yet, no child\" - and in saying this he pressed her somewhat closer with his arm - \"you allow yourself to think too much of it; much more of it than I do. I have made no complaints on that head, even to myself.\"\n\"I know what your thoughts are, Plantagenet.\"\n\"Believe me. Of course I have been anxious, and have, perhaps, shown my anxiety by the struggle I have made to hide it. I have never told you what is false, Glencora.\"\n\"No; you are not false!\"\n\"I would rather have you for my wife, childless - if you will try to love me - than any other woman, though another might give me an heir. Will you try to love me?\"\nShe was silent. At this moment, after her confession, she could not bring herself to say that she would even try. Had she said so, she would have seemed to have accepted his forgiveness too easily.\n\"I think, dear,\" he said, still holding her by her waist, \"that we had better leave England for a while. I will give up politics for this season. Should you like to go to Switzerland for the summer, or perhaps to the German spas, and then to Italy when the weather is cold enough?\" Still she was silent. \"Perhaps your friend, Miss Vavasor, would go with us?\"\nHe was killing her by his goodness. She could not speak to him yet; but now, as he mentioned Alice's name, she gently put up her hand and rested it on the back of his.\nAt that moment there came a knock at the door - a sharp knock, which was repeated.\n\"Come in,\" said Mr. Palliser, dropping his arm from his wife's waist, and standing away from her.",
        "paragraph_chars": [
            [
                0,
                534
            ],
            [
                534,
                902
            ],
            [
                902,
                1067
            ],
            [
                1067,
                1120
            ],
            [
                1120,
                1278
            ],
            [
                1278,
                1374
            ],
            [
                1374,
                1429
            ],
            [
                1429,
                1842
            ],
            [
                1842,
                2439
            ],
            [
                2439,
                2711
            ],
            [
                2711,
                3071
            ],
            [
                3071,
                3531
            ],
            [
                3531,
                3984
            ],
            [
                3984,
                4396
            ],
            [
                4396,
                4738
            ],
            [
                4738,
                4786
            ],
            [
                4786,
                5423
            ],
            [
                5423,
                5789
            ],
            [
                5789,
                6124
            ],
            [
                6124,
                6508
            ],
            [
                6508,
                6613
            ],
            [
                6613,
                6687
            ],
            [
                6687,
                6740
            ],
            [
                6740,
                6974
            ],
            [
                6974,
                7097
            ],
            [
                7097,
                7119
            ],
            [
                7119,
                7182
            ],
            [
                7182,
                7244
            ],
            [
                7244,
                7320
            ],
            [
                7320,
                7385
            ],
            [
                7385,
                7480
            ],
            [
                7480,
                7640
            ],
            [
                7640,
                7697
            ],
            [
                7697,
                7857
            ],
            [
                7857,
                7952
            ],
            [
                7952,
                8133
            ],
            [
                8133,
                8204
            ],
            [
                8204,
                8265
            ],
            [
                8265,
                8355
            ],
            [
                8355,
                8476
            ],
            [
                8476,
                8646
            ],
            [
                8646,
                8657
            ],
            [
                8657,
                8749
            ],
            [
                8749,
                8893
            ],
            [
                8893,
                9011
            ],
            [
                9011,
                9155
            ],
            [
                9155,
                9215
            ],
            [
                9215,
                9277
            ],
            [
                9277,
                9401
            ],
            [
                9401,
                9490
            ],
            [
                9490,
                9771
            ],
            [
                9771,
                9804
            ],
            [
                9804,
                9818
            ],
            [
                9818,
                9867
            ],
            [
                9867,
                10012
            ],
            [
                10012,
                10145
            ],
            [
                10145,
                10365
            ],
            [
                10365,
                10420
            ],
            [
                10420,
                10448
            ],
            [
                10448,
                10566
            ],
            [
                10566,
                11135
            ],
            [
                11135,
                11173
            ],
            [
                11173,
                11268
            ],
            [
                11268,
                11390
            ],
            [
                11390,
                11480
            ],
            [
                11480,
                11496
            ],
            [
                11496,
                11637
            ],
            [
                11637,
                12081
            ],
            [
                12081,
                12176
            ],
            [
                12176,
                12368
            ],
            [
                12368,
                12611
            ],
            [
                12611,
                13053
            ],
            [
                13053,
                13065
            ],
            [
                13065,
                13518
            ],
            [
                13518,
                13577
            ],
            [
                13577,
                13794
            ],
            [
                13794,
                13829
            ],
            [
                13829,
                14202
            ],
            [
                14202,
                14435
            ],
            [
                14435,
                14645
            ],
            [
                14645,
                14812
            ],
            [
                14812,
                14881
            ],
            [
                14881,
                15018
            ],
            [
                15018,
                15075
            ],
            [
                15075,
                15447
            ],
            [
                15447,
                15493
            ],
            [
                15493,
                15661
            ],
            [
                15661,
                15686
            ],
            [
                15686,
                15851
            ],
            [
                15851,
                16049
            ],
            [
                16049,
                16408
            ],
            [
                16408,
                16576
            ],
            [
                16576,
                16659
            ],
            [
                16659,
                16756
            ]
        ],
        "segment_chars": [
            [
                0,
                68
            ],
            [
                68,
                173
            ],
            [
                173,
                298
            ],
            [
                298,
                401
            ],
            [
                401,
                500
            ],
            [
                500,
                534
            ],
            [
                534,
                700
            ],
            [
                700,
                779
            ],
            [
                779,
                848
            ],
            [
                848,
                902
            ],
            [
                902,
                981
            ],
            [
                981,
                1067
            ],
            [
                1067,
                1105
            ],
            [
                1105,
                1120
            ],
            [
                1120,
                1187
            ],
            [
                1187,
                1213
            ],
            [
                1213,
                1278
            ],
            [
                1278,
                1374
            ],
            [
                1374,
                1429
            ],
            [
                1429,
                1493
            ],
            [
                1493,
                1600
            ],
            [
                1600,
                1779
            ],
            [
                1779,
                1842
            ],
            [
                1842,
                1995
            ],
            [
                1995,
                2072
            ],
            [
                2072,
                2115
            ],
            [
                2115,
                2171
            ],
            [
                2171,
                2439
            ],
            [
                2439,
                2580
            ],
            [
                2580,
                2610
            ],
            [
                2610,
                2711
            ],
            [
                2711,
                2730
            ],
            [
                2730,
                2771
            ],
            [
                2771,
                2941
            ],
            [
                2941,
                3016
            ],
            [
                3016,
                3071
            ],
            [
                3071,
                3137
            ],
            [
                3137,
                3222
            ],
            [
                3222,
                3265
            ],
            [
                3265,
                3365
            ],
            [
                3365,
                3531
            ],
            [
                3531,
                3619
            ],
            [
                3619,
                3736
            ],
            [
                3736,
                3859
            ],
            [
                3859,
                3947
            ],
            [
                3947,
                3984
            ],
            [
                3984,
                4048
            ],
            [
                4048,
                4077
            ],
            [
                4077,
                4115
            ],
            [
                4115,
                4174
            ],
            [
                4174,
                4289
            ],
            [
                4289,
                4396
            ],
            [
                4396,
                4504
            ],
            [
                4504,
                4580
            ],
            [
                4580,
                4661
            ],
            [
                4661,
                4738
            ],
            [
                4738,
                4776
            ],
            [
                4776,
                4786
            ],
            [
                4786,
                4806
            ],
            [
                4806,
                5032
            ],
            [
                5032,
                5187
            ],
            [
                5187,
                5303
            ],
            [
                5303,
                5423
            ],
            [
                5423,
                5489
            ],
            [
                5489,
                5522
            ],
            [
                5522,
                5582
            ],
            [
                5582,
                5639
            ],
            [
                5639,
                5789
            ],
            [
                5789,
                5853
            ],
            [
                5853,
                5973
            ],
            [
                5973,
                6124
            ],
            [
                6124,
                6169
            ],
            [
                6169,
                6276
            ],
            [
                6276,
                6415
            ],
            [
                6415,
                6451
            ],
            [
                6451,
                6508
            ],
            [
                6508,
                6613
            ],
            [
                6613,
                6671
            ],
            [
                6671,
                6687
            ],
            [
                6687,
                6740
            ],
            [
                6740,
                6826
            ],
            [
                6826,
                6890
            ],
            [
                6890,
                6974
            ],
            [
                6974,
                7077
            ],
            [
                7077,
                7097
            ],
            [
                7097,
                7119
            ],
            [
                7119,
                7182
            ],
            [
                7182,
                7212
            ],
            [
                7212,
                7244
            ],
            [
                7244,
                7268
            ],
            [
                7268,
                7320
            ],
            [
                7320,
                7385
            ],
            [
                7385,
                7425
            ],
            [
                7425,
                7438
            ],
            [
                7438,
                7480
            ],
            [
                7480,
                7537
            ],
            [
                7537,
                7640
            ],
            [
                7640,
                7697
            ],
            [
                7697,
                7857
            ],
            [
                7857,
                7883
            ],
            [
                7883,
                7952
            ],
            [
                7952,
                7969
            ],
            [
                7969,
                8033
            ],
            [
                8033,
                8133
            ],
            [
                8133,
                8172
            ],
            [
                8172,
                8204
            ],
            [
                8204,
                8265
            ],
            [
                8265,
                8299
            ],
            [
                8299,
                8355
            ],
            [
                8355,
                8395
            ],
            [
                8395,
                8448
            ],
            [
                8448,
                8476
            ],
            [
                8476,
                8646
            ],
            [
                8646,
                8657
            ],
            [
                8657,
                8749
            ],
            [
                8749,
                8823
            ],
            [
                8823,
                8893
            ],
            [
                8893,
                8928
            ],
            [
                8928,
                9011
            ],
            [
                9011,
                9155
            ],
            [
                9155,
                9215
            ],
            [
                9215,
                9277
            ],
            [
                9277,
                9401
            ],
            [
                9401,
                9445
            ],
            [
                9445,
                9490
            ],
            [
                9490,
                9588
            ],
            [
                9588,
                9654
            ],
            [
                9654,
                9771
            ],
            [
                9771,
                9804
            ],
            [
                9804,
                9818
            ],
            [
                9818,
                9823
            ],
            [
                9823,
                9842
            ],
            [
                9842,
                9867
            ],
            [
                9867,
                9974
            ],
            [
                9974,
                10012
            ],
            [
                10012,
                10024
            ],
            [
                10024,
                10145
            ],
            [
                10145,
                10193
            ],
            [
                10193,
                10221
            ],
            [
                10221,
                10247
            ],
            [
                10247,
                10365
            ],
            [
                10365,
                10420
            ],
            [
                10420,
                10433
            ],
            [
                10433,
                10448
            ],
            [
                10448,
                10516
            ],
            [
                10516,
                10538
            ],
            [
                10538,
                10566
            ],
            [
                10566,
                10587
            ],
            [
                10587,
                10709
            ],
            [
                10709,
                10813
            ],
            [
                10813,
                10863
            ],
            [
                10863,
                10935
            ],
            [
                10935,
                11076
            ],
            [
                11076,
                11135
            ],
            [
                11135,
                11173
            ],
            [
                11173,
                11246
            ],
            [
                11246,
                11268
            ],
            [
                11268,
                11349
            ],
            [
                11349,
                11390
            ],
            [
                11390,
                11425
            ],
            [
                11425,
                11480
            ],
            [
                11480,
                11496
            ],
            [
                11496,
                11547
            ],
            [
                11547,
                11573
            ],
            [
                11573,
                11637
            ],
            [
                11637,
                11730
            ],
            [
                11730,
                11810
            ],
            [
                11810,
                11892
            ],
            [
                11892,
                11947
            ],
            [
                11947,
                12081
            ],
            [
                12081,
                12134
            ],
            [
                12134,
                12176
            ],
            [
                12176,
                12265
            ],
            [
                12265,
                12311
            ],
            [
                12311,
                12337
            ],
            [
                12337,
                12368
            ],
            [
                12368,
                12417
            ],
            [
                12417,
                12492
            ],
            [
                12492,
                12535
            ],
            [
                12535,
                12611
            ],
            [
                12611,
                12641
            ],
            [
                12641,
                12719
            ],
            [
                12719,
                12767
            ],
            [
                12767,
                12803
            ],
            [
                12803,
                12855
            ],
            [
                12855,
                13053
            ],
            [
                13053,
                13065
            ],
            [
                13065,
                13097
            ],
            [
                13097,
                13157
            ],
            [
                13157,
                13185
            ],
            [
                13185,
                13191
            ],
            [
                13191,
                13197
            ],
            [
                13197,
                13216
            ],
            [
                13216,
                13276
            ],
            [
                13276,
                13309
            ],
            [
                13309,
                13484
            ],
            [
                13484,
                13518
            ],
            [
                13518,
                13559
            ],
            [
                13559,
                13577
            ],
            [
                13577,
                13697
            ],
            [
                13697,
                13794
            ],
            [
                13794,
                13829
            ],
            [
                13829,
                13871
            ],
            [
                13871,
                13932
            ],
            [
                13932,
                14027
            ],
            [
                14027,
                14122
            ],
            [
                14122,
                14202
            ],
            [
                14202,
                14346
            ],
            [
                14346,
                14365
            ],
            [
                14365,
                14389
            ],
            [
                14389,
                14435
            ],
            [
                14435,
                14559
            ],
            [
                14559,
                14580
            ],
            [
                14580,
                14590
            ],
            [
                14590,
                14645
            ],
            [
                14645,
                14756
            ],
            [
                14756,
                14795
            ],
            [
                14795,
                14812
            ],
            [
                14812,
                14881
            ],
            [
                14881,
                14911
            ],
            [
                14911,
                14981
            ],
            [
                14981,
                15018
            ],
            [
                15018,
                15075
            ],
            [
                15075,
                15095
            ],
            [
                15095,
                15155
            ],
            [
                15155,
                15195
            ],
            [
                15195,
                15390
            ],
            [
                15390,
                15447
            ],
            [
                15447,
                15493
            ],
            [
                15493,
                15506
            ],
            [
                15506,
                15613
            ],
            [
                15613,
                15661
            ],
            [
                15661,
                15686
            ],
            [
                15686,
                15825
            ],
            [
                15825,
                15851
            ],
            [
                15851,
                15867
            ],
            [
                15867,
                15965
            ],
            [
                15965,
                16049
            ],
            [
                16049,
                16154
            ],
            [
                16154,
                16195
            ],
            [
                16195,
                16331
            ],
            [
                16331,
                16353
            ],
            [
                16353,
                16408
            ],
            [
                16408,
                16444
            ],
            [
                16444,
                16576
            ],
            [
                16576,
                16659
            ],
            [
                16659,
                16756
            ]
        ],
        "overlap_chars": [
            [
                0,
                66
            ],
            [
                66,
                68
            ],
            [
                68,
                97
            ],
            [
                102,
                153
            ],
            [
                154,
                173
            ],
            [
                173,
                256
            ],
            [
                261,
                263
            ],
            [
                268,
                298
            ],
            [
                298,
                315
            ],
            [
                315,
                329
            ],
            [
                330,
                401
            ],
            [
                401,
                410
            ],
            [
                411,
                500
            ],
            [
                500,
                522
            ],
            [
                527,
                534
            ],
            [
                534,
                606
            ],
            [
                607,
                656
            ],
            [
                657,
                669
            ],
            [
                670,
                700
            ],
            [
                700,
                723
            ],
            [
                724,
                771
            ],
            [
                772,
                779
            ],
            [
                779,
                806
            ],
            [
                818,
                831
            ],
            [
                840,
                846
            ],
            [
                846,
                848
            ],
            [
                848,
                873
            ],
            [
                874,
                882
            ],
            [
                883,
                900
            ],
            [
                900,
                901
            ],
            [
                902,
                928
            ],
            [
                937,
                947
            ],
            [
                947,
                970
            ],
            [
                979,
                981
            ],
            [
                981,
                1005
            ],
            [
                1013,
                1067
            ],
            [
                1067,
                1105
            ],
            [
                1105,
                1120
            ],
            [
                1120,
                1144
            ],
            [
                1145,
                1187
            ],
            [
                1187,
                1213
            ],
            [
                1213,
                1233
            ],
            [
                1248,
                1266
            ],
            [
                1275,
                1278
            ],
            [
                1278,
                1309
            ],
            [
                1310,
                1316
            ],
            [
                1316,
                1373
            ],
            [
                1374,
                1396
            ],
            [
                1397,
                1399
            ],
            [
                1400,
                1405
            ],
            [
                1405,
                1429
            ],
            [
                1429,
                1493
            ],
            [
                1493,
                1533
            ],
            [
                1533,
                1562
            ],
            [
                1563,
                1572
            ],
            [
                1586,
                1589
            ],
            [
                1598,
                1600
            ],
            [
                1600,
                1727
            ],
            [
                1728,
                1779
            ],
            [
                1779,
                1842
            ],
            [
                1842,
                1862
            ],
            [
                1864,
                1867
            ],
            [
                1873,
                1876
            ],
            [
                1881,
                1901
            ],
            [
                1902,
                1934
            ],
            [
                1935,
                1995
            ],
            [
                1995,
                2064
            ],
            [
                2065,
                2072
            ],
            [
                2072,
                2084
            ],
            [
                2090,
                2115
            ],
            [
                2115,
                2132
            ],
            [
                2135,
                2158
            ],
            [
                2159,
                2171
            ],
            [
                2171,
                2227
            ],
            [
                2239,
                2316
            ],
            [
                2317,
                2365
            ],
            [
                2365,
                2375
            ],
            [
                2378,
                2438
            ],
            [
                2439,
                2477
            ],
            [
                2477,
                2478
            ],
            [
                2482,
                2485
            ],
            [
                2486,
                2492
            ],
            [
                2493,
                2511
            ],
            [
                2512,
                2580
            ],
            [
                2583,
                2601
            ],
            [
                2602,
                2608
            ],
            [
                2608,
                2610
            ],
            [
                2610,
                2651
            ],
            [
                2654,
                2660
            ],
            [
                2670,
                2682
            ],
            [
                2685,
                2710
            ],
            [
                2711,
                2730
            ],
            [
                2730,
                2771
            ],
            [
                2771,
                2852
            ],
            [
                2855,
                2857
            ],
            [
                2858,
                2881
            ],
            [
                2884,
                2895
            ],
            [
                2903,
                2909
            ],
            [
                2913,
                2941
            ],
            [
                2948,
                2951
            ],
            [
                2956,
                3007
            ],
            [
                3014,
                3016
            ],
            [
                3020,
                3070
            ],
            [
                3071,
                3072
            ],
            [
                3072,
                3137
            ],
            [
                3137,
                3173
            ],
            [
                3174,
                3222
            ],
            [
                3222,
                3265
            ],
            [
                3265,
                3318
            ],
            [
                3326,
                3346
            ],
            [
                3347,
                3365
            ],
            [
                3365,
                3393
            ],
            [
                3398,
                3414
            ],
            [
                3415,
                3506
            ],
            [
                3517,
                3531
            ],
            [
                3531,
                3533
            ],
            [
                3538,
                3544
            ],
            [
                3545,
                3583
            ],
            [
                3584,
                3588
            ],
            [
                3589,
                3619
            ],
            [
                3619,
                3639
            ],
            [
                3643,
                3647
            ],
            [
                3648,
                3659
            ],
            [
                3662,
                3676
            ],
            [
                3677,
                3685
            ],
            [
                3690,
                3729
            ],
            [
                3730,
                3736
            ],
            [
                3736,
                3754
            ],
            [
                3755,
                3758
            ],
            [
                3759,
                3764
            ],
            [
                3769,
                3779
            ],
            [
                3780,
                3857
            ],
            [
                3857,
                3859
            ],
            [
                3859,
                3947
            ],
            [
                3947,
                3950
            ],
            [
                3951,
                3983
            ],
            [
                3984,
                4048
            ],
            [
                4048,
                4077
            ],
            [
                4077,
                4099
            ],
            [
                4100,
                4115
            ],
            [
                4115,
                4157
            ],
            [
                4158,
                4161
            ],
            [
                4162,
                4166
            ],
            [
                4167,
                4174
            ],
            [
                4174,
                4259
            ],
            [
                4267,
                4289
            ],
            [
                4289,
                4355
            ],
            [
                4356,
                4396
            ],
            [
                4396,
                4439
            ],
            [
                4447,
                4504
            ],
            [
                4504,
                4580
            ],
            [
                4580,
                4661
            ],
            [
                4661,
                4738
            ],
            [
                4738,
                4776
            ],
            [
                4776,
                4786
            ],
            [
                4786,
                4806
            ],
            [
                4806,
                4830
            ],
            [
                4831,
                4843
            ],
            [
                4846,
                4850
            ],
            [
                4851,
                5032
            ],
            [
                5032,
                5155
            ],
            [
                5162,
                5167
            ],
            [
                5168,
                5180
            ],
            [
                5181,
                5185
            ],
            [
                5185,
                5187
            ],
            [
                5187,
                5203
            ],
            [
                5204,
                5221
            ],
            [
                5227,
                5252
            ],
            [
                5257,
                5303
            ],
            [
                5303,
                5318
            ],
            [
                5319,
                5422
            ],
            [
                5442,
                5489
            ],
            [
                5489,
                5522
            ],
            [
                5522,
                5582
            ],
            [
                5582,
                5639
            ],
            [
                5639,
                5788
            ],
            [
                5789,
                5853
            ],
            [
                5853,
                5868
            ],
            [
                5869,
                5973
            ],
            [
                5973,
                5991
            ],
            [
                5992,
                6056
            ],
            [
                6057,
                6061
            ],
            [
                6062,
                6075
            ],
            [
                6076,
                6103
            ],
            [
                6104,
                6108
            ],
            [
                6112,
                6122
            ],
            [
                6122,
                6124
            ],
            [
                6124,
                6148
            ],
            [
                6149,
                6167
            ],
            [
                6167,
                6169
            ],
            [
                6169,
                6236
            ],
            [
                6244,
                6250
            ],
            [
                6251,
                6254
            ],
            [
                6261,
                6274
            ],
            [
                6274,
                6276
            ],
            [
                6276,
                6279
            ],
            [
                6280,
                6310
            ],
            [
                6320,
                6322
            ],
            [
                6332,
                6396
            ],
            [
                6397,
                6415
            ],
            [
                6415,
                6421
            ],
            [
                6434,
                6449
            ],
            [
                6449,
                6451
            ],
            [
                6451,
                6508
            ],
            [
                6508,
                6556
            ],
            [
                6557,
                6613
            ],
            [
                6613,
                6671
            ],
            [
                6671,
                6684
            ],
            [
                6687,
                6740
            ],
            [
                6740,
                6826
            ],
            [
                6826,
                6890
            ],
            [
                6890,
                6974
            ],
            [
                6974,
                7077
            ],
            [
                7077,
                7097
            ],
            [
                7097,
                7119
            ],
            [
                7119,
                7182
            ],
            [
                7182,
                7212
            ],
            [
                7212,
                7244
            ],
            [
                7244,
                7268
            ],
            [
                7268,
                7320
            ],
            [
                7320,
                7382
            ],
            [
                7385,
                7425
            ],
            [
                7425,
                7438
            ],
            [
                7438,
                7480
            ],
            [
                7480,
                7537
            ],
            [
                7537,
                7639
            ],
            [
                7640,
                7697
            ],
            [
                7697,
                7729
            ],
            [
                7730,
                7856
            ],
            [
                7857,
                7883
            ],
            [
                7883,
                7952
            ],
            [
                7952,
                7969
            ],
            [
                7969,
                8033
            ],
            [
                8033,
                8133
            ],
            [
                8133,
                8170
            ],
            [
                8172,
                8185
            ],
            [
                8186,
                8204
            ],
            [
                8204,
                8229
            ],
            [
                8230,
                8265
            ],
            [
                8265,
                8297
            ],
            [
                8297,
                8299
            ],
            [
                8299,
                8355
            ],
            [
                8355,
                8395
            ],
            [
                8395,
                8448
            ],
            [
                8449,
                8473
            ],
            [
                8476,
                8565
            ],
            [
                8568,
                8646
            ],
            [
                8646,
                8657
            ],
            [
                8657,
                8671
            ],
            [
                8676,
                8749
            ],
            [
                8749,
                8823
            ],
            [
                8823,
                8893
            ],
            [
                8893,
                8927
            ],
            [
                8928,
                9011
            ],
            [
                9011,
                9124
            ],
            [
                9125,
                9155
            ],
            [
                9155,
                9215
            ],
            [
                9215,
                9276
            ],
            [
                9277,
                9400
            ],
            [
                9401,
                9445
            ],
            [
                9445,
                9446
            ],
            [
                9446,
                9490
            ],
            [
                9490,
                9534
            ],
            [
                9544,
                9588
            ],
            [
                9588,
                9617
            ],
            [
                9618,
                9654
            ],
            [
                9654,
                9749
            ],
            [
                9752,
                9771
            ],
            [
                9771,
                9804
            ],
            [
                9804,
                9818
            ],
            [
                9818,
                9823
            ],
            [
                9823,
                9842
            ],
            [
                9842,
                9867
            ],
            [
                9867,
                9972
            ],
            [
                9974,
                10012
            ],
            [
                10012,
                10013
            ],
            [
                10013,
                10024
            ],
            [
                10024,
                10133
            ],
            [
                10142,
                10145
            ],
            [
                10145,
                10193
            ],
            [
                10193,
                10208
            ],
            [
                10209,
                10221
            ],
            [
                10221,
                10247
            ],
            [
                10247,
                10362
            ],
            [
                10365,
                10420
            ],
            [
                10420,
                10433
            ],
            [
                10433,
                10448
            ],
            [
                10448,
                10516
            ],
            [
                10516,
                10538
            ],
            [
                10538,
                10566
            ],
            [
                10566,
                10578
            ],
            [
                10585,
                10587
            ],
            [
                10587,
                10709
            ],
            [
                10709,
                10813
            ],
            [
                10813,
                10863
            ],
            [
                10863,
                10935
            ],
            [
                10935,
                11076
            ],
            [
                11076,
                11135
            ],
            [
                11135,
                11173
            ],
            [
                11173,
                11246
            ],
            [
                11246,
                11268
            ],
            [
                11268,
                11349
            ],
            [
                11349,
                11390
            ],
            [
                11390,
                11425
            ],
            [
                11425,
                11480
            ],
            [
                11480,
                11496
            ],
            [
                11496,
                11547
            ],
            [
                11547,
                11573
            ],
            [
                11573,
                11604
            ],
            [
                11604,
                11637
            ],
            [
                11637,
                11697
            ],
            [
                11698,
                11730
            ],
            [
                11730,
                11760
            ],
            [
                11761,
                11810
            ],
            [
                11810,
                11826
            ],
            [
                11827,
                11892
            ],
            [
                11892,
                11942
            ],
            [
                11945,
                11947
            ],
            [
                11947,
                12064
            ],
            [
                12073,
                12079
            ],
            [
                12079,
                12081
            ],
            [
                12081,
                12134
            ],
            [
                12134,
                12176
            ],
            [
                12176,
                12251
            ],
            [
                12256,
                12265
            ],
            [
                12265,
                12311
            ],
            [
                12311,
                12337
            ],
            [
                12337,
                12367
            ],
            [
                12368,
                12417
            ],
            [
                12417,
                12492
            ],
            [
                12492,
                12500
            ],
            [
                12501,
                12535
            ],
            [
                12535,
                12571
            ],
            [
                12572,
                12611
            ],
            [
                12611,
                12639
            ],
            [
                12641,
                12676
            ],
            [
                12677,
                12719
            ],
            [
                12719,
                12767
            ],
            [
                12767,
                12803
            ],
            [
                12803,
                12855
            ],
            [
                12855,
                13053
            ],
            [
                13053,
                13065
            ],
            [
                13065,
                13095
            ],
            [
                13097,
                13157
            ],
            [
                13157,
                13185
            ],
            [
                13185,
                13191
            ],
            [
                13191,
                13197
            ],
            [
                13197,
                13211
            ],
            [
                13214,
                13216
            ],
            [
                13216,
                13252
            ],
            [
                13253,
                13276
            ],
            [
                13276,
                13309
            ],
            [
                13309,
                13484
            ],
            [
                13484,
                13515
            ],
            [
                13518,
                13559
            ],
            [
                13559,
                13575
            ],
            [
                13575,
                13577
            ],
            [
                13577,
                13632
            ],
            [
                13633,
                13668
            ],
            [
                13672,
                13697
            ],
            [
                13697,
                13794
            ],
            [
                13794,
                13829
            ],
            [
                13829,
                13871
            ],
            [
                13871,
                13901
            ],
            [
                13902,
                13930
            ],
            [
                13930,
                13932
            ],
            [
                13932,
                14027
            ],
            [
                14027,
                14033
            ],
            [
                14039,
                14043
            ],
            [
                14044,
                14122
            ],
            [
                14122,
                14137
            ],
            [
                14137,
                14161
            ],
            [
                14165,
                14202
            ],
            [
                14202,
                14346
            ],
            [
                14346,
                14365
            ],
            [
                14365,
                14389
            ],
            [
                14389,
                14435
            ],
            [
                14435,
                14470
            ],
            [
                14470,
                14493
            ],
            [
                14494,
                14559
            ],
            [
                14559,
                14580
            ],
            [
                14580,
                14581
            ],
            [
                14581,
                14590
            ],
            [
                14590,
                14645
            ],
            [
                14645,
                14756
            ],
            [
                14756,
                14795
            ],
            [
                14795,
                14812
            ],
            [
                14812,
                14881
            ],
            [
                14881,
                14911
            ],
            [
                14911,
                14981
            ],
            [
                14981,
                15018
            ],
            [
                15018,
                15075
            ],
            [
                15075,
                15095
            ],
            [
                15095,
                15155
            ],
            [
                15155,
                15195
            ],
            [
                15195,
                15218
            ],
            [
                15221,
                15250
            ],
            [
                15253,
                15315
            ],
            [
                15318,
                15362
            ],
            [
                15363,
                15390
            ],
            [
                15390,
                15434
            ],
            [
                15444,
                15447
            ],
            [
                15447,
                15493
            ],
            [
                15493,
                15504
            ],
            [
                15504,
                15506
            ],
            [
                15506,
                15613
            ],
            [
                15613,
                15661
            ],
            [
                15661,
                15686
            ],
            [
                15686,
                15733
            ],
            [
                15736,
                15762
            ],
            [
                15765,
                15825
            ],
            [
                15825,
                15851
            ],
            [
                15851,
                15867
            ],
            [
                15867,
                15888
            ],
            [
                15893,
                15903
            ],
            [
                15903,
                15965
            ],
            [
                15965,
                16049
            ],
            [
                16049,
                16154
            ],
            [
                16154,
                16195
            ],
            [
                16195,
                16261
            ],
            [
                16262,
                16272
            ],
            [
                16277,
                16287
            ],
            [
                16288,
                16331
            ],
            [
                16331,
                16353
            ],
            [
                16353,
                16408
            ],
            [
                16408,
                16444
            ],
            [
                16444,
                16576
            ],
            [
                16576,
                16621
            ],
            [
                16624,
                16648
            ],
            [
                16649,
                16659
            ],
            [
                16659,
                16755
            ],
            [
                16755,
                16756
            ]
        ],
        "row_chars": [
            [
                0,
                68
            ],
            [
                68,
                173
            ],
            [
                173,
                298
            ],
            [
                298,
                401
            ],
            [
                401,
                500
            ],
            [
                500,
                534
            ],
            [
                534,
                700
            ],
            [
                700,
                779
            ],
            [
                779,
                848
            ],
            [
                848,
                902
            ],
            [
                902,
                981
            ],
            [
                981,
                1067
            ],
            [
                1067,
                1105
            ],
            [
                1105,
                1120
            ],
            [
                1120,
                1187
            ],
            [
                1187,
                1213
            ],
            [
                1213,
                1278
            ],
            [
                1278,
                1374
            ],
            [
                1374,
                1429
            ],
            [
                1429,
                1493
            ],
            [
                1493,
                1600
            ],
            [
                1600,
                1779
            ],
            [
                1779,
                1779
            ],
            [
                1779,
                1842
            ],
            [
                1842,
                1995
            ],
            [
                1995,
                2072
            ],
            [
                2072,
                2115
            ],
            [
                2115,
                2171
            ],
            [
                2171,
                2171
            ],
            [
                2171,
                2171
            ],
            [
                2171,
                2439
            ],
            [
                2439,
                2580
            ],
            [
                2580,
                2610
            ],
            [
                2610,
                2711
            ],
            [
                2711,
                2730
            ],
            [
                2730,
                2771
            ],
            [
                2771,
                2941
            ],
            [
                2941,
                3016
            ],
            [
                3016,
                3016
            ],
            [
                3016,
                3071
            ],
            [
                3071,
                3137
            ],
            [
                3137,
                3222
            ],
            [
                3222,
                3265
            ],
            [
                3265,
                3365
            ],
            [
                3365,
                3531
            ],
            [
                3531,
                3531
            ],
            [
                3531,
                3619
            ],
            [
                3619,
                3736
            ],
            [
                3736,
                3859
            ],
            [
                3859,
                3947
            ],
            [
                3947,
                3984
            ],
            [
                3984,
                4048
            ],
            [
                4048,
                4077
            ],
            [
                4077,
                4115
            ],
            [
                4115,
                4174
            ],
            [
                4174,
                4289
            ],
            [
                4289,
                4396
            ],
            [
                4396,
                4504
            ],
            [
                4504,
                4504
            ],
            [
                4504,
                4580
            ],
            [
                4580,
                4661
            ],
            [
                4661,
                4738
            ],
            [
                4738,
                4776
            ],
            [
                4776,
                4786
            ],
            [
                4786,
                4806
            ],
            [
                4806,
                5032
            ],
            [
                5032,
                5187
            ],
            [
                5187,
                5303
            ],
            [
                5303,
                5423
            ],
            [
                5423,
                5489
            ],
            [
                5489,
                5522
            ],
            [
                5522,
                5522
            ],
            [
                5522,
                5582
            ],
            [
                5582,
                5582
            ],
            [
                5582,
                5639
            ],
            [
                5639,
                5789
            ],
            [
                5789,
                5853
            ],
            [
                5853,
                5973
            ],
            [
                5973,
                6124
            ],
            [
                6124,
                6169
            ],
            [
                6169,
                6276
            ],
            [
                6276,
                6415
            ],
            [
                6415,
                6451
            ],
            [
                6451,
                6451
            ],
            [
                6451,
                6508
            ],
            [
                6508,
                6613
            ],
            [
                6613,
                6671
            ],
            [
                6671,
                6687
            ],
            [
                6687,
                6687
            ],
            [
                6687,
                6740
            ],
            [
                6740,
                6826
            ],
            [
                6826,
                6890
            ],
            [
                6890,
                6974
            ],
            [
                6974,
                7077
            ],
            [
                7077,
                7097
            ],
            [
                7097,
                7119
            ],
            [
                7119,
                7182
            ],
            [
                7182,
                7212
            ],
            [
                7212,
                7244
            ],
            [
                7244,
                7268
            ],
            [
                7268,
                7320
            ],
            [
                7320,
                7385
            ],
            [
                7385,
                7425
            ],
            [
                7425,
                7438
            ],
            [
                7438,
                7480
            ],
            [
                7480,
                7537
            ],
            [
                7537,
                7537
            ],
            [
                7537,
                7640
            ],
            [
                7640,
                7640
            ],
            [
                7640,
                7697
            ],
            [
                7697,
                7857
            ],
            [
                7857,
                7857
            ],
            [
                7857,
                7857
            ],
            [
                7857,
                7883
            ],
            [
                7883,
                7952
            ],
            [
                7952,
                7969
            ],
            [
                7969,
                8033
            ],
            [
                8033,
                8133
            ],
            [
                8133,
                8172
            ],
            [
                8172,
                8172
            ],
            [
                8172,
                8204
            ],
            [
                8204,
                8265
            ],
            [
                8265,
                8299
            ],
            [
                8299,
                8355
            ],
            [
                8355,
                8395
            ],
            [
                8395,
                8448
            ],
            [
                8448,
                8448
            ],
            [
                8448,
                8476
            ],
            [
                8476,
                8476
            ],
            [
                8476,
                8646
            ],
            [
                8646,
                8657
            ],
            [
                8657,
                8749
            ],
            [
                8749,
                8823
            ],
            [
                8823,
                8893
            ],
            [
                8893,
                8928
            ],
            [
                8928,
                8928
            ],
            [
                8928,
                9011
            ],
            [
                9011,
                9155
            ],
            [
                9155,
                9215
            ],
            [
                9215,
                9277
            ],
            [
                9277,
                9401
            ],
            [
                9401,
                9445
            ],
            [
                9445,
                9490
            ],
            [
                9490,
                9588
            ],
            [
                9588,
                9654
            ],
            [
                9654,
                9771
            ],
            [
                9771,
                9804
            ],
            [
                9804,
                9818
            ],
            [
                9818,
                9823
            ],
            [
                9823,
                9842
            ],
            [
                9842,
                9867
            ],
            [
                9867,
                9974
            ],
            [
                9974,
                9974
            ],
            [
                9974,
                9974
            ],
            [
                9974,
                10012
            ],
            [
                10012,
                10024
            ],
            [
                10024,
                10145
            ],
            [
                10145,
                10193
            ],
            [
                10193,
                10221
            ],
            [
                10221,
                10247
            ],
            [
                10247,
                10365
            ],
            [
                10365,
                10420
            ],
            [
                10420,
                10433
            ],
            [
                10433,
                10448
            ],
            [
                10448,
                10516
            ],
            [
                10516,
                10538
            ],
            [
                10538,
                10538
            ],
            [
                10538,
                10566
            ],
            [
                10566,
                10587
            ],
            [
                10587,
                10709
            ],
            [
                10709,
                10813
            ],
            [
                10813,
                10863
            ],
            [
                10863,
                10935
            ],
            [
                10935,
                11076
            ],
            [
                11076,
                11135
            ],
            [
                11135,
                11173
            ],
            [
                11173,
                11246
            ],
            [
                11246,
                11268
            ],
            [
                11268,
                11349
            ],
            [
                11349,
                11390
            ],
            [
                11390,
                11425
            ],
            [
                11425,
                11480
            ],
            [
                11480,
                11496
            ],
            [
                11496,
                11547
            ],
            [
                11547,
                11573
            ],
            [
                11573,
                11637
            ],
            [
                11637,
                11730
            ],
            [
                11730,
                11810
            ],
            [
                11810,
                11892
            ],
            [
                11892,
                11947
            ],
            [
                11947,
                12081
            ],
            [
                12081,
                12134
            ],
            [
                12134,
                12176
            ],
            [
                12176,
                12265
            ],
            [
                12265,
                12311
            ],
            [
                12311,
                12337
            ],
            [
                12337,
                12368
            ],
            [
                12368,
                12417
            ],
            [
                12417,
                12492
            ],
            [
                12492,
                12535
            ],
            [
                12535,
                12611
            ],
            [
                12611,
                12719
            ],
            [
                12719,
                12767
            ],
            [
                12767,
                12803
            ],
            [
                12803,
                12855
            ],
            [
                12855,
                13053
            ],
            [
                13053,
                13065
            ],
            [
                13065,
                13157
            ],
            [
                13157,
                13157
            ],
            [
                13157,
                13185
            ],
            [
                13185,
                13191
            ],
            [
                13191,
                13197
            ],
            [
                13197,
                13197
            ],
            [
                13197,
                13216
            ],
            [
                13216,
                13276
            ],
            [
                13276,
                13309
            ],
            [
                13309,
                13484
            ],
            [
                13484,
                13518
            ],
            [
                13518,
                13559
            ],
            [
                13559,
                13577
            ],
            [
                13577,
                13697
            ],
            [
                13697,
                13794
            ],
            [
                13794,
                13829
            ],
            [
                13829,
                13871
            ],
            [
                13871,
                13932
            ],
            [
                13932,
                14027
            ],
            [
                14027,
                14122
            ],
            [
                14122,
                14202
            ],
            [
                14202,
                14202
            ],
            [
                14202,
                14346
            ],
            [
                14346,
                14365
            ],
            [
                14365,
                14389
            ],
            [
                14389,
                14435
            ],
            [
                14435,
                14559
            ],
            [
                14559,
                14580
            ],
            [
                14580,
                14590
            ],
            [
                14590,
                14645
            ],
            [
                14645,
                14756
            ],
            [
                14756,
                14795
            ],
            [
                14795,
                14812
            ],
            [
                14812,
                14881
            ],
            [
                14881,
                14911
            ],
            [
                14911,
                14981
            ],
            [
                14981,
                15018
            ],
            [
                15018,
                15075
            ],
            [
                15075,
                15095
            ],
            [
                15095,
                15155
            ],
            [
                15155,
                15195
            ],
            [
                15195,
                15390
            ],
            [
                15390,
                15447
            ],
            [
                15447,
                15493
            ],
            [
                15493,
                15506
            ],
            [
                15506,
                15613
            ],
            [
                15613,
                15661
            ],
            [
                15661,
                15686
            ],
            [
                15686,
                15825
            ],
            [
                15825,
                15851
            ],
            [
                15851,
                15867
            ],
            [
                15867,
                15965
            ],
            [
                15965,
                16049
            ],
            [
                16049,
                16154
            ],
            [
                16154,
                16195
            ],
            [
                16195,
                16331
            ],
            [
                16331,
                16353
            ],
            [
                16353,
                16408
            ],
            [
                16408,
                16444
            ],
            [
                16444,
                16576
            ],
            [
                16576,
                16659
            ],
            [
                16659,
                16756
            ]
        ]
    }
}