{
    "original": {
        "text": "It was the butler who had knocked,--showing that the knock was of more importance than it would have been had it been struck by the knuckles of the footman in livery. \"If you please, sir, the Duke of St. Bungay is here.\"\n\"The Duke of St. Bungay!\" said Mr. Palliser, becoming rather red as he heard the announcement.\n\"Yes, sir, his grace is in the library. He bade me tell you that he particularly wanted to see you; so I told him that you were with my lady.\"\n\"Quite right; tell his grace that I will be with him in two minutes.\" Then the butler retired, and Mr. Palliser was again alone with his wife.\n\"I must go now, my dear,\" he said; \"and perhaps I shall not see you again till the evening.\"\n\"Don't let me put you out in any way,\" she answered.\n\"Oh no;--you won't put me out. You will be dressing, I suppose, about nine.\"\n\"I did not mean as to that,\" she answered. \"You must not think more of Italy. He has come to tell you that you are wanted in the Cabinet.\"\nAgain he turned very red. \"It may be so,\" he answered, \"but though I am wanted, I need not go. But I must not keep the duke waiting. Good-bye.\" And he turned to the door.\nShe followed him and took hold of him as he went, so that he was forced to turn to her once again. She managed to get hold of both his hands, and pressed them closely, looking up into his face with her eyes laden with tears. He smiled at her gently, returned the pressure of the hands, and then left her,--without kissing her. It was not that he was minded not to kiss her. He would have kissed her willingly enough had he thought that the occasion required it. \"He says that he loves me,\" said Lady Glencora to herself, \"but he does not know what love means.\"\nBut she was quite aware that he had behaved to her with genuine, true nobility. As soon as she was alone and certain of her solitude, she took out that letter from her pocket, and tearing it into very small fragments, without reading it, threw the pieces on the fire. As she did so, her mind seemed to be fixed, at any rate, to one thing,--that she would think no more of Burgo Fitzgerald as her future master. I think, however, that she had arrived at so much certainty as this, at that moment in which she had been parting with Burgo Fitzgerald, in Lady Monk's dining-room. She had had courage enough,--or shall we rather say sin enough,--to think of going with him,--to tell herself that she would do so; to put herself in the way of doing it; nay, she had had enough of both to enable her to tell her husband that she had resolved that it would be good for her to do so. But she was neither bold enough nor wicked enough to do the thing. As she had said of her own idea of destroying herself,--she did not dare to take the plunge. Therefore, knowing now that it was so, she tore up the letter that she had carried so long, and burnt it in the fire.\nShe had in truth told him everything, believing that in doing so she was delivering her own death-warrant as regarded her future position in his house. She had done this, not hoping thereby for any escape; not with any purpose as regarded herself, but simply because deceit had been grievous to her, and had become unendurable as soon as his words and manner had in them any feeling of kindness. But her confession had no sooner been made than her fault had been forgiven. She had told him that she did not love him. She had told him, even, that she had thought of leaving him. She had justified by her own words any treatment of his, however harsh, which he might choose to practise. But the result had been--the immediate result--that he had been more tender to her than she had ever remembered him to be before. She knew that he had conquered her. However cold and heartless his home might be to her, it must be her home now. There could be no further thought of leaving him. She had gone out into the tiltyard and had tilted with him, and he had been the victor.\nMr. Palliser himself had not time for much thought before he found himself closeted with the Duke; but as he crossed the hall and went up the stairs, a thought or two did pass quickly across his mind. She had confessed to him, and he had forgiven her. He did not feel quite sure that he had been right, but he did feel quite sure that the thing had been done. He recognized it for a fact that, as regarded the past, no more was to be said. There were to be no reproaches, and there must be some tacit abandoning of Mrs. Marsham's close attendance. As to Mr. Bott;--he had begun to hate Mr. Bott, and had felt cruelly ungrateful, when that gentleman endeavoured to whisper a word into his ear as he passed through the doorway into Lady Monk's dining-room. And he had offered to go abroad,--to go abroad and leave his politics, and his ambition, and his coming honours. He had persisted in his offer, even after his wife had suggested to him that the Duke of St. Bungay was now in the house with the object of offering him that very thing for which he had so longed! As he thought of this his heart became heavy within him. Such chances,--so he told himself,--do not come twice in a man's way. When returning from a twelvemonth's residence abroad he would be nobody in politics. He would have lost everything for which he had been working all his life. But he was a man of his word, and as he opened the library door he was resolute,--he thought that he could be resolute in adhering to his promise.\n\"Duke,\" he said, \"I'm afraid I have kept you waiting.\" And the two political allies shook each other by the hand.\nThe Duke was in a glow of delight. There had been no waiting. He was only too glad to find his friend at home. He had been prepared to wait, even if Mr. Palliser had been out. \"And I suppose you guess why I'm come?\" said the Duke.\n\"I would rather be told than have to guess,\" said Mr. Palliser, smiling for a moment. But the smile quickly passed off his face as he remembered his pledge to his wife.\n\"He has resigned at last. What was said in the Lords last night made it necessary that he should do so, or that Lord Brock should declare himself able to support him through thick and thin. Of course, I can tell you everything now. He must have gone, or I must have done so. You know that I don't like him in the Cabinet. I admire his character and his genius, but I think him the most dangerous man in England as a statesman. He has high principles,--the very highest; but they are so high as to be out of sight to ordinary eyes. They are too exalted to be of any use for everyday purposes. He is honest as the sun, I'm sure; but it's just like the sun's honesty,--of a kind which we men below can't quite understand or appreciate. He has no instinct in politics, but reaches his conclusions by philosophical deduction. Now, in politics, I would a deal sooner trust to instinct than to calculation. I think he may probably know how England ought to be governed three centuries hence better than any man living, but of the proper way to govern it now, I think he knows less. Brock half likes him and half fears him. He likes the support of his eloquence, and he likes the power of the man; but he fears his restless activity, and thoroughly dislikes his philosophy. At any rate, he has left us, and I am here to ask you to take his place.\"\nThe Duke, as he concluded his speech, was quite contented, and almost jovial. He was thoroughly satisfied with the new political arrangement which he was proposing. He regarded Mr. Palliser as a steady, practical man of business, luckily young, and therefore with a deal of work in him, belonging to the race from which English ministers ought, in his opinion, to be taken, and as being, in some respects, his own pupil. He had been the first to declare aloud that Plantagenet Palliser was the coming Chancellor of the Exchequer; and it had been long known, though no such declaration had been made aloud, that the Duke did not sit comfortably in the same Cabinet with the gentleman who had now resigned. Everything had now gone as the Duke wished; and he was prepared to celebrate some little ovation with his young friend before he left the house in Park Lane.\n\"And who goes out with him?\" asked Mr. Palliser, putting off the evil moment of his own decision; but before the Duke could answer him, he had reminded himself that under his present circumstances he had no right to ask such a question. His own decision could not rest upon that point. \"But it does not matter,\" he said; \"I am afraid I must decline the offer you bring me.\"\n\"Decline it!\" said the Duke, who could not have been more surprised had his friend talked of declining heaven.\n\"I fear I must.\" The Duke had now risen from his chair, and was standing, with both his hands upon the table. All his contentment, all his joviality, had vanished. His fine round face had become almost ludicrously long; his eyes and mouth were struggling to convey reproach, and the reproach was almost drowned in vexation. Ever since Parliament had met he had been whispering Mr. Palliser's name into the Prime Minister's ear, and now--. But he could not, and would not, believe it. \"Nonsense, Palliser,\" he said. \"You must have got some false notion into your head. There can be no possible reason why you should not join us. Finespun himself will support us, at any rate for a time.\" Mr. Finespun was the gentleman whose retirement from the ministry the Duke of St. Bungay had now announced.\n\"It is nothing of that kind,\" said Mr. Palliser, who perhaps felt himself quite equal to the duties proposed to him, even though Mr. Finespun should not support him. \"It is nothing of that kind;--it is no fear of that sort that hinders me.\"\n\"Then, for mercy's sake, what is it? My dear Palliser, I looked upon you as being as sure in this matter as myself; and I had a right to do so. You certainly intended to join us a month ago, if the opportunity offered. You certainly did.\"\n\"It is true, Duke. I must ask you to listen to me now, and I must tell you what I would not willingly tell to any man.\" As Mr. Palliser said this a look of agony came over his face. There are men who can talk easily of all their most inmost matters, but he was not such a man. It went sorely against the grain with him to speak of the sorrow of his home, even to such a friend as the Duke; but it was essentially necessary to him that he should justify himself.\n\"Upon my word,\" said the Duke, \"I can't understand that there should be any reason strong enough to make you throw your party over.\"\n\"I have promised to take my wife abroad.\"\n\"Is that it?\" said the Duke, looking at him with surprise, but at the same time with something of returning joviality in his face. \"Nobody thinks of going abroad at this time of the year. Of course, you can get away for a time when Parliament breaks up.\"\n\"But I have promised to go at once.\"\n\"Then, considering your position, you have made a promise which it behoves you to break. I am sure Lady Glencora will see it in that light.\"\n\"You do not quite understand me, and I am afraid I must trouble you to listen to matters which, under other circumstances, it would be impertinent in me to obtrude upon you.\" A certain stiffness of demeanour, and measured propriety of voice, much at variance with his former manner, came upon him as he said this.\n\"Of course, Palliser, I don't want to interfere for a moment.\"\n\"If you will allow me, Duke. My wife has told me that, this morning, which makes me feel that absence from England is requisite for her present comfort. I was with her when you came, and had just promised her that she should go.\"\n\"But, Palliser, think of it. If this were a small matter, I would not press you; but a man in your position has public duties. He owes his services to his country. He has no right to go back, if it be possible that he should so do.\"\n\"When a man has given his word, it cannot be right that he should go back from that.\"\n\"Of course not. But a man may be absolved from a promise. Lady Glencora--\"\n\"My wife would, of course, absolve me. It is not that. Her happiness demands it, and it is partly my fault that it is so. I cannot explain to you more fully why it is that I must give up the great object for which I have striven with all my strength.\"\n\"Oh, no!\" said the Duke. \"If you are sure that it is imperative--\"\n\"It is imperative.\"\n\"I could give you twenty-four hours, you know.\" Mr. Palliser did not answer at once, and the Duke thought that he saw some sign of hesitation. \"I suppose it would not be possible that I should speak to Lady Glencora?\"\n\"It could be of no avail, Duke. She would only declare, at the first word, that she would remain in London; but it would not be the less my duty on that account to take her abroad.\"\n\"Well; I can't say. Of course, I can't say. Such an opportunity may not come twice in a man's life. And at your age too! You are throwing away from you the finest political position that the world can offer to the ambition of any man. No one at your time of life has had such a chance within my memory. That a man under thirty should be thought fit to be Chancellor of the Exchequer, and should refuse it,--because he wants to take his wife abroad! Palliser, if she were dying, you should remain under such an emergency as this. She might go, but you should remain.\"\nMr. Palliser remained silent for a moment or two in his chair; he then rose and walked towards the window, as he spoke. \"There are things worse than death,\" he said, when his back was turned. His voice was very low, and there was a tear in his eye as he spoke them; the words were indeed whispered, but the Duke heard them, and felt that he could not press him any more on the subject of his wife.\n\"And must this be final?\" said the Duke.\n\"I think it must. But your visit here has come so quickly on my resolution to go abroad,--which, in truth, was only made ten minutes before your name was brought to me,--that I believe I ought to ask for a portion of those twenty-four hours which you have offered me. A small portion will be enough. Will you see me, if I come to you this evening, say at eight? If the House is up in the Lords I will go to you in St. James's Square.\"\n\"We shall be sitting after eight, I think.\"\n\"Then I will see you there. And, Duke, I must ask you to think of me in this matter as a friend should think, and not as though we were bound together only by party feeling.\"\n\"I will,--I will.\"\n\"I have told you what I shall never whisper to any one else.\"\n\"I think you know that you are safe with me.\"\n\"I am sure of it. And, Duke, I can tell you that the sacrifice to me will be almost more than I can bear. This thing that you have offered me to-day is the only thing that I have ever coveted. I have thought of it and worked for it, have hoped and despaired, have for moments been vain enough to think that it was within my strength, and have been wretched for weeks together because I have told myself that it was utterly beyond me.\"\n\"As to that, neither Brock nor I, nor any of us, have any doubt. Finespun himself says that you are the man.\"\n\"I am much obliged to them. But I say all this simply that you may understand how imperative is the duty which, as I think, requires me to refuse the offer.\"\n\"But you haven't refused as yet,\" said the Duke. \"I shall wait at the House for you, whether they are sitting or not. And endeavour to join us. Do the best you can. I will say nothing as to that duty of which you speak; but if it can be made compatible with your public service, pray--pray let it be done. Remember how much such a one as you owes to his country.\" Then the Duke went, and Mr. Palliser was alone.\nHe had not been alone before since the revelation which had been made to him by his wife, and the words she had spoken were still sounding in his ears. \"I do love Burgo Fitzgerald;--I do! I do! I do!\" They were not pleasant words for a young husband to hear. Men there are, no doubt, whose nature would make them more miserable under the infliction than it had made Plantagenet Palliser. He was calm, without strong passion, not prone to give to words a stronger significance than they should bear;--and he was essentially unsuspicious. Never for a moment had he thought, even while those words were hissing in his ears, that his wife had betrayed his honour. Nevertheless, there was that at his heart, as he remembered those words, which made him feel that the world was almost too heavy for him. For the first quarter of an hour after the Duke's departure he thought more of his wife and of Burgo Fitzgerald than he did of Lord Brock and Mr. Finespun. But of this he was aware,--that he had forgiven his wife; that he had put his arm round her and embraced her after hearing her confession,--and that she, mutely, with her eyes, had promised him that she would do her best for him. Then something of an idea of love came across his heart, and he acknowledged to himself that he had married without loving or without requiring love. Much of all this had been his own fault. Indeed, had not the whole of it come from his own wrong-doing? He acknowledged that it was so. But now,--now he loved her. He felt that he could not bear to part with her, even if there were no question of public scandal, or of disgrace. He had been torn inwardly by that assertion that she loved another man. She had got at his heart-strings at last. There are men who may love their wives, though they never can have been in love before their marriage.\nWhen the Duke had been gone about an hour, and when, under ordinary circumstances, it would have been his time to go down to the House, he took his hat and walked into the Park. He made his way across Hyde Park, and into Kensington Gardens, and there he remained for an hour, walking up and down beneath the elms. The quidnuncs of the town, who chanced to see him, and who had heard something of the political movements of the day, thought, no doubt, that he was meditating his future ministerial career. But he had not been there long before he had resolved that no ministerial career was at present open to him. \"It has been my own fault,\" he said, as he returned to his house, \"and with God's help I will mend it, if it be possible.\"\nBut he was a slow man, and he did not go off instantly to the Duke. He had given himself to eight o'clock, and he took the full time. He could not go down to the House of Commons because men would make inquiries of him which he would find it difficult to answer. So he dined at home, alone. He had told his wife that he would see her at nine, and before that hour he would not go to her. He sat alone till it was time for him to get into his brougham, and thought it all over. That seat in the Cabinet and Chancellorship of the Exchequer, which he had so infinitely desired, were already done with. There was no doubt about that. It might have been better for him not to have married; but now that he was married, and that things had brought him untowardly to this pass, he knew that his wife's safety was his first duty. \"We will go through Switzerland,\" he said to himself, \"to Baden, and then we will get on to Florence and to Rome. She has seen nothing of all these things yet, and the new life will make a change in her. She shall have her own friend with her.\" Then he went down to the House of Lords, and saw the Duke.\n\"Well, Palliser,\" said the Duke, when he had listened to him, \"of course I cannot argue it with you any more. I can only say that I am very sorry;--more sorry than perhaps you will believe. Indeed, it half breaks my heart.\" The Duke's voice was very sad, and it might almost have been thought that he was going to shed a tear. In truth he disliked Mr. Finespun with the strongest political feeling of which he was capable, and had attached himself to Mr. Palliser almost as strongly. It was a thousand pities! How hard had he not worked to bring about this arrangement, which was now to be upset because a woman had been foolish! \"I never above half liked her,\" said the Duke to himself, thinking perhaps a little of the Duchess's complaints of her. \"I must go to Brock at once,\" he said aloud, \"and tell him. God knows what we must do now. Goodbye! good-bye! No; I'm not angry. There shall be no quarrel. But I am very sorry.\" In this way the two politicians parted.\nWe may as well follow this political movement to its end. The Duke saw Lord Brock that night, and then those two ministers sent for another minister,--another noble Lord, a man of great experience in Cabinets. These three discussed the matter together, and on the following day Lord Brock got up in the House, and made a strong speech in defence of his colleague, Mr. Finespun. To the end of the Session, at any rate, Mr. Finespun kept his position, and held the seals of the Exchequer while all the quidnuncs of the nation, shaking their heads, spoke of the wonderful power of Mr. Finespun, and declared that Lord Brock did not dare to face the Opposition without him.\nIn the meantime Mr. Palliser had returned to his wife, and told her of his resolution with reference to their tour abroad. \"We may as well make up our minds to start at once,\" said he. \"At any rate, there is nothing on my side to hinder us.\"",
        "paragraph_chars": [
            [
                0,
                221
            ],
            [
                221,
                316
            ],
            [
                316,
                459
            ],
            [
                459,
                602
            ],
            [
                602,
                695
            ],
            [
                695,
                748
            ],
            [
                748,
                825
            ],
            [
                825,
                964
            ],
            [
                964,
                1135
            ],
            [
                1135,
                1696
            ],
            [
                1696,
                2849
            ],
            [
                2849,
                3916
            ],
            [
                3916,
                5414
            ],
            [
                5414,
                5528
            ],
            [
                5528,
                5759
            ],
            [
                5759,
                5928
            ],
            [
                5928,
                7268
            ],
            [
                7268,
                8131
            ],
            [
                8131,
                8505
            ],
            [
                8505,
                8616
            ],
            [
                8616,
                9411
            ],
            [
                9411,
                9652
            ],
            [
                9652,
                9891
            ],
            [
                9891,
                10353
            ],
            [
                10353,
                10486
            ],
            [
                10486,
                10528
            ],
            [
                10528,
                10783
            ],
            [
                10783,
                10820
            ],
            [
                10820,
                10961
            ],
            [
                10961,
                11275
            ],
            [
                11275,
                11338
            ],
            [
                11338,
                11568
            ],
            [
                11568,
                11801
            ],
            [
                11801,
                11887
            ],
            [
                11887,
                11962
            ],
            [
                11962,
                12214
            ],
            [
                12214,
                12281
            ],
            [
                12281,
                12301
            ],
            [
                12301,
                12519
            ],
            [
                12519,
                12701
            ],
            [
                12701,
                13268
            ],
            [
                13268,
                13666
            ],
            [
                13666,
                13707
            ],
            [
                13707,
                14142
            ],
            [
                14142,
                14186
            ],
            [
                14186,
                14361
            ],
            [
                14361,
                14380
            ],
            [
                14380,
                14442
            ],
            [
                14442,
                14488
            ],
            [
                14488,
                14923
            ],
            [
                14923,
                15033
            ],
            [
                15033,
                15191
            ],
            [
                15191,
                15603
            ],
            [
                15603,
                17433
            ],
            [
                17433,
                18170
            ],
            [
                18170,
                19296
            ],
            [
                19296,
                20264
            ],
            [
                20264,
                20934
            ],
            [
                20934,
                21175
            ]
        ],
        "segment_chars": [
            [
                0,
                167
            ],
            [
                167,
                221
            ],
            [
                221,
                247
            ],
            [
                247,
                316
            ],
            [
                316,
                356
            ],
            [
                356,
                459
            ],
            [
                459,
                529
            ],
            [
                529,
                602
            ],
            [
                602,
                695
            ],
            [
                695,
                748
            ],
            [
                748,
                779
            ],
            [
                779,
                825
            ],
            [
                825,
                868
            ],
            [
                868,
                903
            ],
            [
                903,
                964
            ],
            [
                964,
                990
            ],
            [
                990,
                1059
            ],
            [
                1059,
                1097
            ],
            [
                1097,
                1108
            ],
            [
                1108,
                1135
            ],
            [
                1135,
                1234
            ],
            [
                1234,
                1360
            ],
            [
                1360,
                1462
            ],
            [
                1462,
                1509
            ],
            [
                1509,
                1597
            ],
            [
                1597,
                1696
            ],
            [
                1696,
                1776
            ],
            [
                1776,
                1964
            ],
            [
                1964,
                2107
            ],
            [
                2107,
                2272
            ],
            [
                2272,
                2571
            ],
            [
                2571,
                2638
            ],
            [
                2638,
                2731
            ],
            [
                2731,
                2849
            ],
            [
                2849,
                3001
            ],
            [
                3001,
                3245
            ],
            [
                3245,
                3322
            ],
            [
                3322,
                3366
            ],
            [
                3366,
                3427
            ],
            [
                3427,
                3534
            ],
            [
                3534,
                3664
            ],
            [
                3664,
                3700
            ],
            [
                3700,
                3778
            ],
            [
                3778,
                3828
            ],
            [
                3828,
                3916
            ],
            [
                3916,
                4117
            ],
            [
                4117,
                4168
            ],
            [
                4168,
                4276
            ],
            [
                4276,
                4356
            ],
            [
                4356,
                4464
            ],
            [
                4464,
                4671
            ],
            [
                4671,
                4784
            ],
            [
                4784,
                4981
            ],
            [
                4981,
                5038
            ],
            [
                5038,
                5108
            ],
            [
                5108,
                5193
            ],
            [
                5193,
                5267
            ],
            [
                5267,
                5414
            ],
            [
                5414,
                5469
            ],
            [
                5469,
                5528
            ],
            [
                5528,
                5563
            ],
            [
                5563,
                5590
            ],
            [
                5590,
                5639
            ],
            [
                5639,
                5704
            ],
            [
                5704,
                5744
            ],
            [
                5744,
                5759
            ],
            [
                5759,
                5845
            ],
            [
                5845,
                5928
            ],
            [
                5928,
                5954
            ],
            [
                5954,
                6118
            ],
            [
                6118,
                6160
            ],
            [
                6160,
                6203
            ],
            [
                6203,
                6250
            ],
            [
                6250,
                6355
            ],
            [
                6355,
                6459
            ],
            [
                6459,
                6520
            ],
            [
                6520,
                6661
            ],
            [
                6661,
                6749
            ],
            [
                6749,
                6828
            ],
            [
                6828,
                7003
            ],
            [
                7003,
                7044
            ],
            [
                7044,
                7194
            ],
            [
                7194,
                7268
            ],
            [
                7268,
                7346
            ],
            [
                7346,
                7433
            ],
            [
                7433,
                7689
            ],
            [
                7689,
                7973
            ],
            [
                7973,
                8131
            ],
            [
                8131,
                8160
            ],
            [
                8160,
                8368
            ],
            [
                8368,
                8417
            ],
            [
                8417,
                8505
            ],
            [
                8505,
                8519
            ],
            [
                8519,
                8616
            ],
            [
                8616,
                8633
            ],
            [
                8633,
                8726
            ],
            [
                8726,
                8780
            ],
            [
                8780,
                8940
            ],
            [
                8940,
                9055
            ],
            [
                9055,
                9100
            ],
            [
                9100,
                9131
            ],
            [
                9131,
                9184
            ],
            [
                9184,
                9244
            ],
            [
                9244,
                9303
            ],
            [
                9303,
                9411
            ],
            [
                9411,
                9577
            ],
            [
                9577,
                9652
            ],
            [
                9652,
                9689
            ],
            [
                9689,
                9796
            ],
            [
                9796,
                9871
            ],
            [
                9871,
                9891
            ],
            [
                9891,
                9910
            ],
            [
                9910,
                10011
            ],
            [
                10011,
                10073
            ],
            [
                10073,
                10168
            ],
            [
                10168,
                10353
            ],
            [
                10353,
                10486
            ],
            [
                10486,
                10528
            ],
            [
                10528,
                10542
            ],
            [
                10542,
                10659
            ],
            [
                10659,
                10716
            ],
            [
                10716,
                10783
            ],
            [
                10783,
                10820
            ],
            [
                10820,
                10909
            ],
            [
                10909,
                10961
            ],
            [
                10961,
                11136
            ],
            [
                11136,
                11275
            ],
            [
                11275,
                11338
            ],
            [
                11338,
                11367
            ],
            [
                11367,
                11491
            ],
            [
                11491,
                11568
            ],
            [
                11568,
                11597
            ],
            [
                11597,
                11695
            ],
            [
                11695,
                11732
            ],
            [
                11732,
                11801
            ],
            [
                11801,
                11887
            ],
            [
                11887,
                11903
            ],
            [
                11903,
                11945
            ],
            [
                11945,
                11962
            ],
            [
                11962,
                12001
            ],
            [
                12001,
                12017
            ],
            [
                12017,
                12084
            ],
            [
                12084,
                12214
            ],
            [
                12214,
                12224
            ],
            [
                12224,
                12239
            ],
            [
                12239,
                12281
            ],
            [
                12281,
                12301
            ],
            [
                12301,
                12349
            ],
            [
                12349,
                12444
            ],
            [
                12444,
                12519
            ],
            [
                12519,
                12551
            ],
            [
                12551,
                12701
            ],
            [
                12701,
                12721
            ],
            [
                12721,
                12745
            ],
            [
                12745,
                12801
            ],
            [
                12801,
                12822
            ],
            [
                12822,
                12936
            ],
            [
                12936,
                13004
            ],
            [
                13004,
                13150
            ],
            [
                13150,
                13230
            ],
            [
                13230,
                13268
            ],
            [
                13268,
                13388
            ],
            [
                13388,
                13460
            ],
            [
                13460,
                13666
            ],
            [
                13666,
                13692
            ],
            [
                13692,
                13707
            ],
            [
                13707,
                13725
            ],
            [
                13725,
                13975
            ],
            [
                13975,
                14007
            ],
            [
                14007,
                14069
            ],
            [
                14069,
                14142
            ],
            [
                14142,
                14186
            ],
            [
                14186,
                14214
            ],
            [
                14214,
                14361
            ],
            [
                14361,
                14380
            ],
            [
                14380,
                14442
            ],
            [
                14442,
                14488
            ],
            [
                14488,
                14506
            ],
            [
                14506,
                14594
            ],
            [
                14594,
                14681
            ],
            [
                14681,
                14923
            ],
            [
                14923,
                14988
            ],
            [
                14988,
                15033
            ],
            [
                15033,
                15061
            ],
            [
                15061,
                15191
            ],
            [
                15191,
                15240
            ],
            [
                15240,
                15309
            ],
            [
                15309,
                15335
            ],
            [
                15335,
                15356
            ],
            [
                15356,
                15497
            ],
            [
                15497,
                15555
            ],
            [
                15555,
                15603
            ],
            [
                15603,
                15755
            ],
            [
                15755,
                15791
            ],
            [
                15791,
                15797
            ],
            [
                15797,
                15804
            ],
            [
                15804,
                15862
            ],
            [
                15862,
                15991
            ],
            [
                15991,
                16140
            ],
            [
                16140,
                16263
            ],
            [
                16263,
                16401
            ],
            [
                16401,
                16557
            ],
            [
                16557,
                16787
            ],
            [
                16787,
                16937
            ],
            [
                16937,
                16978
            ],
            [
                16978,
                17041
            ],
            [
                17041,
                17073
            ],
            [
                17073,
                17101
            ],
            [
                17101,
                17216
            ],
            [
                17216,
                17288
            ],
            [
                17288,
                17330
            ],
            [
                17330,
                17433
            ],
            [
                17433,
                17611
            ],
            [
                17611,
                17747
            ],
            [
                17747,
                17938
            ],
            [
                17938,
                18047
            ],
            [
                18047,
                18170
            ],
            [
                18170,
                18238
            ],
            [
                18238,
                18304
            ],
            [
                18304,
                18433
            ],
            [
                18433,
                18461
            ],
            [
                18461,
                18558
            ],
            [
                18558,
                18647
            ],
            [
                18647,
                18769
            ],
            [
                18769,
                18800
            ],
            [
                18800,
                18992
            ],
            [
                18992,
                19106
            ],
            [
                19106,
                19196
            ],
            [
                19196,
                19237
            ],
            [
                19237,
                19296
            ],
            [
                19296,
                19406
            ],
            [
                19406,
                19486
            ],
            [
                19486,
                19520
            ],
            [
                19520,
                19623
            ],
            [
                19623,
                19780
            ],
            [
                19780,
                19806
            ],
            [
                19806,
                19926
            ],
            [
                19926,
                20046
            ],
            [
                20046,
                20106
            ],
            [
                20106,
                20137
            ],
            [
                20137,
                20146
            ],
            [
                20146,
                20156
            ],
            [
                20156,
                20175
            ],
            [
                20175,
                20202
            ],
            [
                20202,
                20224
            ],
            [
                20224,
                20264
            ],
            [
                20264,
                20322
            ],
            [
                20322,
                20474
            ],
            [
                20474,
                20642
            ],
            [
                20642,
                20934
            ],
            [
                20934,
                21057
            ],
            [
                21057,
                21119
            ],
            [
                21119,
                21175
            ]
        ],
        "overlap_chars": [
            [
                0,
                33
            ],
            [
                165,
                167
            ],
            [
                167,
                221
            ],
            [
                221,
                247
            ],
            [
                247,
                285
            ],
            [
                314,
                316
            ],
            [
                316,
                356
            ],
            [
                356,
                358
            ],
            [
                376,
                396
            ],
            [
                404,
                459
            ],
            [
                459,
                529
            ],
            [
                534,
                552
            ],
            [
                560,
                561
            ],
            [
                602,
                627
            ],
            [
                631,
                635
            ],
            [
                635,
                695
            ],
            [
                695,
                748
            ],
            [
                748,
                749
            ],
            [
                757,
                766
            ],
            [
                777,
                779
            ],
            [
                779,
                799
            ],
            [
                799,
                825
            ],
            [
                825,
                840
            ],
            [
                847,
                857
            ],
            [
                866,
                868
            ],
            [
                868,
                887
            ],
            [
                888,
                903
            ],
            [
                903,
                964
            ],
            [
                964,
                990
            ],
            [
                990,
                1059
            ],
            [
                1059,
                1097
            ],
            [
                1097,
                1108
            ],
            [
                1108,
                1135
            ],
            [
                1135,
                1172
            ],
            [
                1183,
                1234
            ],
            [
                1234,
                1313
            ],
            [
                1328,
                1360
            ],
            [
                1360,
                1438
            ],
            [
                1441,
                1462
            ],
            [
                1509,
                1511
            ],
            [
                1566,
                1596
            ],
            [
                1597,
                1696
            ],
            [
                1696,
                1776
            ],
            [
                1776,
                1800
            ],
            [
                1828,
                1842
            ],
            [
                1848,
                1913
            ],
            [
                1934,
                1964
            ],
            [
                1964,
                1978
            ],
            [
                2036,
                2106
            ],
            [
                2107,
                2137
            ],
            [
                2439,
                2441
            ],
            [
                2174,
                2175
            ],
            [
                2272,
                2298
            ],
            [
                2489,
                2508
            ],
            [
                2536,
                2538
            ],
            [
                2569,
                2571
            ],
            [
                2575,
                2638
            ],
            [
                2638,
                2692
            ],
            [
                2694,
                2710
            ],
            [
                2729,
                2731
            ],
            [
                2731,
                2740
            ],
            [
                2770,
                2849
            ],
            [
                2849,
                2901
            ],
            [
                2914,
                2954
            ],
            [
                2967,
                3001
            ],
            [
                3001,
                3030
            ],
            [
                3039,
                3053
            ],
            [
                3095,
                3163
            ],
            [
                3176,
                3186
            ],
            [
                3064,
                3067
            ],
            [
                3235,
                3244
            ],
            [
                3245,
                3322
            ],
            [
                3322,
                3366
            ],
            [
                3366,
                3427
            ],
            [
                3534,
                3537
            ],
            [
                3559,
                3579
            ],
            [
                3581,
                3621
            ],
            [
                3630,
                3634
            ],
            [
                3656,
                3664
            ],
            [
                3664,
                3700
            ],
            [
                3700,
                3778
            ],
            [
                3778,
                3828
            ],
            [
                3828,
                3831
            ],
            [
                3867,
                3916
            ],
            [
                3916,
                3928
            ],
            [
                3937,
                4024
            ],
            [
                4046,
                4050
            ],
            [
                4064,
                4117
            ],
            [
                4168,
                4217
            ],
            [
                4217,
                4276
            ],
            [
                4276,
                4289
            ],
            [
                4304,
                4308
            ],
            [
                4332,
                4354
            ],
            [
                4322,
                4330
            ],
            [
                4354,
                4356
            ],
            [
                4356,
                4391
            ],
            [
                4431,
                4462
            ],
            [
                4398,
                4402
            ],
            [
                4462,
                4464
            ],
            [
                4464,
                4466
            ],
            [
                4470,
                4478
            ],
            [
                4664,
                4665
            ],
            [
                4481,
                4510
            ],
            [
                4669,
                4670
            ],
            [
                4671,
                4703
            ],
            [
                4718,
                4784
            ],
            [
                4784,
                4887
            ],
            [
                4892,
                4904
            ],
            [
                4933,
                4981
            ],
            [
                4981,
                5025
            ],
            [
                5036,
                5038
            ],
            [
                5038,
                5050
            ],
            [
                5053,
                5071
            ],
            [
                5074,
                5108
            ],
            [
                5108,
                5112
            ],
            [
                5123,
                5127
            ],
            [
                5154,
                5193
            ],
            [
                5193,
                5267
            ],
            [
                5267,
                5333
            ],
            [
                5352,
                5388
            ],
            [
                5398,
                5414
            ],
            [
                5414,
                5469
            ],
            [
                5469,
                5472
            ],
            [
                5498,
                5503
            ],
            [
                5526,
                5528
            ],
            [
                5528,
                5563
            ],
            [
                5704,
                5705
            ],
            [
                5709,
                5744
            ],
            [
                5744,
                5748
            ],
            [
                5757,
                5758
            ],
            [
                5928,
                5954
            ],
            [
                5954,
                6030
            ],
            [
                6116,
                6118
            ],
            [
                6129,
                6160
            ],
            [
                6203,
                6229
            ],
            [
                6234,
                6250
            ],
            [
                6250,
                6355
            ],
            [
                6355,
                6378
            ],
            [
                6398,
                6401
            ],
            [
                6459,
                6520
            ],
            [
                6661,
                6723
            ],
            [
                6747,
                6749
            ],
            [
                6767,
                6774
            ],
            [
                6782,
                6806
            ],
            [
                6826,
                6828
            ],
            [
                6828,
                6842
            ],
            [
                6852,
                6911
            ],
            [
                6938,
                6943
            ],
            [
                6947,
                6971
            ],
            [
                6975,
                6978
            ],
            [
                7001,
                7003
            ],
            [
                7003,
                7008
            ],
            [
                7014,
                7019
            ],
            [
                7068,
                7081
            ],
            [
                7116,
                7134
            ],
            [
                7152,
                7194
            ],
            [
                7194,
                7206
            ],
            [
                7210,
                7268
            ],
            [
                7268,
                7276
            ],
            [
                7306,
                7309
            ],
            [
                7331,
                7346
            ],
            [
                7346,
                7382
            ],
            [
                7397,
                7433
            ],
            [
                7433,
                7484
            ],
            [
                7511,
                7516
            ],
            [
                7656,
                7689
            ],
            [
                7689,
                7761
            ],
            [
                7769,
                7801
            ],
            [
                7973,
                7999
            ],
            [
                8021,
                8023
            ],
            [
                8009,
                8015
            ],
            [
                8129,
                8131
            ],
            [
                8131,
                8139
            ],
            [
                8149,
                8160
            ],
            [
                8160,
                8261
            ],
            [
                8265,
                8295
            ],
            [
                8328,
                8368
            ],
            [
                8417,
                8418
            ],
            [
                8422,
                8489
            ],
            [
                8502,
                8505
            ],
            [
                8505,
                8518
            ],
            [
                8616,
                8632
            ],
            [
                8633,
                8688
            ],
            [
                8690,
                8726
            ],
            [
                8747,
                8764
            ],
            [
                8766,
                8780
            ],
            [
                8780,
                8854
            ],
            [
                8881,
                8889
            ],
            [
                8891,
                8894
            ],
            [
                8930,
                8940
            ],
            [
                8940,
                9051
            ],
            [
                9055,
                9071
            ],
            [
                9088,
                9100
            ],
            [
                9100,
                9131
            ],
            [
                9184,
                9244
            ],
            [
                9796,
                9869
            ],
            [
                9891,
                9910
            ],
            [
                9910,
                10011
            ],
            [
                10011,
                10073
            ],
            [
                10145,
                10155
            ],
            [
                10161,
                10166
            ],
            [
                10087,
                10090
            ],
            [
                10095,
                10109
            ],
            [
                10125,
                10139
            ],
            [
                10279,
                10291
            ],
            [
                10210,
                10212
            ],
            [
                10336,
                10353
            ],
            [
                10353,
                10486
            ],
            [
                10486,
                10525
            ],
            [
                10525,
                10528
            ],
            [
                10820,
                10825
            ],
            [
                10854,
                10909
            ],
            [
                10909,
                10961
            ],
            [
                10961,
                10992
            ],
            [
                11133,
                11136
            ],
            [
                11136,
                11158
            ],
            [
                11236,
                11242
            ],
            [
                11244,
                11274
            ],
            [
                11367,
                11386
            ],
            [
                11391,
                11455
            ],
            [
                11466,
                11491
            ],
            [
                11491,
                11492
            ],
            [
                11529,
                11568
            ],
            [
                11568,
                11597
            ],
            [
                11597,
                11675
            ],
            [
                11698,
                11706
            ],
            [
                11716,
                11730
            ],
            [
                11801,
                11887
            ],
            [
                11887,
                11903
            ],
            [
                11903,
                11945
            ],
            [
                11945,
                11958
            ],
            [
                11962,
                12001
            ],
            [
                12001,
                12017
            ],
            [
                12017,
                12084
            ],
            [
                12084,
                12214
            ],
            [
                12239,
                12277
            ],
            [
                12281,
                12301
            ],
            [
                12301,
                12348
            ],
            [
                12349,
                12444
            ],
            [
                12444,
                12519
            ],
            [
                12519,
                12551
            ],
            [
                12551,
                12560
            ],
            [
                12566,
                12573
            ],
            [
                12594,
                12639
            ],
            [
                12644,
                12646
            ],
            [
                12656,
                12663
            ],
            [
                12680,
                12701
            ],
            [
                12701,
                12721
            ],
            [
                12745,
                12801
            ],
            [
                12822,
                12843
            ],
            [
                12853,
                12907
            ],
            [
                12934,
                12936
            ],
            [
                12936,
                12942
            ],
            [
                12964,
                13004
            ],
            [
                13004,
                13105
            ],
            [
                13108,
                13150
            ],
            [
                13150,
                13230
            ],
            [
                13230,
                13268
            ],
            [
                13268,
                13316
            ],
            [
                13329,
                13373
            ],
            [
                13386,
                13387
            ],
            [
                13388,
                13460
            ],
            [
                13460,
                13527
            ],
            [
                13571,
                13579
            ],
            [
                13596,
                13652
            ],
            [
                13664,
                13666
            ],
            [
                13666,
                13691
            ],
            [
                13707,
                13725
            ],
            [
                13725,
                13764
            ],
            [
                13768,
                13795
            ],
            [
                13877,
                13910
            ],
            [
                13921,
                13975
            ],
            [
                14027,
                14069
            ],
            [
                14069,
                14142
            ],
            [
                14142,
                14186
            ],
            [
                14186,
                14214
            ],
            [
                14214,
                14361
            ],
            [
                14361,
                14362
            ],
            [
                14371,
                14380
            ],
            [
                14380,
                14426
            ],
            [
                14435,
                14442
            ],
            [
                14442,
                14443
            ],
            [
                14465,
                14488
            ],
            [
                14488,
                14506
            ],
            [
                14506,
                14550
            ],
            [
                14557,
                14594
            ],
            [
                14605,
                14629
            ],
            [
                14637,
                14681
            ],
            [
                14681,
                14745
            ],
            [
                14820,
                14923
            ],
            [
                14923,
                14955
            ],
            [
                14972,
                14988
            ],
            [
                14988,
                15033
            ],
            [
                15033,
                15051
            ],
            [
                15059,
                15061
            ],
            [
                15061,
                15070
            ],
            [
                15075,
                15086
            ],
            [
                15087,
                15143
            ],
            [
                15157,
                15191
            ],
            [
                15191,
                15215
            ],
            [
                15219,
                15240
            ],
            [
                15240,
                15275
            ],
            [
                15323,
                15335
            ],
            [
                15335,
                15356
            ],
            [
                15497,
                15505
            ],
            [
                15520,
                15521
            ],
            [
                15529,
                15555
            ],
            [
                15555,
                15603
            ],
            [
                15603,
                15624
            ],
            [
                15632,
                15755
            ],
            [
                15755,
                15783
            ],
            [
                15785,
                15791
            ],
            [
                15791,
                15795
            ],
            [
                15804,
                15862
            ],
            [
                15969,
                15989
            ],
            [
                15994,
                15997
            ],
            [
                16055,
                16056
            ],
            [
                15998,
                16002
            ],
            [
                16002,
                16026
            ],
            [
                16100,
                16101
            ],
            [
                16103,
                16140
            ],
            [
                16140,
                16263
            ],
            [
                16263,
                16276
            ],
            [
                16323,
                16334
            ],
            [
                16342,
                16401
            ],
            [
                16401,
                16557
            ],
            [
                16557,
                16560
            ],
            [
                16569,
                16581
            ],
            [
                16584,
                16614
            ],
            [
                16649,
                16652
            ],
            [
                16706,
                16786
            ],
            [
                16787,
                16937
            ],
            [
                16937,
                16978
            ],
            [
                17073,
                17080
            ],
            [
                17083,
                17101
            ],
            [
                17101,
                17148
            ],
            [
                17214,
                17216
            ],
            [
                17216,
                17288
            ],
            [
                17288,
                17329
            ],
            [
                17433,
                17475
            ],
            [
                17569,
                17595
            ],
            [
                17609,
                17611
            ],
            [
                17611,
                17747
            ],
            [
                17942,
                18046
            ],
            [
                18047,
                18170
            ],
            [
                18170,
                18238
            ],
            [
                18238,
                18258
            ],
            [
                18262,
                18304
            ],
            [
                18304,
                18433
            ],
            [
                18433,
                18459
            ],
            [
                18620,
                18647
            ],
            [
                18647,
                18769
            ],
            [
                18769,
                18800
            ],
            [
                18800,
                18883
            ],
            [
                18941,
                18991
            ],
            [
                18992,
                19065
            ],
            [
                19078,
                19106
            ],
            [
                19106,
                19196
            ],
            [
                19196,
                19214
            ],
            [
                19219,
                19237
            ],
            [
                19237,
                19296
            ],
            [
                19296,
                19359
            ],
            [
                19406,
                19441
            ],
            [
                19484,
                19486
            ],
            [
                19486,
                19520
            ],
            [
                19520,
                19549
            ],
            [
                19621,
                19623
            ],
            [
                19623,
                19656
            ],
            [
                19717,
                19780
            ],
            [
                19780,
                19806
            ],
            [
                20046,
                20083
            ],
            [
                20089,
                20106
            ],
            [
                20106,
                20137
            ],
            [
                20137,
                20146
            ],
            [
                20156,
                20175
            ],
            [
                20202,
                20224
            ],
            [
                20224,
                20264
            ],
            [
                20322,
                20361
            ],
            [
                20415,
                20460
            ],
            [
                20472,
                20474
            ],
            [
                20474,
                20506
            ],
            [
                20515,
                20642
            ],
            [
                20645,
                20712
            ],
            [
                20736,
                20749
            ],
            [
                20932,
                20934
            ],
            [
                20934,
                21019
            ],
            [
                21035,
                21037
            ],
            [
                21044,
                21057
            ],
            [
                21057,
                21072
            ],
            [
                21094,
                21119
            ],
            [
                21119,
                21120
            ],
            [
                21133,
                21175
            ]
        ],
        "row_chars": [
            [
                0,
                167
            ],
            [
                167,
                221
            ],
            [
                221,
                247
            ],
            [
                247,
                316
            ],
            [
                316,
                356
            ],
            [
                356,
                459
            ],
            [
                459,
                529
            ],
            [
                529,
                602
            ],
            [
                602,
                695
            ],
            [
                695,
                748
            ],
            [
                748,
                779
            ],
            [
                779,
                825
            ],
            [
                825,
                868
            ],
            [
                868,
                903
            ],
            [
                903,
                964
            ],
            [
                964,
                990
            ],
            [
                990,
                1059
            ],
            [
                1059,
                1097
            ],
            [
                1097,
                1108
            ],
            [
                1108,
                1135
            ],
            [
                1135,
                1234
            ],
            [
                1234,
                1360
            ],
            [
                1360,
                1462
            ],
            [
                1462,
                1509
            ],
            [
                1509,
                1597
            ],
            [
                1597,
                1696
            ],
            [
                1696,
                1776
            ],
            [
                1776,
                1964
            ],
            [
                1964,
                2107
            ],
            [
                2107,
                2571
            ],
            [
                2571,
                2638
            ],
            [
                2638,
                2731
            ],
            [
                2731,
                2849
            ],
            [
                2849,
                3001
            ],
            [
                3001,
                3245
            ],
            [
                3245,
                3322
            ],
            [
                3322,
                3366
            ],
            [
                3366,
                3427
            ],
            [
                3427,
                3534
            ],
            [
                3534,
                3664
            ],
            [
                3664,
                3700
            ],
            [
                3700,
                3778
            ],
            [
                3778,
                3828
            ],
            [
                3828,
                3916
            ],
            [
                3916,
                4117
            ],
            [
                4117,
                4168
            ],
            [
                4168,
                4276
            ],
            [
                4276,
                4356
            ],
            [
                4356,
                4464
            ],
            [
                4464,
                4671
            ],
            [
                4671,
                4784
            ],
            [
                4784,
                4981
            ],
            [
                4981,
                5038
            ],
            [
                5038,
                5108
            ],
            [
                5108,
                5193
            ],
            [
                5193,
                5267
            ],
            [
                5267,
                5414
            ],
            [
                5414,
                5469
            ],
            [
                5469,
                5528
            ],
            [
                5528,
                5563
            ],
            [
                5563,
                5590
            ],
            [
                5590,
                5639
            ],
            [
                5639,
                5704
            ],
            [
                5704,
                5744
            ],
            [
                5744,
                5759
            ],
            [
                5759,
                5845
            ],
            [
                5845,
                5928
            ],
            [
                5928,
                5954
            ],
            [
                5954,
                6118
            ],
            [
                6118,
                6160
            ],
            [
                6160,
                6203
            ],
            [
                6203,
                6250
            ],
            [
                6250,
                6355
            ],
            [
                6355,
                6520
            ],
            [
                6520,
                6661
            ],
            [
                6661,
                6749
            ],
            [
                6749,
                6828
            ],
            [
                6828,
                7003
            ],
            [
                7003,
                7194
            ],
            [
                7194,
                7268
            ],
            [
                7268,
                7346
            ],
            [
                7346,
                7433
            ],
            [
                7433,
                7689
            ],
            [
                7689,
                8131
            ],
            [
                8131,
                8160
            ],
            [
                8160,
                8368
            ],
            [
                8368,
                8417
            ],
            [
                8417,
                8505
            ],
            [
                8505,
                8519
            ],
            [
                8519,
                8616
            ],
            [
                8616,
                8633
            ],
            [
                8633,
                8726
            ],
            [
                8726,
                8780
            ],
            [
                8780,
                8940
            ],
            [
                8940,
                9055
            ],
            [
                9055,
                9100
            ],
            [
                9100,
                9131
            ],
            [
                9131,
                9184
            ],
            [
                9184,
                9244
            ],
            [
                9244,
                9303
            ],
            [
                9303,
                9411
            ],
            [
                9411,
                9577
            ],
            [
                9577,
                9652
            ],
            [
                9652,
                9689
            ],
            [
                9689,
                9796
            ],
            [
                9796,
                9871
            ],
            [
                9871,
                9891
            ],
            [
                9891,
                9910
            ],
            [
                9910,
                10011
            ],
            [
                10011,
                10073
            ],
            [
                10073,
                10353
            ],
            [
                10353,
                10486
            ],
            [
                10486,
                10528
            ],
            [
                10528,
                10542
            ],
            [
                10542,
                10659
            ],
            [
                10659,
                10716
            ],
            [
                10716,
                10783
            ],
            [
                10783,
                10820
            ],
            [
                10820,
                10909
            ],
            [
                10909,
                10961
            ],
            [
                10961,
                11136
            ],
            [
                11136,
                11275
            ],
            [
                11275,
                11338
            ],
            [
                11338,
                11367
            ],
            [
                11367,
                11491
            ],
            [
                11491,
                11568
            ],
            [
                11568,
                11597
            ],
            [
                11597,
                11732
            ],
            [
                11732,
                11801
            ],
            [
                11801,
                11887
            ],
            [
                11887,
                11903
            ],
            [
                11903,
                11945
            ],
            [
                11945,
                11962
            ],
            [
                11962,
                12001
            ],
            [
                12001,
                12017
            ],
            [
                12017,
                12084
            ],
            [
                12084,
                12214
            ],
            [
                12214,
                12224
            ],
            [
                12224,
                12239
            ],
            [
                12239,
                12281
            ],
            [
                12281,
                12301
            ],
            [
                12301,
                12349
            ],
            [
                12349,
                12444
            ],
            [
                12444,
                12519
            ],
            [
                12519,
                12551
            ],
            [
                12551,
                12701
            ],
            [
                12701,
                12721
            ],
            [
                12721,
                12745
            ],
            [
                12745,
                12801
            ],
            [
                12801,
                12822
            ],
            [
                12822,
                12936
            ],
            [
                12936,
                13004
            ],
            [
                13004,
                13150
            ],
            [
                13150,
                13230
            ],
            [
                13230,
                13268
            ],
            [
                13268,
                13388
            ],
            [
                13388,
                13460
            ],
            [
                13460,
                13666
            ],
            [
                13666,
                13692
            ],
            [
                13692,
                13707
            ],
            [
                13707,
                13725
            ],
            [
                13725,
                13975
            ],
            [
                13975,
                14007
            ],
            [
                14007,
                14069
            ],
            [
                14069,
                14142
            ],
            [
                14142,
                14186
            ],
            [
                14186,
                14214
            ],
            [
                14214,
                14361
            ],
            [
                14361,
                14380
            ],
            [
                14380,
                14442
            ],
            [
                14442,
                14488
            ],
            [
                14488,
                14506
            ],
            [
                14506,
                14594
            ],
            [
                14594,
                14681
            ],
            [
                14681,
                14923
            ],
            [
                14923,
                14988
            ],
            [
                14988,
                15033
            ],
            [
                15033,
                15061
            ],
            [
                15061,
                15191
            ],
            [
                15191,
                15240
            ],
            [
                15240,
                15335
            ],
            [
                15335,
                15356
            ],
            [
                15356,
                15497
            ],
            [
                15497,
                15555
            ],
            [
                15555,
                15603
            ],
            [
                15603,
                15755
            ],
            [
                15755,
                15791
            ],
            [
                15791,
                15797
            ],
            [
                15797,
                15804
            ],
            [
                15804,
                15862
            ],
            [
                15862,
                16140
            ],
            [
                16140,
                16263
            ],
            [
                16263,
                16401
            ],
            [
                16401,
                16557
            ],
            [
                16557,
                16787
            ],
            [
                16787,
                16937
            ],
            [
                16937,
                16978
            ],
            [
                16978,
                17041
            ],
            [
                17041,
                17073
            ],
            [
                17073,
                17101
            ],
            [
                17101,
                17216
            ],
            [
                17216,
                17288
            ],
            [
                17288,
                17330
            ],
            [
                17330,
                17433
            ],
            [
                17433,
                17611
            ],
            [
                17611,
                17747
            ],
            [
                17747,
                17938
            ],
            [
                17938,
                18047
            ],
            [
                18047,
                18170
            ],
            [
                18170,
                18238
            ],
            [
                18238,
                18304
            ],
            [
                18304,
                18433
            ],
            [
                18433,
                18647
            ],
            [
                18647,
                18769
            ],
            [
                18769,
                18800
            ],
            [
                18800,
                18992
            ],
            [
                18992,
                19106
            ],
            [
                19106,
                19196
            ],
            [
                19196,
                19237
            ],
            [
                19237,
                19296
            ],
            [
                19296,
                19486
            ],
            [
                19486,
                19520
            ],
            [
                19520,
                19623
            ],
            [
                19623,
                19780
            ],
            [
                19780,
                19806
            ],
            [
                19806,
                19926
            ],
            [
                19926,
                20046
            ],
            [
                20046,
                20106
            ],
            [
                20106,
                20137
            ],
            [
                20137,
                20146
            ],
            [
                20146,
                20156
            ],
            [
                20156,
                20175
            ],
            [
                20175,
                20202
            ],
            [
                20202,
                20224
            ],
            [
                20224,
                20264
            ],
            [
                20264,
                20322
            ],
            [
                20322,
                20474
            ],
            [
                20474,
                20642
            ],
            [
                20642,
                20934
            ],
            [
                20934,
                21057
            ],
            [
                21057,
                21119
            ],
            [
                21119,
                21175
            ]
        ]
    },
    "abridged": {
        "text": "It was the butler who had knocked. \"If you please, sir, the Duke of St. Bungay is here.\"\n\"The Duke of St. Bungay!\" said Mr. Palliser, becoming rather red.\n\"Yes, sir, his grace is in the library. He says that he particularly wants to see you; so I told him that you were with my lady.\"\n\"Quite right; tell his grace that I will be with him in two minutes.\" The butler retired. \"I must go now, my dear,\" said Mr. Palliser; \"and perhaps I shall not see you again till the evening.\"\n\"Don't let me put you out in any way,\" she answered.\n\"You won't. You will be dressing for dinner, I suppose, about nine.\"\n\"I did not mean that,\" she said. \"You must not think any more of Italy. He has come to tell you that you are wanted in the Cabinet.\"\nAgain he turned very red. \"It may be so,\" he answered, \"but though I am wanted, I need not go. But I must not keep the duke waiting. Good-bye.\" And he turned to the door.\nShe followed him and took hold of him, so that he was forced to turn to her once again. She managed to get hold of both his hands, and pressed them closely, looking up with her eyes laden with tears. He smiled at her gently, returned the pressure of the hands, and then left her - without kissing her. He did not think that the occasion required it.\n\"He says that he loves me,\" said Lady Glencora to herself, \"but he does not know what love means.\"\nBut she was quite aware that he had behaved to her with genuine, true nobility. As soon as she was alone, she took out Burgo's letter from her pocket, and tearing it into very small fragments, threw the pieces on the fire. As she did so, she resolved that she would think no more of Burgo Fitzgerald as her future master.\nI think, however, that she had already decided it, when she had had courage enough to tell her husband about it. She was neither bold enough nor wicked enough to do the thing. As she had said of her own idea of destroying herself, she did not dare. Therefore she tore up the letter that she had carried so long, and burnt it in the fire.\nShe had in truth told him everything, believing that she was delivering her own death-warrant regarding her future position in his house. She had done this, not hoping for any escape, but simply because deceit had been grievous to her, and had become unbearable as soon as he showed any kindness.\nBut her confession had no sooner been made than her fault had been forgiven. She had told him that she did not love him. She had told him, even, that she had thought of leaving him. But the immediate result was that he had been more tender to her than ever before. She knew that he had conquered her. However cold and heartless his home might be to her, it must be her home now. There could be no further thought of leaving him. She had tilted with him, and he had been the victor.\nMr. Palliser had not time for much thought before he found himself closeted with the Duke; but as he went upstairs, a thought or two did pass quickly across his mind. He did not feel quite sure that he had been right to forgive her, but he did feel quite sure that the thing had been done. He recognized that no more was to be said about the past. There were to be no reproaches, and Mrs. Marsham's close attendance must abate. As for Mr. Bott - he had begun to hate Mr. Bott.\nAnd he had offered to go abroad, and leave his politics, and his ambition, and his coming honours. He had persisted in his offer, even after his wife had suggested to him that the Duke of St. Bungay was in the house to offer him that very thing for which he had so longed! As he thought of this his heart became heavy. Such chances - so he told himself - do not come twice in a man's way. When he returned from abroad he would be nobody in politics. He would have lost everything for which he had been working all his life. But he was a man of his word, and as he opened the library door he thought that he could be resolute in keeping to his promise.\n\"Duke,\" he said, \"I'm afraid I have kept you waiting.\" And they shook hands.\nThe Duke was in a glow of delight. \"I suppose you guess why I'm come?\" he said. \"He has resigned at last. What was said in the Lords last night made it necessary that he should do so. I can tell you everything now. You know that I don't like Finespun in the Cabinet. I admire his character and his genius, but I think him the most dangerous man in England as a statesman. He has high principles, but they are too exalted to be of any use for everyday purposes. He has no instinct in politics, but reaches his conclusions by calculation. I would sooner trust to instinct. I think he may know how England ought to be governed three centuries hence, but not the proper way to govern now. Brock likes his eloquence; but he fears his restlessness, and thoroughly dislikes his philosophy. At any rate, Finespun has left us, and I am here to ask you to take his place.\"\nThe Duke was almost jovial. He was thoroughly satisfied with the arrangement which he was proposing. He regarded Mr. Palliser as a steady, practical man, and in some respects, his own pupil. He had been the first to declare aloud that Plantagenet Palliser was the future Chancellor of the Exchequer; and everything had now gone as he wished.\n\"And who leaves with him?\" asked Mr. Palliser, putting off the evil moment of his own decision; but before the Duke could answer, he had reminded himself that he had no right to ask such a question. \"It does not matter,\" he said; \"I am afraid I must decline the offer.\"\n\"Decline it!\"\n\"I fear I must.\"\nThe Duke had now risen from his chair, and was standing with both his hands upon the table. All his joviality had vanished. His fine round face had become almost ludicrously long; his eyes and mouth expressed reproach and vexation. Ever since Parliament had met he had been whispering Mr. Palliser's name into the Prime Minister's ear, and now-\nBut he could not believe it. \"Nonsense, Palliser,\" he said. \"There can be no possible reason why you should not join us. You certainly intended to join us a month ago, if the opportunity offered.\"\n\"It is true, Duke. I must ask you to listen to me now, and I must tell you what I would not willingly tell to any man.\" As Mr. Palliser said this a look of agony came over his face. He was not a man who could talk easily of inmost matters; but it was essential to justify himself.\n\"Upon my word,\" said the Duke, \"I can't understand that there should be any reason strong enough to make you throw your party over.\"\n\"I have promised to take my wife abroad, at once.\"\n\"Then you have made a promise which it behoves you to break. I am sure Lady Glencora will see it in that light.\"\n\"You do not quite understand me.\" A certain stiffness of manner came upon him as he said this. \"My wife has told me something, this morning, which makes me feel that absence from England is necessary for her present comfort. I have just promised her that she should go.\"\n\"But, Palliser, think of it. If this were a small matter, I would not press you; but a man in your position owes his service to his country.\"\n\"When a man has given his word, it cannot be right that he should go back from that.\"\n\"Of course not. But a man may be absolved from a promise. Lady Glencora-\"\n\"My wife would, of course, absolve me. It is not that. Her happiness demands it, and it is partly my fault that it is so. I cannot explain to you more fully why it is that I must give up the great object for which I have striven with all my strength.\"\n\"If you are sure that it is imperative-\"\n\"It is imperative.\"\n\"I could give you twenty-four hours, you know.\"\nMr. Palliser did not answer at once, and the Duke thought that he saw some sign of hesitation. \"I suppose it would not be possible that I should speak to Lady Glencora?\"\n\"It could be of no avail, Duke. She would declare that she would remain in London; but it would still be my duty to take her abroad.\"\n\"Well; I can't say. Such an opportunity may not come twice in a man's life. You are throwing away the finest political position that the world can offer. No one as young as you has had such a chance within my memory. That a man under thirty should be thought fit to be Chancellor of the Exchequer, and should refuse it - because he wants to take his wife abroad! Palliser, if she were dying, you should remain under such an emergency as this. She might go, but you should remain.\"\nMr. Palliser remained silent for a moment or two; he then rose and walked towards the window.\n\"There are things worse than death,\" he said, when his back was turned. His voice was very low, and there was a tear in his eye as he spoke. The Duke felt that he could not press him any more on the subject.\n\"And must this be final?\"\n\"I think it must. But your visit here has come so quickly after my resolution to go abroad, that I believe I ought to ask for some of those twenty-four hours which you have offered me. May I come to you this evening, say at eight? If the House is up in the Lords I will go to you in St. James's Square.\"\n\"We shall be sitting after eight, I think.\"\n\"Then I will see you there. And, Duke, I must ask you to think of me in this matter as a friend should think, and not as though we were bound together only by party feeling.\"\n\"I will.\"\n\"I have told you what I shall never whisper to anyone else.\"\n\"You are safe with me.\"\n\"I am sure of it. And, Duke, I can tell you that the sacrifice will be almost more than I can bear. The post that you have offered me today is the only thing that I have ever coveted. I have thought of it and worked for it, have hoped and despaired, and have been wretched for weeks together because I have told myself that it was utterly beyond me.\"\n\"As to that, neither Brock nor I have any doubt. Finespun himself says that you are the man.\"\n\"I am much obliged. But I say this simply so that you may understand how imperative is the duty which requires me to refuse the offer.\"\n\"But you haven't refused yet,\" said the Duke. \"I shall wait at the House for you, Try to join us. Do the best you can. Remember what a man like you owes to his country.\" Then the Duke went, and Mr. Palliser was alone.\nHe had not been alone since the revelation which had been made to him by his wife, and the words she had spoken were still sounding in his ears. \"I do love Burgo Fitzgerald; I do! I do!\"\nThey were not pleasant words for a young husband to hear. Plantagenet Palliser was a calm man, without strong passion; and he was essentially unsuspicious. Never for a moment had he thought, even while those words were hissing in his ears, that his wife had betrayed his honour. Nevertheless, the memory of those words made him feel that the world was almost too heavy for him. For the first quarter of an hour after the Duke's departure he thought more of his wife and of Burgo Fitzgerald than he did of Lord Brock and Mr. Finespun. But he was aware that he had forgiven his wife; and she, mutely, with her eyes, had promised him that she would do her best for him.\nThen something of an idea of love came across his heart, and he acknowledged to himself that he had married without loving or without requiring love. Much of all this had been his own fault. But now - now he loved her. He felt that he could not bear to part with her. He had been torn inwardly by that assertion that she loved another man. She had got at his heart-strings at last.\nWhen the Duke had been gone about an hour, he took his hat and walked out. He made his way across Hyde Park, and into Kensington Gardens, and there he remained for an hour, walking up and down beneath the elms. He had not been there long before he had resolved that no ministerial career was at present open to him.\n\"It has been my own fault,\" he said, as he returned to his house, \"and with God's help I will mend it, if it be possible.\"\nBut he was a slow man, and he did not go off instantly to the Duke. He had given himself till eight o'clock, and he took the full time. He could not go down to the House of Commons because men would make inquiries of him which he would find it difficult to answer. So he dined at home, alone, and thought it all over. That seat in the Cabinet and Chancellorship of the Exchequer, which he had so infinitely desired, were already done with. There was no doubt about that. It might have been better for him not to have married; but now that he was married, he knew that his wife's safety was his first duty.\n\"We will go through Switzerland,\" he said to himself, \"to Baden, and then on to Florence and to Rome. She has seen nothing of all these things yet, and the new life will make a change in her. She shall have her friend with her.\" Then he went down to the House of Lords, and saw the Duke.\n\"Well, Palliser,\" said the Duke, when he had listened to him, \"I can only say that I am very sorry. Indeed, it half breaks my heart.\" The Duke's voice was very sad. In truth he disliked Mr. Finespun strongly, and had attached himself to Mr. Palliser almost as strongly. It was a thousand pities! \"I must go to Brock at once,\" he said, \"and tell him. God knows what we must do now. Goodbye! No; I'm not angry. But I am very sorry.\" In this way the two politicians parted.\nThe Duke saw Lord Brock that night, and another noble Lord, a man of great experience. These three discussed the matter, and on the following day Lord Brock got up in the House, and made a strong speech in defence of his colleague, Mr. Finespun. Till the end of the Session, at any rate, Mr. Finespun kept his position in the Exchequer.\nIn the meantime Mr. Palliser had returned to his wife, and told her of his resolution to tour abroad. \"We may as well start at once,\" said he. \"There is nothing on my side to hinder us.\"",
        "paragraph_chars": [
            [
                0,
                89
            ],
            [
                89,
                155
            ],
            [
                155,
                285
            ],
            [
                285,
                478
            ],
            [
                478,
                531
            ],
            [
                531,
                600
            ],
            [
                600,
                733
            ],
            [
                733,
                904
            ],
            [
                904,
                1254
            ],
            [
                1254,
                1353
            ],
            [
                1353,
                1675
            ],
            [
                1675,
                2013
            ],
            [
                2013,
                2310
            ],
            [
                2310,
                2792
            ],
            [
                2792,
                3269
            ],
            [
                3269,
                3921
            ],
            [
                3921,
                3998
            ],
            [
                3998,
                4861
            ],
            [
                4861,
                5203
            ],
            [
                5203,
                5473
            ],
            [
                5473,
                5487
            ],
            [
                5487,
                5504
            ],
            [
                5504,
                5849
            ],
            [
                5849,
                6046
            ],
            [
                6046,
                6327
            ],
            [
                6327,
                6460
            ],
            [
                6460,
                6511
            ],
            [
                6511,
                6624
            ],
            [
                6624,
                6895
            ],
            [
                6895,
                7037
            ],
            [
                7037,
                7123
            ],
            [
                7123,
                7197
            ],
            [
                7197,
                7449
            ],
            [
                7449,
                7490
            ],
            [
                7490,
                7510
            ],
            [
                7510,
                7558
            ],
            [
                7558,
                7728
            ],
            [
                7728,
                7862
            ],
            [
                7862,
                8343
            ],
            [
                8343,
                8437
            ],
            [
                8437,
                8645
            ],
            [
                8645,
                8671
            ],
            [
                8671,
                8975
            ],
            [
                8975,
                9019
            ],
            [
                9019,
                9194
            ],
            [
                9194,
                9204
            ],
            [
                9204,
                9265
            ],
            [
                9265,
                9289
            ],
            [
                9289,
                9640
            ],
            [
                9640,
                9734
            ],
            [
                9734,
                9870
            ],
            [
                9870,
                10088
            ],
            [
                10088,
                10275
            ],
            [
                10275,
                10942
            ],
            [
                10942,
                11324
            ],
            [
                11324,
                11640
            ],
            [
                11640,
                11763
            ],
            [
                11763,
                12369
            ],
            [
                12369,
                12657
            ],
            [
                12657,
                13128
            ],
            [
                13128,
                13465
            ],
            [
                13465,
                13651
            ]
        ],
        "segment_chars": [
            [
                0,
                35
            ],
            [
                35,
                89
            ],
            [
                89,
                115
            ],
            [
                115,
                155
            ],
            [
                155,
                195
            ],
            [
                195,
                285
            ],
            [
                285,
                355
            ],
            [
                355,
                375
            ],
            [
                375,
                478
            ],
            [
                478,
                531
            ],
            [
                531,
                543
            ],
            [
                543,
                600
            ],
            [
                600,
                633
            ],
            [
                633,
                672
            ],
            [
                672,
                733
            ],
            [
                733,
                759
            ],
            [
                759,
                828
            ],
            [
                828,
                866
            ],
            [
                866,
                877
            ],
            [
                877,
                904
            ],
            [
                904,
                992
            ],
            [
                992,
                1104
            ],
            [
                1104,
                1206
            ],
            [
                1206,
                1254
            ],
            [
                1254,
                1353
            ],
            [
                1353,
                1433
            ],
            [
                1433,
                1576
            ],
            [
                1576,
                1675
            ],
            [
                1675,
                1788
            ],
            [
                1788,
                1851
            ],
            [
                1851,
                1924
            ],
            [
                1924,
                2013
            ],
            [
                2013,
                2151
            ],
            [
                2151,
                2310
            ],
            [
                2310,
                2387
            ],
            [
                2387,
                2431
            ],
            [
                2431,
                2492
            ],
            [
                2492,
                2575
            ],
            [
                2575,
                2611
            ],
            [
                2611,
                2689
            ],
            [
                2689,
                2739
            ],
            [
                2739,
                2792
            ],
            [
                2792,
                2959
            ],
            [
                2959,
                3082
            ],
            [
                3082,
                3140
            ],
            [
                3140,
                3220
            ],
            [
                3220,
                3269
            ],
            [
                3269,
                3368
            ],
            [
                3368,
                3542
            ],
            [
                3542,
                3588
            ],
            [
                3588,
                3658
            ],
            [
                3658,
                3719
            ],
            [
                3719,
                3793
            ],
            [
                3793,
                3921
            ],
            [
                3921,
                3976
            ],
            [
                3976,
                3998
            ],
            [
                3998,
                4033
            ],
            [
                4033,
                4069
            ],
            [
                4069,
                4078
            ],
            [
                4078,
                4104
            ],
            [
                4104,
                4182
            ],
            [
                4182,
                4213
            ],
            [
                4213,
                4265
            ],
            [
                4265,
                4370
            ],
            [
                4370,
                4459
            ],
            [
                4459,
                4535
            ],
            [
                4535,
                4569
            ],
            [
                4569,
                4683
            ],
            [
                4683,
                4781
            ],
            [
                4781,
                4861
            ],
            [
                4861,
                4889
            ],
            [
                4889,
                4962
            ],
            [
                4962,
                5052
            ],
            [
                5052,
                5203
            ],
            [
                5203,
                5230
            ],
            [
                5230,
                5402
            ],
            [
                5402,
                5473
            ],
            [
                5473,
                5487
            ],
            [
                5487,
                5504
            ],
            [
                5504,
                5596
            ],
            [
                5596,
                5628
            ],
            [
                5628,
                5736
            ],
            [
                5736,
                5849
            ],
            [
                5849,
                5878
            ],
            [
                5878,
                5909
            ],
            [
                5909,
                5970
            ],
            [
                5970,
                6046
            ],
            [
                6046,
                6065
            ],
            [
                6065,
                6166
            ],
            [
                6166,
                6228
            ],
            [
                6228,
                6327
            ],
            [
                6327,
                6460
            ],
            [
                6460,
                6511
            ],
            [
                6511,
                6572
            ],
            [
                6572,
                6624
            ],
            [
                6624,
                6658
            ],
            [
                6658,
                6719
            ],
            [
                6719,
                6849
            ],
            [
                6849,
                6895
            ],
            [
                6895,
                6924
            ],
            [
                6924,
                7037
            ],
            [
                7037,
                7123
            ],
            [
                7123,
                7139
            ],
            [
                7139,
                7181
            ],
            [
                7181,
                7197
            ],
            [
                7197,
                7236
            ],
            [
                7236,
                7252
            ],
            [
                7252,
                7319
            ],
            [
                7319,
                7449
            ],
            [
                7449,
                7490
            ],
            [
                7490,
                7510
            ],
            [
                7510,
                7558
            ],
            [
                7558,
                7653
            ],
            [
                7653,
                7728
            ],
            [
                7728,
                7760
            ],
            [
                7760,
                7862
            ],
            [
                7862,
                7882
            ],
            [
                7882,
                7938
            ],
            [
                7938,
                8016
            ],
            [
                8016,
                8079
            ],
            [
                8079,
                8225
            ],
            [
                8225,
                8305
            ],
            [
                8305,
                8343
            ],
            [
                8343,
                8437
            ],
            [
                8437,
                8509
            ],
            [
                8509,
                8578
            ],
            [
                8578,
                8645
            ],
            [
                8645,
                8671
            ],
            [
                8671,
                8689
            ],
            [
                8689,
                8856
            ],
            [
                8856,
                8902
            ],
            [
                8902,
                8975
            ],
            [
                8975,
                9019
            ],
            [
                9019,
                9047
            ],
            [
                9047,
                9194
            ],
            [
                9194,
                9204
            ],
            [
                9204,
                9265
            ],
            [
                9265,
                9289
            ],
            [
                9289,
                9307
            ],
            [
                9307,
                9389
            ],
            [
                9389,
                9473
            ],
            [
                9473,
                9640
            ],
            [
                9640,
                9689
            ],
            [
                9689,
                9734
            ],
            [
                9734,
                9754
            ],
            [
                9754,
                9870
            ],
            [
                9870,
                9916
            ],
            [
                9916,
                9968
            ],
            [
                9968,
                9989
            ],
            [
                9989,
                10040
            ],
            [
                10040,
                10088
            ],
            [
                10088,
                10233
            ],
            [
                10233,
                10268
            ],
            [
                10268,
                10275
            ],
            [
                10275,
                10333
            ],
            [
                10333,
                10431
            ],
            [
                10431,
                10554
            ],
            [
                10554,
                10653
            ],
            [
                10653,
                10809
            ],
            [
                10809,
                10942
            ],
            [
                10942,
                11092
            ],
            [
                11092,
                11133
            ],
            [
                11133,
                11161
            ],
            [
                11161,
                11210
            ],
            [
                11210,
                11282
            ],
            [
                11282,
                11324
            ],
            [
                11324,
                11399
            ],
            [
                11399,
                11535
            ],
            [
                11535,
                11640
            ],
            [
                11640,
                11763
            ],
            [
                11763,
                11831
            ],
            [
                11831,
                11899
            ],
            [
                11899,
                12028
            ],
            [
                12028,
                12081
            ],
            [
                12081,
                12203
            ],
            [
                12203,
                12234
            ],
            [
                12234,
                12369
            ],
            [
                12369,
                12471
            ],
            [
                12471,
                12561
            ],
            [
                12561,
                12598
            ],
            [
                12598,
                12657
            ],
            [
                12657,
                12757
            ],
            [
                12757,
                12791
            ],
            [
                12791,
                12822
            ],
            [
                12822,
                12927
            ],
            [
                12927,
                12953
            ],
            [
                12953,
                13007
            ],
            [
                13007,
                13038
            ],
            [
                13038,
                13047
            ],
            [
                13047,
                13066
            ],
            [
                13066,
                13088
            ],
            [
                13088,
                13128
            ],
            [
                13128,
                13215
            ],
            [
                13215,
                13374
            ],
            [
                13374,
                13465
            ],
            [
                13465,
                13567
            ],
            [
                13567,
                13608
            ],
            [
                13608,
                13651
            ]
        ],
        "overlap_chars": [
            [
                0,
                33
            ],
            [
                33,
                35
            ],
            [
                35,
                89
            ],
            [
                89,
                115
            ],
            [
                115,
                153
            ],
            [
                153,
                155
            ],
            [
                155,
                195
            ],
            [
                195,
                197
            ],
            [
                203,
                223
            ],
            [
                230,
                285
            ],
            [
                285,
                355
            ],
            [
                355,
                373
            ],
            [
                373,
                374
            ],
            [
                375,
                400
            ],
            [
                401,
                405
            ],
            [
                418,
                478
            ],
            [
                478,
                531
            ],
            [
                531,
                532
            ],
            [
                532,
                541
            ],
            [
                541,
                543
            ],
            [
                543,
                563
            ],
            [
                574,
                600
            ],
            [
                600,
                615
            ],
            [
                616,
                626
            ],
            [
                631,
                633
            ],
            [
                633,
                652
            ],
            [
                657,
                672
            ],
            [
                672,
                733
            ],
            [
                733,
                759
            ],
            [
                759,
                828
            ],
            [
                828,
                866
            ],
            [
                866,
                877
            ],
            [
                877,
                904
            ],
            [
                904,
                941
            ],
            [
                941,
                992
            ],
            [
                992,
                1071
            ],
            [
                1072,
                1104
            ],
            [
                1104,
                1182
            ],
            [
                1185,
                1206
            ],
            [
                1206,
                1208
            ],
            [
                1223,
                1253
            ],
            [
                1254,
                1353
            ],
            [
                1353,
                1433
            ],
            [
                1433,
                1457
            ],
            [
                1457,
                1471
            ],
            [
                1480,
                1545
            ],
            [
                1546,
                1576
            ],
            [
                1576,
                1590
            ],
            [
                1604,
                1674
            ],
            [
                1675,
                1705
            ],
            [
                1722,
                1724
            ],
            [
                1724,
                1725
            ],
            [
                1731,
                1757
            ],
            [
                1758,
                1777
            ],
            [
                1784,
                1786
            ],
            [
                1786,
                1788
            ],
            [
                1788,
                1851
            ],
            [
                1851,
                1905
            ],
            [
                1906,
                1922
            ],
            [
                1922,
                1924
            ],
            [
                1924,
                1933
            ],
            [
                1934,
                2013
            ],
            [
                2013,
                2065
            ],
            [
                2066,
                2106
            ],
            [
                2117,
                2151
            ],
            [
                2151,
                2180
            ],
            [
                2181,
                2195
            ],
            [
                2195,
                2263
            ],
            [
                2275,
                2285
            ],
            [
                2296,
                2299
            ],
            [
                2300,
                2309
            ],
            [
                2310,
                2387
            ],
            [
                2387,
                2431
            ],
            [
                2431,
                2492
            ],
            [
                2492,
                2495
            ],
            [
                2496,
                2516
            ],
            [
                2521,
                2561
            ],
            [
                2562,
                2566
            ],
            [
                2567,
                2575
            ],
            [
                2575,
                2611
            ],
            [
                2611,
                2689
            ],
            [
                2689,
                2739
            ],
            [
                2739,
                2742
            ],
            [
                2743,
                2792
            ],
            [
                2792,
                2804
            ],
            [
                2805,
                2892
            ],
            [
                2893,
                2897
            ],
            [
                2906,
                2959
            ],
            [
                2959,
                3008
            ],
            [
                3023,
                3082
            ],
            [
                3082,
                3095
            ],
            [
                3096,
                3100
            ],
            [
                3101,
                3123
            ],
            [
                3130,
                3138
            ],
            [
                3138,
                3140
            ],
            [
                3140,
                3175
            ],
            [
                3176,
                3207
            ],
            [
                3208,
                3212
            ],
            [
                3218,
                3220
            ],
            [
                3220,
                3222
            ],
            [
                3227,
                3235
            ],
            [
                3236,
                3237
            ],
            [
                3238,
                3267
            ],
            [
                3267,
                3268
            ],
            [
                3269,
                3301
            ],
            [
                3302,
                3368
            ],
            [
                3368,
                3471
            ],
            [
                3472,
                3484
            ],
            [
                3494,
                3542
            ],
            [
                3542,
                3586
            ],
            [
                3586,
                3588
            ],
            [
                3588,
                3600
            ],
            [
                3603,
                3621
            ],
            [
                3624,
                3658
            ],
            [
                3658,
                3662
            ],
            [
                3675,
                3679
            ],
            [
                3680,
                3719
            ],
            [
                3719,
                3793
            ],
            [
                3793,
                3859
            ],
            [
                3860,
                3896
            ],
            [
                3905,
                3921
            ],
            [
                3921,
                3976
            ],
            [
                3976,
                3979
            ],
            [
                3985,
                3990
            ],
            [
                3996,
                3998
            ],
            [
                3998,
                4033
            ],
            [
                4033,
                4034
            ],
            [
                4034,
                4069
            ],
            [
                4072,
                4076
            ],
            [
                4076,
                4077
            ],
            [
                4078,
                4104
            ],
            [
                4104,
                4180
            ],
            [
                4180,
                4182
            ],
            [
                4182,
                4213
            ],
            [
                4213,
                4239
            ],
            [
                4249,
                4265
            ],
            [
                4265,
                4370
            ],
            [
                4370,
                4393
            ],
            [
                4394,
                4397
            ],
            [
                4398,
                4459
            ],
            [
                4459,
                4521
            ],
            [
                4533,
                4535
            ],
            [
                4535,
                4542
            ],
            [
                4543,
                4567
            ],
            [
                4567,
                4569
            ],
            [
                4569,
                4583
            ],
            [
                4584,
                4643
            ],
            [
                4643,
                4648
            ],
            [
                4653,
                4677
            ],
            [
                4678,
                4681
            ],
            [
                4681,
                4683
            ],
            [
                4683,
                4688
            ],
            [
                4689,
                4694
            ],
            [
                4695,
                4708
            ],
            [
                4708,
                4726
            ],
            [
                4739,
                4781
            ],
            [
                4781,
                4793
            ],
            [
                4803,
                4861
            ],
            [
                4861,
                4869
            ],
            [
                4870,
                4873
            ],
            [
                4874,
                4889
            ],
            [
                4889,
                4925
            ],
            [
                4926,
                4962
            ],
            [
                4962,
                5013
            ],
            [
                5013,
                5018
            ],
            [
                5019,
                5052
            ],
            [
                5052,
                5124
            ],
            [
                5132,
                5164
            ],
            [
                5165,
                5191
            ],
            [
                5192,
                5194
            ],
            [
                5195,
                5201
            ],
            [
                5201,
                5203
            ],
            [
                5203,
                5211
            ],
            [
                5219,
                5230
            ],
            [
                5230,
                5331
            ],
            [
                5331,
                5361
            ],
            [
                5362,
                5402
            ],
            [
                5402,
                5403
            ],
            [
                5403,
                5470
            ],
            [
                5470,
                5473
            ],
            [
                5473,
                5486
            ],
            [
                5487,
                5503
            ],
            [
                5504,
                5559
            ],
            [
                5560,
                5596
            ],
            [
                5596,
                5613
            ],
            [
                5614,
                5628
            ],
            [
                5628,
                5702
            ],
            [
                5713,
                5721
            ],
            [
                5722,
                5725
            ],
            [
                5726,
                5736
            ],
            [
                5736,
                5847
            ],
            [
                5849,
                5865
            ],
            [
                5866,
                5878
            ],
            [
                5878,
                5909
            ],
            [
                5910,
                5970
            ],
            [
                5970,
                6043
            ],
            [
                6046,
                6065
            ],
            [
                6065,
                6166
            ],
            [
                6166,
                6228
            ],
            [
                6228,
                6238
            ],
            [
                6239,
                6244
            ],
            [
                6245,
                6248
            ],
            [
                6255,
                6269
            ],
            [
                6270,
                6284
            ],
            [
                6284,
                6296
            ],
            [
                6307,
                6309
            ],
            [
                6310,
                6327
            ],
            [
                6327,
                6460
            ],
            [
                6460,
                6499
            ],
            [
                6508,
                6511
            ],
            [
                6511,
                6516
            ],
            [
                6517,
                6572
            ],
            [
                6572,
                6624
            ],
            [
                6624,
                6655
            ],
            [
                6655,
                6658
            ],
            [
                6658,
                6680
            ],
            [
                6681,
                6687
            ],
            [
                6688,
                6718
            ],
            [
                6720,
                6739
            ],
            [
                6749,
                6813
            ],
            [
                6824,
                6849
            ],
            [
                6849,
                6850
            ],
            [
                6856,
                6895
            ],
            [
                6895,
                6924
            ],
            [
                6924,
                7002
            ],
            [
                7003,
                7011
            ],
            [
                7020,
                7034
            ],
            [
                7037,
                7123
            ],
            [
                7123,
                7139
            ],
            [
                7139,
                7181
            ],
            [
                7181,
                7194
            ],
            [
                7197,
                7236
            ],
            [
                7236,
                7252
            ],
            [
                7252,
                7319
            ],
            [
                7319,
                7449
            ],
            [
                7449,
                7487
            ],
            [
                7490,
                7510
            ],
            [
                7510,
                7557
            ],
            [
                7558,
                7653
            ],
            [
                7653,
                7728
            ],
            [
                7728,
                7760
            ],
            [
                7760,
                7769
            ],
            [
                7770,
                7777
            ],
            [
                7778,
                7823
            ],
            [
                7830,
                7832
            ],
            [
                7833,
                7840
            ],
            [
                7841,
                7862
            ],
            [
                7862,
                7882
            ],
            [
                7882,
                7938
            ],
            [
                7938,
                7959
            ],
            [
                7960,
                8014
            ],
            [
                8014,
                8016
            ],
            [
                8016,
                8022
            ],
            [
                8039,
                8079
            ],
            [
                8079,
                8180
            ],
            [
                8183,
                8225
            ],
            [
                8225,
                8305
            ],
            [
                8305,
                8343
            ],
            [
                8343,
                8391
            ],
            [
                8391,
                8435
            ],
            [
                8435,
                8436
            ],
            [
                8437,
                8509
            ],
            [
                8509,
                8576
            ],
            [
                8578,
                8586
            ],
            [
                8587,
                8643
            ],
            [
                8643,
                8645
            ],
            [
                8645,
                8670
            ],
            [
                8671,
                8689
            ],
            [
                8689,
                8728
            ],
            [
                8735,
                8762
            ],
            [
                8763,
                8796
            ],
            [
                8802,
                8856
            ],
            [
                8860,
                8902
            ],
            [
                8902,
                8975
            ],
            [
                8975,
                9019
            ],
            [
                9019,
                9047
            ],
            [
                9047,
                9194
            ],
            [
                9194,
                9195
            ],
            [
                9195,
                9204
            ],
            [
                9204,
                9250
            ],
            [
                9258,
                9265
            ],
            [
                9265,
                9266
            ],
            [
                9266,
                9289
            ],
            [
                9289,
                9307
            ],
            [
                9307,
                9351
            ],
            [
                9352,
                9389
            ],
            [
                9398,
                9422
            ],
            [
                9429,
                9473
            ],
            [
                9473,
                9537
            ],
            [
                9537,
                9640
            ],
            [
                9640,
                9672
            ],
            [
                9673,
                9689
            ],
            [
                9689,
                9734
            ],
            [
                9734,
                9752
            ],
            [
                9752,
                9754
            ],
            [
                9754,
                9763
            ],
            [
                9764,
                9775
            ],
            [
                9779,
                9835
            ],
            [
                9836,
                9870
            ],
            [
                9870,
                9894
            ],
            [
                9895,
                9916
            ],
            [
                9916,
                9951
            ],
            [
                9956,
                9968
            ],
            [
                9968,
                9989
            ],
            [
                9989,
                9997
            ],
            [
                10003,
                10004
            ],
            [
                10014,
                10040
            ],
            [
                10040,
                10088
            ],
            [
                10088,
                10109
            ],
            [
                10110,
                10233
            ],
            [
                10233,
                10261
            ],
            [
                10262,
                10268
            ],
            [
                10268,
                10272
            ],
            [
                10275,
                10333
            ],
            [
                10333,
                10353
            ],
            [
                10354,
                10357
            ],
            [
                10358,
                10359
            ],
            [
                10360,
                10364
            ],
            [
                10368,
                10392
            ],
            [
                10392,
                10393
            ],
            [
                10394,
                10431
            ],
            [
                10431,
                10554
            ],
            [
                10554,
                10567
            ],
            [
                10582,
                10593
            ],
            [
                10594,
                10653
            ],
            [
                10653,
                10809
            ],
            [
                10809,
                10812
            ],
            [
                10813,
                10825
            ],
            [
                10826,
                10856
            ],
            [
                10857,
                10860
            ],
            [
                10861,
                10941
            ],
            [
                10942,
                11092
            ],
            [
                11092,
                11133
            ],
            [
                11133,
                11140
            ],
            [
                11143,
                11161
            ],
            [
                11161,
                11208
            ],
            [
                11208,
                11210
            ],
            [
                11210,
                11282
            ],
            [
                11282,
                11323
            ],
            [
                11324,
                11366
            ],
            [
                11367,
                11393
            ],
            [
                11397,
                11399
            ],
            [
                11399,
                11535
            ],
            [
                11535,
                11639
            ],
            [
                11640,
                11763
            ],
            [
                11763,
                11831
            ],
            [
                11831,
                11851
            ],
            [
                11857,
                11899
            ],
            [
                11899,
                12028
            ],
            [
                12028,
                12054
            ],
            [
                12054,
                12081
            ],
            [
                12081,
                12203
            ],
            [
                12203,
                12234
            ],
            [
                12234,
                12317
            ],
            [
                12318,
                12368
            ],
            [
                12369,
                12442
            ],
            [
                12443,
                12471
            ],
            [
                12471,
                12561
            ],
            [
                12561,
                12579
            ],
            [
                12580,
                12598
            ],
            [
                12598,
                12657
            ],
            [
                12657,
                12720
            ],
            [
                12720,
                12755
            ],
            [
                12755,
                12757
            ],
            [
                12757,
                12791
            ],
            [
                12791,
                12820
            ],
            [
                12820,
                12822
            ],
            [
                12822,
                12855
            ],
            [
                12864,
                12927
            ],
            [
                12927,
                12953
            ],
            [
                12953,
                12990
            ],
            [
                12990,
                13007
            ],
            [
                13007,
                13038
            ],
            [
                13038,
                13047
            ],
            [
                13047,
                13066
            ],
            [
                13066,
                13088
            ],
            [
                13088,
                13128
            ],
            [
                13128,
                13167
            ],
            [
                13168,
                13213
            ],
            [
                13213,
                13215
            ],
            [
                13215,
                13247
            ],
            [
                13247,
                13374
            ],
            [
                13379,
                13446
            ],
            [
                13450,
                13463
            ],
            [
                13463,
                13465
            ],
            [
                13465,
                13550
            ],
            [
                13551,
                13553
            ],
            [
                13554,
                13567
            ],
            [
                13567,
                13582
            ],
            [
                13583,
                13608
            ],
            [
                13608,
                13609
            ],
            [
                13609,
                13651
            ]
        ],
        "row_chars": [
            [
                0,
                35
            ],
            [
                35,
                89
            ],
            [
                89,
                115
            ],
            [
                115,
                155
            ],
            [
                155,
                195
            ],
            [
                195,
                285
            ],
            [
                285,
                355
            ],
            [
                355,
                375
            ],
            [
                375,
                478
            ],
            [
                478,
                531
            ],
            [
                531,
                543
            ],
            [
                543,
                600
            ],
            [
                600,
                633
            ],
            [
                633,
                672
            ],
            [
                672,
                733
            ],
            [
                733,
                759
            ],
            [
                759,
                828
            ],
            [
                828,
                866
            ],
            [
                866,
                877
            ],
            [
                877,
                904
            ],
            [
                904,
                992
            ],
            [
                992,
                1104
            ],
            [
                1104,
                1206
            ],
            [
                1206,
                1206
            ],
            [
                1206,
                1254
            ],
            [
                1254,
                1353
            ],
            [
                1353,
                1433
            ],
            [
                1433,
                1576
            ],
            [
                1576,
                1675
            ],
            [
                1675,
                1788
            ],
            [
                1788,
                1851
            ],
            [
                1851,
                1924
            ],
            [
                1924,
                2013
            ],
            [
                2013,
                2151
            ],
            [
                2151,
                2310
            ],
            [
                2310,
                2387
            ],
            [
                2387,
                2431
            ],
            [
                2431,
                2492
            ],
            [
                2492,
                2492
            ],
            [
                2492,
                2575
            ],
            [
                2575,
                2611
            ],
            [
                2611,
                2689
            ],
            [
                2689,
                2739
            ],
            [
                2739,
                2792
            ],
            [
                2792,
                2959
            ],
            [
                2959,
                2959
            ],
            [
                2959,
                3082
            ],
            [
                3082,
                3140
            ],
            [
                3140,
                3220
            ],
            [
                3220,
                3269
            ],
            [
                3269,
                3368
            ],
            [
                3368,
                3542
            ],
            [
                3542,
                3588
            ],
            [
                3588,
                3658
            ],
            [
                3658,
                3719
            ],
            [
                3719,
                3793
            ],
            [
                3793,
                3921
            ],
            [
                3921,
                3976
            ],
            [
                3976,
                3998
            ],
            [
                3998,
                4033
            ],
            [
                4033,
                4033
            ],
            [
                4033,
                4033
            ],
            [
                4033,
                4033
            ],
            [
                4033,
                4069
            ],
            [
                4069,
                4078
            ],
            [
                4078,
                4078
            ],
            [
                4078,
                4078
            ],
            [
                4078,
                4104
            ],
            [
                4104,
                4182
            ],
            [
                4182,
                4213
            ],
            [
                4213,
                4213
            ],
            [
                4213,
                4265
            ],
            [
                4265,
                4370
            ],
            [
                4370,
                4459
            ],
            [
                4459,
                4459
            ],
            [
                4459,
                4535
            ],
            [
                4535,
                4569
            ],
            [
                4569,
                4683
            ],
            [
                4683,
                4781
            ],
            [
                4781,
                4861
            ],
            [
                4861,
                4889
            ],
            [
                4889,
                4962
            ],
            [
                4962,
                5052
            ],
            [
                5052,
                5203
            ],
            [
                5203,
                5230
            ],
            [
                5230,
                5402
            ],
            [
                5402,
                5402
            ],
            [
                5402,
                5473
            ],
            [
                5473,
                5487
            ],
            [
                5487,
                5487
            ],
            [
                5487,
                5504
            ],
            [
                5504,
                5596
            ],
            [
                5596,
                5628
            ],
            [
                5628,
                5736
            ],
            [
                5736,
                5849
            ],
            [
                5849,
                5878
            ],
            [
                5878,
                5909
            ],
            [
                5909,
                5909
            ],
            [
                5909,
                5970
            ],
            [
                5970,
                5970
            ],
            [
                5970,
                5970
            ],
            [
                5970,
                5970
            ],
            [
                5970,
                5970
            ],
            [
                5970,
                5970
            ],
            [
                5970,
                5970
            ],
            [
                5970,
                6046
            ],
            [
                6046,
                6046
            ],
            [
                6046,
                6065
            ],
            [
                6065,
                6166
            ],
            [
                6166,
                6228
            ],
            [
                6228,
                6327
            ],
            [
                6327,
                6460
            ],
            [
                6460,
                6511
            ],
            [
                6511,
                6511
            ],
            [
                6511,
                6511
            ],
            [
                6511,
                6511
            ],
            [
                6511,
                6511
            ],
            [
                6511,
                6511
            ],
            [
                6511,
                6572
            ],
            [
                6572,
                6624
            ],
            [
                6624,
                6658
            ],
            [
                6658,
                6719
            ],
            [
                6719,
                6719
            ],
            [
                6719,
                6719
            ],
            [
                6719,
                6849
            ],
            [
                6849,
                6895
            ],
            [
                6895,
                6924
            ],
            [
                6924,
                7037
            ],
            [
                7037,
                7037
            ],
            [
                7037,
                7123
            ],
            [
                7123,
                7139
            ],
            [
                7139,
                7181
            ],
            [
                7181,
                7197
            ],
            [
                7197,
                7236
            ],
            [
                7236,
                7252
            ],
            [
                7252,
                7319
            ],
            [
                7319,
                7449
            ],
            [
                7449,
                7449
            ],
            [
                7449,
                7449
            ],
            [
                7449,
                7490
            ],
            [
                7490,
                7510
            ],
            [
                7510,
                7558
            ],
            [
                7558,
                7653
            ],
            [
                7653,
                7728
            ],
            [
                7728,
                7760
            ],
            [
                7760,
                7862
            ],
            [
                7862,
                7882
            ],
            [
                7882,
                7882
            ],
            [
                7882,
                7938
            ],
            [
                7938,
                7938
            ],
            [
                7938,
                8016
            ],
            [
                8016,
                8079
            ],
            [
                8079,
                8225
            ],
            [
                8225,
                8305
            ],
            [
                8305,
                8343
            ],
            [
                8343,
                8437
            ],
            [
                8437,
                8509
            ],
            [
                8509,
                8645
            ],
            [
                8645,
                8671
            ],
            [
                8671,
                8671
            ],
            [
                8671,
                8689
            ],
            [
                8689,
                8856
            ],
            [
                8856,
                8856
            ],
            [
                8856,
                8902
            ],
            [
                8902,
                8975
            ],
            [
                8975,
                9019
            ],
            [
                9019,
                9047
            ],
            [
                9047,
                9194
            ],
            [
                9194,
                9204
            ],
            [
                9204,
                9265
            ],
            [
                9265,
                9289
            ],
            [
                9289,
                9307
            ],
            [
                9307,
                9389
            ],
            [
                9389,
                9473
            ],
            [
                9473,
                9640
            ],
            [
                9640,
                9689
            ],
            [
                9689,
                9734
            ],
            [
                9734,
                9754
            ],
            [
                9754,
                9870
            ],
            [
                9870,
                9916
            ],
            [
                9916,
                9968
            ],
            [
                9968,
                9989
            ],
            [
                9989,
                9989
            ],
            [
                9989,
                10040
            ],
            [
                10040,
                10088
            ],
            [
                10088,
                10233
            ],
            [
                10233,
                10268
            ],
            [
                10268,
                10275
            ],
            [
                10275,
                10275
            ],
            [
                10275,
                10333
            ],
            [
                10333,
                10431
            ],
            [
                10431,
                10554
            ],
            [
                10554,
                10653
            ],
            [
                10653,
                10809
            ],
            [
                10809,
                10942
            ],
            [
                10942,
                11092
            ],
            [
                11092,
                11133
            ],
            [
                11133,
                11133
            ],
            [
                11133,
                11133
            ],
            [
                11133,
                11161
            ],
            [
                11161,
                11210
            ],
            [
                11210,
                11282
            ],
            [
                11282,
                11324
            ],
            [
                11324,
                11324
            ],
            [
                11324,
                11399
            ],
            [
                11399,
                11535
            ],
            [
                11535,
                11535
            ],
            [
                11535,
                11640
            ],
            [
                11640,
                11763
            ],
            [
                11763,
                11831
            ],
            [
                11831,
                11899
            ],
            [
                11899,
                12028
            ],
            [
                12028,
                12081
            ],
            [
                12081,
                12203
            ],
            [
                12203,
                12234
            ],
            [
                12234,
                12369
            ],
            [
                12369,
                12471
            ],
            [
                12471,
                12561
            ],
            [
                12561,
                12598
            ],
            [
                12598,
                12657
            ],
            [
                12657,
                12757
            ],
            [
                12757,
                12791
            ],
            [
                12791,
                12822
            ],
            [
                12822,
                12927
            ],
            [
                12927,
                12953
            ],
            [
                12953,
                12953
            ],
            [
                12953,
                12953
            ],
            [
                12953,
                13007
            ],
            [
                13007,
                13038
            ],
            [
                13038,
                13047
            ],
            [
                13047,
                13047
            ],
            [
                13047,
                13066
            ],
            [
                13066,
                13066
            ],
            [
                13066,
                13088
            ],
            [
                13088,
                13128
            ],
            [
                13128,
                13128
            ],
            [
                13128,
                13215
            ],
            [
                13215,
                13374
            ],
            [
                13374,
                13465
            ],
            [
                13465,
                13567
            ],
            [
                13567,
                13608
            ],
            [
                13608,
                13651
            ]
        ]
    }
}