{
    "original": {
        "text": "Some ten or twelve days after George Vavasor's return to London from Westmoreland he appeared at Mr. Scruby's offices with four small slips of paper in his hand. Mr. Scruby, as usual, was pressing for money. The third election was coming on, and money was already being spent very freely among the men of the River Bank. So, at least, Mr. Scruby declared. Mr. Grimes, of the \"Handsome Man,\" had shown signs of returning allegiance. But Mr. Grimes could not afford to be loyal without money. He had his little family to protect. Mr. Scruby, too, had his little family, and was not ashamed to use it on this occasion. \"I'm a family man, Mr. Vavasor, and therefore I never run any risks. I never go a yard further than I can see my way back.\" This he had said in answer to a proposition that he should take George's note of hand for the expenses of the next election, payable in three months' time. \"It is so very hard to realize,\" said George, \"immediately upon a death, when all the property left is real property.\" \"Very hard indeed,\" said Mr. Scruby, who had heard with accuracy all the particulars of the old Squire's will. Vavasor understood the lawyer, cursed him inwardly, and suggested to himself that some day he might murder Mr. Scruby as well as John Grey,--and perhaps also a few more of his enemies. Two days after the interview in which his own note of hand had been refused, he again called in Great Marlborough Street. Upon this occasion he tendered to Mr. Scruby for his approval the four slips of paper which have been mentioned. Mr. Scruby regarded them with attention, looking first at one side horizontally, and then at the other side perpendicularly. But before we learn the judgement pronounced by Mr. Scruby as to these four slips of paper, we must go back to their earlier history. As they were still in their infancy, we shall not have to go back far.\nOne morning, at about eleven o'clock the parlour-maid came up to Alice, as she sat alone in the drawing-room in Queen Anne Street, and told her there was a \"gentleman\" in the hall waiting to be seen by her. We all know the tone in which servants announce a gentleman when they know that the gentleman is not a gentleman.\n\"A gentleman wanting to see me! What sort of a gentleman?\"\n\"Well, miss, I don't think he's just of our sort; but he's decent to look at.\"\nAlice Vavasor had no desire to deny herself to any person but one. She was well aware that the gentleman in the hall could not be her cousin George, and therefore she did not refuse to see him.\n\"Let him come up,\" she said. \"But I think, Jane, you ought to ask him his name.\" Jane did ask him his name, and came back immediately, announcing Mr. Levy.\nThis occurred immediately after the return of Mr. John Vavasor from Westmoreland. He had reached home late on the preceding evening, and at the moment of Mr. Levy's call was in his dressing-room.\nAlice got up to receive her visitor, and at once understood the tone of her maid's voice. Mr. Levy was certainly not a gentleman of the sort to which she had been most accustomed. He was a little dark man, with sharp eyes, set very near to each other in his head, with a beaked nose, thick at the bridge, and a black moustache, but no other beard. Alice did not at all like the look of Mr. Levy, but she stood up to receive him, made him a little bow, and asked him to sit down.\n\"Is papa dressed yet?\" Alice asked the servant.\n\"Well, miss, I don't think he is,--not to say dressed.\"\nAlice had thought it might be as well that Mr. Levy should know that there was a gentleman in the house with her.\n\"I've called about a little bit of business, miss,\" said Mr. Levy, when they were alone. \"Nothing as you need disturb yourself about. You'll find it all square, I think.\" Then he took a case out of his breast-pocket, and produced a note, which he handed to her. Alice took the note, and saw immediately that it was addressed to her by her cousin George. \"Yes, Mr. George Vavasor,\" said Mr. Levy. \"I dare say you never saw me before, miss?\"\n\"No, sir; I think not,\" said Alice.\n\"I am your cousin's clerk.\"\n\"Oh, you're Mr. Vavasor's clerk. I'll read his letter, if you please, sir.\"\n\"If you please, miss.\"\nGeorge Vavasor's letter to his cousin was as follows:--\nDEAR ALICE,\nAfter what passed between us when I last saw you I thought that on my return from Westmoreland I should learn that you had paid in at my bankers' the money that I require. But I find that this is not so; and of course I excuse you, because women so seldom know when or how to do that which business demands of them. You have, no doubt, heard the injustice which my grandfather has done me, and will probably feel as indignant as I do. I only mention this now, because the nature of his will makes it more than ever incumbent on you that you should be true to your pledge to me.\nTill there shall be some ground for a better understanding between us,--and this I do not doubt will come,--I think it wiser not to call, myself, at Queen Anne Street. I therefore send my confidential clerk with four bills, each of five hundred pounds, drawn at fourteen days' date, across which I will get you to write your name. Mr. Levy will show you the way in which this should be done. Your name must come under the word \"accepted,\" and just above the name of Messrs. Drummonds, where the money must be lying ready, at any rate, not later than Monday fortnight. Indeed, the money must be there some time on the Saturday. They know you so well at Drummonds' that you will not object to call on the Saturday afternoon, and ask if it is all right.\nI have certainly been inconvenienced by not finding the money as I expected on my return to town. If these bills are not properly provided for, the result will be very disastrous to me. I feel, however, sure that this will be done, both for your own sake and for mine.\nAffectionately yours,\nGEORGE VAVASOR.\nThe unparalleled impudence of this letter had the effect which the writer had intended. It made Alice think immediately of her own remissness,--if she had been remiss,--rather than of the enormity of his claim upon her. The decision with which he asked for her money, without any pretence at an excuse on his part, did for the time induce her to believe that she had no alternative but to give it to him, and that she had been wrong in delaying it. She had told him that he should have it, and she ought to have been as good as her word. She should not have forced upon him the necessity of demanding it.\nBut the idea of signing four bills was terrible to her, and she felt sure that she ought not to put her name to orders for so large an amount and then intrust them to such a man as Mr. Levy. Her father was in the house, and she might have asked him. The thought that she would do so of course occurred to her. But then it occurred to her also that were she to speak to her father as to this advancing of money to her cousin,--to this giving of money, for she now well understood that it would be a gift;--were she to consult her father in any way about it, he would hinder her, not only from signing the bills for Mr. Levy, but, as far as he could do so, from keeping the promise made to her cousin. She was resolved that George should have the money, and she knew that she could give it to him in spite of her father. But her father might probably be able to delay the gift, and thus rob it of its chief value. If she were to sign the bills, the money must be made to be forthcoming. So much she understood.\nMr. Levy had taken out the four bills from the same case, and had placed them on the table before him. \"Mr. Vavasor has explained, I believe, miss, what it is you have to do?\" he said.\n\"Yes, sir; my cousin has explained.\"\n\"And there is nothing else to trouble you with, I believe. If you will just write your name across them, here, I need not detain you by staying any longer.\" Mr. Levy was very anxious to make his visit as short as possible, since he had heard that Mr. John Vavasor was in the house.\nBut Alice hesitated. Two thousand pounds is a very serious sum of money. She had heard much of sharpers, and thought that she ought to be cautious. What if this man, of whom she had never before heard, should steal the bills after she had signed them? She looked again at her cousin's letter, chiefly with the object of gaining time.\n\"It's all right, miss,\" said Mr. Levy.\n\"Could you not leave them with me, sir?\" said Alice.\n\"Well; not very well, miss. No doubt Mr. Vavasor has explained it all; but the fact is, he must have them this afternoon. He has got a heavy sum to put down on the nail about this here election, and if it ain't down to-day, them on whom he has to depend will be all abroad.\"\n\"But, sir, the money will not be payable to-day. If I understand it, they are not cheques.\"\n\"No, miss, no; they are not cheques. But your name, miss, at fourteen days, is the same as ready money;--just the same.\"\nShe paused, and while she paused, he reached a pen for her from the writing-table, and then she signed the four bills as he held them before her. She was quick enough at doing this when she had once commenced the work. Her object, then, was that the man should be gone from the house before her father could meet him.\nThese were the four bits of paper which George Vavasor tendered to Mr. Scruby's notice on the occasion which we have now in hand. In doing so, he made use of them after the manner of a grand capitalist, who knows that he may assume certain airs as he allows the odours of the sweetness of his wealth to drop from him.\n\"You insisted on ready money, with your d---- suspicions,\" said he; \"and there it is. You're not afraid of fourteen days, I dare say.\"\n\"Fourteen days is neither here nor there,\" said Mr. Scruby. \"We can let our payments stand over as long as that, without doing any harm. I'll send one of my men down to Grimes, and tell him I can't see him, till,--let me see,\" and he looked at one of the bills, \"till the 15th.\"\nBut this was not exactly what George Vavasor wanted. He was desirous that the bills should be immediately turned into money, so that the necessity of forcing payments from Alice, should due provision for the bills not be made, might fall into other hands than his.\n\"We can wait till the 15th,\" said Scruby, as he handed the bits of paper back to his customer.\n\"You will want a thousand, you say?\" said George.\n\"A thousand to begin with. Certainly not less.\"\n\"Then you had better keep two of them.\"\n\"Well--no! I don't see the use of that. You had better collect them through your own banker, and let me have a cheque on the 15th or 16th.\"\n\"How cursed suspicious you are, Scruby.\"\n\"No, I ain't. I'm not a bit suspicious. I don't deal in such articles; that's all!\"\n\"What doubt can there be about such bills as those? Everybody knows that my cousin has a considerable fortune, altogether at her own disposal.\"\n\"The truth is, Mr. Vavasor, that bills with ladies' names on them,--ladies who are no way connected with business,--ain't just the paper that people like.\"\n\"Nothing on earth can be surer.\"\n\"You take them into the City for discount, and see if the bankers don't tell you the same. They may be done, of course, upon your name. I say nothing about that.\"\n\"I can explain to you the nature of the family arrangement, but I can't do that to a stranger. However, I don't mind.\"\n\"Of course not. The time is so short that it does not signify. Have them collected through your own bankers, and then, if it don't suit you to call, send me a cheque for a thousand pounds when the time is up.\" Then Mr. Scruby turned to some papers on his right hand, as though the interview had been long enough. Vavasor looked at him angrily, opening his wound at him and cursing him inwardly. Mr. Scruby went on with his paper, by no means regarding either the wound or the unspoken curses. Thereupon Vavasor got up and went away without any word of farewell.\nAs he walked along Great Marlborough Street, and through those unalluring streets which surround the Soho district, and so on to the Strand and his own lodgings, he still continued to think of some wide scheme of revenge,--of some scheme in which Mr. Scruby might be included. There had appeared something latterly in Mr. Scruby's manner to him, something of mingled impatience and familiarity, which made him feel that he had fallen in the attorney's estimation. It was not that the lawyer thought him to be less honourable, or less clever, than he had before thought him; but that the man was like a rat, and knew a falling house by the instinct that was in him. So George Vavasor cursed Mr. Scruby, and calculated some method of murdering him without detection.\nThe reader is not to suppose that the Member for the Chelsea Districts had, in truth, resolved to gratify his revenge by murder,--by murdering any of those persons whom he hated so vigorously. He did not, himself, think it probable that he would become a murderer. But he received some secret satisfaction in allowing his mind to dwell upon the subject, and in making those calculations. He reflected that it would not do to take off Scruby and John Grey at the same time, as it would be known that he was connected with both of them; unless, indeed, he was to take off a third person at the same time,--a third person, as to the expediency of ending whose career he made his calculations quite as often as he did in regard to any of those persons whom he cursed so often. It need hardly be explained to the reader that this third person was the sitting Member for the Chelsea Districts.\nAs he was himself in want of instant ready money Mr. Scruby's proposition that he should leave the four bills at his own bankers', to be collected when they came to maturity, did not suit him. He doubted much, also, whether at the end of the fourteen days the money would be forthcoming. Alice would be driven to tell her father, in order that the money might be procured, and John Vavasor would probably succeed in putting impediments in the way of the payment. He must take the bills into the City, and do the best there that he could with them. He was too late for this to-day, and therefore he went to his lodgings, and then down to the House. In the House he sat all the night with his hat over his eyes, making those little calculations of which I have spoken.\n\"You have heard the news; haven't you?\" said Mr. Bott to him, whispering in his ear.\n\"News; no. I haven't heard any news.\"\n\"Finespun has resigned, and Palliser is at this moment with the Duke of St. Bungay in the Lords' library.\"\n\"They may both be at the bottom of the Lords' fishpond, for what I care,\" said Vavasor.\n\"That's nonsense, you know,\" said Bott. \"Still, you know Palliser is Chancellor of the Exchequer at this moment. What a lucky fellow you are to have such a chance come to you directly you get in. As soon as he takes his seat down there, of course we shall go up behind him.\"\n\"We shall have another election in a month's time,\" said George. \"I'm safe enough,\" said Bott. \"It never hurts a man at elections to be closely connected with the Government.\"\nGeorge Vavasor was in the City by times the next morning, but he found that the City did not look with favourable eyes on his four bills. The City took them up, first horizontally, and then, with a twist of its hand, perpendicularly, and looked at them with distrustful eyes. The City repeated the name, Alice Vavasor, as though it were not esteemed a good name on Change. The City suggested that as the time was so short, the holder of the bills would be wise to hold them till he could collect the amount. It was very clear that the City suspected something wrong in the transaction. The City, by one of its mouths, asserted plainly that ladies' bills never meant business. George Vavasor cursed the City, and made his calculation about murdering it. Might not a river of strychnine be turned on round the Exchange about luncheon time? Three of the bills he left at last with his own bankers for collection, and retained the fourth in his breast-pocket, intending on the morrow to descend with it into those lower depths of the money market which he had not as yet visited. Again, on the next day, he went to work and succeeded to some extent. Among those lower depths he found a capitalist who was willing to advance him two hundred pounds, keeping that fourth bill in his possession as security. The capitalist was to have forty pounds for the transaction, and George cursed him as he took his cheque. George Vavasor knew quite enough of the commercial world to enable him to understand that a man must be in a very bad condition when he consents to pay forty pounds for the use of two hundred for fourteen days. He cursed the City. He cursed the House of Commons. He cursed his cousin Alice and his sister Kate. He cursed the memory of his grandfather. And he cursed himself.\nMr. Levy had hardly left the house in Queen Anne Street, before Alice had told her father what she had done. \"The money must be forthcoming,\" said Alice. To this her father made no immediate reply, but turning himself in his chair away from her with a sudden start, sat looking at the fire and shaking his head. \"The money must be made to be forthcoming,\" said Alice. \"Papa, will you see that it is done?\" This was very hard upon poor John Vavasor, and so he felt it to be. \"Papa, if you will not promise, I must go to Mr. Round about it myself, and must find out a broker to sell out for me. You would not wish that my name should be dishonoured.\"\n\"You will be ruined,\" said he, \"and for such a rascal as that!\"\n\"Never mind whether he is a rascal or not, papa. You must acknowledge that he has been treated harshly by his grandfather.\"\n\"I think that will was the wisest thing my father ever did. Had he left the estate to George, there wouldn't have been an acre of it left in the family in six months' time.\"\n\"But the life interest, papa!\"\n\"He would have raised all he could upon that, and it would have done him no good.\"\n\"At any rate, papa, he must have this two thousand pounds. You must promise me that.\"\n\"And then he will want more.\"\n\"No; I do not think he will ask for more. At any rate, I do not think that I am bound to give him all that I have.\"\n\"I should think not. I should like to know how you can be bound to give him anything?\"\n\"Because I promised it. I have signed the bills now, and it must be done.\" Still Mr. Vavasor made no promise. \"Papa, if you will not say that you will do it, I must go down to Mr. Round at once.\"\n\"I don't know that I can do it. I don't know that Mr. Round can do it. Your money is chiefly on mortgage.\" Then there was a pause for a moment in the conversation. \"Upon my word, I never heard of such a thing in my life,\" said Mr. Vavasor; \"I never did. Four thousand pounds given away to such a man as that, in three months! Four thousand pounds! And you say you do not intend to marry him.\"\n\"Certainly not; all that is over.\"\n\"And does he know that it is over?\"\n\"I suppose he does.\"\n\"You suppose so! Things of that sort are so often over with you!\" This was very cruel. Perhaps she had deserved the reproach, but still it was very cruel. The blow struck her with such force that she staggered under it. Tears came into her eyes, and she could hardly speak lest she should betray herself by sobbing.\n\"I know that I have behaved badly,\" she said at last; \"but I am punished, and you might spare me now!\"\n\"I didn't want to punish you,\" he said, getting up from his chair and walking about the room. \"I don't want to punish you. But, I don't want to see you ruined!\"\n\"I must go to Mr. Round then, myself.\"\nMr. Vavasor went on walking about the room, jingling the money in his trousers-pockets, and pushing the chairs about as he chanced to meet them. At last, he made a compromise with her. He would take a day to think whether he would assist her in getting the money, and communicate his decision to her on the following morning.",
        "paragraph_chars": [
            [
                0,
                1876
            ],
            [
                1876,
                2197
            ],
            [
                2197,
                2256
            ],
            [
                2256,
                2335
            ],
            [
                2335,
                2529
            ],
            [
                2529,
                2685
            ],
            [
                2685,
                2881
            ],
            [
                2881,
                3360
            ],
            [
                3360,
                3408
            ],
            [
                3408,
                3464
            ],
            [
                3464,
                3578
            ],
            [
                3578,
                4018
            ],
            [
                4018,
                4054
            ],
            [
                4054,
                4082
            ],
            [
                4082,
                4158
            ],
            [
                4158,
                4181
            ],
            [
                4181,
                4237
            ],
            [
                4237,
                4249
            ],
            [
                4249,
                4827
            ],
            [
                4827,
                5578
            ],
            [
                5578,
                5847
            ],
            [
                5847,
                5869
            ],
            [
                5869,
                5885
            ],
            [
                5885,
                6490
            ],
            [
                6490,
                7499
            ],
            [
                7499,
                7684
            ],
            [
                7684,
                7721
            ],
            [
                7721,
                8003
            ],
            [
                8003,
                8337
            ],
            [
                8337,
                8376
            ],
            [
                8376,
                8429
            ],
            [
                8429,
                8704
            ],
            [
                8704,
                8796
            ],
            [
                8796,
                8917
            ],
            [
                8917,
                9235
            ],
            [
                9235,
                9553
            ],
            [
                9553,
                9688
            ],
            [
                9688,
                9967
            ],
            [
                9967,
                10232
            ],
            [
                10232,
                10327
            ],
            [
                10327,
                10377
            ],
            [
                10377,
                10425
            ],
            [
                10425,
                10465
            ],
            [
                10465,
                10605
            ],
            [
                10605,
                10646
            ],
            [
                10646,
                10730
            ],
            [
                10730,
                10874
            ],
            [
                10874,
                11030
            ],
            [
                11030,
                11063
            ],
            [
                11063,
                11226
            ],
            [
                11226,
                11345
            ],
            [
                11345,
                11907
            ],
            [
                11907,
                12672
            ],
            [
                12672,
                13560
            ],
            [
                13560,
                14327
            ],
            [
                14327,
                14412
            ],
            [
                14412,
                14450
            ],
            [
                14450,
                14557
            ],
            [
                14557,
                14645
            ],
            [
                14645,
                14920
            ],
            [
                14920,
                15096
            ],
            [
                15096,
                16877
            ],
            [
                16877,
                17526
            ],
            [
                17526,
                17590
            ],
            [
                17590,
                17714
            ],
            [
                17714,
                17888
            ],
            [
                17888,
                17919
            ],
            [
                17919,
                18002
            ],
            [
                18002,
                18088
            ],
            [
                18088,
                18118
            ],
            [
                18118,
                18234
            ],
            [
                18234,
                18321
            ],
            [
                18321,
                18517
            ],
            [
                18517,
                18910
            ],
            [
                18910,
                18945
            ],
            [
                18945,
                18981
            ],
            [
                18981,
                19002
            ],
            [
                19002,
                19318
            ],
            [
                19318,
                19421
            ],
            [
                19421,
                19582
            ],
            [
                19582,
                19621
            ],
            [
                19621,
                19946
            ]
        ],
        "segment_chars": [
            [
                0,
                162
            ],
            [
                162,
                208
            ],
            [
                208,
                321
            ],
            [
                321,
                356
            ],
            [
                356,
                432
            ],
            [
                432,
                491
            ],
            [
                491,
                528
            ],
            [
                528,
                616
            ],
            [
                616,
                685
            ],
            [
                685,
                740
            ],
            [
                740,
                896
            ],
            [
                896,
                1015
            ],
            [
                1015,
                1126
            ],
            [
                1126,
                1311
            ],
            [
                1311,
                1433
            ],
            [
                1433,
                1546
            ],
            [
                1546,
                1671
            ],
            [
                1671,
                1805
            ],
            [
                1805,
                1876
            ],
            [
                1876,
                2083
            ],
            [
                2083,
                2197
            ],
            [
                2197,
                2229
            ],
            [
                2229,
                2256
            ],
            [
                2256,
                2335
            ],
            [
                2335,
                2402
            ],
            [
                2402,
                2529
            ],
            [
                2529,
                2558
            ],
            [
                2558,
                2610
            ],
            [
                2610,
                2685
            ],
            [
                2685,
                2767
            ],
            [
                2767,
                2881
            ],
            [
                2881,
                2971
            ],
            [
                2971,
                3061
            ],
            [
                3061,
                3229
            ],
            [
                3229,
                3360
            ],
            [
                3360,
                3383
            ],
            [
                3383,
                3408
            ],
            [
                3408,
                3464
            ],
            [
                3464,
                3578
            ],
            [
                3578,
                3667
            ],
            [
                3667,
                3712
            ],
            [
                3712,
                3749
            ],
            [
                3749,
                3840
            ],
            [
                3840,
                3932
            ],
            [
                3932,
                3974
            ],
            [
                3974,
                4018
            ],
            [
                4018,
                4054
            ],
            [
                4054,
                4082
            ],
            [
                4082,
                4115
            ],
            [
                4115,
                4158
            ],
            [
                4158,
                4181
            ],
            [
                4181,
                4237
            ],
            [
                4237,
                4249
            ],
            [
                4249,
                4421
            ],
            [
                4421,
                4565
            ],
            [
                4565,
                4684
            ],
            [
                4684,
                4827
            ],
            [
                4827,
                4995
            ],
            [
                4995,
                5158
            ],
            [
                5158,
                5219
            ],
            [
                5219,
                5395
            ],
            [
                5395,
                5454
            ],
            [
                5454,
                5578
            ],
            [
                5578,
                5676
            ],
            [
                5676,
                5764
            ],
            [
                5764,
                5847
            ],
            [
                5847,
                5869
            ],
            [
                5869,
                5885
            ],
            [
                5885,
                5973
            ],
            [
                5973,
                6105
            ],
            [
                6105,
                6334
            ],
            [
                6334,
                6423
            ],
            [
                6423,
                6490
            ],
            [
                6490,
                6681
            ],
            [
                6681,
                6740
            ],
            [
                6740,
                6800
            ],
            [
                6800,
                7190
            ],
            [
                7190,
                7309
            ],
            [
                7309,
                7402
            ],
            [
                7402,
                7475
            ],
            [
                7475,
                7499
            ],
            [
                7499,
                7602
            ],
            [
                7602,
                7675
            ],
            [
                7675,
                7684
            ],
            [
                7684,
                7721
            ],
            [
                7721,
                7780
            ],
            [
                7780,
                7878
            ],
            [
                7878,
                8003
            ],
            [
                8003,
                8024
            ],
            [
                8024,
                8076
            ],
            [
                8076,
                8151
            ],
            [
                8151,
                8255
            ],
            [
                8255,
                8337
            ],
            [
                8337,
                8376
            ],
            [
                8376,
                8417
            ],
            [
                8417,
                8429
            ],
            [
                8429,
                8457
            ],
            [
                8457,
                8551
            ],
            [
                8551,
                8704
            ],
            [
                8704,
                8753
            ],
            [
                8753,
                8796
            ],
            [
                8796,
                8833
            ],
            [
                8833,
                8917
            ],
            [
                8917,
                9063
            ],
            [
                9063,
                9136
            ],
            [
                9136,
                9235
            ],
            [
                9235,
                9365
            ],
            [
                9365,
                9553
            ],
            [
                9553,
                9639
            ],
            [
                9639,
                9688
            ],
            [
                9688,
                9748
            ],
            [
                9748,
                9825
            ],
            [
                9825,
                9967
            ],
            [
                9967,
                10020
            ],
            [
                10020,
                10232
            ],
            [
                10232,
                10327
            ],
            [
                10327,
                10364
            ],
            [
                10364,
                10377
            ],
            [
                10377,
                10404
            ],
            [
                10404,
                10425
            ],
            [
                10425,
                10465
            ],
            [
                10465,
                10476
            ],
            [
                10476,
                10505
            ],
            [
                10505,
                10605
            ],
            [
                10605,
                10646
            ],
            [
                10646,
                10660
            ],
            [
                10660,
                10686
            ],
            [
                10686,
                10730
            ],
            [
                10730,
                10782
            ],
            [
                10782,
                10874
            ],
            [
                10874,
                11030
            ],
            [
                11030,
                11063
            ],
            [
                11063,
                11154
            ],
            [
                11154,
                11199
            ],
            [
                11199,
                11226
            ],
            [
                11226,
                11321
            ],
            [
                11321,
                11345
            ],
            [
                11345,
                11361
            ],
            [
                11361,
                11408
            ],
            [
                11408,
                11555
            ],
            [
                11555,
                11658
            ],
            [
                11658,
                11740
            ],
            [
                11740,
                11838
            ],
            [
                11838,
                11907
            ],
            [
                11907,
                12184
            ],
            [
                12184,
                12371
            ],
            [
                12371,
                12572
            ],
            [
                12572,
                12672
            ],
            [
                12672,
                12865
            ],
            [
                12865,
                12937
            ],
            [
                12937,
                13060
            ],
            [
                13060,
                13445
            ],
            [
                13445,
                13560
            ],
            [
                13560,
                13753
            ],
            [
                13753,
                13848
            ],
            [
                13848,
                14023
            ],
            [
                14023,
                14108
            ],
            [
                14108,
                14208
            ],
            [
                14208,
                14327
            ],
            [
                14327,
                14367
            ],
            [
                14367,
                14412
            ],
            [
                14412,
                14423
            ],
            [
                14423,
                14450
            ],
            [
                14450,
                14557
            ],
            [
                14557,
                14645
            ],
            [
                14645,
                14685
            ],
            [
                14685,
                14758
            ],
            [
                14758,
                14841
            ],
            [
                14841,
                14920
            ],
            [
                14920,
                14985
            ],
            [
                14985,
                15015
            ],
            [
                15015,
                15096
            ],
            [
                15096,
                15234
            ],
            [
                15234,
                15372
            ],
            [
                15372,
                15469
            ],
            [
                15469,
                15604
            ],
            [
                15604,
                15682
            ],
            [
                15682,
                15772
            ],
            [
                15772,
                15849
            ],
            [
                15849,
                15934
            ],
            [
                15934,
                16172
            ],
            [
                16172,
                16242
            ],
            [
                16242,
                16396
            ],
            [
                16396,
                16502
            ],
            [
                16502,
                16713
            ],
            [
                16713,
                16733
            ],
            [
                16733,
                16765
            ],
            [
                16765,
                16813
            ],
            [
                16813,
                16854
            ],
            [
                16854,
                16877
            ],
            [
                16877,
                16986
            ],
            [
                16986,
                17031
            ],
            [
                17031,
                17189
            ],
            [
                17189,
                17245
            ],
            [
                17245,
                17283
            ],
            [
                17283,
                17351
            ],
            [
                17351,
                17470
            ],
            [
                17470,
                17526
            ],
            [
                17526,
                17590
            ],
            [
                17590,
                17639
            ],
            [
                17639,
                17714
            ],
            [
                17714,
                17774
            ],
            [
                17774,
                17888
            ],
            [
                17888,
                17919
            ],
            [
                17919,
                18002
            ],
            [
                18002,
                18061
            ],
            [
                18061,
                18088
            ],
            [
                18088,
                18118
            ],
            [
                18118,
                18160
            ],
            [
                18160,
                18234
            ],
            [
                18234,
                18255
            ],
            [
                18255,
                18321
            ],
            [
                18321,
                18345
            ],
            [
                18345,
                18396
            ],
            [
                18396,
                18431
            ],
            [
                18431,
                18517
            ],
            [
                18517,
                18549
            ],
            [
                18549,
                18588
            ],
            [
                18588,
                18624
            ],
            [
                18624,
                18681
            ],
            [
                18681,
                18771
            ],
            [
                18771,
                18843
            ],
            [
                18843,
                18865
            ],
            [
                18865,
                18910
            ],
            [
                18910,
                18945
            ],
            [
                18945,
                18981
            ],
            [
                18981,
                19002
            ],
            [
                19002,
                19019
            ],
            [
                19019,
                19068
            ],
            [
                19068,
                19089
            ],
            [
                19089,
                19157
            ],
            [
                19157,
                19222
            ],
            [
                19222,
                19318
            ],
            [
                19318,
                19421
            ],
            [
                19421,
                19515
            ],
            [
                19515,
                19544
            ],
            [
                19544,
                19582
            ],
            [
                19582,
                19621
            ],
            [
                19621,
                19766
            ],
            [
                19766,
                19806
            ],
            [
                19806,
                19946
            ]
        ],
        "overlap_chars": [
            [
                0,
                63
            ],
            [
                82,
                161
            ],
            [
                162,
                208
            ],
            [
                208,
                321
            ],
            [
                321,
                355
            ],
            [
                896,
                902
            ],
            [
                906,
                926
            ],
            [
                926,
                954
            ],
            [
                960,
                1014
            ],
            [
                1015,
                1065
            ],
            [
                1080,
                1083
            ],
            [
                1103,
                1126
            ],
            [
                1126,
                1133
            ],
            [
                1157,
                1264
            ],
            [
                1267,
                1311
            ],
            [
                1311,
                1319
            ],
            [
                1386,
                1403
            ],
            [
                1467,
                1477
            ],
            [
                1495,
                1545
            ],
            [
                1675,
                1690
            ],
            [
                1719,
                1721
            ],
            [
                1723,
                1729
            ],
            [
                1753,
                1805
            ],
            [
                1805,
                1876
            ],
            [
                1876,
                1887
            ],
            [
                1913,
                2043
            ],
            [
                2056,
                2063
            ],
            [
                2044,
                2055
            ],
            [
                2081,
                2083
            ],
            [
                2083,
                2162
            ],
            [
                2177,
                2197
            ],
            [
                2229,
                2256
            ],
            [
                2256,
                2304
            ],
            [
                2332,
                2335
            ],
            [
                2335,
                2348
            ],
            [
                2406,
                2409
            ],
            [
                2415,
                2439
            ],
            [
                2452,
                2501
            ],
            [
                2524,
                2527
            ],
            [
                2610,
                2614
            ],
            [
                2623,
                2626
            ],
            [
                2662,
                2684
            ],
            [
                2822,
                2824
            ],
            [
                2685,
                2689
            ],
            [
                2735,
                2747
            ],
            [
                2855,
                2881
            ],
            [
                2881,
                2971
            ],
            [
                2971,
                2979
            ],
            [
                3064,
                3097
            ],
            [
                3104,
                3107
            ],
            [
                3098,
                3103
            ],
            [
                3150,
                3163
            ],
            [
                3184,
                3207
            ],
            [
                3227,
                3229
            ],
            [
                3229,
                3242
            ],
            [
                3250,
                3266
            ],
            [
                3305,
                3308
            ],
            [
                3275,
                3284
            ],
            [
                3337,
                3360
            ],
            [
                3360,
                3383
            ],
            [
                3383,
                3406
            ],
            [
                3406,
                3408
            ],
            [
                3408,
                3409
            ],
            [
                3421,
                3434
            ],
            [
                3413,
                3419
            ],
            [
                3461,
                3464
            ],
            [
                3578,
                3621
            ],
            [
                3627,
                3667
            ],
            [
                3667,
                3712
            ],
            [
                3712,
                3749
            ],
            [
                3749,
                3756
            ],
            [
                3799,
                3840
            ],
            [
                3840,
                3932
            ],
            [
                4054,
                4059
            ],
            [
                4094,
                4113
            ],
            [
                4085,
                4086
            ],
            [
                4079,
                4082
            ],
            [
                4181,
                4204
            ],
            [
                4219,
                4234
            ],
            [
                4237,
                4249
            ],
            [
                4249,
                4297
            ],
            [
                4298,
                4335
            ],
            [
                4339,
                4421
            ],
            [
                4421,
                4509
            ],
            [
                4518,
                4527
            ],
            [
                4539,
                4565
            ],
            [
                4565,
                4590
            ],
            [
                4591,
                4684
            ],
            [
                4684,
                4703
            ],
            [
                4707,
                4763
            ],
            [
                4781,
                4827
            ],
            [
                4827,
                4897
            ],
            [
                4935,
                4963
            ],
            [
                4965,
                4971
            ],
            [
                4993,
                4995
            ],
            [
                4995,
                5014
            ],
            [
                5028,
                5158
            ],
            [
                5158,
                5180
            ],
            [
                5198,
                5219
            ],
            [
                5219,
                5341
            ],
            [
                5362,
                5395
            ],
            [
                5395,
                5454
            ],
            [
                5483,
                5488
            ],
            [
                5499,
                5514
            ],
            [
                5464,
                5467
            ],
            [
                5518,
                5578
            ],
            [
                5578,
                5676
            ],
            [
                5676,
                5740
            ],
            [
                5746,
                5764
            ],
            [
                5764,
                5847
            ],
            [
                5847,
                5869
            ],
            [
                5869,
                5885
            ],
            [
                5885,
                5973
            ],
            [
                5973,
                6027
            ],
            [
                6054,
                6105
            ],
            [
                6299,
                6302
            ],
            [
                6239,
                6278
            ],
            [
                6285,
                6288
            ],
            [
                6105,
                6108
            ],
            [
                6146,
                6151
            ],
            [
                6332,
                6334
            ],
            [
                6334,
                6373
            ],
            [
                6421,
                6423
            ],
            [
                6423,
                6449
            ],
            [
                6455,
                6458
            ],
            [
                6459,
                6490
            ],
            [
                6490,
                6640
            ],
            [
                6649,
                6681
            ],
            [
                6681,
                6717
            ],
            [
                6735,
                6739
            ],
            [
                6800,
                6803
            ],
            [
                6809,
                6827
            ],
            [
                6833,
                6837
            ],
            [
                6843,
                6846
            ],
            [
                6838,
                6842
            ],
            [
                6847,
                6869
            ],
            [
                7037,
                7042
            ],
            [
                6876,
                6899
            ],
            [
                7045,
                7055
            ],
            [
                7063,
                7067
            ],
            [
                7129,
                7137
            ],
            [
                7143,
                7190
            ],
            [
                7190,
                7240
            ],
            [
                7309,
                7329
            ],
            [
                7339,
                7364
            ],
            [
                7400,
                7402
            ],
            [
                7402,
                7408
            ],
            [
                7422,
                7450
            ],
            [
                7462,
                7474
            ],
            [
                7499,
                7536
            ],
            [
                7557,
                7589
            ],
            [
                7600,
                7601
            ],
            [
                7780,
                7875
            ],
            [
                7878,
                7890
            ],
            [
                7896,
                8003
            ],
            [
                8003,
                8024
            ],
            [
                8024,
                8076
            ],
            [
                8151,
                8255
            ],
            [
                8255,
                8337
            ],
            [
                8337,
                8376
            ],
            [
                8376,
                8409
            ],
            [
                8414,
                8417
            ],
            [
                8417,
                8429
            ],
            [
                8429,
                8457
            ],
            [
                8504,
                8516
            ],
            [
                8466,
                8477
            ],
            [
                8520,
                8551
            ],
            [
                8551,
                8585
            ],
            [
                8598,
                8622
            ],
            [
                8701,
                8704
            ],
            [
                8704,
                8744
            ],
            [
                8751,
                8753
            ],
            [
                8753,
                8796
            ],
            [
                8796,
                8806
            ],
            [
                8811,
                8833
            ],
            [
                8833,
                8898
            ],
            [
                8914,
                8917
            ],
            [
                8933,
                8953
            ],
            [
                8972,
                8975
            ],
            [
                8962,
                8967
            ],
            [
                8998,
                9034
            ],
            [
                9061,
                9063
            ],
            [
                9235,
                9289
            ],
            [
                9299,
                9312
            ],
            [
                9376,
                9377
            ],
            [
                9356,
                9358
            ],
            [
                9404,
                9436
            ],
            [
                9551,
                9553
            ],
            [
                9553,
                9594
            ],
            [
                9599,
                9639
            ],
            [
                9639,
                9688
            ],
            [
                9688,
                9748
            ],
            [
                9825,
                9899
            ],
            [
                9915,
                9967
            ],
            [
                9967,
                9983
            ],
            [
                9992,
                10020
            ],
            [
                10020,
                10022
            ],
            [
                10036,
                10091
            ],
            [
                10181,
                10184
            ],
            [
                10230,
                10232
            ],
            [
                10327,
                10364
            ],
            [
                10364,
                10368
            ],
            [
                10375,
                10377
            ],
            [
                10377,
                10402
            ],
            [
                10425,
                10465
            ],
            [
                10465,
                10470
            ],
            [
                10472,
                10476
            ],
            [
                10476,
                10505
            ],
            [
                10505,
                10605
            ],
            [
                10605,
                10646
            ],
            [
                10646,
                10660
            ],
            [
                10686,
                10727
            ],
            [
                10875,
                10939
            ],
            [
                10990,
                11000
            ],
            [
                11016,
                11027
            ],
            [
                11064,
                11091
            ],
            [
                11104,
                11154
            ],
            [
                11154,
                11197
            ],
            [
                11226,
                11321
            ],
            [
                11321,
                11345
            ],
            [
                11345,
                11361
            ],
            [
                11361,
                11408
            ],
            [
                11408,
                11462
            ],
            [
                11494,
                11554
            ],
            [
                11555,
                11592
            ],
            [
                11612,
                11658
            ],
            [
                11658,
                11688
            ],
            [
                11718,
                11738
            ],
            [
                11710,
                11713
            ],
            [
                11738,
                11740
            ],
            [
                11848,
                11876
            ],
            [
                11905,
                11907
            ],
            [
                11907,
                11925
            ],
            [
                12004,
                12007
            ],
            [
                11970,
                12003
            ],
            [
                12008,
                12012
            ],
            [
                11950,
                11951
            ],
            [
                12033,
                12071
            ],
            [
                12078,
                12127
            ],
            [
                12145,
                12184
            ],
            [
                12274,
                12300
            ],
            [
                12222,
                12244
            ],
            [
                12308,
                12358
            ],
            [
                12369,
                12371
            ],
            [
                12490,
                12541
            ],
            [
                12546,
                12554
            ],
            [
                12570,
                12572
            ],
            [
                12572,
                12672
            ],
            [
                12672,
                12757
            ],
            [
                12815,
                12818
            ],
            [
                12767,
                12769
            ],
            [
                12918,
                12937
            ],
            [
                12937,
                12952
            ],
            [
                12958,
                13024
            ],
            [
                13058,
                13060
            ],
            [
                13060,
                13096
            ],
            [
                13102,
                13232
            ],
            [
                13558,
                13560
            ],
            [
                13560,
                13565
            ],
            [
                13589,
                13596
            ],
            [
                13603,
                13608
            ],
            [
                13609,
                13753
            ],
            [
                13753,
                13768
            ],
            [
                13776,
                13848
            ],
            [
                13848,
                13859
            ],
            [
                13870,
                13888
            ],
            [
                13931,
                13964
            ],
            [
                14010,
                14023
            ],
            [
                14023,
                14108
            ],
            [
                14108,
                14132
            ],
            [
                14139,
                14140
            ],
            [
                14155,
                14162
            ],
            [
                14189,
                14208
            ],
            [
                14221,
                14231
            ],
            [
                14236,
                14269
            ],
            [
                14325,
                14327
            ],
            [
                14327,
                14367
            ],
            [
                14367,
                14380
            ],
            [
                14387,
                14412
            ],
            [
                14423,
                14450
            ],
            [
                14450,
                14557
            ],
            [
                14557,
                14616
            ],
            [
                14622,
                14645
            ],
            [
                14645,
                14685
            ],
            [
                14758,
                14841
            ],
            [
                14841,
                14920
            ],
            [
                14920,
                14984
            ],
            [
                14985,
                15015
            ],
            [
                15015,
                15096
            ],
            [
                15096,
                15126
            ],
            [
                15136,
                15234
            ],
            [
                15234,
                15255
            ],
            [
                15354,
                15362
            ],
            [
                15275,
                15280
            ],
            [
                15381,
                15398
            ],
            [
                15400,
                15414
            ],
            [
                15330,
                15333
            ],
            [
                15478,
                15604
            ],
            [
                15604,
                15681
            ],
            [
                15772,
                15849
            ],
            [
                15849,
                15893
            ],
            [
                15900,
                15912
            ],
            [
                15919,
                15934
            ],
            [
                15961,
                15968
            ],
            [
                15953,
                15960
            ],
            [
                15934,
                15952
            ],
            [
                15969,
                16009
            ],
            [
                16019,
                16036
            ],
            [
                16044,
                16050
            ],
            [
                16170,
                16172
            ],
            [
                16182,
                16194
            ],
            [
                16196,
                16198
            ],
            [
                16254,
                16266
            ],
            [
                16177,
                16178
            ],
            [
                16212,
                16215
            ],
            [
                16270,
                16364
            ],
            [
                16383,
                16396
            ],
            [
                16396,
                16502
            ],
            [
                16517,
                16521
            ],
            [
                16587,
                16713
            ],
            [
                16713,
                16733
            ],
            [
                16733,
                16765
            ],
            [
                16765,
                16813
            ],
            [
                16813,
                16854
            ],
            [
                16854,
                16877
            ],
            [
                16877,
                16985
            ],
            [
                16986,
                17031
            ],
            [
                17245,
                17283
            ],
            [
                17283,
                17287
            ],
            [
                17324,
                17325
            ],
            [
                17326,
                17329
            ],
            [
                17341,
                17349
            ],
            [
                17292,
                17306
            ],
            [
                17349,
                17351
            ],
            [
                17351,
                17405
            ],
            [
                17415,
                17426
            ],
            [
                17432,
                17436
            ],
            [
                17441,
                17468
            ],
            [
                17526,
                17590
            ],
            [
                17590,
                17639
            ],
            [
                17639,
                17647
            ],
            [
                17660,
                17714
            ],
            [
                17714,
                17774
            ],
            [
                17778,
                17780
            ],
            [
                17774,
                17777
            ],
            [
                17781,
                17888
            ],
            [
                18002,
                18059
            ],
            [
                18088,
                18118
            ],
            [
                18118,
                18160
            ],
            [
                18160,
                18234
            ],
            [
                18234,
                18255
            ],
            [
                18281,
                18284
            ],
            [
                18292,
                18321
            ],
            [
                18321,
                18345
            ],
            [
                18345,
                18395
            ],
            [
                18549,
                18588
            ],
            [
                18588,
                18624
            ],
            [
                18647,
                18659
            ],
            [
                18679,
                18681
            ],
            [
                18681,
                18682
            ],
            [
                18696,
                18725
            ],
            [
                18769,
                18771
            ],
            [
                18771,
                18843
            ],
            [
                18865,
                18910
            ],
            [
                18910,
                18945
            ],
            [
                18945,
                18981
            ],
            [
                18981,
                19002
            ],
            [
                19002,
                19019
            ],
            [
                19019,
                19068
            ],
            [
                19068,
                19089
            ],
            [
                19157,
                19222
            ],
            [
                19222,
                19318
            ],
            [
                19318,
                19421
            ],
            [
                19421,
                19471
            ],
            [
                19487,
                19515
            ],
            [
                19544,
                19547
            ],
            [
                19549,
                19582
            ],
            [
                19766,
                19773
            ],
            [
                19775,
                19806
            ],
            [
                19806,
                19851
            ],
            [
                19859,
                19862
            ],
            [
                19874,
                19888
            ],
            [
                19917,
                19920
            ],
            [
                19901,
                19913
            ],
            [
                19921,
                19946
            ]
        ],
        "row_chars": [
            [
                0,
                162
            ],
            [
                162,
                208
            ],
            [
                208,
                321
            ],
            [
                321,
                356
            ],
            [
                356,
                432
            ],
            [
                432,
                491
            ],
            [
                491,
                528
            ],
            [
                528,
                616
            ],
            [
                616,
                685
            ],
            [
                685,
                740
            ],
            [
                740,
                896
            ],
            [
                896,
                1015
            ],
            [
                1015,
                1126
            ],
            [
                1126,
                1311
            ],
            [
                1311,
                1546
            ],
            [
                1546,
                1671
            ],
            [
                1671,
                1805
            ],
            [
                1805,
                1876
            ],
            [
                1876,
                2083
            ],
            [
                2083,
                2197
            ],
            [
                2197,
                2229
            ],
            [
                2229,
                2256
            ],
            [
                2256,
                2335
            ],
            [
                2335,
                2529
            ],
            [
                2529,
                2558
            ],
            [
                2558,
                2610
            ],
            [
                2610,
                2685
            ],
            [
                2685,
                2881
            ],
            [
                2881,
                2971
            ],
            [
                2971,
                3229
            ],
            [
                3229,
                3360
            ],
            [
                3360,
                3383
            ],
            [
                3383,
                3408
            ],
            [
                3408,
                3464
            ],
            [
                3464,
                3578
            ],
            [
                3578,
                3667
            ],
            [
                3667,
                3712
            ],
            [
                3712,
                3749
            ],
            [
                3749,
                3840
            ],
            [
                3840,
                3932
            ],
            [
                3932,
                3974
            ],
            [
                3974,
                4018
            ],
            [
                4018,
                4054
            ],
            [
                4054,
                4115
            ],
            [
                4115,
                4158
            ],
            [
                4158,
                4181
            ],
            [
                4181,
                4237
            ],
            [
                4237,
                4249
            ],
            [
                4249,
                4421
            ],
            [
                4421,
                4565
            ],
            [
                4565,
                4684
            ],
            [
                4684,
                4827
            ],
            [
                4827,
                4995
            ],
            [
                4995,
                5158
            ],
            [
                5158,
                5219
            ],
            [
                5219,
                5395
            ],
            [
                5395,
                5454
            ],
            [
                5454,
                5578
            ],
            [
                5578,
                5676
            ],
            [
                5676,
                5764
            ],
            [
                5764,
                5847
            ],
            [
                5847,
                5869
            ],
            [
                5869,
                5885
            ],
            [
                5885,
                5973
            ],
            [
                5973,
                6105
            ],
            [
                6105,
                6334
            ],
            [
                6334,
                6423
            ],
            [
                6423,
                6490
            ],
            [
                6490,
                6681
            ],
            [
                6681,
                6740
            ],
            [
                6740,
                6800
            ],
            [
                6800,
                7190
            ],
            [
                7190,
                7402
            ],
            [
                7402,
                7475
            ],
            [
                7475,
                7499
            ],
            [
                7499,
                7602
            ],
            [
                7602,
                7675
            ],
            [
                7675,
                7684
            ],
            [
                7684,
                7721
            ],
            [
                7721,
                7780
            ],
            [
                7780,
                7878
            ],
            [
                7878,
                8003
            ],
            [
                8003,
                8024
            ],
            [
                8024,
                8076
            ],
            [
                8076,
                8151
            ],
            [
                8151,
                8255
            ],
            [
                8255,
                8337
            ],
            [
                8337,
                8376
            ],
            [
                8376,
                8417
            ],
            [
                8417,
                8429
            ],
            [
                8429,
                8457
            ],
            [
                8457,
                8551
            ],
            [
                8551,
                8704
            ],
            [
                8704,
                8753
            ],
            [
                8753,
                8796
            ],
            [
                8796,
                8833
            ],
            [
                8833,
                8917
            ],
            [
                8917,
                9063
            ],
            [
                9063,
                9136
            ],
            [
                9136,
                9235
            ],
            [
                9235,
                9553
            ],
            [
                9553,
                9639
            ],
            [
                9639,
                9688
            ],
            [
                9688,
                9748
            ],
            [
                9748,
                9825
            ],
            [
                9825,
                9967
            ],
            [
                9967,
                10020
            ],
            [
                10020,
                10232
            ],
            [
                10232,
                10327
            ],
            [
                10327,
                10364
            ],
            [
                10364,
                10377
            ],
            [
                10377,
                10404
            ],
            [
                10404,
                10425
            ],
            [
                10425,
                10465
            ],
            [
                10465,
                10476
            ],
            [
                10476,
                10505
            ],
            [
                10505,
                10605
            ],
            [
                10605,
                10646
            ],
            [
                10646,
                10660
            ],
            [
                10660,
                10686
            ],
            [
                10686,
                10730
            ],
            [
                10730,
                10782
            ],
            [
                10782,
                10874
            ],
            [
                10874,
                11030
            ],
            [
                11030,
                11063
            ],
            [
                11063,
                11154
            ],
            [
                11154,
                11199
            ],
            [
                11199,
                11226
            ],
            [
                11226,
                11321
            ],
            [
                11321,
                11345
            ],
            [
                11345,
                11361
            ],
            [
                11361,
                11408
            ],
            [
                11408,
                11555
            ],
            [
                11555,
                11658
            ],
            [
                11658,
                11740
            ],
            [
                11740,
                11838
            ],
            [
                11838,
                11907
            ],
            [
                11907,
                12184
            ],
            [
                12184,
                12371
            ],
            [
                12371,
                12572
            ],
            [
                12572,
                12672
            ],
            [
                12672,
                12937
            ],
            [
                12937,
                13060
            ],
            [
                13060,
                13560
            ],
            [
                13560,
                13753
            ],
            [
                13753,
                13848
            ],
            [
                13848,
                14023
            ],
            [
                14023,
                14108
            ],
            [
                14108,
                14208
            ],
            [
                14208,
                14327
            ],
            [
                14327,
                14367
            ],
            [
                14367,
                14412
            ],
            [
                14412,
                14423
            ],
            [
                14423,
                14450
            ],
            [
                14450,
                14557
            ],
            [
                14557,
                14645
            ],
            [
                14645,
                14685
            ],
            [
                14685,
                14758
            ],
            [
                14758,
                14841
            ],
            [
                14841,
                14920
            ],
            [
                14920,
                14985
            ],
            [
                14985,
                15015
            ],
            [
                15015,
                15096
            ],
            [
                15096,
                15234
            ],
            [
                15234,
                15604
            ],
            [
                15604,
                15682
            ],
            [
                15682,
                15772
            ],
            [
                15772,
                15849
            ],
            [
                15849,
                15934
            ],
            [
                15934,
                16172
            ],
            [
                16172,
                16396
            ],
            [
                16396,
                16502
            ],
            [
                16502,
                16713
            ],
            [
                16713,
                16733
            ],
            [
                16733,
                16765
            ],
            [
                16765,
                16813
            ],
            [
                16813,
                16854
            ],
            [
                16854,
                16877
            ],
            [
                16877,
                16986
            ],
            [
                16986,
                17031
            ],
            [
                17031,
                17189
            ],
            [
                17189,
                17245
            ],
            [
                17245,
                17283
            ],
            [
                17283,
                17351
            ],
            [
                17351,
                17470
            ],
            [
                17470,
                17526
            ],
            [
                17526,
                17590
            ],
            [
                17590,
                17639
            ],
            [
                17639,
                17714
            ],
            [
                17714,
                17774
            ],
            [
                17774,
                17888
            ],
            [
                17888,
                17919
            ],
            [
                17919,
                18002
            ],
            [
                18002,
                18061
            ],
            [
                18061,
                18088
            ],
            [
                18088,
                18118
            ],
            [
                18118,
                18160
            ],
            [
                18160,
                18234
            ],
            [
                18234,
                18255
            ],
            [
                18255,
                18321
            ],
            [
                18321,
                18345
            ],
            [
                18345,
                18396
            ],
            [
                18396,
                18431
            ],
            [
                18431,
                18517
            ],
            [
                18517,
                18549
            ],
            [
                18549,
                18588
            ],
            [
                18588,
                18624
            ],
            [
                18624,
                18681
            ],
            [
                18681,
                18771
            ],
            [
                18771,
                18843
            ],
            [
                18843,
                18865
            ],
            [
                18865,
                18910
            ],
            [
                18910,
                18945
            ],
            [
                18945,
                18981
            ],
            [
                18981,
                19002
            ],
            [
                19002,
                19019
            ],
            [
                19019,
                19068
            ],
            [
                19068,
                19089
            ],
            [
                19089,
                19157
            ],
            [
                19157,
                19222
            ],
            [
                19222,
                19318
            ],
            [
                19318,
                19421
            ],
            [
                19421,
                19515
            ],
            [
                19515,
                19544
            ],
            [
                19544,
                19582
            ],
            [
                19582,
                19621
            ],
            [
                19621,
                19766
            ],
            [
                19766,
                19806
            ],
            [
                19806,
                19946
            ]
        ]
    },
    "abridged": {
        "text": "Some ten or twelve days after George Vavasor's return to London he appeared at Mr. Scruby's offices with four small slips of paper in his hand.\nMr. Scruby, as usual, was pressing for money. The third election was coming on, and money was already being spent very freely among the men of the River Bank. So, at least, Mr. Scruby declared.\n\"It is very hard to realize money,\" said George, \"immediately after a death, when all the property left is real property.\"\n\"Very hard indeed,\" said Mr. Scruby, who had heard all about the old Squire's will. Vavasor cursed him inwardly, and suggested to himself that some day he might murder Mr. Scruby as well as John Grey - and perhaps also a few more of his enemies. Two days later, he again called, and gave Mr. Scruby the four slips of paper which have been mentioned.\nBefore we learn Mr Scruby's judgment of those scraps of paper, we must go back to their earlier history. As they were still in their infancy, we shall not have to go back far.\nOne morning the parlour-maid came up to Alice, as she sat alone in the drawing-room in Queen Anne Street, and told her there was a \"gentleman\" waiting in the hall. We all know the tone in which servants announce a gentleman when they know that he is not a gentleman.\n\"What sort of a gentleman?\"\n\"Well, miss, I don't think he's just of our sort.\"\nAlice Vavasor was aware that the gentleman could not be her cousin George, and therefore she said, \"Let him come up.\"\nJane let him in, announcing Mr. Levy. At this time John Vavasor was in his dressing-room.\nAlice got up to receive her visitor, and at once understood the tone of her maid's voice. Mr. Levy was a little dark man, with sharp close-set eyes, a beaked nose, and a black moustache. Alice did not like the look of him, but she asked him to sit down.\n\"Is papa dressed yet?\" Alice asked the servant, purely to let Mr. Levy know that there was a gentleman in the house with her.\n\"I don't think so, miss.\"\n\"I've called about a little bit of business,\" said Mr. Levy, when they were alone. \"Nothing as you need disturb yourself about. You'll find it all square, I think.\" Then he produced a note, which he handed to her. Alice took the note, and saw immediately that it was addressed to her by her cousin George. \"I am Mr. Vavasor's clerk, miss.\"\nGeorge Vavasor's letter was as follows:\nDear Alice,\nAfter what passed between us when I last saw you, I thought that on my return from Westmorland I should learn that you had paid in at my bankers' the money that I require. But I find that this is not so; and of course I excuse you, because women so seldom know how to do what business demands of them. You have, no doubt, heard of the injustice which my grandfather has done me, and will probably feel as indignant as I do. I only mention this, because the nature of his will makes it more than ever necessary that you should be true to your pledge to me.\nTill there shall be some ground for a better understanding between us, I think it wiser not to call on you myself. I therefore send my clerk with four bills, each of five hundred pounds, drawn at fourteen days' date, across which I will get you to write your name. Mr. Levy will show you how this should be done. Your name must come under the word \"accepted,\" and just above the name of Messrs. Drummonds, where the money must be lying not later than Monday fortnight. Indeed, the money must be there some time on the Saturday. Drummonds bank will not object if you call on the Saturday afternoon, and ask if it is all right.\nI have certainly been inconvenienced by not finding the money as I expected on my return to town. If these bills are not properly provided for, the result will be disastrous to me. I feel, however, sure that this will be done, both for your own sake and for mine.\nAffectionately yours,\nGeorge Vavasor.\nThe unparalleled impudence of this letter had the effect which the writer had intended. It made Alice think immediately of her own remissness, rather than of the enormity of his claim upon her. She believed that she had no alternative but to give him the money. She had told him that he should have it. She should not have forced him into the necessity of demanding it.\nBut the idea of signing four bills was terrible to her, and she felt sure that she ought not to put her name to orders for so large an amount and then entrust them to such a man as Mr. Levy. Her father was in the house, and she thought of asking him.\nBut it occurred to her that if she were to speak to her father about this advancing of money, he would prevent her, if he could, from keeping the promise made to her cousin. She was resolved that George should have the money; but her father might be able to delay the gift. If she signed the bills, the money must be forthcoming.\nMr. Levy had taken out the four bills and had placed them on the table.\n\"If you will just write your name across them, here, I need not detain you by staying any longer,\" he said. Mr. Levy was anxious to make his visit as short as possible, since he had heard that Mr. John Vavasor was in the house.\nBut Alice hesitated. Two thousand pounds is a very serious sum of money. What if this man, of whom she had never before heard, should steal the bills after she had signed them? She looked again at her cousin's letter, chiefly with the object of gaining time.\n\"It's all right, miss,\" said Mr. Levy.\n\"Could you not leave them with me?\" said Alice.\n\"Well; not very well, miss. The fact is, Mr. Vavasor must have them this afternoon. He has got a heavy sum to put down about this here election.\"\n\"But, sir, the money will not be payable today. If I understand it, they are not cheques.\"\n\"No, miss, they are not cheques. But your name, miss, at fourteen days, is the same as ready money.\"\nWhile she paused, he handed her a pen, and then she signed the four bills quickly. These were the four bits of paper which George Vavasor offered to Mr. Scruby, in the manner of a grand capitalist.\n\"You insisted on ready money, with your d-- suspicions,\" said he; \"and there it is. You're not afraid of fourteen days, I dare say.\"\n\"Fourteen days is neither here nor there,\" said Mr. Scruby. \"I'll send one of my men down to Grimes, and tell him I can't see him, till\" and he looked at one of the bills, \"till the 15th.\"\nBut this was not what George Vavasor wanted. He wished that the bills should be immediately turned into money, but not by him.\n\"You will want a thousand, you say?\" he said.\n\"A thousand to begin with.\"\n\"Then you had better keep two of them.\"\n\"Well, no! I don't see the use of that. You had better collect them through your own banker, and let me have a cheque on the 15th or 16th.\"\n\"How cursed suspicious you are, Scruby.\"\n\"No, I ain't. I don't deal in such articles; that's all. The truth is, Mr. Vavasor, that bills with ladies' names on them ain't just what people like. You take them into the City, and see if the bankers don't tell you the same. They may be done, of course, upon your name.\"\n\"I can explain to you the nature of the family arrangement, but I can't do that to a stranger. However, I don't mind.\"\n\"Of course not. The time is so short that it does not signify. Have them collected through your own bankers, and then send me a cheque for a thousand pounds when the time is up.\"\nThen Mr. Scruby turned to some papers as though the interview had been long enough. Vavasor looked at him angrily, cursing him inwardly, but Mr. Scruby ignored him. So Vavasor got up and went away.\nAs he walked along the unalluring streets which surround Soho, to the Strand and his own lodgings, he continued to think of some wide scheme of revenge - in which Mr. Scruby might be included. Some impatience and familiarity in Mr. Scruby's manner made him feel that he had fallen in the attorney's esteem. The man was like a rat, and knew a falling house by instinct. So George Vavasor cursed Mr. Scruby, and calculated some method of murdering him without detection.\nThe reader is not to suppose that the Member for the Chelsea Districts had, in truth, any intention to become a murderer. But he received a secret satisfaction in allowing his mind to dwell upon the subject. He reflected that it would not do to knock off Scruby and John Grey at the same time, as it would be known that he was connected with both of them; unless, indeed, he was to kill himself too.\nAs he needed instant money, Mr. Scruby's proposition that he should leave the four bills at his own bankers', to be collected when they came to maturity, did not suit him. He doubted much whether at the end of the fourteen days the money would be forthcoming. Alice would have to tell her father, and John Vavasor would probably prevent the payment. He must take the bills into the City, and do the best there that he could with them. He was too late for this today, so he went down to the House. There he sat all night with his hat over his eyes, plotting his murders.\n\"You have heard the news; haven't you?\" said Mr. Bott, whispering in his ear.\n\"I haven't heard any news.\"\n\"Finespun has resigned, and Palliser is at this moment with the Duke of St. Bungay in the Lords' library.\"\n\"They may both be at the bottom of the Lords' fishpond, for all I care,\" said Vavasor.\n\"That's nonsense, you know,\" said Bott. \"What a lucky fellow you are to have such a chance come to you directly you get in. As soon as he takes his seat down there, of course we shall go up behind him.\"\n\"We shall have another election in a month's time,\" said George.\n\"I'm safe enough,\" said Bott. \"It never hurts a man at elections to be closely connected with the Government.\"\nGeorge Vavasor was in the City early the next morning, but he found that the City did not look with favourable eyes on his four bills. The City took them up distrustfully, and repeated the name Alice Vavasor, and suggested that as the time was so short, the holder of the bills would be wise to hold them till he could collect the amount. It was very clear that the City suspected something wrong in the transaction.\nGeorge Vavasor cursed the City, and made his calculation about murdering it. Might not a river of strychnine be turned on the Exchange at luncheon time? At last he left three of the bills with his own bankers for collection, and kept the fourth in his pocket. The next day he descended with it into the lower depths of the money market, and found a capitalist who was willing to advance him two hundred pounds, keeping that fourth bill as security. The capitalist was to have forty pounds for the transaction, and George cursed him as he took his cheque. He knew that a man must be in a very bad condition when he consents to pay forty pounds for the use of two hundred for fourteen days. He cursed the City. He cursed the House of Commons. He cursed his cousin Alice and his sister Kate. He cursed the memory of his grandfather. And he cursed himself.\nMr. Levy had hardly left the house in Queen Anne Street, before Alice had told her father what she had done.\n\"The money must be forthcoming,\" said Alice. \"Papa, will you see that it is done?\" To this her father made no reply, but sat looking at the fire and shaking his head, feeling it to be very hard upon him. \"Papa, if you will not promise, I must go to Mr. Round myself, and find a broker to sell out for me.\"\n\"You will be ruined,\" said he, \"and for such a rascal as that!\"\n\"Never mind whether he is a rascal or not, papa. You must admit that he has been treated harshly by his grandfather.\"\n\"I think that will was the wisest thing my father ever did. If he had left the estate to George, there wouldn't have been an acre of it left in the family in six months' time.\"\n\"At any rate, papa, he must have this two thousand pounds.\"\n\"And then he will want more.\"\n\"No; I do not think he will ask for more. At any rate, I do not think that I am bound to give him all that I have.\"\n\"I should think not. Why are you bound to give him anything?\"\n\"Because I promised it. I have signed the bills now, and it must be done.\"\n\"I don't know that Mr. Round can do it. Your money is chiefly on mortgage.\" He paused for a moment. \"I never heard of such a thing. Four thousand pounds given away to such a man as that, in three months! And you say you do not intend to marry him.\"\n\"Certainly not; all that is over.\"\n\"And does he know that it is over?\"\n\"I suppose he does.\"\n\"You suppose so! Things of that sort are so often over with you!\" This was very cruel. The blow struck her with such force that she staggered under it. Tears came into her eyes, and she could hardly speak lest she should betray herself by sobbing.\n\"I know that I have behaved badly,\" she said at last; \"but I am punished, and you might spare me now!\"\n\"I didn't want to punish you,\" he said, getting up and walking about the room. \"But I don't want to see you ruined!\"\nAt last he made a compromise with her. He would take a day to think whether he would help her get the money, and would tell her his decision on the following morning.",
        "paragraph_chars": [
            [
                0,
                144
            ],
            [
                144,
                338
            ],
            [
                338,
                461
            ],
            [
                461,
                811
            ],
            [
                811,
                987
            ],
            [
                987,
                1254
            ],
            [
                1254,
                1282
            ],
            [
                1282,
                1333
            ],
            [
                1333,
                1451
            ],
            [
                1451,
                1541
            ],
            [
                1541,
                1795
            ],
            [
                1795,
                1921
            ],
            [
                1921,
                1947
            ],
            [
                1947,
                2287
            ],
            [
                2287,
                2327
            ],
            [
                2327,
                2339
            ],
            [
                2339,
                2895
            ],
            [
                2895,
                3521
            ],
            [
                3521,
                3785
            ],
            [
                3785,
                3807
            ],
            [
                3807,
                3823
            ],
            [
                3823,
                4193
            ],
            [
                4193,
                4444
            ],
            [
                4444,
                4774
            ],
            [
                4774,
                4846
            ],
            [
                4846,
                5074
            ],
            [
                5074,
                5333
            ],
            [
                5333,
                5372
            ],
            [
                5372,
                5420
            ],
            [
                5420,
                5566
            ],
            [
                5566,
                5657
            ],
            [
                5657,
                5758
            ],
            [
                5758,
                5956
            ],
            [
                5956,
                6089
            ],
            [
                6089,
                6278
            ],
            [
                6278,
                6405
            ],
            [
                6405,
                6451
            ],
            [
                6451,
                6479
            ],
            [
                6479,
                6519
            ],
            [
                6519,
                6659
            ],
            [
                6659,
                6700
            ],
            [
                6700,
                6974
            ],
            [
                6974,
                7093
            ],
            [
                7093,
                7272
            ],
            [
                7272,
                7470
            ],
            [
                7470,
                7939
            ],
            [
                7939,
                8339
            ],
            [
                8339,
                8909
            ],
            [
                8909,
                8987
            ],
            [
                8987,
                9015
            ],
            [
                9015,
                9122
            ],
            [
                9122,
                9209
            ],
            [
                9209,
                9412
            ],
            [
                9412,
                9477
            ],
            [
                9477,
                9588
            ],
            [
                9588,
                10005
            ],
            [
                10005,
                10858
            ],
            [
                10858,
                10967
            ],
            [
                10967,
                11273
            ],
            [
                11273,
                11337
            ],
            [
                11337,
                11455
            ],
            [
                11455,
                11632
            ],
            [
                11632,
                11692
            ],
            [
                11692,
                11722
            ],
            [
                11722,
                11838
            ],
            [
                11838,
                11900
            ],
            [
                11900,
                11975
            ],
            [
                11975,
                12224
            ],
            [
                12224,
                12259
            ],
            [
                12259,
                12295
            ],
            [
                12295,
                12316
            ],
            [
                12316,
                12564
            ],
            [
                12564,
                12667
            ],
            [
                12667,
                12784
            ],
            [
                12784,
                12950
            ]
        ],
        "segment_chars": [
            [
                0,
                144
            ],
            [
                144,
                190
            ],
            [
                190,
                303
            ],
            [
                303,
                338
            ],
            [
                338,
                461
            ],
            [
                461,
                545
            ],
            [
                545,
                707
            ],
            [
                707,
                811
            ],
            [
                811,
                916
            ],
            [
                916,
                987
            ],
            [
                987,
                1151
            ],
            [
                1151,
                1254
            ],
            [
                1254,
                1282
            ],
            [
                1282,
                1333
            ],
            [
                1333,
                1451
            ],
            [
                1451,
                1489
            ],
            [
                1489,
                1541
            ],
            [
                1541,
                1631
            ],
            [
                1631,
                1728
            ],
            [
                1728,
                1795
            ],
            [
                1795,
                1818
            ],
            [
                1818,
                1921
            ],
            [
                1921,
                1947
            ],
            [
                1947,
                2030
            ],
            [
                2030,
                2075
            ],
            [
                2075,
                2112
            ],
            [
                2112,
                2161
            ],
            [
                2161,
                2253
            ],
            [
                2253,
                2287
            ],
            [
                2287,
                2327
            ],
            [
                2327,
                2339
            ],
            [
                2339,
                2511
            ],
            [
                2511,
                2641
            ],
            [
                2641,
                2763
            ],
            [
                2763,
                2895
            ],
            [
                2895,
                3010
            ],
            [
                3010,
                3160
            ],
            [
                3160,
                3208
            ],
            [
                3208,
                3364
            ],
            [
                3364,
                3423
            ],
            [
                3423,
                3521
            ],
            [
                3521,
                3619
            ],
            [
                3619,
                3702
            ],
            [
                3702,
                3785
            ],
            [
                3785,
                3807
            ],
            [
                3807,
                3823
            ],
            [
                3823,
                3911
            ],
            [
                3911,
                4017
            ],
            [
                4017,
                4085
            ],
            [
                4085,
                4126
            ],
            [
                4126,
                4193
            ],
            [
                4193,
                4384
            ],
            [
                4384,
                4444
            ],
            [
                4444,
                4618
            ],
            [
                4618,
                4718
            ],
            [
                4718,
                4774
            ],
            [
                4774,
                4846
            ],
            [
                4846,
                4954
            ],
            [
                4954,
                5074
            ],
            [
                5074,
                5095
            ],
            [
                5095,
                5147
            ],
            [
                5147,
                5251
            ],
            [
                5251,
                5333
            ],
            [
                5333,
                5372
            ],
            [
                5372,
                5408
            ],
            [
                5408,
                5420
            ],
            [
                5420,
                5448
            ],
            [
                5448,
                5504
            ],
            [
                5504,
                5566
            ],
            [
                5566,
                5614
            ],
            [
                5614,
                5657
            ],
            [
                5657,
                5690
            ],
            [
                5690,
                5758
            ],
            [
                5758,
                5841
            ],
            [
                5841,
                5956
            ],
            [
                5956,
                6040
            ],
            [
                6040,
                6089
            ],
            [
                6089,
                6149
            ],
            [
                6149,
                6278
            ],
            [
                6278,
                6323
            ],
            [
                6323,
                6405
            ],
            [
                6405,
                6442
            ],
            [
                6442,
                6451
            ],
            [
                6451,
                6479
            ],
            [
                6479,
                6519
            ],
            [
                6519,
                6530
            ],
            [
                6530,
                6559
            ],
            [
                6559,
                6659
            ],
            [
                6659,
                6700
            ],
            [
                6700,
                6714
            ],
            [
                6714,
                6757
            ],
            [
                6757,
                6851
            ],
            [
                6851,
                6928
            ],
            [
                6928,
                6974
            ],
            [
                6974,
                7069
            ],
            [
                7069,
                7093
            ],
            [
                7093,
                7109
            ],
            [
                7109,
                7156
            ],
            [
                7156,
                7272
            ],
            [
                7272,
                7356
            ],
            [
                7356,
                7437
            ],
            [
                7437,
                7470
            ],
            [
                7470,
                7663
            ],
            [
                7663,
                7777
            ],
            [
                7777,
                7839
            ],
            [
                7839,
                7939
            ],
            [
                7939,
                8061
            ],
            [
                8061,
                8147
            ],
            [
                8147,
                8339
            ],
            [
                8339,
                8511
            ],
            [
                8511,
                8599
            ],
            [
                8599,
                8689
            ],
            [
                8689,
                8774
            ],
            [
                8774,
                8836
            ],
            [
                8836,
                8909
            ],
            [
                8909,
                8949
            ],
            [
                8949,
                8987
            ],
            [
                8987,
                9015
            ],
            [
                9015,
                9122
            ],
            [
                9122,
                9209
            ],
            [
                9209,
                9249
            ],
            [
                9249,
                9333
            ],
            [
                9333,
                9412
            ],
            [
                9412,
                9477
            ],
            [
                9477,
                9507
            ],
            [
                9507,
                9588
            ],
            [
                9588,
                9723
            ],
            [
                9723,
                9927
            ],
            [
                9927,
                10005
            ],
            [
                10005,
                10082
            ],
            [
                10082,
                10158
            ],
            [
                10158,
                10265
            ],
            [
                10265,
                10454
            ],
            [
                10454,
                10560
            ],
            [
                10560,
                10694
            ],
            [
                10694,
                10714
            ],
            [
                10714,
                10746
            ],
            [
                10746,
                10794
            ],
            [
                10794,
                10835
            ],
            [
                10835,
                10858
            ],
            [
                10858,
                10967
            ],
            [
                10967,
                11012
            ],
            [
                11012,
                11050
            ],
            [
                11050,
                11171
            ],
            [
                11171,
                11273
            ],
            [
                11273,
                11337
            ],
            [
                11337,
                11386
            ],
            [
                11386,
                11455
            ],
            [
                11455,
                11515
            ],
            [
                11515,
                11632
            ],
            [
                11632,
                11692
            ],
            [
                11692,
                11722
            ],
            [
                11722,
                11764
            ],
            [
                11764,
                11838
            ],
            [
                11838,
                11859
            ],
            [
                11859,
                11900
            ],
            [
                11900,
                11924
            ],
            [
                11924,
                11975
            ],
            [
                11975,
                12015
            ],
            [
                12015,
                12051
            ],
            [
                12051,
                12075
            ],
            [
                12075,
                12107
            ],
            [
                12107,
                12179
            ],
            [
                12179,
                12224
            ],
            [
                12224,
                12259
            ],
            [
                12259,
                12295
            ],
            [
                12295,
                12316
            ],
            [
                12316,
                12333
            ],
            [
                12333,
                12382
            ],
            [
                12382,
                12403
            ],
            [
                12403,
                12468
            ],
            [
                12468,
                12564
            ],
            [
                12564,
                12667
            ],
            [
                12667,
                12746
            ],
            [
                12746,
                12784
            ],
            [
                12784,
                12823
            ],
            [
                12823,
                12950
            ]
        ],
        "overlap_chars": [
            [
                0,
                63
            ],
            [
                64,
                143
            ],
            [
                144,
                190
            ],
            [
                190,
                303
            ],
            [
                303,
                337
            ],
            [
                338,
                344
            ],
            [
                345,
                365
            ],
            [
                371,
                399
            ],
            [
                406,
                460
            ],
            [
                461,
                511
            ],
            [
                512,
                515
            ],
            [
                522,
                545
            ],
            [
                545,
                552
            ],
            [
                553,
                660
            ],
            [
                663,
                707
            ],
            [
                707,
                715
            ],
            [
                721,
                738
            ],
            [
                749,
                759
            ],
            [
                760,
                810
            ],
            [
                811,
                826
            ],
            [
                827,
                829
            ],
            [
                830,
                836
            ],
            [
                864,
                916
            ],
            [
                916,
                987
            ],
            [
                987,
                998
            ],
            [
                999,
                1129
            ],
            [
                1130,
                1137
            ],
            [
                1138,
                1149
            ],
            [
                1149,
                1151
            ],
            [
                1151,
                1230
            ],
            [
                1234,
                1254
            ],
            [
                1255,
                1282
            ],
            [
                1282,
                1330
            ],
            [
                1330,
                1333
            ],
            [
                1333,
                1346
            ],
            [
                1347,
                1350
            ],
            [
                1351,
                1375
            ],
            [
                1376,
                1425
            ],
            [
                1437,
                1440
            ],
            [
                1451,
                1455
            ],
            [
                1460,
                1463
            ],
            [
                1466,
                1488
            ],
            [
                1489,
                1491
            ],
            [
                1492,
                1496
            ],
            [
                1502,
                1514
            ],
            [
                1515,
                1541
            ],
            [
                1541,
                1631
            ],
            [
                1631,
                1639
            ],
            [
                1640,
                1673
            ],
            [
                1680,
                1683
            ],
            [
                1684,
                1689
            ],
            [
                1690,
                1703
            ],
            [
                1703,
                1726
            ],
            [
                1726,
                1728
            ],
            [
                1728,
                1741
            ],
            [
                1742,
                1758
            ],
            [
                1759,
                1762
            ],
            [
                1762,
                1771
            ],
            [
                1772,
                1795
            ],
            [
                1795,
                1818
            ],
            [
                1818,
                1841
            ],
            [
                1919,
                1921
            ],
            [
                1921,
                1922
            ],
            [
                1922,
                1935
            ],
            [
                1938,
                1944
            ],
            [
                1944,
                1947
            ],
            [
                1947,
                1990
            ],
            [
                1990,
                2030
            ],
            [
                2030,
                2075
            ],
            [
                2075,
                2112
            ],
            [
                2112,
                2119
            ],
            [
                2120,
                2161
            ],
            [
                2161,
                2253
            ],
            [
                2253,
                2258
            ],
            [
                2259,
                2278
            ],
            [
                2278,
                2279
            ],
            [
                2284,
                2287
            ],
            [
                2287,
                2310
            ],
            [
                2311,
                2326
            ],
            [
                2327,
                2339
            ],
            [
                2339,
                2387
            ],
            [
                2389,
                2426
            ],
            [
                2429,
                2511
            ],
            [
                2511,
                2599
            ],
            [
                2600,
                2609
            ],
            [
                2615,
                2641
            ],
            [
                2641,
                2666
            ],
            [
                2670,
                2763
            ],
            [
                2763,
                2782
            ],
            [
                2782,
                2838
            ],
            [
                2849,
                2895
            ],
            [
                2895,
                2965
            ],
            [
                2966,
                2994
            ],
            [
                3002,
                3008
            ],
            [
                3008,
                3010
            ],
            [
                3010,
                3029
            ],
            [
                3030,
                3160
            ],
            [
                3160,
                3182
            ],
            [
                3187,
                3208
            ],
            [
                3208,
                3330
            ],
            [
                3331,
                3364
            ],
            [
                3364,
                3423
            ],
            [
                3427,
                3432
            ],
            [
                3438,
                3453
            ],
            [
                3457,
                3460
            ],
            [
                3461,
                3521
            ],
            [
                3521,
                3619
            ],
            [
                3619,
                3683
            ],
            [
                3684,
                3702
            ],
            [
                3702,
                3785
            ],
            [
                3785,
                3807
            ],
            [
                3807,
                3823
            ],
            [
                3823,
                3911
            ],
            [
                3911,
                3965
            ],
            [
                3966,
                4017
            ],
            [
                4017,
                4020
            ],
            [
                4030,
                4069
            ],
            [
                4070,
                4073
            ],
            [
                4074,
                4077
            ],
            [
                4078,
                4083
            ],
            [
                4083,
                4085
            ],
            [
                4085,
                4124
            ],
            [
                4124,
                4126
            ],
            [
                4126,
                4152
            ],
            [
                4153,
                4156
            ],
            [
                4162,
                4193
            ],
            [
                4193,
                4343
            ],
            [
                4352,
                4384
            ],
            [
                4384,
                4420
            ],
            [
                4439,
                4443
            ],
            [
                4444,
                4447
            ],
            [
                4448,
                4466
            ],
            [
                4467,
                4471
            ],
            [
                4475,
                4478
            ],
            [
                4479,
                4483
            ],
            [
                4484,
                4506
            ],
            [
                4507,
                4512
            ],
            [
                4513,
                4536
            ],
            [
                4536,
                4546
            ],
            [
                4555,
                4559
            ],
            [
                4563,
                4571
            ],
            [
                4571,
                4618
            ],
            [
                4618,
                4668
            ],
            [
                4670,
                4690
            ],
            [
                4691,
                4716
            ],
            [
                4716,
                4718
            ],
            [
                4718,
                4724
            ],
            [
                4732,
                4760
            ],
            [
                4761,
                4773
            ],
            [
                4774,
                4811
            ],
            [
                4812,
                4844
            ],
            [
                4844,
                4845
            ],
            [
                4847,
                4942
            ],
            [
                4954,
                4966
            ],
            [
                4967,
                5074
            ],
            [
                5074,
                5095
            ],
            [
                5095,
                5147
            ],
            [
                5147,
                5251
            ],
            [
                5251,
                5333
            ],
            [
                5333,
                5372
            ],
            [
                5372,
                5405
            ],
            [
                5405,
                5408
            ],
            [
                5408,
                5420
            ],
            [
                5420,
                5448
            ],
            [
                5448,
                5460
            ],
            [
                5461,
                5472
            ],
            [
                5473,
                5504
            ],
            [
                5504,
                5538
            ],
            [
                5539,
                5563
            ],
            [
                5563,
                5566
            ],
            [
                5566,
                5606
            ],
            [
                5612,
                5614
            ],
            [
                5614,
                5657
            ],
            [
                5657,
                5667
            ],
            [
                5668,
                5690
            ],
            [
                5690,
                5755
            ],
            [
                5755,
                5758
            ],
            [
                5758,
                5778
            ],
            [
                5786,
                5789
            ],
            [
                5790,
                5795
            ],
            [
                5795,
                5831
            ],
            [
                5839,
                5841
            ],
            [
                5841,
                5895
            ],
            [
                5904,
                5917
            ],
            [
                5917,
                5918
            ],
            [
                5919,
                5921
            ],
            [
                5922,
                5954
            ],
            [
                5954,
                5956
            ],
            [
                5956,
                5997
            ],
            [
                6000,
                6040
            ],
            [
                6040,
                6089
            ],
            [
                6089,
                6149
            ],
            [
                6150,
                6224
            ],
            [
                6226,
                6278
            ],
            [
                6278,
                6294
            ],
            [
                6295,
                6323
            ],
            [
                6323,
                6325
            ],
            [
                6333,
                6388
            ],
            [
                6393,
                6396
            ],
            [
                6403,
                6405
            ],
            [
                6405,
                6442
            ],
            [
                6445,
                6449
            ],
            [
                6449,
                6451
            ],
            [
                6451,
                6476
            ],
            [
                6479,
                6519
            ],
            [
                6519,
                6524
            ],
            [
                6526,
                6530
            ],
            [
                6530,
                6559
            ],
            [
                6559,
                6659
            ],
            [
                6659,
                6700
            ],
            [
                6700,
                6714
            ],
            [
                6714,
                6755
            ],
            [
                6757,
                6821
            ],
            [
                6822,
                6832
            ],
            [
                6838,
                6849
            ],
            [
                6851,
                6878
            ],
            [
                6878,
                6928
            ],
            [
                6928,
                6971
            ],
            [
                6974,
                7069
            ],
            [
                7069,
                7093
            ],
            [
                7093,
                7109
            ],
            [
                7109,
                7156
            ],
            [
                7156,
                7210
            ],
            [
                7211,
                7271
            ],
            [
                7272,
                7309
            ],
            [
                7310,
                7356
            ],
            [
                7356,
                7386
            ],
            [
                7387,
                7407
            ],
            [
                7432,
                7435
            ],
            [
                7435,
                7437
            ],
            [
                7440,
                7468
            ],
            [
                7468,
                7470
            ],
            [
                7470,
                7488
            ],
            [
                7489,
                7492
            ],
            [
                7493,
                7526
            ],
            [
                7527,
                7531
            ],
            [
                7531,
                7532
            ],
            [
                7533,
                7571
            ],
            [
                7572,
                7621
            ],
            [
                7624,
                7663
            ],
            [
                7668,
                7694
            ],
            [
                7695,
                7717
            ],
            [
                7718,
                7768
            ],
            [
                7775,
                7777
            ],
            [
                7777,
                7828
            ],
            [
                7829,
                7837
            ],
            [
                7837,
                7839
            ],
            [
                7839,
                7939
            ],
            [
                7939,
                8024
            ],
            [
                8025,
                8028
            ],
            [
                8039,
                8041
            ],
            [
                8042,
                8061
            ],
            [
                8061,
                8076
            ],
            [
                8079,
                8145
            ],
            [
                8145,
                8147
            ],
            [
                8147,
                8183
            ],
            [
                8190,
                8320
            ],
            [
                8337,
                8339
            ],
            [
                8339,
                8344
            ],
            [
                8352,
                8359
            ],
            [
                8360,
                8365
            ],
            [
                8367,
                8511
            ],
            [
                8511,
                8526
            ],
            [
                8527,
                8599
            ],
            [
                8599,
                8610
            ],
            [
                8616,
                8634
            ],
            [
                8634,
                8667
            ],
            [
                8676,
                8689
            ],
            [
                8689,
                8774
            ],
            [
                8774,
                8798
            ],
            [
                8804,
                8805
            ],
            [
                8809,
                8816
            ],
            [
                8817,
                8836
            ],
            [
                8842,
                8852
            ],
            [
                8853,
                8886
            ],
            [
                8907,
                8909
            ],
            [
                8909,
                8949
            ],
            [
                8949,
                8962
            ],
            [
                8962,
                8987
            ],
            [
                8988,
                9015
            ],
            [
                9015,
                9122
            ],
            [
                9122,
                9181
            ],
            [
                9186,
                9209
            ],
            [
                9209,
                9249
            ],
            [
                9250,
                9333
            ],
            [
                9333,
                9412
            ],
            [
                9412,
                9476
            ],
            [
                9477,
                9507
            ],
            [
                9507,
                9588
            ],
            [
                9588,
                9618
            ],
            [
                9625,
                9723
            ],
            [
                9723,
                9744
            ],
            [
                9745,
                9753
            ],
            [
                9758,
                9763
            ],
            [
                9764,
                9781
            ],
            [
                9782,
                9796
            ],
            [
                9797,
                9800
            ],
            [
                9801,
                9927
            ],
            [
                9927,
                10004
            ],
            [
                10005,
                10082
            ],
            [
                10082,
                10126
            ],
            [
                10127,
                10139
            ],
            [
                10143,
                10158
            ],
            [
                10158,
                10165
            ],
            [
                10166,
                10173
            ],
            [
                10174,
                10192
            ],
            [
                10193,
                10233
            ],
            [
                10239,
                10256
            ],
            [
                10257,
                10263
            ],
            [
                10263,
                10265
            ],
            [
                10265,
                10277
            ],
            [
                10278,
                10280
            ],
            [
                10308,
                10320
            ],
            [
                10340,
                10341
            ],
            [
                10342,
                10345
            ],
            [
                10346,
                10440
            ],
            [
                10441,
                10454
            ],
            [
                10454,
                10560
            ],
            [
                10563,
                10567
            ],
            [
                10568,
                10694
            ],
            [
                10694,
                10714
            ],
            [
                10714,
                10746
            ],
            [
                10746,
                10794
            ],
            [
                10794,
                10835
            ],
            [
                10835,
                10858
            ],
            [
                10858,
                10966
            ],
            [
                10967,
                11012
            ],
            [
                11012,
                11050
            ],
            [
                11053,
                11057
            ],
            [
                11082,
                11083
            ],
            [
                11112,
                11115
            ],
            [
                11142,
                11150
            ],
            [
                11151,
                11165
            ],
            [
                11169,
                11171
            ],
            [
                11171,
                11225
            ],
            [
                11226,
                11237
            ],
            [
                11238,
                11242
            ],
            [
                11243,
                11270
            ],
            [
                11273,
                11337
            ],
            [
                11337,
                11386
            ],
            [
                11386,
                11394
            ],
            [
                11401,
                11455
            ],
            [
                11455,
                11515
            ],
            [
                11518,
                11520
            ],
            [
                11521,
                11524
            ],
            [
                11525,
                11632
            ],
            [
                11632,
                11689
            ],
            [
                11692,
                11722
            ],
            [
                11722,
                11764
            ],
            [
                11764,
                11838
            ],
            [
                11838,
                11859
            ],
            [
                11867,
                11870
            ],
            [
                11871,
                11900
            ],
            [
                11900,
                11924
            ],
            [
                11924,
                11974
            ],
            [
                11976,
                12015
            ],
            [
                12015,
                12051
            ],
            [
                12061,
                12073
            ],
            [
                12073,
                12075
            ],
            [
                12075,
                12076
            ],
            [
                12076,
                12105
            ],
            [
                12105,
                12107
            ],
            [
                12107,
                12179
            ],
            [
                12179,
                12224
            ],
            [
                12224,
                12259
            ],
            [
                12259,
                12295
            ],
            [
                12295,
                12316
            ],
            [
                12316,
                12333
            ],
            [
                12333,
                12382
            ],
            [
                12382,
                12403
            ],
            [
                12403,
                12468
            ],
            [
                12468,
                12564
            ],
            [
                12564,
                12667
            ],
            [
                12667,
                12717
            ],
            [
                12718,
                12746
            ],
            [
                12747,
                12750
            ],
            [
                12751,
                12784
            ],
            [
                12784,
                12791
            ],
            [
                12792,
                12823
            ],
            [
                12823,
                12868
            ],
            [
                12874,
                12877
            ],
            [
                12882,
                12896
            ],
            [
                12908,
                12911
            ],
            [
                12912,
                12924
            ],
            [
                12925,
                12950
            ]
        ],
        "row_chars": [
            [
                0,
                144
            ],
            [
                144,
                190
            ],
            [
                190,
                303
            ],
            [
                303,
                338
            ],
            [
                338,
                338
            ],
            [
                338,
                338
            ],
            [
                338,
                338
            ],
            [
                338,
                338
            ],
            [
                338,
                338
            ],
            [
                338,
                338
            ],
            [
                338,
                338
            ],
            [
                338,
                461
            ],
            [
                461,
                545
            ],
            [
                545,
                707
            ],
            [
                707,
                811
            ],
            [
                811,
                811
            ],
            [
                811,
                916
            ],
            [
                916,
                987
            ],
            [
                987,
                1151
            ],
            [
                1151,
                1254
            ],
            [
                1254,
                1254
            ],
            [
                1254,
                1282
            ],
            [
                1282,
                1333
            ],
            [
                1333,
                1451
            ],
            [
                1451,
                1451
            ],
            [
                1451,
                1451
            ],
            [
                1451,
                1489
            ],
            [
                1489,
                1541
            ],
            [
                1541,
                1631
            ],
            [
                1631,
                1728
            ],
            [
                1728,
                1795
            ],
            [
                1795,
                1818
            ],
            [
                1818,
                1921
            ],
            [
                1921,
                1947
            ],
            [
                1947,
                1947
            ],
            [
                1947,
                2030
            ],
            [
                2030,
                2075
            ],
            [
                2075,
                2112
            ],
            [
                2112,
                2161
            ],
            [
                2161,
                2253
            ],
            [
                2253,
                2253
            ],
            [
                2253,
                2253
            ],
            [
                2253,
                2253
            ],
            [
                2253,
                2287
            ],
            [
                2287,
                2287
            ],
            [
                2287,
                2287
            ],
            [
                2287,
                2327
            ],
            [
                2327,
                2339
            ],
            [
                2339,
                2511
            ],
            [
                2511,
                2641
            ],
            [
                2641,
                2763
            ],
            [
                2763,
                2895
            ],
            [
                2895,
                3010
            ],
            [
                3010,
                3160
            ],
            [
                3160,
                3208
            ],
            [
                3208,
                3364
            ],
            [
                3364,
                3423
            ],
            [
                3423,
                3521
            ],
            [
                3521,
                3619
            ],
            [
                3619,
                3702
            ],
            [
                3702,
                3785
            ],
            [
                3785,
                3807
            ],
            [
                3807,
                3823
            ],
            [
                3823,
                3911
            ],
            [
                3911,
                4017
            ],
            [
                4017,
                4085
            ],
            [
                4085,
                4126
            ],
            [
                4126,
                4193
            ],
            [
                4193,
                4384
            ],
            [
                4384,
                4444
            ],
            [
                4444,
                4444
            ],
            [
                4444,
                4618
            ],
            [
                4618,
                4718
            ],
            [
                4718,
                4774
            ],
            [
                4774,
                4774
            ],
            [
                4774,
                4846
            ],
            [
                4846,
                4846
            ],
            [
                4846,
                4846
            ],
            [
                4846,
                4846
            ],
            [
                4846,
                4846
            ],
            [
                4846,
                4954
            ],
            [
                4954,
                5074
            ],
            [
                5074,
                5095
            ],
            [
                5095,
                5147
            ],
            [
                5147,
                5147
            ],
            [
                5147,
                5251
            ],
            [
                5251,
                5333
            ],
            [
                5333,
                5372
            ],
            [
                5372,
                5408
            ],
            [
                5408,
                5420
            ],
            [
                5420,
                5448
            ],
            [
                5448,
                5504
            ],
            [
                5504,
                5566
            ],
            [
                5566,
                5614
            ],
            [
                5614,
                5657
            ],
            [
                5657,
                5690
            ],
            [
                5690,
                5758
            ],
            [
                5758,
                5841
            ],
            [
                5841,
                5841
            ],
            [
                5841,
                5841
            ],
            [
                5841,
                5956
            ],
            [
                5956,
                6040
            ],
            [
                6040,
                6089
            ],
            [
                6089,
                6149
            ],
            [
                6149,
                6149
            ],
            [
                6149,
                6278
            ],
            [
                6278,
                6323
            ],
            [
                6323,
                6405
            ],
            [
                6405,
                6405
            ],
            [
                6405,
                6442
            ],
            [
                6442,
                6451
            ],
            [
                6451,
                6479
            ],
            [
                6479,
                6479
            ],
            [
                6479,
                6519
            ],
            [
                6519,
                6530
            ],
            [
                6530,
                6559
            ],
            [
                6559,
                6659
            ],
            [
                6659,
                6700
            ],
            [
                6700,
                6714
            ],
            [
                6714,
                6714
            ],
            [
                6714,
                6757
            ],
            [
                6757,
                6757
            ],
            [
                6757,
                6757
            ],
            [
                6757,
                6851
            ],
            [
                6851,
                6851
            ],
            [
                6851,
                6928
            ],
            [
                6928,
                6974
            ],
            [
                6974,
                6974
            ],
            [
                6974,
                7069
            ],
            [
                7069,
                7093
            ],
            [
                7093,
                7109
            ],
            [
                7109,
                7156
            ],
            [
                7156,
                7272
            ],
            [
                7272,
                7356
            ],
            [
                7356,
                7437
            ],
            [
                7437,
                7437
            ],
            [
                7437,
                7470
            ],
            [
                7470,
                7663
            ],
            [
                7663,
                7777
            ],
            [
                7777,
                7839
            ],
            [
                7839,
                7939
            ],
            [
                7939,
                8061
            ],
            [
                8061,
                8147
            ],
            [
                8147,
                8339
            ],
            [
                8339,
                8511
            ],
            [
                8511,
                8599
            ],
            [
                8599,
                8689
            ],
            [
                8689,
                8774
            ],
            [
                8774,
                8836
            ],
            [
                8836,
                8909
            ],
            [
                8909,
                8949
            ],
            [
                8949,
                8987
            ],
            [
                8987,
                8987
            ],
            [
                8987,
                9015
            ],
            [
                9015,
                9122
            ],
            [
                9122,
                9209
            ],
            [
                9209,
                9249
            ],
            [
                9249,
                9249
            ],
            [
                9249,
                9333
            ],
            [
                9333,
                9412
            ],
            [
                9412,
                9477
            ],
            [
                9477,
                9507
            ],
            [
                9507,
                9588
            ],
            [
                9588,
                9723
            ],
            [
                9723,
                9927
            ],
            [
                9927,
                10005
            ],
            [
                10005,
                10005
            ],
            [
                10005,
                10082
            ],
            [
                10082,
                10158
            ],
            [
                10158,
                10265
            ],
            [
                10265,
                10454
            ],
            [
                10454,
                10560
            ],
            [
                10560,
                10694
            ],
            [
                10694,
                10714
            ],
            [
                10714,
                10746
            ],
            [
                10746,
                10794
            ],
            [
                10794,
                10835
            ],
            [
                10835,
                10858
            ],
            [
                10858,
                10967
            ],
            [
                10967,
                11012
            ],
            [
                11012,
                11012
            ],
            [
                11012,
                11012
            ],
            [
                11012,
                11050
            ],
            [
                11050,
                11171
            ],
            [
                11171,
                11273
            ],
            [
                11273,
                11273
            ],
            [
                11273,
                11337
            ],
            [
                11337,
                11386
            ],
            [
                11386,
                11455
            ],
            [
                11455,
                11515
            ],
            [
                11515,
                11632
            ],
            [
                11632,
                11632
            ],
            [
                11632,
                11632
            ],
            [
                11632,
                11692
            ],
            [
                11692,
                11692
            ],
            [
                11692,
                11722
            ],
            [
                11722,
                11764
            ],
            [
                11764,
                11838
            ],
            [
                11838,
                11859
            ],
            [
                11859,
                11900
            ],
            [
                11900,
                11924
            ],
            [
                11924,
                11975
            ],
            [
                11975,
                11975
            ],
            [
                11975,
                11975
            ],
            [
                11975,
                11975
            ],
            [
                11975,
                12015
            ],
            [
                12015,
                12051
            ],
            [
                12051,
                12075
            ],
            [
                12075,
                12107
            ],
            [
                12107,
                12179
            ],
            [
                12179,
                12179
            ],
            [
                12179,
                12224
            ],
            [
                12224,
                12259
            ],
            [
                12259,
                12295
            ],
            [
                12295,
                12316
            ],
            [
                12316,
                12333
            ],
            [
                12333,
                12382
            ],
            [
                12382,
                12403
            ],
            [
                12403,
                12403
            ],
            [
                12403,
                12468
            ],
            [
                12468,
                12564
            ],
            [
                12564,
                12667
            ],
            [
                12667,
                12746
            ],
            [
                12746,
                12746
            ],
            [
                12746,
                12784
            ],
            [
                12784,
                12784
            ],
            [
                12784,
                12784
            ],
            [
                12784,
                12823
            ],
            [
                12823,
                12950
            ]
        ]
    }
}