{
    "original": {
        "text": "Kate Vavasor remained only three days in London before she started for Yarmouth; and during those three days she was not much with her cousin. \"I'm my aunt's, body and soul, for the next six weeks,\" she said to Alice, when she did come to Queen Anne Street on the morning after her arrival. \"And she is exigeant in a manner I can't at all explain to you. You mustn't be surprised if I don't even write a line. I've escaped by stealth now. She went up-stairs to try on some new weeds for the seaside, and then I bolted.\" She did not say a word about George; nor during those three days, nor for some days afterwards, did George show himself. As it turned out afterwards, he had gone off to Scotland, and had remained a week among the grouse. Thus, at least, he had accounted for himself and his movements; but all George Vavasor's friends knew that his goings out and comings in were seldom accounted for openly like those of other men.\nIt will perhaps be as well to say a few words about Mrs. Greenow before we go with her to Yarmouth. Mrs. Greenow was the only daughter and the youngest child of the old squire at Vavasor Hall. She was just ten years younger than her brother John, and I am inclined to think that she was almost justified in her repeated assertion that the difference was much greater than ten years, by the freshness of her colour, and by the general juvenility of her appearance. She certainly did not look forty, and who can expect a woman to proclaim herself to be older than her looks? In early life she had been taken from her father's house, and had lived with relatives in one of the large towns in the north of England. It is certain she had not been quite successful as a girl. Though she had enjoyed the name of being a beauty, she had not the usual success which comes from such repute. At thirty-four she was still unmarried. She had, moreover, acquired the character of being a flirt; and I fear that the stories which were told of her, though doubtless more than half false, had in them sufficient of truth to justify the character. Now this was very sad, seeing that Arabella Vavasor had no fortune, and that she had offended her father and brothers by declining to comply with their advice at certain periods of her career. There was, indeed, considerable trouble in the minds of the various male Vavasors with reference to Arabella, when tidings suddenly reached the Hall that she was going to be married to an old man.\nShe was married to the old man; and the marriage fortunately turned out satisfactorily, at any rate for the old man and for her family. The Vavasors were relieved from all further trouble, and were as much surprised as gratified when they heard that she did her duty well in her new position. Arabella had long been a thorn in their side, never having really done anything which they could pronounce to be absolutely wrong, but always giving them cause for fear. Now they feared no longer. Her husband was a retired merchant, very rich, not very strong in health, and devoted to his bride. Rumours soon made their way to Vavasor Hall, and to Queen Anne Street, that Mrs. Greenow was quite a pattern wife, and that Mr. Greenow considered himself to be the happiest old man in Lancashire. And now in her prosperity she quite forgave the former slights which had been put upon her by her relatives. She wrote to her dear niece Alice, and to her dearest niece Kate, and sent little presents to her father. On one occasion she took her husband to Vavasor Hall, and there was a regular renewal of all the old family feelings. Arabella's husband was an old man, and was very old for his age; but the whole thing was quite respectable, and there was, at any rate, no doubt about the money. Then Mr. Greenow died; and the widow, having proved the will, came up to London and claimed the commiseration of her nieces.\n\"Why not go to Yarmouth with her for a month?\" George had said to Kate. \"Of course it will be a bore. But an aunt with forty thousand pounds has a right to claim attention.\" Kate acknowledged the truth of the argument and agreed to go to Yarmouth for a month. \"Your aunt Arabella has shown herself to be a very sensible woman,\" the old squire had written; \"much more sensible than anybody thought her before her marriage. Of course you should go with her if she asks you.\" What aunt, uncle, or cousin, in the uncontrolled possession of forty thousand pounds was ever unpopular in the family?\nYarmouth is not a very prepossessing place to the eye. To my eye, at any rate, it is not so. There is an old town with which summer visitors have little or nothing to do; and there are the new houses down by the sea-side, to which, at any rate, belongs the full advantage of sea air. A kind of esplanade runs for nearly a mile along the sands, and there are built, or in the course of building, rows of houses appropriated to summer visitors all looking out upon the sea. There is no beauty unless the yellow sandy sea can be called beautiful. The coast is low and straight, and the east wind blows full upon it. But the place is healthy; and Mrs. Greenow was probably right in thinking that she might there revive some portion of the health which she had lost in watching beside the couch of her departing lord.\n\"Omnibus;--no, indeed. Jeannette, get me a fly.\" These were the first words Mrs. Greenow spoke as she put her foot upon the platform at the Yarmouth station. Her maid's name was Jenny; but Kate had already found, somewhat to her dismay, that orders had been issued before they left London that the girl was henceforth to be called Jeannette. Kate had also already found that her aunt could be imperious; but this taste for masterdom had not shown itself so plainly in London as it did from the moment that the train had left the station at Shoreditch. In London Mrs. Greenow had been among Londoners, and her career had hitherto been provincial. Her spirit, no doubt, had been somewhat cowed by the novelty of her position. But when she felt herself to be once beyond the stones as the saying used to be, she was herself again; and at Ipswich she had ordered Jeannette to get her a glass of sherry with an air which had created a good deal of attention among the guards and porters.\nThe fly was procured; and with considerable exertion all Mrs. Greenow's boxes, together with the more moderate belongings of her niece and maid, were stowed on the top of it, round upon the driver's body on the coach box, on the maid's lap, and I fear in Kate's also, and upon the vacant seat.\n\"The large house in Montpelier Parade,\" said Mrs. Greenow.\n\"They is all large, ma'am,\" said the driver.\n\"The largest,\" said Mrs. Greenow.\n\"They're much of a muchness,\" said the driver.\n\"Then Mrs. Jones's,\" said Mrs. Greenow. \"But I was particularly told it was the largest in the row.\"\n\"I know Mrs. Jones's well,\" said the driver, and away they went.\nMrs. Jones's house was handsome and comfortable; but I fear Mrs. Greenow's satisfaction in this respect was impaired by her disappointment in finding that it was not perceptibly bigger than those to the right and left of her. Her ambition in this and in other similar matters would have amused Kate greatly had she been a bystander, and not one of her aunt's party. Mrs. Greenow was good-natured, liberal, and not by nature selfish; but she was determined not to waste the good things which fortune had given, and desired that all the world should see that she had forty thousand pounds of her own. And in doing this she was repressed by no feeling of false shame. She never hesitated in her demands through bashfulness. She called aloud for such comfort and grandeur as Yarmouth could afford her, and was well pleased that all around should hear her calling. Joined to all this was her uncontrolled grief for her husband's death.\n\"Dear Greenow! sweet lamb! Oh, Kate, if you'd only known that man!\" When she said this she was sitting in the best of Mrs. Jones's sitting-rooms, waiting to have dinner announced. She had taken a drawing-room and dining-room, \"because,\" as she had said, \"she didn't see why people should be stuffy when they went to the seaside;--not if they had means to make themselves comfortable.\"\n\"Oh, Kate, I do wish you'd known him!\"\n\"I wish I had,\" said Kate,--very untruly. \"I was unfortunately away when he went to Vavasor Hall.\"\n\"Ah, yes; but it was at home, in the domestic circle, that Greenow should have been seen to be appreciated. I was a happy woman, Kate, while that lasted.\" And Kate was surprised to see that real tears--one or two on each side--were making their way down her aunt's cheeks. But they were soon checked with a handkerchief of the broadest hem and of the finest cambric.\n\"Dinner, ma'am,\" said Jeannette, opening the door.\n\"Jeannette, I told you always to say that dinner was served.\"\n\"Dinner's served then,\" said Jeannette in a tone of anger.\n\"Come, Kate,\" said her aunt. \"I've but little appetite myself, but there's no reason you shouldn't eat your dinner. I specially wrote to Mrs. Jones to have some sweetbread. I do hope she's got a decent cook. It's very little I eat myself, but I do like to see things nice.\"\nThe next day was Sunday; and it was beautiful to see how Mrs. Greenow went to church in all the glory of widowhood. There had been a great unpacking after that banquet on the sweetbread, and all her funereal millinery had been displayed before Kate's wondering eyes. The charm of the woman was in this,--that she was not in the least ashamed of anything that she did. She turned over all her wardrobe of mourning, showing the richness of each article, the stiffness of the crape, the fineness of the cambric, the breadth of the frills,--telling the price of each to a shilling, while she explained how the whole had been amassed without any consideration of expense. This she did with all the pride of a young bride when she shows the glories of her trousseau to the friend of her bosom. Jeannette stood by the while, removing one thing and exhibiting another. Now and again through the performance, Mrs. Greenow would rest a while from her employment, and address the shade of the departed one in terms of most endearing affection. In the midst of this Mrs. Jones came in; but the widow was not a whit abashed by the presence of the stranger. \"Peace be to his manes!\" she said at last, as she carefully folded up a huge black crape mantilla. She made, however, but one syllable of the classical word, and Mrs. Jones thought that her lodger had addressed herself to the mortal \"remains\" of her deceased lord.\n[Illustration: \"Peace be to his manes.\"]\n\"He is left her uncommon well off, I suppose,\" said Mrs. Jones to Jeannette.\n\"You may say that, ma'am. It's more nor a hundred thousand of pounds!\"\n\"No!\"\n\"Pounds of sterling, ma'am! Indeed it is;--to my knowledge.\"\n\"Why don't she have a carriage?\"\n\"So she do;--but a lady can't bring her carriage down to the sea when she's only just buried her husband as one may say. What'd folks say if they saw her in her own carriage? But it ain't because she can't afford it, Mrs. Jones. And now we're talking of it you must order a fly for church to-morrow, that'll look private, you know. She said I was to get a man that had a livery coat and gloves.\"\nThe man with the coat and gloves was procured; and Mrs. Greenow's entry into church made quite a sensation. There was a thoughtfulness about her which alone showed that she was a woman of no ordinary power. She foresaw all necessities, and made provision for all emergencies. Another would not have secured an eligible sitting, and been at home in Yarmouth church, till half the period of her sojourn there was over. But Mrs. Greenow had done it all. She walked up the middle aisle with as much self-possession as though the chancel had belonged to her family for years; and the respectable pew-opener absolutely deserted two or three old ladies whom she was attending, to show Mrs. Greenow into her seat. When seated, she was the cynosure of all eyes. Kate Vavasor became immediately aware that a great sensation had been occasioned by their entrance, and equally aware that none of it was due to her. I regret to say that this feeling continued to show itself throughout the whole service. How many ladies of forty go to church without attracting the least attention! But it is hardly too much to say that every person in that church had looked at Mrs. Greenow. I doubt if there was present there a single married lady who, on leaving the building, did not speak to her husband of the widow. There had prevailed during the whole two hours a general though unexpressed conviction that something worthy of remark had happened that morning. It had an effect even upon the curate's reading; and the incumbent, while preaching his sermon, could not keep his eyes off that wonderful bonnet and veil.\nOn the next morning, before eleven, Mrs. Greenow's name was put down at the Assembly Room. \"I need hardly say that in my present condition I care nothing for these things. Of course I would sooner be alone. But, my dear Kate, I know what I owe to you.\"\nKate, with less intelligence than might have been expected from one so clever, began to assure her aunt that she required no society; and that, coming thus with her to the seaside in the early days of her widowhood, she had been well aware that they would live retired. But Mrs. Greenow soon put her down, and did so without the slightest feeling of shame or annoyance on her own part. \"My dear,\" she said, \"in this matter you must let me do what I know to be right. I should consider myself to be very selfish if I allowed my grief to interfere with your amusements.\"\n\"But, aunt, I don't care for such amusements.\"\n\"That's nonsense, my dear. You ought to care for them. How are you to settle yourself in life if you don't care for them?\"\n\"My dear aunt, I am settled.\"\n\"Settled!\" said Mrs. Greenow, astounded, as though there must have been some hidden marriage of which she had not heard. \"But that's nonsense. Of course you're not settled; and how are you to be, if I allow you to shut yourself up in such a place as this,--just where a girl has a chance?\"\nIt was in vain that Kate tried to stop her. It was not easy to stop Mrs. Greenow when she was supported by the full assurance of being mistress of the place and of the occasion. \"No, my dear; I know very well what I owe to you, and I shall do my duty. As I said before, society can have no charms now for such a one as I am. All that social intercourse could ever do for me lies buried in my darling's grave. My heart is desolate, and must remain so. But I'm not going to immolate you on the altars of my grief. I shall force myself to go out for your sake, Kate.\"\n\"But, dear aunt, the world will think it so odd, just at present.\"\n\"I don't care twopence for the world. What can the world do to me? I'm not dependent on the world,--thanks to the care of that sainted lamb. I can hold my own; and as long as I can do that the world won't hurt me. No, Kate, if I think a thing's right I shall do it. I mean to make the place pleasant for you if I can, and the world may object if it likes.\"\nMrs. Greenow was probably right in her appreciation of the value of her independence. Remarks may perhaps have been made by the world of Yarmouth as to her early return to society. People, no doubt, did remind each other that old Greenow was hardly yet four months buried. Mrs. Jones and Jeannette probably had their little jokes down-stairs. But this did not hurt Mrs. Greenow. What was said, was not said in her hearing, Mrs. Jones's bills were paid every Saturday with admirable punctuality; and as long as this was done everybody about the house treated the lady with that deference which was due to the respectability of her possessions. When a recently bereaved widow attempts to enjoy her freedom without money, then it behoves the world to speak aloud;--and the world does its duty.\nNumerous people came to call at Montpelier Parade, and Kate was astonished to find that her aunt had so many friends. She was indeed so bewildered by these strangers that she could hardly ascertain whom her aunt had really known before, and whom she now saw for the first time. Somebody had known somebody who had known somebody else, and that was allowed to be a sufficient introduction,--always presuming that the existing somebody was backed by some known advantages of money or position. Mrs. Greenow could smile from beneath her widow's cap in a most bewitching way. \"Upon my word then she is really handsome,\" Kate wrote one day to Alice. But she could also frown, and knew well how to put aside, or, if need be, to reprobate any attempt at familiarity from those whose worldly circumstances were supposed to be disadvantageous.\n\"My dear aunt,\" said Kate one morning after their walk upon the pier, \"how you did snub that Captain Bellfield!\"\n\"Captain Bellfield, indeed! I don't believe he's a captain at all. At any rate he has sold out, and the tradesmen have had a scramble for the money. He was only a lieutenant when the 97th were in Manchester, and I'm sure he's never had a shilling to purchase since that.\"\n\"But everybody here seems to know him.\"\n\"Perhaps they do not know so much of him as I do. The idea of his having the impudence to tell me I was looking very well! Nothing can be so mean as men who go about in that way when they haven't money enough in their pockets to pay their washerwomen.\"\n\"But how do you know, aunt, that Captain Bellfield hasn't paid his washerwoman?\"\n\"I know more than you think, my dear. It's my business. How could I tell whose attentions you should receive and whose you shouldn't, if I didn't inquire into these things?\"\nIt was in vain that Kate rebelled, or attempted to rebel against this more than maternal care. She told her aunt that she was now nearly thirty, and that she had managed her own affairs, at any rate with safety, for the last ten years;--but it was to no purpose. Kate would get angry; but Mrs. Greenow never became angry. Kate would be quite in earnest; but Mrs. Greenow would push aside all that her niece said as though it were worth nothing. Kate was an unmarried woman with a very small fortune, and therefore, of course, was desirous of being married with as little delay as possible. It was natural that she should deny that it was so, especially at this early date in their mutual acquaintance. When the niece came to know her aunt more intimately, there might be confidence between them, and then they would do better. But Mrs. Greenow would spare neither herself nor her purse on Kate's behalf, and she would be a dragon of watchfulness in protecting her from the evil desires of such useless men as Captain Bellfield.\n\"I declare, Kate, I don't understand you,\" she said one morning to her niece as they sat together over a late breakfast. They had fallen into luxurious habits, and I am afraid it was past eleven o'clock, although the breakfast things were still on the table. Kate would usually bathe before breakfast, but Mrs. Greenow was never out of her room till half-past ten. \"I like the morning for contemplation,\" she once said. \"When a woman has gone through all that I have suffered she has a great deal to think of.\" \"And it is so much more comfortable to be a-thinking when one's in bed,\" said Jeannette, who was present at the time. \"Child, hold your tongue,\" said the widow. \"Yes, ma'am,\" said Jeannette. But we'll return to the scene at the breakfast-table.\n\"What don't you understand, aunt?\"\n\"You only danced twice last night, and once you stood up with Captain Bellfield.\"\n\"On purpose to ask after that poor woman who washes his clothes without getting paid for it.\"\n\"Nonsense, Kate; you didn't ask him anything of the kind, I'm sure. It's very provoking. It is indeed.\"\n\"But what harm can Captain Bellfield do me?\"\n\"What good can he do you? That's the question. You see, my dear, years will go by. I don't mean to say you ain't quite as young as ever you were, and nothing can be nicer and fresher than you are;--especially since you took to bathing.\"\n\"Oh, aunt, don't!\"\n\"My dear, the truth must be spoken. I declare I don't think I ever saw a young woman so improvident as you are. When are you to begin to think about getting married if you don't do it now?\"\n\"I shall never begin to think about it, till I buy my wedding clothes.\"\n\"That's nonsense,--sheer nonsense. How are you to get wedding clothes if you have never thought about getting a husband? Didn't I see Mr. Cheesacre ask you for a dance last night?\"\n\"Yes, he did; while you were talking to Captain Bellfield yourself, aunt.\"\n\"Captain Bellfield can't hurt me, my dear. And why didn't you dance with Mr. Cheesacre?\"\n\"He's a fat Norfolk farmer, with not an idea beyond the virtues of stall-feeding.\"\n\"My dear, every acre of it is his own land,--every acre! And he bought another farm for thirteen thousand pounds only last autumn. They're better than the squires,--some of those gentlemen farmers; they are indeed. And of all men in the world they're the easiest managed.\"\n\"That's a recommendation, no doubt.\"\n\"Of course it is;--a great recommendation.\"\nMrs. Greenow had no idea of joking when her mind was intent on serious things. \"He's to take us to the picnic to-morrow, and I do hope you'll manage to let him sit beside you. It'll be the place of honour, because he gives all the wine. He's picked up with that man Bellfield, and he's to be there; but if you allow your name to be once mixed up with his, it will be all over with you as far as Yarmouth is concerned.\"\n\"I don't at all want to be mixed up with Captain Bellfield, as you call it,\" said Kate. Then she subsided into her novel, while Mrs. Greenow busied herself about the good things for the picnic. In truth, the aunt did not understand the niece. Whatsoever might be the faults of Kate Vavasor, an unmaidenly desire of catching a husband for herself was certainly not one of them.",
        "paragraph_chars": [
            [
                0,
                936
            ],
            [
                936,
                2456
            ],
            [
                2456,
                3863
            ],
            [
                3863,
                4455
            ],
            [
                4455,
                5268
            ],
            [
                5268,
                6251
            ],
            [
                6251,
                6545
            ],
            [
                6545,
                6604
            ],
            [
                6604,
                6649
            ],
            [
                6649,
                6683
            ],
            [
                6683,
                6730
            ],
            [
                6730,
                6831
            ],
            [
                6831,
                6896
            ],
            [
                6896,
                7827
            ],
            [
                7827,
                8212
            ],
            [
                8212,
                8251
            ],
            [
                8251,
                8350
            ],
            [
                8350,
                8717
            ],
            [
                8717,
                8768
            ],
            [
                8768,
                8830
            ],
            [
                8830,
                8889
            ],
            [
                8889,
                9163
            ],
            [
                9163,
                10572
            ],
            [
                10572,
                10613
            ],
            [
                10613,
                10690
            ],
            [
                10690,
                10761
            ],
            [
                10761,
                10767
            ],
            [
                10767,
                10828
            ],
            [
                10828,
                10861
            ],
            [
                10861,
                11257
            ],
            [
                11257,
                12853
            ],
            [
                12853,
                13106
            ],
            [
                13106,
                13675
            ],
            [
                13675,
                13722
            ],
            [
                13722,
                13845
            ],
            [
                13845,
                13875
            ],
            [
                13875,
                14165
            ],
            [
                14165,
                14730
            ],
            [
                14730,
                14797
            ],
            [
                14797,
                15154
            ],
            [
                15154,
                15945
            ],
            [
                15945,
                16780
            ],
            [
                16780,
                16893
            ],
            [
                16893,
                17165
            ],
            [
                17165,
                17205
            ],
            [
                17205,
                17458
            ],
            [
                17458,
                17539
            ],
            [
                17539,
                17713
            ],
            [
                17713,
                18741
            ],
            [
                18741,
                19497
            ],
            [
                19497,
                19532
            ],
            [
                19532,
                19614
            ],
            [
                19614,
                19708
            ],
            [
                19708,
                19812
            ],
            [
                19812,
                19857
            ],
            [
                19857,
                20094
            ],
            [
                20094,
                20113
            ],
            [
                20113,
                20303
            ],
            [
                20303,
                20375
            ],
            [
                20375,
                20556
            ],
            [
                20556,
                20631
            ],
            [
                20631,
                20720
            ],
            [
                20720,
                20803
            ],
            [
                20803,
                21076
            ],
            [
                21076,
                21113
            ],
            [
                21113,
                21157
            ],
            [
                21157,
                21576
            ],
            [
                21576,
                21952
            ]
        ],
        "segment_chars": [
            [
                0,
                143
            ],
            [
                143,
                291
            ],
            [
                291,
                355
            ],
            [
                355,
                410
            ],
            [
                410,
                439
            ],
            [
                439,
                520
            ],
            [
                520,
                641
            ],
            [
                641,
                741
            ],
            [
                741,
                936
            ],
            [
                936,
                1036
            ],
            [
                1036,
                1129
            ],
            [
                1129,
                1400
            ],
            [
                1400,
                1509
            ],
            [
                1509,
                1647
            ],
            [
                1647,
                1706
            ],
            [
                1706,
                1817
            ],
            [
                1817,
                1857
            ],
            [
                1857,
                2066
            ],
            [
                2066,
                2259
            ],
            [
                2259,
                2456
            ],
            [
                2456,
                2592
            ],
            [
                2592,
                2749
            ],
            [
                2749,
                2919
            ],
            [
                2919,
                2946
            ],
            [
                2946,
                3046
            ],
            [
                3046,
                3243
            ],
            [
                3243,
                3352
            ],
            [
                3352,
                3458
            ],
            [
                3458,
                3576
            ],
            [
                3576,
                3738
            ],
            [
                3738,
                3863
            ],
            [
                3863,
                3910
            ],
            [
                3910,
                3935
            ],
            [
                3935,
                3965
            ],
            [
                3965,
                4037
            ],
            [
                4037,
                4123
            ],
            [
                4123,
                4285
            ],
            [
                4285,
                4336
            ],
            [
                4336,
                4455
            ],
            [
                4455,
                4510
            ],
            [
                4510,
                4548
            ],
            [
                4548,
                4739
            ],
            [
                4739,
                4927
            ],
            [
                4927,
                4999
            ],
            [
                4999,
                5068
            ],
            [
                5068,
                5268
            ],
            [
                5268,
                5291
            ],
            [
                5291,
                5317
            ],
            [
                5317,
                5426
            ],
            [
                5426,
                5610
            ],
            [
                5610,
                5820
            ],
            [
                5820,
                5914
            ],
            [
                5914,
                5992
            ],
            [
                5992,
                6251
            ],
            [
                6251,
                6545
            ],
            [
                6545,
                6604
            ],
            [
                6604,
                6649
            ],
            [
                6649,
                6683
            ],
            [
                6683,
                6730
            ],
            [
                6730,
                6770
            ],
            [
                6770,
                6831
            ],
            [
                6831,
                6896
            ],
            [
                6896,
                7122
            ],
            [
                7122,
                7262
            ],
            [
                7262,
                7495
            ],
            [
                7495,
                7561
            ],
            [
                7561,
                7617
            ],
            [
                7617,
                7756
            ],
            [
                7756,
                7827
            ],
            [
                7827,
                7842
            ],
            [
                7842,
                7854
            ],
            [
                7854,
                7895
            ],
            [
                7895,
                8007
            ],
            [
                8007,
                8212
            ],
            [
                8212,
                8251
            ],
            [
                8251,
                8293
            ],
            [
                8293,
                8350
            ],
            [
                8350,
                8458
            ],
            [
                8458,
                8505
            ],
            [
                8505,
                8623
            ],
            [
                8623,
                8717
            ],
            [
                8717,
                8768
            ],
            [
                8768,
                8830
            ],
            [
                8830,
                8889
            ],
            [
                8889,
                8918
            ],
            [
                8918,
                9005
            ],
            [
                9005,
                9062
            ],
            [
                9062,
                9097
            ],
            [
                9097,
                9163
            ],
            [
                9163,
                9279
            ],
            [
                9279,
                9430
            ],
            [
                9430,
                9531
            ],
            [
                9531,
                9830
            ],
            [
                9830,
                9951
            ],
            [
                9951,
                10024
            ],
            [
                10024,
                10196
            ],
            [
                10196,
                10307
            ],
            [
                10307,
                10332
            ],
            [
                10332,
                10406
            ],
            [
                10406,
                10572
            ],
            [
                10572,
                10613
            ],
            [
                10613,
                10690
            ],
            [
                10690,
                10716
            ],
            [
                10716,
                10761
            ],
            [
                10761,
                10767
            ],
            [
                10767,
                10795
            ],
            [
                10795,
                10828
            ],
            [
                10828,
                10861
            ],
            [
                10861,
                10982
            ],
            [
                10982,
                11036
            ],
            [
                11036,
                11090
            ],
            [
                11090,
                11193
            ],
            [
                11193,
                11257
            ],
            [
                11257,
                11365
            ],
            [
                11365,
                11464
            ],
            [
                11464,
                11533
            ],
            [
                11533,
                11674
            ],
            [
                11674,
                11708
            ],
            [
                11708,
                11963
            ],
            [
                11963,
                12010
            ],
            [
                12010,
                12160
            ],
            [
                12160,
                12249
            ],
            [
                12249,
                12327
            ],
            [
                12327,
                12421
            ],
            [
                12421,
                12551
            ],
            [
                12551,
                12697
            ],
            [
                12697,
                12853
            ],
            [
                12853,
                12944
            ],
            [
                12944,
                13025
            ],
            [
                13025,
                13060
            ],
            [
                13060,
                13106
            ],
            [
                13106,
                13376
            ],
            [
                13376,
                13492
            ],
            [
                13492,
                13573
            ],
            [
                13573,
                13675
            ],
            [
                13675,
                13722
            ],
            [
                13722,
                13749
            ],
            [
                13749,
                13777
            ],
            [
                13777,
                13845
            ],
            [
                13845,
                13875
            ],
            [
                13875,
                13886
            ],
            [
                13886,
                13996
            ],
            [
                13996,
                14018
            ],
            [
                14018,
                14165
            ],
            [
                14165,
                14209
            ],
            [
                14209,
                14343
            ],
            [
                14343,
                14417
            ],
            [
                14417,
                14490
            ],
            [
                14490,
                14574
            ],
            [
                14574,
                14616
            ],
            [
                14616,
                14677
            ],
            [
                14677,
                14730
            ],
            [
                14730,
                14797
            ],
            [
                14797,
                14835
            ],
            [
                14835,
                14864
            ],
            [
                14864,
                14938
            ],
            [
                14938,
                15011
            ],
            [
                15011,
                15063
            ],
            [
                15063,
                15154
            ],
            [
                15154,
                15240
            ],
            [
                15240,
                15335
            ],
            [
                15335,
                15427
            ],
            [
                15427,
                15497
            ],
            [
                15497,
                15533
            ],
            [
                15533,
                15797
            ],
            [
                15797,
                15945
            ],
            [
                15945,
                16063
            ],
            [
                16063,
                16223
            ],
            [
                16223,
                16437
            ],
            [
                16437,
                16517
            ],
            [
                16517,
                16590
            ],
            [
                16590,
                16780
            ],
            [
                16780,
                16893
            ],
            [
                16893,
                16921
            ],
            [
                16921,
                16960
            ],
            [
                16960,
                17042
            ],
            [
                17042,
                17165
            ],
            [
                17165,
                17205
            ],
            [
                17205,
                17255
            ],
            [
                17255,
                17328
            ],
            [
                17328,
                17458
            ],
            [
                17458,
                17539
            ],
            [
                17539,
                17577
            ],
            [
                17577,
                17595
            ],
            [
                17595,
                17713
            ],
            [
                17713,
                17808
            ],
            [
                17808,
                17976
            ],
            [
                17976,
                18035
            ],
            [
                18035,
                18158
            ],
            [
                18158,
                18303
            ],
            [
                18303,
                18415
            ],
            [
                18415,
                18540
            ],
            [
                18540,
                18741
            ],
            [
                18741,
                18862
            ],
            [
                18862,
                19000
            ],
            [
                19000,
                19106
            ],
            [
                19106,
                19161
            ],
            [
                19161,
                19252
            ],
            [
                19252,
                19370
            ],
            [
                19370,
                19413
            ],
            [
                19413,
                19443
            ],
            [
                19443,
                19497
            ],
            [
                19497,
                19532
            ],
            [
                19532,
                19614
            ],
            [
                19614,
                19708
            ],
            [
                19708,
                19776
            ],
            [
                19776,
                19797
            ],
            [
                19797,
                19812
            ],
            [
                19812,
                19857
            ],
            [
                19857,
                19883
            ],
            [
                19883,
                19904
            ],
            [
                19904,
                19940
            ],
            [
                19940,
                20094
            ],
            [
                20094,
                20113
            ],
            [
                20113,
                20149
            ],
            [
                20149,
                20225
            ],
            [
                20225,
                20303
            ],
            [
                20303,
                20375
            ],
            [
                20375,
                20410
            ],
            [
                20410,
                20496
            ],
            [
                20496,
                20556
            ],
            [
                20556,
                20631
            ],
            [
                20631,
                20674
            ],
            [
                20674,
                20720
            ],
            [
                20720,
                20803
            ],
            [
                20803,
                20860
            ],
            [
                20860,
                20934
            ],
            [
                20934,
                21018
            ],
            [
                21018,
                21076
            ],
            [
                21076,
                21113
            ],
            [
                21113,
                21157
            ],
            [
                21157,
                21236
            ],
            [
                21236,
                21333
            ],
            [
                21333,
                21394
            ],
            [
                21394,
                21576
            ],
            [
                21576,
                21664
            ],
            [
                21664,
                21770
            ],
            [
                21770,
                21819
            ],
            [
                21819,
                21952
            ]
        ],
        "overlap_chars": [
            [
                0,
                79
            ],
            [
                141,
                142
            ],
            [
                143,
                202
            ],
            [
                211,
                216
            ],
            [
                218,
                226
            ],
            [
                289,
                291
            ],
            [
                291,
                302
            ],
            [
                312,
                316
            ],
            [
                324,
                331
            ],
            [
                353,
                355
            ],
            [
                355,
                410
            ],
            [
                410,
                439
            ],
            [
                439,
                447
            ],
            [
                458,
                476
            ],
            [
                483,
                503
            ],
            [
                509,
                520
            ],
            [
                520,
                560
            ],
            [
                616,
                641
            ],
            [
                658,
                668
            ],
            [
                670,
                740
            ],
            [
                936,
                943
            ],
            [
                952,
                1036
            ],
            [
                1036,
                1070
            ],
            [
                1094,
                1129
            ],
            [
                1129,
                1136
            ],
            [
                1142,
                1182
            ],
            [
                1398,
                1400
            ],
            [
                1509,
                1526
            ],
            [
                1575,
                1598
            ],
            [
                1622,
                1647
            ],
            [
                1713,
                1720
            ],
            [
                1729,
                1732
            ],
            [
                1738,
                1756
            ],
            [
                1817,
                1857
            ],
            [
                1857,
                1932
            ],
            [
                2034,
                2039
            ],
            [
                2012,
                2014
            ],
            [
                2064,
                2065
            ],
            [
                2066,
                2199
            ],
            [
                2212,
                2227
            ],
            [
                2257,
                2259
            ],
            [
                2268,
                2277
            ],
            [
                2367,
                2373
            ],
            [
                2302,
                2305
            ],
            [
                2408,
                2456
            ],
            [
                2492,
                2542
            ],
            [
                2590,
                2592
            ],
            [
                2592,
                2623
            ],
            [
                2636,
                2717
            ],
            [
                2718,
                2727
            ],
            [
                2747,
                2749
            ],
            [
                2946,
                3001
            ],
            [
                3018,
                3046
            ],
            [
                3046,
                3058
            ],
            [
                3077,
                3089
            ],
            [
                3117,
                3138
            ],
            [
                3145,
                3146
            ],
            [
                3155,
                3242
            ],
            [
                3458,
                3510
            ],
            [
                3639,
                3640
            ],
            [
                3615,
                3639
            ],
            [
                3510,
                3511
            ],
            [
                3641,
                3648
            ],
            [
                3661,
                3738
            ],
            [
                3738,
                3774
            ],
            [
                3800,
                3804
            ],
            [
                3808,
                3863
            ],
            [
                3863,
                3910
            ],
            [
                3910,
                3935
            ],
            [
                3935,
                3965
            ],
            [
                3965,
                4037
            ],
            [
                4191,
                4209
            ],
            [
                4210,
                4217
            ],
            [
                4161,
                4163
            ],
            [
                4260,
                4263
            ],
            [
                4271,
                4274
            ],
            [
                4306,
                4308
            ],
            [
                4318,
                4320
            ],
            [
                4283,
                4284
            ],
            [
                4037,
                4041
            ],
            [
                4085,
                4122
            ],
            [
                4455,
                4497
            ],
            [
                4508,
                4510
            ],
            [
                4548,
                4568
            ],
            [
                4574,
                4595
            ],
            [
                4622,
                4624
            ],
            [
                4624,
                4675
            ],
            [
                4737,
                4739
            ],
            [
                4739,
                4812
            ],
            [
                4850,
                4857
            ],
            [
                4858,
                4864
            ],
            [
                4881,
                4896
            ],
            [
                4818,
                4819
            ],
            [
                4897,
                4927
            ],
            [
                4927,
                4999
            ],
            [
                4999,
                5068
            ],
            [
                5068,
                5092
            ],
            [
                5266,
                5268
            ],
            [
                5268,
                5277
            ],
            [
                5279,
                5291
            ],
            [
                5291,
                5310
            ],
            [
                5314,
                5317
            ],
            [
                5317,
                5403
            ],
            [
                5408,
                5426
            ],
            [
                5426,
                5465
            ],
            [
                5474,
                5509
            ],
            [
                5562,
                5574
            ],
            [
                5586,
                5609
            ],
            [
                5681,
                5752
            ],
            [
                5818,
                5820
            ],
            [
                5902,
                5912
            ],
            [
                5852,
                5868
            ],
            [
                5914,
                5924
            ],
            [
                5936,
                5959
            ],
            [
                5990,
                5992
            ],
            [
                5992,
                5995
            ],
            [
                6073,
                6230
            ],
            [
                6242,
                6251
            ],
            [
                6251,
                6254
            ],
            [
                6259,
                6262
            ],
            [
                6271,
                6276
            ],
            [
                6304,
                6425
            ],
            [
                6437,
                6447
            ],
            [
                6471,
                6495
            ],
            [
                6506,
                6545
            ],
            [
                6545,
                6604
            ],
            [
                6604,
                6649
            ],
            [
                6649,
                6682
            ],
            [
                6730,
                6731
            ],
            [
                6736,
                6748
            ],
            [
                6768,
                6770
            ],
            [
                6775,
                6780
            ],
            [
                6794,
                6831
            ],
            [
                6831,
                6851
            ],
            [
                6856,
                6896
            ],
            [
                6896,
                6968
            ],
            [
                7000,
                7003
            ],
            [
                7092,
                7094
            ],
            [
                7046,
                7091
            ],
            [
                7120,
                7122
            ],
            [
                7138,
                7142
            ],
            [
                7126,
                7134
            ],
            [
                7172,
                7236
            ],
            [
                7244,
                7254
            ],
            [
                7260,
                7262
            ],
            [
                7262,
                7291
            ],
            [
                7302,
                7305
            ],
            [
                7327,
                7336
            ],
            [
                7410,
                7482
            ],
            [
                7493,
                7495
            ],
            [
                7561,
                7564
            ],
            [
                7604,
                7615
            ],
            [
                7615,
                7616
            ],
            [
                7617,
                7681
            ],
            [
                7689,
                7756
            ],
            [
                7756,
                7827
            ],
            [
                7827,
                7842
            ],
            [
                7842,
                7854
            ],
            [
                7854,
                7895
            ],
            [
                7895,
                7972
            ],
            [
                7989,
                7995
            ],
            [
                8005,
                8007
            ],
            [
                8212,
                8251
            ],
            [
                8251,
                8277
            ],
            [
                8284,
                8287
            ],
            [
                8291,
                8293
            ],
            [
                8293,
                8299
            ],
            [
                8314,
                8326
            ],
            [
                8332,
                8350
            ],
            [
                8350,
                8378
            ],
            [
                8404,
                8416
            ],
            [
                8434,
                8458
            ],
            [
                8458,
                8483
            ],
            [
                8502,
                8505
            ],
            [
                8505,
                8550
            ],
            [
                8577,
                8623
            ],
            [
                8623,
                8676
            ],
            [
                8701,
                8717
            ],
            [
                8717,
                8768
            ],
            [
                8768,
                8830
            ],
            [
                8830,
                8868
            ],
            [
                8887,
                8889
            ],
            [
                8889,
                8918
            ],
            [
                8918,
                8923
            ],
            [
                8928,
                9005
            ],
            [
                9062,
                9071
            ],
            [
                9026,
                9036
            ],
            [
                9078,
                9095
            ],
            [
                9163,
                9279
            ],
            [
                9279,
                9317
            ],
            [
                9348,
                9370
            ],
            [
                9381,
                9430
            ],
            [
                9585,
                9605
            ],
            [
                9641,
                9662
            ],
            [
                9670,
                9697
            ],
            [
                9700,
                9764
            ],
            [
                9821,
                9828
            ],
            [
                9775,
                9783
            ],
            [
                9564,
                9566
            ],
            [
                9804,
                9817
            ],
            [
                9828,
                9830
            ],
            [
                9830,
                9878
            ],
            [
                9909,
                9922
            ],
            [
                9949,
                9951
            ],
            [
                10024,
                10037
            ],
            [
                10061,
                10081
            ],
            [
                10116,
                10157
            ],
            [
                10185,
                10194
            ],
            [
                10194,
                10196
            ],
            [
                10196,
                10258
            ],
            [
                10266,
                10276
            ],
            [
                10281,
                10289
            ],
            [
                10305,
                10306
            ],
            [
                10613,
                10616
            ],
            [
                10620,
                10688
            ],
            [
                10688,
                10690
            ],
            [
                10690,
                10716
            ],
            [
                10716,
                10761
            ],
            [
                10761,
                10767
            ],
            [
                10795,
                10807
            ],
            [
                10825,
                10828
            ],
            [
                10828,
                10861
            ],
            [
                10861,
                10862
            ],
            [
                10865,
                10872
            ],
            [
                10874,
                10965
            ],
            [
                10980,
                10982
            ],
            [
                10982,
                10998
            ],
            [
                11034,
                11036
            ],
            [
                11036,
                11090
            ],
            [
                11090,
                11134
            ],
            [
                11139,
                11149
            ],
            [
                11191,
                11193
            ],
            [
                11193,
                11257
            ],
            [
                11257,
                11365
            ],
            [
                11708,
                11738
            ],
            [
                11768,
                11858
            ],
            [
                11870,
                11902
            ],
            [
                11927,
                11963
            ],
            [
                12000,
                12008
            ],
            [
                12008,
                12009
            ],
            [
                12160,
                12185
            ],
            [
                12194,
                12203
            ],
            [
                12219,
                12249
            ],
            [
                12365,
                12392
            ],
            [
                12397,
                12421
            ],
            [
                12551,
                12556
            ],
            [
                12598,
                12607
            ],
            [
                12627,
                12652
            ],
            [
                12670,
                12697
            ],
            [
                12714,
                12718
            ],
            [
                12724,
                12727
            ],
            [
                12763,
                12853
            ],
            [
                12860,
                12872
            ],
            [
                12889,
                12944
            ],
            [
                12944,
                13025
            ],
            [
                13060,
                13106
            ],
            [
                13106,
                13218
            ],
            [
                13228,
                13238
            ],
            [
                13248,
                13249
            ],
            [
                13240,
                13243
            ],
            [
                13374,
                13376
            ],
            [
                13376,
                13397
            ],
            [
                13402,
                13405
            ],
            [
                13410,
                13411
            ],
            [
                13423,
                13430
            ],
            [
                13453,
                13455
            ],
            [
                13465,
                13474
            ],
            [
                13490,
                13491
            ],
            [
                13492,
                13514
            ],
            [
                13529,
                13573
            ],
            [
                13573,
                13581
            ],
            [
                13601,
                13675
            ],
            [
                13675,
                13722
            ],
            [
                13722,
                13749
            ],
            [
                13749,
                13777
            ],
            [
                13777,
                13845
            ],
            [
                13845,
                13875
            ],
            [
                13875,
                13886
            ],
            [
                13886,
                13996
            ],
            [
                13996,
                14018
            ],
            [
                14018,
                14105
            ],
            [
                14162,
                14165
            ],
            [
                14165,
                14208
            ],
            [
                14343,
                14358
            ],
            [
                14399,
                14415
            ],
            [
                14388,
                14391
            ],
            [
                14415,
                14417
            ],
            [
                14574,
                14595
            ],
            [
                14620,
                14677
            ],
            [
                14677,
                14730
            ],
            [
                14730,
                14777
            ],
            [
                14794,
                14797
            ],
            [
                14797,
                14835
            ],
            [
                14835,
                14864
            ],
            [
                14864,
                14894
            ],
            [
                14897,
                14906
            ],
            [
                14919,
                14938
            ],
            [
                15063,
                15154
            ],
            [
                15278,
                15281
            ],
            [
                15335,
                15341
            ],
            [
                15288,
                15299
            ],
            [
                15343,
                15351
            ],
            [
                15353,
                15427
            ],
            [
                15427,
                15483
            ],
            [
                15495,
                15497
            ],
            [
                15497,
                15533
            ],
            [
                15577,
                15605
            ],
            [
                15636,
                15641
            ],
            [
                15647,
                15652
            ],
            [
                15678,
                15687
            ],
            [
                15561,
                15563
            ],
            [
                15694,
                15725
            ],
            [
                15751,
                15754
            ],
            [
                15731,
                15740
            ],
            [
                15795,
                15796
            ],
            [
                15945,
                16063
            ],
            [
                16063,
                16132
            ],
            [
                16143,
                16160
            ],
            [
                16168,
                16194
            ],
            [
                16203,
                16223
            ],
            [
                16223,
                16292
            ],
            [
                16309,
                16332
            ],
            [
                16435,
                16437
            ],
            [
                16437,
                16515
            ],
            [
                16550,
                16558
            ],
            [
                16588,
                16590
            ],
            [
                16590,
                16624
            ],
            [
                16630,
                16636
            ],
            [
                16677,
                16708
            ],
            [
                16778,
                16780
            ],
            [
                16780,
                16893
            ],
            [
                16893,
                16921
            ],
            [
                16921,
                16960
            ],
            [
                16960,
                17011
            ],
            [
                17027,
                17042
            ],
            [
                17042,
                17099
            ],
            [
                17162,
                17165
            ],
            [
                17165,
                17205
            ],
            [
                17205,
                17255
            ],
            [
                17267,
                17270
            ],
            [
                17282,
                17291
            ],
            [
                17300,
                17328
            ],
            [
                17328,
                17400
            ],
            [
                17407,
                17413
            ],
            [
                17401,
                17406
            ],
            [
                17414,
                17458
            ],
            [
                17458,
                17462
            ],
            [
                17478,
                17485
            ],
            [
                17463,
                17478
            ],
            [
                17486,
                17539
            ],
            [
                17539,
                17577
            ],
            [
                17577,
                17595
            ],
            [
                17595,
                17713
            ],
            [
                17713,
                17737
            ],
            [
                17751,
                17782
            ],
            [
                17802,
                17808
            ],
            [
                17808,
                17898
            ],
            [
                17925,
                17948
            ],
            [
                17950,
                17976
            ],
            [
                18071,
                18142
            ],
            [
                18156,
                18158
            ],
            [
                18158,
                18238
            ],
            [
                18261,
                18268
            ],
            [
                18274,
                18276
            ],
            [
                18290,
                18303
            ],
            [
                18303,
                18338
            ],
            [
                18369,
                18373
            ],
            [
                18353,
                18354
            ],
            [
                18415,
                18419
            ],
            [
                18430,
                18468
            ],
            [
                18475,
                18480
            ],
            [
                18344,
                18346
            ],
            [
                18538,
                18540
            ],
            [
                18540,
                18681
            ],
            [
                18702,
                18741
            ],
            [
                18741,
                18804
            ],
            [
                18839,
                18862
            ],
            [
                18862,
                18943
            ],
            [
                18998,
                18999
            ],
            [
                19497,
                19532
            ],
            [
                19532,
                19575
            ],
            [
                19589,
                19614
            ],
            [
                19614,
                19638
            ],
            [
                19666,
                19669
            ],
            [
                19644,
                19648
            ],
            [
                19659,
                19662
            ],
            [
                19649,
                19658
            ],
            [
                19694,
                19698
            ],
            [
                19705,
                19708
            ],
            [
                19708,
                19764
            ],
            [
                19774,
                19776
            ],
            [
                19776,
                19795
            ],
            [
                19812,
                19857
            ],
            [
                19857,
                19883
            ],
            [
                19883,
                19904
            ],
            [
                20159,
                20225
            ],
            [
                20225,
                20303
            ],
            [
                20303,
                20341
            ],
            [
                20372,
                20375
            ],
            [
                20375,
                20391
            ],
            [
                20408,
                20410
            ],
            [
                20496,
                20502
            ],
            [
                20509,
                20556
            ],
            [
                20556,
                20631
            ],
            [
                20631,
                20674
            ],
            [
                20674,
                20720
            ],
            [
                20720,
                20803
            ],
            [
                20803,
                20845
            ],
            [
                20858,
                20860
            ],
            [
                20860,
                20934
            ],
            [
                20934,
                20966
            ],
            [
                20968,
                21018
            ],
            [
                21018,
                21076
            ],
            [
                21076,
                21113
            ],
            [
                21113,
                21129
            ],
            [
                21237,
                21266
            ],
            [
                21276,
                21298
            ],
            [
                21309,
                21333
            ],
            [
                21333,
                21373
            ],
            [
                21384,
                21394
            ],
            [
                21414,
                21432
            ],
            [
                21443,
                21488
            ],
            [
                21494,
                21576
            ],
            [
                21576,
                21584
            ],
            [
                21592,
                21634
            ],
            [
                21650,
                21664
            ],
            [
                21770,
                21807
            ],
            [
                21812,
                21819
            ],
            [
                21853,
                21857
            ],
            [
                21843,
                21849
            ],
            [
                21865,
                21909
            ],
            [
                21922,
                21952
            ]
        ],
        "row_chars": [
            [
                0,
                143
            ],
            [
                143,
                291
            ],
            [
                291,
                355
            ],
            [
                355,
                410
            ],
            [
                410,
                439
            ],
            [
                439,
                520
            ],
            [
                520,
                641
            ],
            [
                641,
                741
            ],
            [
                741,
                936
            ],
            [
                936,
                1036
            ],
            [
                1036,
                1129
            ],
            [
                1129,
                1400
            ],
            [
                1400,
                1509
            ],
            [
                1509,
                1647
            ],
            [
                1647,
                1706
            ],
            [
                1706,
                1857
            ],
            [
                1857,
                2066
            ],
            [
                2066,
                2259
            ],
            [
                2259,
                2456
            ],
            [
                2456,
                2592
            ],
            [
                2592,
                2749
            ],
            [
                2749,
                2919
            ],
            [
                2919,
                2946
            ],
            [
                2946,
                3046
            ],
            [
                3046,
                3243
            ],
            [
                3243,
                3352
            ],
            [
                3352,
                3458
            ],
            [
                3458,
                3738
            ],
            [
                3738,
                3863
            ],
            [
                3863,
                3910
            ],
            [
                3910,
                3935
            ],
            [
                3935,
                3965
            ],
            [
                3965,
                4037
            ],
            [
                4037,
                4336
            ],
            [
                4336,
                4455
            ],
            [
                4455,
                4510
            ],
            [
                4510,
                4548
            ],
            [
                4548,
                4739
            ],
            [
                4739,
                4927
            ],
            [
                4927,
                4999
            ],
            [
                4999,
                5068
            ],
            [
                5068,
                5268
            ],
            [
                5268,
                5291
            ],
            [
                5291,
                5317
            ],
            [
                5317,
                5426
            ],
            [
                5426,
                5610
            ],
            [
                5610,
                5820
            ],
            [
                5820,
                5992
            ],
            [
                5992,
                6251
            ],
            [
                6251,
                6545
            ],
            [
                6545,
                6604
            ],
            [
                6604,
                6649
            ],
            [
                6649,
                6683
            ],
            [
                6683,
                6730
            ],
            [
                6730,
                6770
            ],
            [
                6770,
                6831
            ],
            [
                6831,
                6896
            ],
            [
                6896,
                7122
            ],
            [
                7122,
                7262
            ],
            [
                7262,
                7495
            ],
            [
                7495,
                7561
            ],
            [
                7561,
                7756
            ],
            [
                7756,
                7827
            ],
            [
                7827,
                7842
            ],
            [
                7842,
                7854
            ],
            [
                7854,
                7895
            ],
            [
                7895,
                8007
            ],
            [
                8007,
                8212
            ],
            [
                8212,
                8251
            ],
            [
                8251,
                8293
            ],
            [
                8293,
                8350
            ],
            [
                8350,
                8458
            ],
            [
                8458,
                8505
            ],
            [
                8505,
                8623
            ],
            [
                8623,
                8717
            ],
            [
                8717,
                8768
            ],
            [
                8768,
                8830
            ],
            [
                8830,
                8889
            ],
            [
                8889,
                8918
            ],
            [
                8918,
                9005
            ],
            [
                9005,
                9097
            ],
            [
                9097,
                9163
            ],
            [
                9163,
                9279
            ],
            [
                9279,
                9430
            ],
            [
                9430,
                9531
            ],
            [
                9531,
                9830
            ],
            [
                9830,
                9951
            ],
            [
                9951,
                10024
            ],
            [
                10024,
                10196
            ],
            [
                10196,
                10307
            ],
            [
                10307,
                10332
            ],
            [
                10332,
                10406
            ],
            [
                10406,
                10572
            ],
            [
                10572,
                10613
            ],
            [
                10613,
                10690
            ],
            [
                10690,
                10716
            ],
            [
                10716,
                10761
            ],
            [
                10761,
                10767
            ],
            [
                10767,
                10795
            ],
            [
                10795,
                10828
            ],
            [
                10828,
                10861
            ],
            [
                10861,
                10982
            ],
            [
                10982,
                11036
            ],
            [
                11036,
                11090
            ],
            [
                11090,
                11193
            ],
            [
                11193,
                11257
            ],
            [
                11257,
                11365
            ],
            [
                11365,
                11464
            ],
            [
                11464,
                11533
            ],
            [
                11533,
                11674
            ],
            [
                11674,
                11708
            ],
            [
                11708,
                11963
            ],
            [
                11963,
                12010
            ],
            [
                12010,
                12160
            ],
            [
                12160,
                12249
            ],
            [
                12249,
                12327
            ],
            [
                12327,
                12421
            ],
            [
                12421,
                12551
            ],
            [
                12551,
                12697
            ],
            [
                12697,
                12853
            ],
            [
                12853,
                12944
            ],
            [
                12944,
                13025
            ],
            [
                13025,
                13060
            ],
            [
                13060,
                13106
            ],
            [
                13106,
                13376
            ],
            [
                13376,
                13492
            ],
            [
                13492,
                13573
            ],
            [
                13573,
                13675
            ],
            [
                13675,
                13722
            ],
            [
                13722,
                13749
            ],
            [
                13749,
                13777
            ],
            [
                13777,
                13845
            ],
            [
                13845,
                13875
            ],
            [
                13875,
                13886
            ],
            [
                13886,
                13996
            ],
            [
                13996,
                14018
            ],
            [
                14018,
                14165
            ],
            [
                14165,
                14209
            ],
            [
                14209,
                14343
            ],
            [
                14343,
                14417
            ],
            [
                14417,
                14490
            ],
            [
                14490,
                14574
            ],
            [
                14574,
                14677
            ],
            [
                14677,
                14730
            ],
            [
                14730,
                14797
            ],
            [
                14797,
                14835
            ],
            [
                14835,
                14864
            ],
            [
                14864,
                14938
            ],
            [
                14938,
                15011
            ],
            [
                15011,
                15063
            ],
            [
                15063,
                15154
            ],
            [
                15154,
                15240
            ],
            [
                15240,
                15427
            ],
            [
                15427,
                15497
            ],
            [
                15497,
                15533
            ],
            [
                15533,
                15797
            ],
            [
                15797,
                15945
            ],
            [
                15945,
                16063
            ],
            [
                16063,
                16223
            ],
            [
                16223,
                16437
            ],
            [
                16437,
                16590
            ],
            [
                16590,
                16780
            ],
            [
                16780,
                16893
            ],
            [
                16893,
                16921
            ],
            [
                16921,
                16960
            ],
            [
                16960,
                17042
            ],
            [
                17042,
                17165
            ],
            [
                17165,
                17205
            ],
            [
                17205,
                17255
            ],
            [
                17255,
                17328
            ],
            [
                17328,
                17458
            ],
            [
                17458,
                17539
            ],
            [
                17539,
                17577
            ],
            [
                17577,
                17595
            ],
            [
                17595,
                17713
            ],
            [
                17713,
                17808
            ],
            [
                17808,
                17976
            ],
            [
                17976,
                18035
            ],
            [
                18035,
                18158
            ],
            [
                18158,
                18303
            ],
            [
                18303,
                18540
            ],
            [
                18540,
                18741
            ],
            [
                18741,
                18862
            ],
            [
                18862,
                19000
            ],
            [
                19000,
                19106
            ],
            [
                19106,
                19161
            ],
            [
                19161,
                19252
            ],
            [
                19252,
                19370
            ],
            [
                19370,
                19413
            ],
            [
                19413,
                19443
            ],
            [
                19443,
                19497
            ],
            [
                19497,
                19532
            ],
            [
                19532,
                19614
            ],
            [
                19614,
                19708
            ],
            [
                19708,
                19776
            ],
            [
                19776,
                19797
            ],
            [
                19797,
                19812
            ],
            [
                19812,
                19857
            ],
            [
                19857,
                19883
            ],
            [
                19883,
                19904
            ],
            [
                19904,
                19940
            ],
            [
                19940,
                20094
            ],
            [
                20094,
                20113
            ],
            [
                20113,
                20149
            ],
            [
                20149,
                20225
            ],
            [
                20225,
                20303
            ],
            [
                20303,
                20375
            ],
            [
                20375,
                20410
            ],
            [
                20410,
                20496
            ],
            [
                20496,
                20556
            ],
            [
                20556,
                20631
            ],
            [
                20631,
                20674
            ],
            [
                20674,
                20720
            ],
            [
                20720,
                20803
            ],
            [
                20803,
                20860
            ],
            [
                20860,
                20934
            ],
            [
                20934,
                21018
            ],
            [
                21018,
                21076
            ],
            [
                21076,
                21113
            ],
            [
                21113,
                21157
            ],
            [
                21157,
                21236
            ],
            [
                21236,
                21333
            ],
            [
                21333,
                21394
            ],
            [
                21394,
                21576
            ],
            [
                21576,
                21664
            ],
            [
                21664,
                21770
            ],
            [
                21770,
                21819
            ],
            [
                21819,
                21952
            ]
        ]
    },
    "abridged": {
        "text": "Kate Vavasor remained only three days in London before she started for Yarmouth.\n\"I'm my aunt's, body and soul, for the next six weeks,\" she told Alice when she visited. \"And she is exacting in a way I can't describe. You mustn't be surprised if I don't even write a line. I've escaped by stealth now. She went upstairs to try on some new clothes for the seaside, and I bolted.\" She did not say a word about George; nor did George show himself. He said afterwards that he had gone off to Scotland, and had remained a week among the grouse.\nIt will be as well to say a few words about Mrs. Greenow before we go with her to Yarmouth. Mrs. Greenow was the only daughter of the old squire at Vavasor Hall. She was ten years younger than her brother John, but looked younger still. In early life she lived with relatives in a town in the north of England. Although she had the reputation of being a beauty, at thirty-four she was still unmarried. She had, moreover, acquired the character of being a flirt; and I fear that there was some truth in this.\nNow this was very sad, seeing that Arabella Vavasor had no fortune, and that she had offended her father and brothers by declining to take their advice at various times. They were, indeed, quite troubled about her, when they heard the news that that she was going to be married to an old man.\nThe marriage fortunately turned out satisfactorily. The Vavasors were relieved from their trouble, and were as much surprised as gratified when they heard that she did her wifely duty well. Her husband was a retired merchant, very rich, not very well, and devoted to his bride. Rumours soon reached Vavasor Hall that Mrs. Greenow was a model wife, and that Mr. Greenow considered himself to be the happiest old man in Lancashire.\nOn one occasion she took her husband to Vavasor Hall; he was very old for his age, but the marriage was quite respectable, and there was, at any rate, no doubt about the money. Then Mr. Greenow died; and the widow came to London and claimed the commiseration of her nieces.\n\"Why not go to Yarmouth with her for a month?\" George had said to Kate. \"Of course it will be a bore. But an aunt with forty thousand pounds has a right to claim attention.\" The old squire had also written to her, telling her to go if asked. So Kate agreed to go to Yarmouth for a month.\nYarmouth is not a very prepossessing place. There is an old town which summer visitors do not venture into; and there are the new houses down by the sea-side. A kind of esplanade runs for nearly a mile along the sands, and there are rows of new houses for summer visitors, all looking out upon the sea. There is no beauty unless the yellow sandy sea can be called beautiful. The coast is low and straight, and the east wind blows full upon it. But the place is healthy.\n\"Omnibus; no, indeed. Jeannette, get me a hackney cab.\" These were the first words Mrs. Greenow spoke as she put her foot upon the platform at Yarmouth station. Her maid's name was Jenny; but Kate had found, somewhat to her dismay, that the girl was to be called Jeannette.\nMrs. Greenow's taste for masterdom had not shown itself so plainly in London as it did now. As a provincial person among Londoners, her spirit had been somewhat cowed. But outside London she was herself again; and at Ipswich she had ordered Jeannette to get her a glass of sherry with an air which had created a good deal of attention among the porters.\nThe cab was found; and all Mrs. Greenow's boxes, together with the more moderate belongings of her niece and maid, were stowed on the top of it, around the driver, on the maid's lap, and Kate's also, and upon the vacant seat.\n\"The large house in Montpelier Parade,\" said Mrs. Greenow.\n\"They is all large, ma'am,\" said the driver.\n\"The largest,\" said Mrs. Greenow. \"Mrs. Jones's. I was told it was the largest in the row.\"\n\"I know Mrs. Jones's,\" said the driver, and away they went.\nMrs. Jones's house was handsome and comfortable; but I fear Mrs. Greenow was disappointed to find that it was not perceptibly bigger than those on either side. This ambition would have amused Kate greatly had she been a bystander, and not her aunt's companion. Mrs. Greenow was good-natured and generous; but she desired that all the world should see that she had forty thousand pounds. She had no bashfulness about this. She called aloud for such comfort and grandeur as Yarmouth could give her, and was well pleased that all around should hear her calling. Joined to all this was her uncontrolled grief for her husband's death.\n\"Dear Greenow! sweet lamb! Oh, Kate, if you'd only known that man!\" When she said this she was sitting in the best of Mrs. Jones's sitting-rooms, before dinner. \"Oh, Kate, I do wish you'd known him!\"\n\"I wish I had,\" said Kate, untruthfully. \"I was away when he came to Vavasor Hall.\"\n\"Ah, yes; but it was at home that Greenow had to be seen to be appreciated. I was a happy woman, Kate.\" And Kate was surprised to see that real tears were making their way down her aunt's cheeks. But they were soon checked with a handkerchief of the finest cambric.\n\"Dinner, ma'am,\" said Jeannette, opening the door.\n\"Jeannette, I told you always to say that dinner was served.\"\n\"Dinner's served then,\" said Jeannette angrily.\n\"Come, Kate,\" said her aunt. \"I've little appetite myself, but there's no reason you shouldn't eat your dinner. I do hope Mrs. Jones has got a decent cook.\"\nThe next day was Sunday; and it was beautiful to see how Mrs. Greenow went to church in all the glory of widowhood. There had been a great unpacking after dinner, and all her funereal outfits had been displayed before Kate's wondering eyes. Mrs. Greenow had pointed out the richness of each garment, the fineness of the fabric, the breadth of the frills - telling the price of each to a shilling, while she explained how expense had been of no consideration. This she did with all the pride of a young bride showing off her trousseau. Now and again, Mrs. Greenow would pause and address the shade of the departed one with affectionate words. In the midst of this Mrs. Jones came in; but the widow was not at all abashed by her presence.\n\"He left her uncommon well off, I suppose,\" said Mrs. Jones to Jeannette afterwards.\n\"You may say that, ma'am. It's more nor a hundred thousand of pounds!\"\n\"No!\"\n\"Indeed it is.\"\n\"Why don't she have a carriage?\"\n\"She do; but a lady can't bring her carriage down to the sea when she's only just buried her husband. What'd folks say? But it ain't because she can't afford it, Mrs. Jones. And now we're talking of it you must order a cab for church tomorrow. She said I was to get a man that had a livery coat and gloves.\"\nThe man with the coat and gloves was procured; and Mrs. Greenow's entry into church made quite a sensation. She walked up the middle aisle as though the chancel had belonged to her family for years; and the respectable pew-opener deserted two or three old ladies to show Mrs. Greenow into her seat. All eyes were on her.\nI regret to say that this continued throughout the whole service. Every person in that church looked at Mrs. Greenow. There was a general conviction that something remarkable had happened that morning. Even the minister, while preaching his sermon, could not keep his eyes off that wonderful bonnet and veil.\nNext morning Mrs. Greenow's name was put down at the Assembly Room. \"I need hardly say that in my present condition I care nothing for these things. But, my dear Kate, I know what I owe to you.\"\nKate, with less intelligence than might have been expected from one so clever, began to assure her aunt that she needed no society, and was expecting a quiet time. But Mrs. Greenow soon corrected her, without any sign of annoyance.\n\"My dear,\" she said, \" you must let me do what I know to be right. I should be very selfish if I allowed my grief to interfere with your amusements.\"\n\"But, aunt, I don't care for such amusements.\"\n\"That's nonsense, my dear. You ought to care for them. How are you to settle yourself in life if you don't care for them?\"\n\"My dear aunt, I am settled.\"\n\"Settled!\" said Mrs. Greenow, astounded, as though there must have been some hidden marriage of which she had not heard. \"But that's nonsense. Of course you're not settled; and how are you to be, if I allow you to shut yourself up?\"\nIt was in vain that Kate tried to stop her.\n\"No, my dear; I shall do my duty by you. Although my heart is desolate, I'm not going to immolate you on the altars of my grief. I shall force myself to go out for your sake, Kate.\"\n\"But, dear aunt, the world will think it so odd.\"\n\"I don't care twopence for the world. What can the world do to me? I'm not dependent on the world - thanks to that sainted lamb. No, Kate; I mean to make the place pleasant for you if I can, and the world may object if it likes.\"\nThe people of Yarmouth no doubt did remind each other that old Greenow was hardly yet four months buried. Mrs. Jones and Jeannette probably had their little jokes downstairs. But this did not hurt Mrs. Greenow. Mrs. Jones's bills were paid punctually; and everybody in the house treated the lady with due deference.\nNumerous people came to call at Montpelier Parade, and Kate was astonished to find that her aunt had so many friends. She was indeed so bewildered by these strangers that she could hardly work out whom her aunt had known before, and whom she met for the first time. Somebody had known somebody who had known somebody else, and that was sufficient introduction. Mrs. Greenow could smile from beneath her widow's cap in a most bewitching way, and look most handsome. But she could also frown, and knew how to quell any attempt at familiarity from unsuitable people.\n\"My dear aunt,\" said Kate one morning after their walk upon the pier, \"how you did snub that Captain Bellfield!\"\n\"Captain Bellfield, indeed! I don't believe he's a captain at all. At any rate he has sold out, and the tradesmen have scrambled for the money. He was only a lieutenant when the 97th were in Manchester.\"\n\"But everybody here seems to know him.\"\n\"Perhaps they do not know so much of him as I do. His impudence in telling me I was looking very well! Nothing can be so mean as men who go about in that way when they haven't enough money in their pockets to pay their washerwomen.\"\n\"But, aunt, how do you know that Captain Bellfield hasn't paid his washerwoman?\"\n\"I know more than you think, my dear. It's my business. How could I tell whose attentions you should receive and whose you shouldn't, if I didn't inquire into these things?\"\nIt was in vain that Kate attempted to rebel against this care. She told her aunt that she was now nearly thirty, and that she had managed her own affairs for the last ten years; but it was to no purpose. Mrs. Greenow would push aside all that her niece said as though it were unimportant. Kate was an unmarried woman with a very small fortune, and therefore, of course, wished to get married as soon as possible. It was natural that she should deny this, although when she came to know her aunt more intimately, she might admit it. But Mrs. Greenow would spare neither herself nor her purse on Kate's behalf, and she would be a dragon of watchfulness in protecting her from such useless men as Captain Bellfield.\n\"I declare, Kate, I don't understand you,\" she said one morning over a late breakfast. They had fallen into luxurious habits, and I am afraid it was past eleven o'clock.\n\"What don't you understand, aunt?\"\n\"You only danced twice last night, and once with Captain Bellfield.\"\n\"On purpose to ask after his poor washerwoman who doesn't get paid.\"\n\"Nonsense, Kate; you didn't ask him anything of the kind. It's very provoking.\"\n\"But what harm can Captain Bellfield do me?\"\n\"What good can he do you? That's the question. I don't think I ever saw a young woman so improvident as you are. When are you to begin to think about getting married if you don't do it now?\"\n\"I shall never begin to think about it.\"\n\"That's nonsense. Didn't Mr. Cheesacre ask you for a dance last night?\"\n\"Yes, he did; while you were talking to Captain Bellfield yourself, aunt.\"\n\"Captain Bellfield can't hurt me, my dear. And why didn't you dance with Mr. Cheesacre?\"\n\"He's a fat Norfolk farmer, with not an idea beyond the virtues of stall-feeding.\"\n\"My dear, every acre of it is his own land! And he bought another farm for thirteen thousand pounds only last autumn. They're better than the squires, some of those gentlemen farmers; they are indeed. And of all men in the world they're the easiest managed.\"\n\"That's a recommendation, no doubt.\"\n\"Of course it is. He's to take us to the picnic tomorrow, and I do hope you'll let him sit beside you. It'll be the place of honour, because he provides the wine. That man Bellfield is to be there; but if you allow your name to be mixed up with his, it will be all over with you as far as Yarmouth is concerned.\"\n\"I don't want to be mixed up with Captain Bellfield,\" said Kate. In truth, the aunt did not understand her niece. Whatever Kate's faults were, an unmaidenly desire of catching a husband was certainly not one of them.",
        "paragraph_chars": [
            [
                0,
                81
            ],
            [
                81,
                540
            ],
            [
                540,
                1048
            ],
            [
                1048,
                1341
            ],
            [
                1341,
                1771
            ],
            [
                1771,
                2045
            ],
            [
                2045,
                2333
            ],
            [
                2333,
                2803
            ],
            [
                2803,
                3077
            ],
            [
                3077,
                3431
            ],
            [
                3431,
                3657
            ],
            [
                3657,
                3716
            ],
            [
                3716,
                3761
            ],
            [
                3761,
                3853
            ],
            [
                3853,
                3913
            ],
            [
                3913,
                4543
            ],
            [
                4543,
                4743
            ],
            [
                4743,
                4827
            ],
            [
                4827,
                5093
            ],
            [
                5093,
                5144
            ],
            [
                5144,
                5206
            ],
            [
                5206,
                5254
            ],
            [
                5254,
                5411
            ],
            [
                5411,
                6148
            ],
            [
                6148,
                6233
            ],
            [
                6233,
                6304
            ],
            [
                6304,
                6310
            ],
            [
                6310,
                6326
            ],
            [
                6326,
                6359
            ],
            [
                6359,
                6667
            ],
            [
                6667,
                6988
            ],
            [
                6988,
                7297
            ],
            [
                7297,
                7492
            ],
            [
                7492,
                7724
            ],
            [
                7724,
                7874
            ],
            [
                7874,
                7921
            ],
            [
                7921,
                8044
            ],
            [
                8044,
                8074
            ],
            [
                8074,
                8307
            ],
            [
                8307,
                8351
            ],
            [
                8351,
                8533
            ],
            [
                8533,
                8583
            ],
            [
                8583,
                8813
            ],
            [
                8813,
                9129
            ],
            [
                9129,
                9693
            ],
            [
                9693,
                9806
            ],
            [
                9806,
                10010
            ],
            [
                10010,
                10050
            ],
            [
                10050,
                10283
            ],
            [
                10283,
                10364
            ],
            [
                10364,
                10538
            ],
            [
                10538,
                11251
            ],
            [
                11251,
                11421
            ],
            [
                11421,
                11456
            ],
            [
                11456,
                11525
            ],
            [
                11525,
                11594
            ],
            [
                11594,
                11674
            ],
            [
                11674,
                11719
            ],
            [
                11719,
                11910
            ],
            [
                11910,
                11951
            ],
            [
                11951,
                12023
            ],
            [
                12023,
                12098
            ],
            [
                12098,
                12187
            ],
            [
                12187,
                12270
            ],
            [
                12270,
                12529
            ],
            [
                12529,
                12566
            ],
            [
                12566,
                12879
            ],
            [
                12879,
                13095
            ]
        ],
        "segment_chars": [
            [
                0,
                81
            ],
            [
                81,
                170
            ],
            [
                170,
                218
            ],
            [
                218,
                273
            ],
            [
                273,
                302
            ],
            [
                302,
                379
            ],
            [
                379,
                445
            ],
            [
                445,
                540
            ],
            [
                540,
                632
            ],
            [
                632,
                702
            ],
            [
                702,
                777
            ],
            [
                777,
                851
            ],
            [
                851,
                942
            ],
            [
                942,
                1048
            ],
            [
                1048,
                1218
            ],
            [
                1218,
                1341
            ],
            [
                1341,
                1393
            ],
            [
                1393,
                1531
            ],
            [
                1531,
                1619
            ],
            [
                1619,
                1771
            ],
            [
                1771,
                1948
            ],
            [
                1948,
                2045
            ],
            [
                2045,
                2092
            ],
            [
                2092,
                2117
            ],
            [
                2117,
                2147
            ],
            [
                2147,
                2219
            ],
            [
                2219,
                2287
            ],
            [
                2287,
                2333
            ],
            [
                2333,
                2377
            ],
            [
                2377,
                2492
            ],
            [
                2492,
                2636
            ],
            [
                2636,
                2708
            ],
            [
                2708,
                2777
            ],
            [
                2777,
                2803
            ],
            [
                2803,
                2825
            ],
            [
                2825,
                2859
            ],
            [
                2859,
                2964
            ],
            [
                2964,
                3077
            ],
            [
                3077,
                3169
            ],
            [
                3169,
                3245
            ],
            [
                3245,
                3431
            ],
            [
                3431,
                3657
            ],
            [
                3657,
                3716
            ],
            [
                3716,
                3761
            ],
            [
                3761,
                3795
            ],
            [
                3795,
                3810
            ],
            [
                3810,
                3853
            ],
            [
                3853,
                3913
            ],
            [
                3913,
                4073
            ],
            [
                4073,
                4174
            ],
            [
                4174,
                4300
            ],
            [
                4300,
                4335
            ],
            [
                4335,
                4472
            ],
            [
                4472,
                4543
            ],
            [
                4543,
                4558
            ],
            [
                4558,
                4570
            ],
            [
                4570,
                4611
            ],
            [
                4611,
                4704
            ],
            [
                4704,
                4743
            ],
            [
                4743,
                4784
            ],
            [
                4784,
                4827
            ],
            [
                4827,
                4903
            ],
            [
                4903,
                4931
            ],
            [
                4931,
                5023
            ],
            [
                5023,
                5093
            ],
            [
                5093,
                5144
            ],
            [
                5144,
                5206
            ],
            [
                5206,
                5254
            ],
            [
                5254,
                5283
            ],
            [
                5283,
                5366
            ],
            [
                5366,
                5411
            ],
            [
                5411,
                5527
            ],
            [
                5527,
                5652
            ],
            [
                5652,
                5870
            ],
            [
                5870,
                5946
            ],
            [
                5946,
                6053
            ],
            [
                6053,
                6148
            ],
            [
                6148,
                6233
            ],
            [
                6233,
                6259
            ],
            [
                6259,
                6304
            ],
            [
                6304,
                6310
            ],
            [
                6310,
                6326
            ],
            [
                6326,
                6359
            ],
            [
                6359,
                6461
            ],
            [
                6461,
                6479
            ],
            [
                6479,
                6533
            ],
            [
                6533,
                6603
            ],
            [
                6603,
                6667
            ],
            [
                6667,
                6775
            ],
            [
                6775,
                6966
            ],
            [
                6966,
                6988
            ],
            [
                6988,
                7054
            ],
            [
                7054,
                7106
            ],
            [
                7106,
                7190
            ],
            [
                7190,
                7297
            ],
            [
                7297,
                7365
            ],
            [
                7365,
                7446
            ],
            [
                7446,
                7492
            ],
            [
                7492,
                7656
            ],
            [
                7656,
                7724
            ],
            [
                7724,
                7791
            ],
            [
                7791,
                7874
            ],
            [
                7874,
                7921
            ],
            [
                7921,
                7948
            ],
            [
                7948,
                7976
            ],
            [
                7976,
                8044
            ],
            [
                8044,
                8074
            ],
            [
                8074,
                8085
            ],
            [
                8085,
                8195
            ],
            [
                8195,
                8217
            ],
            [
                8217,
                8307
            ],
            [
                8307,
                8351
            ],
            [
                8351,
                8392
            ],
            [
                8392,
                8480
            ],
            [
                8480,
                8533
            ],
            [
                8533,
                8583
            ],
            [
                8583,
                8621
            ],
            [
                8621,
                8650
            ],
            [
                8650,
                8712
            ],
            [
                8712,
                8813
            ],
            [
                8813,
                8919
            ],
            [
                8919,
                8988
            ],
            [
                8988,
                9024
            ],
            [
                9024,
                9129
            ],
            [
                9129,
                9247
            ],
            [
                9247,
                9395
            ],
            [
                9395,
                9490
            ],
            [
                9490,
                9594
            ],
            [
                9594,
                9693
            ],
            [
                9693,
                9806
            ],
            [
                9806,
                9834
            ],
            [
                9834,
                9873
            ],
            [
                9873,
                9950
            ],
            [
                9950,
                10010
            ],
            [
                10010,
                10050
            ],
            [
                10050,
                10100
            ],
            [
                10100,
                10153
            ],
            [
                10153,
                10283
            ],
            [
                10283,
                10364
            ],
            [
                10364,
                10402
            ],
            [
                10402,
                10420
            ],
            [
                10420,
                10538
            ],
            [
                10538,
                10601
            ],
            [
                10601,
                10742
            ],
            [
                10742,
                10827
            ],
            [
                10827,
                10951
            ],
            [
                10951,
                11070
            ],
            [
                11070,
                11251
            ],
            [
                11251,
                11338
            ],
            [
                11338,
                11421
            ],
            [
                11421,
                11456
            ],
            [
                11456,
                11525
            ],
            [
                11525,
                11594
            ],
            [
                11594,
                11652
            ],
            [
                11652,
                11674
            ],
            [
                11674,
                11719
            ],
            [
                11719,
                11745
            ],
            [
                11745,
                11766
            ],
            [
                11766,
                11832
            ],
            [
                11832,
                11910
            ],
            [
                11910,
                11951
            ],
            [
                11951,
                11969
            ],
            [
                11969,
                12023
            ],
            [
                12023,
                12098
            ],
            [
                12098,
                12141
            ],
            [
                12141,
                12187
            ],
            [
                12187,
                12270
            ],
            [
                12270,
                12314
            ],
            [
                12314,
                12388
            ],
            [
                12388,
                12471
            ],
            [
                12471,
                12529
            ],
            [
                12529,
                12566
            ],
            [
                12566,
                12584
            ],
            [
                12584,
                12669
            ],
            [
                12669,
                12729
            ],
            [
                12729,
                12879
            ],
            [
                12879,
                12944
            ],
            [
                12944,
                12993
            ],
            [
                12993,
                13095
            ]
        ],
        "overlap_chars": [
            [
                0,
                79
            ],
            [
                79,
                80
            ],
            [
                81,
                140
            ],
            [
                146,
                151
            ],
            [
                152,
                160
            ],
            [
                168,
                170
            ],
            [
                170,
                181
            ],
            [
                191,
                195
            ],
            [
                200,
                207
            ],
            [
                216,
                218
            ],
            [
                218,
                273
            ],
            [
                273,
                302
            ],
            [
                302,
                310
            ],
            [
                320,
                338
            ],
            [
                347,
                367
            ],
            [
                368,
                379
            ],
            [
                379,
                419
            ],
            [
                420,
                445
            ],
            [
                453,
                463
            ],
            [
                469,
                539
            ],
            [
                540,
                547
            ],
            [
                548,
                632
            ],
            [
                632,
                666
            ],
            [
                667,
                702
            ],
            [
                702,
                709
            ],
            [
                710,
                750
            ],
            [
                775,
                777
            ],
            [
                777,
                794
            ],
            [
                795,
                818
            ],
            [
                826,
                851
            ],
            [
                860,
                867
            ],
            [
                868,
                871
            ],
            [
                883,
                901
            ],
            [
                902,
                942
            ],
            [
                942,
                1017
            ],
            [
                1033,
                1038
            ],
            [
                1039,
                1041
            ],
            [
                1046,
                1047
            ],
            [
                1048,
                1181
            ],
            [
                1187,
                1202
            ],
            [
                1216,
                1218
            ],
            [
                1227,
                1236
            ],
            [
                1261,
                1267
            ],
            [
                1279,
                1282
            ],
            [
                1293,
                1341
            ],
            [
                1341,
                1391
            ],
            [
                1391,
                1393
            ],
            [
                1393,
                1424
            ],
            [
                1431,
                1512
            ],
            [
                1520,
                1529
            ],
            [
                1529,
                1531
            ],
            [
                1531,
                1586
            ],
            [
                1591,
                1619
            ],
            [
                1619,
                1631
            ],
            [
                1640,
                1652
            ],
            [
                1653,
                1674
            ],
            [
                1675,
                1676
            ],
            [
                1683,
                1770
            ],
            [
                1771,
                1823
            ],
            [
                1823,
                1824
            ],
            [
                1828,
                1852
            ],
            [
                1852,
                1853
            ],
            [
                1854,
                1861
            ],
            [
                1871,
                1948
            ],
            [
                1948,
                1984
            ],
            [
                1985,
                1989
            ],
            [
                1990,
                2045
            ],
            [
                2045,
                2092
            ],
            [
                2092,
                2117
            ],
            [
                2117,
                2147
            ],
            [
                2147,
                2219
            ],
            [
                2219,
                2237
            ],
            [
                2243,
                2250
            ],
            [
                2251,
                2253
            ],
            [
                2254,
                2257
            ],
            [
                2267,
                2270
            ],
            [
                2274,
                2276
            ],
            [
                2277,
                2279
            ],
            [
                2285,
                2286
            ],
            [
                2290,
                2294
            ],
            [
                2295,
                2332
            ],
            [
                2333,
                2375
            ],
            [
                2375,
                2377
            ],
            [
                2377,
                2397
            ],
            [
                2398,
                2419
            ],
            [
                2420,
                2422
            ],
            [
                2439,
                2490
            ],
            [
                2490,
                2492
            ],
            [
                2492,
                2565
            ],
            [
                2566,
                2573
            ],
            [
                2578,
                2584
            ],
            [
                2589,
                2604
            ],
            [
                2604,
                2605
            ],
            [
                2606,
                2636
            ],
            [
                2636,
                2708
            ],
            [
                2708,
                2777
            ],
            [
                2777,
                2801
            ],
            [
                2801,
                2803
            ],
            [
                2803,
                2812
            ],
            [
                2813,
                2825
            ],
            [
                2825,
                2844
            ],
            [
                2856,
                2859
            ],
            [
                2859,
                2945
            ],
            [
                2946,
                2964
            ],
            [
                2964,
                3003
            ],
            [
                3004,
                3039
            ],
            [
                3040,
                3052
            ],
            [
                3053,
                3076
            ],
            [
                3092,
                3163
            ],
            [
                3167,
                3169
            ],
            [
                3174,
                3184
            ],
            [
                3192,
                3208
            ],
            [
                3209,
                3219
            ],
            [
                3220,
                3243
            ],
            [
                3243,
                3245
            ],
            [
                3245,
                3248
            ],
            [
                3264,
                3421
            ],
            [
                3422,
                3431
            ],
            [
                3431,
                3434
            ],
            [
                3439,
                3442
            ],
            [
                3448,
                3453
            ],
            [
                3454,
                3575
            ],
            [
                3583,
                3593
            ],
            [
                3593,
                3617
            ],
            [
                3618,
                3657
            ],
            [
                3657,
                3716
            ],
            [
                3716,
                3761
            ],
            [
                3761,
                3794
            ],
            [
                3795,
                3796
            ],
            [
                3796,
                3808
            ],
            [
                3808,
                3810
            ],
            [
                3810,
                3815
            ],
            [
                3816,
                3853
            ],
            [
                3853,
                3873
            ],
            [
                3873,
                3913
            ],
            [
                3913,
                3985
            ],
            [
                3986,
                3989
            ],
            [
                4003,
                4005
            ],
            [
                4011,
                4056
            ],
            [
                4071,
                4073
            ],
            [
                4073,
                4077
            ],
            [
                4078,
                4086
            ],
            [
                4087,
                4151
            ],
            [
                4152,
                4162
            ],
            [
                4172,
                4174
            ],
            [
                4174,
                4203
            ],
            [
                4204,
                4207
            ],
            [
                4216,
                4225
            ],
            [
                4226,
                4298
            ],
            [
                4298,
                4300
            ],
            [
                4300,
                4303
            ],
            [
                4311,
                4322
            ],
            [
                4333,
                4334
            ],
            [
                4335,
                4399
            ],
            [
                4405,
                4472
            ],
            [
                4472,
                4543
            ],
            [
                4543,
                4558
            ],
            [
                4558,
                4570
            ],
            [
                4570,
                4611
            ],
            [
                4611,
                4688
            ],
            [
                4696,
                4702
            ],
            [
                4702,
                4704
            ],
            [
                4704,
                4743
            ],
            [
                4743,
                4769
            ],
            [
                4770,
                4773
            ],
            [
                4782,
                4784
            ],
            [
                4784,
                4790
            ],
            [
                4791,
                4803
            ],
            [
                4809,
                4827
            ],
            [
                4827,
                4855
            ],
            [
                4856,
                4868
            ],
            [
                4879,
                4903
            ],
            [
                4903,
                4928
            ],
            [
                4928,
                4931
            ],
            [
                4931,
                4976
            ],
            [
                4977,
                5023
            ],
            [
                5023,
                5076
            ],
            [
                5077,
                5093
            ],
            [
                5093,
                5144
            ],
            [
                5144,
                5206
            ],
            [
                5206,
                5244
            ],
            [
                5252,
                5254
            ],
            [
                5254,
                5283
            ],
            [
                5283,
                5288
            ],
            [
                5289,
                5366
            ],
            [
                5366,
                5375
            ],
            [
                5376,
                5386
            ],
            [
                5391,
                5408
            ],
            [
                5411,
                5527
            ],
            [
                5527,
                5565
            ],
            [
                5572,
                5594
            ],
            [
                5603,
                5652
            ],
            [
                5681,
                5701
            ],
            [
                5709,
                5730
            ],
            [
                5737,
                5764
            ],
            [
                5767,
                5831
            ],
            [
                5832,
                5839
            ],
            [
                5840,
                5848
            ],
            [
                5849,
                5851
            ],
            [
                5855,
                5868
            ],
            [
                5868,
                5870
            ],
            [
                5870,
                5918
            ],
            [
                5931,
                5944
            ],
            [
                5944,
                5946
            ],
            [
                5946,
                5959
            ],
            [
                5959,
                5979
            ],
            [
                5986,
                6027
            ],
            [
                6033,
                6042
            ],
            [
                6051,
                6053
            ],
            [
                6053,
                6115
            ],
            [
                6123,
                6133
            ],
            [
                6138,
                6146
            ],
            [
                6146,
                6147
            ],
            [
                6148,
                6151
            ],
            [
                6152,
                6220
            ],
            [
                6231,
                6233
            ],
            [
                6233,
                6259
            ],
            [
                6259,
                6304
            ],
            [
                6304,
                6310
            ],
            [
                6311,
                6323
            ],
            [
                6323,
                6326
            ],
            [
                6326,
                6359
            ],
            [
                6359,
                6360
            ],
            [
                6360,
                6367
            ],
            [
                6368,
                6459
            ],
            [
                6459,
                6461
            ],
            [
                6461,
                6477
            ],
            [
                6477,
                6479
            ],
            [
                6479,
                6533
            ],
            [
                6533,
                6577
            ],
            [
                6582,
                6592
            ],
            [
                6601,
                6603
            ],
            [
                6603,
                6667
            ],
            [
                6667,
                6775
            ],
            [
                6775,
                6805
            ],
            [
                6806,
                6896
            ],
            [
                6897,
                6929
            ],
            [
                6930,
                6966
            ],
            [
                6966,
                6974
            ],
            [
                6986,
                6987
            ],
            [
                6988,
                7013
            ],
            [
                7014,
                7023
            ],
            [
                7024,
                7054
            ],
            [
                7054,
                7081
            ],
            [
                7082,
                7106
            ],
            [
                7106,
                7111
            ],
            [
                7116,
                7125
            ],
            [
                7126,
                7151
            ],
            [
                7163,
                7190
            ],
            [
                7190,
                7194
            ],
            [
                7195,
                7198
            ],
            [
                7207,
                7297
            ],
            [
                7297,
                7309
            ],
            [
                7310,
                7365
            ],
            [
                7365,
                7446
            ],
            [
                7446,
                7492
            ],
            [
                7492,
                7604
            ],
            [
                7612,
                7622
            ],
            [
                7622,
                7623
            ],
            [
                7624,
                7627
            ],
            [
                7654,
                7656
            ],
            [
                7656,
                7677
            ],
            [
                7688,
                7691
            ],
            [
                7691,
                7692
            ],
            [
                7693,
                7700
            ],
            [
                7710,
                7712
            ],
            [
                7713,
                7722
            ],
            [
                7722,
                7723
            ],
            [
                7724,
                7746
            ],
            [
                7747,
                7791
            ],
            [
                7791,
                7799
            ],
            [
                7800,
                7874
            ],
            [
                7874,
                7921
            ],
            [
                7921,
                7948
            ],
            [
                7948,
                7976
            ],
            [
                7976,
                8044
            ],
            [
                8044,
                8074
            ],
            [
                8074,
                8085
            ],
            [
                8085,
                8195
            ],
            [
                8195,
                8217
            ],
            [
                8217,
                8304
            ],
            [
                8304,
                8307
            ],
            [
                8307,
                8350
            ],
            [
                8351,
                8366
            ],
            [
                8367,
                8383
            ],
            [
                8387,
                8390
            ],
            [
                8390,
                8392
            ],
            [
                8401,
                8422
            ],
            [
                8423,
                8480
            ],
            [
                8480,
                8533
            ],
            [
                8533,
                8580
            ],
            [
                8580,
                8583
            ],
            [
                8583,
                8621
            ],
            [
                8621,
                8650
            ],
            [
                8650,
                8680
            ],
            [
                8683,
                8692
            ],
            [
                8693,
                8712
            ],
            [
                8722,
                8813
            ],
            [
                8813,
                8816
            ],
            [
                8817,
                8823
            ],
            [
                8824,
                8835
            ],
            [
                8836,
                8844
            ],
            [
                8845,
                8919
            ],
            [
                8919,
                8975
            ],
            [
                8986,
                8988
            ],
            [
                8988,
                9024
            ],
            [
                9024,
                9052
            ],
            [
                9053,
                9058
            ],
            [
                9063,
                9068
            ],
            [
                9069,
                9078
            ],
            [
                9079,
                9081
            ],
            [
                9082,
                9113
            ],
            [
                9114,
                9117
            ],
            [
                9118,
                9127
            ],
            [
                9127,
                9128
            ],
            [
                9129,
                9247
            ],
            [
                9247,
                9316
            ],
            [
                9326,
                9343
            ],
            [
                9344,
                9370
            ],
            [
                9375,
                9395
            ],
            [
                9395,
                9464
            ],
            [
                9465,
                9488
            ],
            [
                9488,
                9490
            ],
            [
                9490,
                9568
            ],
            [
                9584,
                9592
            ],
            [
                9592,
                9594
            ],
            [
                9594,
                9628
            ],
            [
                9629,
                9635
            ],
            [
                9642,
                9673
            ],
            [
                9691,
                9693
            ],
            [
                9693,
                9806
            ],
            [
                9806,
                9834
            ],
            [
                9834,
                9873
            ],
            [
                9873,
                9924
            ],
            [
                9935,
                9950
            ],
            [
                9950,
                10007
            ],
            [
                10007,
                10010
            ],
            [
                10010,
                10050
            ],
            [
                10050,
                10100
            ],
            [
                10100,
                10103
            ],
            [
                10104,
                10113
            ],
            [
                10125,
                10153
            ],
            [
                10153,
                10225
            ],
            [
                10226,
                10232
            ],
            [
                10233,
                10238
            ],
            [
                10239,
                10283
            ],
            [
                10283,
                10287
            ],
            [
                10287,
                10294
            ],
            [
                10295,
                10310
            ],
            [
                10311,
                10364
            ],
            [
                10364,
                10402
            ],
            [
                10402,
                10420
            ],
            [
                10420,
                10538
            ],
            [
                10538,
                10562
            ],
            [
                10563,
                10594
            ],
            [
                10595,
                10601
            ],
            [
                10601,
                10691
            ],
            [
                10692,
                10715
            ],
            [
                10716,
                10742
            ],
            [
                10742,
                10813
            ],
            [
                10825,
                10827
            ],
            [
                10827,
                10907
            ],
            [
                10922,
                10929
            ],
            [
                10930,
                10932
            ],
            [
                10938,
                10951
            ],
            [
                10951,
                10986
            ],
            [
                10987,
                10991
            ],
            [
                10991,
                10992
            ],
            [
                11002,
                11006
            ],
            [
                11011,
                11049
            ],
            [
                11054,
                11059
            ],
            [
                11066,
                11068
            ],
            [
                11068,
                11070
            ],
            [
                11070,
                11211
            ],
            [
                11212,
                11251
            ],
            [
                11251,
                11314
            ],
            [
                11315,
                11338
            ],
            [
                11338,
                11419
            ],
            [
                11419,
                11420
            ],
            [
                11421,
                11456
            ],
            [
                11456,
                11499
            ],
            [
                11500,
                11525
            ],
            [
                11525,
                11549
            ],
            [
                11550,
                11553
            ],
            [
                11554,
                11558
            ],
            [
                11559,
                11562
            ],
            [
                11565,
                11574
            ],
            [
                11587,
                11591
            ],
            [
                11591,
                11594
            ],
            [
                11594,
                11650
            ],
            [
                11650,
                11652
            ],
            [
                11652,
                11671
            ],
            [
                11674,
                11719
            ],
            [
                11719,
                11745
            ],
            [
                11745,
                11766
            ],
            [
                11766,
                11832
            ],
            [
                11832,
                11910
            ],
            [
                11910,
                11948
            ],
            [
                11948,
                11951
            ],
            [
                11951,
                11967
            ],
            [
                11967,
                11969
            ],
            [
                11969,
                11975
            ],
            [
                11976,
                12023
            ],
            [
                12023,
                12098
            ],
            [
                12098,
                12141
            ],
            [
                12141,
                12187
            ],
            [
                12187,
                12270
            ],
            [
                12270,
                12312
            ],
            [
                12312,
                12314
            ],
            [
                12314,
                12388
            ],
            [
                12388,
                12420
            ],
            [
                12421,
                12471
            ],
            [
                12471,
                12529
            ],
            [
                12529,
                12566
            ],
            [
                12566,
                12582
            ],
            [
                12584,
                12613
            ],
            [
                12622,
                12644
            ],
            [
                12645,
                12669
            ],
            [
                12669,
                12709
            ],
            [
                12719,
                12729
            ],
            [
                12729,
                12747
            ],
            [
                12751,
                12796
            ],
            [
                12797,
                12879
            ],
            [
                12879,
                12887
            ],
            [
                12888,
                12930
            ],
            [
                12930,
                12944
            ],
            [
                12944,
                12981
            ],
            [
                12986,
                12993
            ],
            [
                13002,
                13006
            ],
            [
                13009,
                13015
            ],
            [
                13020,
                13064
            ],
            [
                13065,
                13095
            ]
        ],
        "row_chars": [
            [
                0,
                81
            ],
            [
                81,
                170
            ],
            [
                170,
                218
            ],
            [
                218,
                273
            ],
            [
                273,
                302
            ],
            [
                302,
                379
            ],
            [
                379,
                445
            ],
            [
                445,
                540
            ],
            [
                540,
                540
            ],
            [
                540,
                632
            ],
            [
                632,
                702
            ],
            [
                702,
                777
            ],
            [
                777,
                777
            ],
            [
                777,
                851
            ],
            [
                851,
                851
            ],
            [
                851,
                942
            ],
            [
                942,
                1048
            ],
            [
                1048,
                1218
            ],
            [
                1218,
                1341
            ],
            [
                1341,
                1393
            ],
            [
                1393,
                1531
            ],
            [
                1531,
                1531
            ],
            [
                1531,
                1531
            ],
            [
                1531,
                1619
            ],
            [
                1619,
                1771
            ],
            [
                1771,
                1771
            ],
            [
                1771,
                1771
            ],
            [
                1771,
                1948
            ],
            [
                1948,
                2045
            ],
            [
                2045,
                2092
            ],
            [
                2092,
                2117
            ],
            [
                2117,
                2147
            ],
            [
                2147,
                2219
            ],
            [
                2219,
                2333
            ],
            [
                2333,
                2333
            ],
            [
                2333,
                2377
            ],
            [
                2377,
                2377
            ],
            [
                2377,
                2492
            ],
            [
                2492,
                2636
            ],
            [
                2636,
                2708
            ],
            [
                2708,
                2777
            ],
            [
                2777,
                2803
            ],
            [
                2803,
                2825
            ],
            [
                2825,
                2859
            ],
            [
                2859,
                2964
            ],
            [
                2964,
                3077
            ],
            [
                3077,
                3169
            ],
            [
                3169,
                3245
            ],
            [
                3245,
                3431
            ],
            [
                3431,
                3657
            ],
            [
                3657,
                3716
            ],
            [
                3716,
                3761
            ],
            [
                3761,
                3795
            ],
            [
                3795,
                3795
            ],
            [
                3795,
                3810
            ],
            [
                3810,
                3853
            ],
            [
                3853,
                3913
            ],
            [
                3913,
                4073
            ],
            [
                4073,
                4174
            ],
            [
                4174,
                4300
            ],
            [
                4300,
                4300
            ],
            [
                4300,
                4472
            ],
            [
                4472,
                4543
            ],
            [
                4543,
                4558
            ],
            [
                4558,
                4570
            ],
            [
                4570,
                4611
            ],
            [
                4611,
                4704
            ],
            [
                4704,
                4704
            ],
            [
                4704,
                4743
            ],
            [
                4743,
                4784
            ],
            [
                4784,
                4827
            ],
            [
                4827,
                4903
            ],
            [
                4903,
                4931
            ],
            [
                4931,
                5023
            ],
            [
                5023,
                5093
            ],
            [
                5093,
                5144
            ],
            [
                5144,
                5206
            ],
            [
                5206,
                5254
            ],
            [
                5254,
                5283
            ],
            [
                5283,
                5366
            ],
            [
                5366,
                5411
            ],
            [
                5411,
                5411
            ],
            [
                5411,
                5527
            ],
            [
                5527,
                5652
            ],
            [
                5652,
                5652
            ],
            [
                5652,
                5870
            ],
            [
                5870,
                5946
            ],
            [
                5946,
                5946
            ],
            [
                5946,
                6053
            ],
            [
                6053,
                6148
            ],
            [
                6148,
                6148
            ],
            [
                6148,
                6148
            ],
            [
                6148,
                6148
            ],
            [
                6148,
                6148
            ],
            [
                6148,
                6233
            ],
            [
                6233,
                6259
            ],
            [
                6259,
                6304
            ],
            [
                6304,
                6310
            ],
            [
                6310,
                6310
            ],
            [
                6310,
                6326
            ],
            [
                6326,
                6359
            ],
            [
                6359,
                6461
            ],
            [
                6461,
                6479
            ],
            [
                6479,
                6533
            ],
            [
                6533,
                6603
            ],
            [
                6603,
                6667
            ],
            [
                6667,
                6775
            ],
            [
                6775,
                6775
            ],
            [
                6775,
                6775
            ],
            [
                6775,
                6775
            ],
            [
                6775,
                6775
            ],
            [
                6775,
                6966
            ],
            [
                6966,
                6988
            ],
            [
                6988,
                6988
            ],
            [
                6988,
                7054
            ],
            [
                7054,
                7054
            ],
            [
                7054,
                7106
            ],
            [
                7106,
                7106
            ],
            [
                7106,
                7190
            ],
            [
                7190,
                7297
            ],
            [
                7297,
                7365
            ],
            [
                7365,
                7446
            ],
            [
                7446,
                7446
            ],
            [
                7446,
                7492
            ],
            [
                7492,
                7656
            ],
            [
                7656,
                7724
            ],
            [
                7724,
                7791
            ],
            [
                7791,
                7874
            ],
            [
                7874,
                7921
            ],
            [
                7921,
                7948
            ],
            [
                7948,
                7976
            ],
            [
                7976,
                8044
            ],
            [
                8044,
                8074
            ],
            [
                8074,
                8085
            ],
            [
                8085,
                8195
            ],
            [
                8195,
                8217
            ],
            [
                8217,
                8307
            ],
            [
                8307,
                8351
            ],
            [
                8351,
                8351
            ],
            [
                8351,
                8392
            ],
            [
                8392,
                8392
            ],
            [
                8392,
                8392
            ],
            [
                8392,
                8480
            ],
            [
                8480,
                8533
            ],
            [
                8533,
                8583
            ],
            [
                8583,
                8621
            ],
            [
                8621,
                8650
            ],
            [
                8650,
                8712
            ],
            [
                8712,
                8712
            ],
            [
                8712,
                8712
            ],
            [
                8712,
                8813
            ],
            [
                8813,
                8813
            ],
            [
                8813,
                8919
            ],
            [
                8919,
                8988
            ],
            [
                8988,
                9024
            ],
            [
                9024,
                9129
            ],
            [
                9129,
                9129
            ],
            [
                9129,
                9247
            ],
            [
                9247,
                9395
            ],
            [
                9395,
                9490
            ],
            [
                9490,
                9594
            ],
            [
                9594,
                9693
            ],
            [
                9693,
                9806
            ],
            [
                9806,
                9834
            ],
            [
                9834,
                9873
            ],
            [
                9873,
                9950
            ],
            [
                9950,
                10010
            ],
            [
                10010,
                10050
            ],
            [
                10050,
                10100
            ],
            [
                10100,
                10153
            ],
            [
                10153,
                10283
            ],
            [
                10283,
                10364
            ],
            [
                10364,
                10402
            ],
            [
                10402,
                10420
            ],
            [
                10420,
                10538
            ],
            [
                10538,
                10601
            ],
            [
                10601,
                10742
            ],
            [
                10742,
                10742
            ],
            [
                10742,
                10827
            ],
            [
                10827,
                10951
            ],
            [
                10951,
                11070
            ],
            [
                11070,
                11251
            ],
            [
                11251,
                11338
            ],
            [
                11338,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11421
            ],
            [
                11421,
                11456
            ],
            [
                11456,
                11525
            ],
            [
                11525,
                11594
            ],
            [
                11594,
                11652
            ],
            [
                11652,
                11674
            ],
            [
                11674,
                11674
            ],
            [
                11674,
                11719
            ],
            [
                11719,
                11745
            ],
            [
                11745,
                11766
            ],
            [
                11766,
                11766
            ],
            [
                11766,
                11766
            ],
            [
                11766,
                11766
            ],
            [
                11766,
                11766
            ],
            [
                11766,
                11832
            ],
            [
                11832,
                11910
            ],
            [
                11910,
                11951
            ],
            [
                11951,
                11969
            ],
            [
                11969,
                11969
            ],
            [
                11969,
                12023
            ],
            [
                12023,
                12098
            ],
            [
                12098,
                12141
            ],
            [
                12141,
                12187
            ],
            [
                12187,
                12270
            ],
            [
                12270,
                12314
            ],
            [
                12314,
                12388
            ],
            [
                12388,
                12471
            ],
            [
                12471,
                12529
            ],
            [
                12529,
                12566
            ],
            [
                12566,
                12584
            ],
            [
                12584,
                12584
            ],
            [
                12584,
                12669
            ],
            [
                12669,
                12729
            ],
            [
                12729,
                12879
            ],
            [
                12879,
                12944
            ],
            [
                12944,
                12944
            ],
            [
                12944,
                12993
            ],
            [
                12993,
                13095
            ]
        ]
    }
}