{
    "original": {
        "text": "Mr. Vavasor was at his wits' end about his daughter. She had put her name to four bills for five hundred pounds each, and had demanded from him, almost without an apology, his aid in obtaining money to meet them. And she might put her name to any other number of bills, and for any amount! There was no knowing how a man ought to behave to such a daughter. \"I don't want her money,\" the father said to himself; \"and if she had got none of her own, I would make her as comfortable as I could with my own income. But to see her throw her money away in such a fashion as this is enough to break a man's heart.\"\nMr. Vavasor went to his office in Chancery Lane, but he did not go to the chambers of Mr. Round, the lawyer. Instead of calling on Mr. Round he sent a note by a messenger to Suffolk Street, and the answer to the note came in the person of Mr. Grey. John Grey was living in town in these days, and was in the habit of seeing Mr. Vavasor frequently. Indeed, he had not left London since the memorable occasion on which he had pitched his rival down the tailor's stairs at his lodgings. He had made himself pretty well conversant with George Vavasor's career, and had often shuddered as he thought what might be the fate of any girl who might trust herself to marry such a man as that.\nHe had been at home when Mr. Vavasor's note had reached his lodgings, and had instantly walked off towards Chancery Lane. He knew his way to Mr. Vavasor's signing-office very accurately, for he had acquired a habit of calling there, and of talking to the father about his daughter. He was a patient, persevering man, confident in himself, and apt to trust that he would accomplish those things which he attempted, though he was hardly himself aware of any such aptitude. He had never despaired as to Alice. And though he had openly acknowledged to himself that she had been very foolish,--or rather, that her judgement had failed her,--he had never in truth been angry with her. He had looked upon her rejection of himself, and her subsequent promise to her cousin, as the effects of a mental hallucination, very much to be lamented,--to be wept for, perhaps, through a whole life, as a source of terrible sorrow to himself and to her. But he regarded it all as a disease, of which the cure was yet possible,--as a disease which, though it might never leave the patient as strong as she was before, might still leave her altogether. And as he would still have clung to his love had she been attacked by any of those illnesses for which doctors have well-known names, so would he cling to her now that she was attacked by a malady for which no name was known. He had already heard from Mr. Vavasor that Alice had discovered how impossible it was that she should marry her cousin, and, in his quiet, patient, enduring way, was beginning to feel confident that he would, at last, carry his mistress off with him to Nethercoats.\nIt was certainly a melancholy place, that signing-office, in which Mr. John Vavasor was doomed to spend twelve hours a week, during every term time, of his existence. Whether any man could really pass an existence of work in such a workshop, and not have gone mad,--could have endured to work there for seven hours a day, every week-day of his life, I am not prepared to say. I doubt much whether any victims are so doomed. I have so often wandered through those gloomy passages without finding a sign of humanity there,--without hearing any slightest tick of the hammer of labour, that I am disposed to think that Lord Chancellors have been anxious to save their subordinates from suicide, and have mercifully decreed that the whole staff of labourers, down to the very message boys of the office, should be sent away to green fields or palatial clubs during, at any rate, a moiety of their existence.\nThe dismal set of chambers, in which the most dismal room had been assigned to Mr. Vavasor, was not actually in Chancery Lane. Opening off from Chancery Lane are various other small lanes, quiet, dingy nooks, some of them in the guise of streets going no whither, some being thoroughfares to other dingy streets beyond, in which sponging-houses abound, and others existing as the entrances to so-called Inns of Court,--inns of which all knowledge has for years been lost to the outer world of the laity, and, as I believe, lost almost equally to the inner world of the legal profession. Who has ever heard of Symonds' Inn? But an ancestral Symonds, celebrated, no doubt, in his time, did found an inn, and there it is to this day. Of Staples' Inn, who knows the purposes or use? Who are its members, and what do they do as such? And Staples' Inn is an inn with pretensions, having a chapel of its own, or, at any rate, a building which, in its external dimensions, is ecclesiastical, having a garden and architectural proportions; and a faade towards Holborn, somewhat dingy, but respectable, with an old gateway, and with a decided character of its own.\nThe building in which Mr. John Vavasor had a room and a desk was located in one of these side streets, and had, in its infantine days, been regarded with complacency by its founder. It was stone-faced, and strong, and though very ugly, had about it that air of importance which justifies a building in assuming a special name of itself. This building was called the Accountant-General's Record Office, and very probably, in the gloom of its dark cellars, may lie to this day the records of the expenditure of many a fair property which has gotten itself into Chancery, and has never gotten itself out again. It was entered by a dark hall, the door of which was never closed; and which, having another door at its further end leading into another lane, had become itself a thoroughfare. But the passers through it were few in number. Now and then a boy might be seen there carrying on his head or shoulders a huge mass of papers which you would presume to be accounts, or some clerk employed in the purlieus of Chancery Lane who would know the shortest possible way from the chambers of some one attorney to those of some other. But this hall, though open at both ends, was as dark as Erebus; and any who lingered in it would soon find themselves to be growing damp, and would smell mildew, and would become naturally affected by the exhalations arising from those Chancery records beneath their feet.\nUp the stone stairs, from this hall, John Grey passed to Mr. Vavasor's signing-room. The stairs were broad, and almost of noble proportions, but the darkness and gloom which hung about the hall, hung also about them,--a melancholy set of stairs, up and down which no man can walk with cheerful feet. Here he came upon a long, broad passage, in which no sound was, at first, to be heard. There was no busy noise of doors slamming, no rapid sound of shoes, no passing to and fro of men intent on their daily bread. Pausing for a moment, that he might look round about him and realize the deathlike stillness of the whole, John Grey could just distinguish the heavy breathing of a man, thereby learning that there was a captive in, at any rate, one of those prisons on each side of him. As he drew near to the door of Mr. Vavasor's chamber he knew that the breathing came from thence.\nOn the door there were words inscribed, which were just legible in the gloom--\"Signing Room. Mr. Vavasor.\"\nHow John Vavasor did hate those words! It seemed to him that they had been placed there with the express object of declaring his degradation aloud to the world. Since his grandfather's will had been read to him he had almost made up his mind to go down those melancholy stairs for the last time, to shake the dust off his feet as he left the Accountant-General's Record Office for ever, and content himself with half his official income. But how could he give up so many hundreds a year while his daughter was persisting in throwing away thousands as fast as, or faster than, she could lay her hands on them?\nJohn Grey entered the room and found Mr. Vavasor sitting all alone in an arm-chair over the fire. I rather think that that breathing had been the breathing of a man asleep. He was resting himself amidst the labours of his signing. It was a large, dull room, which could not have been painted, I should think, within the memory of man, looking out backwards into some court. The black wall of another building seemed to stand up close to the window,--so close that no direct ray of the sun ever interrupted the signing-clerk at his work. In the middle of the room there was a large mahogany-table, on which lay a pile of huge papers. Across the top of them there was placed a bit of blotting-paper, with a quill pen, the two only tools which were necessary to the performance of the signing-clerk's work. On the table there stood a row of official books, placed lengthways on their edges: the \"Post-Office Directory,\" the \"Court Circular,\" a \"Directory to the Inns of Court,\" a dusty volume of Acts of Parliament, which had reference to Chancery accounts,--a volume which Mr. Vavasor never opened; and there were some others; but there was no book there in which any Christian man or woman could take delight, either for amusement or for recreation. There were three or four chairs round the wall, and there was the one arm-chair which the occupant of the chamber had dragged away from its sacred place to the hearth-rug. There was also an old Turkey carpet on the floor. Other furniture there was none. Can it be a matter of surprise to any one that Mr. Vavasor preferred his club to his place of business? He was not left quite alone in this deathlike dungeon. Attached to his own large room there was a small closet, in which sat the signing-clerk's clerk,--a lad of perhaps seventeen years of age, who spent the greatest part of his time playing tit-tat-to by himself upon official blotting-paper. Had I been Mr. Vavasor I should have sworn a bosom friendship with that lad, have told him all my secrets, and joined his youthful games.\n\"Come in!\" Mr. Vavasor had cried when John Grey disturbed his slumber by knocking at the door. \"I'm glad to see you,--very. Sit down; won't you? Did you ever see such a wretched fire? The coals they give you in this place are the worst in all London. Did you ever see such coals?\" And he gave a wicked poke at the fire.\nIt was now the 1st of May, and Grey, who had walked from Suffolk Street, was quite warm. \"One hardly wants a fire at all, such weather as this,\" he said.\n\"Oh; don't you?\" said the signing-clerk. \"If you had to sit here all day, you'd see if you didn't want a fire. It's the coldest building I ever put my foot in. Sometimes in winter I have to sit here the whole day in a great-coat. I only wish I could shut old Sugden up here for a week or two, after Christmas.\" The great lawyer whom he had named was the man whom he supposed to have inflicted on him the terrible injury of his life, and he was continually invoking small misfortunes on the head of that tyrant.\n\"How is Alice?\" said Grey, desiring to turn the subject from the ten-times-told tale of his friend's wrongs.\nMr. Vavasor sighed. \"She is well enough, I believe,\" he said.\n\"Is anything the matter in Queen Anne Street?\"\n\"You'll hardly believe it when I tell you; and, indeed, I hardly know whether I ought to tell you or not.\"\n\"As you and I have gone so far together, I think that you ought to tell me anything that concerns her nearly.\"\n\"That's just it. It's about her money. Do you know, Grey, I'm beginning to think that I've been wrong in allowing you to advance what you have done on her account?\"\n\"Why wrong?\"\n\"Because I foresee there'll be a difficulty about it. How are we to manage about the repayment?\"\n\"If she becomes my wife there will be no management wanted.\"\n\"But how if she never becomes your wife? I'm beginning to think she'll never do anything like any other woman.\"\n\"I'm not quite sure that you understand her,\" said Grey; \"though of course you ought to do so better than any one else.\"\n\"Nobody can understand her,\" said the angry father. \"She told me the other day, as you know, that she was going to have nothing more to do with her cousin--\"\n\"Has she--has she become friends with him again?\" said Grey. As he asked the question there came a red spot on each cheek, showing the strong mental anxiety which had prompted it.\n\"No; I believe not;--that is, certainly not in the way you mean. I think that she is beginning to know that he is a rascal.\"\n\"It is a great blessing that she has learned the truth before it was too late.\"\n\"But would you believe it;--she has given him her name to bills for two thousand pounds, payable at two weeks' sight? He sent to her only this morning a fellow that he called his clerk, and she has been fool enough to accept them. Two thousand pounds! That comes of leaving money at a young woman's own disposal.\"\n\"But we expected that, you know,\" said Grey, who seemed to take the news with much composure.\n\"Expected it?\"\n\"Of course we did. You yourself did not suppose that what he had before would have been the last.\"\n\"But after she had quarrelled with him!\"\n\"That would make no difference with her. She had promised him her money, and as it seems that he will be content with that, let her keep her promise.\"\n\"And give him everything! Not if I can help it. I'll expose him. I will indeed. Such a pitiful rascal as he is!\"\n\"You will do nothing, Mr. Vavasor, that will injure your daughter. I'm very sure of that.\"\n\"But, by heavens--. Such sheer robbery as that! Two thousand pounds more in fourteen days!\" The shortness of the date at which the bills were drawn seemed to afflict Mr. Vavasor almost as keenly as the amount. Then he described the whole transaction as accurately as he could do so, and also told how Alice had declared her purpose of going to Mr. Round the lawyer, if her father would not undertake to procure the money for her by the time the bills should become due. \"Mr. Round, you know, has heard nothing about it,\" he continued. \"He doesn't dream of any such thing. If she would take my advice, she would leave the bills, and let them be dishonoured. As it is, I think I shall call at Drummonds', and explain the whole transaction.\"\n\"You must not do that,\" said Grey. \"I will call at Drummonds', instead, and see that the money is all right for the bills. As far as they go, let him have his plunder.\"\n\"And if she won't take you, at last, Grey? Upon my word, I don't think she ever will. My belief is she'll never get married. She'll never do anything like any other woman.\"\n\"The money won't be missed by me if I never get married,\" said Grey, with a smile. \"If she does marry me, of course I shall make her pay me.\"\n\"No, by George! that won't do,\" said Vavasor. \"If she were your daughter you'd know that she could not take a man's money in that way.\"\n\"And I know it now, though she is not my daughter. I was only joking. As soon as I am certain,--finally certain,--that she can never become my wife, I will take back my money. You need not be afraid. The nature of the arrangement we have made shall then be explained to her.\"\nIn this way it was settled; and on the following morning the father informed the daughter that he had done her bidding, and that the money would be placed to her credit at the bankers' before the bills came due. On that Saturday, the day which her cousin had named in his letter, she trudged down to Drummonds', and was informed by a very courteous senior clerk in that establishment, that due preparation for the bills had been made.\nSo far, I think we may say that Mr. George Vavasor was not unfortunate.",
        "paragraph_chars": [
            [
                0,
                608
            ],
            [
                608,
                1291
            ],
            [
                1291,
                2916
            ],
            [
                2916,
                3819
            ],
            [
                3819,
                4974
            ],
            [
                4974,
                6375
            ],
            [
                6375,
                7257
            ],
            [
                7257,
                7364
            ],
            [
                7364,
                7973
            ],
            [
                7973,
                10012
            ],
            [
                10012,
                10332
            ],
            [
                10332,
                10486
            ],
            [
                10486,
                10997
            ],
            [
                10997,
                11106
            ],
            [
                11106,
                11168
            ],
            [
                11168,
                11215
            ],
            [
                11215,
                11322
            ],
            [
                11322,
                11433
            ],
            [
                11433,
                11598
            ],
            [
                11598,
                11611
            ],
            [
                11611,
                11708
            ],
            [
                11708,
                11769
            ],
            [
                11769,
                11881
            ],
            [
                11881,
                12002
            ],
            [
                12002,
                12160
            ],
            [
                12160,
                12340
            ],
            [
                12340,
                12465
            ],
            [
                12465,
                12545
            ],
            [
                12545,
                12859
            ],
            [
                12859,
                12953
            ],
            [
                12953,
                12968
            ],
            [
                12968,
                13067
            ],
            [
                13067,
                13108
            ],
            [
                13108,
                13259
            ],
            [
                13259,
                13372
            ],
            [
                13372,
                13463
            ],
            [
                13463,
                14202
            ],
            [
                14202,
                14371
            ],
            [
                14371,
                14544
            ],
            [
                14544,
                14686
            ],
            [
                14686,
                14822
            ],
            [
                14822,
                15098
            ],
            [
                15098,
                15533
            ],
            [
                15533,
                15604
            ]
        ],
        "segment_chars": [
            [
                0,
                53
            ],
            [
                53,
                213
            ],
            [
                213,
                290
            ],
            [
                290,
                357
            ],
            [
                357,
                511
            ],
            [
                511,
                608
            ],
            [
                608,
                717
            ],
            [
                717,
                857
            ],
            [
                857,
                956
            ],
            [
                956,
                1092
            ],
            [
                1092,
                1291
            ],
            [
                1291,
                1413
            ],
            [
                1413,
                1573
            ],
            [
                1573,
                1762
            ],
            [
                1762,
                1798
            ],
            [
                1798,
                1970
            ],
            [
                1970,
                2227
            ],
            [
                2227,
                2424
            ],
            [
                2424,
                2650
            ],
            [
                2650,
                2916
            ],
            [
                2916,
                3083
            ],
            [
                3083,
                3292
            ],
            [
                3292,
                3340
            ],
            [
                3340,
                3819
            ],
            [
                3819,
                3946
            ],
            [
                3946,
                4406
            ],
            [
                4406,
                4442
            ],
            [
                4442,
                4550
            ],
            [
                4550,
                4598
            ],
            [
                4598,
                4648
            ],
            [
                4648,
                4974
            ],
            [
                4974,
                5156
            ],
            [
                5156,
                5311
            ],
            [
                5311,
                5582
            ],
            [
                5582,
                5760
            ],
            [
                5760,
                5807
            ],
            [
                5807,
                6102
            ],
            [
                6102,
                6375
            ],
            [
                6375,
                6460
            ],
            [
                6460,
                6675
            ],
            [
                6675,
                6762
            ],
            [
                6762,
                6888
            ],
            [
                6888,
                7159
            ],
            [
                7159,
                7257
            ],
            [
                7257,
                7350
            ],
            [
                7350,
                7364
            ],
            [
                7364,
                7403
            ],
            [
                7403,
                7525
            ],
            [
                7525,
                7802
            ],
            [
                7802,
                7973
            ],
            [
                7973,
                8071
            ],
            [
                8071,
                8146
            ],
            [
                8146,
                8204
            ],
            [
                8204,
                8347
            ],
            [
                8347,
                8510
            ],
            [
                8510,
                8606
            ],
            [
                8606,
                8777
            ],
            [
                8777,
                9222
            ],
            [
                9222,
                9394
            ],
            [
                9394,
                9444
            ],
            [
                9444,
                9476
            ],
            [
                9476,
                9580
            ],
            [
                9580,
                9635
            ],
            [
                9635,
                9874
            ],
            [
                9874,
                10012
            ],
            [
                10012,
                10023
            ],
            [
                10023,
                10107
            ],
            [
                10107,
                10136
            ],
            [
                10136,
                10157
            ],
            [
                10157,
                10196
            ],
            [
                10196,
                10263
            ],
            [
                10263,
                10293
            ],
            [
                10293,
                10332
            ],
            [
                10332,
                10421
            ],
            [
                10421,
                10486
            ],
            [
                10486,
                10503
            ],
            [
                10503,
                10527
            ],
            [
                10527,
                10597
            ],
            [
                10597,
                10646
            ],
            [
                10646,
                10716
            ],
            [
                10716,
                10797
            ],
            [
                10797,
                10997
            ],
            [
                10997,
                11013
            ],
            [
                11013,
                11106
            ],
            [
                11106,
                11126
            ],
            [
                11126,
                11168
            ],
            [
                11168,
                11215
            ],
            [
                11215,
                11322
            ],
            [
                11322,
                11433
            ],
            [
                11433,
                11450
            ],
            [
                11450,
                11472
            ],
            [
                11472,
                11598
            ],
            [
                11598,
                11611
            ],
            [
                11611,
                11665
            ],
            [
                11665,
                11708
            ],
            [
                11708,
                11769
            ],
            [
                11769,
                11810
            ],
            [
                11810,
                11881
            ],
            [
                11881,
                12002
            ],
            [
                12002,
                12054
            ],
            [
                12054,
                12160
            ],
            [
                12160,
                12210
            ],
            [
                12210,
                12221
            ],
            [
                12221,
                12340
            ],
            [
                12340,
                12405
            ],
            [
                12405,
                12465
            ],
            [
                12465,
                12545
            ],
            [
                12545,
                12663
            ],
            [
                12663,
                12776
            ],
            [
                12776,
                12797
            ],
            [
                12797,
                12859
            ],
            [
                12859,
                12953
            ],
            [
                12953,
                12968
            ],
            [
                12968,
                12987
            ],
            [
                12987,
                13067
            ],
            [
                13067,
                13108
            ],
            [
                13108,
                13149
            ],
            [
                13149,
                13259
            ],
            [
                13259,
                13285
            ],
            [
                13285,
                13307
            ],
            [
                13307,
                13324
            ],
            [
                13324,
                13339
            ],
            [
                13339,
                13372
            ],
            [
                13372,
                13439
            ],
            [
                13439,
                13463
            ],
            [
                13463,
                13483
            ],
            [
                13483,
                13511
            ],
            [
                13511,
                13555
            ],
            [
                13555,
                13673
            ],
            [
                13673,
                13933
            ],
            [
                13933,
                13938
            ],
            [
                13938,
                13998
            ],
            [
                13998,
                14035
            ],
            [
                14035,
                14120
            ],
            [
                14120,
                14202
            ],
            [
                14202,
                14237
            ],
            [
                14237,
                14325
            ],
            [
                14325,
                14371
            ],
            [
                14371,
                14414
            ],
            [
                14414,
                14457
            ],
            [
                14457,
                14496
            ],
            [
                14496,
                14544
            ],
            [
                14544,
                14627
            ],
            [
                14627,
                14686
            ],
            [
                14686,
                14702
            ],
            [
                14702,
                14732
            ],
            [
                14732,
                14822
            ],
            [
                14822,
                14873
            ],
            [
                14873,
                14892
            ],
            [
                14892,
                14998
            ],
            [
                14998,
                15022
            ],
            [
                15022,
                15098
            ],
            [
                15098,
                15310
            ],
            [
                15310,
                15533
            ],
            [
                15533,
                15604
            ]
        ],
        "overlap_chars": [
            [
                0,
                53
            ],
            [
                53,
                134
            ],
            [
                172,
                213
            ],
            [
                213,
                268
            ],
            [
                288,
                289
            ],
            [
                357,
                426
            ],
            [
                431,
                435
            ],
            [
                446,
                511
            ],
            [
                511,
                546
            ],
            [
                568,
                608
            ],
            [
                749,
                763
            ],
            [
                779,
                781
            ],
            [
                739,
                748
            ],
            [
                796,
                857
            ],
            [
                1485,
                1516
            ],
            [
                1432,
                1445
            ],
            [
                1454,
                1460
            ],
            [
                1429,
                1431
            ],
            [
                1539,
                1572
            ],
            [
                1762,
                1784
            ],
            [
                1791,
                1798
            ],
            [
                1798,
                1811
            ],
            [
                1823,
                1835
            ],
            [
                1847,
                1877
            ],
            [
                1880,
                1924
            ],
            [
                1927,
                1939
            ],
            [
                1949,
                1970
            ],
            [
                1970,
                2022
            ],
            [
                2034,
                2124
            ],
            [
                2227,
                2230
            ],
            [
                2304,
                2319
            ],
            [
                2331,
                2336
            ],
            [
                2402,
                2424
            ],
            [
                2424,
                2427
            ],
            [
                2428,
                2468
            ],
            [
                2473,
                2476
            ],
            [
                2469,
                2472
            ],
            [
                2477,
                2497
            ],
            [
                2556,
                2620
            ],
            [
                2521,
                2526
            ],
            [
                2631,
                2638
            ],
            [
                2648,
                2650
            ],
            [
                2650,
                2656
            ],
            [
                2665,
                2713
            ],
            [
                2729,
                2735
            ],
            [
                2718,
                2728
            ],
            [
                2736,
                2796
            ],
            [
                2807,
                2810
            ],
            [
                2812,
                2873
            ],
            [
                2887,
                2916
            ],
            [
                3900,
                3909
            ],
            [
                3911,
                3914
            ],
            [
                3847,
                3849
            ],
            [
                3823,
                3846
            ],
            [
                4309,
                4315
            ],
            [
                4008,
                4020
            ],
            [
                4156,
                4157
            ],
            [
                3954,
                3957
            ],
            [
                3931,
                3945
            ],
            [
                5398,
                5401
            ],
            [
                5316,
                5324
            ],
            [
                5393,
                5394
            ],
            [
                5504,
                5509
            ],
            [
                5325,
                5375
            ],
            [
                5585,
                5611
            ],
            [
                5647,
                5652
            ],
            [
                5658,
                5666
            ],
            [
                5675,
                5682
            ],
            [
                5695,
                5698
            ],
            [
                5427,
                5428
            ],
            [
                5311,
                5315
            ],
            [
                5726,
                5736
            ],
            [
                5744,
                5760
            ],
            [
                5760,
                5795
            ],
            [
                6262,
                6267
            ],
            [
                5968,
                5971
            ],
            [
                6111,
                6115
            ],
            [
                6143,
                6146
            ],
            [
                6150,
                6154
            ],
            [
                5940,
                5941
            ],
            [
                6234,
                6243
            ],
            [
                5892,
                5894
            ],
            [
                6256,
                6262
            ],
            [
                6373,
                6375
            ],
            [
                6396,
                6410
            ],
            [
                6394,
                6395
            ],
            [
                6375,
                6381
            ],
            [
                6382,
                6394
            ],
            [
                6410,
                6445
            ],
            [
                6454,
                6460
            ],
            [
                6888,
                6895
            ],
            [
                7100,
                7102
            ],
            [
                6957,
                6960
            ],
            [
                6984,
                6987
            ],
            [
                6908,
                6909
            ],
            [
                6915,
                6917
            ],
            [
                7005,
                7015
            ],
            [
                7028,
                7056
            ],
            [
                7157,
                7158
            ],
            [
                8146,
                8148
            ],
            [
                7983,
                7990
            ],
            [
                8000,
                8029
            ],
            [
                8040,
                8055
            ],
            [
                8061,
                8069
            ],
            [
                8153,
                8160
            ],
            [
                8169,
                8175
            ],
            [
                8191,
                8194
            ],
            [
                8180,
                8187
            ],
            [
                8202,
                8204
            ],
            [
                8204,
                8230
            ],
            [
                8289,
                8292
            ],
            [
                8410,
                8420
            ],
            [
                8300,
                8302
            ],
            [
                8347,
                8381
            ],
            [
                8508,
                8510
            ],
            [
                8583,
                8592
            ],
            [
                8598,
                8604
            ],
            [
                8579,
                8582
            ],
            [
                8570,
                8572
            ],
            [
                8546,
                8562
            ],
            [
                8563,
                8568
            ],
            [
                8604,
                8606
            ],
            [
                9222,
                9269
            ],
            [
                9284,
                9287
            ],
            [
                9292,
                9301
            ],
            [
                9378,
                9392
            ],
            [
                9270,
                9273
            ],
            [
                9409,
                9444
            ],
            [
                9444,
                9476
            ],
            [
                9476,
                9485
            ],
            [
                9510,
                9513
            ],
            [
                9498,
                9506
            ],
            [
                9518,
                9553
            ],
            [
                9578,
                9579
            ],
            [
                9580,
                9590
            ],
            [
                9596,
                9635
            ],
            [
                9635,
                9690
            ],
            [
                9692,
                9704
            ],
            [
                9725,
                9731
            ],
            [
                9733,
                9734
            ],
            [
                9774,
                9783
            ],
            [
                9802,
                9813
            ],
            [
                9705,
                9708
            ],
            [
                9858,
                9873
            ],
            [
                10012,
                10023
            ],
            [
                10023,
                10034
            ],
            [
                10039,
                10044
            ],
            [
                10105,
                10107
            ],
            [
                10107,
                10127
            ],
            [
                10134,
                10136
            ],
            [
                10136,
                10144
            ],
            [
                10157,
                10196
            ],
            [
                10597,
                10646
            ],
            [
                10646,
                10684
            ],
            [
                10699,
                10714
            ],
            [
                10997,
                11013
            ],
            [
                11013,
                11022
            ],
            [
                11104,
                11106
            ],
            [
                11106,
                11126
            ],
            [
                11126,
                11145
            ],
            [
                11168,
                11191
            ],
            [
                11212,
                11215
            ],
            [
                11215,
                11312
            ],
            [
                11319,
                11322
            ],
            [
                11322,
                11323
            ],
            [
                11363,
                11423
            ],
            [
                11430,
                11433
            ],
            [
                11450,
                11472
            ],
            [
                11472,
                11561
            ],
            [
                11581,
                11598
            ],
            [
                11598,
                11602
            ],
            [
                11608,
                11611
            ],
            [
                11611,
                11629
            ],
            [
                11644,
                11654
            ],
            [
                11686,
                11705
            ],
            [
                11708,
                11769
            ],
            [
                11769,
                11773
            ],
            [
                11778,
                11810
            ],
            [
                11810,
                11878
            ],
            [
                12055,
                12156
            ],
            [
                12160,
                12161
            ],
            [
                12170,
                12210
            ],
            [
                12210,
                12219
            ],
            [
                12281,
                12282
            ],
            [
                12295,
                12301
            ],
            [
                12309,
                12316
            ],
            [
                12338,
                12340
            ],
            [
                12340,
                12343
            ],
            [
                12370,
                12405
            ],
            [
                12405,
                12424
            ],
            [
                12443,
                12462
            ],
            [
                12546,
                12570
            ],
            [
                12573,
                12654
            ],
            [
                12661,
                12663
            ],
            [
                12776,
                12795
            ],
            [
                12859,
                12903
            ],
            [
                12932,
                12936
            ],
            [
                12942,
                12953
            ],
            [
                12953,
                12965
            ],
            [
                13072,
                13105
            ],
            [
                13149,
                13259
            ],
            [
                13259,
                13285
            ],
            [
                13285,
                13307
            ],
            [
                13307,
                13318
            ],
            [
                13324,
                13337
            ],
            [
                13372,
                13439
            ],
            [
                13439,
                13442
            ],
            [
                13448,
                13463
            ],
            [
                13463,
                13467
            ],
            [
                13488,
                13501
            ],
            [
                13673,
                13677
            ],
            [
                13713,
                13715
            ],
            [
                13681,
                13712
            ],
            [
                13744,
                13749
            ],
            [
                13755,
                13782
            ],
            [
                13804,
                13852
            ],
            [
                13866,
                13891
            ],
            [
                13931,
                13933
            ],
            [
                14035,
                14120
            ],
            [
                14130,
                14163
            ],
            [
                14128,
                14129
            ],
            [
                14166,
                14177
            ],
            [
                14123,
                14125
            ],
            [
                14199,
                14202
            ],
            [
                14202,
                14237
            ],
            [
                14237,
                14262
            ],
            [
                14265,
                14325
            ],
            [
                14344,
                14371
            ],
            [
                14371,
                14375
            ],
            [
                14376,
                14398
            ],
            [
                14408,
                14414
            ],
            [
                14457,
                14494
            ],
            [
                14544,
                14626
            ],
            [
                14686,
                14702
            ],
            [
                14702,
                14731
            ],
            [
                14892,
                14915
            ],
            [
                14936,
                14996
            ],
            [
                15110,
                15129
            ],
            [
                15147,
                15245
            ],
            [
                15098,
                15100
            ],
            [
                15133,
                15136
            ],
            [
                15283,
                15310
            ],
            [
                15310,
                15326
            ],
            [
                15336,
                15407
            ],
            [
                15326,
                15327
            ],
            [
                15410,
                15459
            ],
            [
                15483,
                15533
            ],
            [
                15533,
                15587
            ],
            [
                15603,
                15604
            ]
        ],
        "row_chars": [
            [
                0,
                53
            ],
            [
                53,
                213
            ],
            [
                213,
                290
            ],
            [
                290,
                357
            ],
            [
                357,
                511
            ],
            [
                511,
                608
            ],
            [
                608,
                717
            ],
            [
                717,
                857
            ],
            [
                857,
                956
            ],
            [
                956,
                1092
            ],
            [
                1092,
                1291
            ],
            [
                1291,
                1413
            ],
            [
                1413,
                1573
            ],
            [
                1573,
                1762
            ],
            [
                1762,
                1798
            ],
            [
                1798,
                1970
            ],
            [
                1970,
                2424
            ],
            [
                2424,
                2650
            ],
            [
                2650,
                2916
            ],
            [
                2916,
                3083
            ],
            [
                3083,
                3292
            ],
            [
                3292,
                3340
            ],
            [
                3340,
                3819
            ],
            [
                3819,
                4406
            ],
            [
                4406,
                4442
            ],
            [
                4442,
                4550
            ],
            [
                4550,
                4598
            ],
            [
                4598,
                4648
            ],
            [
                4648,
                4974
            ],
            [
                4974,
                5156
            ],
            [
                5156,
                5311
            ],
            [
                5311,
                5760
            ],
            [
                5760,
                6375
            ],
            [
                6375,
                6460
            ],
            [
                6460,
                6675
            ],
            [
                6675,
                6762
            ],
            [
                6762,
                6888
            ],
            [
                6888,
                7159
            ],
            [
                7159,
                7257
            ],
            [
                7257,
                7350
            ],
            [
                7350,
                7364
            ],
            [
                7364,
                7403
            ],
            [
                7403,
                7525
            ],
            [
                7525,
                7802
            ],
            [
                7802,
                7973
            ],
            [
                7973,
                8204
            ],
            [
                8204,
                8510
            ],
            [
                8510,
                8606
            ],
            [
                8606,
                8777
            ],
            [
                8777,
                9222
            ],
            [
                9222,
                9444
            ],
            [
                9444,
                9476
            ],
            [
                9476,
                9580
            ],
            [
                9580,
                9635
            ],
            [
                9635,
                9874
            ],
            [
                9874,
                10012
            ],
            [
                10012,
                10023
            ],
            [
                10023,
                10107
            ],
            [
                10107,
                10136
            ],
            [
                10136,
                10157
            ],
            [
                10157,
                10196
            ],
            [
                10196,
                10263
            ],
            [
                10263,
                10293
            ],
            [
                10293,
                10332
            ],
            [
                10332,
                10421
            ],
            [
                10421,
                10486
            ],
            [
                10486,
                10503
            ],
            [
                10503,
                10527
            ],
            [
                10527,
                10597
            ],
            [
                10597,
                10646
            ],
            [
                10646,
                10716
            ],
            [
                10716,
                10797
            ],
            [
                10797,
                10997
            ],
            [
                10997,
                11013
            ],
            [
                11013,
                11106
            ],
            [
                11106,
                11126
            ],
            [
                11126,
                11168
            ],
            [
                11168,
                11215
            ],
            [
                11215,
                11322
            ],
            [
                11322,
                11433
            ],
            [
                11433,
                11450
            ],
            [
                11450,
                11472
            ],
            [
                11472,
                11598
            ],
            [
                11598,
                11611
            ],
            [
                11611,
                11708
            ],
            [
                11708,
                11769
            ],
            [
                11769,
                11810
            ],
            [
                11810,
                11881
            ],
            [
                11881,
                12002
            ],
            [
                12002,
                12054
            ],
            [
                12054,
                12160
            ],
            [
                12160,
                12210
            ],
            [
                12210,
                12340
            ],
            [
                12340,
                12405
            ],
            [
                12405,
                12465
            ],
            [
                12465,
                12545
            ],
            [
                12545,
                12663
            ],
            [
                12663,
                12776
            ],
            [
                12776,
                12797
            ],
            [
                12797,
                12859
            ],
            [
                12859,
                12953
            ],
            [
                12953,
                12968
            ],
            [
                12968,
                12987
            ],
            [
                12987,
                13067
            ],
            [
                13067,
                13108
            ],
            [
                13108,
                13149
            ],
            [
                13149,
                13259
            ],
            [
                13259,
                13285
            ],
            [
                13285,
                13307
            ],
            [
                13307,
                13339
            ],
            [
                13339,
                13372
            ],
            [
                13372,
                13439
            ],
            [
                13439,
                13463
            ],
            [
                13463,
                13511
            ],
            [
                13511,
                13555
            ],
            [
                13555,
                13673
            ],
            [
                13673,
                13933
            ],
            [
                13933,
                13938
            ],
            [
                13938,
                13998
            ],
            [
                13998,
                14035
            ],
            [
                14035,
                14120
            ],
            [
                14120,
                14202
            ],
            [
                14202,
                14237
            ],
            [
                14237,
                14325
            ],
            [
                14325,
                14371
            ],
            [
                14371,
                14414
            ],
            [
                14414,
                14457
            ],
            [
                14457,
                14496
            ],
            [
                14496,
                14544
            ],
            [
                14544,
                14627
            ],
            [
                14627,
                14686
            ],
            [
                14686,
                14702
            ],
            [
                14702,
                14732
            ],
            [
                14732,
                14822
            ],
            [
                14822,
                14873
            ],
            [
                14873,
                14892
            ],
            [
                14892,
                14998
            ],
            [
                14998,
                15022
            ],
            [
                15022,
                15098
            ],
            [
                15098,
                15310
            ],
            [
                15310,
                15533
            ],
            [
                15533,
                15604
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Vavasor was at his wits' end about his daughter. She had put her name to four bills for five hundred pounds each, and had demanded his aid in obtaining money to meet them. And she might put her name to any other number of bills!\n\"I don't want her money,\" the father said to himself; \"and if she had none, I would make her as comfortable as I could with my own income. But to see her throw her money away like this is enough to break a man's heart.\"\nHe sent a note to Mr. Round, the lawyer, and the answer to the note came in the person of Mr. Grey. John Grey had acquired a habit of calling at Mr. Vavasor's office to talk to the father about his daughter.\nHe had never despaired about Alice. And though he acknowledged that she had been very foolish - or rather, that her judgement had failed her - he had never been angry with her. He had looked upon her rejection of himself, and her promise to her cousin, as the effects of a mental hallucination, very much to be lamented, but curable - a disease which might leave her altogether. And just as he would still have clung to his love if she had been attacked by any ordinary illness, so would he cling to her now that she was attacked by a malady which had no name. He had heard from Mr. Vavasor that Alice had discovered it was impossible that she should marry her cousin, and, in his quiet, patient way was beginning to feel confident that he would, at last, carry her off with him to Nethercoats.\nMr. Vavasor's office was in a dismal set of chambers, on one of the quiet, dingy side-streets off Chancery Lane. The ugly stone building, which was called the Accountant-General's Record Office, was entered by a dark hall; and, having an open door at either end, this had become a thoroughfare. But the passers through it were few, and the hall was dark, damp, and smelt of mildew.\nFrom this hall, up the gloomy stone stairs, John Grey passed to Mr. Vavasor's room. Pausing in the silent passage outside the door, he could just hear the heavy breathing of a man within.\nHe entered and found Mr. Vavasor sitting in an arm-chair by the fire, resting amidst his labours. It was a large, dull room, with the view through the window of the black wall of another building. A pile of papers lay on a large mahogany table. There were three or four chairs round the wall, the arm-chair on the hearth-rug, and an old Turkey carpet on the floor. Other furniture there was none. Can it be any surprise that Mr. Vavasor preferred his club?\nHe was not quite alone in this deathlike dungeon. Attached to his own large room there was a small closet in which sat his clerk, a youth who spent most of his time doodling on the blotting-paper.\n\"Come in!\" Mr. Vavasor cried. \"I'm glad to see you. Sit down. Did you ever see such a wretched fire? It's the coldest building I ever put my foot in. Sometimes in winter I have to sit here in a great-coat.\"\n\"How is Alice?\" said Grey.\nMr. Vavasor sighed. \"She is well enough.\"\n\"Is anything the matter?\"\n\"You'll hardly believe it when I tell you; and, indeed, I hardly know whether I ought to tell you.\"\n\"I think that you ought to tell me anything that concerns her.\"\n\"It's about her money. Do you know, Grey, I'm beginning to think that I've been wrong in allowing you to advance money on her account?\"\n\"Why?\"\n\"Because I foresee difficulty about the repayment.\"\n\"If she becomes my wife there will be no management wanted.\"\n\"But what if she never becomes your wife? I'm beginning to think she'll never do anything like any other woman. She told me the other day, as you know, that she was going to have nothing more to do with her cousin-\"\n\"Has she become friends with him again?\" said Grey, in strong anxiety.\n\"No - certainly not in the way you mean. I think that she is learning that he is a rascal. But would you believe it - she has given him her name to bills for two thousand pounds, payable at two weeks? Two thousand pounds!\"\n\"But we expected that, you know,\" said Grey, with composure.\n\"Expected it? After she had quarrelled with him?\"\n\"She had promised him her money, and as it seems that he will be content with that, let her keep her promise.\"\n\"And give him everything! Not if I can help it. I'll expose the rascal, I will indeed!\"\n\"You will do nothing, Mr. Vavasor, that will injure your daughter. I'm sure of that.\"\n\"But it's sheer robbery!\" Then Mr. Vavasor described the whole transaction, and told how Alice had declared she would go to Mr. Round the lawyer, if her father would not procure the money for her. \"If she would take my advice, she would leave the bills, and let them be dishonoured. I think I shall call at Drummonds bank, and explain it.\"\n\"You must not do that,\" said Grey. \"I will call at Drummonds, instead, and see that the money is all right for the bills. Let him have his plunder.\"\n\"And what if she won't take you, Grey? My belief is she'll never get married.\"\n\"The money won't be missed by me if I never get married,\" said Grey, with a smile.\n\"No, by George! that won't do,\" said Vavasor.\n\"Then as soon as I am certain that she can never become my wife, I will take back my money.\"\nSo it was settled; and next morning the father informed the daughter that he had done her bidding, and that the money would be in the bank before the bills came due. On that Saturday which her cousin had named in his letter, she trudged down to Drummonds, and was informed by a very courteous senior clerk that due preparation for the bills had been made.\nSo far, I think we may say that Mr. George Vavasor was fortunate.",
        "paragraph_chars": [
            [
                0,
                233
            ],
            [
                233,
                453
            ],
            [
                453,
                661
            ],
            [
                661,
                1456
            ],
            [
                1456,
                1838
            ],
            [
                1838,
                2026
            ],
            [
                2026,
                2483
            ],
            [
                2483,
                2680
            ],
            [
                2680,
                2887
            ],
            [
                2887,
                2914
            ],
            [
                2914,
                2956
            ],
            [
                2956,
                2982
            ],
            [
                2982,
                3082
            ],
            [
                3082,
                3146
            ],
            [
                3146,
                3282
            ],
            [
                3282,
                3289
            ],
            [
                3289,
                3341
            ],
            [
                3341,
                3402
            ],
            [
                3402,
                3618
            ],
            [
                3618,
                3689
            ],
            [
                3689,
                3912
            ],
            [
                3912,
                3973
            ],
            [
                3973,
                4023
            ],
            [
                4023,
                4134
            ],
            [
                4134,
                4222
            ],
            [
                4222,
                4308
            ],
            [
                4308,
                4648
            ],
            [
                4648,
                4797
            ],
            [
                4797,
                4876
            ],
            [
                4876,
                4959
            ],
            [
                4959,
                5005
            ],
            [
                5005,
                5098
            ],
            [
                5098,
                5454
            ],
            [
                5454,
                5519
            ]
        ],
        "segment_chars": [
            [
                0,
                53
            ],
            [
                53,
                176
            ],
            [
                176,
                233
            ],
            [
                233,
                372
            ],
            [
                372,
                453
            ],
            [
                453,
                553
            ],
            [
                553,
                661
            ],
            [
                661,
                697
            ],
            [
                697,
                838
            ],
            [
                838,
                1040
            ],
            [
                1040,
                1222
            ],
            [
                1222,
                1456
            ],
            [
                1456,
                1569
            ],
            [
                1569,
                1751
            ],
            [
                1751,
                1838
            ],
            [
                1838,
                1922
            ],
            [
                1922,
                2026
            ],
            [
                2026,
                2124
            ],
            [
                2124,
                2223
            ],
            [
                2223,
                2271
            ],
            [
                2271,
                2391
            ],
            [
                2391,
                2423
            ],
            [
                2423,
                2483
            ],
            [
                2483,
                2533
            ],
            [
                2533,
                2680
            ],
            [
                2680,
                2691
            ],
            [
                2691,
                2710
            ],
            [
                2710,
                2732
            ],
            [
                2732,
                2742
            ],
            [
                2742,
                2781
            ],
            [
                2781,
                2830
            ],
            [
                2830,
                2887
            ],
            [
                2887,
                2903
            ],
            [
                2903,
                2914
            ],
            [
                2914,
                2934
            ],
            [
                2934,
                2956
            ],
            [
                2956,
                2982
            ],
            [
                2982,
                3082
            ],
            [
                3082,
                3146
            ],
            [
                3146,
                3169
            ],
            [
                3169,
                3282
            ],
            [
                3282,
                3289
            ],
            [
                3289,
                3341
            ],
            [
                3341,
                3402
            ],
            [
                3402,
                3444
            ],
            [
                3444,
                3514
            ],
            [
                3514,
                3618
            ],
            [
                3618,
                3659
            ],
            [
                3659,
                3689
            ],
            [
                3689,
                3730
            ],
            [
                3730,
                3780
            ],
            [
                3780,
                3890
            ],
            [
                3890,
                3912
            ],
            [
                3912,
                3973
            ],
            [
                3973,
                3987
            ],
            [
                3987,
                4023
            ],
            [
                4023,
                4134
            ],
            [
                4134,
                4160
            ],
            [
                4160,
                4182
            ],
            [
                4182,
                4222
            ],
            [
                4222,
                4289
            ],
            [
                4289,
                4308
            ],
            [
                4308,
                4334
            ],
            [
                4334,
                4505
            ],
            [
                4505,
                4591
            ],
            [
                4591,
                4648
            ],
            [
                4648,
                4683
            ],
            [
                4683,
                4770
            ],
            [
                4770,
                4797
            ],
            [
                4797,
                4836
            ],
            [
                4836,
                4876
            ],
            [
                4876,
                4959
            ],
            [
                4959,
                4975
            ],
            [
                4975,
                5005
            ],
            [
                5005,
                5098
            ],
            [
                5098,
                5264
            ],
            [
                5264,
                5454
            ],
            [
                5454,
                5519
            ]
        ],
        "overlap_chars": [
            [
                0,
                53
            ],
            [
                53,
                134
            ],
            [
                135,
                176
            ],
            [
                176,
                231
            ],
            [
                231,
                232
            ],
            [
                233,
                302
            ],
            [
                303,
                307
            ],
            [
                307,
                372
            ],
            [
                372,
                407
            ],
            [
                413,
                453
            ],
            [
                453,
                467
            ],
            [
                468,
                470
            ],
            [
                471,
                480
            ],
            [
                492,
                553
            ],
            [
                563,
                594
            ],
            [
                598,
                611
            ],
            [
                612,
                618
            ],
            [
                619,
                621
            ],
            [
                627,
                660
            ],
            [
                661,
                683
            ],
            [
                690,
                697
            ],
            [
                697,
                710
            ],
            [
                711,
                723
            ],
            [
                724,
                754
            ],
            [
                757,
                801
            ],
            [
                804,
                816
            ],
            [
                817,
                838
            ],
            [
                838,
                890
            ],
            [
                891,
                981
            ],
            [
                982,
                985
            ],
            [
                996,
                1011
            ],
            [
                1012,
                1017
            ],
            [
                1018,
                1040
            ],
            [
                1040,
                1043
            ],
            [
                1049,
                1089
            ],
            [
                1093,
                1096
            ],
            [
                1097,
                1100
            ],
            [
                1101,
                1121
            ],
            [
                1138,
                1202
            ],
            [
                1203,
                1208
            ],
            [
                1213,
                1220
            ],
            [
                1220,
                1222
            ],
            [
                1222,
                1228
            ],
            [
                1229,
                1277
            ],
            [
                1278,
                1284
            ],
            [
                1285,
                1295
            ],
            [
                1296,
                1356
            ],
            [
                1357,
                1360
            ],
            [
                1361,
                1422
            ],
            [
                1427,
                1456
            ],
            [
                1458,
                1467
            ],
            [
                1477,
                1480
            ],
            [
                1481,
                1483
            ],
            [
                1486,
                1509
            ],
            [
                1517,
                1523
            ],
            [
                1524,
                1536
            ],
            [
                1541,
                1542
            ],
            [
                1550,
                1553
            ],
            [
                1554,
                1568
            ],
            [
                1569,
                1572
            ],
            [
                1584,
                1592
            ],
            [
                1592,
                1593
            ],
            [
                1594,
                1599
            ],
            [
                1600,
                1650
            ],
            [
                1651,
                1677
            ],
            [
                1677,
                1682
            ],
            [
                1682,
                1690
            ],
            [
                1699,
                1706
            ],
            [
                1714,
                1717
            ],
            [
                1717,
                1718
            ],
            [
                1719,
                1723
            ],
            [
                1724,
                1734
            ],
            [
                1735,
                1751
            ],
            [
                1751,
                1786
            ],
            [
                1786,
                1791
            ],
            [
                1792,
                1795
            ],
            [
                1796,
                1800
            ],
            [
                1801,
                1804
            ],
            [
                1805,
                1809
            ],
            [
                1809,
                1810
            ],
            [
                1811,
                1820
            ],
            [
                1827,
                1829
            ],
            [
                1830,
                1836
            ],
            [
                1836,
                1838
            ],
            [
                1838,
                1852
            ],
            [
                1852,
                1853
            ],
            [
                1854,
                1860
            ],
            [
                1868,
                1880
            ],
            [
                1880,
                1915
            ],
            [
                1916,
                1922
            ],
            [
                1922,
                1929
            ],
            [
                1930,
                1932
            ],
            [
                1933,
                1936
            ],
            [
                1960,
                1963
            ],
            [
                1968,
                1969
            ],
            [
                1970,
                1972
            ],
            [
                1973,
                1983
            ],
            [
                1989,
                2017
            ],
            [
                2024,
                2025
            ],
            [
                2026,
                2028
            ],
            [
                2029,
                2036
            ],
            [
                2037,
                2066
            ],
            [
                2067,
                2082
            ],
            [
                2086,
                2094
            ],
            [
                2096,
                2103
            ],
            [
                2104,
                2110
            ],
            [
                2111,
                2114
            ],
            [
                2115,
                2122
            ],
            [
                2122,
                2124
            ],
            [
                2124,
                2150
            ],
            [
                2156,
                2159
            ],
            [
                2173,
                2183
            ],
            [
                2184,
                2186
            ],
            [
                2187,
                2221
            ],
            [
                2221,
                2223
            ],
            [
                2223,
                2232
            ],
            [
                2233,
                2239
            ],
            [
                2240,
                2243
            ],
            [
                2244,
                2246
            ],
            [
                2247,
                2263
            ],
            [
                2264,
                2269
            ],
            [
                2269,
                2271
            ],
            [
                2271,
                2318
            ],
            [
                2319,
                2322
            ],
            [
                2323,
                2332
            ],
            [
                2336,
                2350
            ],
            [
                2352,
                2355
            ],
            [
                2356,
                2391
            ],
            [
                2391,
                2423
            ],
            [
                2423,
                2432
            ],
            [
                2433,
                2436
            ],
            [
                2437,
                2445
            ],
            [
                2446,
                2481
            ],
            [
                2481,
                2482
            ],
            [
                2483,
                2493
            ],
            [
                2494,
                2533
            ],
            [
                2533,
                2588
            ],
            [
                2589,
                2601
            ],
            [
                2606,
                2612
            ],
            [
                2613,
                2614
            ],
            [
                2621,
                2630
            ],
            [
                2636,
                2647
            ],
            [
                2660,
                2663
            ],
            [
                2664,
                2679
            ],
            [
                2680,
                2691
            ],
            [
                2691,
                2702
            ],
            [
                2703,
                2708
            ],
            [
                2708,
                2710
            ],
            [
                2710,
                2730
            ],
            [
                2730,
                2732
            ],
            [
                2732,
                2740
            ],
            [
                2742,
                2781
            ],
            [
                2781,
                2830
            ],
            [
                2830,
                2868
            ],
            [
                2869,
                2884
            ],
            [
                2887,
                2903
            ],
            [
                2903,
                2912
            ],
            [
                2912,
                2914
            ],
            [
                2914,
                2934
            ],
            [
                2934,
                2953
            ],
            [
                2956,
                2979
            ],
            [
                2979,
                2982
            ],
            [
                2982,
                3079
            ],
            [
                3079,
                3082
            ],
            [
                3082,
                3083
            ],
            [
                3083,
                3143
            ],
            [
                3143,
                3146
            ],
            [
                3147,
                3169
            ],
            [
                3169,
                3258
            ],
            [
                3265,
                3282
            ],
            [
                3282,
                3286
            ],
            [
                3286,
                3289
            ],
            [
                3289,
                3307
            ],
            [
                3308,
                3318
            ],
            [
                3319,
                3338
            ],
            [
                3341,
                3402
            ],
            [
                3402,
                3406
            ],
            [
                3412,
                3444
            ],
            [
                3444,
                3512
            ],
            [
                3514,
                3615
            ],
            [
                3618,
                3619
            ],
            [
                3619,
                3659
            ],
            [
                3659,
                3668
            ],
            [
                3668,
                3669
            ],
            [
                3673,
                3679
            ],
            [
                3680,
                3687
            ],
            [
                3687,
                3689
            ],
            [
                3689,
                3692
            ],
            [
                3695,
                3730
            ],
            [
                3730,
                3749
            ],
            [
                3759,
                3778
            ],
            [
                3780,
                3804
            ],
            [
                3807,
                3888
            ],
            [
                3888,
                3890
            ],
            [
                3890,
                3909
            ],
            [
                3912,
                3956
            ],
            [
                3957,
                3961
            ],
            [
                3962,
                3973
            ],
            [
                3973,
                3985
            ],
            [
                3987,
                4020
            ],
            [
                4024,
                4134
            ],
            [
                4134,
                4160
            ],
            [
                4160,
                4182
            ],
            [
                4182,
                4193
            ],
            [
                4206,
                4219
            ],
            [
                4222,
                4289
            ],
            [
                4289,
                4292
            ],
            [
                4293,
                4308
            ],
            [
                4308,
                4312
            ],
            [
                4318,
                4331
            ],
            [
                4334,
                4338
            ],
            [
                4346,
                4348
            ],
            [
                4351,
                4382
            ],
            [
                4382,
                4387
            ],
            [
                4388,
                4415
            ],
            [
                4429,
                4477
            ],
            [
                4478,
                4503
            ],
            [
                4503,
                4505
            ],
            [
                4506,
                4591
            ],
            [
                4591,
                4624
            ],
            [
                4629,
                4630
            ],
            [
                4631,
                4642
            ],
            [
                4643,
                4645
            ],
            [
                4645,
                4648
            ],
            [
                4648,
                4683
            ],
            [
                4683,
                4708
            ],
            [
                4710,
                4770
            ],
            [
                4770,
                4797
            ],
            [
                4797,
                4801
            ],
            [
                4807,
                4829
            ],
            [
                4830,
                4836
            ],
            [
                4836,
                4873
            ],
            [
                4876,
                4958
            ],
            [
                4959,
                4975
            ],
            [
                4975,
                5004
            ],
            [
                5011,
                5034
            ],
            [
                5035,
                5095
            ],
            [
                5101,
                5120
            ],
            [
                5126,
                5224
            ],
            [
                5225,
                5227
            ],
            [
                5228,
                5231
            ],
            [
                5237,
                5264
            ],
            [
                5264,
                5280
            ],
            [
                5281,
                5352
            ],
            [
                5352,
                5353
            ],
            [
                5354,
                5403
            ],
            [
                5404,
                5454
            ],
            [
                5454,
                5508
            ],
            [
                5518,
                5519
            ]
        ],
        "row_chars": [
            [
                0,
                53
            ],
            [
                53,
                176
            ],
            [
                176,
                233
            ],
            [
                233,
                233
            ],
            [
                233,
                372
            ],
            [
                372,
                453
            ],
            [
                453,
                453
            ],
            [
                453,
                553
            ],
            [
                553,
                553
            ],
            [
                553,
                553
            ],
            [
                553,
                553
            ],
            [
                553,
                553
            ],
            [
                553,
                661
            ],
            [
                661,
                661
            ],
            [
                661,
                697
            ],
            [
                697,
                838
            ],
            [
                838,
                1040
            ],
            [
                1040,
                1222
            ],
            [
                1222,
                1456
            ],
            [
                1456,
                1456
            ],
            [
                1456,
                1456
            ],
            [
                1456,
                1456
            ],
            [
                1456,
                1456
            ],
            [
                1456,
                1569
            ],
            [
                1569,
                1569
            ],
            [
                1569,
                1569
            ],
            [
                1569,
                1569
            ],
            [
                1569,
                1569
            ],
            [
                1569,
                1569
            ],
            [
                1569,
                1569
            ],
            [
                1569,
                1569
            ],
            [
                1569,
                1751
            ],
            [
                1751,
                1838
            ],
            [
                1838,
                1922
            ],
            [
                1922,
                1922
            ],
            [
                1922,
                1922
            ],
            [
                1922,
                1922
            ],
            [
                1922,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2026
            ],
            [
                2026,
                2124
            ],
            [
                2124,
                2223
            ],
            [
                2223,
                2271
            ],
            [
                2271,
                2271
            ],
            [
                2271,
                2271
            ],
            [
                2271,
                2391
            ],
            [
                2391,
                2423
            ],
            [
                2423,
                2483
            ],
            [
                2483,
                2533
            ],
            [
                2533,
                2680
            ],
            [
                2680,
                2680
            ],
            [
                2680,
                2691
            ],
            [
                2691,
                2710
            ],
            [
                2710,
                2732
            ],
            [
                2732,
                2742
            ],
            [
                2742,
                2781
            ],
            [
                2781,
                2781
            ],
            [
                2781,
                2781
            ],
            [
                2781,
                2781
            ],
            [
                2781,
                2781
            ],
            [
                2781,
                2781
            ],
            [
                2781,
                2781
            ],
            [
                2781,
                2781
            ],
            [
                2781,
                2781
            ],
            [
                2781,
                2830
            ],
            [
                2830,
                2887
            ],
            [
                2887,
                2887
            ],
            [
                2887,
                2887
            ],
            [
                2887,
                2903
            ],
            [
                2903,
                2914
            ],
            [
                2914,
                2934
            ],
            [
                2934,
                2956
            ],
            [
                2956,
                2982
            ],
            [
                2982,
                3082
            ],
            [
                3082,
                3146
            ],
            [
                3146,
                3146
            ],
            [
                3146,
                3169
            ],
            [
                3169,
                3282
            ],
            [
                3282,
                3289
            ],
            [
                3289,
                3341
            ],
            [
                3341,
                3402
            ],
            [
                3402,
                3444
            ],
            [
                3444,
                3514
            ],
            [
                3514,
                3514
            ],
            [
                3514,
                3514
            ],
            [
                3514,
                3618
            ],
            [
                3618,
                3659
            ],
            [
                3659,
                3689
            ],
            [
                3689,
                3730
            ],
            [
                3730,
                3780
            ],
            [
                3780,
                3780
            ],
            [
                3780,
                3890
            ],
            [
                3890,
                3890
            ],
            [
                3890,
                3912
            ],
            [
                3912,
                3912
            ],
            [
                3912,
                3973
            ],
            [
                3973,
                3987
            ],
            [
                3987,
                3987
            ],
            [
                3987,
                3987
            ],
            [
                3987,
                4023
            ],
            [
                4023,
                4023
            ],
            [
                4023,
                4134
            ],
            [
                4134,
                4160
            ],
            [
                4160,
                4182
            ],
            [
                4182,
                4222
            ],
            [
                4222,
                4222
            ],
            [
                4222,
                4289
            ],
            [
                4289,
                4308
            ],
            [
                4308,
                4334
            ],
            [
                4334,
                4334
            ],
            [
                4334,
                4334
            ],
            [
                4334,
                4505
            ],
            [
                4505,
                4505
            ],
            [
                4505,
                4505
            ],
            [
                4505,
                4505
            ],
            [
                4505,
                4591
            ],
            [
                4591,
                4648
            ],
            [
                4648,
                4683
            ],
            [
                4683,
                4770
            ],
            [
                4770,
                4797
            ],
            [
                4797,
                4836
            ],
            [
                4836,
                4836
            ],
            [
                4836,
                4876
            ],
            [
                4876,
                4876
            ],
            [
                4876,
                4959
            ],
            [
                4959,
                4959
            ],
            [
                4959,
                4975
            ],
            [
                4975,
                5005
            ],
            [
                5005,
                5005
            ],
            [
                5005,
                5005
            ],
            [
                5005,
                5005
            ],
            [
                5005,
                5098
            ],
            [
                5098,
                5098
            ],
            [
                5098,
                5098
            ],
            [
                5098,
                5264
            ],
            [
                5264,
                5454
            ],
            [
                5454,
                5519
            ]
        ]
    }
}