{
    "original": {
        "text": "On the night of Lady Monk's party, Burgo Fitzgerald disappeared; and when the guests were gone and the rooms were empty, his aunt inquired for him in vain. The old butler and factotum of the house, who was employed by Sir Cosmo to put out the lamps and to see that he was not robbed beyond a certain point on these occasions of his wife's triumphs, was interrogated by his mistress, and said that he thought Mr. Burgo had left the house. Lady Monk herself knocked at her nephew's door, when she went up-stairs, ascending an additional flight of stairs with her weary old limbs in order that she might do so; she even opened the door and saw the careless debris of his toilet about the room. But he was gone. \"Perhaps, after all, he has arranged it,\" she said to herself, as she went down to her own room.\nBut Burgo, as we know, had not \"arranged it.\" It may be remembered that when Mr. Palliser came back to his wife in the supper-room at Lady Monk's, bringing with him the scarf which Lady Glencora had left up-stairs, Burgo was no longer with her. He had become well aware that he had no chance left, at any rate for that night. The poor fool, acting upon his aunt's implied advice rather than his own hopes, had secured a post-chaise, and stationed it in Bruton Street, some five minutes' walk from his aunt's house. And he had purchased feminine wrappings, cloaks, &c.--things that he thought might be necessary for his companion. He had, too, ordered rooms at the new hotel near the Dover Station,--the London Bridge Station,--from whence was to start on the following morning a train to catch the tidal boat for Boulogne. There was a dressing-bag there for which he had paid twenty-five guineas out of his aunt's money, not having been able to induce the tradesman to grant it to him on credit; and there were other things,--slippers, collars, stockings, handkerchiefs, and what else might, as he thought, under such circumstances be most necessary. Poor thoughtful, thoughtless fool!\nThe butler was right. He did leave the house. He saw Lady Glencora taken to her carriage from some back hiding-place in the hall, and then slipped out, unmindful of his shining boots, and dress coat and jewelled studs. He took a Gibus hat,--his own, or that of some other unfortunate,--and slowly made his way down to the place in Bruton Street. There was the carriage and pair of horses, all in readiness; and the driver, when he had placed himself by the door of the vehicle, was not long in emerging from the neighbouring public-house. \"All ready, your honour,\" said the man. \"I shan't want you to-night,\" said Burgo, hoarsely;--\"go away.\" \"And about the things, your honour?\" \"Take them to the devil. No; stop. Take them back with you, and ask somebody to keep them till I send for them. I shall want them and another carriage in a day or two.\" Then he gave the man half a sovereign, and went away, not looking at the little treasures which he had spent so much of his money in selecting for his love. When he was gone, the waterman and the driver turned them over with careful hands and gloating eyes. \"It's a 'eiress, I'll go bail,\" said the waterman. \"Pretty dear! I suppose her parints was too many for her,\" said the driver. But neither of them imagined the enormity which the hirer of the chaise had in truth contemplated.\nBurgo from thence took his way back into Grosvenor Square, and from thence down Park Street, and through a narrow passage and a mews which there are in those parts, into Park Lane. He had now passed the position of Mr. Palliser's house, having come out on Park Lane at a spot nearer to Piccadilly; but he retraced his steps, walking along by the rails of the Park, till he found himself opposite to the house. Then he stood there, leaning back upon the railings, and looking up at Lady Glencora's windows. What did he expect to see? Or was he, in truth, moved by love of that kind which can take joy in watching the slightest shadow that is made by the one loved object,--that may be made by her, or, by some violent conjecture of the mind, may be supposed to have been so made? Such love as that is, I think, always innocent. Burgo Fitzgerald did not love like that. I almost doubt whether he can be said to have loved at all. There was in his breast a mixed, feverish desire, which he took no trouble to analyse. He wanted money. He wanted the thing of which this Palliser had robbed him. He wanted revenge,--though his desire for that was not a burning desire. And among other things, he wanted the woman's beauty of the woman whom he coveted. He wanted to kiss her again as he had once kissed her, and to feel that she was soft, and lovely, and loving for him. But as for seeing her shadow, unless its movement indicated some purpose in his favour,--I do not think that he cared much about that.\nAnd why then was he there? Because in his unreasoning folly he did not know what step to take, or what step not to take. There are men whose energies hardly ever carry them beyond looking for the thing they want. She might see him from the window, and come to him. I do not say that he thought that it would be so. I fancy that he never thought at all about that or about anything. If you lie under a tree, and open your mouth, a plum may fall into it. It was probably an undefined idea of some such chance as this which brought him against the railings in the front of Mr. Palliser's house; that, and a feeling made up partly of despair and partly of lingering romance that he was better there, out in the night air, under the gas-lamps, than he could be elsewhere. There he stood and looked, and cursed his ill-luck. But his curses had none of the bitterness of those which George Vavasor was always uttering. Through it all there remained about Burgo one honest feeling,--one conviction that was true,--a feeling that it all served him right, and that he had better, perhaps, go to the devil at once, and give nobody any more trouble. If he loved no one sincerely, neither did he hate any one; and whenever he made any self-inquiry into his own circumstances, he always told himself that it was all his own fault. When he cursed his fate, he only did so because cursing is so easy. George Vavasor would have ground his victims up to powder if he knew how; but Burgo Fitzgerald desired to hurt no one.\nThere he stood till he was cold, and then, as the plum did not drop into his mouth, he moved on. He went up into Oxford Street, and walked along it the whole distance to the corner of Bond Street, passing by Grosvenor Square, to which he intended to return. At the corner of Bond Street, a girl took hold of him, and looked up into his face. \"Ah!\" she said, \"I saw you once before.\"--\"Then you saw the most miserable devil alive,\" said Burgo. \"You can't be miserable,\" said the girl. \"What makes you miserable? You've plenty of money.\"--\"I wish I had,\" said Burgo. \"And plenty to eat and drink,\" exclaimed the girl; \"and you are so handsome! I remember you. You gave me supper one night when I was starving. I ain't hungry now. Will you give me a kiss?\"--\"I'll give you a shilling, and that's better,\" said Burgo. \"But give me a kiss too,\" said the girl. He gave her first the kiss, and then the shilling, and after that he left her and passed on. \"I'm d----d if I wouldn't change with her!\" he said to himself. \"I wonder whether anything really ails him?\" thought the girl. \"He said he was wretched before. Shouldn't I like to be good to such a one as him!\"\nBurgo went on, and made his way into the house in Grosvenor Square, by some means probably unknown to his aunt, and certainly unknown to his uncle. He emptied his pockets as he got into bed, and counted a roll of notes which he had kept in one of them. There were still a hundred and thirty pounds left. Lady Glencora had promised that she would see him again. She had said as much as that quite distinctly. But what use would there be in that if all his money should then be gone? He knew that the keeping of money in his pocket was to him quite an impossibility. Then he thought of his aunt. What should he say to his aunt if he saw her in the course of the coming day? Might it not be as well for him to avoid his aunt altogether?\nHe breakfasted up-stairs in his bedroom,--in the bed, indeed, eating a small pat de foie gras from the supper-table, as he read a French novel. There he was still reading his French novel in bed when his aunt's maid came to him, saying that his aunt wished to see him before she went out. \"Tell me, Lucy,\" said he, \"how is the old girl?\"\n\"She's as cross as cross, Mr. Burgo. Indeed, I shan't;--not a minute longer. Don't, now; will you? I tell you she's waiting for me.\" From which it may be seen that Lucy shared the general feminine feeling in favour of poor Burgo.\nThus summoned Burgo applied himself to his toilet; but as he did so, he recruited his energies from time to time by a few pages of the French novel, and also by small doses from a bottle of curaoa which he had in his bedroom. He was utterly a pauper. There was no pauper poorer than he in London that day. But, nevertheless, he breakfasted on pat de foie gras and curaoa, and regarded those dainties very much as other men regard bread and cheese and beer.\nBut though he was dressing at the summons of his aunt, he had by no means made up his mind that he would go to her. Why should he go to her? What good would it do him? She would not give him more money. She would only scold him for his misconduct. She might, perhaps, turn him out of the house if he did not obey her,--or attempt to do so; but she would be much more likely to do this when he had made her angry by contradicting her. In neither case would he leave the house, even though its further use were positively forbidden him, because his remaining there was convenient; but as he could gain nothing by seeing \"the old girl,\" as he had called her, he resolved to escape to his club without attending to her summons.\nBut his aunt, who was a better general than he, out-manoeuvred him. He crept down the back stairs; but as he could not quite condescend to escape through the area, he was forced to emerge upon the hall, and here his aunt pounced upon him, coming out of the breakfast-parlour. \"Did not Lucy tell you that I wanted to see you?\" Lady Monk asked, with severity in her voice.\nBurgo replied, with perfect ease, that he was going out just to have his hair washed and brushed. He would have been back in twenty minutes. There was no energy about the poor fellow, unless, perhaps, when he was hunting; but he possessed a readiness which enabled him to lie at a moment's notice with the most perfect ease. Lady Monk did not believe him; but she could not confute him, and therefore she let the lie pass.\n\"Never mind your hair now,\" she said. \"I want to speak to you. Come in here for a few minutes.\"\nAs there was no way of escape left to him, he followed his aunt into the breakfast-parlour.\n\"Burgo,\" she said, when she had seated herself, and had made him sit in a chair opposite to her, \"I don't think you will ever do any good.\"\n\"I don't much think I shall, aunt.\"\n\"What do you mean, then, to do with yourself?\"\n\"Oh,--I don't know. I haven't thought much about it.\"\n\"You can't stay here in this house. Sir Cosmo was speaking to me about you only yesterday morning.\"\n\"I shall be quite willing to go down to Monkshade, if Sir Cosmo likes it better;--that is, when the season is a little more through.\"\n\"He won't have you at Monkshade. He won't let you go there again. And he won't have you here. You know that you are turning what I say into joke.\"\n\"No, indeed, aunt,\"\n\"Yes, you are;--you know you are. You are the most ungrateful, heartless creature I ever met. You must make up your mind to leave this house at once.\"\n\"Where does Sir Cosmo mean that I should go, then?\"\n\"To the workhouse, if you like. He doesn't care.\"\n\"I don't suppose he does;--the least in the world,\" said Burgo, opening his eyes, and stretching his nostrils, and looking into his aunt's face as though he had great ground for indignation.\nBut the turning of Burgo out of the house was not Lady Monk's immediate purpose. She knew that he would hang on there till the season was over. After that he must not be allowed to return again, unless he should have succeeded in a certain enterprise. She had now caught him in order that she might learn whether there was any possible remaining chance of success as to that enterprise. So she received his indignation in silence, and began upon another subject. \"What a fool you made of yourself last night, Burgo!\"\n\"Did I;--more of a fool than usual?\"\n\"I believe that you will never be serious about anything. Why did you go on waltzing in that way when every pair of eyes in the room was watching you?\"\n\"I couldn't help going on, if she liked it.\"\n\"Oh, yes,--say it was her fault. That's so like a man!\"\n\"Look here, aunt, I'm not going to sit here and be abused. I couldn't take her in my arms, and fly away with her out of a crowd.\"\n\"Who wants you to fly away with her?\"\n\"For the matter of that, I suppose that you do.\"\n\"No, I don't.\"\n\"Well, then, I do.\"\n\"You! you haven't spirit to do that, or anything else. You are like a child that is just able to amuse itself for the moment, and never can think of anything further. You simply disgraced yourself last night, and me too,--and her; but, of course, you care nothing about that.\"\n\"I had a plan all ready;--only he came back.\"\n\"Of course he came back. Of course he came back, when they sent him word how you and she were going on. And now he will have forgiven her, and after that, of course, the thing will be all over.\"\n\"I tell you what, aunt; she would go if she knew how. When I was forced to leave her last night, she promised to see me again. And as for being idle, and not doing anything;--why, I was out in Park Lane last night, after you were in bed.\"\n\"What good did that do?\"\n\"It didn't do any good, as it happened. But a fellow can only try. I believe, after all, it would be easier down in the country,--especially now that he has taken it into his head to look after her.\"\nLady Monk sat silent for a few moments, and then she said in a low voice, \"What did she say to you when you were parting? What were her exact words?\" She, at any rate, was not deficient in energy. She was anxious enough to see her purpose accomplished. She would have conducted the matter with discretion, if the running away with Mr. Palliser's wife could, in very fact, have been done by herself.\n\"She said she would see me again. She promised it twice.\"\n\"And was that all?\"\n\"What could she say more, when she was forced to go away?\"\n\"Had she said that she would go with you?\"\n\"I had asked her,--half a dozen times, and she did not once refuse. I know she means it, if she knew how to get away. She hates him;--I'm sure of it. A woman, you know, wouldn't absolutely say that she would go, till she was gone.\"\n\"If she really meant it, she would tell you.\"\n\"I don't think she could have told me plainer. She said she would see me again. She said that twice over.\"\nAgain Lady Monk sat silent. She had a plan in her head,--a plan that might, as she thought, give to her nephew one more chance. But she hesitated before she could bring herself to explain it in detail. At first she had lent a little aid to this desired abduction of Mr. Palliser's wife, but in lending it had said no word upon the subject. During the last season she had succeeded in getting Lady Glencora to her house in London, and had taken care that Burgo should meet her there. Then a hint or two had been spoken, and Lady Glencora had been asked to Monkshade. Lady Glencora, as we know, did not go to Monkshade, and Lady Monk had then been baffled. But she did not therefore give up the game. Having now thought of it so much, she began to speak of it more boldly, and had procured money for her nephew that he might thereby be enabled to carry off the woman. But though this had been well understood between them, though words had been spoken which were sufficiently explicit, the plan had not been openly discussed. Lady Monk had known nothing of the mode in which Lady Glencora was to have been carried off after her party, nor whither she was to have been taken. But now,--now she must arrange it herself, and have a scheme of her own, or else the thing must fail absolutely. Even she was almost reluctant to speak out plainly to her nephew on such a subject. What if he should be false to her, and tell of her? But when a woman has made such schemes, nothing distresses her so sadly as their failure. She would risk all rather than that Mr. Palliser should keep his wife.\n\"I will try and help you,\" she said at last, speaking hoarsely, almost in a whisper, \"if you have courage to make an attempt yourself.\"\n\"Courage!\" said he \"What is it you think I am afraid of? Mr. Palliser? I'd fight him,--or all the Pallisers, one after another, if it would do any good.\"\n\"Fighting! There's no fighting wanted, as you know well enough. Men don't fight nowadays. Look here! If you can get her to call here some day,--say on Thursday, at three o'clock,--I will be here to receive her; and instead of going back into her carriage, you can have a cab for her somewhere near. She can come, as it were, to make a morning call.\"\n\"A cab!\"\n\"Yes; a cab won't kill her, and it is less easily followed than a carriage.\"\n\"And where shall we go?\"\n\"There is a train to Southampton at four, and the boat sails for Jersey at half-past six; you will be in Jersey the next morning, and there is a boat goes on to St. Malo, almost at once. You can go direct from one boat to the other,--that is, if she has strength and courage.\" After that, who will say that Lady Monk was not a devoted aunt?\n\"That would do excellently well,\" said the enraptured Burgo.\n\"She will have difficulty in getting away from me, out of the house. Of course I shall say nothing about it, and shall know nothing about it. She had better tell her coachman to drive somewhere to pick some one up, and to return;--out somewhere to Tyburnia, or down to Pimlico. Then she can leave me, and go out on foot, to where you have the cab. She can tell the hall-porter that she will walk to her carriage. Do you understand?\" Burgo declared that he did understand.\n\"You must call on her, and make your way in, and see her, and arrange all this. It must be a Thursday, because of the boats.\" Then she made inquiry about his money, and took from him the notes which he had, promising to return them, with something added, on the Thursday morning; but he asked, with a little whine, for a five-pound note, and got it. Burgo then told her about the travelling-bags and the stockings, and they were quite pleasant and confidential. \"Bid her come in a stout travelling-dress,\" said Lady Monk. \"She can wear some lace or something over it, so that the servants won't observe it. I will take no notice of it.\" Was there ever such an aunt?\nAfter this, Burgo left his aunt, and went away to his club, in a state of most happy excitement.",
        "paragraph_chars": [
            [
                0,
                805
            ],
            [
                805,
                1991
            ],
            [
                1991,
                3324
            ],
            [
                3324,
                4824
            ],
            [
                4824,
                6328
            ],
            [
                6328,
                7487
            ],
            [
                7487,
                8221
            ],
            [
                8221,
                8559
            ],
            [
                8559,
                8789
            ],
            [
                8789,
                9246
            ],
            [
                9246,
                9970
            ],
            [
                9970,
                10341
            ],
            [
                10341,
                10764
            ],
            [
                10764,
                10860
            ],
            [
                10860,
                10952
            ],
            [
                10952,
                11092
            ],
            [
                11092,
                11128
            ],
            [
                11128,
                11175
            ],
            [
                11175,
                11229
            ],
            [
                11229,
                11329
            ],
            [
                11329,
                11463
            ],
            [
                11463,
                11610
            ],
            [
                11610,
                11630
            ],
            [
                11630,
                11781
            ],
            [
                11781,
                11833
            ],
            [
                11833,
                11883
            ],
            [
                11883,
                12074
            ],
            [
                12074,
                12591
            ],
            [
                12591,
                12628
            ],
            [
                12628,
                12780
            ],
            [
                12780,
                12825
            ],
            [
                12825,
                12881
            ],
            [
                12881,
                13011
            ],
            [
                13011,
                13049
            ],
            [
                13049,
                13098
            ],
            [
                13098,
                13113
            ],
            [
                13113,
                13133
            ],
            [
                13133,
                13410
            ],
            [
                13410,
                13456
            ],
            [
                13456,
                13651
            ],
            [
                13651,
                13890
            ],
            [
                13890,
                13915
            ],
            [
                13915,
                14115
            ],
            [
                14115,
                14514
            ],
            [
                14514,
                14572
            ],
            [
                14572,
                14592
            ],
            [
                14592,
                14651
            ],
            [
                14651,
                14694
            ],
            [
                14694,
                14926
            ],
            [
                14926,
                14972
            ],
            [
                14972,
                15079
            ],
            [
                15079,
                16662
            ],
            [
                16662,
                16798
            ],
            [
                16798,
                16952
            ],
            [
                16952,
                17302
            ],
            [
                17302,
                17311
            ],
            [
                17311,
                17388
            ],
            [
                17388,
                17413
            ],
            [
                17413,
                17754
            ],
            [
                17754,
                17815
            ],
            [
                17815,
                18287
            ],
            [
                18287,
                18953
            ],
            [
                18953,
                19049
            ]
        ],
        "segment_chars": [
            [
                0,
                156
            ],
            [
                156,
                438
            ],
            [
                438,
                691
            ],
            [
                691,
                708
            ],
            [
                708,
                805
            ],
            [
                805,
                851
            ],
            [
                851,
                1050
            ],
            [
                1050,
                1131
            ],
            [
                1131,
                1320
            ],
            [
                1320,
                1435
            ],
            [
                1435,
                1628
            ],
            [
                1628,
                1956
            ],
            [
                1956,
                1991
            ],
            [
                1991,
                2013
            ],
            [
                2013,
                2037
            ],
            [
                2037,
                2210
            ],
            [
                2210,
                2337
            ],
            [
                2337,
                2530
            ],
            [
                2530,
                2570
            ],
            [
                2570,
                2634
            ],
            [
                2634,
                2671
            ],
            [
                2671,
                2696
            ],
            [
                2696,
                2706
            ],
            [
                2706,
                2783
            ],
            [
                2783,
                2840
            ],
            [
                2840,
                2997
            ],
            [
                2997,
                3098
            ],
            [
                3098,
                3149
            ],
            [
                3149,
                3163
            ],
            [
                3163,
                3225
            ],
            [
                3225,
                3324
            ],
            [
                3324,
                3505
            ],
            [
                3505,
                3734
            ],
            [
                3734,
                3830
            ],
            [
                3830,
                3857
            ],
            [
                3857,
                4103
            ],
            [
                4103,
                4151
            ],
            [
                4151,
                4192
            ],
            [
                4192,
                4252
            ],
            [
                4252,
                4339
            ],
            [
                4339,
                4356
            ],
            [
                4356,
                4415
            ],
            [
                4415,
                4488
            ],
            [
                4488,
                4571
            ],
            [
                4571,
                4689
            ],
            [
                4689,
                4824
            ],
            [
                4824,
                4851
            ],
            [
                4851,
                4945
            ],
            [
                4945,
                5037
            ],
            [
                5037,
                5089
            ],
            [
                5089,
                5139
            ],
            [
                5139,
                5206
            ],
            [
                5206,
                5277
            ],
            [
                5277,
                5591
            ],
            [
                5591,
                5643
            ],
            [
                5643,
                5736
            ],
            [
                5736,
                5962
            ],
            [
                5962,
                6141
            ],
            [
                6141,
                6209
            ],
            [
                6209,
                6328
            ],
            [
                6328,
                6425
            ],
            [
                6425,
                6586
            ],
            [
                6586,
                6670
            ],
            [
                6670,
                6676
            ],
            [
                6676,
                6710
            ],
            [
                6710,
                6771
            ],
            [
                6771,
                6812
            ],
            [
                6812,
                6839
            ],
            [
                6839,
                6863
            ],
            [
                6863,
                6893
            ],
            [
                6893,
                6970
            ],
            [
                6970,
                6986
            ],
            [
                6986,
                7036
            ],
            [
                7036,
                7056
            ],
            [
                7056,
                7081
            ],
            [
                7081,
                7142
            ],
            [
                7142,
                7183
            ],
            [
                7183,
                7276
            ],
            [
                7276,
                7320
            ],
            [
                7320,
                7340
            ],
            [
                7340,
                7385
            ],
            [
                7385,
                7403
            ],
            [
                7403,
                7436
            ],
            [
                7436,
                7487
            ],
            [
                7487,
                7635
            ],
            [
                7635,
                7740
            ],
            [
                7740,
                7791
            ],
            [
                7791,
                7848
            ],
            [
                7848,
                7895
            ],
            [
                7895,
                7969
            ],
            [
                7969,
                8052
            ],
            [
                8052,
                8081
            ],
            [
                8081,
                8159
            ],
            [
                8159,
                8221
            ],
            [
                8221,
                8365
            ],
            [
                8365,
                8510
            ],
            [
                8510,
                8559
            ],
            [
                8559,
                8596
            ],
            [
                8596,
                8636
            ],
            [
                8636,
                8658
            ],
            [
                8658,
                8692
            ],
            [
                8692,
                8789
            ],
            [
                8789,
                9015
            ],
            [
                9015,
                9040
            ],
            [
                9040,
                9095
            ],
            [
                9095,
                9246
            ],
            [
                9246,
                9362
            ],
            [
                9362,
                9387
            ],
            [
                9387,
                9414
            ],
            [
                9414,
                9449
            ],
            [
                9449,
                9494
            ],
            [
                9494,
                9680
            ],
            [
                9680,
                9970
            ],
            [
                9970,
                10038
            ],
            [
                10038,
                10246
            ],
            [
                10246,
                10296
            ],
            [
                10296,
                10341
            ],
            [
                10341,
                10439
            ],
            [
                10439,
                10482
            ],
            [
                10482,
                10666
            ],
            [
                10666,
                10764
            ],
            [
                10764,
                10802
            ],
            [
                10802,
                10827
            ],
            [
                10827,
                10860
            ],
            [
                10860,
                10952
            ],
            [
                10952,
                11092
            ],
            [
                11092,
                11128
            ],
            [
                11128,
                11175
            ],
            [
                11175,
                11195
            ],
            [
                11195,
                11229
            ],
            [
                11229,
                11265
            ],
            [
                11265,
                11329
            ],
            [
                11329,
                11463
            ],
            [
                11463,
                11496
            ],
            [
                11496,
                11529
            ],
            [
                11529,
                11557
            ],
            [
                11557,
                11610
            ],
            [
                11610,
                11630
            ],
            [
                11630,
                11664
            ],
            [
                11664,
                11724
            ],
            [
                11724,
                11781
            ],
            [
                11781,
                11833
            ],
            [
                11833,
                11865
            ],
            [
                11865,
                11883
            ],
            [
                11883,
                12074
            ],
            [
                12074,
                12155
            ],
            [
                12155,
                12218
            ],
            [
                12218,
                12326
            ],
            [
                12326,
                12461
            ],
            [
                12461,
                12537
            ],
            [
                12537,
                12591
            ],
            [
                12591,
                12628
            ],
            [
                12628,
                12686
            ],
            [
                12686,
                12780
            ],
            [
                12780,
                12825
            ],
            [
                12825,
                12858
            ],
            [
                12858,
                12881
            ],
            [
                12881,
                12940
            ],
            [
                12940,
                13011
            ],
            [
                13011,
                13049
            ],
            [
                13049,
                13098
            ],
            [
                13098,
                13113
            ],
            [
                13113,
                13133
            ],
            [
                13133,
                13139
            ],
            [
                13139,
                13188
            ],
            [
                13188,
                13300
            ],
            [
                13300,
                13410
            ],
            [
                13410,
                13456
            ],
            [
                13456,
                13481
            ],
            [
                13481,
                13560
            ],
            [
                13560,
                13651
            ],
            [
                13651,
                13705
            ],
            [
                13705,
                13778
            ],
            [
                13778,
                13890
            ],
            [
                13890,
                13915
            ],
            [
                13915,
                13955
            ],
            [
                13955,
                13982
            ],
            [
                13982,
                14115
            ],
            [
                14115,
                14237
            ],
            [
                14237,
                14265
            ],
            [
                14265,
                14312
            ],
            [
                14312,
                14368
            ],
            [
                14368,
                14514
            ],
            [
                14514,
                14548
            ],
            [
                14548,
                14572
            ],
            [
                14572,
                14592
            ],
            [
                14592,
                14651
            ],
            [
                14651,
                14694
            ],
            [
                14694,
                14762
            ],
            [
                14762,
                14812
            ],
            [
                14812,
                14844
            ],
            [
                14844,
                14926
            ],
            [
                14926,
                14972
            ],
            [
                14972,
                15019
            ],
            [
                15019,
                15052
            ],
            [
                15052,
                15079
            ],
            [
                15079,
                15107
            ],
            [
                15107,
                15207
            ],
            [
                15207,
                15281
            ],
            [
                15281,
                15419
            ],
            [
                15419,
                15562
            ],
            [
                15562,
                15645
            ],
            [
                15645,
                15734
            ],
            [
                15734,
                15778
            ],
            [
                15778,
                15945
            ],
            [
                15945,
                16103
            ],
            [
                16103,
                16252
            ],
            [
                16252,
                16365
            ],
            [
                16365,
                16449
            ],
            [
                16449,
                16501
            ],
            [
                16501,
                16591
            ],
            [
                16591,
                16662
            ],
            [
                16662,
                16798
            ],
            [
                16798,
                16809
            ],
            [
                16809,
                16855
            ],
            [
                16855,
                16869
            ],
            [
                16869,
                16952
            ],
            [
                16952,
                16963
            ],
            [
                16963,
                17016
            ],
            [
                17016,
                17042
            ],
            [
                17042,
                17053
            ],
            [
                17053,
                17251
            ],
            [
                17251,
                17302
            ],
            [
                17302,
                17311
            ],
            [
                17311,
                17388
            ],
            [
                17388,
                17413
            ],
            [
                17413,
                17600
            ],
            [
                17600,
                17690
            ],
            [
                17690,
                17754
            ],
            [
                17754,
                17815
            ],
            [
                17815,
                17884
            ],
            [
                17884,
                17957
            ],
            [
                17957,
                18093
            ],
            [
                18093,
                18163
            ],
            [
                18163,
                18228
            ],
            [
                18228,
                18248
            ],
            [
                18248,
                18287
            ],
            [
                18287,
                18367
            ],
            [
                18367,
                18413
            ],
            [
                18413,
                18637
            ],
            [
                18637,
                18749
            ],
            [
                18749,
                18809
            ],
            [
                18809,
                18894
            ],
            [
                18894,
                18924
            ],
            [
                18924,
                18953
            ],
            [
                18953,
                19049
            ]
        ],
        "overlap_chars": [
            [
                0,
                94
            ],
            [
                119,
                156
            ],
            [
                156,
                170
            ],
            [
                387,
                438
            ],
            [
                438,
                447
            ],
            [
                495,
                499
            ],
            [
                467,
                485
            ],
            [
                633,
                667
            ],
            [
                675,
                691
            ],
            [
                691,
                707
            ],
            [
                708,
                769
            ],
            [
                803,
                805
            ],
            [
                805,
                851
            ],
            [
                851,
                935
            ],
            [
                950,
                960
            ],
            [
                974,
                979
            ],
            [
                1018,
                1050
            ],
            [
                1050,
                1063
            ],
            [
                1069,
                1131
            ],
            [
                1131,
                1152
            ],
            [
                1158,
                1183
            ],
            [
                1209,
                1214
            ],
            [
                1223,
                1272
            ],
            [
                1278,
                1296
            ],
            [
                1318,
                1320
            ],
            [
                1320,
                1330
            ],
            [
                1341,
                1349
            ],
            [
                1361,
                1367
            ],
            [
                1374,
                1435
            ],
            [
                1435,
                1441
            ],
            [
                1456,
                1468
            ],
            [
                1473,
                1502
            ],
            [
                1532,
                1536
            ],
            [
                1582,
                1589
            ],
            [
                1544,
                1581
            ],
            [
                1590,
                1602
            ],
            [
                1609,
                1628
            ],
            [
                1628,
                1700
            ],
            [
                1705,
                1725
            ],
            [
                1801,
                1828
            ],
            [
                1831,
                1889
            ],
            [
                1900,
                1910
            ],
            [
                1890,
                1895
            ],
            [
                1937,
                1956
            ],
            [
                1956,
                1991
            ],
            [
                1991,
                2013
            ],
            [
                2013,
                2037
            ],
            [
                2037,
                2079
            ],
            [
                2119,
                2142
            ],
            [
                2277,
                2308
            ],
            [
                2322,
                2337
            ],
            [
                2337,
                2359
            ],
            [
                2396,
                2412
            ],
            [
                2494,
                2502
            ],
            [
                2516,
                2529
            ],
            [
                2570,
                2588
            ],
            [
                2597,
                2620
            ],
            [
                2634,
                2638
            ],
            [
                2639,
                2670
            ],
            [
                2671,
                2696
            ],
            [
                2696,
                2706
            ],
            [
                2706,
                2783
            ],
            [
                2783,
                2840
            ],
            [
                2840,
                2892
            ],
            [
                2995,
                2996
            ],
            [
                3330,
                3334
            ],
            [
                3463,
                3468
            ],
            [
                3324,
                3329
            ],
            [
                3355,
                3386
            ],
            [
                3399,
                3456
            ],
            [
                3489,
                3505
            ],
            [
                3505,
                3507
            ],
            [
                3657,
                3662
            ],
            [
                3666,
                3719
            ],
            [
                3523,
                3526
            ],
            [
                3543,
                3551
            ],
            [
                3727,
                3734
            ],
            [
                3734,
                3762
            ],
            [
                3773,
                3830
            ],
            [
                3830,
                3857
            ],
            [
                3864,
                3866
            ],
            [
                3860,
                3863
            ],
            [
                4172,
                4175
            ],
            [
                3884,
                3891
            ],
            [
                4250,
                4252
            ],
            [
                4276,
                4339
            ],
            [
                4339,
                4356
            ],
            [
                4356,
                4415
            ],
            [
                4415,
                4432
            ],
            [
                4486,
                4488
            ],
            [
                4488,
                4491
            ],
            [
                4512,
                4540
            ],
            [
                4569,
                4571
            ],
            [
                4571,
                4655
            ],
            [
                4669,
                4679
            ],
            [
                4687,
                4688
            ],
            [
                4859,
                4917
            ],
            [
                4943,
                4945
            ],
            [
                5107,
                5109
            ],
            [
                5102,
                5106
            ],
            [
                5037,
                5087
            ],
            [
                5118,
                5122
            ],
            [
                5206,
                5229
            ],
            [
                5250,
                5262
            ],
            [
                5268,
                5272
            ],
            [
                5240,
                5250
            ],
            [
                5275,
                5277
            ],
            [
                5597,
                5641
            ],
            [
                5662,
                5687
            ],
            [
                5700,
                5714
            ],
            [
                5734,
                5736
            ],
            [
                5772,
                5777
            ],
            [
                5778,
                5796
            ],
            [
                5830,
                5847
            ],
            [
                5852,
                5885
            ],
            [
                5894,
                5901
            ],
            [
                5886,
                5892
            ],
            [
                5903,
                5962
            ],
            [
                5962,
                6011
            ],
            [
                6139,
                6141
            ],
            [
                6141,
                6208
            ],
            [
                6328,
                6425
            ],
            [
                6425,
                6472
            ],
            [
                6495,
                6523
            ],
            [
                6584,
                6586
            ],
            [
                6616,
                6669
            ],
            [
                6670,
                6676
            ],
            [
                6676,
                6710
            ],
            [
                6712,
                6770
            ],
            [
                6771,
                6812
            ],
            [
                6839,
                6863
            ],
            [
                6865,
                6892
            ],
            [
                6986,
                7036
            ],
            [
                7036,
                7056
            ],
            [
                7056,
                7081
            ],
            [
                7083,
                7141
            ],
            [
                7142,
                7183
            ],
            [
                7183,
                7237
            ],
            [
                7249,
                7275
            ],
            [
                7506,
                7568
            ],
            [
                7578,
                7597
            ],
            [
                7633,
                7635
            ],
            [
                7635,
                7705
            ],
            [
                7724,
                7740
            ],
            [
                7740,
                7791
            ],
            [
                7791,
                7848
            ],
            [
                7895,
                7913
            ],
            [
                7926,
                7930
            ],
            [
                7920,
                7922
            ],
            [
                7931,
                7969
            ],
            [
                7969,
                7981
            ],
            [
                7986,
                7993
            ],
            [
                7997,
                8002
            ],
            [
                8017,
                8020
            ],
            [
                8024,
                8027
            ],
            [
                8050,
                8051
            ],
            [
                8052,
                8081
            ],
            [
                8081,
                8102
            ],
            [
                8122,
                8125
            ],
            [
                8129,
                8132
            ],
            [
                8154,
                8159
            ],
            [
                8159,
                8182
            ],
            [
                8191,
                8199
            ],
            [
                8209,
                8221
            ],
            [
                8221,
                8235
            ],
            [
                8246,
                8261
            ],
            [
                8349,
                8365
            ],
            [
                8371,
                8383
            ],
            [
                8365,
                8370
            ],
            [
                8416,
                8488
            ],
            [
                8508,
                8509
            ],
            [
                8510,
                8559
            ],
            [
                8559,
                8594
            ],
            [
                8803,
                8838
            ],
            [
                8856,
                8857
            ],
            [
                8884,
                8901
            ],
            [
                8905,
                8946
            ],
            [
                8950,
                8982
            ],
            [
                8984,
                8985
            ],
            [
                8982,
                8984
            ],
            [
                9013,
                9015
            ],
            [
                9301,
                9336
            ],
            [
                9351,
                9356
            ],
            [
                9291,
                9299
            ],
            [
                9360,
                9362
            ],
            [
                9362,
                9375
            ],
            [
                9385,
                9387
            ],
            [
                9449,
                9473
            ],
            [
                9492,
                9494
            ],
            [
                9494,
                9563
            ],
            [
                9565,
                9567
            ],
            [
                9636,
                9638
            ],
            [
                9675,
                9680
            ],
            [
                9902,
                9970
            ],
            [
                9970,
                9982
            ],
            [
                10018,
                10025
            ],
            [
                10029,
                10038
            ],
            [
                10038,
                10072
            ],
            [
                10134,
                10157
            ],
            [
                10163,
                10207
            ],
            [
                10244,
                10245
            ],
            [
                10246,
                10296
            ],
            [
                10296,
                10311
            ],
            [
                10339,
                10341
            ],
            [
                10341,
                10425
            ],
            [
                10437,
                10439
            ],
            [
                10439,
                10482
            ],
            [
                10666,
                10704
            ],
            [
                10746,
                10749
            ],
            [
                10758,
                10764
            ],
            [
                10764,
                10802
            ],
            [
                10802,
                10827
            ],
            [
                10827,
                10860
            ],
            [
                10860,
                10889
            ],
            [
                10901,
                10952
            ],
            [
                10952,
                10969
            ],
            [
                11047,
                11092
            ],
            [
                11092,
                11100
            ],
            [
                11106,
                11128
            ],
            [
                11128,
                11175
            ],
            [
                11175,
                11179
            ],
            [
                11181,
                11195
            ],
            [
                11195,
                11229
            ],
            [
                11229,
                11249
            ],
            [
                11263,
                11265
            ],
            [
                11265,
                11329
            ],
            [
                11329,
                11408
            ],
            [
                11460,
                11463
            ],
            [
                11463,
                11496
            ],
            [
                11496,
                11529
            ],
            [
                11529,
                11557
            ],
            [
                11664,
                11724
            ],
            [
                11724,
                11781
            ],
            [
                11781,
                11833
            ],
            [
                11833,
                11865
            ],
            [
                11865,
                11883
            ],
            [
                11883,
                11907
            ],
            [
                11932,
                11945
            ],
            [
                12072,
                12074
            ],
            [
                12074,
                12077
            ],
            [
                12124,
                12133
            ],
            [
                12120,
                12123
            ],
            [
                12093,
                12115
            ],
            [
                12153,
                12155
            ],
            [
                12155,
                12218
            ],
            [
                12218,
                12278
            ],
            [
                12291,
                12303
            ],
            [
                12314,
                12326
            ],
            [
                12326,
                12329
            ],
            [
                12441,
                12443
            ],
            [
                12373,
                12437
            ],
            [
                12459,
                12460
            ],
            [
                12537,
                12590
            ],
            [
                12686,
                12780
            ],
            [
                12780,
                12796
            ],
            [
                12805,
                12825
            ],
            [
                12825,
                12834
            ],
            [
                12836,
                12858
            ],
            [
                12858,
                12881
            ],
            [
                12881,
                12940
            ],
            [
                12940,
                12993
            ],
            [
                13008,
                13011
            ],
            [
                13011,
                13049
            ],
            [
                13049,
                13050
            ],
            [
                13089,
                13098
            ],
            [
                13098,
                13113
            ],
            [
                13113,
                13133
            ],
            [
                13133,
                13139
            ],
            [
                13139,
                13188
            ],
            [
                13300,
                13352
            ],
            [
                13407,
                13410
            ],
            [
                13410,
                13434
            ],
            [
                13436,
                13456
            ],
            [
                13481,
                13560
            ],
            [
                13560,
                13598
            ],
            [
                13622,
                13651
            ],
            [
                13651,
                13705
            ],
            [
                13748,
                13778
            ],
            [
                13778,
                13824
            ],
            [
                13826,
                13890
            ],
            [
                13890,
                13915
            ],
            [
                13915,
                13955
            ],
            [
                13955,
                13980
            ],
            [
                14115,
                14194
            ],
            [
                14195,
                14235
            ],
            [
                14514,
                14548
            ],
            [
                14548,
                14572
            ],
            [
                14651,
                14694
            ],
            [
                14694,
                14710
            ],
            [
                14713,
                14762
            ],
            [
                14762,
                14812
            ],
            [
                14812,
                14826
            ],
            [
                14828,
                14844
            ],
            [
                14844,
                14926
            ],
            [
                14926,
                14972
            ],
            [
                14972,
                15017
            ],
            [
                15079,
                15107
            ],
            [
                15107,
                15134
            ],
            [
                15143,
                15154
            ],
            [
                15158,
                15175
            ],
            [
                15179,
                15207
            ],
            [
                15207,
                15280
            ],
            [
                15281,
                15364
            ],
            [
                15417,
                15419
            ],
            [
                15442,
                15562
            ],
            [
                15562,
                15566
            ],
            [
                15602,
                15645
            ],
            [
                15645,
                15714
            ],
            [
                15720,
                15734
            ],
            [
                15734,
                15777
            ],
            [
                16262,
                16352
            ],
            [
                16363,
                16365
            ],
            [
                16370,
                16429
            ],
            [
                16447,
                16448
            ],
            [
                16662,
                16798
            ],
            [
                16798,
                16809
            ],
            [
                16809,
                16816
            ],
            [
                16817,
                16822
            ],
            [
                16829,
                16855
            ],
            [
                16855,
                16869
            ],
            [
                16869,
                16882
            ],
            [
                16924,
                16952
            ],
            [
                16963,
                17014
            ],
            [
                17053,
                17084
            ],
            [
                17093,
                17094
            ],
            [
                17096,
                17130
            ],
            [
                17132,
                17251
            ],
            [
                17251,
                17302
            ],
            [
                17388,
                17413
            ],
            [
                17413,
                17598
            ],
            [
                17702,
                17754
            ],
            [
                17754,
                17815
            ],
            [
                17957,
                18008
            ],
            [
                18009,
                18016
            ],
            [
                18026,
                18028
            ],
            [
                18091,
                18093
            ],
            [
                18093,
                18163
            ],
            [
                18163,
                18228
            ],
            [
                18228,
                18248
            ],
            [
                18248,
                18287
            ],
            [
                18287,
                18367
            ],
            [
                18367,
                18413
            ],
            [
                18413,
                18421
            ],
            [
                18435,
                18460
            ],
            [
                18470,
                18473
            ],
            [
                18474,
                18479
            ],
            [
                18461,
                18469
            ],
            [
                18492,
                18518
            ],
            [
                18520,
                18637
            ],
            [
                18637,
                18748
            ],
            [
                18749,
                18767
            ],
            [
                18774,
                18809
            ],
            [
                18809,
                18894
            ],
            [
                18894,
                18924
            ],
            [
                18924,
                18953
            ],
            [
                18953,
                18975
            ],
            [
                18984,
                19049
            ]
        ],
        "row_chars": [
            [
                0,
                156
            ],
            [
                156,
                438
            ],
            [
                438,
                691
            ],
            [
                691,
                708
            ],
            [
                708,
                805
            ],
            [
                805,
                851
            ],
            [
                851,
                1050
            ],
            [
                1050,
                1131
            ],
            [
                1131,
                1320
            ],
            [
                1320,
                1435
            ],
            [
                1435,
                1628
            ],
            [
                1628,
                1956
            ],
            [
                1956,
                1991
            ],
            [
                1991,
                2013
            ],
            [
                2013,
                2037
            ],
            [
                2037,
                2337
            ],
            [
                2337,
                2530
            ],
            [
                2530,
                2570
            ],
            [
                2570,
                2634
            ],
            [
                2634,
                2671
            ],
            [
                2671,
                2696
            ],
            [
                2696,
                2706
            ],
            [
                2706,
                2783
            ],
            [
                2783,
                2840
            ],
            [
                2840,
                2997
            ],
            [
                2997,
                3098
            ],
            [
                3098,
                3149
            ],
            [
                3149,
                3163
            ],
            [
                3163,
                3225
            ],
            [
                3225,
                3324
            ],
            [
                3324,
                3505
            ],
            [
                3505,
                3734
            ],
            [
                3734,
                3830
            ],
            [
                3830,
                3857
            ],
            [
                3857,
                4252
            ],
            [
                4252,
                4339
            ],
            [
                4339,
                4356
            ],
            [
                4356,
                4415
            ],
            [
                4415,
                4488
            ],
            [
                4488,
                4571
            ],
            [
                4571,
                4689
            ],
            [
                4689,
                4824
            ],
            [
                4824,
                4851
            ],
            [
                4851,
                4945
            ],
            [
                4945,
                5037
            ],
            [
                5037,
                5277
            ],
            [
                5277,
                5591
            ],
            [
                5591,
                5736
            ],
            [
                5736,
                5962
            ],
            [
                5962,
                6141
            ],
            [
                6141,
                6209
            ],
            [
                6209,
                6328
            ],
            [
                6328,
                6425
            ],
            [
                6425,
                6586
            ],
            [
                6586,
                6670
            ],
            [
                6670,
                6676
            ],
            [
                6676,
                6710
            ],
            [
                6710,
                6771
            ],
            [
                6771,
                6812
            ],
            [
                6812,
                6839
            ],
            [
                6839,
                6863
            ],
            [
                6863,
                6893
            ],
            [
                6893,
                6970
            ],
            [
                6970,
                6986
            ],
            [
                6986,
                7036
            ],
            [
                7036,
                7056
            ],
            [
                7056,
                7081
            ],
            [
                7081,
                7142
            ],
            [
                7142,
                7183
            ],
            [
                7183,
                7276
            ],
            [
                7276,
                7320
            ],
            [
                7320,
                7340
            ],
            [
                7340,
                7385
            ],
            [
                7385,
                7403
            ],
            [
                7403,
                7436
            ],
            [
                7436,
                7487
            ],
            [
                7487,
                7635
            ],
            [
                7635,
                7740
            ],
            [
                7740,
                7791
            ],
            [
                7791,
                7848
            ],
            [
                7848,
                7895
            ],
            [
                7895,
                7969
            ],
            [
                7969,
                8052
            ],
            [
                8052,
                8081
            ],
            [
                8081,
                8159
            ],
            [
                8159,
                8221
            ],
            [
                8221,
                8365
            ],
            [
                8365,
                8510
            ],
            [
                8510,
                8559
            ],
            [
                8559,
                8596
            ],
            [
                8596,
                8636
            ],
            [
                8636,
                8658
            ],
            [
                8658,
                8692
            ],
            [
                8692,
                8789
            ],
            [
                8789,
                9015
            ],
            [
                9015,
                9040
            ],
            [
                9040,
                9095
            ],
            [
                9095,
                9246
            ],
            [
                9246,
                9362
            ],
            [
                9362,
                9387
            ],
            [
                9387,
                9414
            ],
            [
                9414,
                9449
            ],
            [
                9449,
                9494
            ],
            [
                9494,
                9680
            ],
            [
                9680,
                9970
            ],
            [
                9970,
                10038
            ],
            [
                10038,
                10246
            ],
            [
                10246,
                10296
            ],
            [
                10296,
                10341
            ],
            [
                10341,
                10439
            ],
            [
                10439,
                10482
            ],
            [
                10482,
                10666
            ],
            [
                10666,
                10764
            ],
            [
                10764,
                10802
            ],
            [
                10802,
                10827
            ],
            [
                10827,
                10860
            ],
            [
                10860,
                10952
            ],
            [
                10952,
                11092
            ],
            [
                11092,
                11128
            ],
            [
                11128,
                11175
            ],
            [
                11175,
                11195
            ],
            [
                11195,
                11229
            ],
            [
                11229,
                11265
            ],
            [
                11265,
                11329
            ],
            [
                11329,
                11463
            ],
            [
                11463,
                11496
            ],
            [
                11496,
                11529
            ],
            [
                11529,
                11557
            ],
            [
                11557,
                11610
            ],
            [
                11610,
                11630
            ],
            [
                11630,
                11664
            ],
            [
                11664,
                11724
            ],
            [
                11724,
                11781
            ],
            [
                11781,
                11833
            ],
            [
                11833,
                11865
            ],
            [
                11865,
                11883
            ],
            [
                11883,
                12074
            ],
            [
                12074,
                12155
            ],
            [
                12155,
                12218
            ],
            [
                12218,
                12326
            ],
            [
                12326,
                12461
            ],
            [
                12461,
                12537
            ],
            [
                12537,
                12591
            ],
            [
                12591,
                12628
            ],
            [
                12628,
                12686
            ],
            [
                12686,
                12780
            ],
            [
                12780,
                12825
            ],
            [
                12825,
                12858
            ],
            [
                12858,
                12881
            ],
            [
                12881,
                12940
            ],
            [
                12940,
                13011
            ],
            [
                13011,
                13049
            ],
            [
                13049,
                13098
            ],
            [
                13098,
                13113
            ],
            [
                13113,
                13133
            ],
            [
                13133,
                13139
            ],
            [
                13139,
                13188
            ],
            [
                13188,
                13300
            ],
            [
                13300,
                13410
            ],
            [
                13410,
                13456
            ],
            [
                13456,
                13481
            ],
            [
                13481,
                13560
            ],
            [
                13560,
                13651
            ],
            [
                13651,
                13705
            ],
            [
                13705,
                13778
            ],
            [
                13778,
                13890
            ],
            [
                13890,
                13915
            ],
            [
                13915,
                13955
            ],
            [
                13955,
                13982
            ],
            [
                13982,
                14115
            ],
            [
                14115,
                14237
            ],
            [
                14237,
                14265
            ],
            [
                14265,
                14312
            ],
            [
                14312,
                14368
            ],
            [
                14368,
                14514
            ],
            [
                14514,
                14548
            ],
            [
                14548,
                14572
            ],
            [
                14572,
                14592
            ],
            [
                14592,
                14651
            ],
            [
                14651,
                14694
            ],
            [
                14694,
                14762
            ],
            [
                14762,
                14812
            ],
            [
                14812,
                14844
            ],
            [
                14844,
                14926
            ],
            [
                14926,
                14972
            ],
            [
                14972,
                15019
            ],
            [
                15019,
                15052
            ],
            [
                15052,
                15079
            ],
            [
                15079,
                15107
            ],
            [
                15107,
                15207
            ],
            [
                15207,
                15281
            ],
            [
                15281,
                15419
            ],
            [
                15419,
                15562
            ],
            [
                15562,
                15645
            ],
            [
                15645,
                15734
            ],
            [
                15734,
                15778
            ],
            [
                15778,
                15945
            ],
            [
                15945,
                16103
            ],
            [
                16103,
                16252
            ],
            [
                16252,
                16365
            ],
            [
                16365,
                16449
            ],
            [
                16449,
                16501
            ],
            [
                16501,
                16591
            ],
            [
                16591,
                16662
            ],
            [
                16662,
                16798
            ],
            [
                16798,
                16809
            ],
            [
                16809,
                16855
            ],
            [
                16855,
                16869
            ],
            [
                16869,
                16952
            ],
            [
                16952,
                16963
            ],
            [
                16963,
                17016
            ],
            [
                17016,
                17042
            ],
            [
                17042,
                17053
            ],
            [
                17053,
                17251
            ],
            [
                17251,
                17302
            ],
            [
                17302,
                17311
            ],
            [
                17311,
                17388
            ],
            [
                17388,
                17413
            ],
            [
                17413,
                17600
            ],
            [
                17600,
                17690
            ],
            [
                17690,
                17754
            ],
            [
                17754,
                17815
            ],
            [
                17815,
                17884
            ],
            [
                17884,
                17957
            ],
            [
                17957,
                18093
            ],
            [
                18093,
                18163
            ],
            [
                18163,
                18228
            ],
            [
                18228,
                18248
            ],
            [
                18248,
                18287
            ],
            [
                18287,
                18367
            ],
            [
                18367,
                18413
            ],
            [
                18413,
                18637
            ],
            [
                18637,
                18749
            ],
            [
                18749,
                18809
            ],
            [
                18809,
                18894
            ],
            [
                18894,
                18924
            ],
            [
                18924,
                18953
            ],
            [
                18953,
                19049
            ]
        ]
    },
    "abridged": {
        "text": "On the night of Lady Monk's party, Burgo Fitzgerald disappeared; and when the guests were gone, his aunt inquired for him in vain. The old butler said that he thought Mr. Burgo had left the house. Lady Monk went to her nephew's door, and saw the careless debris of his dressing about the room. But he was gone.\n\"Perhaps, after all, he has arranged it,\" she said to herself.\nBut Burgo, as we know, had not \"arranged it.\" It may be remembered that when Mr. Palliser came back to his wife in the supper-room, bringing her scarf, Burgo was no longer with her. He had become aware that he had no chance left, at any rate for that night. The poor fool, acting on his aunt's implied advice, had hired a post-chaise, and stationed it in Bruton Street, five minutes' walk away. And he had bought feminine cloaks and things that he thought might be necessary for his companion. He had booked rooms at the hotel near the Dover Station, from where a train was to start on the following morning to catch the boat for Boulogne. There was a dressing-bag there for which he had paid twenty-five guineas of his aunt's money, and there were other things - slippers, collars, stockings, handkerchiefs, and what else he thought might be most necessary. Poor thoughtful, thoughtless fool!\nThe butler was right. He did leave the house. He saw Lady Glencora taken to her carriage, and then slipped out, and slowly made his way down to Bruton Street. There was the carriage ready; and the driver emerged from the nearby public-house.\n\"I shan't want you tonight,\" said Burgo, hoarsely.\n\"And what about the things, your honour?\"\n\"Take them to the devil. No; stop. Take them back with you, and ask somebody to keep them till I send for them. I shall want them and another carriage in a day or two.\" Then he gave the man half a sovereign, and went away.\nFrom there Burgo went back into Grosvenor Square, and down Park Street, and through a narrow passage and a mews into Park Lane. He walked along the rails of the Park, till he found himself opposite the Palliser house. Then he stood there, leaning on the railings, and looking up at Lady Glencora's windows. What did he expect to see? He was not impelled by love. He felt a mixed, feverish desire, which he took no trouble to analyse. He wanted money. He wanted the thing of which this Palliser had robbed him. He wanted revenge. And he wanted the woman's beauty. He wanted to kiss her again as he had once kissed her, and to feel that she was soft and loving.\nBut in his unreasoning folly he did not know what step to take. He stood there with an undefined feeling that she might see him from the window, and come to him; in the way that if you lie under a tree long enough, a plum may drop into your mouth. He stood and looked, and cursed his ill-luck, though with none of the bitterness of George Vavasor's oaths. Burgo had one honest feeling - a feeling that it served him right, and that he had perhaps better go to the devil at once, and give nobody any more trouble. If he loved no one sincerely, neither did he hate anyone. When he cursed his fate, he only did so because cursing is so easy.\nThere he stood till he was cold, and then, as the plum did not drop into his mouth, he moved on. He went up into Oxford Street, and walked along to the corner of Bond Street. There a girl took hold of him, and looked up into his face.\n\"Ah!\" she said, \"I saw you once before.\"\n\"Then you saw the most miserable devil alive,\" said Burgo.\n\"You can't be miserable,\" said the girl. \"You've plenty of money.\"\n\"I wish I had,\" said Burgo.\n\"You gave me supper one night when I was starving. I ain't hungry now. Will you give me a kiss?\"\n\"I'll give you a shilling, and that's better,\" said Burgo.\n\"But give me a kiss too,\" said the girl. He gave her first the kiss, and then the shilling, and then he left her and passed on.\nHe made his way into the house in Grosvenor Square, by some means unknown to his aunt. He emptied his pockets as he got into bed, and counted a roll of notes in one of them. There were still a hundred and thirty pounds left. Lady Glencora had promised that she would see him again. But what use would that be if all his money should then be gone? He knew that keeping money was impossible for him.\nThen he thought of his aunt. What should he say to her the next day? Might it not be as well to avoid her altogether?\nHe breakfasted in his bedroom, reading a French novel. He was still there when his aunt's maid came to him, saying that his aunt wished to see him.\n\"Tell me, Lucy,\" said he, \"how is the old girl?\"\n\"She's as cross as cross, Mr. Burgo.\"\nBurgo applied himself to his toilet, from time to time reading a few pages of the French novel, and also taking small doses from a bottle of curaao liqueur. He had by no means made up his mind to go to his aunt. Why should he? She would only scold him. She might, perhaps, turn him out of the house if he did not obey her, or if he contradicted her. So he resolved to escape to his club without attending to her summons.\nBut his aunt out-manuvred him. He crept down the back stairs; but he was forced to emerge into the hall, and here his aunt pounced upon him.\n\"Did not Lucy tell you that I wanted to see you?\" Lady Monk asked severely.\nBurgo replied, with perfect ease, that he was going out just to have his hair washed. He would have been back in twenty minutes. Lady Monk did not believe him; but she let it pass.\n\"Never mind your hair now,\" she said. \"I want to speak to you. Come in here for a few minutes.\"\nAs there was no way of escape, he followed his aunt into the breakfast-parlour.\n\"Burgo,\" she said, \"I don't think you will ever do any good.\"\n\"I don't think I shall, aunt.\"\n\"What do you mean, then, to do with yourself?\"\n\"Oh, I don't know. I haven't thought much about it.\"\n\"You can't stay here. Sir Cosmo was speaking to me about you only yesterday morning.\"\n\"I shall be quite willing to go down to Monkshade, if Sir Cosmo likes it better.\"\n\"He won't have you at Monkshade. He won't let you go there again. And he won't have you here. You are the most ungrateful, heartless creature I ever met. You must make up your mind to leave this house at once.\"\n\"Where does Sir Cosmo mean that I should go, then?\"\n\"To the workhouse, if you like. He doesn't care.\"\n\"I don't suppose he does,\" said Burgo.\nBut Lady Monk did not intend to turn Burgo out of the house. She knew that he would hang on there till the season was over. After that he must not be allowed to return again, unless he succeeded in his enterprise. She wished to learn whether there was any possible remaining chance of success.\n\"What a fool you made of yourself last night, Burgo!\" she said. \"Why did you go on waltzing in that way when every pair of eyes in the room was watching you?\"\n\"I couldn't help it, if she liked it.\"\n\"Oh, yes, say it was her fault. That's so like a man!\"\n\"Look here, aunt, I'm not going to sit here and be abused. I couldn't take her in my arms, and fly away with her.\"\n\"Who wants you to fly away with her?\"\n\"You do.\"\n\"No, I don't.\"\n\"Well, then, I do.\"\n\"You! you haven't spirit to do that, or anything else. You simply disgraced yourself last night, and me too.\"\n\"I had a plan all ready; only he came back.\"\n\"Of course he came back, when they sent him word how you and she were going on. And now he will have forgiven her, and the thing will be all over.\"\n\"I tell you what, aunt; she would go if she knew how. She promised to see me again. And as for being idle, and not doing anything; why, I was out in Park Lane last night, after you were in bed.\"\n\"What good did that do?\"\n\"It didn't do any good, as it happened. But a fellow can only try.\"\nLady Monk sat silent for a few moments, and then she said in a low voice, \"What exactly did she say to you when you were parting?\"\n\"She said she would see me again. She promised it twice.\"\n\"Had she said that she would go with you?\"\n\"I had asked her half a dozen times, and she did not once refuse. I know she means it, if she knew how to get away. She hates him; I'm sure of it. A woman, you know, wouldn't absolutely say that she would go, till she was gone.\"\n\"If she really meant it, she would tell you.\"\n\"I don't think she could have told me plainer.\"\nAgain Lady Monk sat silent. She had a plan in her head, that might, she thought, give her nephew one more chance. But she hesitated before she could bring herself to explain it in detail.\nAt first she had lent a little aid to this desired abduction of Mr. Palliser's wife. She had succeeded in getting Lady Glencora to her house in London, and had taken care that Burgo should meet her there. Then Lady Glencora had been asked to Monkshade. Lady Glencora, as we know, did not go to Monkshade, and Lady Monk had been baffled. But she did not therefore give up the game.\nNow she must arrange it herself, and have a scheme of her own, or else the thing must fail. Yet she was almost reluctant to speak out plainly to her nephew.\n\"I will try and help you,\" she said at last, speaking hoarsely, almost in a whisper, \"if you have courage to make an attempt yourself.\"\n\"Courage!\" said he. \"What do you think I am afraid of? Mr. Palliser? I'd fight him, if it would do any good.\"\n\"There's no fighting wanted, as you know well enough! If you can get her to call here, say on Thursday, at three o'clock, I will be here to receive her; and instead of going back into her carriage, you can have a cab for her somewhere near. She can come, as it were, to make a morning call.\"\n\"And where shall we go?\"\n\"There is a train to Southampton at four, and the boat sails for Jersey at half-past six; you will be in Jersey the next morning, and there is a boat goes on to St. Malo, almost at once.\" Who will say that Lady Monk was not a devoted aunt?\n\"That would do excellently well,\" said the enraptured Burgo.\n\"She had better tell her coachman to drive somewhere else to pick someone up. Then she can leave me, and go out on foot, to where you have the cab. She can tell the hall-porter that she will walk to her carriage. Do you understand?\" Burgo declared that he did understand.\n\"You must call on her, and make your way in, and see her, and arrange all this. It must be a Thursday, because of the boats.\" Then she asked about his money, and took the banknotes from him, promising to return them with something added, on the Thursday morning; but he asked, with a little whine, for a five-pound note, and got it. Burgo then told her about the travelling-bags and the stockings, and they were quite pleasant and confidential.\n\"Bid her come in a travelling-dress,\" said Lady Monk. \"She can wear some lace or something over it, so that the servants won't observe it. I will take no notice of it.\" Was there ever such an aunt?\nAfter this, Burgo left her, and went away to his club, in a state of most happy excitement.",
        "paragraph_chars": [
            [
                0,
                311
            ],
            [
                311,
                374
            ],
            [
                374,
                1268
            ],
            [
                1268,
                1510
            ],
            [
                1510,
                1561
            ],
            [
                1561,
                1603
            ],
            [
                1603,
                1826
            ],
            [
                1826,
                2486
            ],
            [
                2486,
                3125
            ],
            [
                3125,
                3360
            ],
            [
                3360,
                3401
            ],
            [
                3401,
                3460
            ],
            [
                3460,
                3527
            ],
            [
                3527,
                3555
            ],
            [
                3555,
                3652
            ],
            [
                3652,
                3711
            ],
            [
                3711,
                3839
            ],
            [
                3839,
                4237
            ],
            [
                4237,
                4355
            ],
            [
                4355,
                4503
            ],
            [
                4503,
                4552
            ],
            [
                4552,
                4590
            ],
            [
                4590,
                5011
            ],
            [
                5011,
                5152
            ],
            [
                5152,
                5228
            ],
            [
                5228,
                5409
            ],
            [
                5409,
                5505
            ],
            [
                5505,
                5585
            ],
            [
                5585,
                5647
            ],
            [
                5647,
                5678
            ],
            [
                5678,
                5725
            ],
            [
                5725,
                5778
            ],
            [
                5778,
                5864
            ],
            [
                5864,
                5946
            ],
            [
                5946,
                6157
            ],
            [
                6157,
                6209
            ],
            [
                6209,
                6259
            ],
            [
                6259,
                6298
            ],
            [
                6298,
                6592
            ],
            [
                6592,
                6751
            ],
            [
                6751,
                6790
            ],
            [
                6790,
                6845
            ],
            [
                6845,
                6960
            ],
            [
                6960,
                6998
            ],
            [
                6998,
                7008
            ],
            [
                7008,
                7023
            ],
            [
                7023,
                7043
            ],
            [
                7043,
                7153
            ],
            [
                7153,
                7198
            ],
            [
                7198,
                7346
            ],
            [
                7346,
                7541
            ],
            [
                7541,
                7566
            ],
            [
                7566,
                7634
            ],
            [
                7634,
                7765
            ],
            [
                7765,
                7823
            ],
            [
                7823,
                7866
            ],
            [
                7866,
                8095
            ],
            [
                8095,
                8141
            ],
            [
                8141,
                8189
            ],
            [
                8189,
                8377
            ],
            [
                8377,
                8758
            ],
            [
                8758,
                8915
            ],
            [
                8915,
                9051
            ],
            [
                9051,
                9161
            ],
            [
                9161,
                9453
            ],
            [
                9453,
                9478
            ],
            [
                9478,
                9718
            ],
            [
                9718,
                9779
            ],
            [
                9779,
                10051
            ],
            [
                10051,
                10496
            ],
            [
                10496,
                10694
            ],
            [
                10694,
                10785
            ]
        ],
        "segment_chars": [
            [
                0,
                131
            ],
            [
                131,
                197
            ],
            [
                197,
                294
            ],
            [
                294,
                311
            ],
            [
                311,
                374
            ],
            [
                374,
                420
            ],
            [
                420,
                556
            ],
            [
                556,
                632
            ],
            [
                632,
                769
            ],
            [
                769,
                868
            ],
            [
                868,
                1014
            ],
            [
                1014,
                1233
            ],
            [
                1233,
                1268
            ],
            [
                1268,
                1290
            ],
            [
                1290,
                1314
            ],
            [
                1314,
                1427
            ],
            [
                1427,
                1510
            ],
            [
                1510,
                1561
            ],
            [
                1561,
                1603
            ],
            [
                1603,
                1628
            ],
            [
                1628,
                1638
            ],
            [
                1638,
                1715
            ],
            [
                1715,
                1772
            ],
            [
                1772,
                1826
            ],
            [
                1826,
                1954
            ],
            [
                1954,
                2044
            ],
            [
                2044,
                2133
            ],
            [
                2133,
                2160
            ],
            [
                2160,
                2189
            ],
            [
                2189,
                2260
            ],
            [
                2260,
                2277
            ],
            [
                2277,
                2336
            ],
            [
                2336,
                2355
            ],
            [
                2355,
                2389
            ],
            [
                2389,
                2486
            ],
            [
                2486,
                2550
            ],
            [
                2550,
                2734
            ],
            [
                2734,
                2842
            ],
            [
                2842,
                2999
            ],
            [
                2999,
                3057
            ],
            [
                3057,
                3125
            ],
            [
                3125,
                3222
            ],
            [
                3222,
                3300
            ],
            [
                3300,
                3360
            ],
            [
                3360,
                3366
            ],
            [
                3366,
                3401
            ],
            [
                3401,
                3460
            ],
            [
                3460,
                3501
            ],
            [
                3501,
                3527
            ],
            [
                3527,
                3555
            ],
            [
                3555,
                3606
            ],
            [
                3606,
                3626
            ],
            [
                3626,
                3652
            ],
            [
                3652,
                3711
            ],
            [
                3711,
                3752
            ],
            [
                3752,
                3839
            ],
            [
                3839,
                3926
            ],
            [
                3926,
                4013
            ],
            [
                4013,
                4064
            ],
            [
                4064,
                4121
            ],
            [
                4121,
                4186
            ],
            [
                4186,
                4237
            ],
            [
                4237,
                4266
            ],
            [
                4266,
                4306
            ],
            [
                4306,
                4355
            ],
            [
                4355,
                4410
            ],
            [
                4410,
                4503
            ],
            [
                4503,
                4552
            ],
            [
                4552,
                4590
            ],
            [
                4590,
                4747
            ],
            [
                4747,
                4802
            ],
            [
                4802,
                4817
            ],
            [
                4817,
                4843
            ],
            [
                4843,
                4940
            ],
            [
                4940,
                5011
            ],
            [
                5011,
                5042
            ],
            [
                5042,
                5152
            ],
            [
                5152,
                5202
            ],
            [
                5202,
                5228
            ],
            [
                5228,
                5314
            ],
            [
                5314,
                5357
            ],
            [
                5357,
                5409
            ],
            [
                5409,
                5447
            ],
            [
                5447,
                5472
            ],
            [
                5472,
                5505
            ],
            [
                5505,
                5585
            ],
            [
                5585,
                5647
            ],
            [
                5647,
                5678
            ],
            [
                5678,
                5725
            ],
            [
                5725,
                5744
            ],
            [
                5744,
                5778
            ],
            [
                5778,
                5800
            ],
            [
                5800,
                5864
            ],
            [
                5864,
                5946
            ],
            [
                5946,
                5979
            ],
            [
                5979,
                6012
            ],
            [
                6012,
                6040
            ],
            [
                6040,
                6100
            ],
            [
                6100,
                6157
            ],
            [
                6157,
                6209
            ],
            [
                6209,
                6241
            ],
            [
                6241,
                6259
            ],
            [
                6259,
                6298
            ],
            [
                6298,
                6359
            ],
            [
                6359,
                6422
            ],
            [
                6422,
                6512
            ],
            [
                6512,
                6592
            ],
            [
                6592,
                6646
            ],
            [
                6646,
                6656
            ],
            [
                6656,
                6751
            ],
            [
                6751,
                6790
            ],
            [
                6790,
                6822
            ],
            [
                6822,
                6845
            ],
            [
                6845,
                6904
            ],
            [
                6904,
                6960
            ],
            [
                6960,
                6998
            ],
            [
                6998,
                7008
            ],
            [
                7008,
                7023
            ],
            [
                7023,
                7043
            ],
            [
                7043,
                7049
            ],
            [
                7049,
                7098
            ],
            [
                7098,
                7153
            ],
            [
                7153,
                7198
            ],
            [
                7198,
                7278
            ],
            [
                7278,
                7346
            ],
            [
                7346,
                7400
            ],
            [
                7400,
                7430
            ],
            [
                7430,
                7541
            ],
            [
                7541,
                7566
            ],
            [
                7566,
                7606
            ],
            [
                7606,
                7634
            ],
            [
                7634,
                7765
            ],
            [
                7765,
                7799
            ],
            [
                7799,
                7823
            ],
            [
                7823,
                7866
            ],
            [
                7866,
                7932
            ],
            [
                7932,
                7982
            ],
            [
                7982,
                8013
            ],
            [
                8013,
                8095
            ],
            [
                8095,
                8141
            ],
            [
                8141,
                8189
            ],
            [
                8189,
                8217
            ],
            [
                8217,
                8303
            ],
            [
                8303,
                8377
            ],
            [
                8377,
                8462
            ],
            [
                8462,
                8582
            ],
            [
                8582,
                8630
            ],
            [
                8630,
                8714
            ],
            [
                8714,
                8758
            ],
            [
                8758,
                8850
            ],
            [
                8850,
                8915
            ],
            [
                8915,
                9051
            ],
            [
                9051,
                9062
            ],
            [
                9062,
                9071
            ],
            [
                9071,
                9106
            ],
            [
                9106,
                9120
            ],
            [
                9120,
                9161
            ],
            [
                9161,
                9215
            ],
            [
                9215,
                9402
            ],
            [
                9402,
                9453
            ],
            [
                9453,
                9478
            ],
            [
                9478,
                9666
            ],
            [
                9666,
                9718
            ],
            [
                9718,
                9779
            ],
            [
                9779,
                9857
            ],
            [
                9857,
                9927
            ],
            [
                9927,
                9992
            ],
            [
                9992,
                10012
            ],
            [
                10012,
                10051
            ],
            [
                10051,
                10131
            ],
            [
                10131,
                10177
            ],
            [
                10177,
                10384
            ],
            [
                10384,
                10496
            ],
            [
                10496,
                10550
            ],
            [
                10550,
                10635
            ],
            [
                10635,
                10665
            ],
            [
                10665,
                10694
            ],
            [
                10694,
                10785
            ]
        ],
        "overlap_chars": [
            [
                0,
                94
            ],
            [
                94,
                131
            ],
            [
                131,
                145
            ],
            [
                146,
                197
            ],
            [
                197,
                206
            ],
            [
                207,
                211
            ],
            [
                215,
                233
            ],
            [
                234,
                268
            ],
            [
                278,
                294
            ],
            [
                294,
                310
            ],
            [
                311,
                372
            ],
            [
                372,
                374
            ],
            [
                374,
                420
            ],
            [
                420,
                504
            ],
            [
                504,
                514
            ],
            [
                519,
                524
            ],
            [
                524,
                556
            ],
            [
                556,
                569
            ],
            [
                570,
                632
            ],
            [
                632,
                653
            ],
            [
                657,
                682
            ],
            [
                682,
                687
            ],
            [
                694,
                743
            ],
            [
                744,
                762
            ],
            [
                767,
                769
            ],
            [
                769,
                779
            ],
            [
                787,
                795
            ],
            [
                796,
                802
            ],
            [
                807,
                868
            ],
            [
                868,
                874
            ],
            [
                882,
                894
            ],
            [
                895,
                924
            ],
            [
                925,
                929
            ],
            [
                936,
                943
            ],
            [
                944,
                981
            ],
            [
                982,
                994
            ],
            [
                995,
                1014
            ],
            [
                1014,
                1086
            ],
            [
                1087,
                1107
            ],
            [
                1108,
                1135
            ],
            [
                1138,
                1196
            ],
            [
                1197,
                1207
            ],
            [
                1208,
                1213
            ],
            [
                1214,
                1233
            ],
            [
                1233,
                1268
            ],
            [
                1268,
                1290
            ],
            [
                1290,
                1314
            ],
            [
                1314,
                1356
            ],
            [
                1356,
                1379
            ],
            [
                1380,
                1411
            ],
            [
                1412,
                1427
            ],
            [
                1427,
                1449
            ],
            [
                1455,
                1471
            ],
            [
                1480,
                1488
            ],
            [
                1496,
                1509
            ],
            [
                1510,
                1528
            ],
            [
                1536,
                1559
            ],
            [
                1561,
                1565
            ],
            [
                1571,
                1602
            ],
            [
                1603,
                1628
            ],
            [
                1628,
                1638
            ],
            [
                1638,
                1715
            ],
            [
                1715,
                1772
            ],
            [
                1772,
                1824
            ],
            [
                1824,
                1825
            ],
            [
                1826,
                1830
            ],
            [
                1831,
                1836
            ],
            [
                1837,
                1842
            ],
            [
                1848,
                1879
            ],
            [
                1880,
                1937
            ],
            [
                1938,
                1954
            ],
            [
                1954,
                1956
            ],
            [
                1964,
                1969
            ],
            [
                1970,
                2023
            ],
            [
                2024,
                2027
            ],
            [
                2028,
                2036
            ],
            [
                2037,
                2044
            ],
            [
                2044,
                2072
            ],
            [
                2076,
                2133
            ],
            [
                2133,
                2160
            ],
            [
                2160,
                2162
            ],
            [
                2163,
                2166
            ],
            [
                2167,
                2170
            ],
            [
                2180,
                2187
            ],
            [
                2187,
                2189
            ],
            [
                2197,
                2260
            ],
            [
                2260,
                2277
            ],
            [
                2277,
                2336
            ],
            [
                2336,
                2353
            ],
            [
                2353,
                2355
            ],
            [
                2355,
                2358
            ],
            [
                2359,
                2387
            ],
            [
                2387,
                2389
            ],
            [
                2389,
                2473
            ],
            [
                2474,
                2484
            ],
            [
                2484,
                2485
            ],
            [
                2490,
                2548
            ],
            [
                2548,
                2550
            ],
            [
                2550,
                2552
            ],
            [
                2591,
                2595
            ],
            [
                2596,
                2646
            ],
            [
                2659,
                2663
            ],
            [
                2664,
                2687
            ],
            [
                2699,
                2711
            ],
            [
                2717,
                2721
            ],
            [
                2722,
                2732
            ],
            [
                2732,
                2734
            ],
            [
                2734,
                2778
            ],
            [
                2792,
                2817
            ],
            [
                2818,
                2832
            ],
            [
                2840,
                2842
            ],
            [
                2842,
                2847
            ],
            [
                2852,
                2870
            ],
            [
                2873,
                2890
            ],
            [
                2891,
                2924
            ],
            [
                2925,
                2932
            ],
            [
                2933,
                2939
            ],
            [
                2940,
                2999
            ],
            [
                2999,
                3048
            ],
            [
                3055,
                3057
            ],
            [
                3057,
                3124
            ],
            [
                3125,
                3222
            ],
            [
                3222,
                3269
            ],
            [
                3270,
                3298
            ],
            [
                3298,
                3300
            ],
            [
                3306,
                3359
            ],
            [
                3360,
                3366
            ],
            [
                3366,
                3400
            ],
            [
                3401,
                3459
            ],
            [
                3460,
                3501
            ],
            [
                3502,
                3526
            ],
            [
                3527,
                3554
            ],
            [
                3556,
                3606
            ],
            [
                3606,
                3626
            ],
            [
                3626,
                3651
            ],
            [
                3652,
                3710
            ],
            [
                3711,
                3752
            ],
            [
                3752,
                3806
            ],
            [
                3812,
                3838
            ],
            [
                3842,
                3904
            ],
            [
                3905,
                3924
            ],
            [
                3924,
                3926
            ],
            [
                3926,
                3996
            ],
            [
                3997,
                4013
            ],
            [
                4013,
                4064
            ],
            [
                4064,
                4121
            ],
            [
                4121,
                4139
            ],
            [
                4140,
                4144
            ],
            [
                4145,
                4147
            ],
            [
                4148,
                4186
            ],
            [
                4186,
                4198
            ],
            [
                4199,
                4206
            ],
            [
                4207,
                4212
            ],
            [
                4213,
                4216
            ],
            [
                4232,
                4235
            ],
            [
                4235,
                4236
            ],
            [
                4237,
                4266
            ],
            [
                4266,
                4287
            ],
            [
                4288,
                4291
            ],
            [
                4292,
                4295
            ],
            [
                4301,
                4306
            ],
            [
                4306,
                4329
            ],
            [
                4330,
                4338
            ],
            [
                4343,
                4355
            ],
            [
                4355,
                4369
            ],
            [
                4370,
                4385
            ],
            [
                4394,
                4410
            ],
            [
                4410,
                4422
            ],
            [
                4423,
                4428
            ],
            [
                4429,
                4501
            ],
            [
                4501,
                4502
            ],
            [
                4503,
                4552
            ],
            [
                4552,
                4587
            ],
            [
                4590,
                4625
            ],
            [
                4625,
                4626
            ],
            [
                4627,
                4644
            ],
            [
                4653,
                4694
            ],
            [
                4702,
                4734
            ],
            [
                4734,
                4735
            ],
            [
                4735,
                4737
            ],
            [
                4745,
                4747
            ],
            [
                4747,
                4782
            ],
            [
                4786,
                4791
            ],
            [
                4792,
                4800
            ],
            [
                4800,
                4802
            ],
            [
                4802,
                4815
            ],
            [
                4815,
                4817
            ],
            [
                4817,
                4841
            ],
            [
                4841,
                4843
            ],
            [
                4843,
                4912
            ],
            [
                4913,
                4915
            ],
            [
                4919,
                4921
            ],
            [
                4935,
                4940
            ],
            [
                4943,
                5011
            ],
            [
                5011,
                5023
            ],
            [
                5024,
                5031
            ],
            [
                5033,
                5042
            ],
            [
                5042,
                5076
            ],
            [
                5077,
                5100
            ],
            [
                5106,
                5150
            ],
            [
                5150,
                5151
            ],
            [
                5152,
                5202
            ],
            [
                5202,
                5217
            ],
            [
                5226,
                5228
            ],
            [
                5228,
                5312
            ],
            [
                5312,
                5314
            ],
            [
                5314,
                5357
            ],
            [
                5357,
                5395
            ],
            [
                5396,
                5399
            ],
            [
                5403,
                5409
            ],
            [
                5409,
                5447
            ],
            [
                5447,
                5472
            ],
            [
                5472,
                5505
            ],
            [
                5505,
                5534
            ],
            [
                5534,
                5585
            ],
            [
                5585,
                5602
            ],
            [
                5602,
                5647
            ],
            [
                5647,
                5655
            ],
            [
                5656,
                5678
            ],
            [
                5678,
                5725
            ],
            [
                5725,
                5729
            ],
            [
                5730,
                5744
            ],
            [
                5744,
                5778
            ],
            [
                5778,
                5798
            ],
            [
                5798,
                5800
            ],
            [
                5800,
                5864
            ],
            [
                5864,
                5943
            ],
            [
                5943,
                5946
            ],
            [
                5946,
                5979
            ],
            [
                5979,
                6012
            ],
            [
                6012,
                6040
            ],
            [
                6040,
                6100
            ],
            [
                6100,
                6157
            ],
            [
                6157,
                6209
            ],
            [
                6209,
                6241
            ],
            [
                6241,
                6259
            ],
            [
                6259,
                6283
            ],
            [
                6283,
                6296
            ],
            [
                6296,
                6298
            ],
            [
                6298,
                6301
            ],
            [
                6302,
                6311
            ],
            [
                6316,
                6319
            ],
            [
                6335,
                6357
            ],
            [
                6357,
                6359
            ],
            [
                6359,
                6422
            ],
            [
                6422,
                6482
            ],
            [
                6483,
                6495
            ],
            [
                6500,
                6512
            ],
            [
                6512,
                6515
            ],
            [
                6523,
                6525
            ],
            [
                6526,
                6590
            ],
            [
                6590,
                6591
            ],
            [
                6592,
                6645
            ],
            [
                6657,
                6751
            ],
            [
                6751,
                6767
            ],
            [
                6770,
                6790
            ],
            [
                6790,
                6799
            ],
            [
                6800,
                6822
            ],
            [
                6822,
                6845
            ],
            [
                6845,
                6904
            ],
            [
                6904,
                6957
            ],
            [
                6957,
                6960
            ],
            [
                6960,
                6998
            ],
            [
                6998,
                6999
            ],
            [
                6999,
                7008
            ],
            [
                7008,
                7023
            ],
            [
                7023,
                7043
            ],
            [
                7043,
                7049
            ],
            [
                7049,
                7098
            ],
            [
                7098,
                7150
            ],
            [
                7150,
                7153
            ],
            [
                7153,
                7177
            ],
            [
                7178,
                7198
            ],
            [
                7199,
                7278
            ],
            [
                7278,
                7316
            ],
            [
                7317,
                7346
            ],
            [
                7346,
                7400
            ],
            [
                7400,
                7430
            ],
            [
                7430,
                7476
            ],
            [
                7477,
                7541
            ],
            [
                7541,
                7566
            ],
            [
                7566,
                7606
            ],
            [
                7606,
                7631
            ],
            [
                7634,
                7713
            ],
            [
                7722,
                7762
            ],
            [
                7765,
                7799
            ],
            [
                7799,
                7823
            ],
            [
                7823,
                7866
            ],
            [
                7866,
                7882
            ],
            [
                7883,
                7932
            ],
            [
                7932,
                7982
            ],
            [
                7982,
                7996
            ],
            [
                7997,
                8013
            ],
            [
                8013,
                8095
            ],
            [
                8095,
                8141
            ],
            [
                8141,
                8186
            ],
            [
                8189,
                8217
            ],
            [
                8217,
                8244
            ],
            [
                8245,
                8256
            ],
            [
                8257,
                8274
            ],
            [
                8275,
                8303
            ],
            [
                8303,
                8376
            ],
            [
                8377,
                8460
            ],
            [
                8460,
                8462
            ],
            [
                8462,
                8582
            ],
            [
                8582,
                8586
            ],
            [
                8587,
                8630
            ],
            [
                8630,
                8699
            ],
            [
                8700,
                8714
            ],
            [
                8714,
                8757
            ],
            [
                8758,
                8848
            ],
            [
                8848,
                8850
            ],
            [
                8854,
                8913
            ],
            [
                8913,
                8914
            ],
            [
                8915,
                9051
            ],
            [
                9051,
                9062
            ],
            [
                9062,
                9069
            ],
            [
                9071,
                9076
            ],
            [
                9080,
                9106
            ],
            [
                9106,
                9120
            ],
            [
                9120,
                9133
            ],
            [
                9133,
                9161
            ],
            [
                9162,
                9213
            ],
            [
                9215,
                9246
            ],
            [
                9246,
                9247
            ],
            [
                9248,
                9282
            ],
            [
                9283,
                9402
            ],
            [
                9402,
                9453
            ],
            [
                9453,
                9478
            ],
            [
                9478,
                9663
            ],
            [
                9666,
                9718
            ],
            [
                9718,
                9779
            ],
            [
                9780,
                9831
            ],
            [
                9837,
                9844
            ],
            [
                9853,
                9855
            ],
            [
                9855,
                9857
            ],
            [
                9857,
                9927
            ],
            [
                9927,
                9992
            ],
            [
                9992,
                10012
            ],
            [
                10012,
                10051
            ],
            [
                10051,
                10131
            ],
            [
                10131,
                10177
            ],
            [
                10177,
                10185
            ],
            [
                10192,
                10217
            ],
            [
                10218,
                10221
            ],
            [
                10226,
                10231
            ],
            [
                10232,
                10240
            ],
            [
                10240,
                10266
            ],
            [
                10267,
                10384
            ],
            [
                10384,
                10495
            ],
            [
                10496,
                10514
            ],
            [
                10515,
                10550
            ],
            [
                10550,
                10635
            ],
            [
                10635,
                10665
            ],
            [
                10665,
                10694
            ],
            [
                10694,
                10716
            ],
            [
                10720,
                10785
            ]
        ],
        "row_chars": [
            [
                0,
                131
            ],
            [
                131,
                197
            ],
            [
                197,
                294
            ],
            [
                294,
                311
            ],
            [
                311,
                374
            ],
            [
                374,
                420
            ],
            [
                420,
                556
            ],
            [
                556,
                632
            ],
            [
                632,
                769
            ],
            [
                769,
                868
            ],
            [
                868,
                1014
            ],
            [
                1014,
                1233
            ],
            [
                1233,
                1268
            ],
            [
                1268,
                1290
            ],
            [
                1290,
                1314
            ],
            [
                1314,
                1427
            ],
            [
                1427,
                1510
            ],
            [
                1510,
                1510
            ],
            [
                1510,
                1561
            ],
            [
                1561,
                1603
            ],
            [
                1603,
                1628
            ],
            [
                1628,
                1638
            ],
            [
                1638,
                1715
            ],
            [
                1715,
                1772
            ],
            [
                1772,
                1826
            ],
            [
                1826,
                1826
            ],
            [
                1826,
                1826
            ],
            [
                1826,
                1826
            ],
            [
                1826,
                1826
            ],
            [
                1826,
                1826
            ],
            [
                1826,
                1954
            ],
            [
                1954,
                2044
            ],
            [
                2044,
                2133
            ],
            [
                2133,
                2160
            ],
            [
                2160,
                2189
            ],
            [
                2189,
                2260
            ],
            [
                2260,
                2277
            ],
            [
                2277,
                2336
            ],
            [
                2336,
                2355
            ],
            [
                2355,
                2389
            ],
            [
                2389,
                2486
            ],
            [
                2486,
                2486
            ],
            [
                2486,
                2486
            ],
            [
                2486,
                2550
            ],
            [
                2550,
                2550
            ],
            [
                2550,
                2734
            ],
            [
                2734,
                2734
            ],
            [
                2734,
                2842
            ],
            [
                2842,
                2999
            ],
            [
                2999,
                3057
            ],
            [
                3057,
                3125
            ],
            [
                3125,
                3125
            ],
            [
                3125,
                3222
            ],
            [
                3222,
                3300
            ],
            [
                3300,
                3360
            ],
            [
                3360,
                3366
            ],
            [
                3366,
                3401
            ],
            [
                3401,
                3460
            ],
            [
                3460,
                3501
            ],
            [
                3501,
                3501
            ],
            [
                3501,
                3527
            ],
            [
                3527,
                3555
            ],
            [
                3555,
                3555
            ],
            [
                3555,
                3555
            ],
            [
                3555,
                3606
            ],
            [
                3606,
                3626
            ],
            [
                3626,
                3652
            ],
            [
                3652,
                3711
            ],
            [
                3711,
                3752
            ],
            [
                3752,
                3839
            ],
            [
                3839,
                3839
            ],
            [
                3839,
                3839
            ],
            [
                3839,
                3839
            ],
            [
                3839,
                3839
            ],
            [
                3839,
                3839
            ],
            [
                3839,
                3839
            ],
            [
                3839,
                3926
            ],
            [
                3926,
                4013
            ],
            [
                4013,
                4064
            ],
            [
                4064,
                4121
            ],
            [
                4121,
                4121
            ],
            [
                4121,
                4186
            ],
            [
                4186,
                4237
            ],
            [
                4237,
                4266
            ],
            [
                4266,
                4306
            ],
            [
                4306,
                4355
            ],
            [
                4355,
                4410
            ],
            [
                4410,
                4503
            ],
            [
                4503,
                4552
            ],
            [
                4552,
                4590
            ],
            [
                4590,
                4590
            ],
            [
                4590,
                4590
            ],
            [
                4590,
                4590
            ],
            [
                4590,
                4590
            ],
            [
                4590,
                4747
            ],
            [
                4747,
                4747
            ],
            [
                4747,
                4747
            ],
            [
                4747,
                4747
            ],
            [
                4747,
                4802
            ],
            [
                4802,
                4817
            ],
            [
                4817,
                4817
            ],
            [
                4817,
                4817
            ],
            [
                4817,
                4843
            ],
            [
                4843,
                4940
            ],
            [
                4940,
                5011
            ],
            [
                5011,
                5042
            ],
            [
                5042,
                5152
            ],
            [
                5152,
                5202
            ],
            [
                5202,
                5228
            ],
            [
                5228,
                5314
            ],
            [
                5314,
                5357
            ],
            [
                5357,
                5357
            ],
            [
                5357,
                5409
            ],
            [
                5409,
                5447
            ],
            [
                5447,
                5472
            ],
            [
                5472,
                5505
            ],
            [
                5505,
                5585
            ],
            [
                5585,
                5647
            ],
            [
                5647,
                5678
            ],
            [
                5678,
                5725
            ],
            [
                5725,
                5744
            ],
            [
                5744,
                5778
            ],
            [
                5778,
                5800
            ],
            [
                5800,
                5864
            ],
            [
                5864,
                5946
            ],
            [
                5946,
                5979
            ],
            [
                5979,
                6012
            ],
            [
                6012,
                6040
            ],
            [
                6040,
                6040
            ],
            [
                6040,
                6040
            ],
            [
                6040,
                6040
            ],
            [
                6040,
                6100
            ],
            [
                6100,
                6157
            ],
            [
                6157,
                6209
            ],
            [
                6209,
                6241
            ],
            [
                6241,
                6259
            ],
            [
                6259,
                6298
            ],
            [
                6298,
                6359
            ],
            [
                6359,
                6422
            ],
            [
                6422,
                6512
            ],
            [
                6512,
                6592
            ],
            [
                6592,
                6592
            ],
            [
                6592,
                6656
            ],
            [
                6656,
                6656
            ],
            [
                6656,
                6656
            ],
            [
                6656,
                6751
            ],
            [
                6751,
                6790
            ],
            [
                6790,
                6822
            ],
            [
                6822,
                6845
            ],
            [
                6845,
                6904
            ],
            [
                6904,
                6960
            ],
            [
                6960,
                6998
            ],
            [
                6998,
                7008
            ],
            [
                7008,
                7023
            ],
            [
                7023,
                7043
            ],
            [
                7043,
                7049
            ],
            [
                7049,
                7098
            ],
            [
                7098,
                7098
            ],
            [
                7098,
                7153
            ],
            [
                7153,
                7198
            ],
            [
                7198,
                7198
            ],
            [
                7198,
                7278
            ],
            [
                7278,
                7346
            ],
            [
                7346,
                7400
            ],
            [
                7400,
                7430
            ],
            [
                7430,
                7541
            ],
            [
                7541,
                7566
            ],
            [
                7566,
                7606
            ],
            [
                7606,
                7634
            ],
            [
                7634,
                7634
            ],
            [
                7634,
                7765
            ],
            [
                7765,
                7765
            ],
            [
                7765,
                7765
            ],
            [
                7765,
                7765
            ],
            [
                7765,
                7765
            ],
            [
                7765,
                7799
            ],
            [
                7799,
                7823
            ],
            [
                7823,
                7823
            ],
            [
                7823,
                7823
            ],
            [
                7823,
                7866
            ],
            [
                7866,
                7932
            ],
            [
                7932,
                7982
            ],
            [
                7982,
                8013
            ],
            [
                8013,
                8095
            ],
            [
                8095,
                8141
            ],
            [
                8141,
                8189
            ],
            [
                8189,
                8189
            ],
            [
                8189,
                8189
            ],
            [
                8189,
                8217
            ],
            [
                8217,
                8303
            ],
            [
                8303,
                8377
            ],
            [
                8377,
                8462
            ],
            [
                8462,
                8582
            ],
            [
                8582,
                8630
            ],
            [
                8630,
                8714
            ],
            [
                8714,
                8758
            ],
            [
                8758,
                8758
            ],
            [
                8758,
                8758
            ],
            [
                8758,
                8758
            ],
            [
                8758,
                8850
            ],
            [
                8850,
                8915
            ],
            [
                8915,
                8915
            ],
            [
                8915,
                8915
            ],
            [
                8915,
                8915
            ],
            [
                8915,
                9051
            ],
            [
                9051,
                9062
            ],
            [
                9062,
                9106
            ],
            [
                9106,
                9120
            ],
            [
                9120,
                9161
            ],
            [
                9161,
                9161
            ],
            [
                9161,
                9215
            ],
            [
                9215,
                9215
            ],
            [
                9215,
                9215
            ],
            [
                9215,
                9402
            ],
            [
                9402,
                9453
            ],
            [
                9453,
                9453
            ],
            [
                9453,
                9453
            ],
            [
                9453,
                9478
            ],
            [
                9478,
                9666
            ],
            [
                9666,
                9666
            ],
            [
                9666,
                9718
            ],
            [
                9718,
                9779
            ],
            [
                9779,
                9779
            ],
            [
                9779,
                9779
            ],
            [
                9779,
                9857
            ],
            [
                9857,
                9927
            ],
            [
                9927,
                9992
            ],
            [
                9992,
                10012
            ],
            [
                10012,
                10051
            ],
            [
                10051,
                10131
            ],
            [
                10131,
                10177
            ],
            [
                10177,
                10384
            ],
            [
                10384,
                10496
            ],
            [
                10496,
                10550
            ],
            [
                10550,
                10635
            ],
            [
                10635,
                10665
            ],
            [
                10665,
                10694
            ],
            [
                10694,
                10785
            ]
        ]
    }
}