{
    "original": {
        "text": "Alice, on her return from Westmoreland, went direct to Park Lane, whither Lady Glencora and Mr. Palliser had also returned before her. She was to remain with them in London one entire day, and on the morning after that they were to start for Paris. She found Mr. Palliser in close attendance upon his wife. Not that there was anything in his manner which at all implied that he was keeping watch over her, or that he was more with her, or closer to her than a loving husband might wish to be with a young wife; but the mode of life was very different from that which Alice had seen at Matching Priory!\nOn her arrival Mr. Palliser himself received her in the hall, and took her up to his wife before she had taken off her travelling hat. \"We are so much obliged to you, Miss Vavasor,\" he said. \"I feel it quite as deeply as Glencora.\"\n\"Oh, no,\" she said; \"it is I that am under obligation to you for taking me.\"\nHe merely smiled, and shook his head, and then took her up-stairs. On the stairs he said one other word to her: \"You must forgive me if I was cross to you that night she went out among the ruins.\" Alice muttered something,--some little fib of courtesy as to the matter having been forgotten, or never borne in mind; and then they went on to Lady Glencora's room. It seemed to Alice that he was not so big or so much to be dreaded as when she had seen him at Matching. His descent from an expectant, or more than an expectant, Chancellor of the Exchequer, down to a simple, attentive husband, seemed to affect his gait, his voice, and all his demeanour. When he received Alice at the Priory he certainly loomed before her as something great, whereas now his greatness seemed to have fallen from him. We must own that this was hard upon him, seeing that the deed by which he had divested himself of his greatness had been so pure and good!\n\"Dear Alice, this is so good of you! I am all in the midst of packing, and Plantagenet is helping me.\" Plantagenet winced a little under this, as the hero of old must have winced when he was found with the distaff. Mr. Palliser had relinquished his sword of state for the distaff which he had assumed, and could take no glory in the change. There was, too, in his wife's voice the slightest hint of mockery, which, slight as it was, he perhaps thought she might have spared. \"You have nothing left to pack,\" continued Glencora, \"and I don't know what you can do to amuse yourself.\"\n\"I will help you,\" said Alice.\n\"But we have so very nearly done. I think we shall have to pull all the things out, and put them up again, or we shall never get through to-morrow. We couldn't start to-morrow;--could we, Plantagenet?\"\n\"Not very well, as your rooms are ordered in Paris for the next day.\"\n\"As if we couldn't find rooms at every inn on the road. Men are so particular. Now in travelling I should like never to order rooms,--never to know where I was going or when I was going, and to carry everything I wanted in a market-basket.\" Alice, who by this time had followed her friend along the passage to her bedroom, and had seen how widely the packages were spread about, bethought herself that the market-basket should be a large one. \"And I would never travel among Christians. Christians are so slow, and they wear chimney-pot hats everywhere. The further one goes from London among Christians, the more they wear chimney-pot hats. I want Plantagenet to take us to see the Kurds, but he won't.\"\n\"I don't think that would be fair to Miss Vavasor,\" said Mr. Palliser, who had followed them.\n\"Don't put the blame on her head,\" said Lady Glencora. \"Women have always pluck for anything. Wouldn't you like to see a live Kurd, Alice?\"\n\"I don't exactly know where they live,\" said Alice.\n\"Nor I. I have not the remotest idea of the way to the Kurds. You see my joke, don't you, though Plantagenet doesn't? But one knows that they are Eastern, and the East is such a grand idea!\"\n\"I think we'll content ourselves with Rome, or perhaps Naples, on this occasion,\" said Mr. Palliser.\nThe notion of Lady Glencora packing anything for herself was as good a joke as that other one of the Kurds and whey. But she went flitting about from room to room, declaring that this thing must be taken, and that other, till the market-basket would have become very large indeed. Alice was astonished at the extent of the preparations, and the sort of equipage with which they were about to travel. Lady Glencora was taking her own carriage. \"Not that I shall ever use it,\" she said to Alice, \"but he insists upon it, to show that I am not supposed to be taken away in disgrace. He is so good;--isn't he?\"\n\"Very good,\" said Alice. \"I know no one better.\"\n\"And so dull!\" said Lady Glencora. \"But I fancy that all husbands are dull from the nature of their position. If I were a young woman's husband, I shouldn't know what to say to her that wasn't dull.\"\nTwo women and two men servants were to be taken. Alice had received permission to bring her own maid--\"or a dozen, if you want them,\" Lady Glencora had said. \"Mr. Palliser in his present mood would think nothing too much to do for you. If you were to ask him to go among the Kurds, he'd go at once;--or on to Crim Tartary, if you made a point of it.\" But as both Lady Glencora's servants spoke French, and as her own did not, Alice trusted herself in that respect to her cousin. \"You shall have one all to yourself,\" said Lady Glencora. \"I only take two for the same reason that I take the carriage,--just as you let a child go out in her best frock, for a treat, after you've scolded her.\"\nWhen Alice asked why it was supposed that Mr. Palliser was so specially devoted to her, the thing was explained to her. \"You see, my dear, I have told him everything. I always do tell everything. Nobody can say I am not candid. He knows about your not letting me come to your house in the old days. Oh, Alice!--you were wrong then; I shall always say that. But it's done and gone; and things that are done and gone shall be done and gone for me. And I told him all that you said,--about you know what. I have had nothing else to do but make confessions for the last ten days, and when a woman once begins, the more she confesses the better. And I told him that you refused Jeffrey.\"\n\"You didn't?\"\n\"I did indeed, and he likes you the better for that. I think he'd let Jeffrey marry you now if you both wished it;--and then, oh dear!--supposing that you had a son and that we adopted it?\"\n\"Cora, if you go on in that way I will not remain with you.\"\n\"But you must, my dear. You can't escape now. At any rate, you can't when we once get to Paris. Oh dear! you shouldn't grudge me my little naughtinesses. I have been so proper for the last ten days. Do you know I got into a way of driving Dandy and Flirt at the rate of six miles an hour, till I'm sure the poor beasts thought they were always going to a funeral. Poor Dandy and poor Flirt! I shan't see them now for another year.\"\nOn the following morning they breakfasted early, because Mr. Palliser had got into an early habit. He had said that early hours would be good for them. \"But he never tells me why,\" said Lady Glencora. \"I think it is pleasant when people are travelling,\" said Alice. \"It isn't that,\" her cousin answered; \"but we are all to be such particularly good children. It's hardly fair, because he went to sleep last night after dinner while you and I kept ourselves awake: but we needn't do that another night, to be sure.\" After breakfast they all three went to work to do nothing. It was ludicrous and almost painful to see Mr. Palliser wandering about and counting the boxes, as though he could do any good by that. At this special crisis of his life he hated his papers and figures and statistics, and could not apply himself to them. He, whose application had been so unremitting, could apply himself now to nothing. His world had been brought to an abrupt end, and he was awkward at making a new beginning. I believe that they all three were reading novels before one o'clock. Lady Glencora and Alice had determined that they would not leave the house throughout the day. \"Nothing has been said about it, but I regard it as part of the bond that I'm not to go out anywhere. Who knows but what I might be found in Gloucester Square?\" There was, however, no absolute necessity that Mr. Palliser should remain with them; and, at about three, he prepared himself for a solitary walk. He would not go down to the House. All interest in the House was over with him for the present. He had the Speaker's leave to absent himself for the season. Nor would he call on anyone. All his friends knew, or believed they knew, that he had left town. His death and burial had been already chronicled, and were he now to reappear, he could reappear only as a ghost. He was being talked of as the departed one;--or rather, such talk on all sides had now come nearly to an end. The poor Duke of St. Bungay still thought of him with regret when more than ordinarily annoyed by some special grievance coming to him from Mr. Finespun; but even the Duke had become almost reconciled to the present order of things. Mr. Palliser knew better than to disturb all this by showing himself again in public; and prepared himself, therefore, to take another walk under the elms in Kensington Gardens.\nHe had his hat on his head in the hall, and was in the act of putting on his gloves, when there came a knock at the front door. The hall-porter was there, a stout, plethoric personage, not given to many words, who was at this moment standing with his master's umbrella in his hand, looking as though he would fain be of some use to somebody, if any such utility were compatible with the purposes of his existence. Now had come this knock at the door, while the umbrella was still in his hand, and the nature of his visage changed, and it was easy to see that he was oppressed by the temporary multiplicity of his duties. \"Give me the umbrella, John,\" said Mr. Palliser. John gave up the umbrella, and opening the door disclosed Burgo Fitzgerald standing upon the door-step. \"Is Lady Glencora at home?\" asked Burgo, before he had seen the husband. John turned a dismayed face upon his master, as though he knew that the comer ought not to be making a morning call at that house,--as no doubt he did know very well,--and made no instant reply. \"I am not sure,\" said Mr. Palliser, making his way out as he had originally purposed. \"The servant will find out for you.\" Then he went on his way across Park Lane and into the Park, never once turning back his face to see whether Burgo had effected an entrance into the house. Nor did he return a minute earlier than he would otherwise have done. After all, there was something chivalrous about the man.\n\"Yes; Lady Glencora was at home,\" said the porter, not stirring to make any further inquiry. It was no business of his if Mr. Palliser chose to receive such a guest. He had not been desired to say that her ladyship was not at home. Burgo was therefore admitted and shown direct up into the room in which Lady Glencora was sitting. As chance would have it, she was alone. Alice had left her and was in her own chamber, and Lady Glencora was sitting at the window of the small room up-stairs that overlooked the Park. She was seated on a footstool with her face between her hands when Burgo was admitted, thinking of him, and of what the world might have been to her had \"they left her alone,\" as she was in the habit of saying to Alice and to herself.\nShe rose quickly, so that he saw her only as she was rising. \"Ask Miss Vavasor to come to me,\" she said, as the servant left the room; and then she came forward to greet her lover.\n\"Cora,\" he said, dashing at once into his subject--hopelessly, but still with a resolve to do as he had said that he would do. \"Cora, I have come to you, to ask you to go with me.\"\n\"I will not go with you,\" said she.\n\"Do not answer me in that way, without a moment's thought. Everything is arranged--\"\n\"Yes, everything is arranged,\" she said. \"Mr. Fitzgerald, let me ask you to leave me alone, and to behave to me with generosity. Everything is arranged. You can see that my boxes are all prepared for going. Mr. Palliser and I, and my friend, are starting to-morrow. Wish me God-speed and go, and be generous.\"\n\"And is this to be the end of everything?\" He was standing close to her, but hitherto he had only touched her hand at greeting her. \"Give me your hand, Cora,\" he said.\n\"No;--I will never give you my hand again. You should be generous to me and go. This is to be the end of everything,--of everything that is common to you and to me. Go, when I ask you.\"\n\"Cora; did you ever love me?\"\n\"Yes; I did love you. But we were separated, and there was no room for love left between us.\"\n\"You are as dear to me now,--dearer than ever you were. Do not look at me like that. Did you not tell me when we last parted that I might come to you again? Are we children, that others should come between us and separate us like that?\"\n\"Yes, Burgo; we are children. Here is my cousin coming. You must leave me now.\" As she spoke the door was opened and Alice entered the room. \"Miss Vavasor, Mr. Fitzgerald,\" said Lady Glencora. \"I have told him to go and leave me. Now that you have come, Alice, he will perhaps obey me.\"\nAlice was dumbfounded, and knew not how to speak either to him or to her; but she stood with her eyes riveted on the face of the man of whom she had heard so much. Yes; certainly he was very beautiful. She had never before seen man's beauty such as that. She found it quite impossible to speak a word to him then--at the spur of the moment, but she acknowledged the introduction with a slight inclination of the head, and then stood silent, as though she were waiting for him to go.\n\"Mr. Fitzgerald, why do you not leave me and go?\" said Lady Glencora.\nPoor Burgo also found it difficult enough to speak. What could he say? His cause was one which certainly did not admit of being pleaded in the presence of a strange lady; and he might have known from the moment in which he heard Glencora's request that a third person should be summoned to their meeting--and probably did know, that there was no longer any hope for him. It was not on the cards that he should win. But there remained one thing that he must do. He must get himself out of that room; and how was he to effect that?\n\"I had hoped,\" said he, looking at Alice, though he addressed Lady Glencora--\"I had hoped to be allowed to speak to you alone for a few minutes.\"\n\"No, Mr. Fitzgerald; it cannot be so. Alice do not go. I sent for my cousin when I saw you, because I did not choose to be alone with you. I have asked you to go--\"\n\"You perhaps have not understood me?\"\n\"I understand you well enough.\"\n\"Then, Mr. Fitzgerald,\" said Alice, \"why do you not do as Lady Glencora has asked you? You know--you must know, that you ought not to be here.\"\n\"I know nothing of the kind,\" said he, still standing his ground.\n\"Alice,\" said Lady Glencora, \"we will leave Mr. Fitzgerald here, since he drives us from the room.\"\nIn such contests, a woman has ever the best of it at all points. The man plays with a button to his foil, while the woman uses a weapon that can really wound. Burgo knew that he must go,--felt that he must skulk away as best he might, and perhaps hear a low titter of half-suppressed laughter as he went. Even that might be possible. \"No, Lady Glencora,\" he said, \"I will not drive you from the room. As one must be driven out, it shall be I. I own I did think that you would at any rate have been--less hard to me.\" He then turned to go, bowing again very slightly to Miss Vavasor.\nHe was on the threshold of the door before Glencora's voice recalled him. \"Oh my God!\" she said, \"I am hard,--harder than flint. I am cruel. Burgo!\" And he was back with her in a moment, and had taken her by the hand.\n\"Glencora,\" said Alice, \"pray,--pray let him go. Mr. Fitzgerald, if you are a man, do not take advantage of her folly.\"\n\"I will speak to him,\" said Lady Glencora. \"I will speak to him, and then he shall leave me.\" She was holding him by the hand now and turning to him, away from Alice, who had taken her by the arm. \"Burgo,\" she said, repeating his name twice again, with all the passion that she could throw into the word,--\"Burgo, no good can come of this. Now, you must leave me. You must go. I shall stay with my husband as I am bound to do. Because I have wronged you, I will not wrong him also. I loved you;--you know I loved you.\" She still held him by the hand, and was now gazing up into his face, while the tears were streaming from her eyes.\n\"Sir,\" said Alice, \"you have heard from her all that you can care to hear. If you have any feeling of honour in you, you will leave her.\"\n\"I will never leave her, while she tells me that she loves me!\"\n\"Yes, Burgo, you will;--you must! I shall never tell you that again, never. Do as she bids you. Go, and leave us;--but I could not bear that you should tell me that I was hard.\"\n\"You are hard;--hard and cruel, as you said, yourself.\"\n\"Am I? May God forgive you for saying that of me!\"\n\"Then why do you send me away?\"\n\"Because I am a man's wife, and because I care for his honour, if not for my own. Alice, let us go.\"\nHe still held her, but she would have been gone from him had he not stooped over her, and put his arm round her waist. In doing this, I doubt whether he was quicker than she would have been had she chosen to resist him. As it was, he pressed her to his bosom, and, stooping over her, kissed her lips. Then he left her, and making his way out of the room, and down the stairs, got himself out into the street.\n\"Thank God, that he is gone!\" said Alice.\n\"You may say so,\" said Lady Glencora, \"for you have lost nothing!\"\n\"And you have gained everything!\"\n\"Have I? I did not know that I had ever gained anything, as yet. The only human being to whom I have ever yet given my whole heart,--the only thing that I have ever really loved, has just gone from me for ever, and you bid me thank God that I have lost him. There is no room for thankfulness in any of it;--either in the love or in the loss. It is all wretchedness from first to last!\"\n\"At any rate, he understands now that you meant it when you told him to leave you.\"\n\"Of course I meant it. I am beginning to know myself by degrees. As for running away with him, I have not the courage to do it. I can think of it, scheme for it, wish for it;--but as for doing it, that is beyond me. Mr. Palliser is quite safe. He need not try to coax me to remain.\"\nAlice knew that it was useless to argue with her, so she came and sat over her,--for Lady Glencora had again placed herself on the stool by the window,--and tried to sooth her by smoothing her hair, and nursing her like a child.\n\"Of course I know that I ought to stay where I am,\" she said, breaking out, almost with rage, and speaking with quick, eager voice. \"I am not such a fool as to mistake what I should be if I left my husband, and went to live with that man as his mistress. You don't suppose that I should think that sort of life very blessed. But why have I been brought to such a pass as this? And, as for female purity! Ah! What was their idea of purity when they forced me, like ogres, to marry a man for whom they knew I never cared? Had I gone with him,--had I now eloped with that man who ought to have been my husband,--whom would a just God have punished worst,--me, or those two old women and my uncle, who tortured me into this marriage?\"\n\"Come, Cora,--be silent.\"\n\"I won't be silent! You have had the making of your own lot. You have done what you liked, and no one has interfered with you. You have suffered, too; but you, at any rate, can respect yourself.\"\n\"And so can you, Cora,--thoroughly, now.\"\n\"How;--when he kissed me, and I could hardly restrain myself from giving him back his kiss tenfold, could I respect myself? But it is all sin. I sin towards my husband, feigning that I love him; and I sin in loving that other man, who should have been my husband. There;--I hear Mr. Palliser at the door. Come away with me; or rather, stay, for he will come up here, and you can keep him in talk while I try to recover myself.\"\nMr. Palliser did at once as his wife had said, and came up-stairs to the little front room, as soon as he had deposited his hat in the hall. Alice was, in fact, in doubt what she should do, as to mentioning, or omitting to mention, Mr. Fitzgerald's name. In an ordinary way, it would be natural that she should name any visitor who had called, and she specially disliked the idea of remaining silent because that visitor had come as the lover of her host's wife. But, on the other hand, she owed much to Lady Glencora; and there was no imperative reason, as things had gone, why she should make mischief. There was no further danger to be apprehended. But Mr. Palliser at once put an end to her doubts. \"You have had a visitor here?\" said he.\n\"Yes,\" said Alice.\n\"I saw him as I went out,\" said Mr. Palliser. \"Indeed, I met him at the hall door. He, of course, was wrong to come here;--so wrong, that he deserves punishment, if there were any punishment for such offences.\"\n\"He has been punished, I think,\" said Alice.\n\"But as for Glencora,\" continued Mr. Palliser, without any apparent notice of what Alice had said, \"I thought it better that she should see him or not, as she should herself decide.\"\n\"She had no choice in the matter. As it turned out, he was shown up here at once. She sent for me, and I think she was right to do that.\"\n\"Glencora was alone when he came in?\"\n\"For a minute or two,--till I could get to her.\"\n\"I have no questions to ask about it,\" said Mr. Palliser, after waiting for a few moments. He had probably thought that Alice would say something further. \"I am very glad that you were within reach of her, as otherwise her position might have been painful. For her, and for me perhaps, it may be as well that he has been here. As for him, I can only say, that I am forced to suppose him to be a villain. What a man does when driven by passion, I can forgive; but that he should deliberately plan schemes to ruin both her and me, is what I can hardly understand.\" As he made this little speech I wonder whether his conscience said anything to him about Lady Dumbello, and a certain evening in his own life, on which he had ventured to call that lady, Griselda.\nThe little party of three dined together very quietly, and after dinner they all went to work with their novels. Before long Alice saw that Mr. Palliser was yawning, and she began to understand how much he had given up in order that his wife might be secure. It was then, when he had left the room for a few minutes, in order that he might wake himself by walking about the house, that Glencora told Alice of his yawning down at Matching. \"I used to think that he would fall in pieces. What are we to do about it?\"\n\"Don't seem to notice it,\" said Alice.\n\"That's all very well,\" said the other; \"but he'll set us off yawning as bad as himself, and then he'll notice it. He has given himself up to politics, till nothing else has any salt in it left for him. I cannot think why such a man as that wanted a wife at all.\"\n\"You are very hard upon him, Cora.\"\n\"I wish you were his wife, with all my heart. But, of course, I know why he got married. And I ought to feel for him as he has been so grievously disappointed.\" Then Mr. Palliser having walked off his sleep, returned to the room, and the remainder of the evening was passed in absolute tranquillity.\nBurgo Fitzgerald, when he left the house, turned back into Grosvenor Square, not knowing, at first, whither he was going. He took himself as far as his uncle's door, and then, having paused there for a moment, hurried on. For half an hour, or thereabouts, something like true feeling was at work within his heart. He had once more pressed to his bosom the woman he had, at any rate, thought that he had loved. He had had his arm round her, and had kissed her, and the tone with which she had called him by his name was still ringing in his ears, \"Burgo!\" He repeated his own name audibly to himself, as though in this way he could recall her voice. He comforted himself for a minute with the conviction that she loved him. He felt,--for a moment,--that he could live on such consolation as that! But among mortals there could, in truth, hardly be one with whom such consolation would go a shorter way. He was a man who required to have such comfort backed by pats and curaoa to a very large extent, and now it might be doubted whether the amount of pats and curaoa at his command would last him much longer.\nHe would not go in and tell his aunt at once of his failure, as he could gain nothing by doing so. Indeed, he thought that he would not tell his aunt at all. So he turned back from Grosvenor Square, and went down to his club in St. James's Street, feeling that billiards and brandy-and-water might, for the present, be the best restorative. But, as he went back, he blamed himself very greatly in the matter of those bank-notes which he had allowed Lady Monk to take from him. How had it come to pass that he had been such a dupe in her hands? When he entered his club in St. James's Street his mind had left Lady Glencora, and was hard at work considering how he might best contrive to get that spoil out of his aunt's possession.",
        "paragraph_chars": [
            [
                0,
                602
            ],
            [
                602,
                834
            ],
            [
                834,
                911
            ],
            [
                911,
                1849
            ],
            [
                1849,
                2431
            ],
            [
                2431,
                2462
            ],
            [
                2462,
                2664
            ],
            [
                2664,
                2734
            ],
            [
                2734,
                3439
            ],
            [
                3439,
                3533
            ],
            [
                3533,
                3673
            ],
            [
                3673,
                3725
            ],
            [
                3725,
                3916
            ],
            [
                3916,
                4017
            ],
            [
                4017,
                4624
            ],
            [
                4624,
                4673
            ],
            [
                4673,
                4873
            ],
            [
                4873,
                5564
            ],
            [
                5564,
                6247
            ],
            [
                6247,
                6261
            ],
            [
                6261,
                6451
            ],
            [
                6451,
                6512
            ],
            [
                6512,
                6944
            ],
            [
                6944,
                9310
            ],
            [
                9310,
                10757
            ],
            [
                10757,
                11508
            ],
            [
                11508,
                11689
            ],
            [
                11689,
                11870
            ],
            [
                11870,
                11906
            ],
            [
                11906,
                11991
            ],
            [
                11991,
                12301
            ],
            [
                12301,
                12469
            ],
            [
                12469,
                12655
            ],
            [
                12655,
                12685
            ],
            [
                12685,
                12779
            ],
            [
                12779,
                13016
            ],
            [
                13016,
                13303
            ],
            [
                13303,
                13786
            ],
            [
                13786,
                13856
            ],
            [
                13856,
                14386
            ],
            [
                14386,
                14532
            ],
            [
                14532,
                14697
            ],
            [
                14697,
                14735
            ],
            [
                14735,
                14767
            ],
            [
                14767,
                14911
            ],
            [
                14911,
                14977
            ],
            [
                14977,
                15077
            ],
            [
                15077,
                15660
            ],
            [
                15660,
                15878
            ],
            [
                15878,
                15998
            ],
            [
                15998,
                16632
            ],
            [
                16632,
                16770
            ],
            [
                16770,
                16834
            ],
            [
                16834,
                17012
            ],
            [
                17012,
                17068
            ],
            [
                17068,
                17119
            ],
            [
                17119,
                17151
            ],
            [
                17151,
                17252
            ],
            [
                17252,
                17661
            ],
            [
                17661,
                17703
            ],
            [
                17703,
                17770
            ],
            [
                17770,
                17804
            ],
            [
                17804,
                18190
            ],
            [
                18190,
                18274
            ],
            [
                18274,
                18557
            ],
            [
                18557,
                18786
            ],
            [
                18786,
                19517
            ],
            [
                19517,
                19543
            ],
            [
                19543,
                19739
            ],
            [
                19739,
                19781
            ],
            [
                19781,
                20209
            ],
            [
                20209,
                20952
            ],
            [
                20952,
                20971
            ],
            [
                20971,
                21182
            ],
            [
                21182,
                21227
            ],
            [
                21227,
                21410
            ],
            [
                21410,
                21548
            ],
            [
                21548,
                21586
            ],
            [
                21586,
                21635
            ],
            [
                21635,
                22395
            ],
            [
                22395,
                22910
            ],
            [
                22910,
                22949
            ],
            [
                22949,
                23213
            ],
            [
                23213,
                23249
            ],
            [
                23249,
                23549
            ],
            [
                23549,
                24657
            ],
            [
                24657,
                25388
            ]
        ],
        "segment_chars": [
            [
                0,
                135
            ],
            [
                135,
                249
            ],
            [
                249,
                307
            ],
            [
                307,
                602
            ],
            [
                602,
                737
            ],
            [
                737,
                793
            ],
            [
                793,
                834
            ],
            [
                834,
                911
            ],
            [
                911,
                978
            ],
            [
                978,
                1108
            ],
            [
                1108,
                1274
            ],
            [
                1274,
                1379
            ],
            [
                1379,
                1564
            ],
            [
                1564,
                1710
            ],
            [
                1710,
                1849
            ],
            [
                1849,
                1886
            ],
            [
                1886,
                1952
            ],
            [
                1952,
                2064
            ],
            [
                2064,
                2190
            ],
            [
                2190,
                2324
            ],
            [
                2324,
                2431
            ],
            [
                2431,
                2462
            ],
            [
                2462,
                2496
            ],
            [
                2496,
                2610
            ],
            [
                2610,
                2664
            ],
            [
                2664,
                2734
            ],
            [
                2734,
                2790
            ],
            [
                2790,
                2813
            ],
            [
                2813,
                2975
            ],
            [
                2975,
                3177
            ],
            [
                3177,
                3221
            ],
            [
                3221,
                3288
            ],
            [
                3288,
                3376
            ],
            [
                3376,
                3439
            ],
            [
                3439,
                3533
            ],
            [
                3533,
                3588
            ],
            [
                3588,
                3627
            ],
            [
                3627,
                3673
            ],
            [
                3673,
                3725
            ],
            [
                3725,
                3787
            ],
            [
                3787,
                3843
            ],
            [
                3843,
                3916
            ],
            [
                3916,
                4017
            ],
            [
                4017,
                4134
            ],
            [
                4134,
                4298
            ],
            [
                4298,
                4417
            ],
            [
                4417,
                4460
            ],
            [
                4460,
                4597
            ],
            [
                4597,
                4624
            ],
            [
                4624,
                4649
            ],
            [
                4649,
                4673
            ],
            [
                4673,
                4688
            ],
            [
                4688,
                4708
            ],
            [
                4708,
                4783
            ],
            [
                4783,
                4873
            ],
            [
                4873,
                4922
            ],
            [
                4922,
                5031
            ],
            [
                5031,
                5109
            ],
            [
                5109,
                5224
            ],
            [
                5224,
                5352
            ],
            [
                5352,
                5410
            ],
            [
                5410,
                5564
            ],
            [
                5564,
                5684
            ],
            [
                5684,
                5731
            ],
            [
                5731,
                5760
            ],
            [
                5760,
                5792
            ],
            [
                5792,
                5863
            ],
            [
                5863,
                5921
            ],
            [
                5921,
                6010
            ],
            [
                6010,
                6066
            ],
            [
                6066,
                6205
            ],
            [
                6205,
                6247
            ],
            [
                6247,
                6261
            ],
            [
                6261,
                6314
            ],
            [
                6314,
                6451
            ],
            [
                6451,
                6512
            ],
            [
                6512,
                6536
            ],
            [
                6536,
                6558
            ],
            [
                6558,
                6608
            ],
            [
                6608,
                6617
            ],
            [
                6617,
                6666
            ],
            [
                6666,
                6711
            ],
            [
                6711,
                6876
            ],
            [
                6876,
                6903
            ],
            [
                6903,
                6944
            ],
            [
                6944,
                7043
            ],
            [
                7043,
                7096
            ],
            [
                7096,
                7145
            ],
            [
                7145,
                7210
            ],
            [
                7210,
                7303
            ],
            [
                7303,
                7459
            ],
            [
                7459,
                7518
            ],
            [
                7518,
                7654
            ],
            [
                7654,
                7774
            ],
            [
                7774,
                7857
            ],
            [
                7857,
                7948
            ],
            [
                7948,
                8018
            ],
            [
                8018,
                8113
            ],
            [
                8113,
                8215
            ],
            [
                8215,
                8274
            ],
            [
                8274,
                8421
            ],
            [
                8421,
                8456
            ],
            [
                8456,
                8517
            ],
            [
                8517,
                8578
            ],
            [
                8578,
                8607
            ],
            [
                8607,
                8675
            ],
            [
                8675,
                8789
            ],
            [
                8789,
                8899
            ],
            [
                8899,
                9132
            ],
            [
                9132,
                9310
            ],
            [
                9310,
                9438
            ],
            [
                9438,
                9724
            ],
            [
                9724,
                9931
            ],
            [
                9931,
                9980
            ],
            [
                9980,
                10084
            ],
            [
                10084,
                10112
            ],
            [
                10112,
                10157
            ],
            [
                10157,
                10352
            ],
            [
                10352,
                10438
            ],
            [
                10438,
                10475
            ],
            [
                10475,
                10630
            ],
            [
                10630,
                10700
            ],
            [
                10700,
                10757
            ],
            [
                10757,
                10850
            ],
            [
                10850,
                10923
            ],
            [
                10923,
                10989
            ],
            [
                10989,
                11088
            ],
            [
                11088,
                11128
            ],
            [
                11128,
                11273
            ],
            [
                11273,
                11508
            ],
            [
                11508,
                11569
            ],
            [
                11569,
                11689
            ],
            [
                11689,
                11816
            ],
            [
                11816,
                11870
            ],
            [
                11870,
                11906
            ],
            [
                11906,
                11965
            ],
            [
                11965,
                11991
            ],
            [
                11991,
                12032
            ],
            [
                12032,
                12120
            ],
            [
                12120,
                12144
            ],
            [
                12144,
                12198
            ],
            [
                12198,
                12257
            ],
            [
                12257,
                12301
            ],
            [
                12301,
                12344
            ],
            [
                12344,
                12433
            ],
            [
                12433,
                12469
            ],
            [
                12469,
                12512
            ],
            [
                12512,
                12549
            ],
            [
                12549,
                12634
            ],
            [
                12634,
                12655
            ],
            [
                12655,
                12685
            ],
            [
                12685,
                12707
            ],
            [
                12707,
                12779
            ],
            [
                12779,
                12835
            ],
            [
                12835,
                12864
            ],
            [
                12864,
                12936
            ],
            [
                12936,
                13016
            ],
            [
                13016,
                13046
            ],
            [
                13046,
                13072
            ],
            [
                13072,
                13096
            ],
            [
                13096,
                13157
            ],
            [
                13157,
                13209
            ],
            [
                13209,
                13246
            ],
            [
                13246,
                13303
            ],
            [
                13303,
                13467
            ],
            [
                13467,
                13505
            ],
            [
                13505,
                13558
            ],
            [
                13558,
                13786
            ],
            [
                13786,
                13836
            ],
            [
                13836,
                13856
            ],
            [
                13856,
                13908
            ],
            [
                13908,
                13927
            ],
            [
                13927,
                14227
            ],
            [
                14227,
                14271
            ],
            [
                14271,
                14317
            ],
            [
                14317,
                14386
            ],
            [
                14386,
                14532
            ],
            [
                14532,
                14570
            ],
            [
                14570,
                14587
            ],
            [
                14587,
                14671
            ],
            [
                14671,
                14697
            ],
            [
                14697,
                14735
            ],
            [
                14735,
                14767
            ],
            [
                14767,
                14854
            ],
            [
                14854,
                14911
            ],
            [
                14911,
                14977
            ],
            [
                14977,
                15077
            ],
            [
                15077,
                15142
            ],
            [
                15142,
                15236
            ],
            [
                15236,
                15382
            ],
            [
                15382,
                15411
            ],
            [
                15411,
                15478
            ],
            [
                15478,
                15594
            ],
            [
                15594,
                15660
            ],
            [
                15660,
                15734
            ],
            [
                15734,
                15747
            ],
            [
                15747,
                15789
            ],
            [
                15789,
                15801
            ],
            [
                15801,
                15809
            ],
            [
                15809,
                15878
            ],
            [
                15878,
                15927
            ],
            [
                15927,
                15998
            ],
            [
                15998,
                16041
            ],
            [
                16041,
                16092
            ],
            [
                16092,
                16195
            ],
            [
                16195,
                16338
            ],
            [
                16338,
                16362
            ],
            [
                16362,
                16375
            ],
            [
                16375,
                16425
            ],
            [
                16425,
                16480
            ],
            [
                16480,
                16517
            ],
            [
                16517,
                16632
            ],
            [
                16632,
                16707
            ],
            [
                16707,
                16770
            ],
            [
                16770,
                16834
            ],
            [
                16834,
                16868
            ],
            [
                16868,
                16910
            ],
            [
                16910,
                16930
            ],
            [
                16930,
                17012
            ],
            [
                17012,
                17068
            ],
            [
                17068,
                17075
            ],
            [
                17075,
                17119
            ],
            [
                17119,
                17151
            ],
            [
                17151,
                17233
            ],
            [
                17233,
                17252
            ],
            [
                17252,
                17371
            ],
            [
                17371,
                17472
            ],
            [
                17472,
                17553
            ],
            [
                17553,
                17661
            ],
            [
                17661,
                17691
            ],
            [
                17691,
                17703
            ],
            [
                17703,
                17770
            ],
            [
                17770,
                17804
            ],
            [
                17804,
                17813
            ],
            [
                17813,
                17869
            ],
            [
                17869,
                18062
            ],
            [
                18062,
                18146
            ],
            [
                18146,
                18190
            ],
            [
                18190,
                18274
            ],
            [
                18274,
                18297
            ],
            [
                18297,
                18339
            ],
            [
                18339,
                18402
            ],
            [
                18402,
                18490
            ],
            [
                18490,
                18518
            ],
            [
                18518,
                18557
            ],
            [
                18557,
                18786
            ],
            [
                18786,
                18918
            ],
            [
                18918,
                19041
            ],
            [
                19041,
                19111
            ],
            [
                19111,
                19163
            ],
            [
                19163,
                19190
            ],
            [
                19190,
                19194
            ],
            [
                19194,
                19306
            ],
            [
                19306,
                19517
            ],
            [
                19517,
                19543
            ],
            [
                19543,
                19563
            ],
            [
                19563,
                19604
            ],
            [
                19604,
                19670
            ],
            [
                19670,
                19739
            ],
            [
                19739,
                19781
            ],
            [
                19781,
                19905
            ],
            [
                19905,
                19924
            ],
            [
                19924,
                20045
            ],
            [
                20045,
                20086
            ],
            [
                20086,
                20209
            ],
            [
                20209,
                20350
            ],
            [
                20350,
                20464
            ],
            [
                20464,
                20672
            ],
            [
                20672,
                20814
            ],
            [
                20814,
                20861
            ],
            [
                20861,
                20912
            ],
            [
                20912,
                20943
            ],
            [
                20943,
                20952
            ],
            [
                20952,
                20971
            ],
            [
                20971,
                21017
            ],
            [
                21017,
                21054
            ],
            [
                21054,
                21182
            ],
            [
                21182,
                21227
            ],
            [
                21227,
                21410
            ],
            [
                21410,
                21444
            ],
            [
                21444,
                21492
            ],
            [
                21492,
                21548
            ],
            [
                21548,
                21586
            ],
            [
                21586,
                21635
            ],
            [
                21635,
                21726
            ],
            [
                21726,
                21790
            ],
            [
                21790,
                21892
            ],
            [
                21892,
                21962
            ],
            [
                21962,
                22039
            ],
            [
                22039,
                22198
            ],
            [
                22198,
                22395
            ],
            [
                22395,
                22508
            ],
            [
                22508,
                22654
            ],
            [
                22654,
                22834
            ],
            [
                22834,
                22881
            ],
            [
                22881,
                22910
            ],
            [
                22910,
                22949
            ],
            [
                22949,
                23064
            ],
            [
                23064,
                23152
            ],
            [
                23152,
                23213
            ],
            [
                23213,
                23249
            ],
            [
                23249,
                23295
            ],
            [
                23295,
                23338
            ],
            [
                23338,
                23410
            ],
            [
                23410,
                23549
            ],
            [
                23549,
                23671
            ],
            [
                23671,
                23771
            ],
            [
                23771,
                23863
            ],
            [
                23863,
                23959
            ],
            [
                23959,
                24104
            ],
            [
                24104,
                24198
            ],
            [
                24198,
                24272
            ],
            [
                24272,
                24345
            ],
            [
                24345,
                24451
            ],
            [
                24451,
                24657
            ],
            [
                24657,
                24756
            ],
            [
                24756,
                24815
            ],
            [
                24815,
                24998
            ],
            [
                24998,
                25134
            ],
            [
                25134,
                25201
            ],
            [
                25201,
                25388
            ]
        ],
        "overlap_chars": [
            [
                0,
                30
            ],
            [
                34,
                65
            ],
            [
                74,
                104
            ],
            [
                133,
                135
            ],
            [
                135,
                145
            ],
            [
                153,
                176
            ],
            [
                184,
                248
            ],
            [
                249,
                307
            ],
            [
                335,
                348
            ],
            [
                362,
                404
            ],
            [
                509,
                514
            ],
            [
                532,
                555
            ],
            [
                567,
                602
            ],
            [
                602,
                629
            ],
            [
                638,
                691
            ],
            [
                735,
                736
            ],
            [
                737,
                793
            ],
            [
                793,
                834
            ],
            [
                834,
                876
            ],
            [
                877,
                911
            ],
            [
                911,
                947
            ],
            [
                976,
                978
            ],
            [
                978,
                1009
            ],
            [
                1021,
                1107
            ],
            [
                1108,
                1122
            ],
            [
                1135,
                1201
            ],
            [
                1225,
                1274
            ],
            [
                1274,
                1379
            ],
            [
                1379,
                1408
            ],
            [
                1437,
                1523
            ],
            [
                1553,
                1563
            ],
            [
                1849,
                1886
            ],
            [
                1886,
                1890
            ],
            [
                1895,
                1952
            ],
            [
                1952,
                1990
            ],
            [
                2062,
                2064
            ],
            [
                2209,
                2225
            ],
            [
                2226,
                2262
            ],
            [
                2282,
                2323
            ],
            [
                2431,
                2462
            ],
            [
                2462,
                2474
            ],
            [
                2478,
                2489
            ],
            [
                2494,
                2496
            ],
            [
                2496,
                2520
            ],
            [
                2562,
                2580
            ],
            [
                2599,
                2601
            ],
            [
                2608,
                2610
            ],
            [
                2610,
                2621
            ],
            [
                2640,
                2664
            ],
            [
                2664,
                2734
            ],
            [
                2734,
                2790
            ],
            [
                2813,
                2816
            ],
            [
                2865,
                2866
            ],
            [
                2817,
                2853
            ],
            [
                2860,
                2865
            ],
            [
                2965,
                2966
            ],
            [
                2868,
                2899
            ],
            [
                3178,
                3221
            ],
            [
                3221,
                3288
            ],
            [
                3288,
                3376
            ],
            [
                3376,
                3439
            ],
            [
                3439,
                3508
            ],
            [
                3531,
                3533
            ],
            [
                3627,
                3673
            ],
            [
                3673,
                3725
            ],
            [
                3725,
                3787
            ],
            [
                3843,
                3916
            ],
            [
                3916,
                4017
            ],
            [
                4036,
                4044
            ],
            [
                4142,
                4242
            ],
            [
                4298,
                4352
            ],
            [
                4415,
                4417
            ],
            [
                4417,
                4459
            ],
            [
                4460,
                4597
            ],
            [
                4597,
                4611
            ],
            [
                4616,
                4624
            ],
            [
                4624,
                4649
            ],
            [
                4649,
                4673
            ],
            [
                4673,
                4688
            ],
            [
                4688,
                4708
            ],
            [
                4708,
                4747
            ],
            [
                4781,
                4783
            ],
            [
                4783,
                4873
            ],
            [
                4873,
                4922
            ],
            [
                5231,
                5281
            ],
            [
                5299,
                5304
            ],
            [
                5290,
                5298
            ],
            [
                5395,
                5408
            ],
            [
                5390,
                5394
            ],
            [
                5352,
                5387
            ],
            [
                5666,
                5675
            ],
            [
                5606,
                5618
            ],
            [
                5644,
                5646
            ],
            [
                5569,
                5574
            ],
            [
                5682,
                5684
            ],
            [
                5684,
                5731
            ],
            [
                5731,
                5760
            ],
            [
                5760,
                5792
            ],
            [
                5792,
                5863
            ],
            [
                6010,
                6042
            ],
            [
                6045,
                6066
            ],
            [
                6066,
                6205
            ],
            [
                6205,
                6247
            ],
            [
                6247,
                6261
            ],
            [
                6261,
                6314
            ],
            [
                6314,
                6374
            ],
            [
                6377,
                6385
            ],
            [
                6397,
                6429
            ],
            [
                6435,
                6451
            ],
            [
                6451,
                6493
            ],
            [
                6501,
                6512
            ],
            [
                6512,
                6536
            ],
            [
                6536,
                6558
            ],
            [
                6617,
                6666
            ],
            [
                6666,
                6709
            ],
            [
                6944,
                7013
            ],
            [
                7050,
                7096
            ],
            [
                7459,
                7518
            ],
            [
                7518,
                7524
            ],
            [
                7539,
                7654
            ],
            [
                7774,
                7795
            ],
            [
                7796,
                7857
            ],
            [
                7857,
                7947
            ],
            [
                7963,
                7967
            ],
            [
                7978,
                7982
            ],
            [
                7968,
                7971
            ],
            [
                7983,
                8018
            ],
            [
                8018,
                8045
            ],
            [
                8057,
                8092
            ],
            [
                8111,
                8113
            ],
            [
                8274,
                8296
            ],
            [
                8321,
                8333
            ],
            [
                8341,
                8362
            ],
            [
                8364,
                8378
            ],
            [
                8380,
                8391
            ],
            [
                8400,
                8421
            ],
            [
                8421,
                8456
            ],
            [
                8456,
                8517
            ],
            [
                8578,
                8607
            ],
            [
                8607,
                8622
            ],
            [
                8632,
                8640
            ],
            [
                8652,
                8675
            ],
            [
                9134,
                9144
            ],
            [
                9222,
                9230
            ],
            [
                9251,
                9258
            ],
            [
                9267,
                9310
            ],
            [
                9310,
                9312
            ],
            [
                9354,
                9364
            ],
            [
                9344,
                9348
            ],
            [
                9372,
                9386
            ],
            [
                9321,
                9324
            ],
            [
                9350,
                9353
            ],
            [
                9387,
                9393
            ],
            [
                9395,
                9438
            ],
            [
                9438,
                9453
            ],
            [
                9751,
                9760
            ],
            [
                9803,
                9806
            ],
            [
                10038,
                10063
            ],
            [
                9693,
                9696
            ],
            [
                10078,
                10083
            ],
            [
                10084,
                10112
            ],
            [
                10112,
                10156
            ],
            [
                10157,
                10250
            ],
            [
                10286,
                10287
            ],
            [
                10325,
                10351
            ],
            [
                10352,
                10416
            ],
            [
                10436,
                10438
            ],
            [
                10438,
                10475
            ],
            [
                10475,
                10558
            ],
            [
                10568,
                10592
            ],
            [
                10619,
                10630
            ],
            [
                10630,
                10700
            ],
            [
                10700,
                10757
            ],
            [
                10757,
                10806
            ],
            [
                10848,
                10850
            ],
            [
                10989,
                11087
            ],
            [
                11088,
                11126
            ],
            [
                11173,
                11174
            ],
            [
                11197,
                11204
            ],
            [
                11288,
                11334
            ],
            [
                11126,
                11127
            ],
            [
                11273,
                11280
            ],
            [
                11360,
                11371
            ],
            [
                11340,
                11345
            ],
            [
                11375,
                11425
            ],
            [
                11452,
                11455
            ],
            [
                11483,
                11485
            ],
            [
                11372,
                11375
            ],
            [
                11506,
                11508
            ],
            [
                11508,
                11524
            ],
            [
                11567,
                11569
            ],
            [
                11569,
                11689
            ],
            [
                11689,
                11738
            ],
            [
                11814,
                11816
            ],
            [
                11816,
                11834
            ],
            [
                11843,
                11870
            ],
            [
                11870,
                11906
            ],
            [
                11906,
                11965
            ],
            [
                11965,
                11987
            ],
            [
                11991,
                12032
            ],
            [
                12032,
                12120
            ],
            [
                12120,
                12144
            ],
            [
                12144,
                12198
            ],
            [
                12198,
                12245
            ],
            [
                12255,
                12257
            ],
            [
                12257,
                12301
            ],
            [
                12301,
                12341
            ],
            [
                12434,
                12469
            ],
            [
                12469,
                12473
            ],
            [
                12475,
                12512
            ],
            [
                12512,
                12549
            ],
            [
                12549,
                12584
            ],
            [
                12632,
                12634
            ],
            [
                12634,
                12655
            ],
            [
                12655,
                12685
            ],
            [
                12685,
                12707
            ],
            [
                12707,
                12779
            ],
            [
                12779,
                12787
            ],
            [
                12808,
                12814
            ],
            [
                12796,
                12801
            ],
            [
                12815,
                12835
            ],
            [
                12835,
                12864
            ],
            [
                12864,
                12936
            ],
            [
                12936,
                12976
            ],
            [
                12992,
                13016
            ],
            [
                13016,
                13046
            ],
            [
                13046,
                13072
            ],
            [
                13072,
                13096
            ],
            [
                13096,
                13156
            ],
            [
                13157,
                13209
            ],
            [
                13209,
                13246
            ],
            [
                13246,
                13303
            ],
            [
                13303,
                13324
            ],
            [
                13375,
                13467
            ],
            [
                13467,
                13505
            ],
            [
                13558,
                13610
            ],
            [
                13642,
                13695
            ],
            [
                13719,
                13753
            ],
            [
                13763,
                13786
            ],
            [
                13786,
                13826
            ],
            [
                13833,
                13836
            ],
            [
                13836,
                13856
            ],
            [
                13856,
                13908
            ],
            [
                13908,
                13926
            ],
            [
                14463,
                14478
            ],
            [
                14499,
                14532
            ],
            [
                14532,
                14551
            ],
            [
                14568,
                14570
            ],
            [
                14587,
                14607
            ],
            [
                14624,
                14671
            ],
            [
                14671,
                14693
            ],
            [
                14697,
                14735
            ],
            [
                14735,
                14767
            ],
            [
                14767,
                14854
            ],
            [
                14864,
                14877
            ],
            [
                14879,
                14911
            ],
            [
                14911,
                14977
            ],
            [
                14977,
                15077
            ],
            [
                15236,
                15246
            ],
            [
                15247,
                15262
            ],
            [
                15349,
                15350
            ],
            [
                15278,
                15310
            ],
            [
                15380,
                15382
            ],
            [
                15411,
                15478
            ],
            [
                15526,
                15574
            ],
            [
                15576,
                15594
            ],
            [
                15594,
                15614
            ],
            [
                15658,
                15660
            ],
            [
                15660,
                15683
            ],
            [
                15696,
                15733
            ],
            [
                15734,
                15747
            ],
            [
                15747,
                15755
            ],
            [
                15757,
                15767
            ],
            [
                15777,
                15789
            ],
            [
                15789,
                15801
            ],
            [
                15801,
                15809
            ],
            [
                15809,
                15878
            ],
            [
                15878,
                15907
            ],
            [
                15915,
                15927
            ],
            [
                15927,
                15998
            ],
            [
                15998,
                16041
            ],
            [
                16041,
                16092
            ],
            [
                16092,
                16127
            ],
            [
                16193,
                16195
            ],
            [
                16195,
                16212
            ],
            [
                16244,
                16302
            ],
            [
                16304,
                16338
            ],
            [
                16338,
                16342
            ],
            [
                16362,
                16375
            ],
            [
                16375,
                16425
            ],
            [
                16425,
                16480
            ],
            [
                16503,
                16517
            ],
            [
                16517,
                16632
            ],
            [
                16632,
                16652
            ],
            [
                16707,
                16770
            ],
            [
                16770,
                16834
            ],
            [
                16834,
                16856
            ],
            [
                16858,
                16868
            ],
            [
                16868,
                16910
            ],
            [
                16930,
                16947
            ],
            [
                16949,
                17012
            ],
            [
                17012,
                17020
            ],
            [
                17028,
                17055
            ],
            [
                17057,
                17068
            ],
            [
                17068,
                17075
            ],
            [
                17075,
                17110
            ],
            [
                17116,
                17119
            ],
            [
                17119,
                17151
            ],
            [
                17151,
                17233
            ],
            [
                17233,
                17252
            ],
            [
                17252,
                17270
            ],
            [
                17338,
                17341
            ],
            [
                17275,
                17278
            ],
            [
                17313,
                17315
            ],
            [
                17536,
                17553
            ],
            [
                17553,
                17661
            ],
            [
                17661,
                17671
            ],
            [
                17673,
                17691
            ],
            [
                17691,
                17703
            ],
            [
                17703,
                17770
            ],
            [
                17770,
                17804
            ],
            [
                17804,
                17813
            ],
            [
                17813,
                17869
            ],
            [
                17869,
                17934
            ],
            [
                17937,
                17981
            ],
            [
                17983,
                18062
            ],
            [
                18062,
                18095
            ],
            [
                18144,
                18146
            ],
            [
                18146,
                18190
            ],
            [
                18190,
                18274
            ],
            [
                18274,
                18297
            ],
            [
                18297,
                18339
            ],
            [
                18339,
                18402
            ],
            [
                18402,
                18420
            ],
            [
                18450,
                18490
            ],
            [
                18490,
                18516
            ],
            [
                18557,
                18562
            ],
            [
                18614,
                18626
            ],
            [
                18694,
                18696
            ],
            [
                18602,
                18606
            ],
            [
                18710,
                18786
            ],
            [
                18786,
                18860
            ],
            [
                18862,
                18878
            ],
            [
                18916,
                18918
            ],
            [
                18918,
                19041
            ],
            [
                19111,
                19163
            ],
            [
                19163,
                19190
            ],
            [
                19190,
                19194
            ],
            [
                19194,
                19243
            ],
            [
                19257,
                19306
            ],
            [
                19310,
                19311
            ],
            [
                19306,
                19309
            ],
            [
                19338,
                19393
            ],
            [
                19400,
                19436
            ],
            [
                19439,
                19517
            ],
            [
                19517,
                19529
            ],
            [
                19531,
                19543
            ],
            [
                19543,
                19563
            ],
            [
                19604,
                19670
            ],
            [
                19670,
                19697
            ],
            [
                19703,
                19714
            ],
            [
                19698,
                19701
            ],
            [
                19716,
                19739
            ],
            [
                19739,
                19760
            ],
            [
                19773,
                19781
            ],
            [
                19781,
                19786
            ],
            [
                19788,
                19879
            ],
            [
                19903,
                19905
            ],
            [
                19905,
                19924
            ],
            [
                19924,
                19949
            ],
            [
                19959,
                20045
            ],
            [
                20045,
                20051
            ],
            [
                20053,
                20086
            ],
            [
                20086,
                20168
            ],
            [
                20177,
                20209
            ],
            [
                20209,
                20221
            ],
            [
                20260,
                20264
            ],
            [
                20301,
                20350
            ],
            [
                20350,
                20378
            ],
            [
                20384,
                20394
            ],
            [
                20432,
                20439
            ],
            [
                20441,
                20464
            ],
            [
                20861,
                20911
            ],
            [
                20912,
                20943
            ],
            [
                20943,
                20952
            ],
            [
                20952,
                20971
            ],
            [
                20971,
                21017
            ],
            [
                21017,
                21054
            ],
            [
                21054,
                21056
            ],
            [
                21069,
                21072
            ],
            [
                21056,
                21068
            ],
            [
                21073,
                21091
            ],
            [
                21179,
                21182
            ],
            [
                21182,
                21227
            ],
            [
                21227,
                21410
            ],
            [
                21410,
                21444
            ],
            [
                21444,
                21492
            ],
            [
                21492,
                21548
            ],
            [
                21548,
                21586
            ],
            [
                21586,
                21607
            ],
            [
                21614,
                21635
            ],
            [
                21635,
                21726
            ],
            [
                21790,
                21892
            ],
            [
                21912,
                21919
            ],
            [
                21921,
                21962
            ],
            [
                21995,
                22039
            ],
            [
                22039,
                22198
            ],
            [
                22198,
                22339
            ],
            [
                22393,
                22395
            ],
            [
                22395,
                22475
            ],
            [
                22494,
                22508
            ],
            [
                22508,
                22654
            ],
            [
                22667,
                22674
            ],
            [
                22679,
                22710
            ],
            [
                22735,
                22747
            ],
            [
                22748,
                22775
            ],
            [
                22781,
                22834
            ],
            [
                22834,
                22881
            ],
            [
                22881,
                22910
            ],
            [
                22910,
                22911
            ],
            [
                22922,
                22949
            ],
            [
                22949,
                22970
            ],
            [
                22987,
                22988
            ],
            [
                22990,
                23018
            ],
            [
                23036,
                23064
            ],
            [
                23064,
                23152
            ],
            [
                23152,
                23181
            ],
            [
                23190,
                23213
            ],
            [
                23213,
                23249
            ],
            [
                23249,
                23274
            ],
            [
                23293,
                23295
            ],
            [
                23295,
                23338
            ],
            [
                23338,
                23410
            ],
            [
                23410,
                23427
            ],
            [
                23457,
                23525
            ],
            [
                23535,
                23549
            ],
            [
                23549,
                23602
            ],
            [
                23687,
                23771
            ],
            [
                23771,
                23863
            ],
            [
                23863,
                23913
            ],
            [
                23932,
                23959
            ],
            [
                23959,
                23961
            ],
            [
                23993,
                24012
            ],
            [
                23984,
                23987
            ],
            [
                24064,
                24093
            ],
            [
                24198,
                24272
            ],
            [
                24272,
                24279
            ],
            [
                24282,
                24294
            ],
            [
                24297,
                24345
            ],
            [
                24345,
                24348
            ],
            [
                24376,
                24385
            ],
            [
                24363,
                24368
            ],
            [
                24386,
                24392
            ],
            [
                24436,
                24437
            ],
            [
                24410,
                24426
            ],
            [
                24449,
                24450
            ],
            [
                24657,
                24716
            ],
            [
                24754,
                24756
            ],
            [
                24756,
                24774
            ],
            [
                24780,
                24815
            ],
            [
                24815,
                24864
            ],
            [
                24870,
                24954
            ],
            [
                24973,
                24998
            ],
            [
                25020,
                25037
            ],
            [
                25043,
                25050
            ],
            [
                25106,
                25115
            ],
            [
                25119,
                25123
            ],
            [
                25068,
                25078
            ],
            [
                25079,
                25084
            ],
            [
                25124,
                25134
            ],
            [
                25201,
                25225
            ],
            [
                25248,
                25288
            ],
            [
                25302,
                25331
            ],
            [
                25344,
                25388
            ]
        ],
        "row_chars": [
            [
                0,
                135
            ],
            [
                135,
                249
            ],
            [
                249,
                307
            ],
            [
                307,
                602
            ],
            [
                602,
                737
            ],
            [
                737,
                793
            ],
            [
                793,
                834
            ],
            [
                834,
                911
            ],
            [
                911,
                978
            ],
            [
                978,
                1108
            ],
            [
                1108,
                1274
            ],
            [
                1274,
                1379
            ],
            [
                1379,
                1564
            ],
            [
                1564,
                1710
            ],
            [
                1710,
                1849
            ],
            [
                1849,
                1886
            ],
            [
                1886,
                1952
            ],
            [
                1952,
                2064
            ],
            [
                2064,
                2190
            ],
            [
                2190,
                2324
            ],
            [
                2324,
                2431
            ],
            [
                2431,
                2462
            ],
            [
                2462,
                2496
            ],
            [
                2496,
                2610
            ],
            [
                2610,
                2664
            ],
            [
                2664,
                2734
            ],
            [
                2734,
                2790
            ],
            [
                2790,
                2813
            ],
            [
                2813,
                2975
            ],
            [
                2975,
                3177
            ],
            [
                3177,
                3221
            ],
            [
                3221,
                3288
            ],
            [
                3288,
                3376
            ],
            [
                3376,
                3439
            ],
            [
                3439,
                3533
            ],
            [
                3533,
                3588
            ],
            [
                3588,
                3627
            ],
            [
                3627,
                3673
            ],
            [
                3673,
                3725
            ],
            [
                3725,
                3787
            ],
            [
                3787,
                3843
            ],
            [
                3843,
                3916
            ],
            [
                3916,
                4017
            ],
            [
                4017,
                4417
            ],
            [
                4417,
                4460
            ],
            [
                4460,
                4597
            ],
            [
                4597,
                4624
            ],
            [
                4624,
                4649
            ],
            [
                4649,
                4673
            ],
            [
                4673,
                4688
            ],
            [
                4688,
                4708
            ],
            [
                4708,
                4783
            ],
            [
                4783,
                4873
            ],
            [
                4873,
                4922
            ],
            [
                4922,
                5031
            ],
            [
                5031,
                5109
            ],
            [
                5109,
                5224
            ],
            [
                5224,
                5410
            ],
            [
                5410,
                5564
            ],
            [
                5564,
                5684
            ],
            [
                5684,
                5731
            ],
            [
                5731,
                5760
            ],
            [
                5760,
                5792
            ],
            [
                5792,
                5863
            ],
            [
                5863,
                5921
            ],
            [
                5921,
                6010
            ],
            [
                6010,
                6066
            ],
            [
                6066,
                6205
            ],
            [
                6205,
                6247
            ],
            [
                6247,
                6261
            ],
            [
                6261,
                6314
            ],
            [
                6314,
                6451
            ],
            [
                6451,
                6512
            ],
            [
                6512,
                6536
            ],
            [
                6536,
                6558
            ],
            [
                6558,
                6608
            ],
            [
                6608,
                6617
            ],
            [
                6617,
                6666
            ],
            [
                6666,
                6711
            ],
            [
                6711,
                6876
            ],
            [
                6876,
                6903
            ],
            [
                6903,
                6944
            ],
            [
                6944,
                7096
            ],
            [
                7096,
                7145
            ],
            [
                7145,
                7210
            ],
            [
                7210,
                7303
            ],
            [
                7303,
                7459
            ],
            [
                7459,
                7518
            ],
            [
                7518,
                7654
            ],
            [
                7654,
                7774
            ],
            [
                7774,
                7857
            ],
            [
                7857,
                7948
            ],
            [
                7948,
                8018
            ],
            [
                8018,
                8113
            ],
            [
                8113,
                8215
            ],
            [
                8215,
                8274
            ],
            [
                8274,
                8421
            ],
            [
                8421,
                8456
            ],
            [
                8456,
                8517
            ],
            [
                8517,
                8578
            ],
            [
                8578,
                8607
            ],
            [
                8607,
                8675
            ],
            [
                8675,
                8789
            ],
            [
                8789,
                8899
            ],
            [
                8899,
                9132
            ],
            [
                9132,
                9310
            ],
            [
                9310,
                9438
            ],
            [
                9438,
                10084
            ],
            [
                10084,
                10112
            ],
            [
                10112,
                10157
            ],
            [
                10157,
                10352
            ],
            [
                10352,
                10438
            ],
            [
                10438,
                10475
            ],
            [
                10475,
                10630
            ],
            [
                10630,
                10700
            ],
            [
                10700,
                10757
            ],
            [
                10757,
                10850
            ],
            [
                10850,
                10923
            ],
            [
                10923,
                10989
            ],
            [
                10989,
                11088
            ],
            [
                11088,
                11508
            ],
            [
                11508,
                11569
            ],
            [
                11569,
                11689
            ],
            [
                11689,
                11816
            ],
            [
                11816,
                11870
            ],
            [
                11870,
                11906
            ],
            [
                11906,
                11965
            ],
            [
                11965,
                11991
            ],
            [
                11991,
                12032
            ],
            [
                12032,
                12120
            ],
            [
                12120,
                12144
            ],
            [
                12144,
                12198
            ],
            [
                12198,
                12257
            ],
            [
                12257,
                12301
            ],
            [
                12301,
                12344
            ],
            [
                12344,
                12433
            ],
            [
                12433,
                12469
            ],
            [
                12469,
                12512
            ],
            [
                12512,
                12549
            ],
            [
                12549,
                12634
            ],
            [
                12634,
                12655
            ],
            [
                12655,
                12685
            ],
            [
                12685,
                12707
            ],
            [
                12707,
                12779
            ],
            [
                12779,
                12835
            ],
            [
                12835,
                12864
            ],
            [
                12864,
                12936
            ],
            [
                12936,
                13016
            ],
            [
                13016,
                13046
            ],
            [
                13046,
                13072
            ],
            [
                13072,
                13096
            ],
            [
                13096,
                13157
            ],
            [
                13157,
                13209
            ],
            [
                13209,
                13246
            ],
            [
                13246,
                13303
            ],
            [
                13303,
                13467
            ],
            [
                13467,
                13505
            ],
            [
                13505,
                13558
            ],
            [
                13558,
                13786
            ],
            [
                13786,
                13836
            ],
            [
                13836,
                13856
            ],
            [
                13856,
                13908
            ],
            [
                13908,
                13927
            ],
            [
                13927,
                14227
            ],
            [
                14227,
                14271
            ],
            [
                14271,
                14317
            ],
            [
                14317,
                14386
            ],
            [
                14386,
                14532
            ],
            [
                14532,
                14570
            ],
            [
                14570,
                14587
            ],
            [
                14587,
                14671
            ],
            [
                14671,
                14697
            ],
            [
                14697,
                14735
            ],
            [
                14735,
                14767
            ],
            [
                14767,
                14854
            ],
            [
                14854,
                14911
            ],
            [
                14911,
                14977
            ],
            [
                14977,
                15077
            ],
            [
                15077,
                15142
            ],
            [
                15142,
                15236
            ],
            [
                15236,
                15382
            ],
            [
                15382,
                15411
            ],
            [
                15411,
                15478
            ],
            [
                15478,
                15594
            ],
            [
                15594,
                15660
            ],
            [
                15660,
                15734
            ],
            [
                15734,
                15747
            ],
            [
                15747,
                15789
            ],
            [
                15789,
                15801
            ],
            [
                15801,
                15809
            ],
            [
                15809,
                15878
            ],
            [
                15878,
                15927
            ],
            [
                15927,
                15998
            ],
            [
                15998,
                16041
            ],
            [
                16041,
                16092
            ],
            [
                16092,
                16195
            ],
            [
                16195,
                16338
            ],
            [
                16338,
                16375
            ],
            [
                16375,
                16425
            ],
            [
                16425,
                16480
            ],
            [
                16480,
                16517
            ],
            [
                16517,
                16632
            ],
            [
                16632,
                16770
            ],
            [
                16770,
                16834
            ],
            [
                16834,
                16868
            ],
            [
                16868,
                16910
            ],
            [
                16910,
                16930
            ],
            [
                16930,
                17012
            ],
            [
                17012,
                17068
            ],
            [
                17068,
                17075
            ],
            [
                17075,
                17119
            ],
            [
                17119,
                17151
            ],
            [
                17151,
                17233
            ],
            [
                17233,
                17252
            ],
            [
                17252,
                17553
            ],
            [
                17553,
                17661
            ],
            [
                17661,
                17691
            ],
            [
                17691,
                17703
            ],
            [
                17703,
                17770
            ],
            [
                17770,
                17804
            ],
            [
                17804,
                17813
            ],
            [
                17813,
                17869
            ],
            [
                17869,
                18062
            ],
            [
                18062,
                18146
            ],
            [
                18146,
                18190
            ],
            [
                18190,
                18274
            ],
            [
                18274,
                18297
            ],
            [
                18297,
                18339
            ],
            [
                18339,
                18402
            ],
            [
                18402,
                18490
            ],
            [
                18490,
                18518
            ],
            [
                18518,
                18557
            ],
            [
                18557,
                18786
            ],
            [
                18786,
                18918
            ],
            [
                18918,
                19041
            ],
            [
                19041,
                19111
            ],
            [
                19111,
                19163
            ],
            [
                19163,
                19190
            ],
            [
                19190,
                19194
            ],
            [
                19194,
                19306
            ],
            [
                19306,
                19517
            ],
            [
                19517,
                19543
            ],
            [
                19543,
                19563
            ],
            [
                19563,
                19604
            ],
            [
                19604,
                19670
            ],
            [
                19670,
                19739
            ],
            [
                19739,
                19781
            ],
            [
                19781,
                19905
            ],
            [
                19905,
                19924
            ],
            [
                19924,
                20045
            ],
            [
                20045,
                20086
            ],
            [
                20086,
                20209
            ],
            [
                20209,
                20350
            ],
            [
                20350,
                20464
            ],
            [
                20464,
                20672
            ],
            [
                20672,
                20814
            ],
            [
                20814,
                20861
            ],
            [
                20861,
                20912
            ],
            [
                20912,
                20943
            ],
            [
                20943,
                20952
            ],
            [
                20952,
                20971
            ],
            [
                20971,
                21017
            ],
            [
                21017,
                21054
            ],
            [
                21054,
                21182
            ],
            [
                21182,
                21227
            ],
            [
                21227,
                21410
            ],
            [
                21410,
                21444
            ],
            [
                21444,
                21492
            ],
            [
                21492,
                21548
            ],
            [
                21548,
                21586
            ],
            [
                21586,
                21635
            ],
            [
                21635,
                21726
            ],
            [
                21726,
                21790
            ],
            [
                21790,
                21892
            ],
            [
                21892,
                21962
            ],
            [
                21962,
                22039
            ],
            [
                22039,
                22198
            ],
            [
                22198,
                22395
            ],
            [
                22395,
                22508
            ],
            [
                22508,
                22654
            ],
            [
                22654,
                22834
            ],
            [
                22834,
                22881
            ],
            [
                22881,
                22910
            ],
            [
                22910,
                22949
            ],
            [
                22949,
                23064
            ],
            [
                23064,
                23152
            ],
            [
                23152,
                23213
            ],
            [
                23213,
                23249
            ],
            [
                23249,
                23295
            ],
            [
                23295,
                23338
            ],
            [
                23338,
                23410
            ],
            [
                23410,
                23549
            ],
            [
                23549,
                23771
            ],
            [
                23771,
                23863
            ],
            [
                23863,
                23959
            ],
            [
                23959,
                24104
            ],
            [
                24104,
                24198
            ],
            [
                24198,
                24272
            ],
            [
                24272,
                24345
            ],
            [
                24345,
                24451
            ],
            [
                24451,
                24657
            ],
            [
                24657,
                24756
            ],
            [
                24756,
                24815
            ],
            [
                24815,
                24998
            ],
            [
                24998,
                25134
            ],
            [
                25134,
                25201
            ],
            [
                25201,
                25388
            ]
        ]
    },
    "abridged": {
        "text": "Alice, on her return from Westmorland, went direct to Park Lane, where Lady Glencora and Mr. Palliser were. She was to stay with them in London one full day, and on the morning after that they were to start for Paris.\nShe found Mr. Palliser in close attendance upon his wife. Nothing in his manner implied that he was keeping watch over her; but it was very different from what Alice had seen at Matching Priory!\nOn her arrival Mr. Palliser received her in the hall, and took her up to his wife.\n\"We are so much obliged to you, Miss Vavasor,\" he said. \"I feel it quite as deeply as Glencora.\"\n\"Oh, no,\" she said; \"it is I that am under an obligation to you for taking me.\"\nHe merely smiled, and shook his head. On the stairs he said one other thing: \"You must forgive me if I was cross to you that night she went out among the ruins.\"\nAlice muttered some little fib of courtesy as to the matter having been forgotten; and then they went on to Lady Glencora's room. It seemed to Alice that he was not so big or so much to be dreaded as when she had seen him at Matching. His descent from an expectant Chancellor of the Exchequer, down to a simple, attentive husband, seemed to affect his demeanour.\n\"Dear Alice, this is so good of you! I am in the midst of packing, and Plantagenet is helping me.\" Plantagenet winced a little under this. His wife's voice held the slightest hint of mockery, which he perhaps thought she might have spared.\n\"I will help you,\" said Alice.\n\"But we have very nearly finished. I think we shall have to start again, or we shall have nothing to do tomorrow. We couldn't set off tomorrow, could we, Plantagenet?\"\n\"Not very well, as your rooms are ordered in Paris for the next day.\"\n\"As if we couldn't find rooms at every inn on the road. Now, in travelling I should like never to book rooms - never to know where I was going. And I would never travel among Christians. Christians are so slow, and they wear chimney-pot hats everywhere. The further one goes from London among Christians, the more they wear chimney-pot hats. I want Plantagenet to take us to see the Kurds, but he won't.\"\n\"I don't think that would be fair to Miss Vavasor,\" said Mr. Palliser.\n\"Wouldn't you like to see a live Kurd, Alice?\"\n\"I don't exactly know where they live,\" said Alice.\n\"Nor I. I have not the remotest idea of the way to the Kurds. But one knows that they are Eastern, and the East is such a grand idea!\"\n\"I think we'll content ourselves with Rome, or perhaps Naples, on this occasion,\" said Mr. Palliser.\nLady Glencora went flitting about from room to room, declaring that this thing must be taken, and that other, till Alice was astonished at the extent of the preparations. Lady Glencora was taking her own carriage.\n\"Not that I shall ever use it,\" she said to Alice, \"but he insists upon it, to show that I am not supposed to be taken away in disgrace. He is so good; isn't he?\"\n\"Very good,\" said Alice. \"I know no one better.\"\n\"And so dull!\" said Lady Glencora. \"But I fancy that all husbands are dull. If I were a young woman's husband, I shouldn't know what to say to her that wasn't dull.\"\nTwo women and two men servants were to be taken. Both Lady Glencora's servants spoke French, and as Alice's did not, Lady Glencora said, \"You shall have one all to yourself.\"\nShe then explained Mr. Palliser's kindness to Alice. \"You see, my dear, I have told him everything. I always do tell everything. Nobody can say I am not candid. He knows about your not letting me come to your house in the old days. And I told him all that you said - about you know what. I have had nothing else to do but make confessions for the last ten days, and when a woman once begins, the more she confesses the better. And I told him that you refused Jeffrey.\"\n\"You didn't?\"\n\"I did indeed, and he likes you the better for that. I think he'd let Jeffrey marry you now if you both wished it - and then supposing that you had a son and we adopted it?\"\n\"Cora, if you go on in that way I will not stay with you.\"\n\"But you must, my dear. You can't escape now. You shouldn't grudge me my little naughtinesses. I have been so proper for the last ten days.\"\nOn the following morning they breakfasted early, because Mr. Palliser said that early hours would be good for them. After breakfast they all three went to work to do nothing. It was almost painful to see Mr. Palliser wandering about and counting the boxes, as though he could do any good by that. He, whose application to his figures had been so unremitting, could apply himself now to nothing. His world had been brought to an abrupt end, and he was awkward at making a new beginning.\nThey were all reading novels before one o'clock. Lady Glencora and Alice had decided that they would not leave the house. There was, however, no need for Mr. Palliser to remain with them; and at about three he prepared for a solitary walk. He would not go down to the House. All interest in the House was over with him for the present. Nor would he call on anyone. All his friends believed that he had left town. Therefore Mr. Palliser prepared to take a walk under the elms in Kensington Gardens.\nHe was in the hall putting on his hat and gloves when there came a knock at the front door. The hall-porter opened the door, and revealed Burgo Fitzgerald standing on the step.\n\"Is Lady Glencora at home?\" asked Burgo, before he had seen the husband.\nJohn turned a dismayed face upon his master, as though he knew that the comer ought not to be there, and made no instant reply.\n\"I am not sure,\" said Mr. Palliser, making his way out as he had intended. \"The servant will find out for you.\" Then he went on his way across Park Lane and into the Park, never once turning back to see whether Burgo had entered the house. Nor did he return a minute earlier than he would otherwise have done. After all, there was something chivalrous about the man.\n\"Yes; Lady Glencora was at home,\" said the porter. Burgo was therefore admitted and shown direct up into the room in which Lady Glencora was sitting.\nAs chance would have it, she was alone, sitting on a footstool with her face between her hands. She was thinking of Burgo, and of what the world might have been to her had she been allowed to marry him.\nShe rose quickly. \"Ask Miss Vavasor to come to me,\" she said, as the servant left the room; and then she came forward to greet her lover.\n\"Cora,\" he said, dashing at once into his subject. \"Cora, I have come to ask you to go with me.\"\n\"I will not go with you,\" said she.\n\"Do not answer me in that way, without a moment's thought. Everything is arranged-\"\n\"Yes, everything is arranged,\" she said. \"Mr. Fitzgerald, let me ask you to leave me alone, and to behave to me with generosity. Everything is arranged. You can see that my boxes are all prepared for going. Mr. Palliser and I, and my friend, are starting tomorrow. Wish me God-speed and go, and be generous.\"\n\"And is this to be the end of everything? Give me your hand, Cora,\" he said.\n\"No; I will never give you my hand again. You should be generous to me and go. This is to be the end of everything. Go, when I ask you.\"\n\"Cora; did you ever love me?\"\n\"Yes; I did love you. But we were separated, and there was no room for love left between us.\"\n\"You are dearer to me than ever you were. Do not look at me like that. Did you not tell me when we last parted that I might come to you again? Are we children, that others should come separate us like that?\"\n\"Yes, Burgo; we are children. Here is my cousin coming. You must leave me now.\" As she spoke the door was opened and Alice entered the room.\n\"Miss Vavasor, Mr. Fitzgerald,\" said Lady Glencora. \"I have told him to go and leave me. Now that you have come, Alice, he will perhaps obey me.\"\nAlice was dumbfounded; but she stood with her eyes riveted on the face of the man of whom she had heard so much. Yes; certainly he was very beautiful. She found it quite impossible to speak a word to him, but she acknowledged the introduction with a slight nod, and then stood silent, as though waiting for him to go.\n\"Mr. Fitzgerald, why do you not leave me?\" said Lady Glencora.\nPoor Burgo also found it difficult enough to speak. What could he say?\n\"I had hoped to talk to you alone for a few minutes.\"\n\"No, Mr. Fitzgerald. I sent for my cousin because I did not choose to be alone with you. I have asked you to go-\"\n\"You perhaps have not understood me?\"\n\"I understand you well enough.\"\n\"Then, Mr. Fitzgerald,\" said Alice, \"why do you not do as Lady Glencora has asked you? You must know that you ought not to be here.\"\n\"I know nothing of the kind,\" said he, still standing his ground.\n\"Alice,\" said Lady Glencora, \"we will leave Mr. Fitzgerald here, since he drives us from the room.\"\nBurgo knew then that he must go - must skulk away as best he might. \"No, Lady Glencora,\" he said, \"I will not drive you from the room. I did think that you would at any rate have been less hard to me.\" He then turned to go.\nHe was on the threshold before Glencora's voice recalled him.\n\"Oh my God!\" she said. \"I am hard - harder than flint. I am cruel. Burgo!\" And he was back with her in a moment, and had taken her by the hand.\n\"Glencora,\" said Alice, \"pray - pray let him go. Mr. Fitzgerald, if you are a man, do not take advantage of her folly.\"\n\"I will speak to him,\" said Lady Glencora. \"I will speak to him, and then he shall leave me.\" She was holding him by the hand now. \"Burgo,\" she said, with all the passion that she could throw into the word, \"Burgo, no good can come of this. Now, you must go. I shall stay with my husband as I am bound to do. Because I have wronged you, I will not wrong him also. I loved you.\" She still held him by the hand, and was now gazing up into his face, while the tears were streaming from her eyes.\n\"Sir,\" said Alice, \"if you have any feeling of honour in you, you will leave her.\"\n\"I will never leave her, while she tells me that she loves me!\"\n\"Yes, Burgo, you will; you must! I shall never tell you that again, never. Go, and leave us; but I could not bear that you should tell me that I was hard.\"\n\"You are hard and cruel, as you said yourself.\"\n\"Am I? May God forgive you for saying that!\"\n\"Then why do you send me away?\"\n\"Because I am a man's wife, and because I care for his honour, if not for my own. Alice, let us go.\"\nHe still held her, and before she could pull away he kissed her lips. Then he left her, and making his way out of the room, and down the stairs, got himself out into the street.\n\"Thank God that he is gone!\" said Alice.\n\"You may say so,\" said Lady Glencora, \"for you have lost nothing!\"\n\"And you have gained everything!\"\n\"Have I? I did not know that I had ever gained anything, as yet. The only human being to whom I have ever yet given my whole heart - the only thing that I have ever really loved - has just gone from me for ever, and you bid me thank God that I have lost him. There is no room for thankfulness. It is all wretchedness from first to last!\"\n\"At any rate, he understands now that you meant it when you told him to leave you.\"\n\"Of course I meant it. I am beginning to know myself by degrees. As for running away with him, I have not the courage to do it. I can think of it, but as for doing it, that is beyond me. Mr. Palliser is quite safe.\"\nAlice came and sat by her, and tried to sooth her by smoothing her hair, and nursing her like a child.\n\"Of course I know that I ought to stay where I am,\" she said, breaking out almost with rage. \"I am not such a fool as to mistake what I should be if I left my husband, and went to live with that man as his mistress. But why have I been brought to such a pass as this? And, as for female purity! Ah! What was their idea of purity when they forced me to marry a man for whom they knew I never cared? If I had eloped with that man who ought to have been my husband, whom would a just God have punished worst - me, or those two old women and my uncle, who tortured me into this marriage?\"\n\"Come, Cora, be silent.\"\n\"I won't be silent! You have done what you liked, and no one has interfered with you. You have suffered, too; but at any rate you can respect yourself.\"\n\"And so can you, Cora - thoroughly, now.\"\n\"How; when he kissed me, and I could hardly restrain myself from giving him back his kiss tenfold? But it is all sin. I sin towards my husband, pretending that I love him; and I sin in loving that other man, who should have been my husband. There; I hear Mr. Palliser at the door. Come away with me; or rather, stay, for he will come up here, and you can keep him talking while I try to recover myself.\"\nMr. Palliser came upstairs as soon as he had deposited his hat in the hall. Alice was, in fact, in doubt about whether she should mention Mr. Fitzgerald's name. But Mr. Palliser at once put an end to her doubts.\n\"You have had a visitor here?\" said he.\n\"Yes,\" said Alice.\n\"I saw him as I went out,\" said Mr. Palliser. \"Indeed, I met him at the hall door. He was, of course, wrong to come here.\"\n\"He has been punished, I think,\" said Alice.\n\"But as for Glencora,\" continued Mr. Palliser, without any apparent notice of what Alice had said, \"I thought it better that she should see him or not, as she should herself decide.\"\n\"She had no choice in the matter. As it turned out, he was shown up here at once. She sent for me, and I think she was right to do that.\"\n\"Glencora was alone when he came in?\"\n\"For a minute or two, till I could get to her.\"\n\"I have no questions to ask about it,\" said Mr. Palliser, after waiting for a few moments. \"I am very glad that you were within reach of her, as otherwise her position might have been painful. Perhaps it may be as well that he has been here. I am forced to suppose him to be a villain. What a man does when driven by passion, I can forgive; but that he should deliberately plan schemes to ruin both her and me, is what I can hardly understand.\" As he made this little speech I wonder whether his conscience said anything to him about Lady Dumbello, and a certain evening in his own life.\nThe little party of three dined together very quietly, and after dinner they all read their novels. Before long Alice saw that Mr. Palliser was yawning, and she began to understand how much he had given up in order that his wife might be secure. When he left the room for a few minutes to wake himself up by walking about the house, Glencora told Alice of his yawning down at Matching. \"I used to think that he would fall in pieces. What are we to do about it?\"\n\"Pretend not to notice it,\" said Alice.\n\"That's all very well; but he'll set us off yawning too, and then he'll notice it. He has given himself up to politics, till nothing else has any salt in it left for him. I cannot think why such a man wanted a wife at all.\"\n\"You are very hard upon him, Cora.\"\n\"I wish you were his wife. But, of course, I know why he got married. And I ought to feel for him as he has been so grievously disappointed.\" Then Mr. Palliser returned to the room, and the remainder of the evening was passed in tranquillity.\nBurgo Fitzgerald, when he left the house, turned back as far as his uncle's door, and then, having paused there for a moment, hurried on. For half an hour, or thereabouts, something like true feeling was at work within his heart. He had once more pressed to his bosom the woman he thought that he had loved. He had kissed her, and her voice was still ringing in his ears. He comforted himself for a minute with the conviction that she loved him. He felt - for a moment - that he could live on such consolation as that! But in truth, there was hardly a man less capable of living on such consolation.\nHe would not go in and tell his aunt at once of his failure. Indeed, he thought he would not tell his aunt at all. So he turned back from Grosvenor Square, and went to his club in St. James's Street, feeling that billiards and brandy-and-water might be the best restorative. He blamed himself greatly for letting Lady Monk take those banknotes from him. When he entered his club his mind had left Lady Glencora, and was considering how he might best get that spoil out of his aunt's possession.",
        "paragraph_chars": [
            [
                0,
                218
            ],
            [
                218,
                413
            ],
            [
                413,
                496
            ],
            [
                496,
                593
            ],
            [
                593,
                673
            ],
            [
                673,
                835
            ],
            [
                835,
                1198
            ],
            [
                1198,
                1438
            ],
            [
                1438,
                1469
            ],
            [
                1469,
                1637
            ],
            [
                1637,
                1707
            ],
            [
                1707,
                2112
            ],
            [
                2112,
                2183
            ],
            [
                2183,
                2230
            ],
            [
                2230,
                2282
            ],
            [
                2282,
                2417
            ],
            [
                2417,
                2518
            ],
            [
                2518,
                2732
            ],
            [
                2732,
                2895
            ],
            [
                2895,
                2944
            ],
            [
                2944,
                3110
            ],
            [
                3110,
                3285
            ],
            [
                3285,
                3754
            ],
            [
                3754,
                3768
            ],
            [
                3768,
                3942
            ],
            [
                3942,
                4001
            ],
            [
                4001,
                4142
            ],
            [
                4142,
                4628
            ],
            [
                4628,
                5126
            ],
            [
                5126,
                5303
            ],
            [
                5303,
                5376
            ],
            [
                5376,
                5504
            ],
            [
                5504,
                5871
            ],
            [
                5871,
                6021
            ],
            [
                6021,
                6224
            ],
            [
                6224,
                6362
            ],
            [
                6362,
                6459
            ],
            [
                6459,
                6495
            ],
            [
                6495,
                6579
            ],
            [
                6579,
                6888
            ],
            [
                6888,
                6965
            ],
            [
                6965,
                7102
            ],
            [
                7102,
                7132
            ],
            [
                7132,
                7226
            ],
            [
                7226,
                7434
            ],
            [
                7434,
                7575
            ],
            [
                7575,
                7721
            ],
            [
                7721,
                8039
            ],
            [
                8039,
                8102
            ],
            [
                8102,
                8173
            ],
            [
                8173,
                8227
            ],
            [
                8227,
                8341
            ],
            [
                8341,
                8379
            ],
            [
                8379,
                8411
            ],
            [
                8411,
                8544
            ],
            [
                8544,
                8610
            ],
            [
                8610,
                8710
            ],
            [
                8710,
                8934
            ],
            [
                8934,
                8996
            ],
            [
                8996,
                9140
            ],
            [
                9140,
                9260
            ],
            [
                9260,
                9753
            ],
            [
                9753,
                9836
            ],
            [
                9836,
                9900
            ],
            [
                9900,
                10056
            ],
            [
                10056,
                10104
            ],
            [
                10104,
                10149
            ],
            [
                10149,
                10181
            ],
            [
                10181,
                10282
            ],
            [
                10282,
                10460
            ],
            [
                10460,
                10501
            ],
            [
                10501,
                10568
            ],
            [
                10568,
                10602
            ],
            [
                10602,
                10940
            ],
            [
                10940,
                11024
            ],
            [
                11024,
                11240
            ],
            [
                11240,
                11343
            ],
            [
                11343,
                11928
            ],
            [
                11928,
                11953
            ],
            [
                11953,
                12106
            ],
            [
                12106,
                12148
            ],
            [
                12148,
                12552
            ],
            [
                12552,
                12764
            ],
            [
                12764,
                12804
            ],
            [
                12804,
                12823
            ],
            [
                12823,
                12946
            ],
            [
                12946,
                12991
            ],
            [
                12991,
                13174
            ],
            [
                13174,
                13312
            ],
            [
                13312,
                13350
            ],
            [
                13350,
                13398
            ],
            [
                13398,
                13986
            ],
            [
                13986,
                14448
            ],
            [
                14448,
                14488
            ],
            [
                14488,
                14712
            ],
            [
                14712,
                14748
            ],
            [
                14748,
                14991
            ],
            [
                14991,
                15591
            ],
            [
                15591,
                16085
            ]
        ],
        "segment_chars": [
            [
                0,
                108
            ],
            [
                108,
                218
            ],
            [
                218,
                276
            ],
            [
                276,
                413
            ],
            [
                413,
                496
            ],
            [
                496,
                552
            ],
            [
                552,
                593
            ],
            [
                593,
                673
            ],
            [
                673,
                711
            ],
            [
                711,
                835
            ],
            [
                835,
                965
            ],
            [
                965,
                1070
            ],
            [
                1070,
                1198
            ],
            [
                1198,
                1235
            ],
            [
                1235,
                1297
            ],
            [
                1297,
                1337
            ],
            [
                1337,
                1438
            ],
            [
                1438,
                1469
            ],
            [
                1469,
                1504
            ],
            [
                1504,
                1583
            ],
            [
                1583,
                1637
            ],
            [
                1637,
                1707
            ],
            [
                1707,
                1763
            ],
            [
                1763,
                1851
            ],
            [
                1851,
                1894
            ],
            [
                1894,
                1961
            ],
            [
                1961,
                2049
            ],
            [
                2049,
                2112
            ],
            [
                2112,
                2183
            ],
            [
                2183,
                2230
            ],
            [
                2230,
                2282
            ],
            [
                2282,
                2344
            ],
            [
                2344,
                2417
            ],
            [
                2417,
                2518
            ],
            [
                2518,
                2689
            ],
            [
                2689,
                2732
            ],
            [
                2732,
                2869
            ],
            [
                2869,
                2895
            ],
            [
                2895,
                2920
            ],
            [
                2920,
                2944
            ],
            [
                2944,
                2959
            ],
            [
                2959,
                2979
            ],
            [
                2979,
                3020
            ],
            [
                3020,
                3110
            ],
            [
                3110,
                3159
            ],
            [
                3159,
                3285
            ],
            [
                3285,
                3338
            ],
            [
                3338,
                3385
            ],
            [
                3385,
                3414
            ],
            [
                3414,
                3446
            ],
            [
                3446,
                3517
            ],
            [
                3517,
                3573
            ],
            [
                3573,
                3712
            ],
            [
                3712,
                3754
            ],
            [
                3754,
                3768
            ],
            [
                3768,
                3821
            ],
            [
                3821,
                3942
            ],
            [
                3942,
                4001
            ],
            [
                4001,
                4025
            ],
            [
                4025,
                4047
            ],
            [
                4047,
                4096
            ],
            [
                4096,
                4142
            ],
            [
                4142,
                4258
            ],
            [
                4258,
                4317
            ],
            [
                4317,
                4439
            ],
            [
                4439,
                4537
            ],
            [
                4537,
                4628
            ],
            [
                4628,
                4677
            ],
            [
                4677,
                4750
            ],
            [
                4750,
                4868
            ],
            [
                4868,
                4903
            ],
            [
                4903,
                4964
            ],
            [
                4964,
                4993
            ],
            [
                4993,
                5041
            ],
            [
                5041,
                5126
            ],
            [
                5126,
                5218
            ],
            [
                5218,
                5303
            ],
            [
                5303,
                5331
            ],
            [
                5331,
                5376
            ],
            [
                5376,
                5504
            ],
            [
                5504,
                5579
            ],
            [
                5579,
                5616
            ],
            [
                5616,
                5744
            ],
            [
                5744,
                5814
            ],
            [
                5814,
                5871
            ],
            [
                5871,
                5922
            ],
            [
                5922,
                6021
            ],
            [
                6021,
                6117
            ],
            [
                6117,
                6224
            ],
            [
                6224,
                6242
            ],
            [
                6242,
                6362
            ],
            [
                6362,
                6413
            ],
            [
                6413,
                6459
            ],
            [
                6459,
                6495
            ],
            [
                6495,
                6554
            ],
            [
                6554,
                6579
            ],
            [
                6579,
                6620
            ],
            [
                6620,
                6708
            ],
            [
                6708,
                6732
            ],
            [
                6732,
                6786
            ],
            [
                6786,
                6844
            ],
            [
                6844,
                6888
            ],
            [
                6888,
                6930
            ],
            [
                6930,
                6965
            ],
            [
                6965,
                7007
            ],
            [
                7007,
                7044
            ],
            [
                7044,
                7081
            ],
            [
                7081,
                7102
            ],
            [
                7102,
                7132
            ],
            [
                7132,
                7154
            ],
            [
                7154,
                7226
            ],
            [
                7226,
                7268
            ],
            [
                7268,
                7297
            ],
            [
                7297,
                7369
            ],
            [
                7369,
                7434
            ],
            [
                7434,
                7464
            ],
            [
                7464,
                7490
            ],
            [
                7490,
                7514
            ],
            [
                7514,
                7575
            ],
            [
                7575,
                7627
            ],
            [
                7627,
                7664
            ],
            [
                7664,
                7721
            ],
            [
                7721,
                7834
            ],
            [
                7834,
                7872
            ],
            [
                7872,
                8039
            ],
            [
                8039,
                8082
            ],
            [
                8082,
                8102
            ],
            [
                8102,
                8154
            ],
            [
                8154,
                8173
            ],
            [
                8173,
                8227
            ],
            [
                8227,
                8248
            ],
            [
                8248,
                8316
            ],
            [
                8316,
                8341
            ],
            [
                8341,
                8379
            ],
            [
                8379,
                8411
            ],
            [
                8411,
                8498
            ],
            [
                8498,
                8544
            ],
            [
                8544,
                8610
            ],
            [
                8610,
                8710
            ],
            [
                8710,
                8778
            ],
            [
                8778,
                8845
            ],
            [
                8845,
                8912
            ],
            [
                8912,
                8934
            ],
            [
                8934,
                8996
            ],
            [
                8996,
                9009
            ],
            [
                9009,
                9019
            ],
            [
                9019,
                9051
            ],
            [
                9051,
                9063
            ],
            [
                9063,
                9071
            ],
            [
                9071,
                9140
            ],
            [
                9140,
                9189
            ],
            [
                9189,
                9260
            ],
            [
                9260,
                9303
            ],
            [
                9303,
                9354
            ],
            [
                9354,
                9391
            ],
            [
                9391,
                9501
            ],
            [
                9501,
                9519
            ],
            [
                9519,
                9569
            ],
            [
                9569,
                9624
            ],
            [
                9624,
                9638
            ],
            [
                9638,
                9753
            ],
            [
                9753,
                9836
            ],
            [
                9836,
                9900
            ],
            [
                9900,
                9933
            ],
            [
                9933,
                9975
            ],
            [
                9975,
                10056
            ],
            [
                10056,
                10104
            ],
            [
                10104,
                10111
            ],
            [
                10111,
                10149
            ],
            [
                10149,
                10181
            ],
            [
                10181,
                10263
            ],
            [
                10263,
                10282
            ],
            [
                10282,
                10352
            ],
            [
                10352,
                10460
            ],
            [
                10460,
                10489
            ],
            [
                10489,
                10501
            ],
            [
                10501,
                10568
            ],
            [
                10568,
                10602
            ],
            [
                10602,
                10611
            ],
            [
                10611,
                10667
            ],
            [
                10667,
                10861
            ],
            [
                10861,
                10896
            ],
            [
                10896,
                10940
            ],
            [
                10940,
                11024
            ],
            [
                11024,
                11047
            ],
            [
                11047,
                11089
            ],
            [
                11089,
                11152
            ],
            [
                11152,
                11211
            ],
            [
                11211,
                11240
            ],
            [
                11240,
                11343
            ],
            [
                11343,
                11436
            ],
            [
                11436,
                11559
            ],
            [
                11559,
                11611
            ],
            [
                11611,
                11638
            ],
            [
                11638,
                11642
            ],
            [
                11642,
                11741
            ],
            [
                11741,
                11928
            ],
            [
                11928,
                11953
            ],
            [
                11953,
                11973
            ],
            [
                11973,
                12039
            ],
            [
                12039,
                12106
            ],
            [
                12106,
                12148
            ],
            [
                12148,
                12247
            ],
            [
                12247,
                12266
            ],
            [
                12266,
                12389
            ],
            [
                12389,
                12429
            ],
            [
                12429,
                12552
            ],
            [
                12552,
                12628
            ],
            [
                12628,
                12713
            ],
            [
                12713,
                12764
            ],
            [
                12764,
                12795
            ],
            [
                12795,
                12804
            ],
            [
                12804,
                12823
            ],
            [
                12823,
                12869
            ],
            [
                12869,
                12906
            ],
            [
                12906,
                12946
            ],
            [
                12946,
                12991
            ],
            [
                12991,
                13174
            ],
            [
                13174,
                13208
            ],
            [
                13208,
                13256
            ],
            [
                13256,
                13312
            ],
            [
                13312,
                13350
            ],
            [
                13350,
                13398
            ],
            [
                13398,
                13489
            ],
            [
                13489,
                13591
            ],
            [
                13591,
                13640
            ],
            [
                13640,
                13684
            ],
            [
                13684,
                13843
            ],
            [
                13843,
                13986
            ],
            [
                13986,
                14086
            ],
            [
                14086,
                14232
            ],
            [
                14232,
                14372
            ],
            [
                14372,
                14419
            ],
            [
                14419,
                14448
            ],
            [
                14448,
                14488
            ],
            [
                14488,
                14571
            ],
            [
                14571,
                14659
            ],
            [
                14659,
                14712
            ],
            [
                14712,
                14748
            ],
            [
                14748,
                14775
            ],
            [
                14775,
                14818
            ],
            [
                14818,
                14890
            ],
            [
                14890,
                14991
            ],
            [
                14991,
                15129
            ],
            [
                15129,
                15221
            ],
            [
                15221,
                15299
            ],
            [
                15299,
                15363
            ],
            [
                15363,
                15437
            ],
            [
                15437,
                15510
            ],
            [
                15510,
                15591
            ],
            [
                15591,
                15652
            ],
            [
                15652,
                15706
            ],
            [
                15706,
                15866
            ],
            [
                15866,
                15945
            ],
            [
                15945,
                16085
            ]
        ],
        "overlap_chars": [
            [
                0,
                30
            ],
            [
                33,
                64
            ],
            [
                71,
                101
            ],
            [
                106,
                108
            ],
            [
                108,
                118
            ],
            [
                124,
                147
            ],
            [
                153,
                217
            ],
            [
                218,
                276
            ],
            [
                284,
                297
            ],
            [
                298,
                340
            ],
            [
                340,
                345
            ],
            [
                349,
                372
            ],
            [
                378,
                413
            ],
            [
                413,
                440
            ],
            [
                441,
                494
            ],
            [
                494,
                495
            ],
            [
                496,
                552
            ],
            [
                552,
                593
            ],
            [
                593,
                635
            ],
            [
                639,
                673
            ],
            [
                673,
                709
            ],
            [
                709,
                711
            ],
            [
                711,
                742
            ],
            [
                748,
                834
            ],
            [
                835,
                849
            ],
            [
                850,
                916
            ],
            [
                916,
                965
            ],
            [
                965,
                1070
            ],
            [
                1070,
                1099
            ],
            [
                1100,
                1186
            ],
            [
                1187,
                1197
            ],
            [
                1198,
                1235
            ],
            [
                1235,
                1239
            ],
            [
                1240,
                1297
            ],
            [
                1297,
                1335
            ],
            [
                1335,
                1337
            ],
            [
                1337,
                1353
            ],
            [
                1359,
                1395
            ],
            [
                1396,
                1437
            ],
            [
                1438,
                1469
            ],
            [
                1469,
                1481
            ],
            [
                1482,
                1493
            ],
            [
                1502,
                1504
            ],
            [
                1504,
                1528
            ],
            [
                1535,
                1553
            ],
            [
                1567,
                1569
            ],
            [
                1581,
                1583
            ],
            [
                1583,
                1594
            ],
            [
                1613,
                1637
            ],
            [
                1637,
                1707
            ],
            [
                1707,
                1763
            ],
            [
                1763,
                1766
            ],
            [
                1766,
                1767
            ],
            [
                1768,
                1804
            ],
            [
                1810,
                1815
            ],
            [
                1816,
                1817
            ],
            [
                1818,
                1849
            ],
            [
                1851,
                1894
            ],
            [
                1894,
                1961
            ],
            [
                1961,
                2049
            ],
            [
                2049,
                2112
            ],
            [
                2112,
                2181
            ],
            [
                2181,
                2183
            ],
            [
                2184,
                2230
            ],
            [
                2230,
                2282
            ],
            [
                2282,
                2344
            ],
            [
                2344,
                2417
            ],
            [
                2417,
                2518
            ],
            [
                2523,
                2531
            ],
            [
                2532,
                2632
            ],
            [
                2633,
                2687
            ],
            [
                2687,
                2689
            ],
            [
                2689,
                2731
            ],
            [
                2732,
                2869
            ],
            [
                2869,
                2883
            ],
            [
                2887,
                2895
            ],
            [
                2895,
                2920
            ],
            [
                2920,
                2944
            ],
            [
                2944,
                2959
            ],
            [
                2959,
                2979
            ],
            [
                2979,
                3018
            ],
            [
                3018,
                3020
            ],
            [
                3020,
                3110
            ],
            [
                3110,
                3159
            ],
            [
                3159,
                3209
            ],
            [
                3210,
                3215
            ],
            [
                3218,
                3226
            ],
            [
                3227,
                3240
            ],
            [
                3241,
                3245
            ],
            [
                3247,
                3282
            ],
            [
                3294,
                3303
            ],
            [
                3304,
                3316
            ],
            [
                3328,
                3330
            ],
            [
                3331,
                3336
            ],
            [
                3336,
                3338
            ],
            [
                3338,
                3385
            ],
            [
                3385,
                3414
            ],
            [
                3414,
                3446
            ],
            [
                3446,
                3517
            ],
            [
                3517,
                3549
            ],
            [
                3552,
                3573
            ],
            [
                3573,
                3712
            ],
            [
                3712,
                3754
            ],
            [
                3754,
                3768
            ],
            [
                3768,
                3821
            ],
            [
                3821,
                3881
            ],
            [
                3884,
                3892
            ],
            [
                3893,
                3925
            ],
            [
                3926,
                3942
            ],
            [
                3942,
                3984
            ],
            [
                3990,
                4001
            ],
            [
                4001,
                4025
            ],
            [
                4025,
                4047
            ],
            [
                4047,
                4096
            ],
            [
                4096,
                4139
            ],
            [
                4142,
                4211
            ],
            [
                4212,
                4258
            ],
            [
                4258,
                4317
            ],
            [
                4317,
                4323
            ],
            [
                4324,
                4439
            ],
            [
                4439,
                4460
            ],
            [
                4476,
                4537
            ],
            [
                4537,
                4627
            ],
            [
                4628,
                4632
            ],
            [
                4633,
                4637
            ],
            [
                4638,
                4641
            ],
            [
                4642,
                4677
            ],
            [
                4677,
                4704
            ],
            [
                4713,
                4748
            ],
            [
                4748,
                4750
            ],
            [
                4750,
                4772
            ],
            [
                4782,
                4794
            ],
            [
                4798,
                4819
            ],
            [
                4820,
                4834
            ],
            [
                4835,
                4846
            ],
            [
                4847,
                4868
            ],
            [
                4868,
                4903
            ],
            [
                4903,
                4964
            ],
            [
                4964,
                4993
            ],
            [
                4993,
                5008
            ],
            [
                5009,
                5017
            ],
            [
                5018,
                5041
            ],
            [
                5053,
                5063
            ],
            [
                5064,
                5072
            ],
            [
                5073,
                5080
            ],
            [
                5083,
                5126
            ],
            [
                5126,
                5128
            ],
            [
                5129,
                5139
            ],
            [
                5140,
                5144
            ],
            [
                5145,
                5159
            ],
            [
                5160,
                5163
            ],
            [
                5164,
                5167
            ],
            [
                5168,
                5174
            ],
            [
                5175,
                5218
            ],
            [
                5218,
                5233
            ],
            [
                5241,
                5250
            ],
            [
                5251,
                5254
            ],
            [
                5264,
                5289
            ],
            [
                5293,
                5296
            ],
            [
                5297,
                5302
            ],
            [
                5303,
                5331
            ],
            [
                5331,
                5375
            ],
            [
                5376,
                5469
            ],
            [
                5475,
                5476
            ],
            [
                5477,
                5503
            ],
            [
                5504,
                5568
            ],
            [
                5577,
                5579
            ],
            [
                5579,
                5616
            ],
            [
                5616,
                5699
            ],
            [
                5700,
                5724
            ],
            [
                5733,
                5744
            ],
            [
                5744,
                5814
            ],
            [
                5814,
                5871
            ],
            [
                5871,
                5920
            ],
            [
                5920,
                5922
            ],
            [
                5922,
                6020
            ],
            [
                6021,
                6059
            ],
            [
                6059,
                6060
            ],
            [
                6061,
                6068
            ],
            [
                6069,
                6115
            ],
            [
                6115,
                6116
            ],
            [
                6117,
                6124
            ],
            [
                6125,
                6136
            ],
            [
                6137,
                6142
            ],
            [
                6142,
                6192
            ],
            [
                6193,
                6196
            ],
            [
                6210,
                6212
            ],
            [
                6219,
                6222
            ],
            [
                6222,
                6224
            ],
            [
                6224,
                6240
            ],
            [
                6240,
                6242
            ],
            [
                6242,
                6362
            ],
            [
                6362,
                6411
            ],
            [
                6411,
                6413
            ],
            [
                6413,
                6431
            ],
            [
                6432,
                6459
            ],
            [
                6459,
                6495
            ],
            [
                6495,
                6554
            ],
            [
                6554,
                6576
            ],
            [
                6579,
                6620
            ],
            [
                6620,
                6708
            ],
            [
                6708,
                6732
            ],
            [
                6732,
                6786
            ],
            [
                6786,
                6833
            ],
            [
                6842,
                6844
            ],
            [
                6844,
                6888
            ],
            [
                6888,
                6928
            ],
            [
                6930,
                6965
            ],
            [
                6965,
                6969
            ],
            [
                6970,
                7007
            ],
            [
                7007,
                7044
            ],
            [
                7044,
                7079
            ],
            [
                7079,
                7081
            ],
            [
                7081,
                7102
            ],
            [
                7102,
                7132
            ],
            [
                7132,
                7154
            ],
            [
                7154,
                7226
            ],
            [
                7226,
                7234
            ],
            [
                7235,
                7241
            ],
            [
                7242,
                7247
            ],
            [
                7248,
                7268
            ],
            [
                7268,
                7297
            ],
            [
                7297,
                7369
            ],
            [
                7369,
                7409
            ],
            [
                7410,
                7434
            ],
            [
                7434,
                7464
            ],
            [
                7464,
                7490
            ],
            [
                7490,
                7514
            ],
            [
                7514,
                7574
            ],
            [
                7575,
                7627
            ],
            [
                7627,
                7664
            ],
            [
                7664,
                7721
            ],
            [
                7721,
                7742
            ],
            [
                7742,
                7834
            ],
            [
                7834,
                7872
            ],
            [
                7872,
                7924
            ],
            [
                7924,
                7977
            ],
            [
                7981,
                8015
            ],
            [
                8016,
                8039
            ],
            [
                8039,
                8079
            ],
            [
                8079,
                8082
            ],
            [
                8082,
                8102
            ],
            [
                8102,
                8154
            ],
            [
                8154,
                8172
            ],
            [
                8173,
                8188
            ],
            [
                8194,
                8227
            ],
            [
                8227,
                8246
            ],
            [
                8246,
                8248
            ],
            [
                8248,
                8268
            ],
            [
                8269,
                8316
            ],
            [
                8316,
                8338
            ],
            [
                8341,
                8379
            ],
            [
                8379,
                8411
            ],
            [
                8411,
                8498
            ],
            [
                8498,
                8511
            ],
            [
                8512,
                8544
            ],
            [
                8544,
                8610
            ],
            [
                8610,
                8710
            ],
            [
                8710,
                8720
            ],
            [
                8726,
                8741
            ],
            [
                8742,
                8743
            ],
            [
                8744,
                8776
            ],
            [
                8776,
                8778
            ],
            [
                8778,
                8845
            ],
            [
                8845,
                8893
            ],
            [
                8894,
                8912
            ],
            [
                8912,
                8932
            ],
            [
                8932,
                8934
            ],
            [
                8934,
                8957
            ],
            [
                8958,
                8995
            ],
            [
                8996,
                9009
            ],
            [
                9009,
                9017
            ],
            [
                9019,
                9029
            ],
            [
                9039,
                9051
            ],
            [
                9051,
                9063
            ],
            [
                9063,
                9071
            ],
            [
                9071,
                9140
            ],
            [
                9140,
                9169
            ],
            [
                9177,
                9189
            ],
            [
                9189,
                9260
            ],
            [
                9260,
                9303
            ],
            [
                9303,
                9354
            ],
            [
                9354,
                9389
            ],
            [
                9389,
                9391
            ],
            [
                9391,
                9408
            ],
            [
                9408,
                9466
            ],
            [
                9467,
                9501
            ],
            [
                9501,
                9505
            ],
            [
                9506,
                9519
            ],
            [
                9519,
                9569
            ],
            [
                9569,
                9624
            ],
            [
                9624,
                9638
            ],
            [
                9638,
                9753
            ],
            [
                9753,
                9773
            ],
            [
                9773,
                9836
            ],
            [
                9836,
                9900
            ],
            [
                9900,
                9922
            ],
            [
                9923,
                9933
            ],
            [
                9933,
                9975
            ],
            [
                9975,
                9992
            ],
            [
                9993,
                10056
            ],
            [
                10056,
                10064
            ],
            [
                10065,
                10092
            ],
            [
                10093,
                10104
            ],
            [
                10104,
                10111
            ],
            [
                10111,
                10146
            ],
            [
                10146,
                10149
            ],
            [
                10149,
                10181
            ],
            [
                10181,
                10263
            ],
            [
                10263,
                10282
            ],
            [
                10282,
                10300
            ],
            [
                10301,
                10304
            ],
            [
                10312,
                10315
            ],
            [
                10332,
                10334
            ],
            [
                10335,
                10352
            ],
            [
                10352,
                10460
            ],
            [
                10460,
                10470
            ],
            [
                10471,
                10489
            ],
            [
                10489,
                10501
            ],
            [
                10501,
                10568
            ],
            [
                10568,
                10602
            ],
            [
                10602,
                10611
            ],
            [
                10611,
                10667
            ],
            [
                10667,
                10732
            ],
            [
                10735,
                10779
            ],
            [
                10782,
                10861
            ],
            [
                10861,
                10894
            ],
            [
                10894,
                10896
            ],
            [
                10896,
                10940
            ],
            [
                10940,
                11024
            ],
            [
                11024,
                11047
            ],
            [
                11047,
                11089
            ],
            [
                11089,
                11152
            ],
            [
                11152,
                11170
            ],
            [
                11171,
                11211
            ],
            [
                11211,
                11237
            ],
            [
                11240,
                11245
            ],
            [
                11246,
                11258
            ],
            [
                11259,
                11261
            ],
            [
                11262,
                11266
            ],
            [
                11267,
                11343
            ],
            [
                11343,
                11417
            ],
            [
                11418,
                11434
            ],
            [
                11434,
                11436
            ],
            [
                11436,
                11559
            ],
            [
                11559,
                11611
            ],
            [
                11611,
                11638
            ],
            [
                11638,
                11642
            ],
            [
                11642,
                11691
            ],
            [
                11692,
                11741
            ],
            [
                11744,
                11745
            ],
            [
                11746,
                11749
            ],
            [
                11750,
                11805
            ],
            [
                11811,
                11847
            ],
            [
                11850,
                11928
            ],
            [
                11928,
                11940
            ],
            [
                11941,
                11953
            ],
            [
                11953,
                11973
            ],
            [
                11973,
                12039
            ],
            [
                12039,
                12066
            ],
            [
                12067,
                12078
            ],
            [
                12079,
                12082
            ],
            [
                12083,
                12106
            ],
            [
                12106,
                12127
            ],
            [
                12140,
                12148
            ],
            [
                12148,
                12153
            ],
            [
                12154,
                12245
            ],
            [
                12245,
                12247
            ],
            [
                12247,
                12266
            ],
            [
                12266,
                12291
            ],
            [
                12303,
                12389
            ],
            [
                12389,
                12395
            ],
            [
                12396,
                12429
            ],
            [
                12429,
                12511
            ],
            [
                12520,
                12552
            ],
            [
                12552,
                12564
            ],
            [
                12565,
                12569
            ],
            [
                12579,
                12628
            ],
            [
                12628,
                12656
            ],
            [
                12671,
                12681
            ],
            [
                12682,
                12689
            ],
            [
                12690,
                12713
            ],
            [
                12713,
                12763
            ],
            [
                12764,
                12795
            ],
            [
                12795,
                12804
            ],
            [
                12804,
                12823
            ],
            [
                12823,
                12869
            ],
            [
                12869,
                12906
            ],
            [
                12906,
                12908
            ],
            [
                12909,
                12912
            ],
            [
                12912,
                12924
            ],
            [
                12925,
                12943
            ],
            [
                12943,
                12946
            ],
            [
                12946,
                12991
            ],
            [
                12991,
                13174
            ],
            [
                13174,
                13208
            ],
            [
                13208,
                13256
            ],
            [
                13256,
                13312
            ],
            [
                13312,
                13350
            ],
            [
                13350,
                13371
            ],
            [
                13377,
                13398
            ],
            [
                13398,
                13489
            ],
            [
                13489,
                13591
            ],
            [
                13591,
                13598
            ],
            [
                13599,
                13640
            ],
            [
                13640,
                13684
            ],
            [
                13684,
                13843
            ],
            [
                13843,
                13984
            ],
            [
                13984,
                13986
            ],
            [
                13986,
                14066
            ],
            [
                14072,
                14086
            ],
            [
                14086,
                14232
            ],
            [
                14232,
                14239
            ],
            [
                14240,
                14271
            ],
            [
                14275,
                14287
            ],
            [
                14291,
                14318
            ],
            [
                14319,
                14372
            ],
            [
                14372,
                14419
            ],
            [
                14419,
                14448
            ],
            [
                14448,
                14449
            ],
            [
                14461,
                14488
            ],
            [
                14488,
                14509
            ],
            [
                14509,
                14510
            ],
            [
                14511,
                14539
            ],
            [
                14543,
                14571
            ],
            [
                14571,
                14659
            ],
            [
                14659,
                14688
            ],
            [
                14689,
                14712
            ],
            [
                14712,
                14748
            ],
            [
                14748,
                14773
            ],
            [
                14773,
                14775
            ],
            [
                14775,
                14818
            ],
            [
                14818,
                14890
            ],
            [
                14890,
                14907
            ],
            [
                14908,
                14976
            ],
            [
                14977,
                14991
            ],
            [
                14991,
                15044
            ],
            [
                15045,
                15129
            ],
            [
                15129,
                15221
            ],
            [
                15221,
                15271
            ],
            [
                15272,
                15299
            ],
            [
                15299,
                15301
            ],
            [
                15302,
                15321
            ],
            [
                15322,
                15325
            ],
            [
                15332,
                15361
            ],
            [
                15363,
                15437
            ],
            [
                15437,
                15444
            ],
            [
                15447,
                15459
            ],
            [
                15462,
                15510
            ],
            [
                15510,
                15513
            ],
            [
                15514,
                15523
            ],
            [
                15524,
                15529
            ],
            [
                15534,
                15540
            ],
            [
                15541,
                15542
            ],
            [
                15573,
                15589
            ],
            [
                15589,
                15590
            ],
            [
                15591,
                15650
            ],
            [
                15650,
                15652
            ],
            [
                15652,
                15670
            ],
            [
                15671,
                15706
            ],
            [
                15706,
                15755
            ],
            [
                15756,
                15840
            ],
            [
                15841,
                15866
            ],
            [
                15866,
                15883
            ],
            [
                15884,
                15891
            ],
            [
                15904,
                15913
            ],
            [
                15914,
                15918
            ],
            [
                15919,
                15929
            ],
            [
                15929,
                15934
            ],
            [
                15935,
                15945
            ],
            [
                15945,
                15969
            ],
            [
                15970,
                16010
            ],
            [
                16011,
                16040
            ],
            [
                16041,
                16085
            ]
        ],
        "row_chars": [
            [
                0,
                108
            ],
            [
                108,
                218
            ],
            [
                218,
                276
            ],
            [
                276,
                413
            ],
            [
                413,
                496
            ],
            [
                496,
                552
            ],
            [
                552,
                593
            ],
            [
                593,
                673
            ],
            [
                673,
                711
            ],
            [
                711,
                835
            ],
            [
                835,
                965
            ],
            [
                965,
                1070
            ],
            [
                1070,
                1198
            ],
            [
                1198,
                1198
            ],
            [
                1198,
                1198
            ],
            [
                1198,
                1235
            ],
            [
                1235,
                1297
            ],
            [
                1297,
                1337
            ],
            [
                1337,
                1337
            ],
            [
                1337,
                1438
            ],
            [
                1438,
                1438
            ],
            [
                1438,
                1469
            ],
            [
                1469,
                1504
            ],
            [
                1504,
                1583
            ],
            [
                1583,
                1637
            ],
            [
                1637,
                1707
            ],
            [
                1707,
                1763
            ],
            [
                1763,
                1763
            ],
            [
                1763,
                1851
            ],
            [
                1851,
                1851
            ],
            [
                1851,
                1894
            ],
            [
                1894,
                1961
            ],
            [
                1961,
                2049
            ],
            [
                2049,
                2112
            ],
            [
                2112,
                2183
            ],
            [
                2183,
                2183
            ],
            [
                2183,
                2183
            ],
            [
                2183,
                2230
            ],
            [
                2230,
                2282
            ],
            [
                2282,
                2344
            ],
            [
                2344,
                2344
            ],
            [
                2344,
                2417
            ],
            [
                2417,
                2518
            ],
            [
                2518,
                2689
            ],
            [
                2689,
                2732
            ],
            [
                2732,
                2869
            ],
            [
                2869,
                2895
            ],
            [
                2895,
                2920
            ],
            [
                2920,
                2944
            ],
            [
                2944,
                2959
            ],
            [
                2959,
                2979
            ],
            [
                2979,
                3020
            ],
            [
                3020,
                3110
            ],
            [
                3110,
                3159
            ],
            [
                3159,
                3159
            ],
            [
                3159,
                3159
            ],
            [
                3159,
                3159
            ],
            [
                3159,
                3285
            ],
            [
                3285,
                3285
            ],
            [
                3285,
                3338
            ],
            [
                3338,
                3385
            ],
            [
                3385,
                3414
            ],
            [
                3414,
                3446
            ],
            [
                3446,
                3517
            ],
            [
                3517,
                3517
            ],
            [
                3517,
                3517
            ],
            [
                3517,
                3573
            ],
            [
                3573,
                3712
            ],
            [
                3712,
                3754
            ],
            [
                3754,
                3768
            ],
            [
                3768,
                3821
            ],
            [
                3821,
                3942
            ],
            [
                3942,
                4001
            ],
            [
                4001,
                4025
            ],
            [
                4025,
                4047
            ],
            [
                4047,
                4047
            ],
            [
                4047,
                4047
            ],
            [
                4047,
                4096
            ],
            [
                4096,
                4142
            ],
            [
                4142,
                4142
            ],
            [
                4142,
                4142
            ],
            [
                4142,
                4142
            ],
            [
                4142,
                4258
            ],
            [
                4258,
                4258
            ],
            [
                4258,
                4258
            ],
            [
                4258,
                4258
            ],
            [
                4258,
                4258
            ],
            [
                4258,
                4317
            ],
            [
                4317,
                4439
            ],
            [
                4439,
                4439
            ],
            [
                4439,
                4537
            ],
            [
                4537,
                4628
            ],
            [
                4628,
                4677
            ],
            [
                4677,
                4750
            ],
            [
                4750,
                4750
            ],
            [
                4750,
                4750
            ],
            [
                4750,
                4868
            ],
            [
                4868,
                4903
            ],
            [
                4903,
                4964
            ],
            [
                4964,
                4964
            ],
            [
                4964,
                4993
            ],
            [
                4993,
                5041
            ],
            [
                5041,
                5041
            ],
            [
                5041,
                5041
            ],
            [
                5041,
                5041
            ],
            [
                5041,
                5126
            ],
            [
                5126,
                5218
            ],
            [
                5218,
                5303
            ],
            [
                5303,
                5331
            ],
            [
                5331,
                5376
            ],
            [
                5376,
                5504
            ],
            [
                5504,
                5579
            ],
            [
                5579,
                5616
            ],
            [
                5616,
                5744
            ],
            [
                5744,
                5814
            ],
            [
                5814,
                5871
            ],
            [
                5871,
                5922
            ],
            [
                5922,
                5922
            ],
            [
                5922,
                5922
            ],
            [
                5922,
                6021
            ],
            [
                6021,
                6224
            ],
            [
                6224,
                6242
            ],
            [
                6242,
                6362
            ],
            [
                6362,
                6413
            ],
            [
                6413,
                6459
            ],
            [
                6459,
                6495
            ],
            [
                6495,
                6554
            ],
            [
                6554,
                6579
            ],
            [
                6579,
                6620
            ],
            [
                6620,
                6708
            ],
            [
                6708,
                6732
            ],
            [
                6732,
                6786
            ],
            [
                6786,
                6844
            ],
            [
                6844,
                6888
            ],
            [
                6888,
                6930
            ],
            [
                6930,
                6930
            ],
            [
                6930,
                6965
            ],
            [
                6965,
                7007
            ],
            [
                7007,
                7044
            ],
            [
                7044,
                7081
            ],
            [
                7081,
                7102
            ],
            [
                7102,
                7132
            ],
            [
                7132,
                7154
            ],
            [
                7154,
                7226
            ],
            [
                7226,
                7268
            ],
            [
                7268,
                7297
            ],
            [
                7297,
                7369
            ],
            [
                7369,
                7434
            ],
            [
                7434,
                7464
            ],
            [
                7464,
                7490
            ],
            [
                7490,
                7514
            ],
            [
                7514,
                7575
            ],
            [
                7575,
                7627
            ],
            [
                7627,
                7664
            ],
            [
                7664,
                7721
            ],
            [
                7721,
                7834
            ],
            [
                7834,
                7872
            ],
            [
                7872,
                7872
            ],
            [
                7872,
                8039
            ],
            [
                8039,
                8082
            ],
            [
                8082,
                8102
            ],
            [
                8102,
                8154
            ],
            [
                8154,
                8173
            ],
            [
                8173,
                8173
            ],
            [
                8173,
                8173
            ],
            [
                8173,
                8173
            ],
            [
                8173,
                8173
            ],
            [
                8173,
                8227
            ],
            [
                8227,
                8248
            ],
            [
                8248,
                8248
            ],
            [
                8248,
                8316
            ],
            [
                8316,
                8341
            ],
            [
                8341,
                8379
            ],
            [
                8379,
                8411
            ],
            [
                8411,
                8498
            ],
            [
                8498,
                8544
            ],
            [
                8544,
                8610
            ],
            [
                8610,
                8710
            ],
            [
                8710,
                8710
            ],
            [
                8710,
                8710
            ],
            [
                8710,
                8778
            ],
            [
                8778,
                8778
            ],
            [
                8778,
                8845
            ],
            [
                8845,
                8912
            ],
            [
                8912,
                8934
            ],
            [
                8934,
                8996
            ],
            [
                8996,
                9009
            ],
            [
                9009,
                9051
            ],
            [
                9051,
                9063
            ],
            [
                9063,
                9071
            ],
            [
                9071,
                9140
            ],
            [
                9140,
                9189
            ],
            [
                9189,
                9260
            ],
            [
                9260,
                9303
            ],
            [
                9303,
                9354
            ],
            [
                9354,
                9391
            ],
            [
                9391,
                9501
            ],
            [
                9501,
                9519
            ],
            [
                9519,
                9569
            ],
            [
                9569,
                9624
            ],
            [
                9624,
                9638
            ],
            [
                9638,
                9753
            ],
            [
                9753,
                9836
            ],
            [
                9836,
                9900
            ],
            [
                9900,
                9933
            ],
            [
                9933,
                9975
            ],
            [
                9975,
                9975
            ],
            [
                9975,
                10056
            ],
            [
                10056,
                10104
            ],
            [
                10104,
                10111
            ],
            [
                10111,
                10149
            ],
            [
                10149,
                10181
            ],
            [
                10181,
                10263
            ],
            [
                10263,
                10282
            ],
            [
                10282,
                10352
            ],
            [
                10352,
                10460
            ],
            [
                10460,
                10489
            ],
            [
                10489,
                10501
            ],
            [
                10501,
                10568
            ],
            [
                10568,
                10602
            ],
            [
                10602,
                10611
            ],
            [
                10611,
                10667
            ],
            [
                10667,
                10861
            ],
            [
                10861,
                10896
            ],
            [
                10896,
                10940
            ],
            [
                10940,
                11024
            ],
            [
                11024,
                11047
            ],
            [
                11047,
                11089
            ],
            [
                11089,
                11152
            ],
            [
                11152,
                11211
            ],
            [
                11211,
                11240
            ],
            [
                11240,
                11240
            ],
            [
                11240,
                11343
            ],
            [
                11343,
                11436
            ],
            [
                11436,
                11559
            ],
            [
                11559,
                11559
            ],
            [
                11559,
                11611
            ],
            [
                11611,
                11638
            ],
            [
                11638,
                11642
            ],
            [
                11642,
                11741
            ],
            [
                11741,
                11928
            ],
            [
                11928,
                11953
            ],
            [
                11953,
                11973
            ],
            [
                11973,
                11973
            ],
            [
                11973,
                12039
            ],
            [
                12039,
                12106
            ],
            [
                12106,
                12148
            ],
            [
                12148,
                12247
            ],
            [
                12247,
                12266
            ],
            [
                12266,
                12389
            ],
            [
                12389,
                12429
            ],
            [
                12429,
                12552
            ],
            [
                12552,
                12628
            ],
            [
                12628,
                12713
            ],
            [
                12713,
                12713
            ],
            [
                12713,
                12713
            ],
            [
                12713,
                12713
            ],
            [
                12713,
                12764
            ],
            [
                12764,
                12795
            ],
            [
                12795,
                12804
            ],
            [
                12804,
                12823
            ],
            [
                12823,
                12869
            ],
            [
                12869,
                12906
            ],
            [
                12906,
                12946
            ],
            [
                12946,
                12991
            ],
            [
                12991,
                13174
            ],
            [
                13174,
                13208
            ],
            [
                13208,
                13256
            ],
            [
                13256,
                13312
            ],
            [
                13312,
                13350
            ],
            [
                13350,
                13398
            ],
            [
                13398,
                13489
            ],
            [
                13489,
                13489
            ],
            [
                13489,
                13591
            ],
            [
                13591,
                13640
            ],
            [
                13640,
                13684
            ],
            [
                13684,
                13843
            ],
            [
                13843,
                13986
            ],
            [
                13986,
                14086
            ],
            [
                14086,
                14232
            ],
            [
                14232,
                14372
            ],
            [
                14372,
                14419
            ],
            [
                14419,
                14448
            ],
            [
                14448,
                14488
            ],
            [
                14488,
                14571
            ],
            [
                14571,
                14659
            ],
            [
                14659,
                14712
            ],
            [
                14712,
                14748
            ],
            [
                14748,
                14775
            ],
            [
                14775,
                14818
            ],
            [
                14818,
                14890
            ],
            [
                14890,
                14991
            ],
            [
                14991,
                15129
            ],
            [
                15129,
                15221
            ],
            [
                15221,
                15299
            ],
            [
                15299,
                15363
            ],
            [
                15363,
                15363
            ],
            [
                15363,
                15437
            ],
            [
                15437,
                15510
            ],
            [
                15510,
                15591
            ],
            [
                15591,
                15591
            ],
            [
                15591,
                15652
            ],
            [
                15652,
                15706
            ],
            [
                15706,
                15866
            ],
            [
                15866,
                15945
            ],
            [
                15945,
                15945
            ],
            [
                15945,
                16085
            ]
        ]
    }
}