{
    "original": {
        "text": "On the following morning everybody was stirring by times at Mr. Palliser's house in Park Lane, and the master of that house yawned no more. There is some life in starting for a long journey, and the life is the stronger and the fuller if the things and people to be carried are numerous and troublesome. Lady Glencora was a little troublesome, and would not come down to breakfast in time. When rebuked on account of this manifest breach of engagement, she asserted that the next train would do just as well; and when Mr. Palliser proved to her, with much trouble, that the next train could not enable them to reach Paris on that day, she declared that it would be much more comfortable to take a week in going than to hurry over the ground in one day. There was nothing she wanted so much as to see Folkestone.\n\"If that is the case, why did not you tell me so before?\" said Mr. Palliser, in his gravest voice. \"Richard and the carriage went down yesterday, and are already on board the packet.\"\n\"If Richard and the carriage are already on board the packet,\" said Lady Glencora, \"of course we must follow them, and we must put off the glories of Folkestone till we come back. Alice, haven't you observed that, in travelling, you are always driven on by some Richard or some carriage, till you feel that you are a slave?\"\nAll this was trying to Mr. Palliser; but I think that he enjoyed it, nevertheless, and that he was happy when he found that he did get his freight off from the Pimlico Station in the proper train.\nOf course Lady Glencora and Alice were very ill crossing the Channel; of course the two maids were worse than their mistresses; of course the men kept out of their master's way when they were wanted, and drank brandy-and-water with the steward down-stairs; and of course Lady Glencora declared that she would not allow herself to be carried beyond Boulogne that day;--but, nevertheless, they did get on to Paris. Had Mr. Palliser become Chancellor of the Exchequer, as he had once hoped, he could hardly have worked harder than he did work. It was he who found out which carriage had been taken for them, and who put, with his own hands, the ladies' dressing-cases and cloaks on to the seats,--who laid out the novels, which, of course, were not read by the road,--and made preparations as though this stage of their journey was to take them a week, instead of five hours and a half.\n\"Oh, dear! how I have slept!\" said Lady Glencora, as they came near to Paris.\n\"I think you've been tolerably comfortable,\" said Mr. Palliser, joyfully.\n\"Since we got out of that horrid boat I have done pretty well. Why do they make the boats so nasty? I'm sure they do it on purpose.\"\n\"It would be difficult to make them nice, I suppose?\" said Alice.\n\"It is the sea that makes them uncomfortable,\" said Mr. Palliser.\n\"Never mind; we shan't have any more of it for twelve months, at any rate. We can get to the Kurds, Alice, without getting into a packet again. That, to my way of thinking, is the great comfort of the Continent. One can go everywhere without being seasick.\"\nMr. Palliser said nothing, but he sighed as he thought of being absent for a whole year. He had said that such was his intention, and would not at once go back from what he himself had said. But how was he to live for twelve months out of the House of Commons? What was he to do with himself, with his intellect and his energy, during all these coming dreary days? And then,--he might have been Chancellor of the Exchequer! He might even now, at this very moment, have been upon his legs, making a financial statement of six hours' duration, to the delight of one-half of the House, and bewilderment of the other, instead of dragging cloaks across that dingy, dull, dirty waiting-room at the Paris Station, in which British subjects are kept in prison while their boxes are being tumbled out of the carriages.\n\"But we are not to stop here;--are we?\" said Lady Glencora, mournfully.\n\"No, dear;--I have given the keys to Richard. We will go on at once.\"\n\"But can't we have our things?\"\n\"In about half an hour,\" pleaded Mr. Palliser.\n\"I suppose we must bear it, Alice?\" said Lady Glencora as she got into the carriage that was waiting for her.\nAlice thought of the last time in which she had been in that room,--when George and Kate had been with her,--and the two girls had been quite content to wait patiently while their trunks were being examined. But Alice was now travelling with great people,--with people who never spoke of their wealth, or seemed ever to think of it, but who showed their consciousness of it at every turn of their lives. \"After all,\" Alice had said to herself more than once, \"I doubt whether the burden is not greater than the pleasure.\"\nThey stayed in Paris for a week, and during that time Alice found that she became very intimate with Mr. Palliser. At Matching she had, in truth, seen but little of him, and had known nothing. Now she began to understand his character, and learned how to talk to him, She allowed him to tell her of things in which Lady Glencora resolutely persisted in taking no interest. She delighted him by writing down in a little pocket-book the number of eggs that were consumed in Paris every day, whereas Glencora protested that the information was worth nothing unless her husband could tell her how many of the eggs were good, and how many bad. And Alice was glad to find that a hundred and fifty thousand female operatives were employed in Paris, while Lady Glencora said it was a great shame, and that they ought all to have husbands. When Mr. Palliser explained that that was impossible, because of the redundancy of the female population, she angered him very much by asserting that she saw a great many men walking about who, she was quite sure, had not wives of their own.\n\"I do so wish you had married him!\" Glencora said to Alice that evening. \"You would always have had a pocket-book ready to write down the figures, and you would have pretended to care about the eggs, and the bottles of wine, and the rest of it. As for me, I can't do it. If I see an hungry woman, I can give her my money; or if she be a sick woman, I can nurse her; or if I hear of a very wicked man, I can hate him;--but I cannot take up poverty and crime in the lump. I never believe it all. My mind isn't big enough.\"\nThey went into no society at Paris, and at the end of a week were all glad to leave it.\n\"I don't know that Baden will be any better,\" Lady Glencora said; \"but, you know, we can leave that again after a bit,--and so we shall go on getting nearer to the Kurds.\"\nTo this, Mr. Palliser demurred. \"I think we had better make up our mind to stay a month at Baden.\"\n\"But why should we make up our minds at all?\" his wife pleaded.\n\"I like to have a plan,\" said Mr. Palliser.\n\"And so do I,\" said his wife,--\"if only for the sake of not keeping it.\"\n\"There's nothing I hate so much as not carrying out my intentions,\" said Mr. Palliser.\nUpon this, Lady Glencora shrugged her shoulders, and made a mock grimace to her cousin. All this her husband bore for a while meekly, and it must be acknowledged that he behaved very well. But, then, he had his own way in everything. Lady Glencora did not behave very well,--contradicting her husband, and not considering, as, perhaps, she ought to have done, the sacrifice he was making on her behalf. But, then, she had her own way in nothing.\nShe had her own way in almost nothing; but on one point she did conquer her husband. He was minded to go from Paris back to Cologne, and so down the Rhine to Baden. Lady Glencora declared that she hated the Rhine,--that, of all rivers, it was the most distasteful to her; that, of all scenery, the scenery of the Rhine was the most over-praised; and that she would be wretched all the time if she were carried that way. Upon this, Mr. Palliser referred the matter to Alice; and she, who had last been upon the Rhine with her cousins Kate and George Vavasor, voted for going to Baden by way of Strasbourg.\n\"We will go by Strasbourg, then,\" said Mr. Palliser, gallantly.\n\"Not that I want to see that horrid church again,\" said Glencora.\n\"Everything is alike horrid to you, I think,\" said her husband. \"You are determined not to be contented, so that it matters very little which way we go.\"\n\"That's the truth,\" said his wife. \"It does matter very little.\"\nThey got on to Baden,--with very little delay at Strasbourg, and found half an hotel prepared for their reception. Here the carriage was brought into use for the first time, and the mistress of the carriage talked of sending home for Dandy and Flirt. Mr. Palliser, when he heard the proposition, calmly assured his wife that the horses would not bear the journey. \"They would be so out of condition,\" he said, \"as not to be worth anything for two or three months.\"\n\"I only meant to ask for them if they could come in a balloon,\" said Lady Glencora.\nThis angered Mr. Palliser, who had really, for a few minutes, thought of pacifying his wife by sending for the horses.\n\"Alice,\" she asked, one morning, \"how many eggs are eaten in Baden every morning before ten o'clock?\"\nMr. Palliser, who at the moment was in the act of eating one, threw down his spoon, and pushed his plate from him.\n\"What's the matter, Plantagenet?\" she asked.\n\"The matter!\" he said. \"But never mind; I am a fool to care for it.\"\n\"I declare I didn't know that I had done anything wrong,\" said Lady Glencora. \"Alice, do you understand what it is?\"\nAlice said that she did understand very well.\n\"Of course she understands,\" said Mr. Palliser. \"How can she help it? And, indeed, Miss Vavasor, I am more unhappy than I can express myself, to think that your comfort should be disturbed in this way.\"\n\"Upon my word I think Alice is doing very well,\" said Lady Glencora. \"What is there to hurt her comfort? Nobody scolds her. Nobody tells her that she is a fool. She never jokes, or does anything wicked, and, of course, she isn't punished.\"\nMr. Palliser, as he wandered that day alone through the gambling-rooms at the great Assembly House, thought that, after all, it might have been better for him to have remained in London, to have become Chancellor of the Exchequer, and to have run all risks.\n\"I wonder whether it would be any harm if I were to put a few pieces of money on the table, just once?\" Lady Glencora said to her cousin, on the evening of the same day, in one of those gambling salons. There had been some music on that evening in one side of the building, and the Pallisers had gone to the rooms. But as neither of the two ladies would dance, they had strayed away into the other apartments.\n\"The greatest harm in the world!\" said Alice; \"and what on earth could you gain by it? You don't really want any of those horrid people's money?\"\n\"I'll tell you what I want,--something to live for,--some excitement. Is it not a shame that I see around me so many people getting amusement, and that I can get none? I'd go and sit out there, and drink beer and hear the music, only Plantagenet wouldn't let me. I think I'll throw one piece on to the table to see what becomes of it.\"\n\"I shall leave you if you do,\" said Alice.\n\"You are such a prude! It seems to me as if it must have been my special fate,--my good fate, I mean,--that has thrown me so much with you. You look after me quite as carefully as Mr. Bott and Mrs. Marsham ever did; but as I chose you myself, I can't very well complain, and I can't very well get rid of you.\"\n\"Do you want to get rid of me, Cora?\"\n\"Sometimes. Do you know, there are moments when I almost make up my mind to go headlong to the devil,--when I think it is the best thing to be done. It's a hard thing for a woman to do, because she has to undergo so much obloquy before she gets used to it. A man can take to drinking, and gambling and all the rest of it, and nobody despises him a bit. The domestic old fogies give him lectures if they can catch him, but he isn't fool enough for that. All he wants is money, and he goes away and has his fling. Now I have plenty of money,--or, at any rate, I had,--and I never got my fling yet. I do feel so tempted to rebel, and go ahead, and care for nothing.\"\n\"Throwing one piece on to the table wouldn't satisfy that longing.\"\n\"You think I should be like the wild beast that has tasted blood, and can't be controlled. Look at all these people here. There are husbands gambling, and their wives don't know it; and wives gambling, and their husbands don't know it. I wonder whether Plantagenet ever has a fling? What a joke it would be to come and catch him!\"\n\"I don't think you need be afraid.\"\n\"Afraid! I should like him all the better for it. If he came to me, some morning, and told me that he had lost a hundred thousand pounds, I should be so much more at my ease with him.\"\n\"You have no chance in that direction, I'm quite sure.\"\n\"None the least. He'd make a calculation that the chances were nine to seven against him, and then the speculation would seem to him to be madness.\"\n\"I don't suppose he'd wish to try, even though he were sure of winning.\"\n\"Of course not. It would be a very vulgar kind of thing then. Look,--there's an opening there. I'll just put on one napoleon.\"\n\"You shall not. If you do, I'll leave you at once. Look at the women who are playing. Is there one there whom it would not disgrace you to touch? Look what they are. Look at their cheeks, and their eyes, and their hands. Those men who rake about the money are bad enough, but the women look like fiends.\"\n\"You're not going to frighten me in that hobgoblin sort of way, you know. I don't see anything the matter with any of the people.\"\n\"What do you think of that young woman who has just got a handful of money from the man next to her?\"\n\"I think she is very happy. I never get money given to me by handfuls, and the man to whom I belong gives me no encouragement when I want to amuse myself.\" They were now standing near to one end of the table, and suddenly there came to be an opening through the crowd up to the table itself. Lady Glencora, leaving Alice's side, at once stepped up and deposited a piece of gold on one of the marked compartments. As soon as she placed it she retreated again with flushed face, and took hold of Alice's arm. \"There,\" she said, \"I have done it.\" Alice, in her dismay, did not know what step to take. She could not scold her friend now, as the eyes of many were turned upon them, nor could she, of course, leave her, as she had threatened. Lady Glencora laughed with her peculiar little low laughter, and stood her ground. \"I was determined you shouldn't frighten me out of it,\" she said.\n[Illustration: Lady Glencora at Baden.]\nOne of the ministers at the table had in the meantime gone on with the cards, and had called the game; and another minister had gently pushed three or four more pieces of gold up to that which Lady Glencora had flung down, and had then cunningly caught her eye, and, with all the courtesy of which he was master, had pushed them further on towards her. She had supposed herself to be unknown there in the salon, but no doubt all the croupiers and half the company knew well enough who was the new customer at the table. There was still the space open, near to which she stood, and then someone motioned to her to come and take up the money which she had won. She hesitated, and then the croupier asked her, in that low, indifferent voice which these men always use, whether she desired that her money should remain. She nodded her head to him, and he at once drew the money back again to the spot on which she had placed the first napoleon. Again the cards were turned up softly, again the game was called, and again she won. The money was dealt out to her,--on this occasion with a full hand. There were lying there between twenty and thirty napoleons, of which she was the mistress. Her face had flushed before, but now it became very red. She caught hold of Alice, who was literally trembling beside her, and tried to laugh again. But there was that in her eye which told Alice that she was really frightened. Some one then placed a chair for her at the table, and in her confusion, not knowing what she was to do, she seated herself. \"Come away,\" said Alice, taking hold of her, and disregarding everything but her own purpose, in the agony of the moment. \"You must come away! You shall not sit there!\" \"I must get rid of that money,\" said Glencora, trying to whisper her words, \"and then I will come away.\" The croupier again asked her if the money was to remain, and she again nodded her head. Everybody at the table was now looking at her. The women especially were staring at her,--those horrid women with vermilion cheeks, and loud bonnets half off their heads, and hard, shameless eyes, and white gloves, which, when taken off in the ardour of the game, disclosed dirty hands. They stared at her with that fixed stare which such women have, and Alice saw it all, and trembled.\nAgain she won. \"Leave it,\" said Alice, \"and come away.\" \"I can't leave it,\" said Glencora. \"If I do, there'll be a fuss. I'll go the next time.\" What she said was, of course, in English, and was probably understood by no one near her; but it was easy to be seen that she was troubled, and, of course, those around her looked at her the more because of her trouble. Again that little question and answer went on between her and the croupier, and on this occasion the money was piled up on the compartment--a heap of gold which made envious the hearts of many who stood around there. Alice had now both her hands on the back of the chair, needing support. If the devil should persist, and increase that stock of gold again, she must go and seek for Mr. Palliser. She knew not what else to do. She understood nothing of the table, or of its laws; but she supposed all those ministers of the game to be thieves, and believed that all villainous contrivances were within their capacity. She thought that they might go on adding to that heap so long as Lady Glencora would sit there, presuming that they might thus get her into their clutches. Of course, she did not sift her suspicions. Who does at such moments? \"Come away at once, and leave it,\" she said, \"or I shall go.\" At that moment the croupier raked it all up, and carried it all away; but Alice did not see that this had been done. A hand had been placed on her shoulder, and as she turned round her face her eyes met those of Mr. Palliser. \"It is all gone,\" said Glencora, laughing. And now she, turning round, also saw her husband. \"I am so glad that you are come,\" said Alice. \"Why did you bring her here?\" said Mr. Palliser. There was anger in his tone, and anger in his eye. He took his wife's arm upon his own, and walked away quickly, while Alice followed them alone. He went off at once, down the front steps of the building, towards the hotel. What he said to his wife, Alice did not hear; but her heart was swelling with the ill-usage to which she herself was subjected. Though she might have to go back alone to England, she would tell him that he was ill-treating her. She followed him on, up into their drawing-room, and there he stood with the door open in his hand for her, while Lady Glencora threw herself upon a sofa, and burst out into affected laughter. \"Here's a piece of work,\" she said, \"about a little accident.\"\n\"An accident!\" said Mr. Palliser.\n\"Yes, an accident. You don't suppose that I sat down there meaning to win all that money?\" Whereupon he looked at her with scorn.\n\"Mr. Palliser,\" said Alice, \"you have treated me this evening in a manner I did not expect from you. It is clear that you blame me.\"\n\"I have not said a word, Miss Vavasor.\"\n\"No; you have not said a word. You know well how to show your anger without speaking. As I do not choose to undergo your displeasure, I will return to England by myself.\"\n\"Alice! Alice!\" said Glencora, jumping up, \"that is nonsense! What is all this trumpery thing about? Leave me, because he chooses to be angry about nothing?\"\n\"Is it nothing that I find my wife playing at a common gambling-table, surrounded by all that is wretched and vile,--established there, seated, with heaps of gold before her?\"\n\"You wrong me, Plantagenet,\" said Glencora. \"There was only one heap, and that did not remain long. Did it, Alice?\"\n\"It is impossible to make you ashamed of anything,\" he said.\n\"I certainly don't like being ashamed,\" she answered; \"and don't feel any necessity on this occasion.\"\n\"If you don't object, Mr. Palliser,\" said Alice, \"I will go to bed. You can think over all this at night,--and so can I. Good night, Glencora.\" Then Alice took her candle, and marched off to her own room, with all the dignity of which she was mistress.",
        "paragraph_chars": [
            [
                0,
                812
            ],
            [
                812,
                996
            ],
            [
                996,
                1321
            ],
            [
                1321,
                1518
            ],
            [
                1518,
                2402
            ],
            [
                2402,
                2480
            ],
            [
                2480,
                2554
            ],
            [
                2554,
                2687
            ],
            [
                2687,
                2753
            ],
            [
                2753,
                2819
            ],
            [
                2819,
                3077
            ],
            [
                3077,
                3887
            ],
            [
                3887,
                3959
            ],
            [
                3959,
                4029
            ],
            [
                4029,
                4061
            ],
            [
                4061,
                4108
            ],
            [
                4108,
                4218
            ],
            [
                4218,
                4740
            ],
            [
                4740,
                5813
            ],
            [
                5813,
                6334
            ],
            [
                6334,
                6422
            ],
            [
                6422,
                6594
            ],
            [
                6594,
                6693
            ],
            [
                6693,
                6757
            ],
            [
                6757,
                6801
            ],
            [
                6801,
                6874
            ],
            [
                6874,
                6961
            ],
            [
                6961,
                7407
            ],
            [
                7407,
                8012
            ],
            [
                8012,
                8076
            ],
            [
                8076,
                8142
            ],
            [
                8142,
                8296
            ],
            [
                8296,
                8361
            ],
            [
                8361,
                8826
            ],
            [
                8826,
                8910
            ],
            [
                8910,
                9029
            ],
            [
                9029,
                9131
            ],
            [
                9131,
                9246
            ],
            [
                9246,
                9291
            ],
            [
                9291,
                9360
            ],
            [
                9360,
                9477
            ],
            [
                9477,
                9523
            ],
            [
                9523,
                9726
            ],
            [
                9726,
                9966
            ],
            [
                9966,
                10224
            ],
            [
                10224,
                10634
            ],
            [
                10634,
                10780
            ],
            [
                10780,
                11116
            ],
            [
                11116,
                11159
            ],
            [
                11159,
                11469
            ],
            [
                11469,
                11507
            ],
            [
                11507,
                12171
            ],
            [
                12171,
                12239
            ],
            [
                12239,
                12570
            ],
            [
                12570,
                12606
            ],
            [
                12606,
                12791
            ],
            [
                12791,
                12847
            ],
            [
                12847,
                12996
            ],
            [
                12996,
                13069
            ],
            [
                13069,
                13196
            ],
            [
                13196,
                13501
            ],
            [
                13501,
                13632
            ],
            [
                13632,
                13734
            ],
            [
                13734,
                14620
            ],
            [
                14620,
                14660
            ],
            [
                14660,
                16947
            ],
            [
                16947,
                19339
            ],
            [
                19339,
                19373
            ],
            [
                19373,
                19503
            ],
            [
                19503,
                19636
            ],
            [
                19636,
                19676
            ],
            [
                19676,
                19847
            ],
            [
                19847,
                20005
            ],
            [
                20005,
                20181
            ],
            [
                20181,
                20297
            ],
            [
                20297,
                20358
            ],
            [
                20358,
                20461
            ],
            [
                20461,
                20713
            ]
        ],
        "segment_chars": [
            [
                0,
                140
            ],
            [
                140,
                304
            ],
            [
                304,
                390
            ],
            [
                390,
                753
            ],
            [
                753,
                812
            ],
            [
                812,
                870
            ],
            [
                870,
                911
            ],
            [
                911,
                996
            ],
            [
                996,
                1176
            ],
            [
                1176,
                1321
            ],
            [
                1321,
                1518
            ],
            [
                1518,
                1931
            ],
            [
                1931,
                2059
            ],
            [
                2059,
                2402
            ],
            [
                2402,
                2413
            ],
            [
                2413,
                2432
            ],
            [
                2432,
                2480
            ],
            [
                2480,
                2554
            ],
            [
                2554,
                2617
            ],
            [
                2617,
                2654
            ],
            [
                2654,
                2687
            ],
            [
                2687,
                2741
            ],
            [
                2741,
                2753
            ],
            [
                2753,
                2819
            ],
            [
                2819,
                2894
            ],
            [
                2894,
                2963
            ],
            [
                2963,
                3031
            ],
            [
                3031,
                3077
            ],
            [
                3077,
                3166
            ],
            [
                3166,
                3268
            ],
            [
                3268,
                3338
            ],
            [
                3338,
                3442
            ],
            [
                3442,
                3501
            ],
            [
                3501,
                3887
            ],
            [
                3887,
                3927
            ],
            [
                3927,
                3959
            ],
            [
                3959,
                4005
            ],
            [
                4005,
                4029
            ],
            [
                4029,
                4061
            ],
            [
                4061,
                4108
            ],
            [
                4108,
                4144
            ],
            [
                4144,
                4218
            ],
            [
                4218,
                4426
            ],
            [
                4426,
                4622
            ],
            [
                4622,
                4740
            ],
            [
                4740,
                4855
            ],
            [
                4855,
                4933
            ],
            [
                4933,
                5113
            ],
            [
                5113,
                5379
            ],
            [
                5379,
                5571
            ],
            [
                5571,
                5813
            ],
            [
                5813,
                5849
            ],
            [
                5849,
                5886
            ],
            [
                5886,
                6058
            ],
            [
                6058,
                6084
            ],
            [
                6084,
                6283
            ],
            [
                6283,
                6307
            ],
            [
                6307,
                6334
            ],
            [
                6334,
                6422
            ],
            [
                6422,
                6594
            ],
            [
                6594,
                6626
            ],
            [
                6626,
                6693
            ],
            [
                6693,
                6739
            ],
            [
                6739,
                6757
            ],
            [
                6757,
                6801
            ],
            [
                6801,
                6874
            ],
            [
                6874,
                6961
            ],
            [
                6961,
                7049
            ],
            [
                7049,
                7150
            ],
            [
                7150,
                7195
            ],
            [
                7195,
                7364
            ],
            [
                7364,
                7407
            ],
            [
                7407,
                7492
            ],
            [
                7492,
                7572
            ],
            [
                7572,
                7827
            ],
            [
                7827,
                8012
            ],
            [
                8012,
                8076
            ],
            [
                8076,
                8142
            ],
            [
                8142,
                8206
            ],
            [
                8206,
                8296
            ],
            [
                8296,
                8331
            ],
            [
                8331,
                8361
            ],
            [
                8361,
                8476
            ],
            [
                8476,
                8612
            ],
            [
                8612,
                8725
            ],
            [
                8725,
                8826
            ],
            [
                8826,
                8910
            ],
            [
                8910,
                9029
            ],
            [
                9029,
                9131
            ],
            [
                9131,
                9246
            ],
            [
                9246,
                9280
            ],
            [
                9280,
                9291
            ],
            [
                9291,
                9305
            ],
            [
                9305,
                9314
            ],
            [
                9314,
                9360
            ],
            [
                9360,
                9438
            ],
            [
                9438,
                9477
            ],
            [
                9477,
                9523
            ],
            [
                9523,
                9571
            ],
            [
                9571,
                9593
            ],
            [
                9593,
                9726
            ],
            [
                9726,
                9795
            ],
            [
                9795,
                9831
            ],
            [
                9831,
                9850
            ],
            [
                9850,
                9887
            ],
            [
                9887,
                9966
            ],
            [
                9966,
                10224
            ],
            [
                10224,
                10328
            ],
            [
                10328,
                10427
            ],
            [
                10427,
                10539
            ],
            [
                10539,
                10634
            ],
            [
                10634,
                10668
            ],
            [
                10668,
                10721
            ],
            [
                10721,
                10780
            ],
            [
                10780,
                10850
            ],
            [
                10850,
                10948
            ],
            [
                10948,
                11043
            ],
            [
                11043,
                11116
            ],
            [
                11116,
                11159
            ],
            [
                11159,
                11182
            ],
            [
                11182,
                11299
            ],
            [
                11299,
                11469
            ],
            [
                11469,
                11507
            ],
            [
                11507,
                11519
            ],
            [
                11519,
                11656
            ],
            [
                11656,
                11764
            ],
            [
                11764,
                11860
            ],
            [
                11860,
                11960
            ],
            [
                11960,
                12019
            ],
            [
                12019,
                12103
            ],
            [
                12103,
                12171
            ],
            [
                12171,
                12239
            ],
            [
                12239,
                12330
            ],
            [
                12330,
                12361
            ],
            [
                12361,
                12475
            ],
            [
                12475,
                12522
            ],
            [
                12522,
                12570
            ],
            [
                12570,
                12606
            ],
            [
                12606,
                12615
            ],
            [
                12615,
                12656
            ],
            [
                12656,
                12791
            ],
            [
                12791,
                12847
            ],
            [
                12847,
                12864
            ],
            [
                12864,
                12996
            ],
            [
                12996,
                13069
            ],
            [
                13069,
                13085
            ],
            [
                13085,
                13131
            ],
            [
                13131,
                13164
            ],
            [
                13164,
                13196
            ],
            [
                13196,
                13212
            ],
            [
                13212,
                13247
            ],
            [
                13247,
                13282
            ],
            [
                13282,
                13342
            ],
            [
                13342,
                13362
            ],
            [
                13362,
                13417
            ],
            [
                13417,
                13501
            ],
            [
                13501,
                13575
            ],
            [
                13575,
                13632
            ],
            [
                13632,
                13734
            ],
            [
                13734,
                13762
            ],
            [
                13762,
                13890
            ],
            [
                13890,
                14026
            ],
            [
                14026,
                14147
            ],
            [
                14147,
                14241
            ],
            [
                14241,
                14278
            ],
            [
                14278,
                14332
            ],
            [
                14332,
                14471
            ],
            [
                14471,
                14554
            ],
            [
                14554,
                14620
            ],
            [
                14620,
                14660
            ],
            [
                14660,
                15013
            ],
            [
                15013,
                15180
            ],
            [
                15180,
                15319
            ],
            [
                15319,
                15476
            ],
            [
                15476,
                15601
            ],
            [
                15601,
                15686
            ],
            [
                15686,
                15754
            ],
            [
                15754,
                15845
            ],
            [
                15845,
                15902
            ],
            [
                15902,
                15994
            ],
            [
                15994,
                16073
            ],
            [
                16073,
                16198
            ],
            [
                16198,
                16320
            ],
            [
                16320,
                16341
            ],
            [
                16341,
                16367
            ],
            [
                16367,
                16472
            ],
            [
                16472,
                16560
            ],
            [
                16560,
                16607
            ],
            [
                16607,
                16847
            ],
            [
                16847,
                16947
            ],
            [
                16947,
                16962
            ],
            [
                16962,
                17003
            ],
            [
                17003,
                17038
            ],
            [
                17038,
                17068
            ],
            [
                17068,
                17092
            ],
            [
                17092,
                17312
            ],
            [
                17312,
                17529
            ],
            [
                17529,
                17601
            ],
            [
                17601,
                17708
            ],
            [
                17708,
                17738
            ],
            [
                17738,
                17929
            ],
            [
                17929,
                18085
            ],
            [
                18085,
                18129
            ],
            [
                18129,
                18155
            ],
            [
                18155,
                18217
            ],
            [
                18217,
                18334
            ],
            [
                18334,
                18443
            ],
            [
                18443,
                18486
            ],
            [
                18486,
                18536
            ],
            [
                18536,
                18582
            ],
            [
                18582,
                18612
            ],
            [
                18612,
                18631
            ],
            [
                18631,
                18682
            ],
            [
                18682,
                18777
            ],
            [
                18777,
                18855
            ],
            [
                18855,
                18983
            ],
            [
                18983,
                19083
            ],
            [
                19083,
                19276
            ],
            [
                19276,
                19339
            ],
            [
                19339,
                19354
            ],
            [
                19354,
                19373
            ],
            [
                19373,
                19392
            ],
            [
                19392,
                19464
            ],
            [
                19464,
                19503
            ],
            [
                19503,
                19604
            ],
            [
                19604,
                19636
            ],
            [
                19636,
                19676
            ],
            [
                19676,
                19707
            ],
            [
                19707,
                19762
            ],
            [
                19762,
                19847
            ],
            [
                19847,
                19855
            ],
            [
                19855,
                19863
            ],
            [
                19863,
                19909
            ],
            [
                19909,
                19948
            ],
            [
                19948,
                20005
            ],
            [
                20005,
                20181
            ],
            [
                20181,
                20225
            ],
            [
                20225,
                20281
            ],
            [
                20281,
                20297
            ],
            [
                20297,
                20358
            ],
            [
                20358,
                20461
            ],
            [
                20461,
                20529
            ],
            [
                20529,
                20582
            ],
            [
                20582,
                20605
            ],
            [
                20605,
                20713
            ]
        ],
        "overlap_chars": [
            [
                0,
                24
            ],
            [
                60,
                72
            ],
            [
                124,
                140
            ],
            [
                140,
                170
            ],
            [
                175,
                223
            ],
            [
                228,
                304
            ],
            [
                304,
                390
            ],
            [
                390,
                402
            ],
            [
                451,
                724
            ],
            [
                751,
                753
            ],
            [
                753,
                812
            ],
            [
                812,
                870
            ],
            [
                870,
                911
            ],
            [
                911,
                996
            ],
            [
                996,
                1109
            ],
            [
                1174,
                1176
            ],
            [
                1176,
                1321
            ],
            [
                1321,
                1407
            ],
            [
                1416,
                1430
            ],
            [
                1445,
                1476
            ],
            [
                1481,
                1518
            ],
            [
                1518,
                1663
            ],
            [
                1766,
                1767
            ],
            [
                1722,
                1761
            ],
            [
                1773,
                1830
            ],
            [
                1859,
                1884
            ],
            [
                1886,
                1931
            ],
            [
                1931,
                1983
            ],
            [
                2006,
                2040
            ],
            [
                2057,
                2059
            ],
            [
                2059,
                2106
            ],
            [
                2113,
                2134
            ],
            [
                2156,
                2210
            ],
            [
                2212,
                2236
            ],
            [
                2283,
                2402
            ],
            [
                2402,
                2413
            ],
            [
                2413,
                2432
            ],
            [
                2432,
                2459
            ],
            [
                2473,
                2480
            ],
            [
                2480,
                2542
            ],
            [
                2544,
                2554
            ],
            [
                2554,
                2617
            ],
            [
                2617,
                2654
            ],
            [
                2654,
                2687
            ],
            [
                2753,
                2819
            ],
            [
                2819,
                2894
            ],
            [
                2894,
                2948
            ],
            [
                2956,
                2963
            ],
            [
                2963,
                2967
            ],
            [
                2992,
                3031
            ],
            [
                3031,
                3077
            ],
            [
                3077,
                3166
            ],
            [
                3166,
                3205
            ],
            [
                3266,
                3268
            ],
            [
                3268,
                3338
            ],
            [
                3338,
                3442
            ],
            [
                3442,
                3445
            ],
            [
                3453,
                3501
            ],
            [
                3501,
                3509
            ],
            [
                3520,
                3539
            ],
            [
                3541,
                3559
            ],
            [
                3564,
                3663
            ],
            [
                3872,
                3875
            ],
            [
                3664,
                3689
            ],
            [
                3689,
                3736
            ],
            [
                3743,
                3782
            ],
            [
                3885,
                3887
            ],
            [
                4218,
                4278
            ],
            [
                4279,
                4284
            ],
            [
                4286,
                4324
            ],
            [
                4424,
                4426
            ],
            [
                4426,
                4429
            ],
            [
                4436,
                4473
            ],
            [
                4487,
                4518
            ],
            [
                4549,
                4621
            ],
            [
                4622,
                4634
            ],
            [
                4645,
                4660
            ],
            [
                4675,
                4679
            ],
            [
                4686,
                4740
            ],
            [
                4740,
                4799
            ],
            [
                4841,
                4853
            ],
            [
                4853,
                4855
            ],
            [
                4855,
                4874
            ],
            [
                4886,
                4890
            ],
            [
                4895,
                4908
            ],
            [
                4931,
                4933
            ],
            [
                4933,
                5006
            ],
            [
                5008,
                5035
            ],
            [
                5039,
                5079
            ],
            [
                5100,
                5113
            ],
            [
                5113,
                5280
            ],
            [
                5295,
                5379
            ],
            [
                5379,
                5548
            ],
            [
                5553,
                5570
            ],
            [
                5813,
                5849
            ],
            [
                5849,
                5886
            ],
            [
                5886,
                6020
            ],
            [
                6046,
                6058
            ],
            [
                6069,
                6084
            ],
            [
                6084,
                6092
            ],
            [
                6195,
                6196
            ],
            [
                6096,
                6144
            ],
            [
                6148,
                6178
            ],
            [
                6231,
                6283
            ],
            [
                6283,
                6307
            ],
            [
                6307,
                6334
            ],
            [
                6334,
                6399
            ],
            [
                6404,
                6417
            ],
            [
                6420,
                6422
            ],
            [
                6422,
                6492
            ],
            [
                6504,
                6516
            ],
            [
                6522,
                6539
            ],
            [
                6542,
                6545
            ],
            [
                6572,
                6594
            ],
            [
                6605,
                6626
            ],
            [
                6626,
                6648
            ],
            [
                6669,
                6690
            ],
            [
                6758,
                6779
            ],
            [
                6801,
                6830
            ],
            [
                6832,
                6874
            ],
            [
                6874,
                6961
            ],
            [
                6961,
                7049
            ],
            [
                7049,
                7074
            ],
            [
                7087,
                7093
            ],
            [
                7075,
                7086
            ],
            [
                7128,
                7150
            ],
            [
                7150,
                7195
            ],
            [
                7195,
                7233
            ],
            [
                7246,
                7282
            ],
            [
                7321,
                7364
            ],
            [
                7364,
                7407
            ],
            [
                7450,
                7492
            ],
            [
                7492,
                7494
            ],
            [
                7506,
                7543
            ],
            [
                7547,
                7572
            ],
            [
                7572,
                7620
            ],
            [
                7753,
                7783
            ],
            [
                7797,
                7808
            ],
            [
                7817,
                7827
            ],
            [
                7840,
                7927
            ],
            [
                7940,
                8012
            ],
            [
                8012,
                8063
            ],
            [
                8065,
                8076
            ],
            [
                8076,
                8142
            ],
            [
                8142,
                8156
            ],
            [
                8163,
                8206
            ],
            [
                8206,
                8296
            ],
            [
                8296,
                8331
            ],
            [
                8331,
                8361
            ],
            [
                8361,
                8369
            ],
            [
                8373,
                8382
            ],
            [
                8422,
                8436
            ],
            [
                8440,
                8476
            ],
            [
                8476,
                8538
            ],
            [
                8568,
                8612
            ],
            [
                8612,
                8624
            ],
            [
                8657,
                8724
            ],
            [
                8725,
                8826
            ],
            [
                8826,
                8910
            ],
            [
                8910,
                8951
            ],
            [
                8972,
                9029
            ],
            [
                9029,
                9101
            ],
            [
                9110,
                9131
            ],
            [
                9131,
                9166
            ],
            [
                9181,
                9246
            ],
            [
                9246,
                9280
            ],
            [
                9280,
                9291
            ],
            [
                9291,
                9305
            ],
            [
                9305,
                9314
            ],
            [
                9314,
                9350
            ],
            [
                9355,
                9360
            ],
            [
                9360,
                9438
            ],
            [
                9438,
                9477
            ],
            [
                9477,
                9496
            ],
            [
                9512,
                9523
            ],
            [
                9523,
                9571
            ],
            [
                9571,
                9593
            ],
            [
                9593,
                9656
            ],
            [
                9663,
                9726
            ],
            [
                9726,
                9727
            ],
            [
                9740,
                9795
            ],
            [
                9795,
                9831
            ],
            [
                9831,
                9850
            ],
            [
                9850,
                9887
            ],
            [
                9887,
                9966
            ],
            [
                9966,
                10224
            ],
            [
                10224,
                10328
            ],
            [
                10328,
                10360
            ],
            [
                10369,
                10376
            ],
            [
                10392,
                10427
            ],
            [
                10427,
                10452
            ],
            [
                10469,
                10501
            ],
            [
                10502,
                10505
            ],
            [
                10565,
                10571
            ],
            [
                10590,
                10634
            ],
            [
                10634,
                10668
            ],
            [
                10668,
                10719
            ],
            [
                10780,
                10781
            ],
            [
                10809,
                10830
            ],
            [
                10833,
                10850
            ],
            [
                10850,
                10948
            ],
            [
                10948,
                11043
            ],
            [
                11043,
                11116
            ],
            [
                11116,
                11159
            ],
            [
                11159,
                11182
            ],
            [
                11299,
                11469
            ],
            [
                11469,
                11507
            ],
            [
                11507,
                11519
            ],
            [
                11519,
                11607
            ],
            [
                11610,
                11656
            ],
            [
                11656,
                11704
            ],
            [
                11747,
                11751
            ],
            [
                11720,
                11722
            ],
            [
                11762,
                11764
            ],
            [
                11764,
                11860
            ],
            [
                11960,
                11966
            ],
            [
                11973,
                12019
            ],
            [
                12019,
                12046
            ],
            [
                12073,
                12103
            ],
            [
                12103,
                12171
            ],
            [
                12171,
                12239
            ],
            [
                12239,
                12328
            ],
            [
                12330,
                12361
            ],
            [
                12361,
                12475
            ],
            [
                12475,
                12522
            ],
            [
                12522,
                12570
            ],
            [
                12570,
                12603
            ],
            [
                12603,
                12606
            ],
            [
                12606,
                12615
            ],
            [
                12615,
                12656
            ],
            [
                12656,
                12672
            ],
            [
                12674,
                12791
            ],
            [
                12791,
                12792
            ],
            [
                12801,
                12810
            ],
            [
                12814,
                12818
            ],
            [
                12828,
                12847
            ],
            [
                12847,
                12864
            ],
            [
                12864,
                12972
            ],
            [
                12986,
                12996
            ],
            [
                12996,
                13035
            ],
            [
                13043,
                13069
            ],
            [
                13069,
                13085
            ],
            [
                13131,
                13135
            ],
            [
                13138,
                13164
            ],
            [
                13164,
                13196
            ],
            [
                13196,
                13212
            ],
            [
                13212,
                13247
            ],
            [
                13247,
                13282
            ],
            [
                13417,
                13426
            ],
            [
                13452,
                13501
            ],
            [
                13501,
                13551
            ],
            [
                13560,
                13575
            ],
            [
                13575,
                13632
            ],
            [
                13632,
                13734
            ],
            [
                13734,
                13762
            ],
            [
                13762,
                13889
            ],
            [
                13890,
                13917
            ],
            [
                13921,
                14001
            ],
            [
                14024,
                14026
            ],
            [
                14026,
                14039
            ],
            [
                14063,
                14085
            ],
            [
                14096,
                14146
            ],
            [
                14172,
                14240
            ],
            [
                14241,
                14277
            ],
            [
                14278,
                14317
            ],
            [
                14323,
                14325
            ],
            [
                14330,
                14332
            ],
            [
                14332,
                14362
            ],
            [
                14366,
                14370
            ],
            [
                14383,
                14387
            ],
            [
                14375,
                14379
            ],
            [
                14388,
                14470
            ],
            [
                14471,
                14530
            ],
            [
                14552,
                14554
            ],
            [
                14554,
                14620
            ],
            [
                14660,
                14670
            ],
            [
                14681,
                14713
            ],
            [
                14746,
                14774
            ],
            [
                14784,
                14925
            ],
            [
                14973,
                14996
            ],
            [
                15000,
                15013
            ],
            [
                15013,
                15051
            ],
            [
                15058,
                15144
            ],
            [
                15145,
                15148
            ],
            [
                15178,
                15180
            ],
            [
                15246,
                15319
            ],
            [
                15319,
                15369
            ],
            [
                15375,
                15397
            ],
            [
                15424,
                15476
            ],
            [
                15476,
                15486
            ],
            [
                15504,
                15510
            ],
            [
                15519,
                15538
            ],
            [
                15545,
                15600
            ],
            [
                15601,
                15686
            ],
            [
                15686,
                15716
            ],
            [
                15777,
                15812
            ],
            [
                15843,
                15845
            ],
            [
                15845,
                15902
            ],
            [
                15902,
                15994
            ],
            [
                15994,
                16072
            ],
            [
                16087,
                16162
            ],
            [
                16171,
                16197
            ],
            [
                16198,
                16221
            ],
            [
                16318,
                16320
            ],
            [
                16320,
                16339
            ],
            [
                16367,
                16431
            ],
            [
                16441,
                16472
            ],
            [
                16472,
                16549
            ],
            [
                16558,
                16560
            ],
            [
                16560,
                16607
            ],
            [
                16607,
                16647
            ],
            [
                16669,
                16673
            ],
            [
                16735,
                16755
            ],
            [
                16718,
                16723
            ],
            [
                16761,
                16773
            ],
            [
                16834,
                16847
            ],
            [
                16915,
                16947
            ],
            [
                16947,
                16961
            ],
            [
                16962,
                17002
            ],
            [
                17003,
                17038
            ],
            [
                17038,
                17068
            ],
            [
                17068,
                17092
            ],
            [
                17092,
                17133
            ],
            [
                17182,
                17200
            ],
            [
                17209,
                17278
            ],
            [
                17283,
                17312
            ],
            [
                17312,
                17391
            ],
            [
                17409,
                17450
            ],
            [
                17452,
                17466
            ],
            [
                17527,
                17528
            ],
            [
                17529,
                17601
            ],
            [
                17601,
                17708
            ],
            [
                17708,
                17737
            ],
            [
                18155,
                18217
            ],
            [
                18217,
                18308
            ],
            [
                18314,
                18318
            ],
            [
                18332,
                18334
            ],
            [
                18334,
                18442
            ],
            [
                18443,
                18486
            ],
            [
                18486,
                18535
            ],
            [
                18536,
                18581
            ],
            [
                18582,
                18612
            ],
            [
                18612,
                18631
            ],
            [
                18631,
                18663
            ],
            [
                18670,
                18682
            ],
            [
                18682,
                18704
            ],
            [
                18717,
                18777
            ],
            [
                18777,
                18784
            ],
            [
                18798,
                18855
            ],
            [
                18855,
                18927
            ],
            [
                18981,
                18983
            ],
            [
                18983,
                19083
            ],
            [
                19083,
                19169
            ],
            [
                19189,
                19275
            ],
            [
                19276,
                19339
            ],
            [
                19339,
                19354
            ],
            [
                19354,
                19373
            ],
            [
                19373,
                19392
            ],
            [
                19392,
                19464
            ],
            [
                19464,
                19503
            ],
            [
                19503,
                19604
            ],
            [
                19604,
                19636
            ],
            [
                19636,
                19676
            ],
            [
                19707,
                19762
            ],
            [
                19762,
                19847
            ],
            [
                19847,
                19855
            ],
            [
                19855,
                19863
            ],
            [
                19863,
                19909
            ],
            [
                19909,
                19948
            ],
            [
                19948,
                20005
            ],
            [
                20005,
                20039
            ],
            [
                20141,
                20147
            ],
            [
                20040,
                20119
            ],
            [
                20178,
                20181
            ],
            [
                20181,
                20225
            ],
            [
                20225,
                20281
            ],
            [
                20281,
                20297
            ],
            [
                20297,
                20358
            ],
            [
                20358,
                20461
            ],
            [
                20461,
                20529
            ],
            [
                20582,
                20605
            ],
            [
                20605,
                20609
            ],
            [
                20616,
                20703
            ],
            [
                20712,
                20713
            ]
        ],
        "row_chars": [
            [
                0,
                140
            ],
            [
                140,
                304
            ],
            [
                304,
                390
            ],
            [
                390,
                753
            ],
            [
                753,
                812
            ],
            [
                812,
                870
            ],
            [
                870,
                911
            ],
            [
                911,
                996
            ],
            [
                996,
                1176
            ],
            [
                1176,
                1321
            ],
            [
                1321,
                1518
            ],
            [
                1518,
                1931
            ],
            [
                1931,
                2059
            ],
            [
                2059,
                2402
            ],
            [
                2402,
                2413
            ],
            [
                2413,
                2432
            ],
            [
                2432,
                2480
            ],
            [
                2480,
                2554
            ],
            [
                2554,
                2617
            ],
            [
                2617,
                2654
            ],
            [
                2654,
                2687
            ],
            [
                2687,
                2741
            ],
            [
                2741,
                2753
            ],
            [
                2753,
                2819
            ],
            [
                2819,
                2894
            ],
            [
                2894,
                2963
            ],
            [
                2963,
                3031
            ],
            [
                3031,
                3077
            ],
            [
                3077,
                3166
            ],
            [
                3166,
                3268
            ],
            [
                3268,
                3338
            ],
            [
                3338,
                3442
            ],
            [
                3442,
                3501
            ],
            [
                3501,
                3887
            ],
            [
                3887,
                3927
            ],
            [
                3927,
                3959
            ],
            [
                3959,
                4005
            ],
            [
                4005,
                4029
            ],
            [
                4029,
                4061
            ],
            [
                4061,
                4108
            ],
            [
                4108,
                4144
            ],
            [
                4144,
                4218
            ],
            [
                4218,
                4426
            ],
            [
                4426,
                4622
            ],
            [
                4622,
                4740
            ],
            [
                4740,
                4855
            ],
            [
                4855,
                4933
            ],
            [
                4933,
                5113
            ],
            [
                5113,
                5379
            ],
            [
                5379,
                5571
            ],
            [
                5571,
                5813
            ],
            [
                5813,
                5849
            ],
            [
                5849,
                5886
            ],
            [
                5886,
                6058
            ],
            [
                6058,
                6084
            ],
            [
                6084,
                6283
            ],
            [
                6283,
                6307
            ],
            [
                6307,
                6334
            ],
            [
                6334,
                6422
            ],
            [
                6422,
                6594
            ],
            [
                6594,
                6626
            ],
            [
                6626,
                6693
            ],
            [
                6693,
                6739
            ],
            [
                6739,
                6757
            ],
            [
                6757,
                6801
            ],
            [
                6801,
                6874
            ],
            [
                6874,
                6961
            ],
            [
                6961,
                7049
            ],
            [
                7049,
                7150
            ],
            [
                7150,
                7195
            ],
            [
                7195,
                7364
            ],
            [
                7364,
                7407
            ],
            [
                7407,
                7492
            ],
            [
                7492,
                7572
            ],
            [
                7572,
                7827
            ],
            [
                7827,
                8012
            ],
            [
                8012,
                8076
            ],
            [
                8076,
                8142
            ],
            [
                8142,
                8206
            ],
            [
                8206,
                8296
            ],
            [
                8296,
                8331
            ],
            [
                8331,
                8361
            ],
            [
                8361,
                8476
            ],
            [
                8476,
                8612
            ],
            [
                8612,
                8725
            ],
            [
                8725,
                8826
            ],
            [
                8826,
                8910
            ],
            [
                8910,
                9029
            ],
            [
                9029,
                9131
            ],
            [
                9131,
                9246
            ],
            [
                9246,
                9280
            ],
            [
                9280,
                9291
            ],
            [
                9291,
                9305
            ],
            [
                9305,
                9314
            ],
            [
                9314,
                9360
            ],
            [
                9360,
                9438
            ],
            [
                9438,
                9477
            ],
            [
                9477,
                9523
            ],
            [
                9523,
                9571
            ],
            [
                9571,
                9593
            ],
            [
                9593,
                9726
            ],
            [
                9726,
                9795
            ],
            [
                9795,
                9831
            ],
            [
                9831,
                9850
            ],
            [
                9850,
                9887
            ],
            [
                9887,
                9966
            ],
            [
                9966,
                10224
            ],
            [
                10224,
                10328
            ],
            [
                10328,
                10427
            ],
            [
                10427,
                10634
            ],
            [
                10634,
                10668
            ],
            [
                10668,
                10721
            ],
            [
                10721,
                10780
            ],
            [
                10780,
                10850
            ],
            [
                10850,
                10948
            ],
            [
                10948,
                11043
            ],
            [
                11043,
                11116
            ],
            [
                11116,
                11159
            ],
            [
                11159,
                11182
            ],
            [
                11182,
                11299
            ],
            [
                11299,
                11469
            ],
            [
                11469,
                11507
            ],
            [
                11507,
                11519
            ],
            [
                11519,
                11656
            ],
            [
                11656,
                11764
            ],
            [
                11764,
                11860
            ],
            [
                11860,
                11960
            ],
            [
                11960,
                12019
            ],
            [
                12019,
                12103
            ],
            [
                12103,
                12171
            ],
            [
                12171,
                12239
            ],
            [
                12239,
                12330
            ],
            [
                12330,
                12361
            ],
            [
                12361,
                12475
            ],
            [
                12475,
                12522
            ],
            [
                12522,
                12570
            ],
            [
                12570,
                12606
            ],
            [
                12606,
                12615
            ],
            [
                12615,
                12656
            ],
            [
                12656,
                12791
            ],
            [
                12791,
                12847
            ],
            [
                12847,
                12864
            ],
            [
                12864,
                12996
            ],
            [
                12996,
                13069
            ],
            [
                13069,
                13085
            ],
            [
                13085,
                13131
            ],
            [
                13131,
                13164
            ],
            [
                13164,
                13196
            ],
            [
                13196,
                13212
            ],
            [
                13212,
                13247
            ],
            [
                13247,
                13282
            ],
            [
                13282,
                13342
            ],
            [
                13342,
                13362
            ],
            [
                13362,
                13417
            ],
            [
                13417,
                13501
            ],
            [
                13501,
                13575
            ],
            [
                13575,
                13632
            ],
            [
                13632,
                13734
            ],
            [
                13734,
                13762
            ],
            [
                13762,
                13890
            ],
            [
                13890,
                14026
            ],
            [
                14026,
                14147
            ],
            [
                14147,
                14241
            ],
            [
                14241,
                14278
            ],
            [
                14278,
                14332
            ],
            [
                14332,
                14471
            ],
            [
                14471,
                14554
            ],
            [
                14554,
                14620
            ],
            [
                14620,
                14660
            ],
            [
                14660,
                15013
            ],
            [
                15013,
                15180
            ],
            [
                15180,
                15319
            ],
            [
                15319,
                15476
            ],
            [
                15476,
                15601
            ],
            [
                15601,
                15686
            ],
            [
                15686,
                15845
            ],
            [
                15845,
                15902
            ],
            [
                15902,
                15994
            ],
            [
                15994,
                16073
            ],
            [
                16073,
                16198
            ],
            [
                16198,
                16320
            ],
            [
                16320,
                16341
            ],
            [
                16341,
                16367
            ],
            [
                16367,
                16472
            ],
            [
                16472,
                16560
            ],
            [
                16560,
                16607
            ],
            [
                16607,
                16847
            ],
            [
                16847,
                16947
            ],
            [
                16947,
                16962
            ],
            [
                16962,
                17003
            ],
            [
                17003,
                17038
            ],
            [
                17038,
                17068
            ],
            [
                17068,
                17092
            ],
            [
                17092,
                17312
            ],
            [
                17312,
                17529
            ],
            [
                17529,
                17601
            ],
            [
                17601,
                17708
            ],
            [
                17708,
                17738
            ],
            [
                17738,
                17929
            ],
            [
                17929,
                18085
            ],
            [
                18085,
                18129
            ],
            [
                18129,
                18155
            ],
            [
                18155,
                18217
            ],
            [
                18217,
                18334
            ],
            [
                18334,
                18443
            ],
            [
                18443,
                18486
            ],
            [
                18486,
                18536
            ],
            [
                18536,
                18582
            ],
            [
                18582,
                18612
            ],
            [
                18612,
                18631
            ],
            [
                18631,
                18682
            ],
            [
                18682,
                18777
            ],
            [
                18777,
                18855
            ],
            [
                18855,
                18983
            ],
            [
                18983,
                19083
            ],
            [
                19083,
                19276
            ],
            [
                19276,
                19339
            ],
            [
                19339,
                19354
            ],
            [
                19354,
                19373
            ],
            [
                19373,
                19392
            ],
            [
                19392,
                19464
            ],
            [
                19464,
                19503
            ],
            [
                19503,
                19604
            ],
            [
                19604,
                19636
            ],
            [
                19636,
                19676
            ],
            [
                19676,
                19707
            ],
            [
                19707,
                19762
            ],
            [
                19762,
                19847
            ],
            [
                19847,
                19855
            ],
            [
                19855,
                19863
            ],
            [
                19863,
                19909
            ],
            [
                19909,
                19948
            ],
            [
                19948,
                20005
            ],
            [
                20005,
                20181
            ],
            [
                20181,
                20225
            ],
            [
                20225,
                20281
            ],
            [
                20281,
                20297
            ],
            [
                20297,
                20358
            ],
            [
                20358,
                20461
            ],
            [
                20461,
                20529
            ],
            [
                20529,
                20582
            ],
            [
                20582,
                20605
            ],
            [
                20605,
                20713
            ]
        ]
    },
    "abridged": {
        "text": "On the following morning Mr. Palliser yawned no more. There is some life in starting a long journey, and the life is the stronger and fuller if the things and people to be carried are numerous and troublesome. Lady Glencora was a little troublesome, and would not come down to breakfast in time. When rebuked, she asserted that the next train would do just as well; and when Mr. Palliser proved to her, with much trouble, that the next train could not enable them to reach Paris on that day, she declared that it would be much more comfortable to take a week in going than to hurry. There was nothing she wanted so much as to see Folkestone.\n\"If that is the case, why did not you tell me so before?\" said Mr. Palliser, in his gravest voice. \"Richard and the carriage went down yesterday, and are already on board the packet.\"\n\"If Richard and the carriage are already on board the packet,\" said Lady Glencora, \"of course we must follow them. Alice, haven't you observed that, in travelling, you are always driven on by some Richard or some carriage, till you feel that you are a slave?\"\nAll this was trying to Mr. Palliser; but I think that he enjoyed it, nevertheless, and was happy when he did get his freight off from Pimlico Station in the proper train.\nOf course Lady Glencora and Alice were very ill crossing the Channel; of course the two maids were worse than their mistresses; of course the men-servants drank brandy-and-water with the steward downstairs; and of course Lady Glencora declared that she would not go beyond Boulogne that day; but, nevertheless, they did get on to Paris. Had Mr. Palliser become Chancellor of the Exchequer, he could hardly have worked harder. It was he who found out which carriage had been reserved for them, and who put the ladies' dressing-cases and cloaks on to the seats, who laid out the novels, and made preparations as though this stage of their journey was to take them a week, instead of five hours and a half.\n\"Oh, dear! how I have slept!\" said Lady Glencora, as they approached Paris.\n\"I think you've been tolerably comfortable,\" said Mr. Palliser joyfully.\n\"Since we got out of that horrid boat I have done pretty well. Why do they make the boats so nasty? I'm sure they do it on purpose.\"\n\"It is the sea that makes them uncomfortable,\" said Mr. Palliser.\n\"Never mind; we shan't have any more of it for twelve months, at any rate. We can get to the Kurds, Alice, without getting into a boat again. That is the great comfort of the Continent. One can go everywhere without being seasick.\"\nMr. Palliser said nothing, but he sighed as he thought of being absent for a whole year. He had said that such was his intention. But how was he to live for twelve months out of the House of Commons? What was he to do with himself, with his intellect and his energy, during all these coming dreary days? And he might have been Chancellor of the Exchequer! He might at this very moment have been upon his feet, making a financial statement of six hours' duration, to the delight of one-half of the House, and the bewilderment of the other half, instead of dragging cloaks across that dingy, dirty waiting-room at the Paris Station.\nAlice thought of the last time in which she had been in that waiting-room, when George and Kate had been with her. But she was now travelling with great people, who never spoke of their wealth, but who showed their consciousness of it at every turn of their lives.\n\"After all,\" she said to herself, \"I wonder whether the burden is not greater than the pleasure.\"\nThey stayed in Paris for a week, and during that time Alice got to know Mr. Palliser well. At Matching she had seen little of him. Now she began to understand his character, and learned how to talk to him. She allowed him to tell her things in which Lady Glencora resolutely took no interest. She delighted him by writing down in a little pocket-book the number of eggs that were consumed in Paris every day, whereas Glencora protested that the information was worthless unless her husband could tell her how many of the eggs were good, and how many bad. And Alice was glad to find that a hundred and fifty thousand female operatives were employed in Paris, while Lady Glencora said it was a great shame, and that they ought to have husbands.\n\"I do so wish you had married him!\" Glencora said to Alice that evening. \"You would always have had a pocket-book ready to write down the figures, and you would have pretended to care about the eggs, and the rest of it. I can't do it. If I see a hungry woman, I can give her my money; or if she is a sick woman, I can nurse her; but I cannot take up poverty and crime in the lump. I never believe it all. My mind isn't big enough.\"\nThey went into no society at Paris, and at the end of a week were glad to leave.\n\"I don't know that Baden will be any better,\" Lady Glencora said; \"but we can leave again after a bit - and get nearer to the Kurds.\"\nMr. Palliser demurred. \"I think we had better stay a month at Baden. I like to have a plan.\"\n\"And so do I,\" said his wife, \"if only for the sake of not keeping it.\"\n\"There's nothing I hate so much as not carrying out my intentions,\" said Mr. Palliser.\nUpon this, Lady Glencora shrugged her shoulders, and made a mock grimace to her cousin. All this her husband bore meekly for a while; he behaved very well. But, then, he had his own way in everything. Lady Glencora did not behave very well - contradicting her husband, and not considering the sacrifice he was making on her behalf. But, then, she had her own way in nothing.\nOn one point she did conquer her husband. He intended to go from Paris back to Cologne, and down the Rhine to Baden. Lady Glencora declared that she hated the Rhine, and that she would be wretched if she were taken that way. Mr. Palliser referred the matter to Alice; and she, who had last been upon the Rhine with Kate and George Vavasor, voted for going to Baden by way of Strasbourg.\n\"We will go by Strasbourg, then,\" said Mr. Palliser gallantly.\n\"Not that I want to see that horrid church again,\" said Glencora.\n\"Everything is horrid to you, I think,\" said her husband. \"You are determined not to be contented, so that it matters very little which way we go.\"\n\"That's the truth,\" said his wife. \"It does matter very little.\"\nThey got to Baden, and found half a hotel prepared for their reception. Here the carriage was brought into use for the first time, and Glencora talked of sending home for Dandy and Flirt. Mr. Palliser calmly assured his wife that the horses would not bear the journey.\n\"They would be so out of condition,\" he said, \"as not to be worth anything for two or three months.\"\n\"I only meant to ask for them if they could come in a balloon,\" said Lady Glencora.\nThis angered Mr. Palliser, who had really thought of pacifying his wife by sending for the horses.\n\"Alice,\" she asked, one morning, \"how many eggs are eaten in Baden every day before ten o'clock?\"\nMr. Palliser, who at the moment was eating one, threw down his spoon, and pushed his plate from him.\n\"What's the matter, Plantagenet?\" she asked.\n\"The matter!\" he said. \"But never mind; I am a fool to care about it.\"\n\"I declare I didn't know that I had done anything wrong,\" said Lady Glencora. \"Alice, do you understand what it is?\"\nAlice said that she understood very well.\n\"Of course she understands,\" said Mr. Palliser. \"How can she help it? And, indeed, Miss Vavasor, I am more unhappy than I can express, to think that your comfort should be disturbed in this way.\"\n\"I think Alice is doing very well,\" said Lady Glencora. \"What is there to hurt her comfort? Nobody scolds her. Nobody tells her that she is a fool. She never jokes, or does anything wicked, and, of course, she isn't punished.\"\nMr. Palliser, as he wandered that day alone through the gambling-rooms at the great Assembly House, thought that, after all, it might have been better for him to have remained in London, to have become Chancellor of the Exchequer, and to have run all risks.\n\"I wonder whether it would be any harm if I were to put a few pieces of money on the table, just once?\" Lady Glencora said to her cousin that evening, in one of those gambling salons. There had been some music in one side of the building, and afterwards the ladies had strayed away into the other apartments.\n\"The greatest harm in the world!\" said Alice; \"and what on earth could you gain by it?\"\n\"Something to live for - some excitement. Is it not a shame that I see around me so many people getting amusement, and that I can get none? I'd go and sit out there, and drink beer and hear the music, only Plantagenet wouldn't let me. I think I'll throw one piece on to the table to see what becomes of it.\"\n\"I shall leave you if you do,\" said Alice.\n\"You are such a prude! You look after me quite as carefully as Mr. Bott and Mrs. Marsham ever did; but as I chose you myself, I can't very well complain, and I can't very well get rid of you.\"\n\"Do you want to get rid of me, Cora?\"\n\"Sometimes. Do you know, there are moments when I almost make up my mind to go headlong to the devil - when I think it is the best thing to be done. It's a hard thing for a woman to do, because she gets so despised. A man can take to drinking, and gambling and all the rest of it, and nobody despises him a bit. All he needs is money, and he goes away and has his fling. Now I have plenty of money, and I never got my fling yet. I do feel so tempted to rebel, and go ahead, and care for nothing.\"\n\"Throwing one piece on to the table wouldn't satisfy that longing.\"\n\"You think I should be like the wild beast that has tasted blood, and can't be controlled? Look at all these people here. There are husbands gambling, and their wives don't know it; and wives gambling, and their husbands don't know it. I wonder whether Plantagenet ever has a fling? What a joke it would be to come and catch him!\"\n\"I don't think you need be afraid of that.\"\n\"Afraid! I should like him all the better for it. If he came to me some morning, and told me that he had lost a hundred thousand pounds, I should be so much more at my ease with him.\"\n\"No chance of that, I'm quite sure.\"\n\"None the least. He'd make a calculation that the chances were nine to seven against him, and then the speculation would seem madness.\"\n\"I don't suppose he'd wish to try, even if he were sure of winning.\"\n\"Of course not. Look - there's an opening there. I'll just put on one napoleon.\"\n\"You shall not. If you do, I'll leave you at once. Look at the women who are playing. Those men are bad enough, but the women look like fiends.\"\n\"You're not going to frighten me in that hobgoblin way, you know. I don't see anything the matter with any of the people.\"\n\"What do you think of that young woman who has just got a handful of money from the man next to her?\"\n\"I think she is very happy. I never get money given to me by handfuls, and the man to whom I belong gives me no encouragement when I want to amuse myself.\"\nThey were now standing near one end of the table, and suddenly there came to be an opening through the crowd. Lady Glencora at once stepped up and placed a piece of gold on one of the marked compartments.\nShe retreated again with flushed face, and took hold of Alice's arm.\n\"There,\" she said, \"I have done it.\"\nAlice, in her dismay, did not know what to do. She could not scold her friend, as many eyes were turned upon them, nor could she, of course, leave her, as she had threatened.\nLady Glencora laughed with her peculiar little low laughter. \"I was determined you shouldn't frighten me out of it,\" she said.\nOne of the croupiers at the table had in the meantime called the game; and another had gently pushed three or four more pieces of gold up to that which Lady Glencora had flung down, and had then cunningly caught her eye, and had pushed them further towards her. She had supposed herself to be unknown in the salon, but no doubt all the croupiers and half the company knew well enough who she was. Someone motioned to her to come and take up the money which she had won. She hesitated, and then the croupier asked her, in a low, indifferent voice, whether she desired that her money should remain. She nodded and he drew the money back to the spot on which she had placed the first napoleon.\nAgain the cards were turned up softly, again the game was called, and again she won. The money was dealt out to her - between twenty and thirty napoleons. Her face had flushed before, but now it became very red. She caught hold of Alice, who was literally trembling beside her, and tried to laugh again. But there was that in her eye which told Alice that she was really frightened.\nSomeone placed a chair for her at the table, and in her confusion, not knowing what to do, she seated herself.\n\"Come away,\" said Alice. \"You must come away!\"\n\"I must get rid of that money,\" said Glencora, trying to whisper, \"and then I will come away.\" The croupier again asked her if the money was to remain, and she again nodded. Everybody at the table was now looking at her. The women especially were staring at her with hard, shameless eyes; their white gloves had been removed to show dirty hands. Alice saw it all, and trembled.\nAgain she won.\n\"Leave it,\" said Alice, \"and come away.\"\n\"I can't leave it,\" said Glencora. \"If I do, there'll be a fuss. I'll go the next time.\" What she said was, of course, in English, but it was easy to see that she was troubled, and, of course, those around her looked at her more because of her trouble. Again that little question and answer went on between her and the croupier, and the money was piled up on the compartment - a heap of gold.\nAlice had now both her hands on the back of the chair, needing support. If the devil should persist, and increase that stock of gold again, she must go and seek for Mr. Palliser. She knew not what else to do.\n\"Come away at once, and leave it,\" she said, \"or I shall go.\" At that moment the croupier raked it all up, and carried it all away; but Alice did not see this. A hand had been placed on her shoulder, and as she turned round her face her eyes met those of Mr. Palliser.\n\"It is all gone,\" said Glencora, laughing. And now she, turning round, also saw her husband.\n\"I am so glad that you are come,\" said Alice.\n\"Why did you bring her here?\" said Mr. Palliser. There was anger in his tone, and in his eye. He took his wife's arm, and walked away quickly, while Alice followed them alone. He went down the front steps of the building, towards the hotel. What he said to his wife, Alice did not hear; but her heart was swelling. Though she might have to go back alone to England, she would tell him that he was ill-treating her. She followed him on, up into their drawing-room, and there he stood with the door open, while Lady Glencora threw herself upon a sofa, and burst out into affected laughter.\n\"Here's a piece of work,\" she said, \"about a little accident.\"\n\"An accident!\" said Mr. Palliser.\n\"Yes, an accident. You don't suppose that I sat down there meaning to win all that money?\" Whereupon he looked at her with scorn.\n\"Mr. Palliser,\" said Alice, \"you have treated me this evening in a manner I did not expect from you. It is clear that you blame me.\"\n\"I have not said a word, Miss Vavasor.\"\n\"No; you know well how to show your anger without speaking. As I do not choose to undergo your displeasure, I will return to England by myself.\"\n\"Alice! Alice!\" said Glencora, jumping up, \"that is nonsense! What is all this trumpery thing about? Leave me, because he chooses to be angry about nothing?\"\n\"Is it nothing that I find my wife seated and playing at a common gambling-table, surrounded by all that is wretched and vile?\"\n\"You wrong me, Plantagenet,\" said Glencora. \"There was only one heap, and that did not remain long. Did it, Alice?\"\n\"It is impossible to make you ashamed of anything,\" he said.\n\"I certainly don't like being ashamed,\" she answered; \"and don't feel any necessity on this occasion.\"\n\"If you don't object, Mr. Palliser,\" said Alice, \"I will go to bed. Good night, Glencora.\" Then she took her candle, and marched off to her own room, with all the dignity of which she was capable.",
        "paragraph_chars": [
            [
                0,
                642
            ],
            [
                642,
                826
            ],
            [
                826,
                1086
            ],
            [
                1086,
                1257
            ],
            [
                1257,
                1961
            ],
            [
                1961,
                2037
            ],
            [
                2037,
                2110
            ],
            [
                2110,
                2243
            ],
            [
                2243,
                2309
            ],
            [
                2309,
                2541
            ],
            [
                2541,
                3172
            ],
            [
                3172,
                3437
            ],
            [
                3437,
                3535
            ],
            [
                3535,
                4278
            ],
            [
                4278,
                4710
            ],
            [
                4710,
                4791
            ],
            [
                4791,
                4925
            ],
            [
                4925,
                5018
            ],
            [
                5018,
                5090
            ],
            [
                5090,
                5177
            ],
            [
                5177,
                5552
            ],
            [
                5552,
                5939
            ],
            [
                5939,
                6002
            ],
            [
                6002,
                6068
            ],
            [
                6068,
                6216
            ],
            [
                6216,
                6281
            ],
            [
                6281,
                6550
            ],
            [
                6550,
                6651
            ],
            [
                6651,
                6735
            ],
            [
                6735,
                6834
            ],
            [
                6834,
                6932
            ],
            [
                6932,
                7033
            ],
            [
                7033,
                7078
            ],
            [
                7078,
                7149
            ],
            [
                7149,
                7266
            ],
            [
                7266,
                7308
            ],
            [
                7308,
                7504
            ],
            [
                7504,
                7731
            ],
            [
                7731,
                7989
            ],
            [
                7989,
                8298
            ],
            [
                8298,
                8386
            ],
            [
                8386,
                8694
            ],
            [
                8694,
                8737
            ],
            [
                8737,
                8930
            ],
            [
                8930,
                8968
            ],
            [
                8968,
                9465
            ],
            [
                9465,
                9533
            ],
            [
                9533,
                9864
            ],
            [
                9864,
                9908
            ],
            [
                9908,
                10092
            ],
            [
                10092,
                10129
            ],
            [
                10129,
                10265
            ],
            [
                10265,
                10334
            ],
            [
                10334,
                10415
            ],
            [
                10415,
                10560
            ],
            [
                10560,
                10683
            ],
            [
                10683,
                10785
            ],
            [
                10785,
                10941
            ],
            [
                10941,
                11146
            ],
            [
                11146,
                11215
            ],
            [
                11215,
                11252
            ],
            [
                11252,
                11427
            ],
            [
                11427,
                11554
            ],
            [
                11554,
                12245
            ],
            [
                12245,
                12628
            ],
            [
                12628,
                12739
            ],
            [
                12739,
                12786
            ],
            [
                12786,
                13164
            ],
            [
                13164,
                13179
            ],
            [
                13179,
                13220
            ],
            [
                13220,
                13613
            ],
            [
                13613,
                13822
            ],
            [
                13822,
                14091
            ],
            [
                14091,
                14184
            ],
            [
                14184,
                14230
            ],
            [
                14230,
                14818
            ],
            [
                14818,
                14881
            ],
            [
                14881,
                14915
            ],
            [
                14915,
                15045
            ],
            [
                15045,
                15178
            ],
            [
                15178,
                15218
            ],
            [
                15218,
                15363
            ],
            [
                15363,
                15521
            ],
            [
                15521,
                15649
            ],
            [
                15649,
                15765
            ],
            [
                15765,
                15826
            ],
            [
                15826,
                15929
            ],
            [
                15929,
                16125
            ]
        ],
        "segment_chars": [
            [
                0,
                54
            ],
            [
                54,
                210
            ],
            [
                210,
                296
            ],
            [
                296,
                583
            ],
            [
                583,
                642
            ],
            [
                642,
                700
            ],
            [
                700,
                741
            ],
            [
                741,
                826
            ],
            [
                826,
                941
            ],
            [
                941,
                1086
            ],
            [
                1086,
                1257
            ],
            [
                1257,
                1594
            ],
            [
                1594,
                1683
            ],
            [
                1683,
                1961
            ],
            [
                1961,
                1972
            ],
            [
                1972,
                1991
            ],
            [
                1991,
                2037
            ],
            [
                2037,
                2110
            ],
            [
                2110,
                2173
            ],
            [
                2173,
                2210
            ],
            [
                2210,
                2243
            ],
            [
                2243,
                2309
            ],
            [
                2309,
                2384
            ],
            [
                2384,
                2451
            ],
            [
                2451,
                2495
            ],
            [
                2495,
                2541
            ],
            [
                2541,
                2630
            ],
            [
                2630,
                2671
            ],
            [
                2671,
                2741
            ],
            [
                2741,
                2845
            ],
            [
                2845,
                2897
            ],
            [
                2897,
                3172
            ],
            [
                3172,
                3287
            ],
            [
                3287,
                3437
            ],
            [
                3437,
                3535
            ],
            [
                3535,
                3626
            ],
            [
                3626,
                3666
            ],
            [
                3666,
                3741
            ],
            [
                3741,
                3828
            ],
            [
                3828,
                4090
            ],
            [
                4090,
                4278
            ],
            [
                4278,
                4314
            ],
            [
                4314,
                4351
            ],
            [
                4351,
                4498
            ],
            [
                4498,
                4513
            ],
            [
                4513,
                4659
            ],
            [
                4659,
                4683
            ],
            [
                4683,
                4710
            ],
            [
                4710,
                4791
            ],
            [
                4791,
                4925
            ],
            [
                4925,
                4948
            ],
            [
                4948,
                4994
            ],
            [
                4994,
                5018
            ],
            [
                5018,
                5090
            ],
            [
                5090,
                5177
            ],
            [
                5177,
                5265
            ],
            [
                5265,
                5333
            ],
            [
                5333,
                5378
            ],
            [
                5378,
                5509
            ],
            [
                5509,
                5552
            ],
            [
                5552,
                5594
            ],
            [
                5594,
                5669
            ],
            [
                5669,
                5777
            ],
            [
                5777,
                5939
            ],
            [
                5939,
                6002
            ],
            [
                6002,
                6068
            ],
            [
                6068,
                6126
            ],
            [
                6126,
                6216
            ],
            [
                6216,
                6251
            ],
            [
                6251,
                6281
            ],
            [
                6281,
                6353
            ],
            [
                6353,
                6469
            ],
            [
                6469,
                6550
            ],
            [
                6550,
                6651
            ],
            [
                6651,
                6735
            ],
            [
                6735,
                6834
            ],
            [
                6834,
                6932
            ],
            [
                6932,
                7033
            ],
            [
                7033,
                7067
            ],
            [
                7067,
                7078
            ],
            [
                7078,
                7092
            ],
            [
                7092,
                7101
            ],
            [
                7101,
                7149
            ],
            [
                7149,
                7227
            ],
            [
                7227,
                7266
            ],
            [
                7266,
                7308
            ],
            [
                7308,
                7356
            ],
            [
                7356,
                7378
            ],
            [
                7378,
                7504
            ],
            [
                7504,
                7560
            ],
            [
                7560,
                7596
            ],
            [
                7596,
                7615
            ],
            [
                7615,
                7652
            ],
            [
                7652,
                7731
            ],
            [
                7731,
                7989
            ],
            [
                7989,
                8093
            ],
            [
                8093,
                8173
            ],
            [
                8173,
                8298
            ],
            [
                8298,
                8332
            ],
            [
                8332,
                8386
            ],
            [
                8386,
                8428
            ],
            [
                8428,
                8526
            ],
            [
                8526,
                8621
            ],
            [
                8621,
                8694
            ],
            [
                8694,
                8737
            ],
            [
                8737,
                8760
            ],
            [
                8760,
                8930
            ],
            [
                8930,
                8968
            ],
            [
                8968,
                8980
            ],
            [
                8980,
                9117
            ],
            [
                9117,
                9184
            ],
            [
                9184,
                9280
            ],
            [
                9280,
                9339
            ],
            [
                9339,
                9397
            ],
            [
                9397,
                9465
            ],
            [
                9465,
                9533
            ],
            [
                9533,
                9624
            ],
            [
                9624,
                9655
            ],
            [
                9655,
                9769
            ],
            [
                9769,
                9816
            ],
            [
                9816,
                9864
            ],
            [
                9864,
                9908
            ],
            [
                9908,
                9917
            ],
            [
                9917,
                9958
            ],
            [
                9958,
                10092
            ],
            [
                10092,
                10129
            ],
            [
                10129,
                10146
            ],
            [
                10146,
                10265
            ],
            [
                10265,
                10334
            ],
            [
                10334,
                10350
            ],
            [
                10350,
                10383
            ],
            [
                10383,
                10415
            ],
            [
                10415,
                10431
            ],
            [
                10431,
                10466
            ],
            [
                10466,
                10501
            ],
            [
                10501,
                10560
            ],
            [
                10560,
                10626
            ],
            [
                10626,
                10683
            ],
            [
                10683,
                10785
            ],
            [
                10785,
                10813
            ],
            [
                10813,
                10941
            ],
            [
                10941,
                11051
            ],
            [
                11051,
                11146
            ],
            [
                11146,
                11215
            ],
            [
                11215,
                11252
            ],
            [
                11252,
                11299
            ],
            [
                11299,
                11427
            ],
            [
                11427,
                11488
            ],
            [
                11488,
                11554
            ],
            [
                11554,
                11816
            ],
            [
                11816,
                11951
            ],
            [
                11951,
                12024
            ],
            [
                12024,
                12151
            ],
            [
                12151,
                12245
            ],
            [
                12245,
                12330
            ],
            [
                12330,
                12400
            ],
            [
                12400,
                12457
            ],
            [
                12457,
                12549
            ],
            [
                12549,
                12628
            ],
            [
                12628,
                12739
            ],
            [
                12739,
                12764
            ],
            [
                12764,
                12786
            ],
            [
                12786,
                12881
            ],
            [
                12881,
                12960
            ],
            [
                12960,
                13007
            ],
            [
                13007,
                13132
            ],
            [
                13132,
                13164
            ],
            [
                13164,
                13179
            ],
            [
                13179,
                13220
            ],
            [
                13220,
                13255
            ],
            [
                13255,
                13285
            ],
            [
                13285,
                13309
            ],
            [
                13309,
                13473
            ],
            [
                13473,
                13613
            ],
            [
                13613,
                13685
            ],
            [
                13685,
                13792
            ],
            [
                13792,
                13822
            ],
            [
                13822,
                13884
            ],
            [
                13884,
                13982
            ],
            [
                13982,
                14091
            ],
            [
                14091,
                14134
            ],
            [
                14134,
                14184
            ],
            [
                14184,
                14230
            ],
            [
                14230,
                14260
            ],
            [
                14260,
                14279
            ],
            [
                14279,
                14324
            ],
            [
                14324,
                14406
            ],
            [
                14406,
                14471
            ],
            [
                14471,
                14545
            ],
            [
                14545,
                14645
            ],
            [
                14645,
                14818
            ],
            [
                14818,
                14881
            ],
            [
                14881,
                14896
            ],
            [
                14896,
                14915
            ],
            [
                14915,
                14934
            ],
            [
                14934,
                15006
            ],
            [
                15006,
                15045
            ],
            [
                15045,
                15146
            ],
            [
                15146,
                15178
            ],
            [
                15178,
                15218
            ],
            [
                15218,
                15278
            ],
            [
                15278,
                15363
            ],
            [
                15363,
                15371
            ],
            [
                15371,
                15379
            ],
            [
                15379,
                15425
            ],
            [
                15425,
                15464
            ],
            [
                15464,
                15521
            ],
            [
                15521,
                15649
            ],
            [
                15649,
                15693
            ],
            [
                15693,
                15749
            ],
            [
                15749,
                15765
            ],
            [
                15765,
                15826
            ],
            [
                15826,
                15929
            ],
            [
                15929,
                15997
            ],
            [
                15997,
                16020
            ],
            [
                16020,
                16125
            ]
        ],
        "overlap_chars": [
            [
                0,
                24
            ],
            [
                25,
                37
            ],
            [
                38,
                54
            ],
            [
                54,
                84
            ],
            [
                85,
                133
            ],
            [
                134,
                210
            ],
            [
                210,
                296
            ],
            [
                296,
                308
            ],
            [
                308,
                581
            ],
            [
                581,
                583
            ],
            [
                583,
                642
            ],
            [
                642,
                700
            ],
            [
                700,
                741
            ],
            [
                741,
                826
            ],
            [
                826,
                939
            ],
            [
                939,
                941
            ],
            [
                941,
                1086
            ],
            [
                1086,
                1172
            ],
            [
                1173,
                1187
            ],
            [
                1188,
                1219
            ],
            [
                1220,
                1257
            ],
            [
                1257,
                1402
            ],
            [
                1402,
                1403
            ],
            [
                1412,
                1451
            ],
            [
                1462,
                1519
            ],
            [
                1523,
                1548
            ],
            [
                1549,
                1594
            ],
            [
                1594,
                1646
            ],
            [
                1647,
                1681
            ],
            [
                1681,
                1683
            ],
            [
                1683,
                1730
            ],
            [
                1740,
                1761
            ],
            [
                1762,
                1816
            ],
            [
                1817,
                1841
            ],
            [
                1842,
                1961
            ],
            [
                1961,
                1972
            ],
            [
                1972,
                1991
            ],
            [
                1991,
                2018
            ],
            [
                2030,
                2037
            ],
            [
                2037,
                2099
            ],
            [
                2100,
                2110
            ],
            [
                2110,
                2173
            ],
            [
                2173,
                2210
            ],
            [
                2210,
                2243
            ],
            [
                2243,
                2309
            ],
            [
                2309,
                2384
            ],
            [
                2384,
                2438
            ],
            [
                2444,
                2451
            ],
            [
                2451,
                2455
            ],
            [
                2456,
                2495
            ],
            [
                2495,
                2541
            ],
            [
                2541,
                2630
            ],
            [
                2630,
                2669
            ],
            [
                2669,
                2671
            ],
            [
                2671,
                2741
            ],
            [
                2741,
                2845
            ],
            [
                2845,
                2848
            ],
            [
                2849,
                2897
            ],
            [
                2897,
                2905
            ],
            [
                2906,
                2925
            ],
            [
                2926,
                2944
            ],
            [
                2949,
                3048
            ],
            [
                3049,
                3052
            ],
            [
                3053,
                3078
            ],
            [
                3083,
                3130
            ],
            [
                3131,
                3170
            ],
            [
                3170,
                3172
            ],
            [
                3172,
                3232
            ],
            [
                3241,
                3246
            ],
            [
                3247,
                3285
            ],
            [
                3285,
                3287
            ],
            [
                3287,
                3290
            ],
            [
                3295,
                3332
            ],
            [
                3333,
                3364
            ],
            [
                3364,
                3436
            ],
            [
                3437,
                3449
            ],
            [
                3454,
                3469
            ],
            [
                3469,
                3473
            ],
            [
                3481,
                3535
            ],
            [
                3535,
                3594
            ],
            [
                3607,
                3619
            ],
            [
                3624,
                3626
            ],
            [
                3626,
                3645
            ],
            [
                3646,
                3650
            ],
            [
                3651,
                3664
            ],
            [
                3664,
                3666
            ],
            [
                3666,
                3739
            ],
            [
                3741,
                3768
            ],
            [
                3769,
                3809
            ],
            [
                3815,
                3828
            ],
            [
                3828,
                3995
            ],
            [
                4006,
                4090
            ],
            [
                4090,
                4259
            ],
            [
                4260,
                4277
            ],
            [
                4278,
                4314
            ],
            [
                4314,
                4351
            ],
            [
                4351,
                4485
            ],
            [
                4486,
                4498
            ],
            [
                4498,
                4513
            ],
            [
                4513,
                4521
            ],
            [
                4522,
                4523
            ],
            [
                4524,
                4572
            ],
            [
                4576,
                4606
            ],
            [
                4607,
                4659
            ],
            [
                4659,
                4683
            ],
            [
                4683,
                4710
            ],
            [
                4710,
                4775
            ],
            [
                4776,
                4789
            ],
            [
                4789,
                4791
            ],
            [
                4791,
                4861
            ],
            [
                4862,
                4874
            ],
            [
                4875,
                4892
            ],
            [
                4895,
                4898
            ],
            [
                4903,
                4925
            ],
            [
                4927,
                4948
            ],
            [
                4948,
                4970
            ],
            [
                4971,
                4992
            ],
            [
                4994,
                5015
            ],
            [
                5018,
                5047
            ],
            [
                5048,
                5090
            ],
            [
                5090,
                5177
            ],
            [
                5177,
                5265
            ],
            [
                5265,
                5290
            ],
            [
                5291,
                5297
            ],
            [
                5298,
                5309
            ],
            [
                5311,
                5333
            ],
            [
                5333,
                5378
            ],
            [
                5378,
                5416
            ],
            [
                5429,
                5465
            ],
            [
                5466,
                5509
            ],
            [
                5509,
                5552
            ],
            [
                5552,
                5594
            ],
            [
                5594,
                5596
            ],
            [
                5606,
                5643
            ],
            [
                5644,
                5669
            ],
            [
                5669,
                5717
            ],
            [
                5718,
                5748
            ],
            [
                5749,
                5760
            ],
            [
                5767,
                5777
            ],
            [
                5779,
                5866
            ],
            [
                5867,
                5939
            ],
            [
                5939,
                5990
            ],
            [
                5991,
                6002
            ],
            [
                6002,
                6068
            ],
            [
                6068,
                6082
            ],
            [
                6083,
                6126
            ],
            [
                6126,
                6216
            ],
            [
                6216,
                6251
            ],
            [
                6251,
                6281
            ],
            [
                6281,
                6289
            ],
            [
                6290,
                6299
            ],
            [
                6300,
                6314
            ],
            [
                6317,
                6353
            ],
            [
                6353,
                6415
            ],
            [
                6425,
                6469
            ],
            [
                6469,
                6481
            ],
            [
                6482,
                6549
            ],
            [
                6550,
                6651
            ],
            [
                6651,
                6735
            ],
            [
                6735,
                6776
            ],
            [
                6777,
                6834
            ],
            [
                6834,
                6906
            ],
            [
                6911,
                6932
            ],
            [
                6932,
                6967
            ],
            [
                6968,
                7033
            ],
            [
                7033,
                7067
            ],
            [
                7067,
                7078
            ],
            [
                7078,
                7092
            ],
            [
                7092,
                7101
            ],
            [
                7101,
                7137
            ],
            [
                7144,
                7149
            ],
            [
                7149,
                7227
            ],
            [
                7227,
                7266
            ],
            [
                7266,
                7285
            ],
            [
                7297,
                7308
            ],
            [
                7308,
                7356
            ],
            [
                7356,
                7378
            ],
            [
                7378,
                7441
            ],
            [
                7441,
                7504
            ],
            [
                7504,
                7505
            ],
            [
                7505,
                7560
            ],
            [
                7560,
                7596
            ],
            [
                7596,
                7615
            ],
            [
                7615,
                7652
            ],
            [
                7652,
                7731
            ],
            [
                7731,
                7989
            ],
            [
                7989,
                8093
            ],
            [
                8093,
                8125
            ],
            [
                8131,
                8138
            ],
            [
                8138,
                8173
            ],
            [
                8173,
                8198
            ],
            [
                8199,
                8231
            ],
            [
                8243,
                8246
            ],
            [
                8247,
                8253
            ],
            [
                8254,
                8298
            ],
            [
                8298,
                8332
            ],
            [
                8332,
                8383
            ],
            [
                8386,
                8387
            ],
            [
                8387,
                8408
            ],
            [
                8411,
                8428
            ],
            [
                8428,
                8526
            ],
            [
                8526,
                8621
            ],
            [
                8621,
                8694
            ],
            [
                8694,
                8737
            ],
            [
                8737,
                8760
            ],
            [
                8760,
                8930
            ],
            [
                8930,
                8968
            ],
            [
                8968,
                8980
            ],
            [
                8980,
                9068
            ],
            [
                9071,
                9117
            ],
            [
                9117,
                9165
            ],
            [
                9166,
                9170
            ],
            [
                9171,
                9173
            ],
            [
                9182,
                9184
            ],
            [
                9184,
                9280
            ],
            [
                9280,
                9286
            ],
            [
                9293,
                9339
            ],
            [
                9339,
                9366
            ],
            [
                9367,
                9397
            ],
            [
                9397,
                9465
            ],
            [
                9465,
                9533
            ],
            [
                9533,
                9622
            ],
            [
                9624,
                9655
            ],
            [
                9655,
                9769
            ],
            [
                9769,
                9816
            ],
            [
                9816,
                9864
            ],
            [
                9864,
                9897
            ],
            [
                9905,
                9908
            ],
            [
                9908,
                9917
            ],
            [
                9917,
                9958
            ],
            [
                9958,
                9974
            ],
            [
                9975,
                10092
            ],
            [
                10092,
                10093
            ],
            [
                10093,
                10102
            ],
            [
                10106,
                10110
            ],
            [
                10110,
                10129
            ],
            [
                10129,
                10146
            ],
            [
                10146,
                10254
            ],
            [
                10255,
                10265
            ],
            [
                10265,
                10304
            ],
            [
                10308,
                10334
            ],
            [
                10334,
                10350
            ],
            [
                10350,
                10354
            ],
            [
                10357,
                10383
            ],
            [
                10383,
                10415
            ],
            [
                10415,
                10431
            ],
            [
                10431,
                10466
            ],
            [
                10466,
                10501
            ],
            [
                10501,
                10510
            ],
            [
                10511,
                10560
            ],
            [
                10560,
                10610
            ],
            [
                10611,
                10626
            ],
            [
                10626,
                10683
            ],
            [
                10683,
                10785
            ],
            [
                10785,
                10813
            ],
            [
                10813,
                10940
            ],
            [
                10941,
                10968
            ],
            [
                10969,
                11049
            ],
            [
                11049,
                11051
            ],
            [
                11051,
                11064
            ],
            [
                11065,
                11087
            ],
            [
                11095,
                11145
            ],
            [
                11146,
                11214
            ],
            [
                11215,
                11251
            ],
            [
                11252,
                11291
            ],
            [
                11292,
                11294
            ],
            [
                11297,
                11299
            ],
            [
                11299,
                11329
            ],
            [
                11329,
                11333
            ],
            [
                11334,
                11338
            ],
            [
                11339,
                11343
            ],
            [
                11344,
                11426
            ],
            [
                11427,
                11486
            ],
            [
                11486,
                11488
            ],
            [
                11488,
                11554
            ],
            [
                11554,
                11564
            ],
            [
                11575,
                11607
            ],
            [
                11608,
                11636
            ],
            [
                11637,
                11778
            ],
            [
                11779,
                11802
            ],
            [
                11803,
                11816
            ],
            [
                11816,
                11854
            ],
            [
                11855,
                11941
            ],
            [
                11946,
                11949
            ],
            [
                11949,
                11951
            ],
            [
                11951,
                12024
            ],
            [
                12024,
                12074
            ],
            [
                12077,
                12099
            ],
            [
                12099,
                12151
            ],
            [
                12151,
                12161
            ],
            [
                12162,
                12168
            ],
            [
                12169,
                12188
            ],
            [
                12189,
                12244
            ],
            [
                12245,
                12330
            ],
            [
                12330,
                12360
            ],
            [
                12363,
                12398
            ],
            [
                12398,
                12400
            ],
            [
                12400,
                12457
            ],
            [
                12457,
                12549
            ],
            [
                12549,
                12627
            ],
            [
                12636,
                12711
            ],
            [
                12712,
                12738
            ],
            [
                12739,
                12762
            ],
            [
                12762,
                12764
            ],
            [
                12764,
                12783
            ],
            [
                12786,
                12850
            ],
            [
                12850,
                12881
            ],
            [
                12881,
                12958
            ],
            [
                12958,
                12960
            ],
            [
                12960,
                13007
            ],
            [
                13007,
                13047
            ],
            [
                13048,
                13052
            ],
            [
                13053,
                13073
            ],
            [
                13075,
                13080
            ],
            [
                13081,
                13093
            ],
            [
                13119,
                13132
            ],
            [
                13132,
                13164
            ],
            [
                13164,
                13178
            ],
            [
                13179,
                13219
            ],
            [
                13220,
                13255
            ],
            [
                13255,
                13285
            ],
            [
                13285,
                13309
            ],
            [
                13309,
                13350
            ],
            [
                13351,
                13369
            ],
            [
                13374,
                13443
            ],
            [
                13444,
                13473
            ],
            [
                13473,
                13552
            ],
            [
                13553,
                13594
            ],
            [
                13597,
                13611
            ],
            [
                13611,
                13612
            ],
            [
                13613,
                13685
            ],
            [
                13685,
                13792
            ],
            [
                13792,
                13821
            ],
            [
                13822,
                13884
            ],
            [
                13884,
                13975
            ],
            [
                13976,
                13980
            ],
            [
                13980,
                13982
            ],
            [
                13982,
                14090
            ],
            [
                14091,
                14134
            ],
            [
                14134,
                14183
            ],
            [
                14184,
                14229
            ],
            [
                14230,
                14260
            ],
            [
                14260,
                14279
            ],
            [
                14279,
                14311
            ],
            [
                14312,
                14324
            ],
            [
                14324,
                14346
            ],
            [
                14346,
                14406
            ],
            [
                14406,
                14413
            ],
            [
                14414,
                14471
            ],
            [
                14471,
                14543
            ],
            [
                14543,
                14545
            ],
            [
                14545,
                14645
            ],
            [
                14645,
                14731
            ],
            [
                14731,
                14817
            ],
            [
                14818,
                14881
            ],
            [
                14881,
                14896
            ],
            [
                14896,
                14915
            ],
            [
                14915,
                14934
            ],
            [
                14934,
                15006
            ],
            [
                15006,
                15045
            ],
            [
                15045,
                15146
            ],
            [
                15146,
                15178
            ],
            [
                15178,
                15218
            ],
            [
                15223,
                15278
            ],
            [
                15278,
                15363
            ],
            [
                15363,
                15371
            ],
            [
                15371,
                15379
            ],
            [
                15379,
                15425
            ],
            [
                15425,
                15464
            ],
            [
                15464,
                15521
            ],
            [
                15521,
                15555
            ],
            [
                15556,
                15562
            ],
            [
                15567,
                15646
            ],
            [
                15646,
                15649
            ],
            [
                15649,
                15693
            ],
            [
                15693,
                15749
            ],
            [
                15749,
                15765
            ],
            [
                15765,
                15826
            ],
            [
                15826,
                15929
            ],
            [
                15929,
                15997
            ],
            [
                15997,
                16020
            ],
            [
                16020,
                16024
            ],
            [
                16029,
                16116
            ],
            [
                16124,
                16125
            ]
        ],
        "row_chars": [
            [
                0,
                54
            ],
            [
                54,
                210
            ],
            [
                210,
                296
            ],
            [
                296,
                583
            ],
            [
                583,
                642
            ],
            [
                642,
                700
            ],
            [
                700,
                741
            ],
            [
                741,
                826
            ],
            [
                826,
                941
            ],
            [
                941,
                1086
            ],
            [
                1086,
                1257
            ],
            [
                1257,
                1594
            ],
            [
                1594,
                1683
            ],
            [
                1683,
                1961
            ],
            [
                1961,
                1972
            ],
            [
                1972,
                1991
            ],
            [
                1991,
                2037
            ],
            [
                2037,
                2110
            ],
            [
                2110,
                2173
            ],
            [
                2173,
                2210
            ],
            [
                2210,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2243
            ],
            [
                2243,
                2309
            ],
            [
                2309,
                2384
            ],
            [
                2384,
                2451
            ],
            [
                2451,
                2495
            ],
            [
                2495,
                2541
            ],
            [
                2541,
                2630
            ],
            [
                2630,
                2671
            ],
            [
                2671,
                2741
            ],
            [
                2741,
                2845
            ],
            [
                2845,
                2897
            ],
            [
                2897,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3172
            ],
            [
                3172,
                3287
            ],
            [
                3287,
                3437
            ],
            [
                3437,
                3535
            ],
            [
                3535,
                3626
            ],
            [
                3626,
                3666
            ],
            [
                3666,
                3828
            ],
            [
                3828,
                4090
            ],
            [
                4090,
                4278
            ],
            [
                4278,
                4278
            ],
            [
                4278,
                4314
            ],
            [
                4314,
                4351
            ],
            [
                4351,
                4498
            ],
            [
                4498,
                4513
            ],
            [
                4513,
                4659
            ],
            [
                4659,
                4683
            ],
            [
                4683,
                4710
            ],
            [
                4710,
                4791
            ],
            [
                4791,
                4925
            ],
            [
                4925,
                4948
            ],
            [
                4948,
                4994
            ],
            [
                4994,
                4994
            ],
            [
                4994,
                4994
            ],
            [
                4994,
                5018
            ],
            [
                5018,
                5090
            ],
            [
                5090,
                5177
            ],
            [
                5177,
                5265
            ],
            [
                5265,
                5333
            ],
            [
                5333,
                5378
            ],
            [
                5378,
                5509
            ],
            [
                5509,
                5552
            ],
            [
                5552,
                5594
            ],
            [
                5594,
                5669
            ],
            [
                5669,
                5777
            ],
            [
                5777,
                5939
            ],
            [
                5939,
                6002
            ],
            [
                6002,
                6068
            ],
            [
                6068,
                6126
            ],
            [
                6126,
                6216
            ],
            [
                6216,
                6251
            ],
            [
                6251,
                6281
            ],
            [
                6281,
                6353
            ],
            [
                6353,
                6469
            ],
            [
                6469,
                6550
            ],
            [
                6550,
                6651
            ],
            [
                6651,
                6735
            ],
            [
                6735,
                6834
            ],
            [
                6834,
                6932
            ],
            [
                6932,
                7033
            ],
            [
                7033,
                7067
            ],
            [
                7067,
                7078
            ],
            [
                7078,
                7092
            ],
            [
                7092,
                7101
            ],
            [
                7101,
                7149
            ],
            [
                7149,
                7227
            ],
            [
                7227,
                7266
            ],
            [
                7266,
                7308
            ],
            [
                7308,
                7356
            ],
            [
                7356,
                7378
            ],
            [
                7378,
                7504
            ],
            [
                7504,
                7560
            ],
            [
                7560,
                7596
            ],
            [
                7596,
                7615
            ],
            [
                7615,
                7652
            ],
            [
                7652,
                7731
            ],
            [
                7731,
                7989
            ],
            [
                7989,
                8093
            ],
            [
                8093,
                8173
            ],
            [
                8173,
                8298
            ],
            [
                8298,
                8332
            ],
            [
                8332,
                8386
            ],
            [
                8386,
                8386
            ],
            [
                8386,
                8428
            ],
            [
                8428,
                8526
            ],
            [
                8526,
                8621
            ],
            [
                8621,
                8694
            ],
            [
                8694,
                8737
            ],
            [
                8737,
                8760
            ],
            [
                8760,
                8760
            ],
            [
                8760,
                8930
            ],
            [
                8930,
                8968
            ],
            [
                8968,
                8980
            ],
            [
                8980,
                9117
            ],
            [
                9117,
                9184
            ],
            [
                9184,
                9280
            ],
            [
                9280,
                9280
            ],
            [
                9280,
                9339
            ],
            [
                9339,
                9397
            ],
            [
                9397,
                9465
            ],
            [
                9465,
                9533
            ],
            [
                9533,
                9624
            ],
            [
                9624,
                9655
            ],
            [
                9655,
                9769
            ],
            [
                9769,
                9816
            ],
            [
                9816,
                9864
            ],
            [
                9864,
                9908
            ],
            [
                9908,
                9917
            ],
            [
                9917,
                9958
            ],
            [
                9958,
                10092
            ],
            [
                10092,
                10129
            ],
            [
                10129,
                10146
            ],
            [
                10146,
                10265
            ],
            [
                10265,
                10334
            ],
            [
                10334,
                10350
            ],
            [
                10350,
                10350
            ],
            [
                10350,
                10383
            ],
            [
                10383,
                10415
            ],
            [
                10415,
                10431
            ],
            [
                10431,
                10466
            ],
            [
                10466,
                10501
            ],
            [
                10501,
                10501
            ],
            [
                10501,
                10501
            ],
            [
                10501,
                10501
            ],
            [
                10501,
                10560
            ],
            [
                10560,
                10626
            ],
            [
                10626,
                10683
            ],
            [
                10683,
                10785
            ],
            [
                10785,
                10813
            ],
            [
                10813,
                10941
            ],
            [
                10941,
                11051
            ],
            [
                11051,
                11146
            ],
            [
                11146,
                11215
            ],
            [
                11215,
                11252
            ],
            [
                11252,
                11299
            ],
            [
                11299,
                11427
            ],
            [
                11427,
                11488
            ],
            [
                11488,
                11554
            ],
            [
                11554,
                11554
            ],
            [
                11554,
                11816
            ],
            [
                11816,
                11951
            ],
            [
                11951,
                12024
            ],
            [
                12024,
                12151
            ],
            [
                12151,
                12245
            ],
            [
                12245,
                12330
            ],
            [
                12330,
                12400
            ],
            [
                12400,
                12457
            ],
            [
                12457,
                12549
            ],
            [
                12549,
                12628
            ],
            [
                12628,
                12739
            ],
            [
                12739,
                12764
            ],
            [
                12764,
                12786
            ],
            [
                12786,
                12786
            ],
            [
                12786,
                12881
            ],
            [
                12881,
                12960
            ],
            [
                12960,
                13007
            ],
            [
                13007,
                13132
            ],
            [
                13132,
                13164
            ],
            [
                13164,
                13179
            ],
            [
                13179,
                13220
            ],
            [
                13220,
                13255
            ],
            [
                13255,
                13285
            ],
            [
                13285,
                13309
            ],
            [
                13309,
                13473
            ],
            [
                13473,
                13613
            ],
            [
                13613,
                13685
            ],
            [
                13685,
                13792
            ],
            [
                13792,
                13822
            ],
            [
                13822,
                13822
            ],
            [
                13822,
                13822
            ],
            [
                13822,
                13822
            ],
            [
                13822,
                13822
            ],
            [
                13822,
                13884
            ],
            [
                13884,
                13982
            ],
            [
                13982,
                14091
            ],
            [
                14091,
                14134
            ],
            [
                14134,
                14184
            ],
            [
                14184,
                14230
            ],
            [
                14230,
                14260
            ],
            [
                14260,
                14279
            ],
            [
                14279,
                14324
            ],
            [
                14324,
                14406
            ],
            [
                14406,
                14471
            ],
            [
                14471,
                14545
            ],
            [
                14545,
                14645
            ],
            [
                14645,
                14818
            ],
            [
                14818,
                14881
            ],
            [
                14881,
                14896
            ],
            [
                14896,
                14915
            ],
            [
                14915,
                14934
            ],
            [
                14934,
                15006
            ],
            [
                15006,
                15045
            ],
            [
                15045,
                15146
            ],
            [
                15146,
                15178
            ],
            [
                15178,
                15218
            ],
            [
                15218,
                15218
            ],
            [
                15218,
                15278
            ],
            [
                15278,
                15363
            ],
            [
                15363,
                15371
            ],
            [
                15371,
                15379
            ],
            [
                15379,
                15425
            ],
            [
                15425,
                15464
            ],
            [
                15464,
                15521
            ],
            [
                15521,
                15649
            ],
            [
                15649,
                15693
            ],
            [
                15693,
                15749
            ],
            [
                15749,
                15765
            ],
            [
                15765,
                15826
            ],
            [
                15826,
                15929
            ],
            [
                15929,
                15997
            ],
            [
                15997,
                15997
            ],
            [
                15997,
                16020
            ],
            [
                16020,
                16125
            ]
        ]
    }
}