{
    "original": {
        "text": "We must go back for a few pages to scenes which happened in London during this summer, so that the reader may understand Mr. Grey's position when he reached Lucerne. He had undergone another quarrel with George Vavasor, and something of the circumstances of that quarrel must be told.\nIt has been already said that George Vavasor lost his election for the Chelsea Districts, after all the money which he had spent,--money which he had been so ill able to spend, and on which he had laid his hands in a manner so disreputable! He had received two thousand pounds from the bills which Alice had executed on his behalf,--or rather, had received the full value of three out of the four bills, and a part of the value of the fourth, on which he had been driven to raise what immediate money he had wanted by means of a Jew bill-discounter. One thousand pounds he had paid over at once into the hands of Mr. Scruby, his Parliamentary election agent, towards the expenses of his election; and when the day of polling arrived had exactly in his hands the sum of five hundred pounds. Where he was to get more when this was gone he did not know. If he were successful,--if the enlightened constituents of the Chelsea Districts, contented with his efforts on behalf of the River Bank, should again send him to Parliament, he thought that he might still carry on the war. A sum of ready money he would have in hand; and, as to his debts, he would be grandly indifferent to any consideration of them. Then there might be pickings in the way of a Member of Parliament of his calibre. Companies,--mercantile companies,--would be glad to have him as a director, paying him a guinea a day, or perhaps more, for his hour's attendance. Railways in want of vice-chairmen might bid for his services; and in the City he might turn that \"M.P.\" which belonged to him to good account in various ways. With such a knowledge of the City world as he possessed, he thought that he could pick up a living in London, if only he could retain his seat in Parliament.\nBut what was he to do if he could not retain it? No sooner had Mr. Scruby got the thousand pounds into his clutches than he pressed for still more money. George Vavasor, with some show of justice on his side, pointed out to this all-devouring agent that the sum demanded had already been paid. This Mr. Scruby admitted, declaring that he was quite prepared to go on without any further immediate remittance, although by doing so might subject himself to considerable risk. But another five hundred pounds, paid at once, would add greatly to the safety of the seat; whereas eight hundred judiciously thrown in at the present moment would make the thing quite secure. But Vavasor swore to himself that he would not part with another shilling. Never had he felt such love for money as he did for that five hundred pounds which he now held in his pocket. \"It's no use,\" he said to Mr. Scruby. \"I have done what you asked, and would have done more had you asked for more at that time. As it is, I cannot make another payment before the election.\" Mr. Scruby shrugged his shoulders, and said that he would do his best. But George Vavasor soon knew that the man was not doing his best,--that the man had, in truth, abandoned his cause. The landlord of the \"Handsome Man\" jeered him when he went there canvassing. \"Laws, Mr. Vavasor!\" said the landlord of the \"Handsome Man,\" \"you're not at all the fellow for us chaps along the river,--you ain't. You're afraid to come down with the stumpy,--that's what you are.\" George put his hand upon his purse, and acknowledged to himself that he had been afraid to come down with the stumpy.\nFor the last five days of the affair George Vavasor knew that his chance was gone. Mr. Scruby's face, manner, and words, told the result of the election as plainly as any subsequent figures could do. He would be absent when Vavasor called, or the clerk would say that he was absent. He would answer in very few words, constantly shrugging his shoulders. He would even go away and leave the anxious candidate while he was in the middle of some discussion as to his plans. It was easy to see that Mr. Scruby no longer regarded him as a successful man, and the day of the poll showed very plainly how right Mr. Scruby had been.\nGeorge Vavasor was rejected, but he still had his five hundred pounds in his pocket. Of course he was subject to that mortification which a man feels when he reflects that some little additional outlay would have secured his object. Whether it might have been so, or not, who can say? But there he was, with the gateway between the lamps barred against him, ex-Member of Parliament for the Chelsea Districts, with five hundred pounds in his pocket, and little or nothing else that he could call his own. What was he to do with himself?\nAfter trying to make himself heard upon the hustings when he was rejected, and pledging himself to stand again at the next election, he went home to his lodgings in Cecil Street, and endeavoured to consider calmly his position in the world. He had lost his inheritance. He had abandoned one profession after another, and was now beyond the pale of another chance in that direction. His ambition had betrayed him, and there were no longer possible to him any hopes of political activity. He had estranged from himself every friend that he had ever possessed. He had driven from him with violence the devotion even of his sister. He had robbed the girl whom he intended to marry of her money, and had so insulted her that no feeling of amity between them was any longer possible. He had nothing now but himself and that five hundred pounds, which he still held in his pocket. What should he do with himself and his money? He thought over it all with outer calmness for awhile, as he sat there in his arm-chair.\nFrom the moment in which he had first become convinced that the election would go against him, and that he was therefore ruined on all sides, he had resolved that he would be calm amidst his ruin. Sometimes he assumed a little smile, as though he were laughing at his own position. Mr. Bott's day of rejection had come before his own, and he had written to Mr. Bott a drolling note of consolation and mock sympathy. He had shaken hands with Mr. Scruby, and had poked his fun at the agent, bidding him be sure to send in his little bill soon. To all who accosted him, he replied in a subrisive tone; and he bantered Calder Jones, whose seat was quite sure, till Calder Jones began to have fears that were quite unnecessary. And now, as he sat himself down, intending to come to some final decision as to what he would do, he maintained the same calmness. He smiled in the same way, though there was no one there to see the smile. He laughed even audibly once or twice, as he vainly endeavoured to persuade himself that he was able to regard the world and all that belonged to it as a bubble.\nThere came to him a moment in which he laughed out very audibly. \"Ha! ha!\" he shouted, rising up from his chair, and he walked about the room, holding a large paper-knife in his hand. \"Ha! ha!\" Then he threw the knife away from him, and thrusting his hands into his trousers-pockets, laughed again--\"Ha! ha!\" He stood still in the centre of the room, and the laughter was very plainly visible on his face, had there been anybody there to see it.\nBut suddenly there was a change upon his face, as he stood there all alone, and his eyes became fierce, and the cicatrice that marred his countenance grew to be red and ghastly, and he grinned with his teeth, and he clenched his fists as he still held them within his pockets. \"Curse him!\" he said out loud. \"Curse him, now and for ever!\" He had broken down in his calmness, when he thought of that old man who had opposed him during his life, and had ruined him at his death. \"May all the evils which the dead can feel cling to him for ever and ever!\" His laughter was all gone, and his assumed tranquillity had deserted him. Walking across the room, he struck his foot against a chair; upon this, he took the chair in his hands, and threw it across the room. But he hardly arrested the torrent of his maledictions as he did so. What good was it that he should lie to himself by that mock tranquillity, or that false laughter? He lied to himself no longer, but uttered a song of despair that was true enough. What should he do? Where should he go? From what fountain should he attempt to draw such small draughts of the water of comfort as might support him at the present moment? Unless a man have some such fountain to which he can turn, the burden of life cannot be borne. For the moment, Vavasor tried to find such fountain in a bottle of brandy which stood near him. He half filled a tumbler, and then, dashing some water on it, swallowed it greedily. \"By ----!\" he said, \"I believe it is the best thing a man can do.\"\nBut where was he to go? to whom was he to turn himself? He went to a high desk which stood in one corner of the room, and unlocking it, took out a revolving pistol, and for a while carried it about with him in his hand. He turned it up, and looked at it, and tried the lock, and snapped it without caps, to see that the barrel went round fairly. \"It's a beggarly thing to do,\" he said, and then he turned the pistol down again; \"and if I do do it, I'll use it first for another purpose.\" Then he poured out for himself more brandy-and-water, and having drunk it, he threw himself upon the sofa, and seemed to sleep.\nBut he did not sleep, and by-and-by there came a slight single knock at the door, which he instantly answered. But he did not answer it in the usual way by bidding the comer to come in. \"Who's there?\" he said. Then the comer attempted to enter, turning the handle of the door. But the door had been locked, and the key was on Vavasor's side. \"Who's there?\" he asked again, speaking out loudly, but in an angry voice. \"It is I,\" said a woman's voice. \"D----ation!\" said George Vavasor.\nThe woman heard him, but she made no sign of having heard him. She simply remained standing where she was till something further should be done within. She knew the man well, and knew that she must bide his time. She was very patient,--and for the time was meek, though it might be that there would come an end to her meekness. Vavasor, when he had heard her voice, and knew who was there, had again thrown himself on the sofa. There flashed across his mind another thought or two as to his future career,--another idea about the pistol, which still lay upon the table. Why should he let the intruder in, and undergo the nuisance of a disagreeable interview, if the end of all things might come in time to save him from such trouble? There he lay for ten minutes thinking, and then the low single knock was heard again. He jumped upon his feet, and his eyes were full of fire. He knew that it was useless to bid her go and leave him. She would sit there, if it were through the whole night. Should he open the door and strangle her, and pass out over her with the pistol in his hand, so that he might make that other reckoning which he desired to accomplish, and then never come back any more?\nHe took a turn through the room, and then walked gently up to the door, and undid the lock. He did not open the door, nor did he bid his visitor enter, but having made the way easy for her if she chose to come in, he walked back to the sofa and threw himself on it again. As he did so, he passed his hand across the table so as to bring the pistol near to himself at the place where he would be lying. She paused a moment after she had heard the sound of the key, and then she made her way into the room. He did not at first speak to her. She closed the door very gently, and then, looking around, came up to the foot of the sofa. She paused a moment, waiting for him to address her; but as he said nothing, but lay there looking at her, she was the first to speak. \"George,\" she said, \"what am I to do?\"\nShe was a woman of about thirty years of age, dressed poorly, in old garments, but still with decency, and with some attempt at feminine prettiness. There were flowers in the bonnet on her head, though the bonnet had that unmistakable look of age which is quite as distressing to bonnets as it is to women, and the flowers themselves were battered and faded. She had long black ringlets on each cheek, hanging down much below her face, and brought forward so as to hide in some degree the hollowness of her jaws. Her eyes had a peculiar brightness, but now they left on those who looked at her cursorily no special impression as to their colour. They had been blue,--that dark violet blue, which is so rare, but is sometimes so lovely. Her forehead was narrow, her mouth was small, and her lips were thin; but her nose was perfect in its shape, and, by the delicacy of its modelling, had given a peculiar grace to her face in the days when things had gone well with her, when her cheeks had been full with youth and good living, and had been dimpled by the softness of love and mirth. There were no dimples there now, and all the softness which still remained was that softness which sorrow and continual melancholy give to suffering women. On her shoulders she wore a light shawl, which was fastened to her bosom with a large clasp brooch. Her faded dress was supported by a wide crinoline, but the under garment had lost all the grace of its ancient shape, and now told that woman's tale of poverty and taste for dress which is to be read in the outward garb of so many of Eve's daughters. The whole story was told so that those who ran might read it. When she had left her home this afternoon, she had struggled hard to dress herself so that something of the charm of apparel might be left to her; but she had known of her own failure at every twist that she had given to her gown, and at every jerk with which she had settled her shawl. She had despaired at every push she had given to her old flowers, vainly striving to bring them back to their old forms; but still she had persevered. With long tedious care she had mended the old gloves which would hardly hold her fingers. She had carefully hidden the rags of her sleeves. She had washed her little shrivelled collar, and had smoothed it out painfully. It had been a separate grief to her that she could find no cuffs to put round her wrists;--and yet she knew that no cuffs could have availed her anything. Nothing could avail her now. She expected nothing from her visit; yet she had come forth anxiously, and would have waited there throughout the whole night had access to his room been debarred to her. \"George,\" she said, standing at the bottom of the sofa, \"what am I to do?\"\nAs he lay there with his face turned towards her, the windows were at her back, and he could see her very plainly. He saw and appreciated the little struggles she had made to create by her appearance some reminiscence of her former self. He saw the shining coarseness of the long ringlets which had once been softer than silk. He saw the sixpenny brooch on her bosom where he had once placed a jewel, the price of which would now have been important to him. He saw it all, and lay there for a while, silently reading it.\n\"Don't let me stand here,\" she said, \"without speaking a word to me.\"\n\"I don't want you to stand there,\" he said.\n\"That's all very well, George. I know you don't want me to stand here. I know you don't want to see me ever again.\"\n\"Never.\"\n\"I know it. Of course I know it. But what am I to do? Where am I to go for money? Even you would not wish that I should starve?\"\n\"That's true, too. I certainly would not wish it. I should be delighted to hear that you had plenty to eat and plenty to drink, and plenty of clothes to wear. I believe that's what you care for the most, after all.\"\n\"It was only for your sake,--because you liked it.\"\n\"Well;--I did like it; but that has come to an end, as have all my other likings. You know very well that I can do nothing more for you. What good do you do yourself by coming here to annoy me? Have I not told you over and over again that you were never to look for me here? Is it likely that I should give you money now, simply because you have disobeyed me!\"\n\"Where else was I to find you?\"\n\"Why should you have found me at all? I don't want you to find me. I shall give you nothing;--not a penny. You know very well that we've had all that out before. When I put you into business I told you that we were to see no more of each other.\"\n\"Business!\" she said. \"I never could make enough out of the shop to feed a bird.\"\n\"That wasn't my fault. Putting you there cost me over a hundred pounds, and you consented to take the place.\"\n\"I didn't consent. I was obliged to go there because you took my other home away from me.\"\n\"Have it as you like, my dear. That was all I could do for you;--and more than most men would have done, when all things are considered.\" Then he got up from the sofa, and stood himself on the hearthrug, with his back to the fireplace. \"At any rate, you may be sure of this, Jane;--that I shall do nothing more. You have come here to torment me, but you shall get nothing by it.\"\n\"I have come here because I am starving.\"\n\"I have nothing for you. Now go;\" and he pointed to the door. Nevertheless, for more than three years of his life this woman had been his closest companion, his nearest friend, the being with whom he was most familiar. He had loved her according to his fashion of loving, and certainly she had loved him. \"Go,\" he said repeating the word very angrily. \"Do as I bid you, or it will be the worse for you.\"\n\"Will you give me a sovereign?\"\n\"No;--I will give you nothing. I have desired you not to come to me here, and I will not pay for you coming.\"\n\"Then I will not go;\" and the woman sat down upon a chair at the foot of the table. \"I will not go till you have given me something to buy food. You may put me out of the room if you can, but I will lie at the door of the stairs. And if you get me out of the house, I will sit upon the door-step.\"\n\"If you play that game, my poor girl, the police will take you.\"\n\"Let them. It has come to that with me, that I care for nothing. Out of this I will not go till you give me money--unless I am put out.\"\nAnd for this she had dressed herself with so much care, mending her gloves, and darning her little fragments of finery! He stood looking at her, with his hands thrust deep into his pockets,--looking at her and thinking what he had better do to rid himself of her presence. If he even quite resolved to take that little final journey of which we have spoken, with the pistol in his hand, why should he not go and leave her there? Or, for the matter of that, why should he not make her his heir to all remainder of his wealth? What he still had left was sufficient to place her in a seventh heaven of the earth. He cared but little for her, and was at this moment angry with her; but there was no one for whom he cared more, and no friend with whom he was less angry. But then his mind was not quite made up as to that final journey. Therefore he desired to rid himself and his room of the nuisance of her presence.\n\"Jane,\" he said, looking at her again with that assumed tranquillity of which I have spoken, \"you talk of starving and of being ruined,--\"\n\"I am starving. I have not a shilling in the world.\"\n\"Perhaps it may be a comfort to you in your troubles to know that I am, at any rate, as badly off as you are? I won't say that I am starving, because I could get food to eat at this moment if I wanted it; but I am utterly ruined. My property,--what should have been mine,--has been left away from me. I have lost the trumpery seat in Parliament for which I have paid so much. All my relations have turned their backs upon me--\"\n\"Are you not going to be married?\" she said, rising quickly from her chair and coming close to him.\n\"Married! No;--but I am going to blow my brains out. Look at that pistol, my girl. Of course you won't think that I am in earnest,--but I am.\"\nShe looked up into his face piteously. \"Oh! George,\" she said, \"you won't do that?\"\n[Illustration: \"Oh! George,\" she said, \"you won't do that?\"]\n\"But I shall do that. There is nothing else left for me to do. You talk to me about starving. I tell you that I should have no objection to be starved, and so be put an end to in that way. It's not so bad as some other ways when it comes gradually. You and I, Jane, have not played our cards very well. We have staked all that we had, and we've been beaten. It's no good whimpering after what's lost. We'd better go somewhere else and begin a new game.\"\n\"Go where?\" said she.\n\"Ah!--that's just what I can't tell you.\"\n\"George,\" she said, \"I'll go anywhere with you. If what you say is true,--if you're not going to be married, and will let me come to you, I will work for you like a slave. I will indeed. I know I'm poorly looking now--\"\n\"My girl, where I'm going, I shall not want any slave; and as for your looks--when you go there too,--they'll be of no matter, as far as I am able to judge.\"\n\"But, George, where are you going?\"\n\"Wherever people do go when their brains are knocked out of them; or, rather, when they have knocked out their own brains,--if that makes any difference.\"\n\"George,\"--she came up to him now, and took hold of him by the front of his coat, and for the moment he allowed her to do so,--\"George, you frighten me. Do not do that. Say that you will not do that!\"\n\"But I am just saying that I shall.\"\n\"Are you not afraid of God's anger? You and I have been very wicked.\"\n\"I have, my poor girl. I don't know much about your wickedness. I've been like Topsy;--indeed I am a kind of second Topsy myself. But what's the good of whimpering when it's over?\"\n\"It isn't over; it isn't over,--at any rate for you.\"\n\"I wish I knew how I could begin again. But all this is nonsense, Jane, and you must go.\"\n\"You must tell me, first, that you are not going to--kill yourself.\"\n\"I don't suppose I shall do it to-night,--or, perhaps, not to-morrow. Very probably I may allow myself a week, so that your staying here can do no good. I merely wanted to make you understand that you are not the only person who has come to grief.\"\n\"And you are not going to be married?\"\n\"No; I'm not going to be married, certainly.\"\n\"And I must go now?\"\n\"Yes; I think you'd better go now.\" Then she rose and went, and he let her leave the room without giving her a shilling! His bantering tone, in speaking of his own position, had been successful. It had caused her to take herself off quietly. She knew enough of his usual manner to be aware that his threats of self destruction were probably unreal; but, nevertheless, what he had said had created some feeling in her heart which had induced her to yield to him, and go away in peace.",
        "paragraph_chars": [
            [
                0,
                285
            ],
            [
                285,
                2034
            ],
            [
                2034,
                3659
            ],
            [
                3659,
                4284
            ],
            [
                4284,
                4820
            ],
            [
                4820,
                5829
            ],
            [
                5829,
                6920
            ],
            [
                6920,
                7366
            ],
            [
                7366,
                8891
            ],
            [
                8891,
                9507
            ],
            [
                9507,
                9992
            ],
            [
                9992,
                11186
            ],
            [
                11186,
                11991
            ],
            [
                11991,
                14733
            ],
            [
                14733,
                15254
            ],
            [
                15254,
                15324
            ],
            [
                15324,
                15368
            ],
            [
                15368,
                15484
            ],
            [
                15484,
                15493
            ],
            [
                15493,
                15622
            ],
            [
                15622,
                15838
            ],
            [
                15838,
                15890
            ],
            [
                15890,
                16251
            ],
            [
                16251,
                16283
            ],
            [
                16283,
                16529
            ],
            [
                16529,
                16611
            ],
            [
                16611,
                16721
            ],
            [
                16721,
                16812
            ],
            [
                16812,
                17192
            ],
            [
                17192,
                17234
            ],
            [
                17234,
                17638
            ],
            [
                17638,
                17670
            ],
            [
                17670,
                17780
            ],
            [
                17780,
                18078
            ],
            [
                18078,
                18143
            ],
            [
                18143,
                18280
            ],
            [
                18280,
                19194
            ],
            [
                19194,
                19333
            ],
            [
                19333,
                19386
            ],
            [
                19386,
                19814
            ],
            [
                19814,
                19914
            ],
            [
                19914,
                20057
            ],
            [
                20057,
                20141
            ],
            [
                20141,
                20202
            ],
            [
                20202,
                20656
            ],
            [
                20656,
                20678
            ],
            [
                20678,
                20720
            ],
            [
                20720,
                20940
            ],
            [
                20940,
                21098
            ],
            [
                21098,
                21134
            ],
            [
                21134,
                21289
            ],
            [
                21289,
                21490
            ],
            [
                21490,
                21527
            ],
            [
                21527,
                21597
            ],
            [
                21597,
                21778
            ],
            [
                21778,
                21832
            ],
            [
                21832,
                21922
            ],
            [
                21922,
                21991
            ],
            [
                21991,
                22240
            ],
            [
                22240,
                22279
            ],
            [
                22279,
                22325
            ],
            [
                22325,
                22346
            ],
            [
                22346,
                22829
            ]
        ],
        "segment_chars": [
            [
                0,
                166
            ],
            [
                166,
                285
            ],
            [
                285,
                526
            ],
            [
                526,
                835
            ],
            [
                835,
                1075
            ],
            [
                1075,
                1136
            ],
            [
                1136,
                1360
            ],
            [
                1360,
                1488
            ],
            [
                1488,
                1570
            ],
            [
                1570,
                1717
            ],
            [
                1717,
                1821
            ],
            [
                1821,
                1876
            ],
            [
                1876,
                2034
            ],
            [
                2034,
                2083
            ],
            [
                2083,
                2188
            ],
            [
                2188,
                2328
            ],
            [
                2328,
                2507
            ],
            [
                2507,
                2700
            ],
            [
                2700,
                2775
            ],
            [
                2775,
                2885
            ],
            [
                2885,
                2923
            ],
            [
                2923,
                3014
            ],
            [
                3014,
                3076
            ],
            [
                3076,
                3147
            ],
            [
                3147,
                3263
            ],
            [
                3263,
                3340
            ],
            [
                3340,
                3361
            ],
            [
                3361,
                3474
            ],
            [
                3474,
                3541
            ],
            [
                3541,
                3659
            ],
            [
                3659,
                3742
            ],
            [
                3742,
                3859
            ],
            [
                3859,
                3942
            ],
            [
                3942,
                4013
            ],
            [
                4013,
                4130
            ],
            [
                4130,
                4284
            ],
            [
                4284,
                4369
            ],
            [
                4369,
                4517
            ],
            [
                4517,
                4569
            ],
            [
                4569,
                4788
            ],
            [
                4788,
                4820
            ],
            [
                4820,
                5061
            ],
            [
                5061,
                5090
            ],
            [
                5090,
                5202
            ],
            [
                5202,
                5307
            ],
            [
                5307,
                5378
            ],
            [
                5378,
                5448
            ],
            [
                5448,
                5598
            ],
            [
                5598,
                5694
            ],
            [
                5694,
                5740
            ],
            [
                5740,
                5829
            ],
            [
                5829,
                6026
            ],
            [
                6026,
                6111
            ],
            [
                6111,
                6245
            ],
            [
                6245,
                6371
            ],
            [
                6371,
                6552
            ],
            [
                6552,
                6683
            ],
            [
                6683,
                6758
            ],
            [
                6758,
                6920
            ],
            [
                6920,
                6985
            ],
            [
                6985,
                6990
            ],
            [
                6990,
                6995
            ],
            [
                6995,
                7104
            ],
            [
                7104,
                7109
            ],
            [
                7109,
                7114
            ],
            [
                7114,
                7224
            ],
            [
                7224,
                7229
            ],
            [
                7229,
                7366
            ],
            [
                7366,
                7643
            ],
            [
                7643,
                7656
            ],
            [
                7656,
                7674
            ],
            [
                7674,
                7705
            ],
            [
                7705,
                7843
            ],
            [
                7843,
                7919
            ],
            [
                7919,
                7993
            ],
            [
                7993,
                8127
            ],
            [
                8127,
                8196
            ],
            [
                8196,
                8294
            ],
            [
                8294,
                8376
            ],
            [
                8376,
                8395
            ],
            [
                8395,
                8415
            ],
            [
                8415,
                8548
            ],
            [
                8548,
                8643
            ],
            [
                8643,
                8739
            ],
            [
                8739,
                8824
            ],
            [
                8824,
                8835
            ],
            [
                8835,
                8891
            ],
            [
                8891,
                8915
            ],
            [
                8915,
                8947
            ],
            [
                8947,
                9111
            ],
            [
                9111,
                9237
            ],
            [
                9237,
                9379
            ],
            [
                9379,
                9507
            ],
            [
                9507,
                9618
            ],
            [
                9618,
                9693
            ],
            [
                9693,
                9708
            ],
            [
                9708,
                9717
            ],
            [
                9717,
                9784
            ],
            [
                9784,
                9849
            ],
            [
                9849,
                9864
            ],
            [
                9864,
                9924
            ],
            [
                9924,
                9957
            ],
            [
                9957,
                9971
            ],
            [
                9971,
                9992
            ],
            [
                9992,
                10055
            ],
            [
                10055,
                10144
            ],
            [
                10144,
                10205
            ],
            [
                10205,
                10320
            ],
            [
                10320,
                10420
            ],
            [
                10420,
                10562
            ],
            [
                10562,
                10726
            ],
            [
                10726,
                10812
            ],
            [
                10812,
                10869
            ],
            [
                10869,
                10926
            ],
            [
                10926,
                10983
            ],
            [
                10983,
                11186
            ],
            [
                11186,
                11278
            ],
            [
                11278,
                11458
            ],
            [
                11458,
                11588
            ],
            [
                11588,
                11691
            ],
            [
                11691,
                11725
            ],
            [
                11725,
                11817
            ],
            [
                11817,
                11952
            ],
            [
                11952,
                11991
            ],
            [
                11991,
                12140
            ],
            [
                12140,
                12350
            ],
            [
                12350,
                12504
            ],
            [
                12504,
                12637
            ],
            [
                12637,
                12727
            ],
            [
                12727,
                13076
            ],
            [
                13076,
                13232
            ],
            [
                13232,
                13332
            ],
            [
                13332,
                13583
            ],
            [
                13583,
                13645
            ],
            [
                13645,
                13932
            ],
            [
                13932,
                14083
            ],
            [
                14083,
                14173
            ],
            [
                14173,
                14223
            ],
            [
                14223,
                14303
            ],
            [
                14303,
                14458
            ],
            [
                14458,
                14487
            ],
            [
                14487,
                14658
            ],
            [
                14658,
                14733
            ],
            [
                14733,
                14848
            ],
            [
                14848,
                14971
            ],
            [
                14971,
                15060
            ],
            [
                15060,
                15191
            ],
            [
                15191,
                15254
            ],
            [
                15254,
                15324
            ],
            [
                15324,
                15368
            ],
            [
                15368,
                15399
            ],
            [
                15399,
                15439
            ],
            [
                15439,
                15484
            ],
            [
                15484,
                15493
            ],
            [
                15493,
                15505
            ],
            [
                15505,
                15526
            ],
            [
                15526,
                15547
            ],
            [
                15547,
                15575
            ],
            [
                15575,
                15622
            ],
            [
                15622,
                15641
            ],
            [
                15641,
                15672
            ],
            [
                15672,
                15781
            ],
            [
                15781,
                15838
            ],
            [
                15838,
                15890
            ],
            [
                15890,
                15972
            ],
            [
                15972,
                16027
            ],
            [
                16027,
                16084
            ],
            [
                16084,
                16165
            ],
            [
                16165,
                16251
            ],
            [
                16251,
                16283
            ],
            [
                16283,
                16321
            ],
            [
                16321,
                16350
            ],
            [
                16350,
                16390
            ],
            [
                16390,
                16445
            ],
            [
                16445,
                16529
            ],
            [
                16529,
                16541
            ],
            [
                16541,
                16551
            ],
            [
                16551,
                16611
            ],
            [
                16611,
                16634
            ],
            [
                16634,
                16721
            ],
            [
                16721,
                16740
            ],
            [
                16740,
                16812
            ],
            [
                16812,
                16843
            ],
            [
                16843,
                16950
            ],
            [
                16950,
                17048
            ],
            [
                17048,
                17124
            ],
            [
                17124,
                17192
            ],
            [
                17192,
                17234
            ],
            [
                17234,
                17259
            ],
            [
                17259,
                17296
            ],
            [
                17296,
                17453
            ],
            [
                17453,
                17539
            ],
            [
                17539,
                17586
            ],
            [
                17586,
                17638
            ],
            [
                17638,
                17670
            ],
            [
                17670,
                17701
            ],
            [
                17701,
                17780
            ],
            [
                17780,
                17864
            ],
            [
                17864,
                17925
            ],
            [
                17925,
                18010
            ],
            [
                18010,
                18078
            ],
            [
                18078,
                18143
            ],
            [
                18143,
                18154
            ],
            [
                18154,
                18208
            ],
            [
                18208,
                18280
            ],
            [
                18280,
                18400
            ],
            [
                18400,
                18553
            ],
            [
                18553,
                18709
            ],
            [
                18709,
                18805
            ],
            [
                18805,
                18890
            ],
            [
                18890,
                19046
            ],
            [
                19046,
                19112
            ],
            [
                19112,
                19194
            ],
            [
                19194,
                19333
            ],
            [
                19333,
                19349
            ],
            [
                19349,
                19386
            ],
            [
                19386,
                19496
            ],
            [
                19496,
                19616
            ],
            [
                19616,
                19687
            ],
            [
                19687,
                19762
            ],
            [
                19762,
                19814
            ],
            [
                19814,
                19849
            ],
            [
                19849,
                19914
            ],
            [
                19914,
                19924
            ],
            [
                19924,
                19967
            ],
            [
                19967,
                19997
            ],
            [
                19997,
                20057
            ],
            [
                20057,
                20096
            ],
            [
                20096,
                20101
            ],
            [
                20101,
                20141
            ],
            [
                20141,
                20161
            ],
            [
                20161,
                20202
            ],
            [
                20202,
                20224
            ],
            [
                20224,
                20265
            ],
            [
                20265,
                20296
            ],
            [
                20296,
                20391
            ],
            [
                20391,
                20451
            ],
            [
                20451,
                20505
            ],
            [
                20505,
                20560
            ],
            [
                20560,
                20603
            ],
            [
                20603,
                20656
            ],
            [
                20656,
                20668
            ],
            [
                20668,
                20678
            ],
            [
                20678,
                20720
            ],
            [
                20720,
                20768
            ],
            [
                20768,
                20892
            ],
            [
                20892,
                20907
            ],
            [
                20907,
                20940
            ],
            [
                20940,
                21098
            ],
            [
                21098,
                21134
            ],
            [
                21134,
                21289
            ],
            [
                21289,
                21442
            ],
            [
                21442,
                21458
            ],
            [
                21458,
                21490
            ],
            [
                21490,
                21527
            ],
            [
                21527,
                21563
            ],
            [
                21563,
                21597
            ],
            [
                21597,
                21620
            ],
            [
                21620,
                21661
            ],
            [
                21661,
                21727
            ],
            [
                21727,
                21778
            ],
            [
                21778,
                21832
            ],
            [
                21832,
                21872
            ],
            [
                21872,
                21922
            ],
            [
                21922,
                21991
            ],
            [
                21991,
                22061
            ],
            [
                22061,
                22144
            ],
            [
                22144,
                22240
            ],
            [
                22240,
                22279
            ],
            [
                22279,
                22325
            ],
            [
                22325,
                22346
            ],
            [
                22346,
                22382
            ],
            [
                22382,
                22467
            ],
            [
                22467,
                22541
            ],
            [
                22541,
                22588
            ],
            [
                22588,
                22829
            ]
        ],
        "overlap_chars": [
            [
                0,
                73
            ],
            [
                95,
                98
            ],
            [
                79,
                86
            ],
            [
                121,
                129
            ],
            [
                157,
                166
            ],
            [
                166,
                172
            ],
            [
                183,
                218
            ],
            [
                283,
                285
            ],
            [
                322,
                373
            ],
            [
                381,
                394
            ],
            [
                401,
                413
            ],
            [
                666,
                672
            ],
            [
                567,
                592
            ],
            [
                615,
                616
            ],
            [
                855,
                866
            ],
            [
                835,
                854
            ],
            [
                872,
                879
            ],
            [
                756,
                758
            ],
            [
                898,
                908
            ],
            [
                942,
                994
            ],
            [
                1002,
                1009
            ],
            [
                995,
                998
            ],
            [
                1010,
                1017
            ],
            [
                526,
                532
            ],
            [
                1030,
                1042
            ],
            [
                1054,
                1075
            ],
            [
                1075,
                1118
            ],
            [
                1119,
                1136
            ],
            [
                1136,
                1158
            ],
            [
                1426,
                1464
            ],
            [
                1419,
                1424
            ],
            [
                1486,
                1488
            ],
            [
                1493,
                1570
            ],
            [
                1570,
                1579
            ],
            [
                1605,
                1652
            ],
            [
                1657,
                1715
            ],
            [
                1777,
                1821
            ],
            [
                1843,
                1875
            ],
            [
                2034,
                2061
            ],
            [
                1901,
                1904
            ],
            [
                2081,
                2083
            ],
            [
                2083,
                2131
            ],
            [
                2150,
                2186
            ],
            [
                2202,
                2203
            ],
            [
                2283,
                2287
            ],
            [
                2607,
                2620
            ],
            [
                2665,
                2700
            ],
            [
                2700,
                2774
            ],
            [
                2885,
                2923
            ],
            [
                3024,
                3076
            ],
            [
                3076,
                3147
            ],
            [
                3147,
                3211
            ],
            [
                3214,
                3263
            ],
            [
                3263,
                3282
            ],
            [
                3293,
                3296
            ],
            [
                3298,
                3304
            ],
            [
                3309,
                3338
            ],
            [
                3575,
                3580
            ],
            [
                3703,
                3742
            ],
            [
                3742,
                3752
            ],
            [
                3862,
                3882
            ],
            [
                3859,
                3861
            ],
            [
                3891,
                3897
            ],
            [
                3940,
                3942
            ],
            [
                4130,
                4284
            ],
            [
                4582,
                4585
            ],
            [
                4585,
                4586
            ],
            [
                4569,
                4572
            ],
            [
                4579,
                4581
            ],
            [
                4698,
                4732
            ],
            [
                4737,
                4788
            ],
            [
                4788,
                4820
            ],
            [
                4820,
                4825
            ],
            [
                4899,
                4907
            ],
            [
                4916,
                5002
            ],
            [
                5015,
                5061
            ],
            [
                5061,
                5090
            ],
            [
                5090,
                5135
            ],
            [
                5200,
                5202
            ],
            [
                5202,
                5236
            ],
            [
                5248,
                5250
            ],
            [
                5278,
                5286
            ],
            [
                5305,
                5307
            ],
            [
                5307,
                5357
            ],
            [
                5367,
                5378
            ],
            [
                5378,
                5414
            ],
            [
                5428,
                5432
            ],
            [
                5436,
                5439
            ],
            [
                5440,
                5448
            ],
            [
                5448,
                5496
            ],
            [
                5509,
                5539
            ],
            [
                5560,
                5576
            ],
            [
                5596,
                5598
            ],
            [
                5740,
                5782
            ],
            [
                5793,
                5829
            ],
            [
                5829,
                5866
            ],
            [
                5884,
                5922
            ],
            [
                5969,
                6026
            ],
            [
                6026,
                6111
            ],
            [
                6111,
                6182
            ],
            [
                6186,
                6198
            ],
            [
                6206,
                6245
            ],
            [
                6371,
                6411
            ],
            [
                6422,
                6426
            ],
            [
                6550,
                6551
            ],
            [
                6552,
                6570
            ],
            [
                6579,
                6583
            ],
            [
                6595,
                6597
            ],
            [
                6583,
                6584
            ],
            [
                6683,
                6758
            ],
            [
                6758,
                6760
            ],
            [
                6769,
                6773
            ],
            [
                7014,
                7016
            ],
            [
                7033,
                7036
            ],
            [
                6761,
                6768
            ],
            [
                6774,
                6781
            ],
            [
                6795,
                6802
            ],
            [
                6822,
                6849
            ],
            [
                6869,
                6920
            ],
            [
                7366,
                7397
            ],
            [
                7440,
                7477
            ],
            [
                7488,
                7503
            ],
            [
                7407,
                7411
            ],
            [
                7516,
                7520
            ],
            [
                7527,
                7542
            ],
            [
                7416,
                7418
            ],
            [
                7564,
                7573
            ],
            [
                7544,
                7547
            ],
            [
                7582,
                7600
            ],
            [
                7623,
                7642
            ],
            [
                7643,
                7656
            ],
            [
                7656,
                7674
            ],
            [
                7674,
                7705
            ],
            [
                7705,
                7707
            ],
            [
                7757,
                7843
            ],
            [
                7950,
                7974
            ],
            [
                7979,
                7993
            ],
            [
                8018,
                8020
            ],
            [
                8045,
                8053
            ],
            [
                8065,
                8127
            ],
            [
                8376,
                8395
            ],
            [
                8395,
                8415
            ],
            [
                8415,
                8419
            ],
            [
                8507,
                8512
            ],
            [
                8441,
                8443
            ],
            [
                8496,
                8503
            ],
            [
                8452,
                8454
            ],
            [
                8513,
                8524
            ],
            [
                8546,
                8547
            ],
            [
                8659,
                8666
            ],
            [
                8673,
                8675
            ],
            [
                8698,
                8733
            ],
            [
                8657,
                8658
            ],
            [
                8742,
                8768
            ],
            [
                8801,
                8824
            ],
            [
                8824,
                8827
            ],
            [
                8832,
                8835
            ],
            [
                8835,
                8891
            ],
            [
                8947,
                8969
            ],
            [
                8982,
                9037
            ],
            [
                9109,
                9111
            ],
            [
                9111,
                9123
            ],
            [
                9144,
                9236
            ],
            [
                9237,
                9280
            ],
            [
                9296,
                9317
            ],
            [
                9319,
                9320
            ],
            [
                9324,
                9328
            ],
            [
                9332,
                9379
            ],
            [
                9379,
                9393
            ],
            [
                9402,
                9507
            ],
            [
                9507,
                9562
            ],
            [
                9570,
                9587
            ],
            [
                9616,
                9617
            ],
            [
                9693,
                9708
            ],
            [
                9708,
                9717
            ],
            [
                9717,
                9725
            ],
            [
                9778,
                9782
            ],
            [
                9764,
                9770
            ],
            [
                9782,
                9784
            ],
            [
                9784,
                9812
            ],
            [
                9847,
                9849
            ],
            [
                9849,
                9864
            ],
            [
                9864,
                9879
            ],
            [
                9905,
                9907
            ],
            [
                9899,
                9900
            ],
            [
                9911,
                9923
            ],
            [
                9924,
                9956
            ],
            [
                9957,
                9959
            ],
            [
                9963,
                9971
            ],
            [
                9971,
                9992
            ],
            [
                9992,
                10020
            ],
            [
                10059,
                10097
            ],
            [
                10142,
                10144
            ],
            [
                10144,
                10189
            ],
            [
                10203,
                10205
            ],
            [
                10205,
                10225
            ],
            [
                10228,
                10320
            ],
            [
                10320,
                10328
            ],
            [
                10407,
                10418
            ],
            [
                10380,
                10385
            ],
            [
                10499,
                10511
            ],
            [
                10434,
                10449
            ],
            [
                10512,
                10528
            ],
            [
                10560,
                10562
            ],
            [
                10562,
                10600
            ],
            [
                10625,
                10681
            ],
            [
                10698,
                10725
            ],
            [
                10726,
                10812
            ],
            [
                10812,
                10821
            ],
            [
                10827,
                10836
            ],
            [
                10841,
                10849
            ],
            [
                10855,
                10869
            ],
            [
                10869,
                10910
            ],
            [
                10924,
                10926
            ],
            [
                10926,
                10945
            ],
            [
                10976,
                10983
            ],
            [
                10983,
                11028
            ],
            [
                11034,
                11037
            ],
            [
                11047,
                11062
            ],
            [
                11151,
                11154
            ],
            [
                11160,
                11186
            ],
            [
                11186,
                11188
            ],
            [
                11228,
                11278
            ],
            [
                11400,
                11458
            ],
            [
                11458,
                11507
            ],
            [
                11514,
                11516
            ],
            [
                11523,
                11533
            ],
            [
                11586,
                11587
            ],
            [
                11628,
                11631
            ],
            [
                11592,
                11607
            ],
            [
                11648,
                11691
            ],
            [
                11691,
                11701
            ],
            [
                11711,
                11716
            ],
            [
                11723,
                11725
            ],
            [
                11725,
                11761
            ],
            [
                11784,
                11817
            ],
            [
                11874,
                11879
            ],
            [
                11880,
                11951
            ],
            [
                11952,
                11991
            ],
            [
                11991,
                12022
            ],
            [
                12035,
                12051
            ],
            [
                12053,
                12118
            ],
            [
                12128,
                12140
            ],
            [
                12140,
                12150
            ],
            [
                12343,
                12348
            ],
            [
                12151,
                12161
            ],
            [
                12176,
                12179
            ],
            [
                12166,
                12172
            ],
            [
                12348,
                12350
            ],
            [
                12350,
                12392
            ],
            [
                12453,
                12455
            ],
            [
                12464,
                12475
            ],
            [
                12476,
                12504
            ],
            [
                12504,
                12539
            ],
            [
                12773,
                12780
            ],
            [
                12909,
                12913
            ],
            [
                12740,
                12743
            ],
            [
                12795,
                12796
            ],
            [
                12836,
                12839
            ],
            [
                12914,
                12961
            ],
            [
                12642,
                12645
            ],
            [
                12885,
                12886
            ],
            [
                13048,
                13052
            ],
            [
                13065,
                13074
            ],
            [
                12896,
                12901
            ],
            [
                13074,
                13076
            ],
            [
                13113,
                13135
            ],
            [
                13142,
                13174
            ],
            [
                13186,
                13195
            ],
            [
                13212,
                13231
            ],
            [
                13249,
                13271
            ],
            [
                13235,
                13238
            ],
            [
                13342,
                13347
            ],
            [
                13581,
                13583
            ],
            [
                13645,
                13735
            ],
            [
                13753,
                13758
            ],
            [
                13770,
                13809
            ],
            [
                13813,
                13837
            ],
            [
                13930,
                13932
            ],
            [
                14083,
                14120
            ],
            [
                14160,
                14163
            ],
            [
                14125,
                14135
            ],
            [
                14171,
                14173
            ],
            [
                14173,
                14223
            ],
            [
                14223,
                14303
            ],
            [
                14303,
                14316
            ],
            [
                14326,
                14392
            ],
            [
                14394,
                14415
            ],
            [
                14419,
                14430
            ],
            [
                14431,
                14435
            ],
            [
                14444,
                14447
            ],
            [
                14456,
                14458
            ],
            [
                14458,
                14471
            ],
            [
                14478,
                14487
            ],
            [
                14487,
                14556
            ],
            [
                14656,
                14657
            ],
            [
                14658,
                14676
            ],
            [
                14712,
                14733
            ],
            [
                14733,
                14748
            ],
            [
                14781,
                14782
            ],
            [
                14848,
                14914
            ],
            [
                14933,
                14971
            ],
            [
                14971,
                15060
            ],
            [
                15060,
                15132
            ],
            [
                15189,
                15191
            ],
            [
                15191,
                15204
            ],
            [
                15206,
                15254
            ],
            [
                15254,
                15324
            ],
            [
                15324,
                15368
            ],
            [
                15399,
                15405
            ],
            [
                15437,
                15439
            ],
            [
                15439,
                15484
            ],
            [
                15484,
                15493
            ],
            [
                15505,
                15526
            ],
            [
                15526,
                15547
            ],
            [
                15547,
                15575
            ],
            [
                15575,
                15622
            ],
            [
                15641,
                15642
            ],
            [
                15653,
                15672
            ],
            [
                15672,
                15732
            ],
            [
                15743,
                15781
            ],
            [
                15781,
                15838
            ],
            [
                15838,
                15864
            ],
            [
                15867,
                15890
            ],
            [
                15890,
                15896
            ],
            [
                15898,
                15972
            ],
            [
                15972,
                16027
            ],
            [
                16027,
                16046
            ],
            [
                16056,
                16084
            ],
            [
                16084,
                16123
            ],
            [
                16138,
                16146
            ],
            [
                16159,
                16163
            ],
            [
                16251,
                16283
            ],
            [
                16321,
                16350
            ],
            [
                16350,
                16357
            ],
            [
                16377,
                16380
            ],
            [
                16358,
                16366
            ],
            [
                16381,
                16390
            ],
            [
                16445,
                16529
            ],
            [
                16529,
                16541
            ],
            [
                16541,
                16551
            ],
            [
                16551,
                16553
            ],
            [
                16560,
                16565
            ],
            [
                16554,
                16559
            ],
            [
                16566,
                16611
            ],
            [
                16611,
                16634
            ],
            [
                16634,
                16703
            ],
            [
                16718,
                16721
            ],
            [
                16721,
                16740
            ],
            [
                16740,
                16785
            ],
            [
                16792,
                16812
            ],
            [
                16812,
                16843
            ],
            [
                16843,
                16875
            ],
            [
                16877,
                16915
            ],
            [
                16947,
                16950
            ],
            [
                16950,
                16989
            ],
            [
                16998,
                17014
            ],
            [
                17046,
                17048
            ],
            [
                17048,
                17061
            ],
            [
                17087,
                17091
            ],
            [
                17085,
                17086
            ],
            [
                17099,
                17124
            ],
            [
                17162,
                17186
            ],
            [
                17138,
                17142
            ],
            [
                17189,
                17192
            ],
            [
                17192,
                17234
            ],
            [
                17234,
                17259
            ],
            [
                17259,
                17265
            ],
            [
                17272,
                17296
            ],
            [
                17310,
                17389
            ],
            [
                17391,
                17409
            ],
            [
                17451,
                17453
            ],
            [
                17453,
                17494
            ],
            [
                17504,
                17539
            ],
            [
                17539,
                17547
            ],
            [
                17577,
                17584
            ],
            [
                17602,
                17603
            ],
            [
                17586,
                17587
            ],
            [
                17604,
                17638
            ],
            [
                17638,
                17670
            ],
            [
                17670,
                17671
            ],
            [
                17676,
                17699
            ],
            [
                17780,
                17799
            ],
            [
                17820,
                17837
            ],
            [
                17862,
                17864
            ],
            [
                17864,
                17925
            ],
            [
                17956,
                17962
            ],
            [
                17933,
                17955
            ],
            [
                17966,
                17967
            ],
            [
                17972,
                17989
            ],
            [
                17995,
                18010
            ],
            [
                18010,
                18020
            ],
            [
                18025,
                18078
            ],
            [
                18078,
                18143
            ],
            [
                18143,
                18154
            ],
            [
                18188,
                18194
            ],
            [
                18199,
                18206
            ],
            [
                18195,
                18198
            ],
            [
                18169,
                18173
            ],
            [
                18206,
                18208
            ],
            [
                18220,
                18256
            ],
            [
                18277,
                18280
            ],
            [
                18280,
                18400
            ],
            [
                18400,
                18424
            ],
            [
                18486,
                18553
            ],
            [
                18553,
                18558
            ],
            [
                18564,
                18586
            ],
            [
                18657,
                18660
            ],
            [
                18599,
                18612
            ],
            [
                18638,
                18653
            ],
            [
                18665,
                18687
            ],
            [
                18688,
                18701
            ],
            [
                18707,
                18709
            ],
            [
                18709,
                18716
            ],
            [
                18731,
                18735
            ],
            [
                18721,
                18727
            ],
            [
                18735,
                18740
            ],
            [
                18751,
                18754
            ],
            [
                18760,
                18763
            ],
            [
                18717,
                18720
            ],
            [
                18780,
                18805
            ],
            [
                18805,
                18831
            ],
            [
                18843,
                18875
            ],
            [
                18888,
                18890
            ],
            [
                18890,
                18898
            ],
            [
                18903,
                18926
            ],
            [
                18942,
                19045
            ],
            [
                19046,
                19049
            ],
            [
                19055,
                19112
            ],
            [
                19122,
                19124
            ],
            [
                19133,
                19135
            ],
            [
                19136,
                19139
            ],
            [
                19177,
                19183
            ],
            [
                19192,
                19194
            ],
            [
                19194,
                19210
            ],
            [
                19232,
                19262
            ],
            [
                19285,
                19328
            ],
            [
                19333,
                19349
            ],
            [
                19349,
                19386
            ],
            [
                19386,
                19387
            ],
            [
                19452,
                19456
            ],
            [
                19471,
                19494
            ],
            [
                19496,
                19526
            ],
            [
                19589,
                19616
            ],
            [
                19616,
                19627
            ],
            [
                19630,
                19656
            ],
            [
                19659,
                19687
            ],
            [
                19687,
                19742
            ],
            [
                19748,
                19762
            ],
            [
                19762,
                19810
            ],
            [
                19814,
                19849
            ],
            [
                19849,
                19857
            ],
            [
                19912,
                19914
            ],
            [
                19914,
                19924
            ],
            [
                19924,
                19926
            ],
            [
                19929,
                19967
            ],
            [
                19967,
                19997
            ],
            [
                20028,
                20043
            ],
            [
                20054,
                20057
            ],
            [
                20096,
                20101
            ],
            [
                20101,
                20107
            ],
            [
                20118,
                20119
            ],
            [
                20121,
                20141
            ],
            [
                20224,
                20265
            ],
            [
                20451,
                20505
            ],
            [
                20505,
                20560
            ],
            [
                20560,
                20603
            ],
            [
                20603,
                20656
            ],
            [
                20656,
                20667
            ],
            [
                20678,
                20681
            ],
            [
                20701,
                20720
            ],
            [
                20720,
                20768
            ],
            [
                20794,
                20892
            ],
            [
                20892,
                20907
            ],
            [
                20907,
                20936
            ],
            [
                20940,
                20993
            ],
            [
                21095,
                21098
            ],
            [
                21098,
                21134
            ],
            [
                21134,
                21150
            ],
            [
                21154,
                21156
            ],
            [
                21212,
                21255
            ],
            [
                21286,
                21289
            ],
            [
                21289,
                21298
            ],
            [
                21300,
                21318
            ],
            [
                21322,
                21340
            ],
            [
                21348,
                21369
            ],
            [
                21416,
                21424
            ],
            [
                21458,
                21490
            ],
            [
                21490,
                21499
            ],
            [
                21505,
                21527
            ],
            [
                21527,
                21563
            ],
            [
                21563,
                21597
            ],
            [
                21597,
                21620
            ],
            [
                21620,
                21661
            ],
            [
                21727,
                21778
            ],
            [
                21778,
                21793
            ],
            [
                21810,
                21832
            ],
            [
                21832,
                21872
            ],
            [
                21872,
                21922
            ],
            [
                21922,
                21973
            ],
            [
                21975,
                21991
            ],
            [
                21991,
                22021
            ],
            [
                22059,
                22061
            ],
            [
                22075,
                22104
            ],
            [
                22110,
                22142
            ],
            [
                22240,
                22279
            ],
            [
                22279,
                22282
            ],
            [
                22322,
                22325
            ],
            [
                22325,
                22346
            ],
            [
                22346,
                22350
            ],
            [
                22379,
                22381
            ],
            [
                22382,
                22404
            ],
            [
                22467,
                22480
            ],
            [
                22520,
                22523
            ],
            [
                22539,
                22541
            ],
            [
                22588,
                22591
            ],
            [
                22636,
                22660
            ],
            [
                22673,
                22694
            ],
            [
                22808,
                22811
            ],
            [
                22624,
                22626
            ],
            [
                22812,
                22829
            ]
        ],
        "row_chars": [
            [
                0,
                166
            ],
            [
                166,
                285
            ],
            [
                285,
                526
            ],
            [
                526,
                1075
            ],
            [
                1075,
                1136
            ],
            [
                1136,
                1488
            ],
            [
                1488,
                1570
            ],
            [
                1570,
                1821
            ],
            [
                1821,
                1876
            ],
            [
                1876,
                2083
            ],
            [
                2083,
                2700
            ],
            [
                2700,
                2775
            ],
            [
                2775,
                2885
            ],
            [
                2885,
                2923
            ],
            [
                2923,
                3014
            ],
            [
                3014,
                3076
            ],
            [
                3076,
                3147
            ],
            [
                3147,
                3263
            ],
            [
                3263,
                3742
            ],
            [
                3742,
                3942
            ],
            [
                3942,
                4013
            ],
            [
                4013,
                4130
            ],
            [
                4130,
                4284
            ],
            [
                4284,
                4369
            ],
            [
                4369,
                4517
            ],
            [
                4517,
                4569
            ],
            [
                4569,
                4788
            ],
            [
                4788,
                4820
            ],
            [
                4820,
                5061
            ],
            [
                5061,
                5090
            ],
            [
                5090,
                5202
            ],
            [
                5202,
                5307
            ],
            [
                5307,
                5378
            ],
            [
                5378,
                5448
            ],
            [
                5448,
                5598
            ],
            [
                5598,
                5694
            ],
            [
                5694,
                5740
            ],
            [
                5740,
                5829
            ],
            [
                5829,
                6026
            ],
            [
                6026,
                6111
            ],
            [
                6111,
                6245
            ],
            [
                6245,
                6371
            ],
            [
                6371,
                6552
            ],
            [
                6552,
                6758
            ],
            [
                6758,
                7104
            ],
            [
                7104,
                7109
            ],
            [
                7109,
                7114
            ],
            [
                7114,
                7224
            ],
            [
                7224,
                7229
            ],
            [
                7229,
                7366
            ],
            [
                7366,
                7643
            ],
            [
                7643,
                7656
            ],
            [
                7656,
                7674
            ],
            [
                7674,
                7705
            ],
            [
                7705,
                7843
            ],
            [
                7843,
                7919
            ],
            [
                7919,
                7993
            ],
            [
                7993,
                8127
            ],
            [
                8127,
                8196
            ],
            [
                8196,
                8294
            ],
            [
                8294,
                8376
            ],
            [
                8376,
                8395
            ],
            [
                8395,
                8415
            ],
            [
                8415,
                8548
            ],
            [
                8548,
                8643
            ],
            [
                8643,
                8824
            ],
            [
                8824,
                8835
            ],
            [
                8835,
                8891
            ],
            [
                8891,
                8915
            ],
            [
                8915,
                8947
            ],
            [
                8947,
                9111
            ],
            [
                9111,
                9237
            ],
            [
                9237,
                9379
            ],
            [
                9379,
                9507
            ],
            [
                9507,
                9618
            ],
            [
                9618,
                9693
            ],
            [
                9693,
                9708
            ],
            [
                9708,
                9717
            ],
            [
                9717,
                9784
            ],
            [
                9784,
                9849
            ],
            [
                9849,
                9864
            ],
            [
                9864,
                9924
            ],
            [
                9924,
                9957
            ],
            [
                9957,
                9971
            ],
            [
                9971,
                9992
            ],
            [
                9992,
                10144
            ],
            [
                10144,
                10205
            ],
            [
                10205,
                10320
            ],
            [
                10320,
                10562
            ],
            [
                10562,
                10726
            ],
            [
                10726,
                10812
            ],
            [
                10812,
                10869
            ],
            [
                10869,
                10926
            ],
            [
                10926,
                10983
            ],
            [
                10983,
                11186
            ],
            [
                11186,
                11278
            ],
            [
                11278,
                11458
            ],
            [
                11458,
                11588
            ],
            [
                11588,
                11691
            ],
            [
                11691,
                11725
            ],
            [
                11725,
                11817
            ],
            [
                11817,
                11952
            ],
            [
                11952,
                11991
            ],
            [
                11991,
                12140
            ],
            [
                12140,
                12350
            ],
            [
                12350,
                12504
            ],
            [
                12504,
                13076
            ],
            [
                13076,
                13232
            ],
            [
                13232,
                13583
            ],
            [
                13583,
                13645
            ],
            [
                13645,
                13932
            ],
            [
                13932,
                14083
            ],
            [
                14083,
                14173
            ],
            [
                14173,
                14223
            ],
            [
                14223,
                14303
            ],
            [
                14303,
                14458
            ],
            [
                14458,
                14487
            ],
            [
                14487,
                14658
            ],
            [
                14658,
                14733
            ],
            [
                14733,
                14971
            ],
            [
                14971,
                15060
            ],
            [
                15060,
                15191
            ],
            [
                15191,
                15254
            ],
            [
                15254,
                15324
            ],
            [
                15324,
                15368
            ],
            [
                15368,
                15399
            ],
            [
                15399,
                15439
            ],
            [
                15439,
                15484
            ],
            [
                15484,
                15493
            ],
            [
                15493,
                15505
            ],
            [
                15505,
                15526
            ],
            [
                15526,
                15547
            ],
            [
                15547,
                15575
            ],
            [
                15575,
                15622
            ],
            [
                15622,
                15641
            ],
            [
                15641,
                15672
            ],
            [
                15672,
                15781
            ],
            [
                15781,
                15838
            ],
            [
                15838,
                15890
            ],
            [
                15890,
                15972
            ],
            [
                15972,
                16027
            ],
            [
                16027,
                16084
            ],
            [
                16084,
                16165
            ],
            [
                16165,
                16251
            ],
            [
                16251,
                16283
            ],
            [
                16283,
                16321
            ],
            [
                16321,
                16350
            ],
            [
                16350,
                16390
            ],
            [
                16390,
                16445
            ],
            [
                16445,
                16529
            ],
            [
                16529,
                16541
            ],
            [
                16541,
                16551
            ],
            [
                16551,
                16611
            ],
            [
                16611,
                16634
            ],
            [
                16634,
                16721
            ],
            [
                16721,
                16740
            ],
            [
                16740,
                16812
            ],
            [
                16812,
                16843
            ],
            [
                16843,
                16950
            ],
            [
                16950,
                17048
            ],
            [
                17048,
                17124
            ],
            [
                17124,
                17192
            ],
            [
                17192,
                17234
            ],
            [
                17234,
                17259
            ],
            [
                17259,
                17296
            ],
            [
                17296,
                17453
            ],
            [
                17453,
                17539
            ],
            [
                17539,
                17638
            ],
            [
                17638,
                17670
            ],
            [
                17670,
                17701
            ],
            [
                17701,
                17780
            ],
            [
                17780,
                17864
            ],
            [
                17864,
                17925
            ],
            [
                17925,
                18010
            ],
            [
                18010,
                18078
            ],
            [
                18078,
                18143
            ],
            [
                18143,
                18154
            ],
            [
                18154,
                18208
            ],
            [
                18208,
                18280
            ],
            [
                18280,
                18400
            ],
            [
                18400,
                18553
            ],
            [
                18553,
                18709
            ],
            [
                18709,
                18805
            ],
            [
                18805,
                18890
            ],
            [
                18890,
                19046
            ],
            [
                19046,
                19112
            ],
            [
                19112,
                19194
            ],
            [
                19194,
                19333
            ],
            [
                19333,
                19349
            ],
            [
                19349,
                19386
            ],
            [
                19386,
                19496
            ],
            [
                19496,
                19616
            ],
            [
                19616,
                19687
            ],
            [
                19687,
                19762
            ],
            [
                19762,
                19814
            ],
            [
                19814,
                19849
            ],
            [
                19849,
                19914
            ],
            [
                19914,
                19924
            ],
            [
                19924,
                19967
            ],
            [
                19967,
                19997
            ],
            [
                19997,
                20057
            ],
            [
                20057,
                20096
            ],
            [
                20096,
                20101
            ],
            [
                20101,
                20141
            ],
            [
                20141,
                20161
            ],
            [
                20161,
                20202
            ],
            [
                20202,
                20224
            ],
            [
                20224,
                20265
            ],
            [
                20265,
                20296
            ],
            [
                20296,
                20391
            ],
            [
                20391,
                20451
            ],
            [
                20451,
                20505
            ],
            [
                20505,
                20560
            ],
            [
                20560,
                20603
            ],
            [
                20603,
                20656
            ],
            [
                20656,
                20668
            ],
            [
                20668,
                20678
            ],
            [
                20678,
                20720
            ],
            [
                20720,
                20768
            ],
            [
                20768,
                20892
            ],
            [
                20892,
                20907
            ],
            [
                20907,
                20940
            ],
            [
                20940,
                21098
            ],
            [
                21098,
                21134
            ],
            [
                21134,
                21289
            ],
            [
                21289,
                21490
            ],
            [
                21490,
                21527
            ],
            [
                21527,
                21563
            ],
            [
                21563,
                21597
            ],
            [
                21597,
                21620
            ],
            [
                21620,
                21661
            ],
            [
                21661,
                21727
            ],
            [
                21727,
                21778
            ],
            [
                21778,
                21832
            ],
            [
                21832,
                21872
            ],
            [
                21872,
                21922
            ],
            [
                21922,
                21991
            ],
            [
                21991,
                22061
            ],
            [
                22061,
                22144
            ],
            [
                22144,
                22240
            ],
            [
                22240,
                22279
            ],
            [
                22279,
                22325
            ],
            [
                22325,
                22346
            ],
            [
                22346,
                22382
            ],
            [
                22382,
                22467
            ],
            [
                22467,
                22541
            ],
            [
                22541,
                22588
            ],
            [
                22588,
                22829
            ]
        ]
    },
    "abridged": {
        "text": "We must go back for a few pages to scenes which happened in London during the summer, before Mr. Grey went to Lucerne. He had another quarrel with George Vavasor.\nVavasor lost his election for the Chelsea Districts despite all the money he had spent. Out of the bills which Alice had signed, he had paid one thousand pounds at once to Mr. Scruby, towards the expenses of his election; and when the polling day arrived he had in his hands five hundred pounds. Where he was to get more when this was gone, he did not know. If he were successful, then he would be grandly indifferent to any debts. There might be pickings in the way of a Member of Parliament of his calibre. Companies would be glad to have him as a director, paying a guinea a day, or perhaps more, for his hour's attendance; and in the City he might turn that \"M.P.\" to good account in various ways.\nBut what was he to do if he lost the election? No sooner had Mr. Scruby got the thousand pounds than he pressed for still more money, insisting that eight hundred would make the thing quite secure. But Vavasor swore to himself that he would not part with another shilling.\n\"It's no use,\" he said to Mr. Scruby. \"I cannot make another payment before the election.\" Mr. Scruby shrugged his shoulders, and said that he would do his best. But George Vavasor soon knew that the man was not doing his best - that the man had, in truth, abandoned his cause. The landlord of the Handsome Man jeered when he went there canvassing, and Vavasor knew that his chance was gone. Mr. Scruby would be absent when he called. It was easy to see that Mr. Scruby no longer regarded him as a successful man, and the day of the poll showed very plainly how right Mr. Scruby had been.\nGeorge Vavasor was rejected, but he still had his five hundred pounds in his pocket, if little or nothing else that he could call his own. What was he to do with himself?\nAfter pledging to stand again at the next election, he went home to his lodgings in Cecil Street, and tried to consider calmly his position in the world. He had lost his inheritance. He had abandoned one profession after another. His ambition had betrayed him, and he had no more hopes of politics. He had estranged from himself every friend that he possessed. He had driven from him with violence even his devoted sister. He had robbed the girl whom he intended to marry, and had so insulted her that affection between them was impossible. He thought over it all with outer calmness, as he sat there in his arm-chair.\nFrom the moment in which he had first realised that the election would go against him, he had resolved that he would be calm amidst his ruin. Sometimes he assumed a little smile, as though he were laughing at his own position. Mr. Bott's day of rejection had come before his own, and he had written Mr. Bott a droll note of consolation and mock sympathy. To all who accosted him, he replied in a bantering tone.\nAnd now, as he sat down to consider his future, he smiled in the same way, though there was no one there to see the smile. He even jumped up and laughed audibly, as he tried to persuade himself that he regarded the world and all that belonged to it as a bubble.\nBut suddenly there was a change, and his eyes became fierce, and the scar that marred his face grew red and ghastly. He showed his teeth and clenched his fists within his pockets.\n\"Curse him!\" he said out loud. \"Curse him, now and for ever!\" He was thinking of that old man who had opposed him during his life, and had ruined him at his death. His assumed tranquillity deserted him. He kicked a chair; then he took the chair in his hands, and threw it across the room. What should he do? Where should he go? From where might he find comfort to support him?\nVavasor turned to a bottle of brandy which stood near, half filled a tumbler, and swallowed it greedily. \"By --!\" he said, \"I believe it is the best thing a man can do.\"\nThen he went to a high desk in one corner of the room, and unlocking it, took out a revolver. He turned it over, and tried the lock, and snapped it without caps, to see that the barrel went round fairly.\n\"It's a beggarly thing to do,\" he said, and put the pistol down again. \"If I do it, I'll use it first for another purpose.\" Then he poured himself more brandy-and-water, and having drunk it, he threw himself upon the sofa, and seemed to sleep.\nBut he did not sleep, and by-and-by there came a slight knock at the door.\n\"Who's there?\" he said. Then the door handle turned. But the door had been locked. \"Who's there?\" he asked again, in a loud, angry voice.\n\"It is I,\" said a woman's voice.\n\"D--ation!\" said George Vavasor.\nThe woman heard him, but she simply remained standing where she was. She knew the man well, and knew that she must wait. She was very patient - and for the time was meek, though it might be that there would come an end to her meekness. Vavasor, lying on the sofa, had another idea flash across his mind about the pistol. Why should he let the intruder in, and have a disagreeable interview, if the end of all things might save him from such trouble?\nThere he lay for ten minutes thinking, and then the low single knock was heard again. He jumped to his feet, with his eyes full of fire. He knew that it was useless to bid her go. She would sit there all night. Should he open the door and strangle her, and go out with the pistol and never come back any more?\nHe walked gently up to the door, and undid the lock. Then he walked back to the sofa and threw himself on it again. As he did so, he passed his hand across the table to pull the pistol nearer.\nThe woman paused a moment, and then she made her way into the room. He did not speak. She closed the door very gently, and came up to the foot of the sofa. As he still said nothing, but lay there looking at her, she was the first to speak.\n\"George,\" she said, \"what am I to do?\"\nShe was a woman of about thirty, dressed poorly in old garments, but still with decency, and with some attempt at prettiness. There were faded flowers in her bonnet. She had long black ringlets on each cheek, which to some degree hid the hollowness of her jaws. Her eyes had a peculiar brightness, and her face was delicate; and in the days when things had gone well with her, she had possessed a soft and mirthful grace. All the softness which remained was that softness which continual sadness gives to suffering women.\nShe wore a light shawl over her shabby dress. When she had left her home this afternoon, she had struggled hard to dress herself so that some charm might be left to her; but she had known her own failure at every point. With long tedious care she had mended her old gloves. She had carefully hidden the rags of her sleeves. She had washed her little shrivelled collar, and had smoothed it out painfully. It had been a grief to her that she could find no cuffs to put round her wrists; and yet she knew that cuffs could not have helped her. Nothing could help her now. She expected nothing from her visit; yet she had come forth anxiously.\n\"George,\" she said, \"what am I to do?\"\nAs he lay there, he saw and appreciated the little struggles she had made to create some reminiscence of her former self. He saw the shining coarseness of the long ringlets which had once been softer than silk. He saw the sixpenny brooch on her bosom where he had once placed a jewel. He saw it all and lay there for a while, silently reading it.\n\"Don't let me stand here,\" she said, \"without speaking a word to me.\"\n\"I don't want you to stand there,\" he said.\n\"I know that. I know you don't want to see me ever again.\"\n\"Never.\"\n\"Of course I know it. But what am I to do? Where am I to go for money? Even you would not wish that I should starve?\"\n\"I would not wish it. I should be delighted to hear that you had plenty to eat and drink, and plenty of clothes to wear. I believe that's what you care for the most, after all.\"\n\"It was only for your sake - because you liked it.\"\n\"Well; I did like it; but that has come to an end, as have all my other likings. You know very well that I can do nothing more for you. What good do you do by coming here to annoy me? Have I not told you over and over again never to come here?\"\n\"Where else was I to find you?\"\n\"I don't want you to find me. I shall not give you a penny. When I put you into business I told you that we were to see no more of each other.\"\n\"Business!\" she said. \"I could never make enough out of the shop to feed a bird.\"\n\"That wasn't my fault. Putting you there cost me over a hundred pounds, and you consented to it.\"\n\"I didn't consent. I was obliged to go there because you took my home away from me.\"\n\"Have it as you like, my dear. That was all I could do for you; and more than most men would have done.\" Then he got up from the sofa, and stood on the hearthrug. \"At any rate, Jane, I shall do nothing more. You shall get nothing by coming here.\"\n\"I have come here because I am starving.\"\n\"I have nothing for you. Now go.\" He pointed to the door. For more than three years of his life this woman had been his closest companion and his nearest friend. He had loved her according to his fashion, and certainly she had loved him. \"Go,\" he repeated angrily, \"or it will be the worse for you.\"\n\"Will you give me a sovereign?\"\n\"I will give you nothing.\"\n\"Then I will not go.\" She down upon a chair. \"I will not go till you have given me something to buy food. If you put me out of the room, I will lie at the top of the stairs. And if you put me out of the house, I will sit upon the door-step.\"\n\"If you play that game, my poor girl, the police will take you.\"\n\"Let them. I care nothing for that. I will not go till you give me money.\"\nAnd for this she had dressed herself with so much care, mending her gloves, and darning her little fragments of finery! He stood looking at her, and thinking what he had better do to rid himself of her presence. If he quite resolved to take his final journey with the pistol's aid, why should he not go out and leave her here? Or, for that matter, why not give her the remainder of his wealth? What he still had left was enough to place her in a seventh heaven. He cared little for her, and was angry with her; but there was no one for whom he cared more, and no friend with whom he was less angry.\nBut his mind was not quite made up as to that final journey. So he wanted to get rid of her.\n\"Jane,\" he said, with that assumed tranquillity, \"you talk of starving and of being ruined.\"\n\"I am starving. I have not a shilling in the world.\"\n\"I am as badly off as you are. I won't say that I am starving; but I am utterly ruined. My property - what should have been mine - has been left away from me. I have lost the trumpery seat in Parliament for which I paid so much. All my relations have turned their backs upon me-\"\n\"Are you not going to be married?\" she said.\n\"Married! No - but I am going to blow my brains out. Look at that pistol, my girl. I am in earnest.\"\n\"Oh! George, you won't do that?\"\n\"There is nothing else left for me to do. You and I, Jane, have not played our cards very well. We have staked all that we had, and we've been beaten. It's no good whimpering after what's lost. We'd better go somewhere else and begin a new game.\"\n\"Go where?\"\n\"Ah! - I can't tell you.\"\n\"George,\" she said, \"I'll go anywhere with you. If you're not going to be married, and will let me come to you, I will work for you like a slave. I will indeed. I know I'm poorly looking now-\"\n\"My girl, where I'm going, I shall not want any slave.\"\n\"But, George, where are you going?\"\n\"Wherever people go when they have knocked out their own brains.\"\n\"George,\" - she came up to him, and took hold of the front of his coat - \"George, say that you will not do that!\"\n\"But I am saying that I shall.\"\n\"Are you not afraid of God's anger? You and I have been very wicked.\"\n\"I have, my poor girl. I don't know much about your wickedness. But what's the good of whimpering when it's over?\"\n\"It isn't over; at any rate for you.\"\n\"I wish I knew how I could begin again. But all this is nonsense, Jane, and you must go.\"\n\"You must tell me, first, that you are not going to kill yourself.\"\n\"I don't suppose I shall do it tonight. I may allow myself a week, so your staying here can do no good.\"\n\"And you are not going to be married?\"\n\"No.\"\n\"And I must go now?\"\n\"Yes.\"\nThen she rose and went. His bantering manner had worked. She felt that his threats of self-destruction were probably unreal; and she was persuaded to go away in peace.",
        "paragraph_chars": [
            [
                0,
                163
            ],
            [
                163,
                865
            ],
            [
                865,
                1138
            ],
            [
                1138,
                1727
            ],
            [
                1727,
                1898
            ],
            [
                1898,
                2517
            ],
            [
                2517,
                2929
            ],
            [
                2929,
                3191
            ],
            [
                3191,
                3371
            ],
            [
                3371,
                3748
            ],
            [
                3748,
                3918
            ],
            [
                3918,
                4122
            ],
            [
                4122,
                4366
            ],
            [
                4366,
                4441
            ],
            [
                4441,
                4579
            ],
            [
                4579,
                4612
            ],
            [
                4612,
                4645
            ],
            [
                4645,
                5095
            ],
            [
                5095,
                5405
            ],
            [
                5405,
                5598
            ],
            [
                5598,
                5838
            ],
            [
                5838,
                5877
            ],
            [
                5877,
                6399
            ],
            [
                6399,
                7038
            ],
            [
                7038,
                7077
            ],
            [
                7077,
                7424
            ],
            [
                7424,
                7494
            ],
            [
                7494,
                7538
            ],
            [
                7538,
                7597
            ],
            [
                7597,
                7606
            ],
            [
                7606,
                7724
            ],
            [
                7724,
                7902
            ],
            [
                7902,
                7954
            ],
            [
                7954,
                8199
            ],
            [
                8199,
                8231
            ],
            [
                8231,
                8375
            ],
            [
                8375,
                8457
            ],
            [
                8457,
                8555
            ],
            [
                8555,
                8640
            ],
            [
                8640,
                8887
            ],
            [
                8887,
                8929
            ],
            [
                8929,
                9229
            ],
            [
                9229,
                9261
            ],
            [
                9261,
                9288
            ],
            [
                9288,
                9530
            ],
            [
                9530,
                9595
            ],
            [
                9595,
                9670
            ],
            [
                9670,
                10269
            ],
            [
                10269,
                10362
            ],
            [
                10362,
                10455
            ],
            [
                10455,
                10508
            ],
            [
                10508,
                10788
            ],
            [
                10788,
                10833
            ],
            [
                10833,
                10934
            ],
            [
                10934,
                10967
            ],
            [
                10967,
                11214
            ],
            [
                11214,
                11226
            ],
            [
                11226,
                11252
            ],
            [
                11252,
                11445
            ],
            [
                11445,
                11501
            ],
            [
                11501,
                11537
            ],
            [
                11537,
                11603
            ],
            [
                11603,
                11717
            ],
            [
                11717,
                11749
            ],
            [
                11749,
                11819
            ],
            [
                11819,
                11934
            ],
            [
                11934,
                11972
            ],
            [
                11972,
                12062
            ],
            [
                12062,
                12130
            ],
            [
                12130,
                12235
            ],
            [
                12235,
                12274
            ],
            [
                12274,
                12280
            ],
            [
                12280,
                12301
            ],
            [
                12301,
                12308
            ],
            [
                12308,
                12475
            ]
        ],
        "segment_chars": [
            [
                0,
                119
            ],
            [
                119,
                163
            ],
            [
                163,
                251
            ],
            [
                251,
                459
            ],
            [
                459,
                521
            ],
            [
                521,
                595
            ],
            [
                595,
                672
            ],
            [
                672,
                832
            ],
            [
                832,
                865
            ],
            [
                865,
                912
            ],
            [
                912,
                1063
            ],
            [
                1063,
                1138
            ],
            [
                1138,
                1176
            ],
            [
                1176,
                1229
            ],
            [
                1229,
                1300
            ],
            [
                1300,
                1416
            ],
            [
                1416,
                1530
            ],
            [
                1530,
                1573
            ],
            [
                1573,
                1727
            ],
            [
                1727,
                1866
            ],
            [
                1866,
                1898
            ],
            [
                1898,
                2052
            ],
            [
                2052,
                2081
            ],
            [
                2081,
                2128
            ],
            [
                2128,
                2197
            ],
            [
                2197,
                2259
            ],
            [
                2259,
                2321
            ],
            [
                2321,
                2439
            ],
            [
                2439,
                2517
            ],
            [
                2517,
                2659
            ],
            [
                2659,
                2744
            ],
            [
                2744,
                2872
            ],
            [
                2872,
                2929
            ],
            [
                2929,
                3052
            ],
            [
                3052,
                3191
            ],
            [
                3191,
                3308
            ],
            [
                3308,
                3371
            ],
            [
                3371,
                3384
            ],
            [
                3384,
                3402
            ],
            [
                3402,
                3433
            ],
            [
                3433,
                3535
            ],
            [
                3535,
                3574
            ],
            [
                3574,
                3660
            ],
            [
                3660,
                3679
            ],
            [
                3679,
                3699
            ],
            [
                3699,
                3748
            ],
            [
                3748,
                3853
            ],
            [
                3853,
                3862
            ],
            [
                3862,
                3918
            ],
            [
                3918,
                4012
            ],
            [
                4012,
                4122
            ],
            [
                4122,
                4193
            ],
            [
                4193,
                4246
            ],
            [
                4246,
                4366
            ],
            [
                4366,
                4441
            ],
            [
                4441,
                4456
            ],
            [
                4456,
                4465
            ],
            [
                4465,
                4494
            ],
            [
                4494,
                4524
            ],
            [
                4524,
                4539
            ],
            [
                4539,
                4579
            ],
            [
                4579,
                4612
            ],
            [
                4612,
                4624
            ],
            [
                4624,
                4645
            ],
            [
                4645,
                4714
            ],
            [
                4714,
                4766
            ],
            [
                4766,
                4881
            ],
            [
                4881,
                4966
            ],
            [
                4966,
                5095
            ],
            [
                5095,
                5181
            ],
            [
                5181,
                5232
            ],
            [
                5232,
                5275
            ],
            [
                5275,
                5306
            ],
            [
                5306,
                5405
            ],
            [
                5405,
                5458
            ],
            [
                5458,
                5521
            ],
            [
                5521,
                5598
            ],
            [
                5598,
                5666
            ],
            [
                5666,
                5684
            ],
            [
                5684,
                5754
            ],
            [
                5754,
                5838
            ],
            [
                5838,
                5877
            ],
            [
                5877,
                6003
            ],
            [
                6003,
                6043
            ],
            [
                6043,
                6139
            ],
            [
                6139,
                6299
            ],
            [
                6299,
                6399
            ],
            [
                6399,
                6445
            ],
            [
                6445,
                6619
            ],
            [
                6619,
                6673
            ],
            [
                6673,
                6723
            ],
            [
                6723,
                6803
            ],
            [
                6803,
                6939
            ],
            [
                6939,
                6967
            ],
            [
                6967,
                7038
            ],
            [
                7038,
                7077
            ],
            [
                7077,
                7199
            ],
            [
                7199,
                7288
            ],
            [
                7288,
                7362
            ],
            [
                7362,
                7424
            ],
            [
                7424,
                7494
            ],
            [
                7494,
                7538
            ],
            [
                7538,
                7552
            ],
            [
                7552,
                7597
            ],
            [
                7597,
                7606
            ],
            [
                7606,
                7628
            ],
            [
                7628,
                7649
            ],
            [
                7649,
                7677
            ],
            [
                7677,
                7724
            ],
            [
                7724,
                7746
            ],
            [
                7746,
                7845
            ],
            [
                7845,
                7902
            ],
            [
                7902,
                7954
            ],
            [
                7954,
                8035
            ],
            [
                8035,
                8090
            ],
            [
                8090,
                8138
            ],
            [
                8138,
                8199
            ],
            [
                8199,
                8231
            ],
            [
                8231,
                8261
            ],
            [
                8261,
                8291
            ],
            [
                8291,
                8375
            ],
            [
                8375,
                8387
            ],
            [
                8387,
                8397
            ],
            [
                8397,
                8457
            ],
            [
                8457,
                8480
            ],
            [
                8480,
                8555
            ],
            [
                8555,
                8574
            ],
            [
                8574,
                8640
            ],
            [
                8640,
                8671
            ],
            [
                8671,
                8745
            ],
            [
                8745,
                8803
            ],
            [
                8803,
                8848
            ],
            [
                8848,
                8887
            ],
            [
                8887,
                8929
            ],
            [
                8929,
                8954
            ],
            [
                8954,
                8963
            ],
            [
                8963,
                8987
            ],
            [
                8987,
                9091
            ],
            [
                9091,
                9167
            ],
            [
                9167,
                9229
            ],
            [
                9229,
                9261
            ],
            [
                9261,
                9288
            ],
            [
                9288,
                9310
            ],
            [
                9310,
                9333
            ],
            [
                9333,
                9394
            ],
            [
                9394,
                9462
            ],
            [
                9462,
                9530
            ],
            [
                9530,
                9595
            ],
            [
                9595,
                9606
            ],
            [
                9606,
                9631
            ],
            [
                9631,
                9670
            ],
            [
                9670,
                9790
            ],
            [
                9790,
                9882
            ],
            [
                9882,
                9997
            ],
            [
                9997,
                10064
            ],
            [
                10064,
                10132
            ],
            [
                10132,
                10269
            ],
            [
                10269,
                10330
            ],
            [
                10330,
                10362
            ],
            [
                10362,
                10455
            ],
            [
                10455,
                10471
            ],
            [
                10471,
                10508
            ],
            [
                10508,
                10539
            ],
            [
                10539,
                10596
            ],
            [
                10596,
                10667
            ],
            [
                10667,
                10737
            ],
            [
                10737,
                10788
            ],
            [
                10788,
                10823
            ],
            [
                10823,
                10833
            ],
            [
                10833,
                10843
            ],
            [
                10843,
                10886
            ],
            [
                10886,
                10916
            ],
            [
                10916,
                10934
            ],
            [
                10934,
                10939
            ],
            [
                10939,
                10967
            ],
            [
                10967,
                11009
            ],
            [
                11009,
                11063
            ],
            [
                11063,
                11118
            ],
            [
                11118,
                11161
            ],
            [
                11161,
                11214
            ],
            [
                11214,
                11226
            ],
            [
                11226,
                11231
            ],
            [
                11231,
                11252
            ],
            [
                11252,
                11300
            ],
            [
                11300,
                11398
            ],
            [
                11398,
                11413
            ],
            [
                11413,
                11445
            ],
            [
                11445,
                11501
            ],
            [
                11501,
                11537
            ],
            [
                11537,
                11603
            ],
            [
                11603,
                11717
            ],
            [
                11717,
                11749
            ],
            [
                11749,
                11785
            ],
            [
                11785,
                11819
            ],
            [
                11819,
                11842
            ],
            [
                11842,
                11883
            ],
            [
                11883,
                11934
            ],
            [
                11934,
                11972
            ],
            [
                11972,
                12012
            ],
            [
                12012,
                12062
            ],
            [
                12062,
                12130
            ],
            [
                12130,
                12170
            ],
            [
                12170,
                12235
            ],
            [
                12235,
                12274
            ],
            [
                12274,
                12280
            ],
            [
                12280,
                12301
            ],
            [
                12301,
                12308
            ],
            [
                12308,
                12332
            ],
            [
                12332,
                12365
            ],
            [
                12365,
                12475
            ]
        ],
        "overlap_chars": [
            [
                0,
                73
            ],
            [
                74,
                77
            ],
            [
                78,
                85
            ],
            [
                93,
                101
            ],
            [
                110,
                119
            ],
            [
                119,
                125
            ],
            [
                126,
                161
            ],
            [
                161,
                163
            ],
            [
                163,
                214
            ],
            [
                223,
                236
            ],
            [
                237,
                249
            ],
            [
                251,
                257
            ],
            [
                258,
                283
            ],
            [
                290,
                291
            ],
            [
                292,
                303
            ],
            [
                304,
                323
            ],
            [
                324,
                331
            ],
            [
                332,
                334
            ],
            [
                335,
                345
            ],
            [
                345,
                397
            ],
            [
                398,
                405
            ],
            [
                406,
                409
            ],
            [
                410,
                417
            ],
            [
                418,
                424
            ],
            [
                425,
                437
            ],
            [
                438,
                459
            ],
            [
                459,
                502
            ],
            [
                504,
                521
            ],
            [
                521,
                543
            ],
            [
                549,
                587
            ],
            [
                588,
                593
            ],
            [
                593,
                595
            ],
            [
                595,
                672
            ],
            [
                672,
                681
            ],
            [
                682,
                729
            ],
            [
                730,
                788
            ],
            [
                788,
                832
            ],
            [
                832,
                864
            ],
            [
                865,
                892
            ],
            [
                898,
                901
            ],
            [
                910,
                912
            ],
            [
                912,
                960
            ],
            [
                961,
                997
            ],
            [
                997,
                998
            ],
            [
                1009,
                1013
            ],
            [
                1014,
                1027
            ],
            [
                1028,
                1063
            ],
            [
                1063,
                1137
            ],
            [
                1138,
                1176
            ],
            [
                1177,
                1229
            ],
            [
                1229,
                1300
            ],
            [
                1300,
                1364
            ],
            [
                1367,
                1416
            ],
            [
                1416,
                1435
            ],
            [
                1445,
                1448
            ],
            [
                1449,
                1455
            ],
            [
                1456,
                1485
            ],
            [
                1485,
                1490
            ],
            [
                1491,
                1530
            ],
            [
                1530,
                1540
            ],
            [
                1541,
                1561
            ],
            [
                1562,
                1564
            ],
            [
                1565,
                1571
            ],
            [
                1571,
                1573
            ],
            [
                1573,
                1727
            ],
            [
                1742,
                1745
            ],
            [
                1754,
                1755
            ],
            [
                1756,
                1759
            ],
            [
                1760,
                1762
            ],
            [
                1777,
                1811
            ],
            [
                1815,
                1866
            ],
            [
                1866,
                1898
            ],
            [
                1898,
                1903
            ],
            [
                1904,
                1912
            ],
            [
                1913,
                1999
            ],
            [
                2006,
                2052
            ],
            [
                2052,
                2081
            ],
            [
                2081,
                2126
            ],
            [
                2126,
                2128
            ],
            [
                2128,
                2162
            ],
            [
                2170,
                2172
            ],
            [
                2178,
                2186
            ],
            [
                2195,
                2197
            ],
            [
                2197,
                2247
            ],
            [
                2248,
                2259
            ],
            [
                2259,
                2295
            ],
            [
                2296,
                2300
            ],
            [
                2301,
                2304
            ],
            [
                2313,
                2321
            ],
            [
                2321,
                2369
            ],
            [
                2369,
                2399
            ],
            [
                2410,
                2426
            ],
            [
                2437,
                2439
            ],
            [
                2439,
                2481
            ],
            [
                2481,
                2517
            ],
            [
                2517,
                2554
            ],
            [
                2564,
                2602
            ],
            [
                2602,
                2659
            ],
            [
                2659,
                2744
            ],
            [
                2744,
                2815
            ],
            [
                2816,
                2828
            ],
            [
                2833,
                2872
            ],
            [
                2872,
                2912
            ],
            [
                2923,
                2927
            ],
            [
                2927,
                2928
            ],
            [
                2929,
                2947
            ],
            [
                2948,
                2952
            ],
            [
                2953,
                2955
            ],
            [
                2975,
                2976
            ],
            [
                2977,
                3052
            ],
            [
                3052,
                3054
            ],
            [
                3055,
                3059
            ],
            [
                3067,
                3069
            ],
            [
                3070,
                3073
            ],
            [
                3074,
                3081
            ],
            [
                3082,
                3089
            ],
            [
                3089,
                3096
            ],
            [
                3103,
                3130
            ],
            [
                3140,
                3191
            ],
            [
                3191,
                3222
            ],
            [
                3222,
                3259
            ],
            [
                3265,
                3280
            ],
            [
                3281,
                3285
            ],
            [
                3286,
                3290
            ],
            [
                3291,
                3306
            ],
            [
                3308,
                3310
            ],
            [
                3318,
                3327
            ],
            [
                3328,
                3331
            ],
            [
                3332,
                3350
            ],
            [
                3351,
                3370
            ],
            [
                3371,
                3384
            ],
            [
                3384,
                3402
            ],
            [
                3402,
                3433
            ],
            [
                3433,
                3435
            ],
            [
                3449,
                3535
            ],
            [
                3535,
                3559
            ],
            [
                3560,
                3574
            ],
            [
                3574,
                3576
            ],
            [
                3584,
                3592
            ],
            [
                3598,
                3660
            ],
            [
                3660,
                3679
            ],
            [
                3679,
                3699
            ],
            [
                3699,
                3703
            ],
            [
                3710,
                3715
            ],
            [
                3716,
                3718
            ],
            [
                3724,
                3731
            ],
            [
                3732,
                3734
            ],
            [
                3735,
                3746
            ],
            [
                3746,
                3747
            ],
            [
                3748,
                3755
            ],
            [
                3763,
                3765
            ],
            [
                3766,
                3801
            ],
            [
                3801,
                3802
            ],
            [
                3803,
                3829
            ],
            [
                3830,
                3853
            ],
            [
                3853,
                3856
            ],
            [
                3859,
                3862
            ],
            [
                3862,
                3918
            ],
            [
                3923,
                3945
            ],
            [
                3946,
                4001
            ],
            [
                4010,
                4012
            ],
            [
                4012,
                4024
            ],
            [
                4029,
                4121
            ],
            [
                4122,
                4165
            ],
            [
                4170,
                4191
            ],
            [
                4193,
                4194
            ],
            [
                4194,
                4198
            ],
            [
                4199,
                4246
            ],
            [
                4246,
                4260
            ],
            [
                4261,
                4366
            ],
            [
                4366,
                4421
            ],
            [
                4422,
                4439
            ],
            [
                4439,
                4440
            ],
            [
                4441,
                4456
            ],
            [
                4456,
                4465
            ],
            [
                4465,
                4473
            ],
            [
                4474,
                4478
            ],
            [
                4479,
                4485
            ],
            [
                4492,
                4494
            ],
            [
                4494,
                4522
            ],
            [
                4522,
                4524
            ],
            [
                4524,
                4539
            ],
            [
                4539,
                4554
            ],
            [
                4555,
                4557
            ],
            [
                4564,
                4565
            ],
            [
                4566,
                4578
            ],
            [
                4579,
                4611
            ],
            [
                4612,
                4614
            ],
            [
                4616,
                4624
            ],
            [
                4624,
                4645
            ],
            [
                4645,
                4673
            ],
            [
                4674,
                4712
            ],
            [
                4712,
                4714
            ],
            [
                4714,
                4759
            ],
            [
                4764,
                4766
            ],
            [
                4766,
                4786
            ],
            [
                4789,
                4881
            ],
            [
                4881,
                4889
            ],
            [
                4896,
                4907
            ],
            [
                4907,
                4912
            ],
            [
                4913,
                4925
            ],
            [
                4932,
                4947
            ],
            [
                4948,
                4964
            ],
            [
                4964,
                4966
            ],
            [
                4966,
                5004
            ],
            [
                5010,
                5066
            ],
            [
                5067,
                5094
            ],
            [
                5095,
                5181
            ],
            [
                5181,
                5190
            ],
            [
                5194,
                5203
            ],
            [
                5209,
                5217
            ],
            [
                5218,
                5232
            ],
            [
                5232,
                5273
            ],
            [
                5273,
                5275
            ],
            [
                5275,
                5294
            ],
            [
                5299,
                5306
            ],
            [
                5306,
                5351
            ],
            [
                5355,
                5358
            ],
            [
                5359,
                5374
            ],
            [
                5375,
                5378
            ],
            [
                5379,
                5405
            ],
            [
                5405,
                5407
            ],
            [
                5408,
                5458
            ],
            [
                5463,
                5521
            ],
            [
                5521,
                5570
            ],
            [
                5571,
                5573
            ],
            [
                5579,
                5589
            ],
            [
                5596,
                5597
            ],
            [
                5598,
                5601
            ],
            [
                5608,
                5623
            ],
            [
                5623,
                5666
            ],
            [
                5666,
                5676
            ],
            [
                5677,
                5682
            ],
            [
                5682,
                5684
            ],
            [
                5684,
                5720
            ],
            [
                5721,
                5754
            ],
            [
                5754,
                5759
            ],
            [
                5766,
                5837
            ],
            [
                5838,
                5877
            ],
            [
                5877,
                5908
            ],
            [
                5908,
                5924
            ],
            [
                5925,
                5990
            ],
            [
                5991,
                6003
            ],
            [
                6003,
                6013
            ],
            [
                6014,
                6019
            ],
            [
                6020,
                6030
            ],
            [
                6031,
                6034
            ],
            [
                6035,
                6041
            ],
            [
                6041,
                6043
            ],
            [
                6043,
                6085
            ],
            [
                6092,
                6094
            ],
            [
                6095,
                6106
            ],
            [
                6111,
                6139
            ],
            [
                6139,
                6174
            ],
            [
                6175,
                6182
            ],
            [
                6183,
                6187
            ],
            [
                6188,
                6191
            ],
            [
                6200,
                6201
            ],
            [
                6202,
                6205
            ],
            [
                6206,
                6253
            ],
            [
                6258,
                6261
            ],
            [
                6272,
                6273
            ],
            [
                6274,
                6278
            ],
            [
                6279,
                6288
            ],
            [
                6292,
                6297
            ],
            [
                6297,
                6299
            ],
            [
                6299,
                6321
            ],
            [
                6322,
                6354
            ],
            [
                6355,
                6364
            ],
            [
                6379,
                6398
            ],
            [
                6399,
                6421
            ],
            [
                6427,
                6430
            ],
            [
                6438,
                6443
            ],
            [
                6443,
                6445
            ],
            [
                6445,
                6535
            ],
            [
                6541,
                6546
            ],
            [
                6547,
                6586
            ],
            [
                6587,
                6611
            ],
            [
                6617,
                6619
            ],
            [
                6619,
                6656
            ],
            [
                6657,
                6660
            ],
            [
                6661,
                6671
            ],
            [
                6671,
                6673
            ],
            [
                6673,
                6723
            ],
            [
                6723,
                6803
            ],
            [
                6803,
                6816
            ],
            [
                6817,
                6883
            ],
            [
                6884,
                6905
            ],
            [
                6906,
                6917
            ],
            [
                6922,
                6926
            ],
            [
                6934,
                6937
            ],
            [
                6937,
                6939
            ],
            [
                6939,
                6952
            ],
            [
                6958,
                6967
            ],
            [
                6967,
                7036
            ],
            [
                7036,
                7037
            ],
            [
                7038,
                7056
            ],
            [
                7056,
                7077
            ],
            [
                7077,
                7092
            ],
            [
                7092,
                7093
            ],
            [
                7094,
                7160
            ],
            [
                7161,
                7199
            ],
            [
                7199,
                7288
            ],
            [
                7288,
                7360
            ],
            [
                7360,
                7362
            ],
            [
                7362,
                7375
            ],
            [
                7376,
                7424
            ],
            [
                7424,
                7494
            ],
            [
                7494,
                7538
            ],
            [
                7539,
                7545
            ],
            [
                7550,
                7552
            ],
            [
                7552,
                7597
            ],
            [
                7597,
                7606
            ],
            [
                7607,
                7628
            ],
            [
                7628,
                7649
            ],
            [
                7649,
                7677
            ],
            [
                7677,
                7724
            ],
            [
                7725,
                7726
            ],
            [
                7727,
                7746
            ],
            [
                7746,
                7806
            ],
            [
                7807,
                7845
            ],
            [
                7845,
                7902
            ],
            [
                7902,
                7928
            ],
            [
                7931,
                7954
            ],
            [
                7954,
                7960
            ],
            [
                7961,
                8035
            ],
            [
                8035,
                8090
            ],
            [
                8090,
                8109
            ],
            [
                8110,
                8138
            ],
            [
                8138,
                8177
            ],
            [
                8178,
                8186
            ],
            [
                8192,
                8196
            ],
            [
                8199,
                8231
            ],
            [
                8232,
                8261
            ],
            [
                8261,
                8268
            ],
            [
                8269,
                8272
            ],
            [
                8273,
                8281
            ],
            [
                8282,
                8291
            ],
            [
                8291,
                8375
            ],
            [
                8375,
                8387
            ],
            [
                8387,
                8397
            ],
            [
                8397,
                8399
            ],
            [
                8400,
                8405
            ],
            [
                8406,
                8411
            ],
            [
                8412,
                8457
            ],
            [
                8457,
                8480
            ],
            [
                8480,
                8549
            ],
            [
                8552,
                8555
            ],
            [
                8555,
                8574
            ],
            [
                8574,
                8619
            ],
            [
                8620,
                8640
            ],
            [
                8640,
                8671
            ],
            [
                8671,
                8703
            ],
            [
                8704,
                8742
            ],
            [
                8742,
                8745
            ],
            [
                8745,
                8784
            ],
            [
                8785,
                8801
            ],
            [
                8801,
                8803
            ],
            [
                8803,
                8816
            ],
            [
                8817,
                8821
            ],
            [
                8821,
                8822
            ],
            [
                8823,
                8848
            ],
            [
                8848,
                8872
            ],
            [
                8880,
                8884
            ],
            [
                8884,
                8887
            ],
            [
                8887,
                8929
            ],
            [
                8929,
                8954
            ],
            [
                8954,
                8960
            ],
            [
                8963,
                8987
            ],
            [
                8987,
                9066
            ],
            [
                9071,
                9089
            ],
            [
                9089,
                9091
            ],
            [
                9091,
                9132
            ],
            [
                9132,
                9167
            ],
            [
                9167,
                9175
            ],
            [
                9185,
                9192
            ],
            [
                9192,
                9193
            ],
            [
                9194,
                9195
            ],
            [
                9195,
                9229
            ],
            [
                9229,
                9261
            ],
            [
                9261,
                9262
            ],
            [
                9262,
                9285
            ],
            [
                9288,
                9307
            ],
            [
                9314,
                9331
            ],
            [
                9331,
                9333
            ],
            [
                9333,
                9394
            ],
            [
                9394,
                9400
            ],
            [
                9401,
                9423
            ],
            [
                9423,
                9424
            ],
            [
                9425,
                9442
            ],
            [
                9447,
                9462
            ],
            [
                9462,
                9472
            ],
            [
                9477,
                9530
            ],
            [
                9530,
                9595
            ],
            [
                9595,
                9606
            ],
            [
                9606,
                9612
            ],
            [
                9613,
                9620
            ],
            [
                9621,
                9624
            ],
            [
                9625,
                9629
            ],
            [
                9629,
                9631
            ],
            [
                9631,
                9667
            ],
            [
                9667,
                9670
            ],
            [
                9670,
                9790
            ],
            [
                9790,
                9814
            ],
            [
                9815,
                9882
            ],
            [
                9882,
                9887
            ],
            [
                9888,
                9910
            ],
            [
                9911,
                9914
            ],
            [
                9915,
                9928
            ],
            [
                9929,
                9944
            ],
            [
                9950,
                9972
            ],
            [
                9977,
                9990
            ],
            [
                9995,
                9997
            ],
            [
                9997,
                10004
            ],
            [
                10005,
                10009
            ],
            [
                10010,
                10016
            ],
            [
                10016,
                10021
            ],
            [
                10022,
                10025
            ],
            [
                10031,
                10034
            ],
            [
                10035,
                10038
            ],
            [
                10039,
                10064
            ],
            [
                10064,
                10090
            ],
            [
                10098,
                10130
            ],
            [
                10130,
                10132
            ],
            [
                10132,
                10140
            ],
            [
                10141,
                10164
            ],
            [
                10165,
                10268
            ],
            [
                10269,
                10272
            ],
            [
                10273,
                10330
            ],
            [
                10333,
                10335
            ],
            [
                10343,
                10345
            ],
            [
                10350,
                10353
            ],
            [
                10354,
                10360
            ],
            [
                10360,
                10362
            ],
            [
                10362,
                10378
            ],
            [
                10379,
                10409
            ],
            [
                10409,
                10452
            ],
            [
                10455,
                10471
            ],
            [
                10471,
                10508
            ],
            [
                10508,
                10509
            ],
            [
                10509,
                10513
            ],
            [
                10514,
                10537
            ],
            [
                10539,
                10569
            ],
            [
                10569,
                10596
            ],
            [
                10596,
                10607
            ],
            [
                10610,
                10636
            ],
            [
                10639,
                10667
            ],
            [
                10667,
                10722
            ],
            [
                10723,
                10737
            ],
            [
                10737,
                10785
            ],
            [
                10788,
                10823
            ],
            [
                10823,
                10831
            ],
            [
                10831,
                10833
            ],
            [
                10833,
                10843
            ],
            [
                10843,
                10845
            ],
            [
                10848,
                10886
            ],
            [
                10886,
                10916
            ],
            [
                10916,
                10931
            ],
            [
                10931,
                10934
            ],
            [
                10934,
                10939
            ],
            [
                10939,
                10945
            ],
            [
                10945,
                10946
            ],
            [
                10947,
                10967
            ],
            [
                10968,
                11009
            ],
            [
                11009,
                11063
            ],
            [
                11063,
                11118
            ],
            [
                11118,
                11161
            ],
            [
                11161,
                11214
            ],
            [
                11214,
                11225
            ],
            [
                11226,
                11229
            ],
            [
                11233,
                11252
            ],
            [
                11252,
                11300
            ],
            [
                11300,
                11398
            ],
            [
                11398,
                11413
            ],
            [
                11413,
                11442
            ],
            [
                11445,
                11498
            ],
            [
                11498,
                11501
            ],
            [
                11501,
                11537
            ],
            [
                11537,
                11553
            ],
            [
                11554,
                11556
            ],
            [
                11557,
                11600
            ],
            [
                11600,
                11603
            ],
            [
                11603,
                11612
            ],
            [
                11615,
                11633
            ],
            [
                11633,
                11651
            ],
            [
                11652,
                11673
            ],
            [
                11676,
                11684
            ],
            [
                11685,
                11717
            ],
            [
                11717,
                11726
            ],
            [
                11727,
                11749
            ],
            [
                11749,
                11785
            ],
            [
                11785,
                11819
            ],
            [
                11819,
                11842
            ],
            [
                11842,
                11883
            ],
            [
                11883,
                11934
            ],
            [
                11934,
                11949
            ],
            [
                11950,
                11972
            ],
            [
                11972,
                12012
            ],
            [
                12012,
                12062
            ],
            [
                12062,
                12113
            ],
            [
                12114,
                12130
            ],
            [
                12130,
                12160
            ],
            [
                12168,
                12170
            ],
            [
                12170,
                12199
            ],
            [
                12200,
                12232
            ],
            [
                12235,
                12274
            ],
            [
                12274,
                12277
            ],
            [
                12277,
                12280
            ],
            [
                12280,
                12301
            ],
            [
                12301,
                12305
            ],
            [
                12305,
                12307
            ],
            [
                12308,
                12330
            ],
            [
                12332,
                12345
            ],
            [
                12353,
                12356
            ],
            [
                12363,
                12365
            ],
            [
                12365,
                12368
            ],
            [
                12374,
                12398
            ],
            [
                12411,
                12432
            ],
            [
                12433,
                12436
            ],
            [
                12455,
                12457
            ],
            [
                12458,
                12475
            ]
        ],
        "row_chars": [
            [
                0,
                119
            ],
            [
                119,
                163
            ],
            [
                163,
                251
            ],
            [
                251,
                459
            ],
            [
                459,
                521
            ],
            [
                521,
                595
            ],
            [
                595,
                672
            ],
            [
                672,
                832
            ],
            [
                832,
                865
            ],
            [
                865,
                912
            ],
            [
                912,
                1063
            ],
            [
                1063,
                1138
            ],
            [
                1138,
                1138
            ],
            [
                1138,
                1176
            ],
            [
                1176,
                1176
            ],
            [
                1176,
                1229
            ],
            [
                1229,
                1300
            ],
            [
                1300,
                1416
            ],
            [
                1416,
                1530
            ],
            [
                1530,
                1573
            ],
            [
                1573,
                1573
            ],
            [
                1573,
                1573
            ],
            [
                1573,
                1727
            ],
            [
                1727,
                1727
            ],
            [
                1727,
                1727
            ],
            [
                1727,
                1727
            ],
            [
                1727,
                1866
            ],
            [
                1866,
                1898
            ],
            [
                1898,
                2052
            ],
            [
                2052,
                2081
            ],
            [
                2081,
                2128
            ],
            [
                2128,
                2197
            ],
            [
                2197,
                2259
            ],
            [
                2259,
                2321
            ],
            [
                2321,
                2439
            ],
            [
                2439,
                2439
            ],
            [
                2439,
                2439
            ],
            [
                2439,
                2517
            ],
            [
                2517,
                2659
            ],
            [
                2659,
                2744
            ],
            [
                2744,
                2872
            ],
            [
                2872,
                2872
            ],
            [
                2872,
                2929
            ],
            [
                2929,
                3052
            ],
            [
                3052,
                3191
            ],
            [
                3191,
                3191
            ],
            [
                3191,
                3191
            ],
            [
                3191,
                3191
            ],
            [
                3191,
                3191
            ],
            [
                3191,
                3191
            ],
            [
                3191,
                3371
            ],
            [
                3371,
                3384
            ],
            [
                3384,
                3402
            ],
            [
                3402,
                3433
            ],
            [
                3433,
                3535
            ],
            [
                3535,
                3535
            ],
            [
                3535,
                3574
            ],
            [
                3574,
                3660
            ],
            [
                3660,
                3660
            ],
            [
                3660,
                3660
            ],
            [
                3660,
                3660
            ],
            [
                3660,
                3679
            ],
            [
                3679,
                3699
            ],
            [
                3699,
                3748
            ],
            [
                3748,
                3748
            ],
            [
                3748,
                3853
            ],
            [
                3853,
                3862
            ],
            [
                3862,
                3918
            ],
            [
                3918,
                3918
            ],
            [
                3918,
                3918
            ],
            [
                3918,
                4012
            ],
            [
                4012,
                4122
            ],
            [
                4122,
                4246
            ],
            [
                4246,
                4366
            ],
            [
                4366,
                4441
            ],
            [
                4441,
                4441
            ],
            [
                4441,
                4456
            ],
            [
                4456,
                4465
            ],
            [
                4465,
                4494
            ],
            [
                4494,
                4524
            ],
            [
                4524,
                4539
            ],
            [
                4539,
                4579
            ],
            [
                4579,
                4612
            ],
            [
                4612,
                4624
            ],
            [
                4624,
                4645
            ],
            [
                4645,
                4714
            ],
            [
                4714,
                4766
            ],
            [
                4766,
                4881
            ],
            [
                4881,
                4966
            ],
            [
                4966,
                5095
            ],
            [
                5095,
                5181
            ],
            [
                5181,
                5232
            ],
            [
                5232,
                5275
            ],
            [
                5275,
                5306
            ],
            [
                5306,
                5405
            ],
            [
                5405,
                5458
            ],
            [
                5458,
                5521
            ],
            [
                5521,
                5598
            ],
            [
                5598,
                5666
            ],
            [
                5666,
                5684
            ],
            [
                5684,
                5754
            ],
            [
                5754,
                5838
            ],
            [
                5838,
                5877
            ],
            [
                5877,
                6003
            ],
            [
                6003,
                6043
            ],
            [
                6043,
                6139
            ],
            [
                6139,
                6299
            ],
            [
                6299,
                6399
            ],
            [
                6399,
                6445
            ],
            [
                6445,
                6445
            ],
            [
                6445,
                6619
            ],
            [
                6619,
                6619
            ],
            [
                6619,
                6673
            ],
            [
                6673,
                6723
            ],
            [
                6723,
                6803
            ],
            [
                6803,
                6939
            ],
            [
                6939,
                6967
            ],
            [
                6967,
                7038
            ],
            [
                7038,
                7077
            ],
            [
                7077,
                7199
            ],
            [
                7199,
                7288
            ],
            [
                7288,
                7362
            ],
            [
                7362,
                7424
            ],
            [
                7424,
                7494
            ],
            [
                7494,
                7538
            ],
            [
                7538,
                7538
            ],
            [
                7538,
                7552
            ],
            [
                7552,
                7597
            ],
            [
                7597,
                7606
            ],
            [
                7606,
                7606
            ],
            [
                7606,
                7628
            ],
            [
                7628,
                7649
            ],
            [
                7649,
                7677
            ],
            [
                7677,
                7724
            ],
            [
                7724,
                7724
            ],
            [
                7724,
                7746
            ],
            [
                7746,
                7845
            ],
            [
                7845,
                7902
            ],
            [
                7902,
                7954
            ],
            [
                7954,
                8035
            ],
            [
                8035,
                8090
            ],
            [
                8090,
                8138
            ],
            [
                8138,
                8199
            ],
            [
                8199,
                8199
            ],
            [
                8199,
                8231
            ],
            [
                8231,
                8231
            ],
            [
                8231,
                8261
            ],
            [
                8261,
                8291
            ],
            [
                8291,
                8291
            ],
            [
                8291,
                8375
            ],
            [
                8375,
                8387
            ],
            [
                8387,
                8397
            ],
            [
                8397,
                8457
            ],
            [
                8457,
                8480
            ],
            [
                8480,
                8555
            ],
            [
                8555,
                8574
            ],
            [
                8574,
                8640
            ],
            [
                8640,
                8671
            ],
            [
                8671,
                8745
            ],
            [
                8745,
                8803
            ],
            [
                8803,
                8848
            ],
            [
                8848,
                8887
            ],
            [
                8887,
                8929
            ],
            [
                8929,
                8954
            ],
            [
                8954,
                8987
            ],
            [
                8987,
                9091
            ],
            [
                9091,
                9167
            ],
            [
                9167,
                9229
            ],
            [
                9229,
                9261
            ],
            [
                9261,
                9288
            ],
            [
                9288,
                9288
            ],
            [
                9288,
                9333
            ],
            [
                9333,
                9394
            ],
            [
                9394,
                9462
            ],
            [
                9462,
                9530
            ],
            [
                9530,
                9595
            ],
            [
                9595,
                9606
            ],
            [
                9606,
                9631
            ],
            [
                9631,
                9670
            ],
            [
                9670,
                9790
            ],
            [
                9790,
                9882
            ],
            [
                9882,
                9997
            ],
            [
                9997,
                10064
            ],
            [
                10064,
                10132
            ],
            [
                10132,
                10269
            ],
            [
                10269,
                10330
            ],
            [
                10330,
                10362
            ],
            [
                10362,
                10455
            ],
            [
                10455,
                10471
            ],
            [
                10471,
                10508
            ],
            [
                10508,
                10539
            ],
            [
                10539,
                10596
            ],
            [
                10596,
                10667
            ],
            [
                10667,
                10737
            ],
            [
                10737,
                10788
            ],
            [
                10788,
                10823
            ],
            [
                10823,
                10833
            ],
            [
                10833,
                10843
            ],
            [
                10843,
                10886
            ],
            [
                10886,
                10916
            ],
            [
                10916,
                10934
            ],
            [
                10934,
                10934
            ],
            [
                10934,
                10939
            ],
            [
                10939,
                10967
            ],
            [
                10967,
                10967
            ],
            [
                10967,
                10967
            ],
            [
                10967,
                10967
            ],
            [
                10967,
                11009
            ],
            [
                11009,
                11009
            ],
            [
                11009,
                11009
            ],
            [
                11009,
                11009
            ],
            [
                11009,
                11063
            ],
            [
                11063,
                11118
            ],
            [
                11118,
                11161
            ],
            [
                11161,
                11214
            ],
            [
                11214,
                11226
            ],
            [
                11226,
                11226
            ],
            [
                11226,
                11252
            ],
            [
                11252,
                11300
            ],
            [
                11300,
                11398
            ],
            [
                11398,
                11413
            ],
            [
                11413,
                11445
            ],
            [
                11445,
                11501
            ],
            [
                11501,
                11537
            ],
            [
                11537,
                11603
            ],
            [
                11603,
                11717
            ],
            [
                11717,
                11749
            ],
            [
                11749,
                11785
            ],
            [
                11785,
                11819
            ],
            [
                11819,
                11842
            ],
            [
                11842,
                11883
            ],
            [
                11883,
                11883
            ],
            [
                11883,
                11934
            ],
            [
                11934,
                11972
            ],
            [
                11972,
                12012
            ],
            [
                12012,
                12062
            ],
            [
                12062,
                12130
            ],
            [
                12130,
                12170
            ],
            [
                12170,
                12235
            ],
            [
                12235,
                12235
            ],
            [
                12235,
                12274
            ],
            [
                12274,
                12280
            ],
            [
                12280,
                12301
            ],
            [
                12301,
                12308
            ],
            [
                12308,
                12332
            ],
            [
                12332,
                12365
            ],
            [
                12365,
                12365
            ],
            [
                12365,
                12475
            ]
        ]
    }
}