{
    "original": {
        "text": "It was nearly seven o'clock in the evening,--a hot, July evening,--when the woman went from Vavasor's room, and left him there alone. It was necessary that he should immediately do something. In the first place he must dine, unless he meant to carry out his threat, and shoot himself at once. But he had no such intention as that, although he stood for some minutes with the pistol in his hand. He was thinking then of shooting some one else. But he resolved that, if he did so at all, he would not do it on that evening, and he locked up the pistol again in the standing desk. After that, he took up some papers, referring to steam packets, which were lying on his table. They contained the programmes of different companies, and showed how one vessel went on one day to New York, and another on another day would take out a load of emigrants for New Zealand and Australia. \"That's a good line,\" said he, as he read a certain prospectus. \"They generally go to the bottom, and save a man from any further trouble on his own account.\" Then he dressed himself, putting on his boots and coat, and went out to his club for his dinner.\nLondon was still fairly full,--that is to say, the West End was not deserted, although Parliament had been broken up two months earlier than usual, in preparation for the new elections. Many men who had gone down into the country were now back again in town, and the dining-room at the club was crowded. Men came up to him condoling with him, telling him that he was well rid of a great nuisance, that the present Members for the Chelsea Districts would not sit long, or that there would be another general election in a year or two. To all these little speeches he made cheerful replies, and was declared by his acquaintance to bear his disappointment well. Calder Jones came to him and talked hunting talk, and Vavasor expressed his intention of being at Roebury in November. \"You had better join our club,\" said Calder Jones. In answer to which Vavasor said that he thought he would join the club. He remained in the smoking-room till nearly eleven; then he took himself home, and remained up half the night destroying papers. Every written document on which he could lay his hands he destroyed. All the pigeon-holes of his desk were emptied out, and their contents thrown into the flames. At first he looked at the papers before he burned them; but the trouble of doing so soon tired him, and he condemned them all, as he came to them, without examination. Then he selected a considerable amount of his clothes, and packed up two portmanteaus, folding his coats with care, and inspecting his boots narrowly, so that he might see which, out of the large number before him, it might be best worth his while to take with him. When that was done, he took from his desk a bag of sovereigns, and, pouring them out upon the table, he counted them out into parcels of twenty-five each, and made them up carefully into rouleaus with paper. These, when complete, he divided among the two portmanteaus and a dressing-bag which he also packed and a travelling desk, which he filled with papers, pens, and the like. But he put into it no written document. He carefully looked through his linen, and anything that had been marked with more than his initials he rejected. Then he took out a bundle of printed cards, and furnished a card-case with them. On these cards was inscribed the name of Gregory Vance. When all was finished, he stood for awhile with his back to the fireplace contemplating his work. \"After all,\" he said to himself, \"I know that I shall never start; and, if I do, nobody can hinder me, and my own name would be as good as any other. As for a man with such a face as mine not being known, that is out of the question.\" But still he liked the arrangements which he had made, and when he had looked at them for awhile he went to bed.\nHe was up early the next morning, and had some coffee brought to him by the servant of the house, and as he drank it he had an interview with his landlady. \"He was going,\" he said;--\"going that very day.\" It might be possible that he would change his mind; but as he would desire to start without delay, if he did go, he would pay her then what he owed her, and what would be due for her lodgings under a week's notice. The woman stared, and curtseyed, and took her money. Vavasor, though he had lately been much pressed for money, had never been so foolish as to owe debts where he lived. \"There will be some things left about, Mrs. Bunsby,\" he said, \"and I will get you to keep them till I call or send.\" Mrs. Bunsby said that she would, and then looked her last at him. After that interview she never saw him again.\nWhen he was left alone he put on a rough morning coat, and taking up the pistol, placed it carefully in his pocket, and sallied forth. It was manifest enough that he had some decided scheme in his head, for he turned quickly towards the West when he reached the Strand, went across Trafalgar Square to Pall Mall East, and then turned up Suffolk Street. Just as he reached the club-house at the corner he paused and looked back, facing first one way and then the other. \"The chances are that I shall never see anything of it again,\" he said to himself. Then he laughed in his own silent way, shook his head slightly, and turning again quickly on his heel, walked up the street till he reached the house of Mr. Jones, the pugilistic tailor. The reader, no doubt, has forgotten all he ever knew of Mr. Jones, the pugilistic tailor. It can soon be told again. At Mr. Jones's house John Grey lodged when he was in London, and he was in London at this moment.\nVavasor rang the bell, and as soon as the servant came he went quickly into the house, and passed her in the passage. \"Mr. Grey is at home,\" he said. \"I will go up to him.\" The girl said that Mr. Grey was at home, but suggested that she had better announce the gentleman. But Vavasor was already halfway up the stairs, and before the girl had reached the first landing place, he had entered Mr. Grey's room and closed the door behind him.\nGrey was sitting near the open window, in a dressing-gown, and was reading. The breakfast things were on the table, but he had not as yet breakfasted. As soon as he saw George Vavasor, he rose from his chair quickly, and put down his book. \"Mr. Vavasor,\" he said, \"I hardly expected to see you in my lodgings again!\"\n\"I dare say not,\" said Vavasor; \"but, nevertheless, here I am.\" He kept his right hand in the pocket which held the pistol, and held his left hand under his waistcoat.\n\"May I ask why you have come?\" said Grey.\n\"I intend to tell you, at any rate, whether you ask me or not. I have come to declare in your own hearing,--as I am in the habit of doing occasionally behind your back,--that you are a blackguard,--to spit in your face, and defy you.\" As he said this he suited his action to his words, but without any serious result. \"I have come here to see if you are man enough to resent any insult that I can offer you; but I doubt whether you are.\"\n\"Nothing that you can say to me, Mr. Vavasor, will have any effect upon me;--except that you can, of course, annoy me.\"\n\"And I mean to annoy you, too, before I have done with you. Will you fight me?\"\n\"Fight a duel with you,--with pistols? Certainly not.\"\n\"Then you are a coward, as I supposed.\"\n\"I should be a fool if I were to do such a thing as that.\"\n\"Look here, Mr. Grey. You managed to worm yourself into an intimacy with my cousin, Miss Vavasor, and to become engaged to her. When she found out what you were, how paltry, and mean, and vile, she changed her mind, and bade you leave her.\"\n\"Are you here at her request?\"\n\"I am here as her representative.\"\n\"Self-appointed, I think.\"\n\"Then, sir, you think wrong. I am at this moment her affianced husband; and I find that, in spite of all that she has said to you,--which was enough, I should have thought, to keep any man of spirit out of her presence,--you still persecute her by going to her house, and forcing yourself upon her presence. Now, I give you two alternatives. You shall either give me your written promise never to go near her again, or you shall fight me.\"\n\"I shall do neither one nor the other,--as you know very well yourself.\"\n\"Stop till I have done, sir. If you have courage enough to fight me, I will meet you in any country. I will fight you here in London, or, if you are afraid of that, I will go over to France, or to America, if that will suit you better.\"\n\"Nothing of the kind will suit me at all. I don't want to have anything to do with you.\"\n\"Then you are a coward.\"\n\"Perhaps I am;--but your saying so will not make me one.\"\n\"You are a coward, and a liar, and a blackguard. I have given you the option of behaving like a gentleman, and you have refused it. Now, look here. I have come here with arms, and I do not intend to leave this room without using them, unless you will promise to give me the meeting that I have proposed.\" And he took the pistol out of his pocket.\n\"Do you mean that you are going to murder me?\" Grey asked. There were two windows in the room, and he had been sitting near to that which was furthest removed from the fireplace, and consequently furthest removed from the bell, and his visitor was now standing immediately between him and the door. He had to think what steps he might best take, and to act upon his decision instantly. He was by no means a timid man, and was one, moreover, very little prone to believe in extravagant action. He did not think, even now, that this disappointed, ruined man had come there with any intention of killing him. But he knew that a pistol in the hands of an angry man is dangerous, and that it behoved him to do his best to rid himself of the nuisance which now encumbered him. \"Do you mean that you are going to murder me?\" he had said.\n\"I mean that you shall not leave this room alive unless you promise to meet me, and fight it out.\" Upon hearing this, Grey turned himself towards the bell. \"If you move a step, I will fire at you,\" said Vavasor. Grey paused a moment, and looked him full in the face. \"I will,\" said Vavasor again.\n\"That would be murder,\" said Grey.\n\"Don't think that you will frighten me by ugly words,\" said Vavasor. \"I am beyond that.\"\nGrey had stopped for a moment to fix his eyes on the other man's face; but it was only for a moment, and then he went on to the bell. He had seen that the pistol was pointed at himself, and had once thought of rushing across the room at his adversary, calculating that a shot fired at him as he did so might miss him, and that he would then have a fair chance of disarming the madman. But his chief object was to avoid any personal conflict, to escape the indignity of a scramble for the pistol,--and especially to escape the necessity of a consequent appearance at some police-office, where he would have to justify himself, and answer the questions of a lawyer hired to cross-question him. He made, therefore, towards the bell, trusting that Vavasor would not fire at him, but having some little thought also as to the danger of the moment. It might be that everything was over for him now,--that the fatal hour had come, and that eternity was close upon him. Something of the spirit of a prayer flashed across his mind as he moved. Then he heard the click of the pistol's hammer as it fell, and was aware that his eyes were dazzled, though he was unconscious of seeing any flame. He felt something in the air, and knew that the pistol had been fired;--but he did not know whether the shot had struck him or had missed him. His hand was out for the bell-handle, and he had pulled it, before he was sure that he was unhurt.\n\"D----ation!\" exclaimed the murderer. But he did not pull the trigger again. Though the weapon had of late been so often in his hands, he forgot, in the agitation of the moment, that his missing once was but of small matter if he chose to go on with his purpose. Were there not five other barrels for him, each making itself ready by the discharge of the other? But he had paused, forgetting, in his excitement, the use of his weapon, and before he had bethought himself that the man was still in his power, he heard the sound of the bell. \"D----ation!\" he exclaimed. Then he turned round, left the room, hurried down the stairs, and made his way out into the street, having again passed the girl on his way.\nGrey, when he perceived that his enemy was gone, turned round to look for the bullet or its mark. He soon found the little hole in the window-shutter, and probing it with the point of his pencil, came upon the morsel of lead which might now just as readily have been within his own brain. There he left it for the time, and then made some not inaccurate calculation as to the narrowness of his own escape. He had been standing directly between Vavasor and the shutter, and he found, from the height of the hole, that the shot must have passed close beneath his ear. He remembered to have heard the click of the hammer, but he could not remember the sound of the report, and when the girl entered the room, he perceived at once from her manner that she was unaware that firearms had been used.\n\"Has that gentleman left the house?\" Grey asked. The girl said that he had left the house. \"Don't admit him again,\" said he;--\"that is, if you can avoid it. I believe he is not in his right senses.\" Then he asked for Mr. Jones, his landlord, and in a few minutes the pugilistic tailor was with him.\nDuring those few minutes he had been called upon to resolve what he would do now. Would he put the police at once upon the track of the murderer, who was, as he remembered too well, the first cousin of the woman whom he still desired to make his wife? That cross-examination which he would have to undergo at the police-office, and again probably in an assize court, in which all his relations with the Vavasor family would be made public, was very vivid to his imagination. That he was called upon by duty to do something he felt almost assured. The man who had been allowed to make such an attempt once with impunity, might probably make it again. But he resolved that he need not now say anything about the pistol to the pugilistic tailor, unless the tailor said something to him.\n\"Mr. Jones,\" he said, \"that man whom I had to put out of the room once before, has been here again.\"\n\"Has there been another tussle, sir?\"\n\"No;--nothing of that kind. But we must take some steps to prevent his getting in again, if we can help it.\"\nJones promised his aid, and offered to go at once to the police. To this, however, Mr. Grey demurred, saying that he should himself seek assistance from some magistrate. Jones promised to be very vigilant as to watching the door; and then John Grey sat down to his breakfast. Of course he thought much of what had occurred. It was impossible that he should not think much of so narrow an escape. He had probably been as near death as a man may well be without receiving any injury; and the more he thought of it, the more strongly he was convinced that he could not allow the thing to pass by without some notice, or some precaution as to the future.\nAt eleven o'clock he went to Scotland Yard, and saw some officer great in power over policemen, and told him all the circumstances,--confidentially. The powerful officer recommended an equally confidential reference to a magistrate; and towards evening a very confidential policeman in plain clothes paid a visit to Vavasor's lodgings in Cecil Street. But Vavasor lodged there no longer. Mrs. Bunsby, who was also very confidential,--and at her wits' end because she could not learn the special business of the stranger who called,--stated that Mr. George Vavasor left her house in a cab at ten o'clock that morning, having taken with him such luggage as he had packed, and having gone, \"she was afraid, for good,\" as Mrs. Bunsby expressed it.\nHe had gone for good, and at the moment in which the policeman was making the inquiry in Cecil Street, was leaning over the side of an American steamer which had just got up her steam and weighed her anchor in the Mersey. He was on board at six o'clock, and it was not till the next day that the cabman was traced who had carried him to Euston Square Station. Of course, it was soon known that he had gone to America, but it was not thought worth while to take any further steps towards arresting him. Mr. Grey himself was decidedly opposed to any such attempt, declaring his opinion that his own evidence would be insufficient to obtain a conviction. The big men in Scotland Yard were loth to let the matter drop. Their mouths watered after the job, and they had very numerous and very confidential interviews with John Grey. But it was decided that nothing should be done. \"Pity!\" said one enterprising superintendent, in answer to the condolings of a brother superintendent. \"Pity's no name for it. It's the greatest shame as ever I knew since I joined the force. A man as was a Member of Parliament only last Session,--as belongs to no end of swell clubs, a gent as well known in London as any gent about the town! And I'd have had him back in three months, as sure as my name's Walker.\" And that superintendent felt that his profession and his country were alike disgraced.\nAnd now George Vavasor vanishes from our pages, and will be heard of no more. Roebury knew him no longer, nor Pall Mall, nor the Chelsea Districts. His disappearance was a nine days' wonder, but the world at large knew nothing of the circumstances of that attempt in Suffolk Street. Mr. Grey himself told the story to no one, till he told it to Mr. Palliser at Lucerne. Mr. Scruby complained bitterly of the way in which Vavasor had robbed him; but I doubt whether Scruby, in truth, lost much by the transaction. To Kate, down in Westmoreland, no tidings came of her brother, and her sojourn in London with her aunt had nearly come to an end before she knew that he was gone. Even then the rumour reached her through Captain Bellfield, and she learned what few facts she knew from Mrs. Bunsby in Cecil Street.\n\"He was always mysterious,\" said Mrs. Greenow, \"and now he has vanished. I hate mysteries, and, as for myself, I think it will be much better that he should not come back again.\" Perhaps Kate was of the same opinion, but, if so, she kept it to herself.",
        "paragraph_chars": [
            [
                0,
                1131
            ],
            [
                1131,
                3875
            ],
            [
                3875,
                4694
            ],
            [
                4694,
                5648
            ],
            [
                5648,
                6087
            ],
            [
                6087,
                6404
            ],
            [
                6404,
                6572
            ],
            [
                6572,
                6614
            ],
            [
                6614,
                7052
            ],
            [
                7052,
                7172
            ],
            [
                7172,
                7252
            ],
            [
                7252,
                7307
            ],
            [
                7307,
                7347
            ],
            [
                7347,
                7406
            ],
            [
                7406,
                7647
            ],
            [
                7647,
                7678
            ],
            [
                7678,
                7713
            ],
            [
                7713,
                7740
            ],
            [
                7740,
                8180
            ],
            [
                8180,
                8253
            ],
            [
                8253,
                8490
            ],
            [
                8490,
                8579
            ],
            [
                8579,
                8604
            ],
            [
                8604,
                8662
            ],
            [
                8662,
                9009
            ],
            [
                9009,
                9840
            ],
            [
                9840,
                10137
            ],
            [
                10137,
                10172
            ],
            [
                10172,
                10261
            ],
            [
                10261,
                11686
            ],
            [
                11686,
                12395
            ],
            [
                12395,
                13188
            ],
            [
                13188,
                13487
            ],
            [
                13487,
                14271
            ],
            [
                14271,
                14372
            ],
            [
                14372,
                14410
            ],
            [
                14410,
                14519
            ],
            [
                14519,
                15170
            ],
            [
                15170,
                15914
            ],
            [
                15914,
                17293
            ],
            [
                17293,
                18103
            ],
            [
                18103,
                18355
            ]
        ],
        "segment_chars": [
            [
                0,
                134
            ],
            [
                134,
                192
            ],
            [
                192,
                293
            ],
            [
                293,
                395
            ],
            [
                395,
                443
            ],
            [
                443,
                578
            ],
            [
                578,
                673
            ],
            [
                673,
                875
            ],
            [
                875,
                939
            ],
            [
                939,
                1034
            ],
            [
                1034,
                1131
            ],
            [
                1131,
                1317
            ],
            [
                1317,
                1435
            ],
            [
                1435,
                1665
            ],
            [
                1665,
                1790
            ],
            [
                1790,
                1909
            ],
            [
                1909,
                1960
            ],
            [
                1960,
                2032
            ],
            [
                2032,
                2161
            ],
            [
                2161,
                2230
            ],
            [
                2230,
                2324
            ],
            [
                2324,
                2492
            ],
            [
                2492,
                2758
            ],
            [
                2758,
                2966
            ],
            [
                2966,
                3138
            ],
            [
                3138,
                3178
            ],
            [
                3178,
                3292
            ],
            [
                3292,
                3373
            ],
            [
                3373,
                3429
            ],
            [
                3429,
                3527
            ],
            [
                3527,
                3677
            ],
            [
                3677,
                3762
            ],
            [
                3762,
                3875
            ],
            [
                3875,
                4031
            ],
            [
                4031,
                4080
            ],
            [
                4080,
                4295
            ],
            [
                4295,
                4348
            ],
            [
                4348,
                4465
            ],
            [
                4465,
                4582
            ],
            [
                4582,
                4648
            ],
            [
                4648,
                4694
            ],
            [
                4694,
                4829
            ],
            [
                4829,
                5047
            ],
            [
                5047,
                5163
            ],
            [
                5163,
                5246
            ],
            [
                5246,
                5433
            ],
            [
                5433,
                5523
            ],
            [
                5523,
                5550
            ],
            [
                5550,
                5648
            ],
            [
                5648,
                5766
            ],
            [
                5766,
                5798
            ],
            [
                5798,
                5821
            ],
            [
                5821,
                5920
            ],
            [
                5920,
                6087
            ],
            [
                6087,
                6163
            ],
            [
                6163,
                6238
            ],
            [
                6238,
                6327
            ],
            [
                6327,
                6404
            ],
            [
                6404,
                6468
            ],
            [
                6468,
                6572
            ],
            [
                6572,
                6603
            ],
            [
                6603,
                6614
            ],
            [
                6614,
                6677
            ],
            [
                6677,
                6849
            ],
            [
                6849,
                6932
            ],
            [
                6932,
                7052
            ],
            [
                7052,
                7172
            ],
            [
                7172,
                7232
            ],
            [
                7232,
                7252
            ],
            [
                7252,
                7291
            ],
            [
                7291,
                7307
            ],
            [
                7307,
                7347
            ],
            [
                7347,
                7406
            ],
            [
                7406,
                7428
            ],
            [
                7428,
                7534
            ],
            [
                7534,
                7647
            ],
            [
                7647,
                7678
            ],
            [
                7678,
                7713
            ],
            [
                7713,
                7740
            ],
            [
                7740,
                7769
            ],
            [
                7769,
                8048
            ],
            [
                8048,
                8082
            ],
            [
                8082,
                8180
            ],
            [
                8180,
                8253
            ],
            [
                8253,
                8282
            ],
            [
                8282,
                8354
            ],
            [
                8354,
                8490
            ],
            [
                8490,
                8532
            ],
            [
                8532,
                8579
            ],
            [
                8579,
                8604
            ],
            [
                8604,
                8662
            ],
            [
                8662,
                8711
            ],
            [
                8711,
                8794
            ],
            [
                8794,
                8810
            ],
            [
                8810,
                8967
            ],
            [
                8967,
                9009
            ],
            [
                9009,
                9056
            ],
            [
                9056,
                9068
            ],
            [
                9068,
                9308
            ],
            [
                9308,
                9395
            ],
            [
                9395,
                9502
            ],
            [
                9502,
                9615
            ],
            [
                9615,
                9780
            ],
            [
                9780,
                9827
            ],
            [
                9827,
                9840
            ],
            [
                9840,
                9939
            ],
            [
                9939,
                9996
            ],
            [
                9996,
                10052
            ],
            [
                10052,
                10107
            ],
            [
                10107,
                10137
            ],
            [
                10137,
                10172
            ],
            [
                10172,
                10241
            ],
            [
                10241,
                10261
            ],
            [
                10261,
                10395
            ],
            [
                10395,
                10646
            ],
            [
                10646,
                10953
            ],
            [
                10953,
                11104
            ],
            [
                11104,
                11223
            ],
            [
                11223,
                11296
            ],
            [
                11296,
                11444
            ],
            [
                11444,
                11587
            ],
            [
                11587,
                11686
            ],
            [
                11686,
                11700
            ],
            [
                11700,
                11724
            ],
            [
                11724,
                11763
            ],
            [
                11763,
                11949
            ],
            [
                11949,
                12048
            ],
            [
                12048,
                12226
            ],
            [
                12226,
                12240
            ],
            [
                12240,
                12254
            ],
            [
                12254,
                12395
            ],
            [
                12395,
                12493
            ],
            [
                12493,
                12684
            ],
            [
                12684,
                12801
            ],
            [
                12801,
                12961
            ],
            [
                12961,
                13188
            ],
            [
                13188,
                13225
            ],
            [
                13225,
                13237
            ],
            [
                13237,
                13279
            ],
            [
                13279,
                13345
            ],
            [
                13345,
                13387
            ],
            [
                13387,
                13487
            ],
            [
                13487,
                13569
            ],
            [
                13569,
                13739
            ],
            [
                13739,
                13962
            ],
            [
                13962,
                14034
            ],
            [
                14034,
                14137
            ],
            [
                14137,
                14271
            ],
            [
                14271,
                14372
            ],
            [
                14372,
                14410
            ],
            [
                14410,
                14438
            ],
            [
                14438,
                14519
            ],
            [
                14519,
                14584
            ],
            [
                14584,
                14689
            ],
            [
                14689,
                14795
            ],
            [
                14795,
                14843
            ],
            [
                14843,
                14915
            ],
            [
                14915,
                15170
            ],
            [
                15170,
                15319
            ],
            [
                15319,
                15522
            ],
            [
                15522,
                15558
            ],
            [
                15558,
                15914
            ],
            [
                15914,
                16136
            ],
            [
                16136,
                16274
            ],
            [
                16274,
                16416
            ],
            [
                16416,
                16566
            ],
            [
                16566,
                16629
            ],
            [
                16629,
                16741
            ],
            [
                16741,
                16789
            ],
            [
                16789,
                16797
            ],
            [
                16797,
                16892
            ],
            [
                16892,
                16916
            ],
            [
                16916,
                16981
            ],
            [
                16981,
                17133
            ],
            [
                17133,
                17206
            ],
            [
                17206,
                17293
            ],
            [
                17293,
                17371
            ],
            [
                17371,
                17441
            ],
            [
                17441,
                17576
            ],
            [
                17576,
                17663
            ],
            [
                17663,
                17806
            ],
            [
                17806,
                17969
            ],
            [
                17969,
                18103
            ],
            [
                18103,
                18176
            ],
            [
                18176,
                18282
            ],
            [
                18282,
                18355
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                28,
                42
            ],
            [
                67,
                81
            ],
            [
                112,
                116
            ],
            [
                92,
                106
            ],
            [
                132,
                134
            ],
            [
                156,
                158
            ],
            [
                178,
                192
            ],
            [
                211,
                243
            ],
            [
                270,
                293
            ],
            [
                293,
                321
            ],
            [
                495,
                498
            ],
            [
                349,
                352
            ],
            [
                508,
                520
            ],
            [
                478,
                480
            ],
            [
                520,
                535
            ],
            [
                371,
                381
            ],
            [
                550,
                555
            ],
            [
                393,
                394
            ],
            [
                590,
                605
            ],
            [
                627,
                640
            ],
            [
                642,
                673
            ],
            [
                673,
                677
            ],
            [
                703,
                705
            ],
            [
                753,
                757
            ],
            [
                769,
                781
            ],
            [
                834,
                843
            ],
            [
                848,
                874
            ],
            [
                875,
                916
            ],
            [
                937,
                939
            ],
            [
                939,
                1012
            ],
            [
                1031,
                1034
            ],
            [
                1034,
                1049
            ],
            [
                1088,
                1118
            ],
            [
                1123,
                1131
            ],
            [
                1131,
                1159
            ],
            [
                1388,
                1435
            ],
            [
                1435,
                1511
            ],
            [
                1518,
                1526
            ],
            [
                1597,
                1629
            ],
            [
                1638,
                1665
            ],
            [
                1665,
                1718
            ],
            [
                1788,
                1790
            ],
            [
                1790,
                1807
            ],
            [
                1815,
                1825
            ],
            [
                1826,
                1833
            ],
            [
                1838,
                1851
            ],
            [
                1879,
                1908
            ],
            [
                2032,
                2091
            ],
            [
                2105,
                2114
            ],
            [
                2124,
                2161
            ],
            [
                2251,
                2262
            ],
            [
                2268,
                2284
            ],
            [
                2234,
                2237
            ],
            [
                2291,
                2322
            ],
            [
                2378,
                2379
            ],
            [
                2333,
                2335
            ],
            [
                2462,
                2464
            ],
            [
                2324,
                2326
            ],
            [
                2396,
                2398
            ],
            [
                2374,
                2378
            ],
            [
                2490,
                2492
            ],
            [
                2492,
                2508
            ],
            [
                2538,
                2606
            ],
            [
                2756,
                2758
            ],
            [
                2778,
                2785
            ],
            [
                2875,
                2878
            ],
            [
                2800,
                2874
            ],
            [
                2879,
                2911
            ],
            [
                2964,
                2966
            ],
            [
                2986,
                2998
            ],
            [
                2999,
                3025
            ],
            [
                2971,
                2972
            ],
            [
                3030,
                3044
            ],
            [
                3066,
                3109
            ],
            [
                3026,
                3029
            ],
            [
                3118,
                3123
            ],
            [
                3138,
                3141
            ],
            [
                3157,
                3159
            ],
            [
                3176,
                3178
            ],
            [
                3178,
                3292
            ],
            [
                3292,
                3335
            ],
            [
                3373,
                3375
            ],
            [
                3388,
                3428
            ],
            [
                3429,
                3460
            ],
            [
                3503,
                3525
            ],
            [
                3472,
                3476
            ],
            [
                3525,
                3527
            ],
            [
                3859,
                3875
            ],
            [
                3875,
                3912
            ],
            [
                3937,
                3939
            ],
            [
                4017,
                4031
            ],
            [
                4032,
                4038
            ],
            [
                4058,
                4077
            ],
            [
                4047,
                4054
            ],
            [
                4106,
                4108
            ],
            [
                4206,
                4209
            ],
            [
                4215,
                4231
            ],
            [
                4130,
                4131
            ],
            [
                4255,
                4258
            ],
            [
                4139,
                4141
            ],
            [
                4407,
                4464
            ],
            [
                4465,
                4496
            ],
            [
                4502,
                4566
            ],
            [
                4575,
                4579
            ],
            [
                4579,
                4582
            ],
            [
                4582,
                4613
            ],
            [
                4646,
                4648
            ],
            [
                4648,
                4694
            ],
            [
                4694,
                4705
            ],
            [
                4711,
                4728
            ],
            [
                4735,
                4784
            ],
            [
                4795,
                4829
            ],
            [
                4857,
                4859
            ],
            [
                4964,
                4968
            ],
            [
                4931,
                4935
            ],
            [
                4895,
                4896
            ],
            [
                4969,
                5047
            ],
            [
                5251,
                5253
            ],
            [
                5349,
                5413
            ],
            [
                5425,
                5431
            ],
            [
                5283,
                5284
            ],
            [
                5571,
                5587
            ],
            [
                5646,
                5648
            ],
            [
                5648,
                5705
            ],
            [
                5746,
                5749
            ],
            [
                5719,
                5733
            ],
            [
                5764,
                5765
            ],
            [
                5766,
                5798
            ],
            [
                5798,
                5821
            ],
            [
                6024,
                6026
            ],
            [
                5952,
                5966
            ],
            [
                6031,
                6087
            ],
            [
                6087,
                6145
            ],
            [
                6154,
                6161
            ],
            [
                6201,
                6202
            ],
            [
                6163,
                6183
            ],
            [
                6189,
                6201
            ],
            [
                6236,
                6238
            ],
            [
                6238,
                6302
            ],
            [
                6325,
                6326
            ],
            [
                6327,
                6404
            ],
            [
                6404,
                6468
            ],
            [
                6468,
                6526
            ],
            [
                6570,
                6572
            ],
            [
                6572,
                6603
            ],
            [
                6603,
                6614
            ],
            [
                6677,
                6699
            ],
            [
                6784,
                6809
            ],
            [
                6812,
                6849
            ],
            [
                6865,
                6867
            ],
            [
                6852,
                6859
            ],
            [
                6898,
                6899
            ],
            [
                6904,
                6932
            ],
            [
                6932,
                7052
            ],
            [
                7052,
                7118
            ],
            [
                7129,
                7135
            ],
            [
                7148,
                7160
            ],
            [
                7161,
                7172
            ],
            [
                7172,
                7221
            ],
            [
                7230,
                7232
            ],
            [
                7232,
                7252
            ],
            [
                7252,
                7274
            ],
            [
                7277,
                7291
            ],
            [
                7291,
                7307
            ],
            [
                7307,
                7347
            ],
            [
                7347,
                7395
            ],
            [
                7403,
                7406
            ],
            [
                7406,
                7428
            ],
            [
                7428,
                7461
            ],
            [
                7465,
                7534
            ],
            [
                7534,
                7579
            ],
            [
                7584,
                7647
            ],
            [
                7647,
                7678
            ],
            [
                7678,
                7713
            ],
            [
                7713,
                7740
            ],
            [
                7769,
                7773
            ],
            [
                7789,
                7870
            ],
            [
                7961,
                8048
            ],
            [
                8048,
                8082
            ],
            [
                8082,
                8180
            ],
            [
                8180,
                8199
            ],
            [
                8217,
                8218
            ],
            [
                8220,
                8241
            ],
            [
                8250,
                8253
            ],
            [
                8282,
                8354
            ],
            [
                8354,
                8442
            ],
            [
                8487,
                8490
            ],
            [
                8532,
                8579
            ],
            [
                8579,
                8604
            ],
            [
                8604,
                8618
            ],
            [
                8620,
                8662
            ],
            [
                8662,
                8711
            ],
            [
                8711,
                8794
            ],
            [
                8794,
                8810
            ],
            [
                8810,
                8923
            ],
            [
                8929,
                8931
            ],
            [
                8964,
                8967
            ],
            [
                8967,
                9009
            ],
            [
                9009,
                9056
            ],
            [
                9056,
                9068
            ],
            [
                9108,
                9110
            ],
            [
                9147,
                9150
            ],
            [
                9222,
                9256
            ],
            [
                9261,
                9269
            ],
            [
                9282,
                9308
            ],
            [
                9308,
                9328
            ],
            [
                9335,
                9348
            ],
            [
                9353,
                9358
            ],
            [
                9362,
                9395
            ],
            [
                9395,
                9401
            ],
            [
                9416,
                9421
            ],
            [
                9425,
                9430
            ],
            [
                9502,
                9573
            ],
            [
                9580,
                9615
            ],
            [
                9615,
                9682
            ],
            [
                9778,
                9779
            ],
            [
                9840,
                9841
            ],
            [
                9853,
                9938
            ],
            [
                9939,
                9969
            ],
            [
                9978,
                9995
            ],
            [
                9996,
                10052
            ],
            [
                10052,
                10107
            ],
            [
                10107,
                10137
            ],
            [
                10137,
                10172
            ],
            [
                10172,
                10241
            ],
            [
                10241,
                10261
            ],
            [
                10261,
                10290
            ],
            [
                10330,
                10331
            ],
            [
                10362,
                10395
            ],
            [
                10395,
                10401
            ],
            [
                10460,
                10536
            ],
            [
                10563,
                10577
            ],
            [
                10644,
                10646
            ],
            [
                10646,
                10683
            ],
            [
                10693,
                10701
            ],
            [
                10951,
                10953
            ],
            [
                10953,
                10955
            ],
            [
                10973,
                10989
            ],
            [
                11102,
                11103
            ],
            [
                11000,
                11035
            ],
            [
                11132,
                11135
            ],
            [
                11116,
                11120
            ],
            [
                11164,
                11174
            ],
            [
                11107,
                11112
            ],
            [
                11179,
                11202
            ],
            [
                11113,
                11115
            ],
            [
                11207,
                11223
            ],
            [
                11223,
                11296
            ],
            [
                11296,
                11354
            ],
            [
                11447,
                11513
            ],
            [
                11516,
                11567
            ],
            [
                11585,
                11587
            ],
            [
                11587,
                11599
            ],
            [
                11608,
                11686
            ],
            [
                11686,
                11688
            ],
            [
                11692,
                11700
            ],
            [
                11700,
                11724
            ],
            [
                11724,
                11761
            ],
            [
                11819,
                11820
            ],
            [
                11830,
                11834
            ],
            [
                11810,
                11813
            ],
            [
                11862,
                11868
            ],
            [
                11954,
                11959
            ],
            [
                11949,
                11953
            ],
            [
                11964,
                11982
            ],
            [
                11761,
                11762
            ],
            [
                12259,
                12268
            ],
            [
                12289,
                12353
            ],
            [
                12374,
                12395
            ],
            [
                12395,
                12399
            ],
            [
                12444,
                12450
            ],
            [
                12457,
                12493
            ],
            [
                12493,
                12544
            ],
            [
                12682,
                12684
            ],
            [
                12912,
                12961
            ],
            [
                12961,
                13056
            ],
            [
                13063,
                13103
            ],
            [
                13122,
                13188
            ],
            [
                13188,
                13225
            ],
            [
                13225,
                13237
            ],
            [
                13237,
                13262
            ],
            [
                13277,
                13279
            ],
            [
                13279,
                13312
            ],
            [
                13314,
                13315
            ],
            [
                13324,
                13343
            ],
            [
                13322,
                13323
            ],
            [
                13345,
                13387
            ],
            [
                13387,
                13454
            ],
            [
                13466,
                13487
            ],
            [
                13487,
                13518
            ],
            [
                13536,
                13569
            ],
            [
                13569,
                13631
            ],
            [
                13669,
                13672
            ],
            [
                13679,
                13706
            ],
            [
                13721,
                13739
            ],
            [
                13739,
                13836
            ],
            [
                13847,
                13852
            ],
            [
                13925,
                13962
            ],
            [
                13967,
                13969
            ],
            [
                13994,
                14009
            ],
            [
                14079,
                14086
            ],
            [
                14130,
                14137
            ],
            [
                14137,
                14140
            ],
            [
                14158,
                14210
            ],
            [
                14222,
                14228
            ],
            [
                14269,
                14271
            ],
            [
                14271,
                14363
            ],
            [
                14442,
                14508
            ],
            [
                14516,
                14519
            ],
            [
                14519,
                14524
            ],
            [
                14547,
                14584
            ],
            [
                14600,
                14610
            ],
            [
                14628,
                14635
            ],
            [
                14643,
                14650
            ],
            [
                14651,
                14689
            ],
            [
                14689,
                14723
            ],
            [
                14730,
                14795
            ],
            [
                15005,
                15024
            ],
            [
                14918,
                14921
            ],
            [
                15030,
                15090
            ],
            [
                15028,
                15030
            ],
            [
                15101,
                15108
            ],
            [
                15112,
                15124
            ],
            [
                15141,
                15151
            ],
            [
                15168,
                15170
            ],
            [
                15170,
                15221
            ],
            [
                15227,
                15234
            ],
            [
                15264,
                15301
            ],
            [
                15312,
                15319
            ],
            [
                15319,
                15322
            ],
            [
                15332,
                15375
            ],
            [
                15391,
                15521
            ],
            [
                15522,
                15558
            ],
            [
                15558,
                15569
            ],
            [
                15703,
                15714
            ],
            [
                15825,
                15831
            ],
            [
                15734,
                15786
            ],
            [
                15800,
                15804
            ],
            [
                15814,
                15821
            ],
            [
                15838,
                15843
            ],
            [
                15633,
                15636
            ],
            [
                15575,
                15578
            ],
            [
                15851,
                15855
            ],
            [
                15874,
                15882
            ],
            [
                15912,
                15914
            ],
            [
                15914,
                15942
            ],
            [
                15947,
                15953
            ],
            [
                16017,
                16071
            ],
            [
                16102,
                16134
            ],
            [
                16015,
                16016
            ],
            [
                16134,
                16136
            ],
            [
                16136,
                16138
            ],
            [
                16152,
                16274
            ],
            [
                16285,
                16291
            ],
            [
                16297,
                16314
            ],
            [
                16323,
                16331
            ],
            [
                16336,
                16354
            ],
            [
                16367,
                16415
            ],
            [
                17297,
                17371
            ],
            [
                17441,
                17487
            ],
            [
                17576,
                17584
            ],
            [
                17593,
                17663
            ],
            [
                17809,
                17813
            ],
            [
                17837,
                17839
            ],
            [
                17853,
                17876
            ],
            [
                17885,
                17919
            ],
            [
                17935,
                17969
            ],
            [
                17979,
                18085
            ],
            [
                18101,
                18103
            ],
            [
                18103,
                18176
            ],
            [
                18214,
                18282
            ],
            [
                18282,
                18355
            ]
        ],
        "row_chars": [
            [
                0,
                134
            ],
            [
                134,
                192
            ],
            [
                192,
                293
            ],
            [
                293,
                578
            ],
            [
                578,
                673
            ],
            [
                673,
                875
            ],
            [
                875,
                939
            ],
            [
                939,
                1034
            ],
            [
                1034,
                1131
            ],
            [
                1131,
                1435
            ],
            [
                1435,
                1665
            ],
            [
                1665,
                1790
            ],
            [
                1790,
                1909
            ],
            [
                1909,
                1960
            ],
            [
                1960,
                2032
            ],
            [
                2032,
                2161
            ],
            [
                2161,
                2230
            ],
            [
                2230,
                2492
            ],
            [
                2492,
                2758
            ],
            [
                2758,
                2966
            ],
            [
                2966,
                3178
            ],
            [
                3178,
                3292
            ],
            [
                3292,
                3429
            ],
            [
                3429,
                3527
            ],
            [
                3527,
                3677
            ],
            [
                3677,
                3762
            ],
            [
                3762,
                3875
            ],
            [
                3875,
                4031
            ],
            [
                4031,
                4080
            ],
            [
                4080,
                4465
            ],
            [
                4465,
                4582
            ],
            [
                4582,
                4648
            ],
            [
                4648,
                4694
            ],
            [
                4694,
                4829
            ],
            [
                4829,
                5047
            ],
            [
                5047,
                5163
            ],
            [
                5163,
                5246
            ],
            [
                5246,
                5648
            ],
            [
                5648,
                5766
            ],
            [
                5766,
                5798
            ],
            [
                5798,
                5821
            ],
            [
                5821,
                5920
            ],
            [
                5920,
                6087
            ],
            [
                6087,
                6238
            ],
            [
                6238,
                6327
            ],
            [
                6327,
                6404
            ],
            [
                6404,
                6468
            ],
            [
                6468,
                6572
            ],
            [
                6572,
                6603
            ],
            [
                6603,
                6614
            ],
            [
                6614,
                6677
            ],
            [
                6677,
                6849
            ],
            [
                6849,
                6932
            ],
            [
                6932,
                7052
            ],
            [
                7052,
                7172
            ],
            [
                7172,
                7232
            ],
            [
                7232,
                7252
            ],
            [
                7252,
                7291
            ],
            [
                7291,
                7307
            ],
            [
                7307,
                7347
            ],
            [
                7347,
                7406
            ],
            [
                7406,
                7428
            ],
            [
                7428,
                7534
            ],
            [
                7534,
                7647
            ],
            [
                7647,
                7678
            ],
            [
                7678,
                7713
            ],
            [
                7713,
                7740
            ],
            [
                7740,
                7769
            ],
            [
                7769,
                8048
            ],
            [
                8048,
                8082
            ],
            [
                8082,
                8180
            ],
            [
                8180,
                8253
            ],
            [
                8253,
                8282
            ],
            [
                8282,
                8354
            ],
            [
                8354,
                8490
            ],
            [
                8490,
                8532
            ],
            [
                8532,
                8579
            ],
            [
                8579,
                8604
            ],
            [
                8604,
                8662
            ],
            [
                8662,
                8711
            ],
            [
                8711,
                8794
            ],
            [
                8794,
                8810
            ],
            [
                8810,
                8967
            ],
            [
                8967,
                9009
            ],
            [
                9009,
                9056
            ],
            [
                9056,
                9068
            ],
            [
                9068,
                9308
            ],
            [
                9308,
                9395
            ],
            [
                9395,
                9615
            ],
            [
                9615,
                9780
            ],
            [
                9780,
                9827
            ],
            [
                9827,
                9840
            ],
            [
                9840,
                9939
            ],
            [
                9939,
                9996
            ],
            [
                9996,
                10052
            ],
            [
                10052,
                10107
            ],
            [
                10107,
                10137
            ],
            [
                10137,
                10172
            ],
            [
                10172,
                10241
            ],
            [
                10241,
                10261
            ],
            [
                10261,
                10395
            ],
            [
                10395,
                10646
            ],
            [
                10646,
                10953
            ],
            [
                10953,
                11223
            ],
            [
                11223,
                11296
            ],
            [
                11296,
                11587
            ],
            [
                11587,
                11686
            ],
            [
                11686,
                11700
            ],
            [
                11700,
                11724
            ],
            [
                11724,
                12048
            ],
            [
                12048,
                12226
            ],
            [
                12226,
                12240
            ],
            [
                12240,
                12254
            ],
            [
                12254,
                12395
            ],
            [
                12395,
                12493
            ],
            [
                12493,
                12684
            ],
            [
                12684,
                12801
            ],
            [
                12801,
                12961
            ],
            [
                12961,
                13188
            ],
            [
                13188,
                13225
            ],
            [
                13225,
                13237
            ],
            [
                13237,
                13279
            ],
            [
                13279,
                13387
            ],
            [
                13387,
                13487
            ],
            [
                13487,
                13569
            ],
            [
                13569,
                13739
            ],
            [
                13739,
                13962
            ],
            [
                13962,
                14137
            ],
            [
                14137,
                14271
            ],
            [
                14271,
                14372
            ],
            [
                14372,
                14410
            ],
            [
                14410,
                14438
            ],
            [
                14438,
                14519
            ],
            [
                14519,
                14584
            ],
            [
                14584,
                14689
            ],
            [
                14689,
                14795
            ],
            [
                14795,
                14843
            ],
            [
                14843,
                14915
            ],
            [
                14915,
                15170
            ],
            [
                15170,
                15319
            ],
            [
                15319,
                15522
            ],
            [
                15522,
                15558
            ],
            [
                15558,
                15914
            ],
            [
                15914,
                16136
            ],
            [
                16136,
                16274
            ],
            [
                16274,
                16416
            ],
            [
                16416,
                16566
            ],
            [
                16566,
                16629
            ],
            [
                16629,
                16741
            ],
            [
                16741,
                16789
            ],
            [
                16789,
                16797
            ],
            [
                16797,
                16892
            ],
            [
                16892,
                16916
            ],
            [
                16916,
                16981
            ],
            [
                16981,
                17133
            ],
            [
                17133,
                17206
            ],
            [
                17206,
                17293
            ],
            [
                17293,
                17371
            ],
            [
                17371,
                17441
            ],
            [
                17441,
                17663
            ],
            [
                17663,
                17806
            ],
            [
                17806,
                17969
            ],
            [
                17969,
                18103
            ],
            [
                18103,
                18176
            ],
            [
                18176,
                18282
            ],
            [
                18282,
                18355
            ]
        ]
    },
    "abridged": {
        "text": "It was nearly seven in the evening when the woman left Vavasor's room. Now he needed to do something. He must dine, unless he meant to shoot himself at once. But he had no such intention - not for that evening at least, and he locked the pistol away again.\nThen he took up some leaflets about steam packets which were lying on his table. They listed ships of various lines that went to New York, or carried emigrants to New Zealand and Australia.\n\"That's a good line,\" said he, as he read one. \"They generally go to the bottom, and save a man from any further trouble.\" Then he dressed, and went out to his club for dinner.\nLondon was still fairly full, and the dining-room at the club was crowded. Men came up to him condoling with him, telling him that he was well rid of a nuisance, or that there would be another election in a year or two. To all these little speeches he made cheerful replies. Calder Jones came over and talked about hunting, and Vavasor said he intended being at Roebury in November.\nHe remained in the smoking-room till nearly eleven; then he went home, and stayed up half the night destroying papers. Every compartment of his desk was emptied out, and the contents thrown into the flames; he did not even bother to look at many of them. Then he selected some clothes, and packed up two portmanteaus, folding his coats with care. Next he took out a bag of sovereigns, and, pouring them out upon the table, he counted them into parcels of twenty-five each. Rolling them up in paper, he divided them among the two portmanteaus, a dressing-bag and a travelling desk, which he filled with paper and pens, but no documents. He carefully looked through his linen, and anything that had been marked with more than his initials he rejected. Then he took out a bundle of printed cards, on which was inscribed the name of Gregory Vance.\nWhen all was finished, he stood contemplating his work with satisfaction. Then he went to bed.\nHe was up early the next morning, and spoke to his landlady. He was going that very day, he said. He paid her what he owed her; for he had never been so foolish as to owe debts where he lived.\n\"There will be some things left here, Mrs. Bunsby,\" he said, \"and I will get you to keep them till I send for them.\" Mrs. Bunsby said that she would. After that interview she never saw him again.\nWhen he was alone he put on a morning coat, and taking up the pistol, placed it in his pocket, and sallied forth. He went West, across Trafalgar Square to Pall Mall East, and then turned up Suffolk Street. He walked up the street till he reached the house of Mr. Jones, the tailor, where John Grey lodged.\nVavasor rang the bell, and as soon as the servant came he pushed past her into the house.\n\"Mr. Grey is at home,\" he said. \"I will go up to him.\" He went ahead of her up the stairs, entered Mr. Grey's room and closed the door behind him.\nGrey was sitting near the open window, in a dressing-gown, reading, with the breakfast things on the table. As soon as he saw George Vavasor, he rose from his chair quickly.\n\"Mr. Vavasor,\" he said, \"I hardly expected to see you in my lodgings again!\"\n\"I dare say not,\" said Vavasor; \"but, nevertheless, here I am.\" He kept his right hand in the pocket which held the pistol.\n\"May I ask why you have come?\" said Grey.\n\"I have come to declare that you are a blackguard - to spit in your face, and defy you.\" And he did what he said, though without any serious result. \"I have come here to see if you are man enough to resent any insult that I can offer you; but I doubt whether you are.\"\n\"Nothing that you can say to me, Mr. Vavasor, will have any effect - except, of course, to annoy me.\"\n\"And I mean to annoy you, too, before I have done. Will you fight me?\"\n\"Fight a duel with you - with pistols? Certainly not.\"\n\"Then you are a coward, as I supposed.\"\n\"I should be a fool if I were to do such a thing.\"\n\"Look here, Mr. Grey. You managed to worm yourself into intimacy with my cousin, Miss Vavasor, and to become engaged to her. When she found out what you were, how paltry, mean, and vile, she changed her mind, and bade you leave her.\"\n\"Are you here at her request?\"\n\"I am here as her representative.\"\n\"Self-appointed, I think.\"\n\"I am her affianced husband; and I find that, in spite of all that she has said to you, you still persecute her by going to her house, and forcing yourself upon her presence. Now, I give you two alternatives. You shall either give me your written promise never to go near her again, or you shall fight me.\"\n\"I shall do neither, as you know very well.\"\n\"If you have courage enough to fight me, I will meet you in any country. I will fight you here in London, or, if you are afraid of that, I will go over to France.\"\n\"I don't want to have anything to do with you.\"\n\"Then you are a coward.\"\n\"Perhaps I am; but your saying so will not make me one.\"\n\"You are a coward, and a liar, and a blackguard. I have given you the option of behaving like a gentleman, and you have refused it. Now, look here. I have come here with arms, and I do not intend to leave this room without using them, unless you will promise to fight me.\" And he took the pistol out of his pocket.\n\"Do you mean that you are going to murder me?\" Grey asked. He was at a distance from the bell, and his visitor was standing between him and the door. He had to think what he might best do, and act upon his decision instantly. He was not timid, and he did not think, even now, that this disappointed, ruined man had come with any intention of killing him. But he knew that a pistol in the hands of an angry man is dangerous.\n\"You shall not leave this room alive unless you promise to meet me, and fight it out.\"\nUpon hearing this, Grey turned towards the bell.\n\"If you move a step, I will fire at you,\" said Vavasor. Grey paused a moment, and looked him full in the face. \"I will,\" said Vavasor again.\n\"That would be murder,\" said Grey.\n\"Don't think that you will frighten me by ugly words,\" said Vavasor. \"I am beyond that.\"\nGrey had stopped for a moment; and then he went on to the bell. He had thought of rushing across the room at his adversary, calculating that a shot might miss him. But his chief object was to avoid any conflict. So he moved towards the bell.\nAlthough he trusted that Vavasor would not fire at him, he was aware that his fatal hour might have come, and that eternity could be close upon him. Something of the spirit of a prayer flashed across his mind as he moved. Then he heard the click of the pistol's hammer as it fell, felt something in the air, and knew that the pistol had been fired - but he did not know whether the shot had struck him. His hand was on the bell-handle, and he had pulled it, before he was sure that he was unhurt.\n\"D--ation!\" exclaimed the murderer. But he did not pull the trigger again, forgetting, in his excitement, that there were five other barrels. He turned, hurried down the stairs, and made his way out into the street, passing the girl on his way.\nGrey turned to look for the bullet or its mark. He soon found the little hole in the window-shutter. The shot must have passed close beneath his ear. He remembered to have heard the click of the hammer, but he could not remember the sound of the shot, and when the girl entered the room, he saw from her manner that she was unaware that firearms had been used.\n\"Has that gentleman left the house?\" Grey asked. The girl said that he had. \"Don't admit him again,\" said he; \"if you can avoid it, for I believe he is not in his right senses.\" Then he asked for Mr. Jones, his landlord, and in a few minutes the tailor was with him.\nDuring those few minutes he had to resolve what he would do now. Would he put the police at once upon the track of the murderer - the cousin of the woman whom he wished to make his wife? That cross-examination which he would have to undergo at the police-office, and again probably in court, was very vivid to his imagination. Yet he needed to do something in case Vavasor made some attempt again. But he need not now say anything about the pistol to the tailor.\n\"Mr. Jones,\" he said, \"that man whom I had to put out of the room once before, has been here. We must take some steps to prevent his getting in again, if we can.\"\nJones offered to go at once to the police. However, Mr. Grey said that he himself would seek assistance from some magistrate. Jones promised to be very vigilant about watching the door; and then John Grey sat down to his breakfast. The more he thought about what had happened, the more strongly he was convinced that he could not allow it to pass without some precaution.\nAt eleven o'clock he went to Scotland Yard, and saw a senior officer, and told him all the circumstances, confidentially. The officer recommended an equally confidential magistrate; and towards evening a very confidential policeman in plain clothes paid a visit to Vavasor's lodgings in Cecil Street.\nBut Vavasor lodged there no longer. Mrs. Bunsby stated that he had left her house in a cab at ten o'clock that morning, with his luggage, and that she thought he was gone for good.\nHe had gone for good, and at that moment he was leaning over the side of an American steamer which weighed her anchor in the Mersey, at Liverpool. He had boarded at six o'clock, and it was not till the next day that the cabman was traced who had carried him to Euston Square Station. Once it was known that he had set sail for America, it was not thought worthwhile to take any further steps towards arresting him.\nSo now George Vavasor vanishes from our pages, and will be heard of no more. His disappearance was a nine days' wonder, but Mr. Grey told the story to no one, till he told it to Mr. Palliser at Lucerne. Kate received no news of her brother, and her stay in London with her aunt had nearly ended before she knew that he was gone. The rumour reached her through Captain Bellfield, and she learned what few facts she knew from Mrs. Bunsby.\n\"He was always mysterious,\" said Mrs. Greenow, \"and now he has vanished. I think it will be much better that he should not come back again.\" Perhaps Kate was of the same opinion, but, if so, she kept it to herself.",
        "paragraph_chars": [
            [
                0,
                257
            ],
            [
                257,
                447
            ],
            [
                447,
                624
            ],
            [
                624,
                1007
            ],
            [
                1007,
                1851
            ],
            [
                1851,
                1946
            ],
            [
                1946,
                2139
            ],
            [
                2139,
                2335
            ],
            [
                2335,
                2641
            ],
            [
                2641,
                2731
            ],
            [
                2731,
                2878
            ],
            [
                2878,
                3052
            ],
            [
                3052,
                3129
            ],
            [
                3129,
                3253
            ],
            [
                3253,
                3295
            ],
            [
                3295,
                3564
            ],
            [
                3564,
                3666
            ],
            [
                3666,
                3737
            ],
            [
                3737,
                3792
            ],
            [
                3792,
                3832
            ],
            [
                3832,
                3883
            ],
            [
                3883,
                4117
            ],
            [
                4117,
                4148
            ],
            [
                4148,
                4183
            ],
            [
                4183,
                4210
            ],
            [
                4210,
                4517
            ],
            [
                4517,
                4562
            ],
            [
                4562,
                4726
            ],
            [
                4726,
                4774
            ],
            [
                4774,
                4799
            ],
            [
                4799,
                4856
            ],
            [
                4856,
                5171
            ],
            [
                5171,
                5595
            ],
            [
                5595,
                5682
            ],
            [
                5682,
                5731
            ],
            [
                5731,
                5872
            ],
            [
                5872,
                5907
            ],
            [
                5907,
                5996
            ],
            [
                5996,
                6238
            ],
            [
                6238,
                6735
            ],
            [
                6735,
                6980
            ],
            [
                6980,
                7341
            ],
            [
                7341,
                7608
            ],
            [
                7608,
                8071
            ],
            [
                8071,
                8234
            ],
            [
                8234,
                8606
            ],
            [
                8606,
                8907
            ],
            [
                8907,
                9088
            ],
            [
                9088,
                9503
            ],
            [
                9503,
                9940
            ],
            [
                9940,
                10154
            ]
        ],
        "segment_chars": [
            [
                0,
                71
            ],
            [
                71,
                102
            ],
            [
                102,
                158
            ],
            [
                158,
                257
            ],
            [
                257,
                338
            ],
            [
                338,
                447
            ],
            [
                447,
                494
            ],
            [
                494,
                570
            ],
            [
                570,
                624
            ],
            [
                624,
                699
            ],
            [
                699,
                844
            ],
            [
                844,
                899
            ],
            [
                899,
                1007
            ],
            [
                1007,
                1126
            ],
            [
                1126,
                1262
            ],
            [
                1262,
                1354
            ],
            [
                1354,
                1480
            ],
            [
                1480,
                1643
            ],
            [
                1643,
                1757
            ],
            [
                1757,
                1851
            ],
            [
                1851,
                1925
            ],
            [
                1925,
                1946
            ],
            [
                1946,
                2007
            ],
            [
                2007,
                2044
            ],
            [
                2044,
                2139
            ],
            [
                2139,
                2256
            ],
            [
                2256,
                2289
            ],
            [
                2289,
                2335
            ],
            [
                2335,
                2449
            ],
            [
                2449,
                2541
            ],
            [
                2541,
                2641
            ],
            [
                2641,
                2731
            ],
            [
                2731,
                2763
            ],
            [
                2763,
                2786
            ],
            [
                2786,
                2878
            ],
            [
                2878,
                2986
            ],
            [
                2986,
                3052
            ],
            [
                3052,
                3129
            ],
            [
                3129,
                3193
            ],
            [
                3193,
                3253
            ],
            [
                3253,
                3284
            ],
            [
                3284,
                3295
            ],
            [
                3295,
                3384
            ],
            [
                3384,
                3444
            ],
            [
                3444,
                3564
            ],
            [
                3564,
                3666
            ],
            [
                3666,
                3717
            ],
            [
                3717,
                3737
            ],
            [
                3737,
                3776
            ],
            [
                3776,
                3792
            ],
            [
                3792,
                3832
            ],
            [
                3832,
                3883
            ],
            [
                3883,
                3905
            ],
            [
                3905,
                4008
            ],
            [
                4008,
                4117
            ],
            [
                4117,
                4148
            ],
            [
                4148,
                4183
            ],
            [
                4183,
                4210
            ],
            [
                4210,
                4385
            ],
            [
                4385,
                4419
            ],
            [
                4419,
                4517
            ],
            [
                4517,
                4562
            ],
            [
                4562,
                4635
            ],
            [
                4635,
                4726
            ],
            [
                4726,
                4774
            ],
            [
                4774,
                4799
            ],
            [
                4799,
                4856
            ],
            [
                4856,
                4905
            ],
            [
                4905,
                4988
            ],
            [
                4988,
                5004
            ],
            [
                5004,
                5129
            ],
            [
                5129,
                5171
            ],
            [
                5171,
                5218
            ],
            [
                5218,
                5230
            ],
            [
                5230,
                5321
            ],
            [
                5321,
                5397
            ],
            [
                5397,
                5526
            ],
            [
                5526,
                5595
            ],
            [
                5595,
                5682
            ],
            [
                5682,
                5731
            ],
            [
                5731,
                5787
            ],
            [
                5787,
                5842
            ],
            [
                5842,
                5872
            ],
            [
                5872,
                5907
            ],
            [
                5907,
                5976
            ],
            [
                5976,
                5996
            ],
            [
                5996,
                6060
            ],
            [
                6060,
                6160
            ],
            [
                6160,
                6208
            ],
            [
                6208,
                6238
            ],
            [
                6238,
                6387
            ],
            [
                6387,
                6460
            ],
            [
                6460,
                6641
            ],
            [
                6641,
                6735
            ],
            [
                6735,
                6747
            ],
            [
                6747,
                6771
            ],
            [
                6771,
                6877
            ],
            [
                6877,
                6980
            ],
            [
                6980,
                7028
            ],
            [
                7028,
                7081
            ],
            [
                7081,
                7130
            ],
            [
                7130,
                7341
            ],
            [
                7341,
                7378
            ],
            [
                7378,
                7390
            ],
            [
                7390,
                7417
            ],
            [
                7417,
                7519
            ],
            [
                7519,
                7608
            ],
            [
                7608,
                7673
            ],
            [
                7673,
                7795
            ],
            [
                7795,
                7935
            ],
            [
                7935,
                8006
            ],
            [
                8006,
                8071
            ],
            [
                8071,
                8165
            ],
            [
                8165,
                8234
            ],
            [
                8234,
                8277
            ],
            [
                8277,
                8360
            ],
            [
                8360,
                8466
            ],
            [
                8466,
                8606
            ],
            [
                8606,
                8728
            ],
            [
                8728,
                8907
            ],
            [
                8907,
                8943
            ],
            [
                8943,
                9088
            ],
            [
                9088,
                9235
            ],
            [
                9235,
                9372
            ],
            [
                9372,
                9503
            ],
            [
                9503,
                9580
            ],
            [
                9580,
                9706
            ],
            [
                9706,
                9832
            ],
            [
                9832,
                9940
            ],
            [
                9940,
                10013
            ],
            [
                10013,
                10081
            ],
            [
                10081,
                10154
            ]
        ],
        "overlap_chars": [
            [
                0,
                19
            ],
            [
                20,
                34
            ],
            [
                35,
                49
            ],
            [
                50,
                54
            ],
            [
                55,
                69
            ],
            [
                69,
                71
            ],
            [
                75,
                77
            ],
            [
                88,
                102
            ],
            [
                102,
                134
            ],
            [
                135,
                158
            ],
            [
                158,
                186
            ],
            [
                189,
                192
            ],
            [
                193,
                196
            ],
            [
                197,
                209
            ],
            [
                210,
                212
            ],
            [
                218,
                233
            ],
            [
                234,
                244
            ],
            [
                250,
                255
            ],
            [
                255,
                256
            ],
            [
                262,
                277
            ],
            [
                293,
                306
            ],
            [
                307,
                338
            ],
            [
                338,
                342
            ],
            [
                356,
                358
            ],
            [
                378,
                382
            ],
            [
                383,
                395
            ],
            [
                407,
                416
            ],
            [
                420,
                446
            ],
            [
                447,
                488
            ],
            [
                492,
                494
            ],
            [
                494,
                567
            ],
            [
                567,
                570
            ],
            [
                570,
                585
            ],
            [
                585,
                615
            ],
            [
                616,
                624
            ],
            [
                624,
                652
            ],
            [
                652,
                699
            ],
            [
                699,
                775
            ],
            [
                776,
                784
            ],
            [
                784,
                816
            ],
            [
                817,
                844
            ],
            [
                844,
                897
            ],
            [
                897,
                899
            ],
            [
                899,
                916
            ],
            [
                922,
                932
            ],
            [
                939,
                946
            ],
            [
                946,
                959
            ],
            [
                977,
                1006
            ],
            [
                1007,
                1066
            ],
            [
                1072,
                1081
            ],
            [
                1089,
                1126
            ],
            [
                1144,
                1155
            ],
            [
                1160,
                1176
            ],
            [
                1177,
                1180
            ],
            [
                1181,
                1212
            ],
            [
                1212,
                1213
            ],
            [
                1214,
                1216
            ],
            [
                1237,
                1239
            ],
            [
                1245,
                1247
            ],
            [
                1253,
                1255
            ],
            [
                1256,
                1260
            ],
            [
                1260,
                1262
            ],
            [
                1262,
                1278
            ],
            [
                1284,
                1352
            ],
            [
                1352,
                1354
            ],
            [
                1359,
                1366
            ],
            [
                1367,
                1370
            ],
            [
                1371,
                1445
            ],
            [
                1446,
                1478
            ],
            [
                1478,
                1480
            ],
            [
                1504,
                1516
            ],
            [
                1522,
                1548
            ],
            [
                1548,
                1549
            ],
            [
                1550,
                1564
            ],
            [
                1565,
                1608
            ],
            [
                1615,
                1618
            ],
            [
                1619,
                1624
            ],
            [
                1625,
                1628
            ],
            [
                1629,
                1631
            ],
            [
                1641,
                1643
            ],
            [
                1643,
                1757
            ],
            [
                1757,
                1800
            ],
            [
                1801,
                1803
            ],
            [
                1810,
                1850
            ],
            [
                1851,
                1882
            ],
            [
                1883,
                1905
            ],
            [
                1906,
                1910
            ],
            [
                1923,
                1925
            ],
            [
                1930,
                1946
            ],
            [
                1946,
                1983
            ],
            [
                1990,
                1992
            ],
            [
                1993,
                2007
            ],
            [
                2007,
                2013
            ],
            [
                2014,
                2033
            ],
            [
                2035,
                2042
            ],
            [
                2044,
                2046
            ],
            [
                2052,
                2055
            ],
            [
                2056,
                2072
            ],
            [
                2072,
                2073
            ],
            [
                2074,
                2077
            ],
            [
                2078,
                2080
            ],
            [
                2081,
                2138
            ],
            [
                2139,
                2170
            ],
            [
                2175,
                2239
            ],
            [
                2240,
                2244
            ],
            [
                2253,
                2256
            ],
            [
                2256,
                2287
            ],
            [
                2287,
                2289
            ],
            [
                2289,
                2335
            ],
            [
                2335,
                2346
            ],
            [
                2347,
                2364
            ],
            [
                2365,
                2414
            ],
            [
                2415,
                2449
            ],
            [
                2449,
                2451
            ],
            [
                2452,
                2456
            ],
            [
                2457,
                2461
            ],
            [
                2461,
                2462
            ],
            [
                2463,
                2541
            ],
            [
                2541,
                2543
            ],
            [
                2544,
                2608
            ],
            [
                2609,
                2615
            ],
            [
                2615,
                2616
            ],
            [
                2623,
                2639
            ],
            [
                2639,
                2641
            ],
            [
                2641,
                2698
            ],
            [
                2711,
                2714
            ],
            [
                2715,
                2729
            ],
            [
                2729,
                2730
            ],
            [
                2731,
                2763
            ],
            [
                2763,
                2786
            ],
            [
                2786,
                2788
            ],
            [
                2807,
                2821
            ],
            [
                2822,
                2878
            ],
            [
                2878,
                2936
            ],
            [
                2937,
                2944
            ],
            [
                2944,
                2945
            ],
            [
                2951,
                2971
            ],
            [
                2972,
                2984
            ],
            [
                2984,
                2986
            ],
            [
                2986,
                3050
            ],
            [
                3050,
                3051
            ],
            [
                3052,
                3129
            ],
            [
                3129,
                3193
            ],
            [
                3193,
                3251
            ],
            [
                3251,
                3253
            ],
            [
                3253,
                3284
            ],
            [
                3284,
                3295
            ],
            [
                3296,
                3318
            ],
            [
                3319,
                3344
            ],
            [
                3347,
                3384
            ],
            [
                3388,
                3390
            ],
            [
                3400,
                3407
            ],
            [
                3407,
                3408
            ],
            [
                3416,
                3444
            ],
            [
                3444,
                3564
            ],
            [
                3564,
                3630
            ],
            [
                3633,
                3639
            ],
            [
                3639,
                3651
            ],
            [
                3655,
                3666
            ],
            [
                3666,
                3715
            ],
            [
                3715,
                3717
            ],
            [
                3717,
                3737
            ],
            [
                3737,
                3759
            ],
            [
                3762,
                3776
            ],
            [
                3776,
                3792
            ],
            [
                3792,
                3832
            ],
            [
                3832,
                3880
            ],
            [
                3880,
                3883
            ],
            [
                3883,
                3905
            ],
            [
                3905,
                3938
            ],
            [
                3939,
                4008
            ],
            [
                4008,
                4053
            ],
            [
                4054,
                4117
            ],
            [
                4117,
                4148
            ],
            [
                4148,
                4183
            ],
            [
                4183,
                4210
            ],
            [
                4211,
                4215
            ],
            [
                4216,
                4297
            ],
            [
                4298,
                4385
            ],
            [
                4385,
                4419
            ],
            [
                4419,
                4517
            ],
            [
                4517,
                4536
            ],
            [
                4536,
                4537
            ],
            [
                4538,
                4559
            ],
            [
                4559,
                4562
            ],
            [
                4563,
                4635
            ],
            [
                4635,
                4723
            ],
            [
                4723,
                4726
            ],
            [
                4727,
                4774
            ],
            [
                4774,
                4799
            ],
            [
                4799,
                4813
            ],
            [
                4814,
                4856
            ],
            [
                4856,
                4905
            ],
            [
                4905,
                4988
            ],
            [
                4988,
                5004
            ],
            [
                5004,
                5117
            ],
            [
                5124,
                5126
            ],
            [
                5126,
                5129
            ],
            [
                5129,
                5171
            ],
            [
                5171,
                5218
            ],
            [
                5218,
                5230
            ],
            [
                5230,
                5232
            ],
            [
                5233,
                5236
            ],
            [
                5251,
                5285
            ],
            [
                5286,
                5294
            ],
            [
                5295,
                5321
            ],
            [
                5321,
                5341
            ],
            [
                5342,
                5355
            ],
            [
                5358,
                5363
            ],
            [
                5364,
                5397
            ],
            [
                5397,
                5403
            ],
            [
                5408,
                5413
            ],
            [
                5413,
                5418
            ],
            [
                5419,
                5490
            ],
            [
                5491,
                5526
            ],
            [
                5526,
                5593
            ],
            [
                5593,
                5594
            ],
            [
                5595,
                5596
            ],
            [
                5596,
                5681
            ],
            [
                5682,
                5712
            ],
            [
                5713,
                5730
            ],
            [
                5731,
                5787
            ],
            [
                5787,
                5842
            ],
            [
                5842,
                5872
            ],
            [
                5872,
                5907
            ],
            [
                5907,
                5976
            ],
            [
                5976,
                5996
            ],
            [
                5996,
                6025
            ],
            [
                6025,
                6026
            ],
            [
                6027,
                6060
            ],
            [
                6060,
                6066
            ],
            [
                6067,
                6143
            ],
            [
                6144,
                6158
            ],
            [
                6158,
                6160
            ],
            [
                6160,
                6197
            ],
            [
                6198,
                6206
            ],
            [
                6206,
                6208
            ],
            [
                6211,
                6213
            ],
            [
                6220,
                6236
            ],
            [
                6236,
                6237
            ],
            [
                6258,
                6293
            ],
            [
                6297,
                6300
            ],
            [
                6307,
                6311
            ],
            [
                6316,
                6326
            ],
            [
                6327,
                6332
            ],
            [
                6338,
                6361
            ],
            [
                6368,
                6370
            ],
            [
                6371,
                6387
            ],
            [
                6387,
                6460
            ],
            [
                6460,
                6518
            ],
            [
                6519,
                6585
            ],
            [
                6588,
                6639
            ],
            [
                6639,
                6641
            ],
            [
                6641,
                6653
            ],
            [
                6657,
                6735
            ],
            [
                6735,
                6737
            ],
            [
                6739,
                6747
            ],
            [
                6747,
                6771
            ],
            [
                6771,
                6808
            ],
            [
                6808,
                6809
            ],
            [
                6820,
                6824
            ],
            [
                6825,
                6828
            ],
            [
                6839,
                6845
            ],
            [
                6846,
                6851
            ],
            [
                6852,
                6856
            ],
            [
                6857,
                6875
            ],
            [
                6875,
                6876
            ],
            [
                6877,
                6886
            ],
            [
                6886,
                6950
            ],
            [
                6959,
                6980
            ],
            [
                6980,
                6984
            ],
            [
                6985,
                6991
            ],
            [
                6992,
                7028
            ],
            [
                7028,
                7079
            ],
            [
                7079,
                7081
            ],
            [
                7081,
                7130
            ],
            [
                7130,
                7225
            ],
            [
                7230,
                7270
            ],
            [
                7275,
                7341
            ],
            [
                7341,
                7378
            ],
            [
                7378,
                7390
            ],
            [
                7390,
                7415
            ],
            [
                7415,
                7417
            ],
            [
                7417,
                7450
            ],
            [
                7451,
                7452
            ],
            [
                7452,
                7471
            ],
            [
                7471,
                7472
            ],
            [
                7477,
                7519
            ],
            [
                7519,
                7586
            ],
            [
                7587,
                7608
            ],
            [
                7608,
                7639
            ],
            [
                7640,
                7673
            ],
            [
                7673,
                7735
            ],
            [
                7738,
                7741
            ],
            [
                7742,
                7769
            ],
            [
                7777,
                7795
            ],
            [
                7795,
                7892
            ],
            [
                7893,
                7898
            ],
            [
                7898,
                7935
            ],
            [
                7939,
                7941
            ],
            [
                7949,
                7964
            ],
            [
                7991,
                7998
            ],
            [
                7999,
                8006
            ],
            [
                8006,
                8009
            ],
            [
                8010,
                8062
            ],
            [
                8063,
                8069
            ],
            [
                8069,
                8071
            ],
            [
                8071,
                8163
            ],
            [
                8165,
                8231
            ],
            [
                8231,
                8234
            ],
            [
                8234,
                8239
            ],
            [
                8240,
                8277
            ],
            [
                8284,
                8294
            ],
            [
                8300,
                8307
            ],
            [
                8308,
                8315
            ],
            [
                8322,
                8360
            ],
            [
                8360,
                8394
            ],
            [
                8401,
                8466
            ],
            [
                8466,
                8485
            ],
            [
                8497,
                8500
            ],
            [
                8509,
                8569
            ],
            [
                8570,
                8572
            ],
            [
                8573,
                8580
            ],
            [
                8581,
                8593
            ],
            [
                8594,
                8604
            ],
            [
                8604,
                8606
            ],
            [
                8606,
                8657
            ],
            [
                8667,
                8674
            ],
            [
                8674,
                8711
            ],
            [
                8721,
                8728
            ],
            [
                8728,
                8731
            ],
            [
                8732,
                8775
            ],
            [
                8776,
                8906
            ],
            [
                8907,
                8943
            ],
            [
                8943,
                8954
            ],
            [
                8955,
                8966
            ],
            [
                8967,
                8973
            ],
            [
                8974,
                9026
            ],
            [
                9027,
                9031
            ],
            [
                9036,
                9043
            ],
            [
                9043,
                9048
            ],
            [
                9054,
                9057
            ],
            [
                9069,
                9072
            ],
            [
                9073,
                9077
            ],
            [
                9078,
                9086
            ],
            [
                9086,
                9088
            ],
            [
                9088,
                9116
            ],
            [
                9122,
                9128
            ],
            [
                9132,
                9186
            ],
            [
                9187,
                9219
            ],
            [
                9219,
                9220
            ],
            [
                9233,
                9235
            ],
            [
                9235,
                9237
            ],
            [
                9250,
                9372
            ],
            [
                9377,
                9383
            ],
            [
                9384,
                9401
            ],
            [
                9415,
                9423
            ],
            [
                9424,
                9442
            ],
            [
                9454,
                9502
            ],
            [
                9506,
                9580
            ],
            [
                9580,
                9626
            ],
            [
                9627,
                9635
            ],
            [
                9636,
                9706
            ],
            [
                9706,
                9710
            ],
            [
                9720,
                9722
            ],
            [
                9728,
                9751
            ],
            [
                9757,
                9791
            ],
            [
                9798,
                9832
            ],
            [
                9832,
                9938
            ],
            [
                9938,
                9940
            ],
            [
                9940,
                10013
            ],
            [
                10013,
                10081
            ],
            [
                10081,
                10154
            ]
        ],
        "row_chars": [
            [
                0,
                71
            ],
            [
                71,
                102
            ],
            [
                102,
                158
            ],
            [
                158,
                257
            ],
            [
                257,
                338
            ],
            [
                338,
                447
            ],
            [
                447,
                494
            ],
            [
                494,
                570
            ],
            [
                570,
                624
            ],
            [
                624,
                699
            ],
            [
                699,
                844
            ],
            [
                844,
                899
            ],
            [
                899,
                1007
            ],
            [
                1007,
                1007
            ],
            [
                1007,
                1007
            ],
            [
                1007,
                1126
            ],
            [
                1126,
                1126
            ],
            [
                1126,
                1262
            ],
            [
                1262,
                1354
            ],
            [
                1354,
                1480
            ],
            [
                1480,
                1643
            ],
            [
                1643,
                1757
            ],
            [
                1757,
                1851
            ],
            [
                1851,
                1925
            ],
            [
                1925,
                1925
            ],
            [
                1925,
                1925
            ],
            [
                1925,
                1946
            ],
            [
                1946,
                2007
            ],
            [
                2007,
                2044
            ],
            [
                2044,
                2139
            ],
            [
                2139,
                2256
            ],
            [
                2256,
                2289
            ],
            [
                2289,
                2335
            ],
            [
                2335,
                2449
            ],
            [
                2449,
                2541
            ],
            [
                2541,
                2541
            ],
            [
                2541,
                2541
            ],
            [
                2541,
                2641
            ],
            [
                2641,
                2731
            ],
            [
                2731,
                2763
            ],
            [
                2763,
                2786
            ],
            [
                2786,
                2786
            ],
            [
                2786,
                2878
            ],
            [
                2878,
                2986
            ],
            [
                2986,
                3052
            ],
            [
                3052,
                3129
            ],
            [
                3129,
                3193
            ],
            [
                3193,
                3253
            ],
            [
                3253,
                3284
            ],
            [
                3284,
                3295
            ],
            [
                3295,
                3295
            ],
            [
                3295,
                3384
            ],
            [
                3384,
                3444
            ],
            [
                3444,
                3564
            ],
            [
                3564,
                3666
            ],
            [
                3666,
                3717
            ],
            [
                3717,
                3737
            ],
            [
                3737,
                3776
            ],
            [
                3776,
                3792
            ],
            [
                3792,
                3832
            ],
            [
                3832,
                3883
            ],
            [
                3883,
                3905
            ],
            [
                3905,
                4008
            ],
            [
                4008,
                4117
            ],
            [
                4117,
                4148
            ],
            [
                4148,
                4183
            ],
            [
                4183,
                4210
            ],
            [
                4210,
                4210
            ],
            [
                4210,
                4385
            ],
            [
                4385,
                4419
            ],
            [
                4419,
                4517
            ],
            [
                4517,
                4562
            ],
            [
                4562,
                4562
            ],
            [
                4562,
                4635
            ],
            [
                4635,
                4726
            ],
            [
                4726,
                4726
            ],
            [
                4726,
                4774
            ],
            [
                4774,
                4799
            ],
            [
                4799,
                4856
            ],
            [
                4856,
                4905
            ],
            [
                4905,
                4988
            ],
            [
                4988,
                5004
            ],
            [
                5004,
                5129
            ],
            [
                5129,
                5171
            ],
            [
                5171,
                5218
            ],
            [
                5218,
                5230
            ],
            [
                5230,
                5321
            ],
            [
                5321,
                5397
            ],
            [
                5397,
                5526
            ],
            [
                5526,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5595
            ],
            [
                5595,
                5682
            ],
            [
                5682,
                5731
            ],
            [
                5731,
                5787
            ],
            [
                5787,
                5842
            ],
            [
                5842,
                5872
            ],
            [
                5872,
                5907
            ],
            [
                5907,
                5976
            ],
            [
                5976,
                5996
            ],
            [
                5996,
                6060
            ],
            [
                6060,
                6160
            ],
            [
                6160,
                6208
            ],
            [
                6208,
                6387
            ],
            [
                6387,
                6460
            ],
            [
                6460,
                6641
            ],
            [
                6641,
                6735
            ],
            [
                6735,
                6747
            ],
            [
                6747,
                6771
            ],
            [
                6771,
                6877
            ],
            [
                6877,
                6877
            ],
            [
                6877,
                6877
            ],
            [
                6877,
                6877
            ],
            [
                6877,
                6980
            ],
            [
                6980,
                7028
            ],
            [
                7028,
                7081
            ],
            [
                7081,
                7081
            ],
            [
                7081,
                7130
            ],
            [
                7130,
                7341
            ],
            [
                7341,
                7378
            ],
            [
                7378,
                7390
            ],
            [
                7390,
                7417
            ],
            [
                7417,
                7519
            ],
            [
                7519,
                7608
            ],
            [
                7608,
                7673
            ],
            [
                7673,
                7795
            ],
            [
                7795,
                7935
            ],
            [
                7935,
                8006
            ],
            [
                8006,
                8071
            ],
            [
                8071,
                8165
            ],
            [
                8165,
                8165
            ],
            [
                8165,
                8165
            ],
            [
                8165,
                8234
            ],
            [
                8234,
                8277
            ],
            [
                8277,
                8360
            ],
            [
                8360,
                8466
            ],
            [
                8466,
                8466
            ],
            [
                8466,
                8466
            ],
            [
                8466,
                8606
            ],
            [
                8606,
                8728
            ],
            [
                8728,
                8907
            ],
            [
                8907,
                8943
            ],
            [
                8943,
                9088
            ],
            [
                9088,
                9235
            ],
            [
                9235,
                9372
            ],
            [
                9372,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9503
            ],
            [
                9503,
                9580
            ],
            [
                9580,
                9580
            ],
            [
                9580,
                9706
            ],
            [
                9706,
                9706
            ],
            [
                9706,
                9832
            ],
            [
                9832,
                9940
            ],
            [
                9940,
                10013
            ],
            [
                10013,
                10081
            ],
            [
                10081,
                10154
            ]
        ]
    }
}