{
    "original": {
        "text": "These arrangements as to the return of Mr. Palliser's party to London did not, of course, include Mr. Grey. They were generally discussed in Mr. Grey's absence, and communicated to him by Mr. Palliser. \"I suppose we shall see you in England before long?\" said Mr. Palliser. \"I shall be able to tell you that before you go,\" said Grey. \"Not but that in any event I shall return to England before the winter.\"\n\"Then come to us at Matching,\" said Mr. Palliser. \"We shall be most happy to have you. Say that you'll come for the first fortnight in December. After that we always go to the Duke, in Barsetshire. Though, by-the-by, I don't suppose we shall go anywhere this year,\" Mr. Palliser added, interrupting the warmth of his invitation, and reflecting that, under the present circumstances, perhaps, it might be improper to have any guests at Matching in December. But he had become very fond of Mr. Grey, and on this occasion, as he had done on some others, pressed him warmly to make an attempt at Parliament. \"It isn't nearly so difficult as you think,\" said he, when Grey declared that he would not know where to look for a seat. \"See the men that get in. There was Mr. Vavasor. Even he got a seat.\"\n\"But he had to pay for it very dearly.\"\n\"You might easily find some quiet little borough.\"\n\"Quiet little boroughs have usually got their own quiet little Members,\" said Grey.\n\"They're fond of change; and if you like to spend a thousand pounds, the thing isn't difficult. I'll put you in the way of it.\" But Mr. Grey still declined. He was not a man prone to be talked out of his own way of life, and the very fact that George Vavasor had been in Parliament would of itself have gone far towards preventing any attempt on his part in that direction. Alice had also wanted him to go into public life, but he had put aside her request as though the thing were quite out of the question,--never giving a moment to its consideration. Had she asked him to settle himself and her in Central Africa, his manner and mode of refusal would have been the same. It was this immobility on his part,--this absolute want of any of the weakness of indecision, which had frightened her, and driven her away from him. He was partly aware of this; but that which he had declined to do at her solicitation, he certainly would not do at the advice of any one else. So it was that he argued the matter with himself. Had he now allowed himself to be so counselled, with what terrible acknowledgements of his own faults must he not have presented himself before Alice?\n\"I suppose books, then, will be your object in life?\" said Mr. Palliser.\n\"I hope they will be my aids,\" Grey answered. \"I almost doubt whether any object such as that you mean is necessary for life, or even expedient. It seems to me that if a man can so train himself that he may live honestly and die fearlessly, he has done about as much as is necessary.\"\n\"He has done a great deal, certainly,\" said Mr. Palliser, who was not ready enough to carry on the argument as he might have done had more time been given to him to consider it. He knew very well that he himself was working for others, and not for himself; and he was aware, though he had not analysed his own convictions on the matter, that good men struggle as they do in order that others, besides themselves, may live honestly, and, if possible, die fearlessly. The recluse of Nethercoats had thought much more about all this than the rising star of the House of Commons; but the philosophy of the rising star was the better philosophy of the two, though he was by far the less brilliant man. \"I don't see why a man should not live honestly and be a Member of Parliament as well,\" continued Mr. Palliser, when he had been silent for a few minutes.\n\"Nor I either,\" said Grey. \"I am sure that there are such men, and that the country is under great obligation to them. But they are subject to temptations which a prudent man like myself may perhaps do well to avoid.\" But though he spoke with an assured tone, he was shaken, and almost regretted that he did not accept the aid which was offered to him. It is astonishing how strong a man may be to those around him,--how impregnable may be his exterior, while within he feels himself to be as weak as water, and as unstable as chaff.\nBut the object which he had now in view was a renewal of his engagement with Alice, and he felt that he must obtain an answer from her before they left Lucerne. If she still persisted in refusing to give him her hand, it would not be consistent with his dignity as a man to continue his immediate pursuit of her any longer. In such case he must leave her, and see what future time might bring forth. He believed himself to be aware that he would never offer his love to another woman; and if Alice were to remain single, he might try again, after the lapse of a year or two. But if he failed now,--then, for that year or two, he would see her no more. Having so resolved, and being averse to anything like a surprise, he asked her, as he left her one evening, whether she would walk with him on the following morning. That morning would be the morning of her last day at Lucerne; and as she assented she knew well what was to come. She said nothing to Lady Glencora on the subject, but allowed the coming prospects of the Palliser family to form the sole subject of their conversation that night, as it had done on every night since the great news had become known. They were always together for an hour every evening before Alice was allowed to go to bed, and during this hour the anxieties of the future father and mother were always discussed till Alice Vavasor was almost tired of them. But she was patient with her friend, and on this special night she was patient as ever. But when she was released and was alone, she made a great endeavour to come to some fixed resolution as to what she would do on the morrow,--some resolution which should be absolutely resolute, and from which no eloquence on the part of any one should move her. But such resolutions are not easily reached, and Alice laboured through half the night almost in vain. She knew that she loved the man. She knew that he was as true to her as the sun is true to the earth. She knew that she would be, in all respects, safe in his hands. She knew that Lady Glencora would be delighted, and her father gratified. She knew that the countesses would open their arms to her,--though I doubt whether this knowledge was in itself very persuasive. She knew that by such a marriage she would gain all that women generally look to gain when they give themselves away. But, nevertheless, as far as she could decide at all, she decided against her lover. She had no right of her own to be taken back after the evil that she had done, and she did not choose to be taken back as an object of pity and forgiveness.\n\"Where are you going?\" said her cousin, when she came in with her hat on, soon after breakfast.\n\"I am going to walk,--with Mr. Grey.\"\n\"By appointment?\"\n\"Yes, by appointment. He asked me yesterday.\"\n\"Then it's all settled, and you haven't told me!\"\n\"All that is settled I have told you very often. He asked me yesterday to walk with him this morning, and I could not well refuse him.\"\n\"Why should you have wished to refuse him?\"\n\"I haven't said that I did wish it. But I hate scenes, and I think it would have been pleasanter for us to have parted without any occasion for special words.\"\n\"Alice, you are such a fool!\"\n\"So you tell me very often.\"\n\"Of course he is now going to say the very thing that he has come all this way for the purpose of saying. He has been wonderfully slow about it; but then slow as he is, you are slower. If you don't make it up with him now, I really shall think you are very wicked. I am becoming like Lady Midlothian;--I can't understand it. I know you want to be his wife, and I know he wants to be your husband, and the only thing that keeps you apart is your obstinacy,--just because you have said you wouldn't have him. My belief is that if Lady Midlothian and the rest of us were to pat you on the back, and tell you how right you were, you'd ask him to take you, out of defiance. You may be sure of this, Alice; if you refuse him now, it'll be for the last time.\"\nThis, and much more of the same kind, she bore before Mr. Grey came to take her, and she answered to it all as little as she could. \"You are making me very unhappy, Glencora,\" she said once. \"I wish I could break you down with unhappiness,\" Lady Glencora answered, \"so that he might find you less stiff, and hard, and unmanageable.\" Directly upon that he came in, looking as though he had no business on hand more exciting than his ordinary morning's tranquil employments. Alice at once got up to start with him. \"So you and Alice are going to make your adieux,\" said Lady Glencora. \"It must be done sooner or later,\" said Mr. Grey; and then they went off.\nThose who know Lucerne,--and almost everybody now does know Lucerne,--will remember the big hotel which has been built close to the landing-pier of the steamers, and will remember also the church that stands upon a little hill or rising ground, to the left of you, as you come out of the inn upon the lake. The church is immediately over the lake, and round the church there is a burying-ground, and skirting the burying-ground there are cloisters, through the arches and apertures of which they who walk and sit there look down immediately upon the blue water, and across the water upon the frowning menaces of Mount Pilate. It is one of the prettiest spots in that land of beauty; and its charm is to my feeling enhanced by the sepulchral monuments over which I walk, and by which I am surrounded, as I stand there. Up here, into these cloisters, Alice and John Grey went together. I doubt whether he had formed any purpose of doing so. She certainly would have gone without question in any direction that he might have led her. The distance from the inn up to the church-gate did not take them ten minutes, and when they were there their walk was over. But the place was solitary, and they were alone; and it might be as well for Mr. Grey to speak what words he had to say there as elsewhere. They had often been together in those cloisters before, but on such occasions either Mr. Palliser or Lady Glencora had been with them. On their slow passage up the hill very little was spoken, and that little was of no moment. \"We will go in here for a few minutes,\" he said. \"It is the prettiest spot about Lucerne, and we don't know when we may see it again.\" So they went in, and sat down on one of the embrasures that open from the cloisters over the lake.\n\"Probably never again,\" said Alice. \"And yet I have been here now two years running.\"\nShe shuddered as she remembered that in that former year George Vavasor had been with her. As she thought of it all she hated herself. Over and over again she had told herself that she had so mismanaged the latter years of her life that it was impossible for her not to hate herself. No woman had a clearer idea of feminine constancy than she had, and no woman had sinned against that idea more deeply. He gave her time to think of all this as he sat there looking down upon the water.\n\"And yet I would sooner live in Cambridgeshire,\" were the first words he spoke.\n\"Why so?\"\n\"Partly because all beauty is best enjoyed when it is sought for with some trouble and difficulty, and partly because such beauty, and the romance which is attached to it, should not make up the staple of one's life. Romance, if it is to come at all, should always come by fits and starts.\"\n\"I should like to live in a pretty country.\"\n\"And would like to live a romantic life,--no doubt; but all those things lose their charm if they are made common. When a man has to go to Vienna or St. Petersburg two or three times a month, you don't suppose he enjoys travelling?\"\n\"All the same, I should like to live in a pretty country,\" said Alice.\n\"And I want you to come and live in a very ugly country.\" Then he paused for a minute or two, not looking at her, but gazing still on the mountain opposite. She did not speak a word, but looked as he was looking. She knew that the request was coming, and had been thinking about it all night; but now that it had come she did not know how to bear herself. \"I don't think,\" he went on to say, \"that you would let that consideration stand in your way, if on other grounds you were willing to become my wife.\"\n\"What consideration?\"\n\"Because Nethercoats is not so pretty as Lucerne.\"\n\"It would have nothing to do with it,\" said Alice.\n\"It should have nothing to do with it.\"\n\"Nothing; nothing at all,\" repeated Alice.\n\"Will you come, then? Will you come and be my wife, and help me to be happy amidst all that ugliness? Will you come and be my one beautiful thing, my treasure, my joy, my comfort, my counsellor?\"\n\"You want no counsellor, Mr. Grey.\"\n\"No man ever wanted one more. Alice, this has been a bad year to me, and I do not think that it has been a happy one for you.\"\n\"Indeed, no.\"\n\"Let us forget it,--or rather, let us treat it as though it were forgotten. Twelve months ago you were mine. You were, at any rate, so much mine that I had a right to boast of my possession among my friends.\"\n\"It was a poor boast.\"\n\"They did not seem to think so. I had but one or two to whom I could speak of you, but they told me that I was going to be a happy man. As to myself, I was sure that I was to be so. No man was ever better contented with his bargain than I was with mine. Let us go back to it, and the last twelve months shall be as though they had never been.\"\n\"That cannot be, Mr. Grey. If it could, I should be worse even than I am.\"\n\"Why cannot it be?\"\n\"Because I cannot forgive myself what I have done, and because you ought not to forgive me.\"\n\"But I do. There has never been an hour with me in which there has been an offence of yours rankling in my bosom unforgiven. I think you have been foolish, misguided,--led away by a vain ambition, and that in the difficulty to which these things brought you, you endeavoured to constrain yourself to do an act, which, when it came near to you,--when the doing of it had to be more closely considered, you found to be contrary to your nature.\" Now, as he spoke thus, she turned her eyes upon him, and looked at him, wondering that he should have had power to read her heart so accurately. \"I never believed that you would marry your cousin. When I was told of it, I knew that trouble had blinded you for awhile. You had driven yourself to revolt against me, and upon that your heart misgave you, and you said to yourself that it did not matter then how you might throw away all your sweetness. You see that I speak of your old love for me with the frank conceit of a happy lover.\"\n\"No;--no, no!\" she ejaculated.\n\"But the storm passes over the tree and does not tear it up by the roots or spoil it of all its symmetry. When we hear the winds blowing, and see how the poor thing is shaken, we think that its days are numbered and its destruction at hand. Alice, when the winds were shaking you, and you were torn and buffeted, I never thought so. There may be some who will forgive you slowly. Your own self-forgiveness will be slow. But I, who have known you better than any one,--yes, better than any one,--I have forgiven you everything, have forgiven you instantly. Come to me, Alice, and comfort me. Come to me, for I want you sorely.\" She sat quite still, looking at the lake and the mountain beyond, but she said nothing. What could she say to him? \"My need of you is much greater now,\" he went on to say, \"than when I first asked you to share the world with me. Then I could have borne to lose you, as I had never boasted to myself that you were my own,--had never pictured to myself the life that might be mine if you were always to be with me. But since that day I have had no other hope,--no other hope but this for which I plead now. Am I to plead in vain?\"\n\"You do not know me,\" she said; \"how vile I have been! You do not think what it is,--for a woman to have promised herself to one man while she loved another.\"\n\"But it was me you loved. Ah! Alice, I can forgive that. Do I not tell you that I did forgive it the moment that I heard it? Do you not hear me say that I never for a moment thought that you would marry him? Alice, you should scold me for my vanity, for I have believed all through that you loved me, and me only. Come to me, dear, and tell me that it is so, and the past shall be only as a dream.\"\n\"I am dreaming it always,\" said Alice.\n\"They will cease to be bitter dreams if your head be upon my shoulder. You will cease to reproach yourself when you know that you have made me happy.\"\n\"I shall never cease to reproach myself. I have done that which no woman can do and honour herself afterwards. I have been--a jilt.\"\n\"The noblest jilt that ever yet halted between two minds! There has been no touch of selfishness in your fickleness. I think I could be hard enough upon a woman who had left me for greater wealth, for a higher rank,--who had left me even that she might be gay and merry. It has not been so with you.\"\n\"Yes, it has. I thought you were too firm in your own will, and--\"\n\"And you think so still. Is that it?\"\n\"It does not matter what I think now. I am a fallen creature, and have no longer a right to such thoughts. It will be better for us both that you should leave me,--and forget me. There are things which, if a woman does them, should never be forgotten;--which she should never permit herself to forget.\"\n\"And am I to be punished, then, because of your fault? Is that your sense of justice?\" He got up, and standing before her, looked down upon her. \"Alice, if you will tell me that you do not love me, I will believe you, and will trouble you no more. I know that you will say nothing to me that is false. Through it all you have spoken no word of falsehood. If you love me, after what has passed, I have a right to demand your hand. My happiness requires it, and I have a right to expect your compliance. I do demand it. If you love me, Alice, I tell you that you dare not refuse me. If you do so, you will fail hereafter to reconcile it to your conscience before God.\"\nThen he stopped his speech, and waited for a reply; but Alice sat silent beneath his gaze, with her eyes turned upon the tombstones beneath her feet. Of course she had no choice but to yield. He, possessed of power and force infinitely greater than hers, had left her no alternative but to be happy. But there still clung to her what I fear we must call a perverseness of obstinacy, a desire to maintain the resolution she had made,--a wish that she might be allowed to undergo the punishment she had deserved. She was as a prisoner who would fain cling to his prison after pardon has reached him, because he is conscious that the pardon is undeserved. And it may be that there was still left within her bosom some remnant of that feeling of rebellion which his masterful spirit had ever produced in her. He was so imperious in his tranquillity, he argued his question of love with such a manifest preponderance of right on his side, that she had always felt that to yield to him would be to confess the omnipotence of his power. She knew now that she must yield to him,--that his power over her was omnipotent. She was pressed by him as in some countries the prisoner is pressed by the judge,--so pressed that she acknowledged to herself silently that any further antagonism to him was impossible. Nevertheless, the word which she had to speak still remained unspoken, and he stood over her, waiting for her answer. Then slowly he sat down beside her, and gradually he put his arm round her waist. She shrank from him, back against the stonework of the embrasure, but she could not shrink away from his grasp. She put up her hand to impede his, but his hand, like his character and his words, was full of power. It would not be impeded. \"Alice,\" he said, as he pressed her close with his arm, \"the battle is over now, and I have won it.\"\n\"You win everything,--always,\" she said, whispering to him, as she still shrank from his embrace.\n\"In winning you I have won everything.\" Then he put his face over her and pressed his lips to hers. I wonder whether he was made happier when he knew that no other touch had profaned those lips since last he had pressed them?",
        "paragraph_chars": [
            [
                0,
                408
            ],
            [
                408,
                1204
            ],
            [
                1204,
                1244
            ],
            [
                1244,
                1295
            ],
            [
                1295,
                1379
            ],
            [
                1379,
                2548
            ],
            [
                2548,
                2621
            ],
            [
                2621,
                2906
            ],
            [
                2906,
                3758
            ],
            [
                3758,
                4292
            ],
            [
                4292,
                6865
            ],
            [
                6865,
                6961
            ],
            [
                6961,
                6999
            ],
            [
                6999,
                7017
            ],
            [
                7017,
                7063
            ],
            [
                7063,
                7113
            ],
            [
                7113,
                7249
            ],
            [
                7249,
                7293
            ],
            [
                7293,
                7453
            ],
            [
                7453,
                7483
            ],
            [
                7483,
                7512
            ],
            [
                7512,
                8265
            ],
            [
                8265,
                8922
            ],
            [
                8922,
                10679
            ],
            [
                10679,
                10765
            ],
            [
                10765,
                11251
            ],
            [
                11251,
                11331
            ],
            [
                11331,
                11341
            ],
            [
                11341,
                11632
            ],
            [
                11632,
                11677
            ],
            [
                11677,
                11910
            ],
            [
                11910,
                11981
            ],
            [
                11981,
                12488
            ],
            [
                12488,
                12510
            ],
            [
                12510,
                12561
            ],
            [
                12561,
                12612
            ],
            [
                12612,
                12652
            ],
            [
                12652,
                12695
            ],
            [
                12695,
                12891
            ],
            [
                12891,
                12927
            ],
            [
                12927,
                13054
            ],
            [
                13054,
                13068
            ],
            [
                13068,
                13277
            ],
            [
                13277,
                13300
            ],
            [
                13300,
                13644
            ],
            [
                13644,
                13719
            ],
            [
                13719,
                13739
            ],
            [
                13739,
                13832
            ],
            [
                13832,
                14812
            ],
            [
                14812,
                14843
            ],
            [
                14843,
                15999
            ],
            [
                15999,
                16158
            ],
            [
                16158,
                16557
            ],
            [
                16557,
                16596
            ],
            [
                16596,
                16747
            ],
            [
                16747,
                16880
            ],
            [
                16880,
                17181
            ],
            [
                17181,
                17248
            ],
            [
                17248,
                17286
            ],
            [
                17286,
                17589
            ],
            [
                17589,
                18256
            ],
            [
                18256,
                20095
            ],
            [
                20095,
                20193
            ],
            [
                20193,
                20418
            ]
        ],
        "segment_chars": [
            [
                0,
                108
            ],
            [
                108,
                202
            ],
            [
                202,
                255
            ],
            [
                255,
                274
            ],
            [
                274,
                335
            ],
            [
                335,
                408
            ],
            [
                408,
                458
            ],
            [
                458,
                495
            ],
            [
                495,
                553
            ],
            [
                553,
                606
            ],
            [
                606,
                865
            ],
            [
                865,
                1012
            ],
            [
                1012,
                1134
            ],
            [
                1134,
                1160
            ],
            [
                1160,
                1183
            ],
            [
                1183,
                1204
            ],
            [
                1204,
                1244
            ],
            [
                1244,
                1295
            ],
            [
                1295,
                1379
            ],
            [
                1379,
                1475
            ],
            [
                1475,
                1507
            ],
            [
                1507,
                1536
            ],
            [
                1536,
                1753
            ],
            [
                1753,
                1933
            ],
            [
                1933,
                2053
            ],
            [
                2053,
                2203
            ],
            [
                2203,
                2347
            ],
            [
                2347,
                2397
            ],
            [
                2397,
                2548
            ],
            [
                2548,
                2602
            ],
            [
                2602,
                2621
            ],
            [
                2621,
                2667
            ],
            [
                2667,
                2766
            ],
            [
                2766,
                2906
            ],
            [
                2906,
                3084
            ],
            [
                3084,
                3372
            ],
            [
                3372,
                3603
            ],
            [
                3603,
                3758
            ],
            [
                3758,
                3785
            ],
            [
                3785,
                3877
            ],
            [
                3877,
                3976
            ],
            [
                3976,
                4111
            ],
            [
                4111,
                4292
            ],
            [
                4292,
                4453
            ],
            [
                4453,
                4616
            ],
            [
                4616,
                4692
            ],
            [
                4692,
                4867
            ],
            [
                4867,
                4944
            ],
            [
                4944,
                5110
            ],
            [
                5110,
                5224
            ],
            [
                5224,
                5458
            ],
            [
                5458,
                5683
            ],
            [
                5683,
                5771
            ],
            [
                5771,
                6033
            ],
            [
                6033,
                6136
            ],
            [
                6136,
                6169
            ],
            [
                6169,
                6238
            ],
            [
                6238,
                6302
            ],
            [
                6302,
                6376
            ],
            [
                6376,
                6505
            ],
            [
                6505,
                6623
            ],
            [
                6623,
                6708
            ],
            [
                6708,
                6865
            ],
            [
                6865,
                6888
            ],
            [
                6888,
                6961
            ],
            [
                6961,
                6999
            ],
            [
                6999,
                7017
            ],
            [
                7017,
                7039
            ],
            [
                7039,
                7063
            ],
            [
                7063,
                7113
            ],
            [
                7113,
                7162
            ],
            [
                7162,
                7249
            ],
            [
                7249,
                7293
            ],
            [
                7293,
                7329
            ],
            [
                7329,
                7453
            ],
            [
                7453,
                7483
            ],
            [
                7483,
                7512
            ],
            [
                7512,
                7618
            ],
            [
                7618,
                7697
            ],
            [
                7697,
                7777
            ],
            [
                7777,
                7837
            ],
            [
                7837,
                8019
            ],
            [
                8019,
                8181
            ],
            [
                8181,
                8265
            ],
            [
                8265,
                8397
            ],
            [
                8397,
                8456
            ],
            [
                8456,
                8598
            ],
            [
                8598,
                8738
            ],
            [
                8738,
                8778
            ],
            [
                8778,
                8848
            ],
            [
                8848,
                8922
            ],
            [
                8922,
                9229
            ],
            [
                9229,
                9548
            ],
            [
                9548,
                9740
            ],
            [
                9740,
                9806
            ],
            [
                9806,
                9861
            ],
            [
                9861,
                9953
            ],
            [
                9953,
                10078
            ],
            [
                10078,
                10218
            ],
            [
                10218,
                10353
            ],
            [
                10353,
                10445
            ],
            [
                10445,
                10494
            ],
            [
                10494,
                10580
            ],
            [
                10580,
                10679
            ],
            [
                10679,
                10715
            ],
            [
                10715,
                10765
            ],
            [
                10765,
                10856
            ],
            [
                10856,
                10900
            ],
            [
                10900,
                11049
            ],
            [
                11049,
                11168
            ],
            [
                11168,
                11251
            ],
            [
                11251,
                11331
            ],
            [
                11331,
                11341
            ],
            [
                11341,
                11558
            ],
            [
                11558,
                11632
            ],
            [
                11632,
                11677
            ],
            [
                11677,
                11792
            ],
            [
                11792,
                11910
            ],
            [
                11910,
                11981
            ],
            [
                11981,
                12039
            ],
            [
                12039,
                12138
            ],
            [
                12138,
                12194
            ],
            [
                12194,
                12337
            ],
            [
                12337,
                12488
            ],
            [
                12488,
                12510
            ],
            [
                12510,
                12561
            ],
            [
                12561,
                12612
            ],
            [
                12612,
                12652
            ],
            [
                12652,
                12695
            ],
            [
                12695,
                12717
            ],
            [
                12717,
                12797
            ],
            [
                12797,
                12891
            ],
            [
                12891,
                12927
            ],
            [
                12927,
                12957
            ],
            [
                12957,
                13054
            ],
            [
                13054,
                13068
            ],
            [
                13068,
                13144
            ],
            [
                13144,
                13177
            ],
            [
                13177,
                13277
            ],
            [
                13277,
                13300
            ],
            [
                13300,
                13332
            ],
            [
                13332,
                13436
            ],
            [
                13436,
                13482
            ],
            [
                13482,
                13554
            ],
            [
                13554,
                13644
            ],
            [
                13644,
                13671
            ],
            [
                13671,
                13719
            ],
            [
                13719,
                13739
            ],
            [
                13739,
                13832
            ],
            [
                13832,
                13843
            ],
            [
                13843,
                13957
            ],
            [
                13957,
                14275
            ],
            [
                14275,
                14420
            ],
            [
                14420,
                14472
            ],
            [
                14472,
                14543
            ],
            [
                14543,
                14725
            ],
            [
                14725,
                14812
            ],
            [
                14812,
                14827
            ],
            [
                14827,
                14843
            ],
            [
                14843,
                14949
            ],
            [
                14949,
                15084
            ],
            [
                15084,
                15176
            ],
            [
                15176,
                15223
            ],
            [
                15223,
                15263
            ],
            [
                15263,
                15399
            ],
            [
                15399,
                15434
            ],
            [
                15434,
                15470
            ],
            [
                15470,
                15558
            ],
            [
                15558,
                15585
            ],
            [
                15585,
                15699
            ],
            [
                15699,
                15883
            ],
            [
                15883,
                15975
            ],
            [
                15975,
                15999
            ],
            [
                15999,
                16054
            ],
            [
                16054,
                16158
            ],
            [
                16158,
                16184
            ],
            [
                16184,
                16188
            ],
            [
                16188,
                16215
            ],
            [
                16215,
                16283
            ],
            [
                16283,
                16366
            ],
            [
                16366,
                16472
            ],
            [
                16472,
                16557
            ],
            [
                16557,
                16596
            ],
            [
                16596,
                16667
            ],
            [
                16667,
                16747
            ],
            [
                16747,
                16788
            ],
            [
                16788,
                16858
            ],
            [
                16858,
                16880
            ],
            [
                16880,
                16938
            ],
            [
                16938,
                16997
            ],
            [
                16997,
                17151
            ],
            [
                17151,
                17181
            ],
            [
                17181,
                17195
            ],
            [
                17195,
                17248
            ],
            [
                17248,
                17273
            ],
            [
                17273,
                17286
            ],
            [
                17286,
                17324
            ],
            [
                17324,
                17393
            ],
            [
                17393,
                17465
            ],
            [
                17465,
                17589
            ],
            [
                17589,
                17644
            ],
            [
                17644,
                17676
            ],
            [
                17676,
                17734
            ],
            [
                17734,
                17837
            ],
            [
                17837,
                17891
            ],
            [
                17891,
                17944
            ],
            [
                17944,
                18019
            ],
            [
                18019,
                18091
            ],
            [
                18091,
                18107
            ],
            [
                18107,
                18170
            ],
            [
                18170,
                18256
            ],
            [
                18256,
                18406
            ],
            [
                18406,
                18448
            ],
            [
                18448,
                18556
            ],
            [
                18556,
                18767
            ],
            [
                18767,
                18909
            ],
            [
                18909,
                19061
            ],
            [
                19061,
                19286
            ],
            [
                19286,
                19368
            ],
            [
                19368,
                19555
            ],
            [
                19555,
                19673
            ],
            [
                19673,
                19755
            ],
            [
                19755,
                19867
            ],
            [
                19867,
                19969
            ],
            [
                19969,
                19994
            ],
            [
                19994,
                20095
            ],
            [
                20095,
                20193
            ],
            [
                20193,
                20233
            ],
            [
                20233,
                20293
            ],
            [
                20293,
                20418
            ]
        ],
        "overlap_chars": [
            [
                0,
                18
            ],
            [
                25,
                107
            ],
            [
                202,
                255
            ],
            [
                255,
                273
            ],
            [
                274,
                335
            ],
            [
                335,
                336
            ],
            [
                349,
                394
            ],
            [
                399,
                408
            ],
            [
                408,
                458
            ],
            [
                458,
                495
            ],
            [
                495,
                553
            ],
            [
                553,
                604
            ],
            [
                616,
                617
            ],
            [
                606,
                612
            ],
            [
                625,
                671
            ],
            [
                674,
                686
            ],
            [
                752,
                767
            ],
            [
                776,
                789
            ],
            [
                798,
                865
            ],
            [
                865,
                909
            ],
            [
                926,
                930
            ],
            [
                910,
                912
            ],
            [
                957,
                1012
            ],
            [
                1012,
                1064
            ],
            [
                1132,
                1134
            ],
            [
                1134,
                1135
            ],
            [
                1170,
                1183
            ],
            [
                1183,
                1204
            ],
            [
                1204,
                1244
            ],
            [
                1244,
                1295
            ],
            [
                1295,
                1379
            ],
            [
                1379,
                1475
            ],
            [
                1475,
                1506
            ],
            [
                1507,
                1536
            ],
            [
                1536,
                1552
            ],
            [
                1559,
                1660
            ],
            [
                1710,
                1721
            ],
            [
                1751,
                1752
            ],
            [
                1753,
                1835
            ],
            [
                1895,
                1901
            ],
            [
                1918,
                1933
            ],
            [
                2053,
                2087
            ],
            [
                2090,
                2103
            ],
            [
                2109,
                2203
            ],
            [
                2203,
                2235
            ],
            [
                2247,
                2253
            ],
            [
                2269,
                2275
            ],
            [
                2288,
                2315
            ],
            [
                2319,
                2332
            ],
            [
                2341,
                2347
            ],
            [
                2401,
                2403
            ],
            [
                2443,
                2444
            ],
            [
                2450,
                2515
            ],
            [
                2534,
                2548
            ],
            [
                2548,
                2602
            ],
            [
                2602,
                2621
            ],
            [
                2621,
                2667
            ],
            [
                2667,
                2701
            ],
            [
                2724,
                2745
            ],
            [
                2764,
                2766
            ],
            [
                2766,
                2798
            ],
            [
                2828,
                2906
            ],
            [
                2906,
                2967
            ],
            [
                3026,
                3030
            ],
            [
                3050,
                3054
            ],
            [
                2976,
                3013
            ],
            [
                3017,
                3019
            ],
            [
                3036,
                3049
            ],
            [
                3082,
                3084
            ],
            [
                3084,
                3091
            ],
            [
                3102,
                3179
            ],
            [
                3243,
                3336
            ],
            [
                3338,
                3341
            ],
            [
                3356,
                3372
            ],
            [
                3372,
                3489
            ],
            [
                3508,
                3519
            ],
            [
                3524,
                3571
            ],
            [
                3583,
                3602
            ],
            [
                3603,
                3713
            ],
            [
                3756,
                3758
            ],
            [
                3758,
                3785
            ],
            [
                3785,
                3877
            ],
            [
                3877,
                3885
            ],
            [
                3901,
                3932
            ],
            [
                3945,
                3948
            ],
            [
                3957,
                3976
            ],
            [
                3976,
                4110
            ],
            [
                4313,
                4315
            ],
            [
                4320,
                4323
            ],
            [
                4332,
                4453
            ],
            [
                4453,
                4553
            ],
            [
                4563,
                4616
            ],
            [
                4616,
                4618
            ],
            [
                4624,
                4660
            ],
            [
                4661,
                4667
            ],
            [
                4673,
                4684
            ],
            [
                4690,
                4692
            ],
            [
                4781,
                4838
            ],
            [
                4852,
                4867
            ],
            [
                4867,
                4888
            ],
            [
                4890,
                4894
            ],
            [
                4896,
                4916
            ],
            [
                4918,
                4943
            ],
            [
                4944,
                4950
            ],
            [
                4954,
                4962
            ],
            [
                5008,
                5022
            ],
            [
                5039,
                5050
            ],
            [
                5052,
                5108
            ],
            [
                5035,
                5038
            ],
            [
                5108,
                5110
            ],
            [
                5176,
                5182
            ],
            [
                5192,
                5224
            ],
            [
                5224,
                5257
            ],
            [
                5392,
                5394
            ],
            [
                5272,
                5277
            ],
            [
                5377,
                5388
            ],
            [
                5775,
                5783
            ],
            [
                5801,
                5815
            ],
            [
                5330,
                5332
            ],
            [
                5878,
                5895
            ],
            [
                5456,
                5457
            ],
            [
                6136,
                6169
            ],
            [
                6169,
                6238
            ],
            [
                6238,
                6264
            ],
            [
                6283,
                6302
            ],
            [
                6302,
                6376
            ],
            [
                6505,
                6622
            ],
            [
                6623,
                6708
            ],
            [
                6708,
                6724
            ],
            [
                6736,
                6865
            ],
            [
                6865,
                6888
            ],
            [
                6888,
                6961
            ],
            [
                6961,
                6980
            ],
            [
                6983,
                6996
            ],
            [
                7162,
                7230
            ],
            [
                7231,
                7249
            ],
            [
                7249,
                7293
            ],
            [
                7352,
                7423
            ],
            [
                7433,
                7453
            ],
            [
                7453,
                7483
            ],
            [
                7483,
                7512
            ],
            [
                7512,
                7594
            ],
            [
                7616,
                7618
            ],
            [
                7618,
                7660
            ],
            [
                7681,
                7697
            ],
            [
                7697,
                7714
            ],
            [
                7718,
                7777
            ],
            [
                7814,
                7837
            ],
            [
                7837,
                7966
            ],
            [
                8017,
                8019
            ],
            [
                8181,
                8265
            ],
            [
                8397,
                8449
            ],
            [
                8454,
                8455
            ],
            [
                8456,
                8598
            ],
            [
                8617,
                8737
            ],
            [
                8778,
                8847
            ],
            [
                8848,
                8901
            ],
            [
                8917,
                8920
            ],
            [
                8907,
                8916
            ],
            [
                8920,
                8922
            ],
            [
                9107,
                9117
            ],
            [
                9645,
                9647
            ],
            [
                9223,
                9227
            ],
            [
                8937,
                8944
            ],
            [
                9551,
                9603
            ],
            [
                9738,
                9740
            ],
            [
                9740,
                9753
            ],
            [
                9760,
                9805
            ],
            [
                10445,
                10494
            ],
            [
                10494,
                10500
            ],
            [
                10515,
                10519
            ],
            [
                10533,
                10580
            ],
            [
                10650,
                10653
            ],
            [
                10583,
                10644
            ],
            [
                10664,
                10679
            ],
            [
                10679,
                10715
            ],
            [
                10715,
                10764
            ],
            [
                10765,
                10796
            ],
            [
                10822,
                10854
            ],
            [
                10881,
                10900
            ],
            [
                11049,
                11168
            ],
            [
                11168,
                11215
            ],
            [
                11222,
                11251
            ],
            [
                11251,
                11299
            ],
            [
                11321,
                11323
            ],
            [
                11329,
                11331
            ],
            [
                11331,
                11341
            ],
            [
                11341,
                11356
            ],
            [
                11459,
                11470
            ],
            [
                11424,
                11427
            ],
            [
                11480,
                11487
            ],
            [
                11513,
                11558
            ],
            [
                11558,
                11632
            ],
            [
                11632,
                11677
            ],
            [
                11677,
                11716
            ],
            [
                11727,
                11792
            ],
            [
                11792,
                11910
            ],
            [
                11910,
                11981
            ],
            [
                11981,
                12039
            ],
            [
                12039,
                12138
            ],
            [
                12337,
                12364
            ],
            [
                12371,
                12397
            ],
            [
                12412,
                12488
            ],
            [
                12561,
                12562
            ],
            [
                12565,
                12612
            ],
            [
                12695,
                12717
            ],
            [
                12717,
                12797
            ],
            [
                12797,
                12891
            ],
            [
                12891,
                12895
            ],
            [
                12901,
                12927
            ],
            [
                12927,
                12939
            ],
            [
                12947,
                12957
            ],
            [
                12957,
                13054
            ],
            [
                13054,
                13068
            ],
            [
                13068,
                13085
            ],
            [
                13088,
                13144
            ],
            [
                13144,
                13175
            ],
            [
                13208,
                13212
            ],
            [
                13185,
                13189
            ],
            [
                13198,
                13199
            ],
            [
                13213,
                13277
            ],
            [
                13277,
                13300
            ],
            [
                13300,
                13332
            ],
            [
                13482,
                13554
            ],
            [
                13554,
                13644
            ],
            [
                13644,
                13669
            ],
            [
                13740,
                13793
            ],
            [
                13802,
                13832
            ],
            [
                13832,
                13843
            ],
            [
                13957,
                13997
            ],
            [
                14000,
                14040
            ],
            [
                14045,
                14055
            ],
            [
                14089,
                14094
            ],
            [
                14056,
                14058
            ],
            [
                14120,
                14134
            ],
            [
                14059,
                14064
            ],
            [
                14086,
                14089
            ],
            [
                14237,
                14275
            ],
            [
                14280,
                14291
            ],
            [
                14296,
                14327
            ],
            [
                14347,
                14376
            ],
            [
                14390,
                14420
            ],
            [
                14420,
                14472
            ],
            [
                14472,
                14534
            ],
            [
                14541,
                14543
            ],
            [
                14543,
                14592
            ],
            [
                14603,
                14724
            ],
            [
                14843,
                14915
            ],
            [
                14947,
                14949
            ],
            [
                15084,
                15171
            ],
            [
                15063,
                15074
            ],
            [
                15075,
                15083
            ],
            [
                15176,
                15223
            ],
            [
                15223,
                15263
            ],
            [
                15263,
                15309
            ],
            [
                15338,
                15399
            ],
            [
                15399,
                15434
            ],
            [
                15434,
                15469
            ],
            [
                15470,
                15558
            ],
            [
                15558,
                15584
            ],
            [
                15585,
                15670
            ],
            [
                15697,
                15699
            ],
            [
                15699,
                15740
            ],
            [
                15792,
                15860
            ],
            [
                15874,
                15883
            ],
            [
                15883,
                15926
            ],
            [
                15943,
                15951
            ],
            [
                15973,
                15975
            ],
            [
                15975,
                15999
            ],
            [
                15999,
                16054
            ],
            [
                16054,
                16082
            ],
            [
                16084,
                16158
            ],
            [
                16158,
                16184
            ],
            [
                16195,
                16215
            ],
            [
                16366,
                16457
            ],
            [
                16470,
                16472
            ],
            [
                16472,
                16557
            ],
            [
                16557,
                16596
            ],
            [
                16596,
                16667
            ],
            [
                16667,
                16747
            ],
            [
                16747,
                16788
            ],
            [
                16788,
                16858
            ],
            [
                16858,
                16869
            ],
            [
                16871,
                16880
            ],
            [
                16880,
                16938
            ],
            [
                16938,
                16997
            ],
            [
                16997,
                17076
            ],
            [
                17083,
                17094
            ],
            [
                17149,
                17151
            ],
            [
                17151,
                17181
            ],
            [
                17181,
                17195
            ],
            [
                17195,
                17244
            ],
            [
                17248,
                17273
            ],
            [
                17273,
                17286
            ],
            [
                17286,
                17324
            ],
            [
                17324,
                17325
            ],
            [
                17357,
                17366
            ],
            [
                17352,
                17356
            ],
            [
                17367,
                17393
            ],
            [
                17393,
                17447
            ],
            [
                17450,
                17465
            ],
            [
                17465,
                17510
            ],
            [
                17545,
                17589
            ],
            [
                17589,
                17644
            ],
            [
                17644,
                17676
            ],
            [
                17676,
                17678
            ],
            [
                17687,
                17690
            ],
            [
                17712,
                17734
            ],
            [
                17734,
                17748
            ],
            [
                17754,
                17837
            ],
            [
                17837,
                17869
            ],
            [
                17876,
                17891
            ],
            [
                17944,
                17958
            ],
            [
                17981,
                18019
            ],
            [
                18019,
                18091
            ],
            [
                18091,
                18107
            ],
            [
                18107,
                18170
            ],
            [
                18170,
                18256
            ],
            [
                18256,
                18263
            ],
            [
                18288,
                18294
            ],
            [
                18306,
                18328
            ],
            [
                18345,
                18387
            ],
            [
                18404,
                18406
            ],
            [
                18406,
                18448
            ],
            [
                18448,
                18450
            ],
            [
                18511,
                18556
            ],
            [
                18556,
                18650
            ],
            [
                18660,
                18687
            ],
            [
                18723,
                18767
            ],
            [
                18767,
                18908
            ],
            [
                18909,
                18927
            ],
            [
                18938,
                18943
            ],
            [
                18966,
                18981
            ],
            [
                18998,
                19038
            ],
            [
                19044,
                19061
            ],
            [
                19061,
                19100
            ],
            [
                19102,
                19111
            ],
            [
                19133,
                19153
            ],
            [
                19168,
                19286
            ],
            [
                19286,
                19325
            ],
            [
                19366,
                19367
            ],
            [
                19555,
                19638
            ],
            [
                19649,
                19673
            ],
            [
                19673,
                19755
            ],
            [
                19755,
                19775
            ],
            [
                19781,
                19802
            ],
            [
                19819,
                19867
            ],
            [
                19867,
                19949
            ],
            [
                19972,
                19993
            ],
            [
                19994,
                20095
            ],
            [
                20095,
                20114
            ],
            [
                20117,
                20193
            ],
            [
                20193,
                20233
            ],
            [
                20233,
                20240
            ],
            [
                20267,
                20292
            ]
        ],
        "row_chars": [
            [
                0,
                108
            ],
            [
                108,
                202
            ],
            [
                202,
                255
            ],
            [
                255,
                274
            ],
            [
                274,
                335
            ],
            [
                335,
                408
            ],
            [
                408,
                458
            ],
            [
                458,
                495
            ],
            [
                495,
                553
            ],
            [
                553,
                865
            ],
            [
                865,
                1012
            ],
            [
                1012,
                1134
            ],
            [
                1134,
                1183
            ],
            [
                1183,
                1204
            ],
            [
                1204,
                1244
            ],
            [
                1244,
                1295
            ],
            [
                1295,
                1379
            ],
            [
                1379,
                1475
            ],
            [
                1475,
                1507
            ],
            [
                1507,
                1536
            ],
            [
                1536,
                1753
            ],
            [
                1753,
                1933
            ],
            [
                1933,
                2053
            ],
            [
                2053,
                2203
            ],
            [
                2203,
                2347
            ],
            [
                2347,
                2397
            ],
            [
                2397,
                2548
            ],
            [
                2548,
                2602
            ],
            [
                2602,
                2621
            ],
            [
                2621,
                2667
            ],
            [
                2667,
                2766
            ],
            [
                2766,
                2906
            ],
            [
                2906,
                3084
            ],
            [
                3084,
                3372
            ],
            [
                3372,
                3603
            ],
            [
                3603,
                3758
            ],
            [
                3758,
                3785
            ],
            [
                3785,
                3877
            ],
            [
                3877,
                3976
            ],
            [
                3976,
                4111
            ],
            [
                4111,
                4292
            ],
            [
                4292,
                4453
            ],
            [
                4453,
                4616
            ],
            [
                4616,
                4692
            ],
            [
                4692,
                4867
            ],
            [
                4867,
                4944
            ],
            [
                4944,
                5110
            ],
            [
                5110,
                5224
            ],
            [
                5224,
                6033
            ],
            [
                6033,
                6136
            ],
            [
                6136,
                6169
            ],
            [
                6169,
                6238
            ],
            [
                6238,
                6302
            ],
            [
                6302,
                6376
            ],
            [
                6376,
                6505
            ],
            [
                6505,
                6623
            ],
            [
                6623,
                6708
            ],
            [
                6708,
                6865
            ],
            [
                6865,
                6888
            ],
            [
                6888,
                6961
            ],
            [
                6961,
                6999
            ],
            [
                6999,
                7017
            ],
            [
                7017,
                7039
            ],
            [
                7039,
                7063
            ],
            [
                7063,
                7113
            ],
            [
                7113,
                7162
            ],
            [
                7162,
                7249
            ],
            [
                7249,
                7293
            ],
            [
                7293,
                7329
            ],
            [
                7329,
                7453
            ],
            [
                7453,
                7483
            ],
            [
                7483,
                7512
            ],
            [
                7512,
                7618
            ],
            [
                7618,
                7697
            ],
            [
                7697,
                7777
            ],
            [
                7777,
                7837
            ],
            [
                7837,
                8019
            ],
            [
                8019,
                8181
            ],
            [
                8181,
                8265
            ],
            [
                8265,
                8397
            ],
            [
                8397,
                8456
            ],
            [
                8456,
                8598
            ],
            [
                8598,
                8738
            ],
            [
                8738,
                8778
            ],
            [
                8778,
                8848
            ],
            [
                8848,
                8922
            ],
            [
                8922,
                9740
            ],
            [
                9740,
                9806
            ],
            [
                9806,
                9861
            ],
            [
                9861,
                9953
            ],
            [
                9953,
                10078
            ],
            [
                10078,
                10218
            ],
            [
                10218,
                10353
            ],
            [
                10353,
                10445
            ],
            [
                10445,
                10494
            ],
            [
                10494,
                10580
            ],
            [
                10580,
                10679
            ],
            [
                10679,
                10715
            ],
            [
                10715,
                10765
            ],
            [
                10765,
                10900
            ],
            [
                10900,
                11049
            ],
            [
                11049,
                11168
            ],
            [
                11168,
                11251
            ],
            [
                11251,
                11331
            ],
            [
                11331,
                11341
            ],
            [
                11341,
                11558
            ],
            [
                11558,
                11632
            ],
            [
                11632,
                11677
            ],
            [
                11677,
                11792
            ],
            [
                11792,
                11910
            ],
            [
                11910,
                11981
            ],
            [
                11981,
                12039
            ],
            [
                12039,
                12138
            ],
            [
                12138,
                12194
            ],
            [
                12194,
                12337
            ],
            [
                12337,
                12488
            ],
            [
                12488,
                12510
            ],
            [
                12510,
                12561
            ],
            [
                12561,
                12612
            ],
            [
                12612,
                12652
            ],
            [
                12652,
                12695
            ],
            [
                12695,
                12717
            ],
            [
                12717,
                12797
            ],
            [
                12797,
                12891
            ],
            [
                12891,
                12927
            ],
            [
                12927,
                12957
            ],
            [
                12957,
                13054
            ],
            [
                13054,
                13068
            ],
            [
                13068,
                13144
            ],
            [
                13144,
                13277
            ],
            [
                13277,
                13300
            ],
            [
                13300,
                13332
            ],
            [
                13332,
                13436
            ],
            [
                13436,
                13482
            ],
            [
                13482,
                13554
            ],
            [
                13554,
                13644
            ],
            [
                13644,
                13832
            ],
            [
                13832,
                13843
            ],
            [
                13843,
                13957
            ],
            [
                13957,
                14275
            ],
            [
                14275,
                14420
            ],
            [
                14420,
                14472
            ],
            [
                14472,
                14543
            ],
            [
                14543,
                14725
            ],
            [
                14725,
                14812
            ],
            [
                14812,
                14827
            ],
            [
                14827,
                14843
            ],
            [
                14843,
                14949
            ],
            [
                14949,
                15176
            ],
            [
                15176,
                15223
            ],
            [
                15223,
                15263
            ],
            [
                15263,
                15399
            ],
            [
                15399,
                15434
            ],
            [
                15434,
                15470
            ],
            [
                15470,
                15558
            ],
            [
                15558,
                15585
            ],
            [
                15585,
                15699
            ],
            [
                15699,
                15883
            ],
            [
                15883,
                15975
            ],
            [
                15975,
                15999
            ],
            [
                15999,
                16054
            ],
            [
                16054,
                16158
            ],
            [
                16158,
                16184
            ],
            [
                16184,
                16188
            ],
            [
                16188,
                16215
            ],
            [
                16215,
                16283
            ],
            [
                16283,
                16366
            ],
            [
                16366,
                16472
            ],
            [
                16472,
                16557
            ],
            [
                16557,
                16596
            ],
            [
                16596,
                16667
            ],
            [
                16667,
                16747
            ],
            [
                16747,
                16788
            ],
            [
                16788,
                16858
            ],
            [
                16858,
                16880
            ],
            [
                16880,
                16938
            ],
            [
                16938,
                16997
            ],
            [
                16997,
                17151
            ],
            [
                17151,
                17181
            ],
            [
                17181,
                17195
            ],
            [
                17195,
                17248
            ],
            [
                17248,
                17273
            ],
            [
                17273,
                17286
            ],
            [
                17286,
                17324
            ],
            [
                17324,
                17393
            ],
            [
                17393,
                17465
            ],
            [
                17465,
                17589
            ],
            [
                17589,
                17644
            ],
            [
                17644,
                17676
            ],
            [
                17676,
                17734
            ],
            [
                17734,
                17837
            ],
            [
                17837,
                17891
            ],
            [
                17891,
                17944
            ],
            [
                17944,
                18019
            ],
            [
                18019,
                18091
            ],
            [
                18091,
                18107
            ],
            [
                18107,
                18170
            ],
            [
                18170,
                18256
            ],
            [
                18256,
                18406
            ],
            [
                18406,
                18448
            ],
            [
                18448,
                18556
            ],
            [
                18556,
                18767
            ],
            [
                18767,
                18909
            ],
            [
                18909,
                19061
            ],
            [
                19061,
                19286
            ],
            [
                19286,
                19368
            ],
            [
                19368,
                19555
            ],
            [
                19555,
                19673
            ],
            [
                19673,
                19755
            ],
            [
                19755,
                19867
            ],
            [
                19867,
                19994
            ],
            [
                19994,
                20095
            ],
            [
                20095,
                20193
            ],
            [
                20193,
                20233
            ],
            [
                20233,
                20293
            ],
            [
                20293,
                20418
            ]
        ]
    },
    "abridged": {
        "text": "These arrangements for the return of Mr. Palliser's party to London did not, of course, include Mr. Grey.\n\"I suppose we shall see you in England before long?\" said Mr. Palliser.\n\"I shall be able to tell you that before you go,\" said Grey. \"In any event I shall return to England before winter.\"\n\"Then come to us at Matching,\" said Mr. Palliser. \"We shall be most happy to have you. Say that you'll come for the first fortnight in December. After that we always go to the Duke, in Barsetshire - though I don't suppose we shall go anywhere this year.\" Mr. Palliser reflected that, under the circumstances, it might be improper to have any guests at Matching in December. But he had become very fond of Mr. Grey, and now, as on several occasions, pressed him warmly to make an attempt at Parliament. \"It isn't nearly so difficult as you think,\" said he. \"Look at Mr. Vavasor. Even he got a seat.\"\n\"But he had to pay for it very dearly.\"\n\"You might easily find some quiet little borough.\"\n\"Quiet little boroughs have usually got their own quiet little Members,\" said Grey.\n\"They're fond of change; and if you like to spend a thousand pounds, the thing isn't difficult. I'll put you in the way of it.\"\nBut Mr. Grey still declined. He was not a man to be talked out of his own way of life, and the very fact that George Vavasor had been in Parliament deterred him from making any attempt himself.\nAlice had also wanted him to go into public life, but he had put aside her request without giving it consideration. It was this immobility on his part - this absolute lack of any of the weakness of indecision, which had frightened her, and driven her away from him. He was partly aware of this; but if he had not done it at her suggestion, he certainly would not do on the advice of anyone else. If he changed his mind, what terrible acknowledgements of his own faults must he not have made before Alice?\n\"I suppose books, then, will be your object in life?\" said Mr. Palliser.\n\"I hope they will be my aids,\" Grey answered. \"I almost doubt whether any object is necessary for life. It seems to me that if a man can live honestly and die fearlessly, he has done about as much as is necessary.\"\n\"He has done a great deal, certainly,\" said Mr. Palliser, who would have been ready enough to carry on the argument if he had more time. He knew that he himself was working for others, and not for himself; and he was aware that good men struggle as they do in order that others, besides themselves, may live honestly and die fearlessly. The recluse of Nethercoats had thought much more about all this than the rising star of the House of Commons; but the rising star had the better philosophy of the two, though he was a less brilliant man.\n\"I don't see why a man should not live honestly and be a Member of Parliament as well,\" continued Mr. Palliser.\n\"Nor I either,\" said Grey. \"I am sure that there are such men, and that the country is under great obligation to them. But they have temptations which a prudent man may do well to avoid.\" But though he spoke with an assured tone, he was shaken, and almost regretted that he did not accept the aid which was offered to him.\nWhat he now wished for was a renewal of his engagement with Alice, and he felt that he must obtain an answer from her before they left Lucerne. If she still persisted in refusing to give him her hand, it would not be consistent with his dignity to continue his immediate pursuit of her any longer. In that case he must leave her, and see what the future might bring. If Alice were to remain single, he might try again, after a year or two. But if he failed now, then for that year or two he would see her no more.\nHaving resolved this, he asked her one evening whether she would walk with him on the following morning - the morning of her last day at Lucerne. As she agreed she knew well what was to come. She said nothing to Lady Glencora about it, but that night, when she was alone, she tried to decide what she would do.\nShe knew that she loved the man. She knew that he was as true to her as the sun is true to the earth. She knew that she would be safe in his hands. She knew that Lady Glencora would be delighted, and her father gratified. She knew that by such a marriage she would gain all that women generally look to gain when they give themselves away.\nBut, nevertheless, as far as she could decide at all, she decided against her lover. She had no right to be taken back after the evil that she had done, and she did not choose to be taken back as an object of pity and forgiveness.\n\"Where are you going?\" said her cousin, when she came in with her hat on, soon after breakfast.\n\"I am going to walk with Mr. Grey. He asked me yesterday to walk with him this morning, and I could not very well refuse him.\"\n\"Why should you have wished to refuse him?\"\n\"I think it would have been pleasanter for us to have parted without any need for special words.\"\n\"Alice, you are such a fool!\"\n\"So you tell me very often.\"\n\"Of course he is now going to say the very thing that he has come all this way for. He has been wonderfully slow about it; but you are slower. If you don't make up with him now, I really shall think you are very wicked. I can't understand it. I know you want to be his wife, and I know he wants to be your husband, and the only thing that keeps you apart is your obstinacy. You may be sure of this, Alice; if you refuse him now, it'll be for the last time.\"\n\"You are making me very unhappy, Glencora,\" she said.\n\"I wish I could break you down with unhappiness,\" Lady Glencora answered, \"so that he might find you less stiff, and hard, and unmanageable.\" Just then he came in, looking as though he had no business on hand more exciting than his ordinary morning's tranquil employments.\n\"So you and Alice are going to make your adieux,\" said Lady Glencora.\n\"It must be done sooner or later,\" said Mr. Grey; and off they went.\nThe church by Lake Lucerne is one of the prettiest spots in that land of beauty. Up here, into the cloisters, Alice and John Grey went together.\n\"We will go in here for a few minutes,\" he said. \"It is a lovely spot, and we don't know when we may see it again.\" The place was deserted as they went in, and sat down on one of the embrasures that open over the lake.\n\"Probably never again,\" said Alice. \"And yet I have been here now two years running.\" She shuddered as she remembered the time when George Vavasor had been with her; and she hated herself. No woman had a clearer idea of feminine constancy than she had, and no woman had sinned against that idea more deeply. He gave her time to think of all this as he sat looking down upon the water.\n\"And yet I would sooner live in Cambridgeshire,\" he said.\n\"Why so?\"\n\"Partly because such beauty and romance should not make up the staple of one's life. Romance, if it is to come at all, should always come by fits and starts.\"\n\"I should like to live in a pretty country.\"\n\"And would like to live a romantic life; but all those things lose their charm if they are made common. When a man has to go to Vienna or St. Petersburg two or three times a month, you don't suppose he enjoys travelling?\"\n\"All the same, I should like to live in a pretty country,\" said Alice.\n\"And I want you to come and live in a very ugly country.\" Then he paused for a minute or two, not looking at her, but gazing still on the mountain opposite. \"I don't think,\" he went on, \"that you would let that stand in your way, if on other grounds you were willing to become my wife.\"\n\"Prettiness would have nothing to do with it,\" said Alice.\n\"Will you come, then? Will you come and be my wife, and help me to be happy amidst all that ugliness? Will you come and be my one beautiful thing, my treasure, my joy, my comfort, my counsellor?\"\n\"You need no counsellor, Mr. Grey.\"\n\"No man ever needed one more. Alice, this has been a bad year to me, and I do not think that it has been a happy one for you.\"\n\"Indeed, no.\"\n\"Let us forget it - or rather, let us treat it as though it were forgotten. Twelve months ago you were mine - enough mine, at least, that I had a right to boast of my possession among my friends.\"\n\"It was a poor boast.\"\n\"They did not seem to think so. And no man was ever better contented with his bargain than I was with mine. Let us go back to it, and the last twelve months shall be as though they had never been.\"\n\"That cannot be, Mr. Grey - because I cannot forgive myself what I have done, and you ought not to forgive me.\"\n\"But I do. I think you have been foolish, misguided - led away by a vain ambition, and that in your difficulty, you tried to force yourself to do something which you then found to be contrary to your nature.\" As he spoke, she turned her eyes upon him, wondering that he should have read her heart so accurately. \"I never believed that you would marry your cousin. When I was told of it, I knew that trouble had blinded you for a while. You had driven yourself to revolt against me, and your heart misgave you, and you said to yourself that it did not matter then how you might throw away all your sweetness.\n\"But the storm passes over the tree and does not tear it up by the roots. Alice, when the winds were shaking you, and you were torn and buffeted, I never thought your destruction was at hand. There may be some who will forgive you slowly. Your own self-forgiveness will be slow. But I, who have known you better than any one, I have forgiven you everything, have forgiven you instantly. Come to me, Alice, and comfort me. Come to me, for I want you sorely.\"\nShe sat quite still, looking at the lake and the mountain beyond, but she said nothing. What could she say to him?\n\"My need of you is much greater now,\" he went on to say, \"than when I first asked you. Then I could have borne to lose you, as I had never pictured to myself the life that might be mine if you were with me. But since that day I have had no other hope but this. Am I to plead in vain?\"\n\"You do not know me,\" she said; \"how vile I have been! You do not think what it is, for a woman to have promised herself to one man while she loved another.\"\n\"But it was me you loved. I can forgive that. Alice, you should scold me for my vanity, for I have believed all through that you loved me. Come to me, dear, and tell me that it is so, and the past shall be only as a dream.\"\n\"I am dreaming it always,\" said Alice.\n\"They will cease to be bitter dreams if your head be upon my shoulder. You will cease to reproach yourself when you know that you have made me happy.\"\n\"I shall never cease to reproach myself. I have done that which no woman can do and honour herself afterwards. I have been - a jilt.\"\n\"The noblest jilt that ever yet halted between two minds! There has been no touch of selfishness in your fickleness. I think I could be hard enough upon a woman who had left me for greater wealth, or higher rank. It has not been so with you.\"\n\"Yes, it has. I thought you were too firm in your own will, and-\"\n\"And you think so still. Is that it?\"\n\"It does not matter what I think now. I no longer have a right to such thoughts. It will be better for us both that you should leave me - and forget me. There are things which, if a woman does them, she should never permit herself to forget.\"\n\"And am I to be punished, then, because of your fault? Is that your sense of justice?\" He stood and looked down upon her. \"Alice, if you tell me that you do not love me, I will believe you, and will trouble you no more. I know that you will say nothing that is false. But if you love me, I have a right to demand your hand. My happiness requires it, and I have a right to expect your compliance. I do demand it. If you love me, Alice, I tell you that you dare not refuse me. If you do so, you will fail hereafter to reconcile it to your conscience before God.\"\nThen he waited; but Alice sat silent, with her eyes turned upon the tombstones. Of course she had no choice but to yield. He had left her no alternative but to be happy. But there still clung to her what I fear we must call a perverseness of obstinacy, a desire to keep the resolution she had made - to undergo the punishment she had deserved. She was as a prisoner who would fain cling to his prison after pardon has reached him, because he is conscious that the pardon is undeserved.\nAnd it may be that she still felt some remnant of the rebellion which his masterful spirit had always produced in her. He was so imperious in his tranquillity - he argued with such a manifest weight of right on his side, that she had always felt that to yield to him would be to confess the omnipotence of his power. She knew now that she must yield to him.\nNevertheless, the word which she had to speak still remained unspoken, and he stood waiting for her answer. Then slowly he sat down beside her, and gradually he put his arm round her waist. She shrank from him, against the stonework, but she could not shrink away from his grasp. She put up her hand to impede his, but his hand, like his character and his words, would not be impeded.\n\"Alice,\" he said, as he pressed her close with his arm, \"the battle is over now, and I have won it.\"\n\"You win everything - always,\" she said, whispering to him, as she still shrank from his embrace.\n\"In winning you I have won everything.\" Then he pressed his lips to hers.",
        "paragraph_chars": [
            [
                0,
                106
            ],
            [
                106,
                178
            ],
            [
                178,
                295
            ],
            [
                295,
                894
            ],
            [
                894,
                934
            ],
            [
                934,
                985
            ],
            [
                985,
                1069
            ],
            [
                1069,
                1197
            ],
            [
                1197,
                1391
            ],
            [
                1391,
                1896
            ],
            [
                1896,
                1969
            ],
            [
                1969,
                2184
            ],
            [
                2184,
                2725
            ],
            [
                2725,
                2837
            ],
            [
                2837,
                3160
            ],
            [
                3160,
                3674
            ],
            [
                3674,
                3985
            ],
            [
                3985,
                4325
            ],
            [
                4325,
                4556
            ],
            [
                4556,
                4652
            ],
            [
                4652,
                4779
            ],
            [
                4779,
                4823
            ],
            [
                4823,
                4921
            ],
            [
                4921,
                4951
            ],
            [
                4951,
                4980
            ],
            [
                4980,
                5438
            ],
            [
                5438,
                5492
            ],
            [
                5492,
                5765
            ],
            [
                5765,
                5835
            ],
            [
                5835,
                5904
            ],
            [
                5904,
                6049
            ],
            [
                6049,
                6268
            ],
            [
                6268,
                6653
            ],
            [
                6653,
                6711
            ],
            [
                6711,
                6721
            ],
            [
                6721,
                6880
            ],
            [
                6880,
                6925
            ],
            [
                6925,
                7147
            ],
            [
                7147,
                7218
            ],
            [
                7218,
                7505
            ],
            [
                7505,
                7564
            ],
            [
                7564,
                7760
            ],
            [
                7760,
                7796
            ],
            [
                7796,
                7923
            ],
            [
                7923,
                7937
            ],
            [
                7937,
                8134
            ],
            [
                8134,
                8157
            ],
            [
                8157,
                8355
            ],
            [
                8355,
                8467
            ],
            [
                8467,
                9075
            ],
            [
                9075,
                9533
            ],
            [
                9533,
                9648
            ],
            [
                9648,
                9933
            ],
            [
                9933,
                10091
            ],
            [
                10091,
                10315
            ],
            [
                10315,
                10354
            ],
            [
                10354,
                10505
            ],
            [
                10505,
                10639
            ],
            [
                10639,
                10882
            ],
            [
                10882,
                10948
            ],
            [
                10948,
                10986
            ],
            [
                10986,
                11229
            ],
            [
                11229,
                11790
            ],
            [
                11790,
                12276
            ],
            [
                12276,
                12634
            ],
            [
                12634,
                13019
            ],
            [
                13019,
                13120
            ],
            [
                13120,
                13218
            ],
            [
                13218,
                13291
            ]
        ],
        "segment_chars": [
            [
                0,
                106
            ],
            [
                106,
                159
            ],
            [
                159,
                178
            ],
            [
                178,
                239
            ],
            [
                239,
                295
            ],
            [
                295,
                345
            ],
            [
                345,
                382
            ],
            [
                382,
                440
            ],
            [
                440,
                550
            ],
            [
                550,
                669
            ],
            [
                669,
                797
            ],
            [
                797,
                851
            ],
            [
                851,
                873
            ],
            [
                873,
                894
            ],
            [
                894,
                934
            ],
            [
                934,
                985
            ],
            [
                985,
                1069
            ],
            [
                1069,
                1165
            ],
            [
                1165,
                1197
            ],
            [
                1197,
                1226
            ],
            [
                1226,
                1391
            ],
            [
                1391,
                1507
            ],
            [
                1507,
                1657
            ],
            [
                1657,
                1787
            ],
            [
                1787,
                1896
            ],
            [
                1896,
                1950
            ],
            [
                1950,
                1969
            ],
            [
                1969,
                2015
            ],
            [
                2015,
                2073
            ],
            [
                2073,
                2184
            ],
            [
                2184,
                2321
            ],
            [
                2321,
                2521
            ],
            [
                2521,
                2725
            ],
            [
                2725,
                2837
            ],
            [
                2837,
                2864
            ],
            [
                2864,
                2956
            ],
            [
                2956,
                3025
            ],
            [
                3025,
                3160
            ],
            [
                3160,
                3304
            ],
            [
                3304,
                3458
            ],
            [
                3458,
                3527
            ],
            [
                3527,
                3600
            ],
            [
                3600,
                3674
            ],
            [
                3674,
                3820
            ],
            [
                3820,
                3866
            ],
            [
                3866,
                3985
            ],
            [
                3985,
                4018
            ],
            [
                4018,
                4087
            ],
            [
                4087,
                4133
            ],
            [
                4133,
                4207
            ],
            [
                4207,
                4325
            ],
            [
                4325,
                4410
            ],
            [
                4410,
                4556
            ],
            [
                4556,
                4579
            ],
            [
                4579,
                4652
            ],
            [
                4652,
                4687
            ],
            [
                4687,
                4779
            ],
            [
                4779,
                4823
            ],
            [
                4823,
                4921
            ],
            [
                4921,
                4951
            ],
            [
                4951,
                4980
            ],
            [
                4980,
                5064
            ],
            [
                5064,
                5123
            ],
            [
                5123,
                5200
            ],
            [
                5200,
                5223
            ],
            [
                5223,
                5354
            ],
            [
                5354,
                5438
            ],
            [
                5438,
                5492
            ],
            [
                5492,
                5634
            ],
            [
                5634,
                5765
            ],
            [
                5765,
                5835
            ],
            [
                5835,
                5904
            ],
            [
                5904,
                5985
            ],
            [
                5985,
                6049
            ],
            [
                6049,
                6098
            ],
            [
                6098,
                6165
            ],
            [
                6165,
                6268
            ],
            [
                6268,
                6304
            ],
            [
                6304,
                6354
            ],
            [
                6354,
                6457
            ],
            [
                6457,
                6576
            ],
            [
                6576,
                6653
            ],
            [
                6653,
                6711
            ],
            [
                6711,
                6721
            ],
            [
                6721,
                6806
            ],
            [
                6806,
                6880
            ],
            [
                6880,
                6925
            ],
            [
                6925,
                7029
            ],
            [
                7029,
                7147
            ],
            [
                7147,
                7218
            ],
            [
                7218,
                7276
            ],
            [
                7276,
                7375
            ],
            [
                7375,
                7505
            ],
            [
                7505,
                7564
            ],
            [
                7564,
                7586
            ],
            [
                7586,
                7666
            ],
            [
                7666,
                7760
            ],
            [
                7760,
                7796
            ],
            [
                7796,
                7826
            ],
            [
                7826,
                7923
            ],
            [
                7923,
                7937
            ],
            [
                7937,
                8013
            ],
            [
                8013,
                8134
            ],
            [
                8134,
                8157
            ],
            [
                8157,
                8189
            ],
            [
                8189,
                8265
            ],
            [
                8265,
                8355
            ],
            [
                8355,
                8467
            ],
            [
                8467,
                8478
            ],
            [
                8478,
                8676
            ],
            [
                8676,
                8779
            ],
            [
                8779,
                8831
            ],
            [
                8831,
                8903
            ],
            [
                8903,
                9075
            ],
            [
                9075,
                9149
            ],
            [
                9149,
                9267
            ],
            [
                9267,
                9314
            ],
            [
                9314,
                9354
            ],
            [
                9354,
                9462
            ],
            [
                9462,
                9497
            ],
            [
                9497,
                9533
            ],
            [
                9533,
                9621
            ],
            [
                9621,
                9648
            ],
            [
                9648,
                9735
            ],
            [
                9735,
                9855
            ],
            [
                9855,
                9909
            ],
            [
                9909,
                9933
            ],
            [
                9933,
                9988
            ],
            [
                9988,
                10091
            ],
            [
                10091,
                10117
            ],
            [
                10117,
                10137
            ],
            [
                10137,
                10230
            ],
            [
                10230,
                10315
            ],
            [
                10315,
                10354
            ],
            [
                10354,
                10425
            ],
            [
                10425,
                10505
            ],
            [
                10505,
                10546
            ],
            [
                10546,
                10616
            ],
            [
                10616,
                10639
            ],
            [
                10639,
                10697
            ],
            [
                10697,
                10756
            ],
            [
                10756,
                10852
            ],
            [
                10852,
                10882
            ],
            [
                10882,
                10896
            ],
            [
                10896,
                10948
            ],
            [
                10948,
                10973
            ],
            [
                10973,
                10986
            ],
            [
                10986,
                11024
            ],
            [
                11024,
                11067
            ],
            [
                11067,
                11139
            ],
            [
                11139,
                11229
            ],
            [
                11229,
                11284
            ],
            [
                11284,
                11316
            ],
            [
                11316,
                11351
            ],
            [
                11351,
                11449
            ],
            [
                11449,
                11497
            ],
            [
                11497,
                11553
            ],
            [
                11553,
                11625
            ],
            [
                11625,
                11641
            ],
            [
                11641,
                11704
            ],
            [
                11704,
                11790
            ],
            [
                11790,
                11870
            ],
            [
                11870,
                11912
            ],
            [
                11912,
                11960
            ],
            [
                11960,
                12134
            ],
            [
                12134,
                12276
            ],
            [
                12276,
                12395
            ],
            [
                12395,
                12593
            ],
            [
                12593,
                12634
            ],
            [
                12634,
                12742
            ],
            [
                12742,
                12824
            ],
            [
                12824,
                12914
            ],
            [
                12914,
                13019
            ],
            [
                13019,
                13120
            ],
            [
                13120,
                13218
            ],
            [
                13218,
                13258
            ],
            [
                13258,
                13291
            ]
        ],
        "overlap_chars": [
            [
                0,
                18
            ],
            [
                23,
                105
            ],
            [
                106,
                159
            ],
            [
                159,
                177
            ],
            [
                178,
                239
            ],
            [
                239,
                240
            ],
            [
                240,
                285
            ],
            [
                286,
                295
            ],
            [
                295,
                345
            ],
            [
                345,
                382
            ],
            [
                382,
                440
            ],
            [
                440,
                491
            ],
            [
                492,
                493
            ],
            [
                494,
                500
            ],
            [
                501,
                547
            ],
            [
                550,
                562
            ],
            [
                573,
                588
            ],
            [
                589,
                602
            ],
            [
                602,
                669
            ],
            [
                669,
                713
            ],
            [
                717,
                721
            ],
            [
                722,
                724
            ],
            [
                742,
                797
            ],
            [
                797,
                849
            ],
            [
                849,
                851
            ],
            [
                851,
                852
            ],
            [
                860,
                873
            ],
            [
                873,
                894
            ],
            [
                894,
                934
            ],
            [
                934,
                985
            ],
            [
                985,
                1069
            ],
            [
                1069,
                1165
            ],
            [
                1165,
                1196
            ],
            [
                1197,
                1226
            ],
            [
                1226,
                1242
            ],
            [
                1243,
                1344
            ],
            [
                1370,
                1381
            ],
            [
                1389,
                1390
            ],
            [
                1391,
                1473
            ],
            [
                1482,
                1488
            ],
            [
                1492,
                1507
            ],
            [
                1507,
                1541
            ],
            [
                1544,
                1557
            ],
            [
                1563,
                1657
            ],
            [
                1657,
                1689
            ],
            [
                1693,
                1699
            ],
            [
                1712,
                1718
            ],
            [
                1729,
                1756
            ],
            [
                1760,
                1773
            ],
            [
                1781,
                1787
            ],
            [
                1790,
                1792
            ],
            [
                1809,
                1810
            ],
            [
                1811,
                1876
            ],
            [
                1882,
                1896
            ],
            [
                1896,
                1950
            ],
            [
                1950,
                1969
            ],
            [
                1969,
                2015
            ],
            [
                2015,
                2049
            ],
            [
                2050,
                2071
            ],
            [
                2071,
                2073
            ],
            [
                2073,
                2105
            ],
            [
                2106,
                2184
            ],
            [
                2184,
                2245
            ],
            [
                2252,
                2256
            ],
            [
                2257,
                2261
            ],
            [
                2262,
                2299
            ],
            [
                2303,
                2305
            ],
            [
                2306,
                2319
            ],
            [
                2319,
                2321
            ],
            [
                2321,
                2328
            ],
            [
                2329,
                2406
            ],
            [
                2407,
                2500
            ],
            [
                2501,
                2504
            ],
            [
                2505,
                2521
            ],
            [
                2521,
                2638
            ],
            [
                2639,
                2650
            ],
            [
                2655,
                2702
            ],
            [
                2705,
                2724
            ],
            [
                2725,
                2835
            ],
            [
                2835,
                2837
            ],
            [
                2837,
                2864
            ],
            [
                2864,
                2956
            ],
            [
                2956,
                2964
            ],
            [
                2970,
                3001
            ],
            [
                3002,
                3005
            ],
            [
                3006,
                3025
            ],
            [
                3025,
                3159
            ],
            [
                3165,
                3167
            ],
            [
                3168,
                3171
            ],
            [
                3183,
                3304
            ],
            [
                3304,
                3404
            ],
            [
                3405,
                3458
            ],
            [
                3458,
                3460
            ],
            [
                3466,
                3502
            ],
            [
                3507,
                3513
            ],
            [
                3514,
                3525
            ],
            [
                3525,
                3527
            ],
            [
                3527,
                3584
            ],
            [
                3585,
                3600
            ],
            [
                3600,
                3621
            ],
            [
                3622,
                3626
            ],
            [
                3627,
                3647
            ],
            [
                3648,
                3673
            ],
            [
                3674,
                3680
            ],
            [
                3681,
                3689
            ],
            [
                3694,
                3708
            ],
            [
                3709,
                3720
            ],
            [
                3721,
                3777
            ],
            [
                3795,
                3798
            ],
            [
                3818,
                3820
            ],
            [
                3820,
                3826
            ],
            [
                3834,
                3866
            ],
            [
                3866,
                3899
            ],
            [
                3906,
                3908
            ],
            [
                3908,
                3913
            ],
            [
                3914,
                3925
            ],
            [
                3926,
                3934
            ],
            [
                3935,
                3949
            ],
            [
                3956,
                3958
            ],
            [
                3966,
                3983
            ],
            [
                3983,
                3984
            ],
            [
                3985,
                4018
            ],
            [
                4018,
                4087
            ],
            [
                4087,
                4113
            ],
            [
                4114,
                4133
            ],
            [
                4133,
                4207
            ],
            [
                4207,
                4324
            ],
            [
                4325,
                4410
            ],
            [
                4410,
                4426
            ],
            [
                4427,
                4556
            ],
            [
                4556,
                4579
            ],
            [
                4579,
                4652
            ],
            [
                4652,
                4671
            ],
            [
                4672,
                4685
            ],
            [
                4687,
                4755
            ],
            [
                4761,
                4779
            ],
            [
                4779,
                4823
            ],
            [
                4824,
                4895
            ],
            [
                4901,
                4921
            ],
            [
                4921,
                4951
            ],
            [
                4951,
                4980
            ],
            [
                4980,
                5062
            ],
            [
                5062,
                5064
            ],
            [
                5064,
                5106
            ],
            [
                5107,
                5123
            ],
            [
                5123,
                5140
            ],
            [
                5141,
                5200
            ],
            [
                5200,
                5223
            ],
            [
                5223,
                5352
            ],
            [
                5352,
                5354
            ],
            [
                5354,
                5438
            ],
            [
                5438,
                5490
            ],
            [
                5490,
                5491
            ],
            [
                5492,
                5634
            ],
            [
                5644,
                5764
            ],
            [
                5765,
                5834
            ],
            [
                5835,
                5888
            ],
            [
                5889,
                5892
            ],
            [
                5893,
                5902
            ],
            [
                5902,
                5904
            ],
            [
                5904,
                5914
            ],
            [
                5915,
                5917
            ],
            [
                5918,
                5922
            ],
            [
                5923,
                5930
            ],
            [
                5931,
                5983
            ],
            [
                5983,
                5985
            ],
            [
                5985,
                5998
            ],
            [
                6003,
                6048
            ],
            [
                6049,
                6098
            ],
            [
                6098,
                6104
            ],
            [
                6114,
                6118
            ],
            [
                6118,
                6165
            ],
            [
                6165,
                6168
            ],
            [
                6191,
                6252
            ],
            [
                6253,
                6268
            ],
            [
                6268,
                6304
            ],
            [
                6304,
                6353
            ],
            [
                6354,
                6385
            ],
            [
                6400,
                6432
            ],
            [
                6438,
                6457
            ],
            [
                6457,
                6576
            ],
            [
                6576,
                6623
            ],
            [
                6624,
                6653
            ],
            [
                6653,
                6701
            ],
            [
                6702,
                6704
            ],
            [
                6709,
                6711
            ],
            [
                6711,
                6721
            ],
            [
                6721,
                6736
            ],
            [
                6737,
                6748
            ],
            [
                6749,
                6752
            ],
            [
                6753,
                6760
            ],
            [
                6761,
                6806
            ],
            [
                6806,
                6880
            ],
            [
                6880,
                6925
            ],
            [
                6925,
                6964
            ],
            [
                6964,
                7029
            ],
            [
                7029,
                7147
            ],
            [
                7147,
                7218
            ],
            [
                7218,
                7276
            ],
            [
                7276,
                7375
            ],
            [
                7375,
                7402
            ],
            [
                7402,
                7428
            ],
            [
                7429,
                7505
            ],
            [
                7505,
                7506
            ],
            [
                7517,
                7564
            ],
            [
                7564,
                7586
            ],
            [
                7586,
                7666
            ],
            [
                7666,
                7760
            ],
            [
                7760,
                7764
            ],
            [
                7770,
                7796
            ],
            [
                7796,
                7808
            ],
            [
                7816,
                7826
            ],
            [
                7826,
                7923
            ],
            [
                7923,
                7937
            ],
            [
                7937,
                7954
            ],
            [
                7957,
                8013
            ],
            [
                8013,
                8044
            ],
            [
                8054,
                8058
            ],
            [
                8058,
                8062
            ],
            [
                8068,
                8069
            ],
            [
                8070,
                8134
            ],
            [
                8134,
                8157
            ],
            [
                8157,
                8189
            ],
            [
                8193,
                8265
            ],
            [
                8265,
                8355
            ],
            [
                8355,
                8380
            ],
            [
                8383,
                8436
            ],
            [
                8437,
                8467
            ],
            [
                8467,
                8478
            ],
            [
                8478,
                8518
            ],
            [
                8521,
                8561
            ],
            [
                8567,
                8577
            ],
            [
                8577,
                8582
            ],
            [
                8589,
                8591
            ],
            [
                8598,
                8612
            ],
            [
                8623,
                8628
            ],
            [
                8629,
                8632
            ],
            [
                8638,
                8676
            ],
            [
                8676,
                8687
            ],
            [
                8687,
                8718
            ],
            [
                8719,
                8748
            ],
            [
                8749,
                8779
            ],
            [
                8779,
                8831
            ],
            [
                8831,
                8893
            ],
            [
                8901,
                8903
            ],
            [
                8903,
                8952
            ],
            [
                8953,
                9074
            ],
            [
                9075,
                9147
            ],
            [
                9147,
                9149
            ],
            [
                9149,
                9236
            ],
            [
                9242,
                9253
            ],
            [
                9258,
                9266
            ],
            [
                9267,
                9314
            ],
            [
                9314,
                9354
            ],
            [
                9354,
                9400
            ],
            [
                9401,
                9462
            ],
            [
                9462,
                9497
            ],
            [
                9497,
                9532
            ],
            [
                9533,
                9621
            ],
            [
                9621,
                9647
            ],
            [
                9648,
                9733
            ],
            [
                9733,
                9735
            ],
            [
                9735,
                9776
            ],
            [
                9777,
                9845
            ],
            [
                9846,
                9855
            ],
            [
                9855,
                9898
            ],
            [
                9899,
                9907
            ],
            [
                9907,
                9909
            ],
            [
                9909,
                9933
            ],
            [
                9933,
                9988
            ],
            [
                9988,
                10016
            ],
            [
                10017,
                10091
            ],
            [
                10091,
                10117
            ],
            [
                10117,
                10137
            ],
            [
                10137,
                10228
            ],
            [
                10228,
                10230
            ],
            [
                10230,
                10315
            ],
            [
                10315,
                10354
            ],
            [
                10354,
                10425
            ],
            [
                10425,
                10505
            ],
            [
                10505,
                10546
            ],
            [
                10546,
                10616
            ],
            [
                10616,
                10627
            ],
            [
                10630,
                10639
            ],
            [
                10639,
                10697
            ],
            [
                10697,
                10756
            ],
            [
                10756,
                10835
            ],
            [
                10839,
                10850
            ],
            [
                10850,
                10852
            ],
            [
                10852,
                10882
            ],
            [
                10882,
                10896
            ],
            [
                10896,
                10945
            ],
            [
                10948,
                10973
            ],
            [
                10973,
                10986
            ],
            [
                10986,
                11024
            ],
            [
                11024,
                11025
            ],
            [
                11026,
                11035
            ],
            [
                11036,
                11040
            ],
            [
                11041,
                11067
            ],
            [
                11067,
                11121
            ],
            [
                11124,
                11139
            ],
            [
                11139,
                11184
            ],
            [
                11185,
                11229
            ],
            [
                11229,
                11284
            ],
            [
                11284,
                11316
            ],
            [
                11316,
                11318
            ],
            [
                11325,
                11328
            ],
            [
                11329,
                11351
            ],
            [
                11351,
                11365
            ],
            [
                11366,
                11449
            ],
            [
                11449,
                11481
            ],
            [
                11482,
                11497
            ],
            [
                11501,
                11515
            ],
            [
                11515,
                11553
            ],
            [
                11553,
                11625
            ],
            [
                11625,
                11641
            ],
            [
                11641,
                11704
            ],
            [
                11704,
                11790
            ],
            [
                11790,
                11797
            ],
            [
                11798,
                11804
            ],
            [
                11804,
                11826
            ],
            [
                11826,
                11868
            ],
            [
                11868,
                11870
            ],
            [
                11870,
                11912
            ],
            [
                11912,
                11914
            ],
            [
                11915,
                11960
            ],
            [
                11960,
                12054
            ],
            [
                12060,
                12087
            ],
            [
                12090,
                12134
            ],
            [
                12134,
                12275
            ],
            [
                12276,
                12294
            ],
            [
                12299,
                12304
            ],
            [
                12310,
                12325
            ],
            [
                12330,
                12370
            ],
            [
                12378,
                12395
            ],
            [
                12395,
                12434
            ],
            [
                12437,
                12446
            ],
            [
                12447,
                12467
            ],
            [
                12475,
                12593
            ],
            [
                12593,
                12632
            ],
            [
                12632,
                12633
            ],
            [
                12634,
                12717
            ],
            [
                12718,
                12742
            ],
            [
                12742,
                12824
            ],
            [
                12824,
                12844
            ],
            [
                12845,
                12866
            ],
            [
                12866,
                12914
            ],
            [
                12914,
                12996
            ],
            [
                12997,
                13018
            ],
            [
                13019,
                13120
            ],
            [
                13120,
                13139
            ],
            [
                13142,
                13218
            ],
            [
                13218,
                13258
            ],
            [
                13258,
                13265
            ],
            [
                13266,
                13291
            ]
        ],
        "row_chars": [
            [
                0,
                106
            ],
            [
                106,
                106
            ],
            [
                106,
                159
            ],
            [
                159,
                178
            ],
            [
                178,
                239
            ],
            [
                239,
                295
            ],
            [
                295,
                345
            ],
            [
                345,
                382
            ],
            [
                382,
                440
            ],
            [
                440,
                669
            ],
            [
                669,
                797
            ],
            [
                797,
                851
            ],
            [
                851,
                873
            ],
            [
                873,
                894
            ],
            [
                894,
                934
            ],
            [
                934,
                985
            ],
            [
                985,
                1069
            ],
            [
                1069,
                1165
            ],
            [
                1165,
                1197
            ],
            [
                1197,
                1226
            ],
            [
                1226,
                1391
            ],
            [
                1391,
                1507
            ],
            [
                1507,
                1507
            ],
            [
                1507,
                1657
            ],
            [
                1657,
                1787
            ],
            [
                1787,
                1787
            ],
            [
                1787,
                1896
            ],
            [
                1896,
                1950
            ],
            [
                1950,
                1969
            ],
            [
                1969,
                2015
            ],
            [
                2015,
                2073
            ],
            [
                2073,
                2184
            ],
            [
                2184,
                2321
            ],
            [
                2321,
                2521
            ],
            [
                2521,
                2725
            ],
            [
                2725,
                2837
            ],
            [
                2837,
                2864
            ],
            [
                2864,
                2956
            ],
            [
                2956,
                3025
            ],
            [
                3025,
                3160
            ],
            [
                3160,
                3160
            ],
            [
                3160,
                3304
            ],
            [
                3304,
                3458
            ],
            [
                3458,
                3527
            ],
            [
                3527,
                3600
            ],
            [
                3600,
                3674
            ],
            [
                3674,
                3820
            ],
            [
                3820,
                3866
            ],
            [
                3866,
                3985
            ],
            [
                3985,
                3985
            ],
            [
                3985,
                4018
            ],
            [
                4018,
                4087
            ],
            [
                4087,
                4133
            ],
            [
                4133,
                4207
            ],
            [
                4207,
                4207
            ],
            [
                4207,
                4325
            ],
            [
                4325,
                4410
            ],
            [
                4410,
                4556
            ],
            [
                4556,
                4579
            ],
            [
                4579,
                4652
            ],
            [
                4652,
                4687
            ],
            [
                4687,
                4687
            ],
            [
                4687,
                4687
            ],
            [
                4687,
                4687
            ],
            [
                4687,
                4687
            ],
            [
                4687,
                4687
            ],
            [
                4687,
                4779
            ],
            [
                4779,
                4823
            ],
            [
                4823,
                4823
            ],
            [
                4823,
                4921
            ],
            [
                4921,
                4951
            ],
            [
                4951,
                4980
            ],
            [
                4980,
                5064
            ],
            [
                5064,
                5123
            ],
            [
                5123,
                5200
            ],
            [
                5200,
                5223
            ],
            [
                5223,
                5354
            ],
            [
                5354,
                5354
            ],
            [
                5354,
                5438
            ],
            [
                5438,
                5438
            ],
            [
                5438,
                5492
            ],
            [
                5492,
                5634
            ],
            [
                5634,
                5765
            ],
            [
                5765,
                5765
            ],
            [
                5765,
                5835
            ],
            [
                5835,
                5904
            ],
            [
                5904,
                5985
            ],
            [
                5985,
                6049
            ],
            [
                6049,
                6049
            ],
            [
                6049,
                6049
            ],
            [
                6049,
                6049
            ],
            [
                6049,
                6049
            ],
            [
                6049,
                6049
            ],
            [
                6049,
                6049
            ],
            [
                6049,
                6098
            ],
            [
                6098,
                6165
            ],
            [
                6165,
                6268
            ],
            [
                6268,
                6304
            ],
            [
                6304,
                6354
            ],
            [
                6354,
                6457
            ],
            [
                6457,
                6457
            ],
            [
                6457,
                6576
            ],
            [
                6576,
                6653
            ],
            [
                6653,
                6711
            ],
            [
                6711,
                6721
            ],
            [
                6721,
                6806
            ],
            [
                6806,
                6880
            ],
            [
                6880,
                6925
            ],
            [
                6925,
                7029
            ],
            [
                7029,
                7147
            ],
            [
                7147,
                7218
            ],
            [
                7218,
                7276
            ],
            [
                7276,
                7375
            ],
            [
                7375,
                7375
            ],
            [
                7375,
                7375
            ],
            [
                7375,
                7505
            ],
            [
                7505,
                7505
            ],
            [
                7505,
                7505
            ],
            [
                7505,
                7564
            ],
            [
                7564,
                7564
            ],
            [
                7564,
                7564
            ],
            [
                7564,
                7586
            ],
            [
                7586,
                7666
            ],
            [
                7666,
                7760
            ],
            [
                7760,
                7796
            ],
            [
                7796,
                7826
            ],
            [
                7826,
                7923
            ],
            [
                7923,
                7937
            ],
            [
                7937,
                8013
            ],
            [
                8013,
                8134
            ],
            [
                8134,
                8157
            ],
            [
                8157,
                8189
            ],
            [
                8189,
                8189
            ],
            [
                8189,
                8189
            ],
            [
                8189,
                8265
            ],
            [
                8265,
                8355
            ],
            [
                8355,
                8467
            ],
            [
                8467,
                8478
            ],
            [
                8478,
                8478
            ],
            [
                8478,
                8676
            ],
            [
                8676,
                8779
            ],
            [
                8779,
                8831
            ],
            [
                8831,
                8903
            ],
            [
                8903,
                9075
            ],
            [
                9075,
                9075
            ],
            [
                9075,
                9075
            ],
            [
                9075,
                9075
            ],
            [
                9075,
                9149
            ],
            [
                9149,
                9267
            ],
            [
                9267,
                9314
            ],
            [
                9314,
                9354
            ],
            [
                9354,
                9462
            ],
            [
                9462,
                9497
            ],
            [
                9497,
                9533
            ],
            [
                9533,
                9621
            ],
            [
                9621,
                9648
            ],
            [
                9648,
                9735
            ],
            [
                9735,
                9855
            ],
            [
                9855,
                9909
            ],
            [
                9909,
                9933
            ],
            [
                9933,
                9988
            ],
            [
                9988,
                10091
            ],
            [
                10091,
                10117
            ],
            [
                10117,
                10117
            ],
            [
                10117,
                10137
            ],
            [
                10137,
                10137
            ],
            [
                10137,
                10137
            ],
            [
                10137,
                10230
            ],
            [
                10230,
                10315
            ],
            [
                10315,
                10354
            ],
            [
                10354,
                10425
            ],
            [
                10425,
                10505
            ],
            [
                10505,
                10546
            ],
            [
                10546,
                10616
            ],
            [
                10616,
                10639
            ],
            [
                10639,
                10697
            ],
            [
                10697,
                10756
            ],
            [
                10756,
                10852
            ],
            [
                10852,
                10882
            ],
            [
                10882,
                10896
            ],
            [
                10896,
                10948
            ],
            [
                10948,
                10973
            ],
            [
                10973,
                10986
            ],
            [
                10986,
                11024
            ],
            [
                11024,
                11067
            ],
            [
                11067,
                11139
            ],
            [
                11139,
                11229
            ],
            [
                11229,
                11284
            ],
            [
                11284,
                11316
            ],
            [
                11316,
                11351
            ],
            [
                11351,
                11449
            ],
            [
                11449,
                11497
            ],
            [
                11497,
                11497
            ],
            [
                11497,
                11553
            ],
            [
                11553,
                11625
            ],
            [
                11625,
                11641
            ],
            [
                11641,
                11704
            ],
            [
                11704,
                11790
            ],
            [
                11790,
                11870
            ],
            [
                11870,
                11912
            ],
            [
                11912,
                11960
            ],
            [
                11960,
                12134
            ],
            [
                12134,
                12276
            ],
            [
                12276,
                12395
            ],
            [
                12395,
                12593
            ],
            [
                12593,
                12634
            ],
            [
                12634,
                12634
            ],
            [
                12634,
                12742
            ],
            [
                12742,
                12824
            ],
            [
                12824,
                12914
            ],
            [
                12914,
                13019
            ],
            [
                13019,
                13120
            ],
            [
                13120,
                13218
            ],
            [
                13218,
                13258
            ],
            [
                13258,
                13291
            ],
            [
                13291,
                13291
            ]
        ]
    }
}