{
    "original": {
        "text": "Alice insisted on being left up in the churchyard, urging that she wanted to \"think about it all,\" but, in truth, fearing that she might not be able to carry herself well, if she were to walk down with her lover to the hotel. To this he made no objection, and, on reaching the inn, met Mr. Palliser in the hall. Mr. Palliser was already inspecting the arrangement of certain large trunks which had been brought down-stairs, and was preparing for their departure. He was going about the house, with a nervous solicitude to do something, and was flattering himself that he was of use. As he could not be Chancellor of the Exchequer, and as, by the nature of his disposition, some employment was necessary to him, he was looking to the cording of the boxes. \"Good morning! good morning!\" he said to Grey, hardly looking at him, as though time were too precious with him to allow of his turning his eyes upon his friend. \"I am going up to the station to see after a carriage for to-morrow. Perhaps you'll come with me.\" To this proposition Mr. Grey assented. \"Sometimes, you know,\" continued Mr. Palliser, \"the springs of the carriages are so very rough.\" Then, in a very few words, Mr. Grey told him what had been his own morning's work. He hated secrets and secrecy, and as the Pallisers knew well what had brought him upon their track, it was, he thought, well that they should know that he had been successful. Mr. Palliser congratulated him very cordially, and then, running up-stairs for his gloves or his stick, or, more probably, that he might give his wife one other caution as to her care of herself, he told her also that Alice had yielded at last. \"Of course she has,\" said Lady Glencora.\n\"I really didn't think she would,\" said he.\n\"That's because you don't understand things of that sort,\" said his wife. Then the caution was repeated, the mother of the future duke was kissed, and Mr. Palliser went off on his mission about the carriage, its cushions, and its springs. In the course of their walk Mr. Palliser suggested that, as things were settled so pleasantly, Mr. Grey might as well return with them to England, and to this suggestion Mr. Grey assented.\nAlice remained alone for nearly an hour, looking out upon the rough sides and gloomy top of Mount Pilate. No one disturbed her in the churchyard,--no steps were heard along the tombstones,--no voice sounded through the cloisters. She was left in perfect solitude to think of the past, and form her plans of the future. Was she happy, now that the manner of her life to come was thus settled for her; that all further question as to the disposal of herself was taken out of her hands, and that her marriage with a man she loved was so firmly arranged that no further folly of her own could disarrange it? She was happy, though she was slow to confess her happiness to herself. She was happy, and she was resolute in this,--that she would now do all she could to make him happy also. And there must now, she acknowledged, be an end to her pride,--to that pride which had hitherto taught her to think that she could more wisely follow her own guidance than that of any other who might claim to guide her. She knew now that she must follow his guidance. She had found her master, as we sometimes say, and laughed to herself with a little inward laughter as she confessed that it was so. She was from henceforth altogether in his hands. If he chose to tell her that they were to be married at Michaelmas, or at Christmas, or on Lady Day, they would, of course, be married accordingly. She had taken her fling at having her own will, and she and all her friends had seen what had come of it. She had assumed the command of the ship, and had thrown it upon the rocks, and she felt that she never ought to take the captain's place again. It was well for her that he who was to be captain was one whom she respected as thoroughly as she loved him.\nShe would write to her father at once,--to her father and Lady Macleod,--and would confess everything. She felt that she owed it to them that they should be told by herself that they had been right and that she had been wrong. Hitherto she had not mentioned to either of them the fact that Mr. Grey was with them in Switzerland. And, then, what must she do as to Lady Midlothian? As to Lady Midlothian, she would do nothing. Lady Midlothian, of course, would triumph;--would jump upon her, as Lady Glencora had once expressed it, with very triumphant heels,--would try to patronize her, or, which would be almost worse, would make a parade of her forgiveness. But she would have nothing to do with Lady Midlothian, unless, indeed, Mr. Grey should order it. Then she laughed at herself again with that inward laughter, and, rising from her seat, proceeded to walk down the hill to the hotel.\n\"Vanquished at last!\" said Lady Glencora, as Alice entered the room.\n\"Yes, vanquished; if you like to call it so,\" said Alice.\n\"It is not what I call it, but what you feel it,\" said the other. \"Do you think that I don't know you well enough to be sure that you regard yourself now as an unfortunate prisoner,--as a captive taken in war, to be led away in triumph, without any hope of a ransom? I know that it is quite a misery to you that you should be made a happy woman of at last. I understand it all, my dear, and my heart bleeds for you.\"\n\"Of course; I knew that was the way you would treat me.\"\n\"In what way would you have me treat you? If I were to hug you with joy, and tell you how good he is, and how fortunate you are,--if I were to praise him, and bid you triumph in your success, as might be expected on such an occasion,--you would put on a long face at once, and tell me that though the thing is to be, it would be much better that the thing shouldn't be. Don't I know you, Alice?\"\n\"I shouldn't have said that;--not now.\"\n\"I believe in my heart you would;--that, or something like it. But I do wish you joy all the same, and you may say what you please. He has got you in his power now, and I don't think even you can go back.\"\n\"No; I shall not go back again.\"\n\"I would join with Lady Midlothian in putting you into a madhouse, if you did. But I am so glad; I am, indeed. I was afraid to the last,--terribly afraid; you are so hard and so proud. I don't mean hard to me, dear. You have never been half hard enough to me. But you are hard to yourself, and, upon my word, you have been hard to him. What a deal you will have to make up to him!\"\n\"I feel that I ought to stand before him always as a penitent,--in a white sheet.\"\n\"He will like it better, I dare say, if you will sit upon his knee. Some penitents do, you know. And how happy you will be! He'll never explain the sugar-duties to you, and there'll be no Mr. Bott at Nethercoats.\" They sat together the whole morning,--while Mr. Palliser was seeing to the springs and cushions,--and by degrees Alice began to enjoy her happiness. As she did so her friend enjoyed it with her, and at last they had something of the comfort and excitement which such an occasion should give. \"I'll tell you what, Alice; you shall come and be married at Matching, in August, or perhaps September. That's the only way in which I can be present; and if we can bespeak some sun, we'll have the breakfast out in the ruins.\"\nOn the following morning they all started together, a first-class compartment having been taken for the Palliser family, and a second-class compartment close to them for the Palliser servants. Mr. Palliser, as he slowly handed his wife in, was a triumphant man; as was also Mr. Grey, as he handed in his lady-love, though, in a manner, much less manifest. We may say that both the gentlemen had been very fortunate while at Lucerne. Mr. Palliser had come abroad with a feeling that all the world had been cut from under his feet. A great change was needed for his wife, and he had acknowledged at once that everything must be made to yield to that necessity. He certainly had his reward,--now in his triumphant return. Terrible troubles had afflicted him as he went, which seemed now to have dissipated themselves altogether. When he thought of Burgo Fitzgerald he remembered him only as a poor, unfortunate fellow, for whom he should be glad to do something, if the doing of anything were only in his power; and he had in his pocket a letter which he had that morning received from the Duke of St. Bungay, marked private and confidential, which was in its nature very private and confidential, and in which he was told that Lord Brock and Mr. Finespun were totally at variance about French wines. Mr. Finespun wanted to do something, now in the recess,--to send some political agent over to France,--to which Lord Brock would not agree; and no one knew what would be the consequence of this disagreement. Here might be another chance,--if only Mr. Palliser could give up his winter in Italy! Mr. Palliser, as he took his place opposite his wife, was very triumphant.\nAnd Mr. Grey was triumphant, as he placed himself gently in his seat opposite to Alice. He seemed to assume no right, as he took that position apparently because it was the one which came naturally to his lot. No one would have been made aware that Alice was his own simply by seeing his arrangements for her comfort. He made no loud assertion as to his property and his rights, as some men do. He was quiet and subdued in his joy, but not the less was he triumphant. From the day on which Alice had accepted his first offer,--nay, from an earlier day than that; from the day on which he had first resolved to make it, down to the present hour, he had never been stirred from his purpose. By every word that he had said, and by every act that he had done, he had shown himself to be unmoved by that episode in their joint lives, which Alice's other friends had regarded as so fatal. When she first rejected him, he would not take his rejection. When she told him that she intended to marry her cousin, he silently declined to believe that such marriage would ever take place. He had never given her up for a day, and now the event proved that he had been right. Alice was happy, very happy; but she was still disposed to regard her lover as Fate, and her happiness as an enforced necessity.\nThey stopped a night at Basle, and again she stood upon the balcony. He was close to her as she stood there,--so close that, putting out her hand for his, she was able to take it and press it closely. \"You are thinking of something, Alice,\" he said. \"What is it?\"\n\"It was here,\" she said--\"here, on this very balcony, that I first rebelled against you, and now you have brought me here that I should confess and submit on the same spot. I do confess. How am I to thank you for forgiving me?\"\n[Illustration: \"How am I to thank you for forgiving me?\"]\nOn the following morning they went on to Baden-Baden, and there they stopped for a couple of days. Lady Glencora had positively refused to stop a day at Basle, making so many objections to the place that her husband had at last yielded. \"I could go from Vienna to London without feeling it,\" she said, with indignation; \"and to tell me that I can't do two easy days' journey running!\" Mr. Palliser had been afraid to be imperious, and therefore, immediately on his arrival at one of the stations in Basle, he had posted across the town, in the heat and the dust, to look after the cushions and the springs at the other.\n\"I've a particular favour to ask of you,\" Lady Glencora said to her husband, as soon as they were alone together in their rooms at Baden. Mr. Palliser declared that he would grant her any particular favour,--only premising that he was not to be supposed to have thereby committed himself to any engagement under which his wife should have authority to take any exertion upon herself. \"I wish I were a milkmaid,\" said Lady Glencora.\n\"But you are not a milkmaid, my dear. You haven't been brought up like a milkmaid.\"\nBut what was the favour? If she would only ask for jewels,--though they were the Grand Duchess's diamond eardrops, he would endeavour to get them for her. If she would have quaffed molten pearls, like Cleopatra, he would have procured the beverage,--having first fortified himself with a medical opinion as to the fitness of the drink for a lady in her condition. There was no expenditure that he would not willingly incur for her, nothing costly that he would grudge. But when she asked for a favour, he was always afraid of an imprudence. Very possibly she might want to drink beer in an open garden.\nAnd her request was, at last, of this nature: \"I want you to take me up to the gambling-rooms!\" said she.\n\"The gambling-rooms!\" said Mr. Palliser in dismay.\n\"Yes, Plantagenet; the gambling-rooms. If you had been with me before, I should not have made a fool of myself by putting my piece of money on the table. I want to see the place; but then I saw nothing, because I was so frightened when I found that I was winning.\"\nMr. Palliser was aware that all the world of Baden,--or rather the world of the strangers at Baden,--assembles itself in those salons. It may be also that he himself was curious to see how men looked when they lost their own money, or won that of others. He knew how a Minister looked when he lost or gained a tax. He was familiar with millions and tens of millions in a committee of the whole House. He knew the excitement of a near division upon the estimates. But he had never yet seen a poor man stake his last napoleon, and rake back from off the table a small hatful of gold. A little exercise after an early dinner was, he had been told, good for his wife; and he agreed therefore that, on their second evening at Baden, they would all walk up and see the play.\n\"Perhaps I shall get back my napoleon,\" said Glencora to Alice.\n\"And perhaps I shall be forgiven when somebody sees how difficult it is to manage you,\" said Alice, looking at Mr. Palliser.\n\"She isn't in earnest,\" said Mr. Palliser, almost fearing the result of the experiment.\n\"I don't know that,\" said Lady Glencora.\nThey started together, Mr. Palliser with his wife, and Mr. Grey with Alice on his arm, and found all the tables at work. They at first walked through the different rooms, whispering to each other their comments on the people that they saw, and listening to the quick, low, monotonous words of the croupiers as they arranged and presided over the games. Each table was closely surrounded by its own crowd, made up of players, embryo players, and simple lookers-on, so that they could not see much as they walked. But this was not enough for Lady Glencora. She was anxious to know what these men and women were doing,--to see whether the croupiers wore horns on their heads and were devils indeed,--to behold the faces of those who were wretched and of those who were triumphant,--to know how the thing was done, and to learn something of that lesson in life. \"Let us stand here a moment,\" she said to her husband, arresting him at one corner of the table which had the greatest crowd. \"We shall be able to see in a few minutes.\" So he stood with her there, giving way to Alice, who went in front with his wife; and in a minute or two an aperture was made, so that they could all see the marked cloth, and the money lying about, and the rakes on the table, and the croupier skilfully dealing his cards, and,--more interesting than all the rest, the faces of those who were playing. Grey looked on, over Alice's shoulder, very attentively,--as did Palliser also,--but both of them kept their eyes upon the ministers of the work. Alice and Glencora did the same at first, but as they gained courage they glanced round upon the gamblers.\nIt was a long table, having, of course, four corners, and at the corner appropriated by them they were partly opposite to the man who dealt the cards. The corner answering to theirs at the other end was the part of the table most removed from their sight, and that on which their eyes fell last. As Lady Glencora stood she could hardly see,--indeed, at first she could not see,--one or two who were congregated at this spot. Mr. Palliser, who was behind her, could not see them at all. But to Alice,--and to Mr. Grey, had he cared about it,--every face at the table was visible except the faces of those who were immediately close to them. Before long Alice's attention was riveted on the action and countenance of one young man who sat at that other corner. He was leaning, at first listlessly, over the table, dressed in a velveteen jacket, and with his round-topped hat brought far over his eyes, so that she could not fully see his face. But she had hardly begun to observe him before he threw back his hat, and taking some pieces of gold from under his left hand, which lay upon the table, pushed three or four of them on to one of the divisions marked on the cloth. He seemed to show no care, as others did, as to the special spot which they should occupy. Many were very particular in this respect, placing their ventures on the lines, so as to share the fortunes of two compartments, or sometimes of four; or they divided their coins, taking three or four numbers, selecting the numbers with almost grotesque attention to some imagined rule of their own. But this man let his gold go all together, and left it where his half-stretched rake deposited it by chance. Alice could not but look at his face. His eyes she could see were bloodshot, and his hair, when he pushed back his hat, was rough and dishevelled; but still there was that in his face which no woman could see and not regard. It was a face which at once prepossessed her in his favour,--as it had always prepossessed all others. On this occasion he had won his money, and Alice saw him drag it in as lazily as he had pushed it out.\n\"Do you see that little Frenchman?\" said Lady Glencora. \"He has just made half a napoleon, and has walked off with it. Isn't it interesting? I could stay here all the night.\" Then she turned round to whisper something to her husband, and Alice's eyes again fell on the face of the man at the other end of the table. After he had won his money, he had allowed the game to go on for a turn without any action on his part. The gold again went under his hand, and he lounged forward with his hat over his eyes. One of the croupiers had said a word, as though calling his attention to the game, but he had merely shaken his head. But when the fate of the next turn had been decided, he again roused himself, and on this occasion, as far as Alice could see, pushed his whole stock forward with the rake. There was a little mass of gold, and, from his manner of placing it, all might see that he left its position to chance. One piece had got beyond its boundary, and the croupier pushed it back with some half-expressed inquiry as to his correctness. \"All right,\" said a voice in English. Then Lady Glencora started and clutched Alice's arm with her hand. Mr. Palliser was explaining to Mr. Grey, behind them, something about German finance as connected with gambling-tables, and did not hear the voice, or see his wife's motion. I need hardly tell the reader that the gambler was Burgo Fitzgerald.\nBut Lady Glencora said not a word,--not as yet. She looked forward very gently, but still with eager eyes, till she could just see the face she knew so well. His hat was now pushed back, and his countenance had lost its listlessness. He watched narrowly the face of the man as he told out the amount of the cards as they were dealt. He did not try to hide his anxiety, and when, after the telling of some six or seven cards, he heard a certain number named, and a certain colour called, he made some exclamation which even Glencora could not hear. And then another croupier put down, close to Burgo's money, certain rolls of gold done up in paper, and also certain loose napoleons.\n\"Why doesn't he take it?\" said Lady Glencora.\n\"He is taking it,\" said Alice, not at all knowing the cause of her cousin's anxiety.\nBurgo had paused a moment, and then prepared to rake the money to him; but as he did so, he changed his mind, and pushed it all back again,--now, on this occasion, being very careful to place it on its former spot. Both Alice and Glencora could see that a man at his elbow was dissuading him,--had even attempted to stop the arm which held the rake. But Burgo shook him off, speaking to him some word roughly, and then again he steadied the rolls upon their appointed place. The croupier who had paused for a moment now went on quickly with his cards, and in two minutes the fate of Burgo's wealth was decided. It was all drawn back by the croupier's unimpassioned rake, and the rolls of gold were restored to the tray from whence they had been taken.\nBurgo looked up and smiled at them all round the table. By this time most of those who stood around were looking at him. He was a man who gathered eyes upon him wherever he might be, or whatever he was doing; and it had been clear that he was very intent upon his fortune, and on the last occasion the amount staked had been considerable. He knew that men and women were looking at him, and therefore he smiled faintly as he turned his eyes round the table. Then he got up, and, putting his hands in his trousers pockets, whistled as he walked away. His companion followed him, and laid a hand upon his shoulder; but Burgo shook him off, and would not turn round. He shook him off, and walked on whistling, the length of the whole salon.\n\"Alice,\" said Lady Glencora, \"it is Burgo Fitzgerald.\" Mr. Palliser had gone so deep into that question of German finance that he had not at all noticed the gambler. \"Alice, what can we do for him? It is Burgo,\" said Lady Glencora.\nMany eyes were now watching him. Used as he was to the world and to misfortune, he was not successful in his attempt to bear his loss with a show of indifference. The motion of his head, the position of his hands, the tone of his whistling, all told the tale. Even the unimpassioned croupiers furtively cast an eye after him, and a very big Guard, in a cocked hat, and uniform, and sword, who hitherto had hardly been awake, seemed evidently to be interested by his movements. If there is to be a tragedy at these places,--and tragedies will sometimes occur,--it is always as well that the tragic scene should be as far removed as possible from the salons, in order that the public eye should not suffer.\nLady Glencora and Alice had left their places, and had shrunk back, almost behind a pillar. \"Is it he, in truth?\" Alice asked.\n\"In very truth,\" said Glencora. \"What can I do? Can I do anything? Look at him, Alice. If he were to destroy himself, what should I do then?\"\nBurgo, conscious that he was the regarded of all eyes, turned round upon his heel and again walked the length of the salon. He knew well that he had not a franc left in his possession, but still he laughed and still he whistled. His companion, whoever he might be, had slunk away from him, not caring to share the notoriety which now attended him.\n\"What shall I do, Alice?\" said Lady Glencora, with her eyes still fixed on him who had been her lover.\n\"Tell Mr. Palliser,\" whispered Alice.\nLady Glencora immediately ran up to her husband, and took him away from Mr. Grey. Rapidly she told her story,--with such rapidity that Mr. Palliser could hardly get in a word. \"Do something for him;--do, do. Unless I know that something is done, I shall die. You needn't be afraid.\"\n\"I'm not afraid,\" said Mr. Palliser.\nLady Glencora, as she went on quickly, got hold of her husband's hand, and caressed it. \"You are so good,\" said she. \"Don't let him out of your sight. There; he is going. I will go home with Mr. Grey. I will be ever so good; I will, indeed. You know what he'll want, and for my sake you'll let him have it. But don't let him gamble. If you could only get him home to England, and then do something. You owe him something, Plantagenet; do you not?\"\n\"If money can do anything, he shall have it.\"\n\"God bless you, dearest! I shall never see him again; but if you could save him! There;--he is going now. Go;--go.\" She pushed him forward, and then retreating, put her arm within Mr. Grey's, still keeping her eye upon her husband.\nBurgo, when he first got to the door leading out of the salon, had paused a moment, and, turning round, had encountered the big gendarme close to him. \"Well, old Buffer, what do you want?\" said he, accosting the man in English. The big gendarme simply walked on through the door, and said nothing. Then Burgo also passed out, and Mr. Palliser quickly went after him. They were now in the large front salon, from whence the chief door of the building opened out upon the steps. Through this door Burgo went without pausing, and Mr. Palliser went after him. They both walked to the end of the row of buildings, and then Burgo, leaving the broad way, turned into a little path which led up through the trees to the hills. That hillside among the trees is a popular resort at Baden, during the day; but now, at nine in the evening, it was deserted. Palliser did not press on the other man, but followed him, and did not accost Burgo till he had thrown himself on the grass beneath a tree.\n\"You are in trouble, I fear, Mr. Fitzgerald,\" said Mr. Palliser, as soon as he was close at Burgo's feet.\n\"We will go home. Mr. Palliser has something to do,\" said Lady Glencora to Mr. Grey, as soon as the two men had disappeared from her sight.\n\"Is that a friend of Mr. Palliser?\" said Mr. Grey.\n\"Yes;--that is, he knows him, and is interested about him. Alice, shall we go home? Oh! Mr. Grey, you must not ask any questions. He,--Mr. Palliser, will tell you everything when he sees you,--that is, if there is anything to be told.\" Then they all went home, and soon separated for the night. \"Of course I shall sit up for him,\" said Lady Glencora to Alice, \"but I will do it in my own room. You can tell Mr. Grey, if you like.\" But Alice told nothing to Mr. Grey, nor did Mr. Grey ask any questions.",
        "paragraph_chars": [
            [
                0,
                1697
            ],
            [
                1697,
                1741
            ],
            [
                1741,
                2169
            ],
            [
                2169,
                3908
            ],
            [
                3908,
                4799
            ],
            [
                4799,
                4868
            ],
            [
                4868,
                4926
            ],
            [
                4926,
                5343
            ],
            [
                5343,
                5400
            ],
            [
                5400,
                5796
            ],
            [
                5796,
                5836
            ],
            [
                5836,
                6042
            ],
            [
                6042,
                6075
            ],
            [
                6075,
                6457
            ],
            [
                6457,
                6540
            ],
            [
                6540,
                7273
            ],
            [
                7273,
                8941
            ],
            [
                8941,
                10232
            ],
            [
                10232,
                10496
            ],
            [
                10496,
                10724
            ],
            [
                10724,
                10782
            ],
            [
                10782,
                11402
            ],
            [
                11402,
                11834
            ],
            [
                11834,
                11918
            ],
            [
                11918,
                12521
            ],
            [
                12521,
                12627
            ],
            [
                12627,
                12678
            ],
            [
                12678,
                12943
            ],
            [
                12943,
                13712
            ],
            [
                13712,
                13776
            ],
            [
                13776,
                13901
            ],
            [
                13901,
                13989
            ],
            [
                13989,
                14030
            ],
            [
                14030,
                15663
            ],
            [
                15663,
                17766
            ],
            [
                17766,
                19159
            ],
            [
                19159,
                19841
            ],
            [
                19841,
                19887
            ],
            [
                19887,
                19972
            ],
            [
                19972,
                20724
            ],
            [
                20724,
                21462
            ],
            [
                21462,
                21694
            ],
            [
                21694,
                22399
            ],
            [
                22399,
                22526
            ],
            [
                22526,
                22668
            ],
            [
                22668,
                23016
            ],
            [
                23016,
                23119
            ],
            [
                23119,
                23157
            ],
            [
                23157,
                23440
            ],
            [
                23440,
                23477
            ],
            [
                23477,
                23925
            ],
            [
                23925,
                23971
            ],
            [
                23971,
                24203
            ],
            [
                24203,
                25188
            ],
            [
                25188,
                25294
            ],
            [
                25294,
                25434
            ],
            [
                25434,
                25485
            ],
            [
                25485,
                25987
            ]
        ],
        "segment_chars": [
            [
                0,
                226
            ],
            [
                226,
                312
            ],
            [
                312,
                463
            ],
            [
                463,
                583
            ],
            [
                583,
                755
            ],
            [
                755,
                770
            ],
            [
                770,
                785
            ],
            [
                785,
                917
            ],
            [
                917,
                986
            ],
            [
                986,
                1016
            ],
            [
                1016,
                1055
            ],
            [
                1055,
                1152
            ],
            [
                1152,
                1235
            ],
            [
                1235,
                1411
            ],
            [
                1411,
                1656
            ],
            [
                1656,
                1697
            ],
            [
                1697,
                1741
            ],
            [
                1741,
                1815
            ],
            [
                1815,
                1980
            ],
            [
                1980,
                2169
            ],
            [
                2169,
                2275
            ],
            [
                2275,
                2399
            ],
            [
                2399,
                2488
            ],
            [
                2488,
                2773
            ],
            [
                2773,
                2845
            ],
            [
                2845,
                2951
            ],
            [
                2951,
                3171
            ],
            [
                3171,
                3219
            ],
            [
                3219,
                3352
            ],
            [
                3352,
                3401
            ],
            [
                3401,
                3549
            ],
            [
                3549,
                3655
            ],
            [
                3655,
                3799
            ],
            [
                3799,
                3908
            ],
            [
                3908,
                4011
            ],
            [
                4011,
                4135
            ],
            [
                4135,
                4237
            ],
            [
                4237,
                4288
            ],
            [
                4288,
                4333
            ],
            [
                4333,
                4568
            ],
            [
                4568,
                4665
            ],
            [
                4665,
                4799
            ],
            [
                4799,
                4821
            ],
            [
                4821,
                4868
            ],
            [
                4868,
                4926
            ],
            [
                4926,
                4992
            ],
            [
                4992,
                5193
            ],
            [
                5193,
                5283
            ],
            [
                5283,
                5343
            ],
            [
                5343,
                5400
            ],
            [
                5400,
                5442
            ],
            [
                5442,
                5770
            ],
            [
                5770,
                5796
            ],
            [
                5796,
                5836
            ],
            [
                5836,
                5899
            ],
            [
                5899,
                5968
            ],
            [
                5968,
                6042
            ],
            [
                6042,
                6075
            ],
            [
                6075,
                6154
            ],
            [
                6154,
                6186
            ],
            [
                6186,
                6260
            ],
            [
                6260,
                6291
            ],
            [
                6291,
                6335
            ],
            [
                6335,
                6411
            ],
            [
                6411,
                6457
            ],
            [
                6457,
                6540
            ],
            [
                6540,
                6608
            ],
            [
                6608,
                6637
            ],
            [
                6637,
                6664
            ],
            [
                6664,
                6754
            ],
            [
                6754,
                6903
            ],
            [
                6903,
                7046
            ],
            [
                7046,
                7150
            ],
            [
                7150,
                7273
            ],
            [
                7273,
                7466
            ],
            [
                7466,
                7629
            ],
            [
                7629,
                7706
            ],
            [
                7706,
                7803
            ],
            [
                7803,
                7932
            ],
            [
                7932,
                7992
            ],
            [
                7992,
                8099
            ],
            [
                8099,
                8571
            ],
            [
                8571,
                8779
            ],
            [
                8779,
                8866
            ],
            [
                8866,
                8941
            ],
            [
                8941,
                9029
            ],
            [
                9029,
                9151
            ],
            [
                9151,
                9259
            ],
            [
                9259,
                9336
            ],
            [
                9336,
                9409
            ],
            [
                9409,
                9630
            ],
            [
                9630,
                9824
            ],
            [
                9824,
                9886
            ],
            [
                9886,
                10017
            ],
            [
                10017,
                10103
            ],
            [
                10103,
                10232
            ],
            [
                10232,
                10301
            ],
            [
                10301,
                10433
            ],
            [
                10433,
                10482
            ],
            [
                10482,
                10496
            ],
            [
                10496,
                10669
            ],
            [
                10669,
                10683
            ],
            [
                10683,
                10724
            ],
            [
                10724,
                10782
            ],
            [
                10782,
                10881
            ],
            [
                10881,
                11019
            ],
            [
                11019,
                11167
            ],
            [
                11167,
                11402
            ],
            [
                11402,
                11540
            ],
            [
                11540,
                11786
            ],
            [
                11786,
                11834
            ],
            [
                11834,
                11872
            ],
            [
                11872,
                11918
            ],
            [
                11918,
                11943
            ],
            [
                11943,
                12073
            ],
            [
                12073,
                12282
            ],
            [
                12282,
                12387
            ],
            [
                12387,
                12459
            ],
            [
                12459,
                12521
            ],
            [
                12521,
                12617
            ],
            [
                12617,
                12627
            ],
            [
                12627,
                12649
            ],
            [
                12649,
                12678
            ],
            [
                12678,
                12717
            ],
            [
                12717,
                12832
            ],
            [
                12832,
                12943
            ],
            [
                12943,
                13078
            ],
            [
                13078,
                13198
            ],
            [
                13198,
                13258
            ],
            [
                13258,
                13344
            ],
            [
                13344,
                13406
            ],
            [
                13406,
                13525
            ],
            [
                13525,
                13712
            ],
            [
                13712,
                13776
            ],
            [
                13776,
                13901
            ],
            [
                13901,
                13989
            ],
            [
                13989,
                14030
            ],
            [
                14030,
                14151
            ],
            [
                14151,
                14383
            ],
            [
                14383,
                14542
            ],
            [
                14542,
                14585
            ],
            [
                14585,
                14888
            ],
            [
                14888,
                15014
            ],
            [
                15014,
                15058
            ],
            [
                15058,
                15410
            ],
            [
                15410,
                15556
            ],
            [
                15556,
                15663
            ],
            [
                15663,
                15814
            ],
            [
                15814,
                15959
            ],
            [
                15959,
                16088
            ],
            [
                16088,
                16149
            ],
            [
                16149,
                16303
            ],
            [
                16303,
                16422
            ],
            [
                16422,
                16605
            ],
            [
                16605,
                16835
            ],
            [
                16835,
                16926
            ],
            [
                16926,
                17226
            ],
            [
                17226,
                17335
            ],
            [
                17335,
                17373
            ],
            [
                17373,
                17560
            ],
            [
                17560,
                17663
            ],
            [
                17663,
                17766
            ],
            [
                17766,
                17802
            ],
            [
                17802,
                17822
            ],
            [
                17822,
                17885
            ],
            [
                17885,
                17907
            ],
            [
                17907,
                17941
            ],
            [
                17941,
                18082
            ],
            [
                18082,
                18186
            ],
            [
                18186,
                18273
            ],
            [
                18273,
                18391
            ],
            [
                18391,
                18564
            ],
            [
                18564,
                18684
            ],
            [
                18684,
                18811
            ],
            [
                18811,
                18849
            ],
            [
                18849,
                18916
            ],
            [
                18916,
                19090
            ],
            [
                19090,
                19159
            ],
            [
                19159,
                19207
            ],
            [
                19207,
                19317
            ],
            [
                19317,
                19393
            ],
            [
                19393,
                19492
            ],
            [
                19492,
                19707
            ],
            [
                19707,
                19841
            ],
            [
                19841,
                19867
            ],
            [
                19867,
                19887
            ],
            [
                19887,
                19972
            ],
            [
                19972,
                20187
            ],
            [
                20187,
                20322
            ],
            [
                20322,
                20447
            ],
            [
                20447,
                20583
            ],
            [
                20583,
                20724
            ],
            [
                20724,
                20780
            ],
            [
                20780,
                20845
            ],
            [
                20845,
                21063
            ],
            [
                21063,
                21182
            ],
            [
                21182,
                21274
            ],
            [
                21274,
                21388
            ],
            [
                21388,
                21462
            ],
            [
                21462,
                21517
            ],
            [
                21517,
                21628
            ],
            [
                21628,
                21660
            ],
            [
                21660,
                21694
            ],
            [
                21694,
                21727
            ],
            [
                21727,
                21857
            ],
            [
                21857,
                21954
            ],
            [
                21954,
                22171
            ],
            [
                22171,
                22399
            ],
            [
                22399,
                22491
            ],
            [
                22491,
                22513
            ],
            [
                22513,
                22526
            ],
            [
                22526,
                22558
            ],
            [
                22558,
                22574
            ],
            [
                22574,
                22593
            ],
            [
                22593,
                22613
            ],
            [
                22613,
                22668
            ],
            [
                22668,
                22792
            ],
            [
                22792,
                22897
            ],
            [
                22897,
                23016
            ],
            [
                23016,
                23042
            ],
            [
                23042,
                23119
            ],
            [
                23119,
                23157
            ],
            [
                23157,
                23239
            ],
            [
                23239,
                23333
            ],
            [
                23333,
                23365
            ],
            [
                23365,
                23416
            ],
            [
                23416,
                23440
            ],
            [
                23440,
                23477
            ],
            [
                23477,
                23565
            ],
            [
                23565,
                23594
            ],
            [
                23594,
                23628
            ],
            [
                23628,
                23648
            ],
            [
                23648,
                23678
            ],
            [
                23678,
                23718
            ],
            [
                23718,
                23784
            ],
            [
                23784,
                23810
            ],
            [
                23810,
                23876
            ],
            [
                23876,
                23925
            ],
            [
                23925,
                23971
            ],
            [
                23971,
                23996
            ],
            [
                23996,
                24052
            ],
            [
                24052,
                24077
            ],
            [
                24077,
                24087
            ],
            [
                24087,
                24203
            ],
            [
                24203,
                24354
            ],
            [
                24354,
                24392
            ],
            [
                24392,
                24431
            ],
            [
                24431,
                24501
            ],
            [
                24501,
                24570
            ],
            [
                24570,
                24680
            ],
            [
                24680,
                24759
            ],
            [
                24759,
                24922
            ],
            [
                24922,
                25048
            ],
            [
                25048,
                25188
            ],
            [
                25188,
                25294
            ],
            [
                25294,
                25312
            ],
            [
                25312,
                25434
            ],
            [
                25434,
                25470
            ],
            [
                25470,
                25485
            ],
            [
                25485,
                25544
            ],
            [
                25544,
                25569
            ],
            [
                25569,
                25573
            ],
            [
                25573,
                25615
            ],
            [
                25615,
                25721
            ],
            [
                25721,
                25780
            ],
            [
                25780,
                25879
            ],
            [
                25879,
                25916
            ],
            [
                25916,
                25987
            ]
        ],
        "overlap_chars": [
            [
                0,
                191
            ],
            [
                197,
                225
            ],
            [
                226,
                254
            ],
            [
                310,
                311
            ],
            [
                261,
                281
            ],
            [
                282,
                310
            ],
            [
                254,
                255
            ],
            [
                337,
                347
            ],
            [
                375,
                410
            ],
            [
                461,
                463
            ],
            [
                581,
                582
            ],
            [
                498,
                507
            ],
            [
                519,
                521
            ],
            [
                599,
                601
            ],
            [
                491,
                492
            ],
            [
                463,
                469
            ],
            [
                729,
                747
            ],
            [
                753,
                754
            ],
            [
                755,
                770
            ],
            [
                770,
                785
            ],
            [
                785,
                800
            ],
            [
                915,
                917
            ],
            [
                917,
                953
            ],
            [
                960,
                974
            ],
            [
                984,
                986
            ],
            [
                986,
                1015
            ],
            [
                1038,
                1044
            ],
            [
                1016,
                1023
            ],
            [
                1053,
                1055
            ],
            [
                1152,
                1162
            ],
            [
                1168,
                1178
            ],
            [
                1188,
                1196
            ],
            [
                1211,
                1235
            ],
            [
                1235,
                1251
            ],
            [
                1263,
                1316
            ],
            [
                1341,
                1353
            ],
            [
                1365,
                1411
            ],
            [
                1411,
                1475
            ],
            [
                1486,
                1500
            ],
            [
                1605,
                1614
            ],
            [
                1553,
                1561
            ],
            [
                1624,
                1655
            ],
            [
                1656,
                1697
            ],
            [
                1697,
                1741
            ],
            [
                1741,
                1815
            ],
            [
                1815,
                1819
            ],
            [
                1892,
                1904
            ],
            [
                1844,
                1845
            ],
            [
                1880,
                1886
            ],
            [
                1886,
                1891
            ],
            [
                1905,
                1947
            ],
            [
                1978,
                1980
            ],
            [
                1980,
                2130
            ],
            [
                2150,
                2158
            ],
            [
                2167,
                2169
            ],
            [
                2169,
                2226
            ],
            [
                2261,
                2275
            ],
            [
                2275,
                2313
            ],
            [
                2397,
                2399
            ],
            [
                2399,
                2488
            ],
            [
                2773,
                2845
            ],
            [
                2864,
                2880
            ],
            [
                2891,
                2950
            ],
            [
                2951,
                3011
            ],
            [
                3014,
                3037
            ],
            [
                3054,
                3057
            ],
            [
                3061,
                3134
            ],
            [
                3169,
                3171
            ],
            [
                3180,
                3183
            ],
            [
                3189,
                3219
            ],
            [
                3219,
                3244
            ],
            [
                3266,
                3269
            ],
            [
                3270,
                3288
            ],
            [
                3294,
                3302
            ],
            [
                3319,
                3352
            ],
            [
                3549,
                3600
            ],
            [
                3634,
                3653
            ],
            [
                3655,
                3799
            ],
            [
                3799,
                3823
            ],
            [
                3841,
                3908
            ],
            [
                3908,
                3946
            ],
            [
                3962,
                3965
            ],
            [
                3948,
                3950
            ],
            [
                3966,
                3979
            ],
            [
                3981,
                4011
            ],
            [
                4595,
                4597
            ],
            [
                4606,
                4622
            ],
            [
                4572,
                4581
            ],
            [
                4598,
                4600
            ],
            [
                4587,
                4594
            ],
            [
                4623,
                4665
            ],
            [
                4665,
                4673
            ],
            [
                4693,
                4698
            ],
            [
                4674,
                4692
            ],
            [
                4709,
                4715
            ],
            [
                4724,
                4729
            ],
            [
                4731,
                4752
            ],
            [
                4771,
                4799
            ],
            [
                4799,
                4821
            ],
            [
                4821,
                4868
            ],
            [
                4868,
                4926
            ],
            [
                4926,
                4992
            ],
            [
                4992,
                4993
            ],
            [
                5011,
                5012
            ],
            [
                5019,
                5106
            ],
            [
                5112,
                5134
            ],
            [
                5193,
                5283
            ],
            [
                5283,
                5343
            ],
            [
                5343,
                5400
            ],
            [
                5400,
                5442
            ],
            [
                5442,
                5528
            ],
            [
                5635,
                5663
            ],
            [
                5671,
                5689
            ],
            [
                5717,
                5770
            ],
            [
                5899,
                5968
            ],
            [
                5968,
                6042
            ],
            [
                6042,
                6075
            ],
            [
                6158,
                6170
            ],
            [
                6184,
                6186
            ],
            [
                6186,
                6210
            ],
            [
                6230,
                6260
            ],
            [
                6260,
                6291
            ],
            [
                6335,
                6411
            ],
            [
                6411,
                6457
            ],
            [
                6457,
                6497
            ],
            [
                6505,
                6519
            ],
            [
                6521,
                6540
            ],
            [
                6540,
                6583
            ],
            [
                6589,
                6608
            ],
            [
                6637,
                6662
            ],
            [
                6754,
                6790
            ],
            [
                6852,
                6902
            ],
            [
                7046,
                7072
            ],
            [
                7072,
                7073
            ],
            [
                7074,
                7150
            ],
            [
                7150,
                7210
            ],
            [
                7219,
                7243
            ],
            [
                7244,
                7273
            ],
            [
                7273,
                7424
            ],
            [
                7439,
                7446
            ],
            [
                7456,
                7466
            ],
            [
                7466,
                7485
            ],
            [
                7493,
                7586
            ],
            [
                7627,
                7628
            ],
            [
                7629,
                7706
            ],
            [
                7706,
                7734
            ],
            [
                7742,
                7803
            ],
            [
                7803,
                7804
            ],
            [
                7811,
                7853
            ],
            [
                7880,
                7890
            ],
            [
                7913,
                7932
            ],
            [
                7932,
                7959
            ],
            [
                7962,
                7965
            ],
            [
                7990,
                7991
            ],
            [
                8001,
                8009
            ],
            [
                8040,
                8045
            ],
            [
                8010,
                8027
            ],
            [
                8046,
                8052
            ],
            [
                8057,
                8064
            ],
            [
                8097,
                8099
            ],
            [
                8099,
                8187
            ],
            [
                8280,
                8412
            ],
            [
                8472,
                8550
            ],
            [
                8466,
                8471
            ],
            [
                8715,
                8731
            ],
            [
                8741,
                8756
            ],
            [
                8732,
                8740
            ],
            [
                8777,
                8779
            ],
            [
                8779,
                8807
            ],
            [
                8864,
                8866
            ],
            [
                8866,
                8941
            ],
            [
                8941,
                8990
            ],
            [
                9010,
                9018
            ],
            [
                9022,
                9029
            ],
            [
                9336,
                9389
            ],
            [
                9397,
                9409
            ],
            [
                9504,
                9555
            ],
            [
                9450,
                9453
            ],
            [
                9460,
                9465
            ],
            [
                9565,
                9567
            ],
            [
                9431,
                9436
            ],
            [
                9584,
                9630
            ],
            [
                9886,
                9979
            ],
            [
                9985,
                10017
            ],
            [
                10017,
                10057
            ],
            [
                10084,
                10095
            ],
            [
                10072,
                10078
            ],
            [
                10096,
                10102
            ],
            [
                10232,
                10272
            ],
            [
                10277,
                10301
            ],
            [
                10431,
                10432
            ],
            [
                10304,
                10320
            ],
            [
                10342,
                10355
            ],
            [
                10387,
                10407
            ],
            [
                10382,
                10385
            ],
            [
                10373,
                10377
            ],
            [
                10411,
                10423
            ],
            [
                10433,
                10482
            ],
            [
                10482,
                10496
            ],
            [
                10496,
                10519
            ],
            [
                10526,
                10527
            ],
            [
                10521,
                10522
            ],
            [
                10528,
                10592
            ],
            [
                10618,
                10622
            ],
            [
                10593,
                10617
            ],
            [
                10623,
                10624
            ],
            [
                10632,
                10650
            ],
            [
                10667,
                10669
            ],
            [
                10683,
                10724
            ],
            [
                10782,
                10880
            ],
            [
                11402,
                11540
            ],
            [
                11540,
                11589
            ],
            [
                11601,
                11608
            ],
            [
                11625,
                11629
            ],
            [
                11637,
                11640
            ],
            [
                11720,
                11728
            ],
            [
                11763,
                11768
            ],
            [
                11777,
                11785
            ],
            [
                11786,
                11834
            ],
            [
                11834,
                11870
            ],
            [
                11918,
                11943
            ],
            [
                11943,
                11976
            ],
            [
                12033,
                12041
            ],
            [
                12055,
                12073
            ],
            [
                12282,
                12348
            ],
            [
                12385,
                12387
            ],
            [
                12387,
                12459
            ],
            [
                12459,
                12521
            ],
            [
                12521,
                12550
            ],
            [
                12554,
                12558
            ],
            [
                12565,
                12617
            ],
            [
                12617,
                12627
            ],
            [
                12627,
                12649
            ],
            [
                12649,
                12678
            ],
            [
                12678,
                12717
            ],
            [
                12717,
                12802
            ],
            [
                12812,
                12832
            ],
            [
                12832,
                12943
            ],
            [
                12943,
                12993
            ],
            [
                13044,
                13078
            ],
            [
                13098,
                13198
            ],
            [
                13198,
                13258
            ],
            [
                13258,
                13278
            ],
            [
                13292,
                13330
            ],
            [
                13337,
                13344
            ],
            [
                13406,
                13422
            ],
            [
                13427,
                13476
            ],
            [
                13482,
                13525
            ],
            [
                13611,
                13712
            ],
            [
                13712,
                13776
            ],
            [
                13776,
                13874
            ],
            [
                13899,
                13901
            ],
            [
                13901,
                13905
            ],
            [
                13909,
                13911
            ],
            [
                13922,
                13942
            ],
            [
                13987,
                13989
            ],
            [
                13989,
                14030
            ],
            [
                14030,
                14034
            ],
            [
                14043,
                14120
            ],
            [
                14165,
                14301
            ],
            [
                14314,
                14344
            ],
            [
                14358,
                14383
            ],
            [
                14383,
                14433
            ],
            [
                14540,
                14541
            ],
            [
                14888,
                14917
            ],
            [
                14922,
                14926
            ],
            [
                14570,
                14583
            ],
            [
                14927,
                14942
            ],
            [
                14957,
                14959
            ],
            [
                14964,
                15014
            ],
            [
                15014,
                15057
            ],
            [
                15058,
                15060
            ],
            [
                15064,
                15069
            ],
            [
                15079,
                15085
            ],
            [
                15140,
                15165
            ],
            [
                15175,
                15183
            ],
            [
                15116,
                15118
            ],
            [
                15212,
                15215
            ],
            [
                15183,
                15211
            ],
            [
                15238,
                15334
            ],
            [
                15337,
                15371
            ],
            [
                15373,
                15410
            ],
            [
                15410,
                15414
            ],
            [
                15475,
                15483
            ],
            [
                15529,
                15532
            ],
            [
                15491,
                15494
            ],
            [
                15556,
                15574
            ],
            [
                15630,
                15663
            ],
            [
                15663,
                15683
            ],
            [
                15717,
                15727
            ],
            [
                15773,
                15781
            ],
            [
                15919,
                15922
            ],
            [
                15728,
                15734
            ],
            [
                16294,
                16301
            ],
            [
                16396,
                16399
            ],
            [
                16382,
                16395
            ],
            [
                16337,
                16344
            ],
            [
                16315,
                16332
            ],
            [
                16420,
                16422
            ],
            [
                16422,
                16474
            ],
            [
                16510,
                16518
            ],
            [
                16532,
                16535
            ],
            [
                16544,
                16605
            ],
            [
                16605,
                16608
            ],
            [
                16652,
                16705
            ],
            [
                16732,
                16835
            ],
            [
                16835,
                16844
            ],
            [
                16845,
                16847
            ],
            [
                16856,
                16860
            ],
            [
                16900,
                16905
            ],
            [
                16895,
                16899
            ],
            [
                16906,
                16926
            ],
            [
                17335,
                17346
            ],
            [
                17392,
                17395
            ],
            [
                17502,
                17506
            ],
            [
                17373,
                17381
            ],
            [
                17396,
                17424
            ],
            [
                17455,
                17485
            ],
            [
                17363,
                17371
            ],
            [
                17498,
                17501
            ],
            [
                17486,
                17491
            ],
            [
                17519,
                17551
            ],
            [
                17558,
                17560
            ],
            [
                17663,
                17682
            ],
            [
                17687,
                17690
            ],
            [
                17700,
                17724
            ],
            [
                17691,
                17700
            ],
            [
                17728,
                17766
            ],
            [
                17766,
                17802
            ],
            [
                17802,
                17822
            ],
            [
                17822,
                17860
            ],
            [
                17865,
                17885
            ],
            [
                17885,
                17905
            ],
            [
                17941,
                18082
            ],
            [
                18082,
                18161
            ],
            [
                18180,
                18186
            ],
            [
                18391,
                18394
            ],
            [
                18444,
                18446
            ],
            [
                18453,
                18472
            ],
            [
                18491,
                18562
            ],
            [
                18447,
                18452
            ],
            [
                18660,
                18684
            ],
            [
                18684,
                18739
            ],
            [
                18760,
                18764
            ],
            [
                18780,
                18787
            ],
            [
                18747,
                18749
            ],
            [
                18809,
                18810
            ],
            [
                18811,
                18849
            ],
            [
                18849,
                18900
            ],
            [
                18914,
                18916
            ],
            [
                18916,
                18943
            ],
            [
                18970,
                19000
            ],
            [
                18944,
                18968
            ],
            [
                19034,
                19081
            ],
            [
                19088,
                19090
            ],
            [
                19090,
                19159
            ],
            [
                19159,
                19192
            ],
            [
                19205,
                19207
            ],
            [
                19207,
                19242
            ],
            [
                19264,
                19289
            ],
            [
                19294,
                19298
            ],
            [
                19315,
                19317
            ],
            [
                19393,
                19395
            ],
            [
                19413,
                19416
            ],
            [
                19433,
                19438
            ],
            [
                19485,
                19490
            ],
            [
                19462,
                19471
            ],
            [
                19490,
                19492
            ],
            [
                19538,
                19543
            ],
            [
                19593,
                19609
            ],
            [
                19617,
                19637
            ],
            [
                19638,
                19653
            ],
            [
                19659,
                19670
            ],
            [
                19705,
                19707
            ],
            [
                19707,
                19741
            ],
            [
                19775,
                19815
            ],
            [
                19824,
                19841
            ],
            [
                19841,
                19867
            ],
            [
                19867,
                19887
            ],
            [
                19887,
                19921
            ],
            [
                19929,
                19972
            ],
            [
                19972,
                20046
            ],
            [
                20061,
                20111
            ],
            [
                20121,
                20125
            ],
            [
                20136,
                20187
            ],
            [
                20187,
                20248
            ],
            [
                20285,
                20287
            ],
            [
                20249,
                20254
            ],
            [
                20260,
                20263
            ],
            [
                20320,
                20322
            ],
            [
                20322,
                20345
            ],
            [
                20373,
                20380
            ],
            [
                20445,
                20447
            ],
            [
                20447,
                20459
            ],
            [
                20492,
                20583
            ],
            [
                20583,
                20641
            ],
            [
                20722,
                20724
            ],
            [
                20724,
                20750
            ],
            [
                20763,
                20780
            ],
            [
                20780,
                20843
            ],
            [
                20995,
                21000
            ],
            [
                21063,
                21070
            ],
            [
                20937,
                20939
            ],
            [
                21180,
                21182
            ],
            [
                21187,
                21189
            ],
            [
                21194,
                21227
            ],
            [
                21237,
                21274
            ],
            [
                21274,
                21365
            ],
            [
                21410,
                21419
            ],
            [
                21404,
                21405
            ],
            [
                21420,
                21434
            ],
            [
                21449,
                21454
            ],
            [
                21435,
                21448
            ],
            [
                21455,
                21462
            ],
            [
                21462,
                21517
            ],
            [
                21517,
                21533
            ],
            [
                21607,
                21614
            ],
            [
                21626,
                21628
            ],
            [
                21628,
                21660
            ],
            [
                21660,
                21671
            ],
            [
                21694,
                21727
            ],
            [
                21774,
                21813
            ],
            [
                21835,
                21839
            ],
            [
                21843,
                21855
            ],
            [
                21742,
                21744
            ],
            [
                21819,
                21827
            ],
            [
                21855,
                21857
            ],
            [
                21871,
                21874
            ],
            [
                21920,
                21933
            ],
            [
                21939,
                21954
            ],
            [
                21954,
                21962
            ],
            [
                21977,
                22040
            ],
            [
                22119,
                22125
            ],
            [
                22136,
                22171
            ],
            [
                22171,
                22215
            ],
            [
                22254,
                22350
            ],
            [
                22365,
                22379
            ],
            [
                22397,
                22399
            ],
            [
                22399,
                22426
            ],
            [
                22454,
                22465
            ],
            [
                22474,
                22490
            ],
            [
                22558,
                22572
            ],
            [
                22510,
                22512
            ],
            [
                22543,
                22557
            ],
            [
                22593,
                22613
            ],
            [
                22613,
                22668
            ],
            [
                22668,
                22684
            ],
            [
                22710,
                22790
            ],
            [
                22790,
                22792
            ],
            [
                22897,
                22910
            ],
            [
                22933,
                22956
            ],
            [
                23014,
                23016
            ],
            [
                23016,
                23042
            ],
            [
                23042,
                23061
            ],
            [
                23067,
                23094
            ],
            [
                23117,
                23119
            ],
            [
                23119,
                23157
            ],
            [
                23157,
                23170
            ],
            [
                23183,
                23239
            ],
            [
                23247,
                23265
            ],
            [
                23287,
                23333
            ],
            [
                23333,
                23355
            ],
            [
                23357,
                23365
            ],
            [
                23365,
                23416
            ],
            [
                23416,
                23440
            ],
            [
                23440,
                23477
            ],
            [
                23477,
                23490
            ],
            [
                23528,
                23565
            ],
            [
                23565,
                23594
            ],
            [
                23594,
                23628
            ],
            [
                23628,
                23648
            ],
            [
                23648,
                23678
            ],
            [
                23678,
                23718
            ],
            [
                23718,
                23784
            ],
            [
                23784,
                23810
            ],
            [
                23810,
                23851
            ],
            [
                23874,
                23876
            ],
            [
                23876,
                23925
            ],
            [
                23925,
                23971
            ],
            [
                23971,
                23996
            ],
            [
                23996,
                24052
            ],
            [
                24052,
                24057
            ],
            [
                24060,
                24075
            ],
            [
                24087,
                24161
            ],
            [
                24201,
                24203
            ],
            [
                24203,
                24209
            ],
            [
                24231,
                24290
            ],
            [
                24307,
                24330
            ],
            [
                24340,
                24353
            ],
            [
                24354,
                24392
            ],
            [
                24392,
                24399
            ],
            [
                24429,
                24431
            ],
            [
                24431,
                24434
            ],
            [
                24448,
                24501
            ],
            [
                24501,
                24516
            ],
            [
                24524,
                24569
            ],
            [
                24570,
                24614
            ],
            [
                24622,
                24625
            ],
            [
                24632,
                24659
            ],
            [
                24660,
                24680
            ],
            [
                24680,
                24708
            ],
            [
                24724,
                24742
            ],
            [
                24757,
                24759
            ],
            [
                24759,
                24793
            ],
            [
                24810,
                24826
            ],
            [
                24851,
                24922
            ],
            [
                24922,
                24981
            ],
            [
                24998,
                25048
            ],
            [
                25048,
                25056
            ],
            [
                25093,
                25101
            ],
            [
                25126,
                25139
            ],
            [
                25151,
                25188
            ],
            [
                25188,
                25266
            ],
            [
                25271,
                25276
            ],
            [
                25292,
                25294
            ],
            [
                25294,
                25312
            ],
            [
                25312,
                25378
            ],
            [
                25390,
                25434
            ],
            [
                25434,
                25470
            ],
            [
                25470,
                25485
            ],
            [
                25485,
                25490
            ],
            [
                25492,
                25513
            ],
            [
                25542,
                25544
            ],
            [
                25544,
                25569
            ],
            [
                25569,
                25573
            ],
            [
                25573,
                25615
            ],
            [
                25620,
                25632
            ],
            [
                25634,
                25675
            ],
            [
                25687,
                25710
            ],
            [
                25718,
                25720
            ],
            [
                25721,
                25779
            ],
            [
                25780,
                25849
            ],
            [
                25863,
                25879
            ],
            [
                25879,
                25915
            ],
            [
                25916,
                25987
            ]
        ],
        "row_chars": [
            [
                0,
                226
            ],
            [
                226,
                463
            ],
            [
                463,
                755
            ],
            [
                755,
                770
            ],
            [
                770,
                785
            ],
            [
                785,
                917
            ],
            [
                917,
                986
            ],
            [
                986,
                1016
            ],
            [
                1016,
                1055
            ],
            [
                1055,
                1152
            ],
            [
                1152,
                1235
            ],
            [
                1235,
                1411
            ],
            [
                1411,
                1656
            ],
            [
                1656,
                1697
            ],
            [
                1697,
                1741
            ],
            [
                1741,
                1815
            ],
            [
                1815,
                1980
            ],
            [
                1980,
                2169
            ],
            [
                2169,
                2275
            ],
            [
                2275,
                2399
            ],
            [
                2399,
                2488
            ],
            [
                2488,
                2773
            ],
            [
                2773,
                2845
            ],
            [
                2845,
                2951
            ],
            [
                2951,
                3171
            ],
            [
                3171,
                3219
            ],
            [
                3219,
                3352
            ],
            [
                3352,
                3401
            ],
            [
                3401,
                3549
            ],
            [
                3549,
                3655
            ],
            [
                3655,
                3799
            ],
            [
                3799,
                3908
            ],
            [
                3908,
                4011
            ],
            [
                4011,
                4135
            ],
            [
                4135,
                4237
            ],
            [
                4237,
                4288
            ],
            [
                4288,
                4333
            ],
            [
                4333,
                4568
            ],
            [
                4568,
                4665
            ],
            [
                4665,
                4799
            ],
            [
                4799,
                4821
            ],
            [
                4821,
                4868
            ],
            [
                4868,
                4926
            ],
            [
                4926,
                4992
            ],
            [
                4992,
                5193
            ],
            [
                5193,
                5283
            ],
            [
                5283,
                5343
            ],
            [
                5343,
                5400
            ],
            [
                5400,
                5442
            ],
            [
                5442,
                5770
            ],
            [
                5770,
                5796
            ],
            [
                5796,
                5836
            ],
            [
                5836,
                5899
            ],
            [
                5899,
                5968
            ],
            [
                5968,
                6042
            ],
            [
                6042,
                6075
            ],
            [
                6075,
                6154
            ],
            [
                6154,
                6186
            ],
            [
                6186,
                6260
            ],
            [
                6260,
                6291
            ],
            [
                6291,
                6335
            ],
            [
                6335,
                6411
            ],
            [
                6411,
                6457
            ],
            [
                6457,
                6540
            ],
            [
                6540,
                6608
            ],
            [
                6608,
                6637
            ],
            [
                6637,
                6664
            ],
            [
                6664,
                6754
            ],
            [
                6754,
                6903
            ],
            [
                6903,
                7046
            ],
            [
                7046,
                7150
            ],
            [
                7150,
                7273
            ],
            [
                7273,
                7466
            ],
            [
                7466,
                7629
            ],
            [
                7629,
                7706
            ],
            [
                7706,
                7803
            ],
            [
                7803,
                7932
            ],
            [
                7932,
                7992
            ],
            [
                7992,
                8099
            ],
            [
                8099,
                8779
            ],
            [
                8779,
                8866
            ],
            [
                8866,
                8941
            ],
            [
                8941,
                9029
            ],
            [
                9029,
                9151
            ],
            [
                9151,
                9259
            ],
            [
                9259,
                9336
            ],
            [
                9336,
                9409
            ],
            [
                9409,
                9630
            ],
            [
                9630,
                9824
            ],
            [
                9824,
                9886
            ],
            [
                9886,
                10017
            ],
            [
                10017,
                10103
            ],
            [
                10103,
                10232
            ],
            [
                10232,
                10301
            ],
            [
                10301,
                10433
            ],
            [
                10433,
                10482
            ],
            [
                10482,
                10496
            ],
            [
                10496,
                10669
            ],
            [
                10669,
                10683
            ],
            [
                10683,
                10724
            ],
            [
                10724,
                10782
            ],
            [
                10782,
                10881
            ],
            [
                10881,
                11019
            ],
            [
                11019,
                11167
            ],
            [
                11167,
                11402
            ],
            [
                11402,
                11540
            ],
            [
                11540,
                11786
            ],
            [
                11786,
                11834
            ],
            [
                11834,
                11872
            ],
            [
                11872,
                11918
            ],
            [
                11918,
                11943
            ],
            [
                11943,
                12073
            ],
            [
                12073,
                12282
            ],
            [
                12282,
                12387
            ],
            [
                12387,
                12459
            ],
            [
                12459,
                12521
            ],
            [
                12521,
                12617
            ],
            [
                12617,
                12627
            ],
            [
                12627,
                12649
            ],
            [
                12649,
                12678
            ],
            [
                12678,
                12717
            ],
            [
                12717,
                12832
            ],
            [
                12832,
                12943
            ],
            [
                12943,
                13078
            ],
            [
                13078,
                13198
            ],
            [
                13198,
                13258
            ],
            [
                13258,
                13344
            ],
            [
                13344,
                13406
            ],
            [
                13406,
                13525
            ],
            [
                13525,
                13712
            ],
            [
                13712,
                13776
            ],
            [
                13776,
                13901
            ],
            [
                13901,
                13989
            ],
            [
                13989,
                14030
            ],
            [
                14030,
                14383
            ],
            [
                14383,
                14542
            ],
            [
                14542,
                15014
            ],
            [
                15014,
                15058
            ],
            [
                15058,
                15410
            ],
            [
                15410,
                15663
            ],
            [
                15663,
                16422
            ],
            [
                16422,
                16605
            ],
            [
                16605,
                16835
            ],
            [
                16835,
                16926
            ],
            [
                16926,
                17226
            ],
            [
                17226,
                17335
            ],
            [
                17335,
                17560
            ],
            [
                17560,
                17663
            ],
            [
                17663,
                17766
            ],
            [
                17766,
                17802
            ],
            [
                17802,
                17822
            ],
            [
                17822,
                17885
            ],
            [
                17885,
                17907
            ],
            [
                17907,
                17941
            ],
            [
                17941,
                18082
            ],
            [
                18082,
                18186
            ],
            [
                18186,
                18273
            ],
            [
                18273,
                18391
            ],
            [
                18391,
                18684
            ],
            [
                18684,
                18811
            ],
            [
                18811,
                18849
            ],
            [
                18849,
                18916
            ],
            [
                18916,
                19090
            ],
            [
                19090,
                19159
            ],
            [
                19159,
                19207
            ],
            [
                19207,
                19317
            ],
            [
                19317,
                19393
            ],
            [
                19393,
                19492
            ],
            [
                19492,
                19707
            ],
            [
                19707,
                19841
            ],
            [
                19841,
                19867
            ],
            [
                19867,
                19887
            ],
            [
                19887,
                19972
            ],
            [
                19972,
                20187
            ],
            [
                20187,
                20322
            ],
            [
                20322,
                20447
            ],
            [
                20447,
                20583
            ],
            [
                20583,
                20724
            ],
            [
                20724,
                20780
            ],
            [
                20780,
                21182
            ],
            [
                21182,
                21274
            ],
            [
                21274,
                21462
            ],
            [
                21462,
                21517
            ],
            [
                21517,
                21628
            ],
            [
                21628,
                21660
            ],
            [
                21660,
                21694
            ],
            [
                21694,
                21727
            ],
            [
                21727,
                21857
            ],
            [
                21857,
                21954
            ],
            [
                21954,
                22171
            ],
            [
                22171,
                22399
            ],
            [
                22399,
                22491
            ],
            [
                22491,
                22574
            ],
            [
                22574,
                22593
            ],
            [
                22593,
                22613
            ],
            [
                22613,
                22668
            ],
            [
                22668,
                22792
            ],
            [
                22792,
                22897
            ],
            [
                22897,
                23016
            ],
            [
                23016,
                23042
            ],
            [
                23042,
                23119
            ],
            [
                23119,
                23157
            ],
            [
                23157,
                23239
            ],
            [
                23239,
                23333
            ],
            [
                23333,
                23365
            ],
            [
                23365,
                23416
            ],
            [
                23416,
                23440
            ],
            [
                23440,
                23477
            ],
            [
                23477,
                23565
            ],
            [
                23565,
                23594
            ],
            [
                23594,
                23628
            ],
            [
                23628,
                23648
            ],
            [
                23648,
                23678
            ],
            [
                23678,
                23718
            ],
            [
                23718,
                23784
            ],
            [
                23784,
                23810
            ],
            [
                23810,
                23876
            ],
            [
                23876,
                23925
            ],
            [
                23925,
                23971
            ],
            [
                23971,
                23996
            ],
            [
                23996,
                24052
            ],
            [
                24052,
                24077
            ],
            [
                24077,
                24087
            ],
            [
                24087,
                24203
            ],
            [
                24203,
                24354
            ],
            [
                24354,
                24392
            ],
            [
                24392,
                24431
            ],
            [
                24431,
                24501
            ],
            [
                24501,
                24570
            ],
            [
                24570,
                24680
            ],
            [
                24680,
                24759
            ],
            [
                24759,
                24922
            ],
            [
                24922,
                25048
            ],
            [
                25048,
                25188
            ],
            [
                25188,
                25294
            ],
            [
                25294,
                25312
            ],
            [
                25312,
                25434
            ],
            [
                25434,
                25470
            ],
            [
                25470,
                25485
            ],
            [
                25485,
                25544
            ],
            [
                25544,
                25569
            ],
            [
                25569,
                25573
            ],
            [
                25573,
                25615
            ],
            [
                25615,
                25721
            ],
            [
                25721,
                25780
            ],
            [
                25780,
                25879
            ],
            [
                25879,
                25916
            ],
            [
                25916,
                25987
            ]
        ]
    },
    "abridged": {
        "text": "Alice insisted on being left up in the churchyard, urging that she wanted to \"think about it all,\" but, in truth, fearing that she might not be able to carry herself well, if she were to walk with her lover to the hotel.\nTo this he made no objection. On reaching the inn, he met Mr. Palliser in the hall, inspecting some large trunks which had been brought downstairs. Mr. Palliser had a nervous need to be busy, so he was checking the cording of the trunks.\n\"Good morning! good morning!\" he said to Grey. \"I am going up to the station to see about a carriage for tomorrow. Perhaps you'll come with me.\"\nMr. Grey agreed to this. Then, in a few words, he told him about his own morning's work. He hated secrets, and as the Pallisers knew well what had brought him here, he thought they should know that he had been successful. Mr. Palliser congratulated him very cordially, and then, running upstairs for his gloves, he told his wife that Alice had yielded at last.\n\"Of course she has,\" said Lady Glencora.\n\"I really didn't think she would,\" said he.\n\"That's because you don't understand things of that sort,\" said his wife. Then Mr. Palliser cautioned her to be careful, kissed her, and went off on his mission about the carriage. In the course of their walk Mr. Palliser suggested that, as things were settled so pleasantly, Mr. Grey might as well return with them to England, and Mr. Grey agreed.\nAlice remained alone for nearly an hour, looking out upon Mount Pilate. No one disturbed her in the churchyard. She was left in perfect solitude to think of the past, and form her plans of the future. She was happy, though she was slow to confess her happiness to herself. She was resolute that she would now do all she could to make him happy also.\nAnd there must now, she acknowledged, be an end to her pride: to that pride which had made her think that she could more wisely follow her own guidance than that of any others. Now she must follow his guidance. She had found her master, and she laughed to herself a little as she confessed that it was so. She had taken her fling at having her own will, and see what had come of it! She had assumed the command of the ship, and had thrown it upon the rocks, and she felt that she never ought to take the captain's place again. It was well for her that her captain was one whom she respected as thoroughly as she loved him.\nShe would write to her father at once, and to Lady Macleod, and would confess everything. As to Lady Midlothian, she would do nothing - unless, indeed, Mr. Grey should order it. Then she again laughed at herself inwardly, and rising from her seat, walked down the hill to the hotel.\n\"Vanquished at last!\" said Lady Glencora, as Alice entered the room.\n\"Yes, vanquished; if you like to call it so,\" said Alice.\n\"It is not what I call it, but what you feel it,\" said the other. \"I know you well enough to be sure that you regard yourself now as an unfortunate prisoner - a captive taken in war. I know that it is quite a misery to you that you should be made a happy woman of at last. I understand it all, my dear, and my heart bleeds for you.\"\n\"Of course; I knew that was the way you would treat me.\"\n\"In what way would you have me treat you? If I were to hug you with joy, and tell you how good he is, and how fortunate you are, you would put on a long face, and tell me that it would be much better that the thing shouldn't be. But I do wish you joy all the same, and you may say what you please. He has got you in his power now, and I don't think even you can go back.\"\n\"No; I shall not go back again.\"\n\"I am so glad. I was afraid to the last - you are so hard and so proud. I don't mean hard to me, dear. But you are hard to yourself, and, upon my word, you have been hard to him. What a deal you will have to make up to him!\"\n\"I feel that I ought to stand before him as a penitent, in a white sheet.\"\n\"He will like it better, I dare say, if you sit upon his knee. And how happy you will be!\"\nThey sat together the whole morning, and by degrees Alice began to enjoy her happiness.\n\"I'll tell you what, Alice,\" said her friend; \"you shall come and be married at Matching, in August, or perhaps September. That's the only way in which I can be present; and if we can arrange some sun, we'll have the wedding breakfast out in the ruins.\"\nOn the following morning they all started together, a first-class compartment having been taken for the Palliser family, and a second-class compartment for the servants. Mr. Palliser, as he handed his wife in, was a triumphant man; as was also Mr. Grey, as he handed in his lady-love.\nWe may say that both the gentlemen had been very fortunate while at Lucerne. Mr. Palliser had come abroad feeling that all the world had been cut from under his feet. A change was needed for his wife, and he had yielded everything to that necessity. He certainly had his reward now.\nThe terrible troubles which had afflicted him seemed to have disappeared. When he thought of Burgo Fitzgerald he remembered him only as a poor, unfortunate fellow; and he had in his pocket a letter which he had that morning received from the Duke of St. Bungay, marked private and confidential, in which he was told that Lord Brock and Mr. Finespun were totally at variance, and that no one knew what the consequence would be. Here might be another chance! Mr. Palliser, as he took his place opposite his wife, was very triumphant.\nAnd Mr. Grey was triumphant, as he placed himself opposite Alice. He was quiet and subdued in his joy, but not the less triumphant. From the day on which he had first resolved to make his offer to Alice, he had never been stirred from his purpose. When she told him that she intended to marry her cousin, he silently declined to believe that the marriage would ever take place. He had never given her up for a day, and he had been proved right.\nThey stopped a night at Basle, and again Alice stood upon the balcony. Mr. Grey was close to her - so close that she was able to take his hand and press it.\n\"You are thinking of something, Alice,\" he said. \"What is it?\"\n\"It was here,\" she said, \"on this very balcony, that I first rebelled against you, and now that you have brought me here I confess and submit. How am I to thank you for forgiving me?\"\nOn the following morning they went on to Baden-Baden, and there they stopped for a couple of days.\n\"I've a particular favour to ask of you,\" Lady Glencora said to her husband, as soon as they were alone together in their rooms at Baden. Mr. Palliser declared that he would grant her any favour, provided that it did not involve his wife exerting herself.\n\"I wish I were a milkmaid,\" said Lady Glencora.\n\"But you are not a milkmaid, my dear.\"\nBut what was the favour? If she would only ask for jewels, he would get them for her. There was no expenditure that he would not willingly incur for her. But when she asked for a favour, he was always afraid of an imprudence. Very possibly she might want to drink beer in an open garden.\nAnd her request was, at last, this: \"I want you to take me up to the gambling-rooms!\" said she.\n\"The gambling-rooms!\" said Mr. Palliser in dismay.\n\"Yes, Plantagenet; the gambling-rooms. If you had been with me before, I should not have made a fool of myself by putting my money on the table. I want to see the place; but then I saw nothing, because I was so frightened when I found that I was winning.\"\nMr. Palliser was aware that all the world of Baden assembles itself in those salons. Maybe he himself was curious to see how men looked when they lost their own money, or won that of others. He knew how a Minister looked when he lost or gained a tax. He was familiar with tens of millions in a committee of the House. But he had never seen a poor man stake his last napoleon, and rake from off the table a small hatful of gold. He agreed therefore that, on their second evening at Baden, they would all walk up and see the play.\n\"Perhaps I shall get back my napoleon,\" said Glencora to Alice.\n\"And perhaps I shall be forgiven when somebody sees how difficult it is to manage you,\" said Alice.\n\"She doesn't mean it,\" said Mr. Palliser.\n\"I don't know that,\" said Lady Glencora.\nThey went in together, Mr. Palliser with his wife, and Mr. Grey with Alice on his arm, and walked through the different rooms, whispering to each other their comments on the people that they saw, and listening to the quick, low words of the croupiers as they presided over the games. Each table was closely surrounded by its own crowd.\n\"Let us stand here a moment,\" said Lady Glencora to her husband, halting at a corner of the table which had the greatest crowd. \"We shall be able to see in a few minutes.\"\nSo they stood there, and in a minute or two an opening was made in the crowd, so that they could all see money lying about, and the rakes on the table, and the croupier skilfully dealing his cards, and - more interesting than all the rest - the faces of those who were playing. Grey and Palliser watched the croupiers; but Alice and Glencora glanced round upon the gamblers.\nIt was a long table, and at the opposite and furthest corner to them sat a young man who riveted Alice's attention. He was leaning, at first listlessly, over the table, with his hat far over his eyes, so that she could not fully see his face. But then he threw back his hat, and taking some pieces of gold which lay upon the table, pushed three or four of them on to one of the divisions marked on the cloth. He seemed not to care which spot they should occupy. Alice could see that his eyes were bloodshot, and his hair was rough and dishevelled; but his face was still one which no woman could see and not admire. On this occasion he won, and Alice saw him drag his money in as lazily as he had pushed it out.\n\"Do you see that little Frenchman?\" said Lady Glencora. \"He has just made half a napoleon, and walked off with it. Isn't it interesting?\" Then she turned round to whisper something to her husband, and Alice's eyes again fell on the face of the man at the other end of the table. After he had won his money, he had allowed the game to go on for a turn without taking part. But then he roused himself, and as far as Alice could see, pushed his whole stock forward with the rake - again leaving its position to chance. One piece had got beyond its boundary, and the croupier made some inquiry about it.\n\"All right,\" said a voice in English. Then Lady Glencora started and clutched Alice's arm. Mr. Palliser was explaining something about German finance to Mr. Grey, behind them, and did not hear the voice, or see his wife's reaction. I need hardly tell the reader that the gambler was Burgo Fitzgerald.\nBut Lady Glencora said not a word. She looked forward very gently, but eagerly, till she could just see his face. He was watching the croupier anxiously as he dealt the cards. After a certain number and a certain colour was called, he made an exclamation. And then another croupier put down by him rolls of gold done up in paper, and also some loose napoleons.\n\"Why doesn't he take it?\" said Lady Glencora.\n\"He is taking it,\" said Alice, not knowing the cause of her cousin's anxiety.\nBurgo had paused a moment, and then prepared to rake the money to him; but he changed his mind, and pushed it all back again, this time being very careful to place it on its former spot. Both Alice and Glencora could see that a man at his elbow was trying to dissuade him. But Burgo shook him off roughly. The croupier went on quickly with his cards, and in two minutes the fate of Burgo's wealth was decided. It was all drawn back by the croupier's unimpassioned rake.\nBurgo looked up and smiled round the table. By this time most of those who stood around were looking at him, and he knew it. Therefore he smiled faintly before getting up, and, putting his hands in his trouser pockets, whistled as he walked away. His companion followed him, and laid a hand upon his shoulder; but Burgo shook him off, and walked on, whistling, the whole length of the salon.\n\"Alice,\" said Lady Glencora, \"it is Burgo Fitzgerald.\" Mr. Palliser had noticed nothing. \"Alice, what can we do for him? It is Burgo.\"\nMany eyes were now watching him. He was not successful in his attempt to show indifference to his loss. His gait and his whistling told the tale. Even the unemotional croupiers furtively cast an eye after him, and a very big Guard seemed to be interested by his movements. If there is to be a tragedy at these places, it is always as well that the tragic scene should be as far removed as possible from the salons, away from the public eye.\nLady Glencora and Alice had shrunk back behind a pillar.\n\"What can I do?\" said Glencora. \"Look at him, Alice. If he were to destroy himself, what should I do then?\"\nBurgo, conscious of all eyes, turned round upon his heel and again walked the length of the salon, still whistling. His companion had slunk away from him.\n\"What shall I do, Alice?\" said Lady Glencora, her eyes still fixed on him.\n\"Tell Mr. Palliser,\" whispered Alice.\nLady Glencora ran up to her husband, and took him away from Mr. Grey. She told her story so rapidly that Mr. Palliser could hardly get in a word. \"Do something for him; do, do. Unless I know that something is done, I shall die. You needn't be afraid.\"\n\"I'm not afraid,\" said Mr. Palliser.\nLady Glencora took her husband's hand, and caressed it. \"You are so good,\" said she. \"Don't let him out of your sight. There; he is going. I will go home with Mr. Grey. I will be ever so good; I will, indeed. You know what he'll want, and for my sake you'll let him have it. But don't let him gamble. If you could only get him home to England. You owe him something, Plantagenet; do you not?\"\n\"If money can do anything, he shall have it.\"\n\"God bless you, dearest! I shall never see him again; but if you could save him! There - he is going now.\" She pushed him forward, and then retreating, put her arm within Mr. Grey's.\nBurgo, at the door leading out of the salon, had paused a moment, and had encountered the big Guard close to him.\n\"Well, old Buffer, what do you want?\" said he. The Guard simply walked on through the door, and said nothing. Then Burgo also walked out, and Mr. Palliser quickly went after him.\nThey were now in the large front salon, from where the main door of the building opened\nout upon the steps. Through this door Burgo went, and Mr. Palliser followed. They both walked to the end of the street, and then Burgo turned into a little path which led up through the trees to the hills. That hillside among the trees is a popular resort at Baden, but now, at nine in the evening, it was deserted. Palliser followed Burgo till he threw himself on the grass beneath a tree.\n\"You are in trouble, I fear, Mr. Fitzgerald,\" said Mr. Palliser, as soon as he drew close.\n\"We will go home. Mr. Palliser has something to do,\" said Lady Glencora to Mr. Grey, after the two men had disappeared from her sight.\n\"Is that a friend of Mr. Palliser?\" said Mr. Grey.\n\"Yes; that is, he knows him. Alice, shall we go home? Oh! Mr. Grey, you must not ask any questions. Mr. Palliser will tell you everything when he sees you - if there is anything to tell.\"\nThen they all went home, and soon separated for the night.\n\"Of course I shall sit up for him,\" said Lady Glencora to Alice, \"but in my own room. You can tell Mr. Grey, if you like.\"\nBut Alice told nothing to Mr. Grey, nor did Mr. Grey ask any questions.",
        "paragraph_chars": [
            [
                0,
                221
            ],
            [
                221,
                459
            ],
            [
                459,
                604
            ],
            [
                604,
                965
            ],
            [
                965,
                1006
            ],
            [
                1006,
                1050
            ],
            [
                1050,
                1399
            ],
            [
                1399,
                1749
            ],
            [
                1749,
                2372
            ],
            [
                2372,
                2655
            ],
            [
                2655,
                2724
            ],
            [
                2724,
                2782
            ],
            [
                2782,
                3115
            ],
            [
                3115,
                3172
            ],
            [
                3172,
                3544
            ],
            [
                3544,
                3577
            ],
            [
                3577,
                3802
            ],
            [
                3802,
                3877
            ],
            [
                3877,
                3968
            ],
            [
                3968,
                4056
            ],
            [
                4056,
                4310
            ],
            [
                4310,
                4595
            ],
            [
                4595,
                4878
            ],
            [
                4878,
                5410
            ],
            [
                5410,
                5855
            ],
            [
                5855,
                6012
            ],
            [
                6012,
                6075
            ],
            [
                6075,
                6259
            ],
            [
                6259,
                6358
            ],
            [
                6358,
                6614
            ],
            [
                6614,
                6662
            ],
            [
                6662,
                6701
            ],
            [
                6701,
                6989
            ],
            [
                6989,
                7085
            ],
            [
                7085,
                7136
            ],
            [
                7136,
                7392
            ],
            [
                7392,
                7921
            ],
            [
                7921,
                7985
            ],
            [
                7985,
                8085
            ],
            [
                8085,
                8127
            ],
            [
                8127,
                8168
            ],
            [
                8168,
                8504
            ],
            [
                8504,
                8676
            ],
            [
                8676,
                9051
            ],
            [
                9051,
                9763
            ],
            [
                9763,
                10363
            ],
            [
                10363,
                10664
            ],
            [
                10664,
                11025
            ],
            [
                11025,
                11071
            ],
            [
                11071,
                11149
            ],
            [
                11149,
                11619
            ],
            [
                11619,
                12011
            ],
            [
                12011,
                12146
            ],
            [
                12146,
                12587
            ],
            [
                12587,
                12644
            ],
            [
                12644,
                12752
            ],
            [
                12752,
                12907
            ],
            [
                12907,
                12982
            ],
            [
                12982,
                13020
            ],
            [
                13020,
                13272
            ],
            [
                13272,
                13309
            ],
            [
                13309,
                13702
            ],
            [
                13702,
                13748
            ],
            [
                13748,
                13931
            ],
            [
                13931,
                14045
            ],
            [
                14045,
                14224
            ],
            [
                14224,
                14312
            ],
            [
                14312,
                14703
            ],
            [
                14703,
                14794
            ],
            [
                14794,
                14929
            ],
            [
                14929,
                14980
            ],
            [
                14980,
                15168
            ],
            [
                15168,
                15227
            ],
            [
                15227,
                15350
            ],
            [
                15350,
                15421
            ]
        ],
        "segment_chars": [
            [
                0,
                221
            ],
            [
                221,
                251
            ],
            [
                251,
                369
            ],
            [
                369,
                459
            ],
            [
                459,
                474
            ],
            [
                474,
                489
            ],
            [
                489,
                506
            ],
            [
                506,
                574
            ],
            [
                574,
                604
            ],
            [
                604,
                629
            ],
            [
                629,
                693
            ],
            [
                693,
                826
            ],
            [
                826,
                965
            ],
            [
                965,
                1006
            ],
            [
                1006,
                1050
            ],
            [
                1050,
                1124
            ],
            [
                1124,
                1231
            ],
            [
                1231,
                1399
            ],
            [
                1399,
                1471
            ],
            [
                1471,
                1511
            ],
            [
                1511,
                1600
            ],
            [
                1600,
                1672
            ],
            [
                1672,
                1749
            ],
            [
                1749,
                1926
            ],
            [
                1926,
                1960
            ],
            [
                1960,
                2055
            ],
            [
                2055,
                2132
            ],
            [
                2132,
                2276
            ],
            [
                2276,
                2372
            ],
            [
                2372,
                2462
            ],
            [
                2462,
                2550
            ],
            [
                2550,
                2655
            ],
            [
                2655,
                2677
            ],
            [
                2677,
                2724
            ],
            [
                2724,
                2782
            ],
            [
                2782,
                2848
            ],
            [
                2848,
                2965
            ],
            [
                2965,
                3055
            ],
            [
                3055,
                3115
            ],
            [
                3115,
                3172
            ],
            [
                3172,
                3214
            ],
            [
                3214,
                3401
            ],
            [
                3401,
                3470
            ],
            [
                3470,
                3544
            ],
            [
                3544,
                3577
            ],
            [
                3577,
                3592
            ],
            [
                3592,
                3649
            ],
            [
                3649,
                3680
            ],
            [
                3680,
                3756
            ],
            [
                3756,
                3802
            ],
            [
                3802,
                3877
            ],
            [
                3877,
                3940
            ],
            [
                3940,
                3968
            ],
            [
                3968,
                4056
            ],
            [
                4056,
                4179
            ],
            [
                4179,
                4310
            ],
            [
                4310,
                4480
            ],
            [
                4480,
                4595
            ],
            [
                4595,
                4672
            ],
            [
                4672,
                4762
            ],
            [
                4762,
                4845
            ],
            [
                4845,
                4878
            ],
            [
                4878,
                4952
            ],
            [
                4952,
                5305
            ],
            [
                5305,
                5335
            ],
            [
                5335,
                5410
            ],
            [
                5410,
                5476
            ],
            [
                5476,
                5542
            ],
            [
                5542,
                5658
            ],
            [
                5658,
                5788
            ],
            [
                5788,
                5855
            ],
            [
                5855,
                5926
            ],
            [
                5926,
                6012
            ],
            [
                6012,
                6061
            ],
            [
                6061,
                6075
            ],
            [
                6075,
                6218
            ],
            [
                6218,
                6259
            ],
            [
                6259,
                6358
            ],
            [
                6358,
                6496
            ],
            [
                6496,
                6614
            ],
            [
                6614,
                6662
            ],
            [
                6662,
                6701
            ],
            [
                6701,
                6726
            ],
            [
                6726,
                6787
            ],
            [
                6787,
                6855
            ],
            [
                6855,
                6927
            ],
            [
                6927,
                6989
            ],
            [
                6989,
                7075
            ],
            [
                7075,
                7085
            ],
            [
                7085,
                7107
            ],
            [
                7107,
                7136
            ],
            [
                7136,
                7175
            ],
            [
                7175,
                7281
            ],
            [
                7281,
                7392
            ],
            [
                7392,
                7477
            ],
            [
                7477,
                7583
            ],
            [
                7583,
                7643
            ],
            [
                7643,
                7710
            ],
            [
                7710,
                7820
            ],
            [
                7820,
                7921
            ],
            [
                7921,
                7985
            ],
            [
                7985,
                8085
            ],
            [
                8085,
                8127
            ],
            [
                8127,
                8168
            ],
            [
                8168,
                8452
            ],
            [
                8452,
                8504
            ],
            [
                8504,
                8632
            ],
            [
                8632,
                8676
            ],
            [
                8676,
                8954
            ],
            [
                8954,
                9051
            ],
            [
                9051,
                9167
            ],
            [
                9167,
                9294
            ],
            [
                9294,
                9460
            ],
            [
                9460,
                9513
            ],
            [
                9513,
                9667
            ],
            [
                9667,
                9763
            ],
            [
                9763,
                9799
            ],
            [
                9799,
                9819
            ],
            [
                9819,
                9878
            ],
            [
                9878,
                9901
            ],
            [
                9901,
                10042
            ],
            [
                10042,
                10135
            ],
            [
                10135,
                10279
            ],
            [
                10279,
                10363
            ],
            [
                10363,
                10401
            ],
            [
                10401,
                10454
            ],
            [
                10454,
                10595
            ],
            [
                10595,
                10664
            ],
            [
                10664,
                10699
            ],
            [
                10699,
                10778
            ],
            [
                10778,
                10840
            ],
            [
                10840,
                10920
            ],
            [
                10920,
                11025
            ],
            [
                11025,
                11051
            ],
            [
                11051,
                11071
            ],
            [
                11071,
                11149
            ],
            [
                11149,
                11336
            ],
            [
                11336,
                11422
            ],
            [
                11422,
                11455
            ],
            [
                11455,
                11559
            ],
            [
                11559,
                11619
            ],
            [
                11619,
                11663
            ],
            [
                11663,
                11744
            ],
            [
                11744,
                11866
            ],
            [
                11866,
                12011
            ],
            [
                12011,
                12066
            ],
            [
                12066,
                12100
            ],
            [
                12100,
                12132
            ],
            [
                12132,
                12146
            ],
            [
                12146,
                12179
            ],
            [
                12179,
                12250
            ],
            [
                12250,
                12292
            ],
            [
                12292,
                12419
            ],
            [
                12419,
                12587
            ],
            [
                12587,
                12644
            ],
            [
                12644,
                12661
            ],
            [
                12661,
                12676
            ],
            [
                12676,
                12697
            ],
            [
                12697,
                12752
            ],
            [
                12752,
                12868
            ],
            [
                12868,
                12907
            ],
            [
                12907,
                12933
            ],
            [
                12933,
                12982
            ],
            [
                12982,
                13020
            ],
            [
                13020,
                13090
            ],
            [
                13090,
                13166
            ],
            [
                13166,
                13197
            ],
            [
                13197,
                13248
            ],
            [
                13248,
                13272
            ],
            [
                13272,
                13309
            ],
            [
                13309,
                13365
            ],
            [
                13365,
                13394
            ],
            [
                13394,
                13428
            ],
            [
                13428,
                13448
            ],
            [
                13448,
                13478
            ],
            [
                13478,
                13518
            ],
            [
                13518,
                13584
            ],
            [
                13584,
                13610
            ],
            [
                13610,
                13653
            ],
            [
                13653,
                13702
            ],
            [
                13702,
                13748
            ],
            [
                13748,
                13773
            ],
            [
                13773,
                13829
            ],
            [
                13829,
                13855
            ],
            [
                13855,
                13931
            ],
            [
                13931,
                14045
            ],
            [
                14045,
                14083
            ],
            [
                14083,
                14092
            ],
            [
                14092,
                14155
            ],
            [
                14155,
                14224
            ],
            [
                14224,
                14312
            ],
            [
                14312,
                14332
            ],
            [
                14332,
                14389
            ],
            [
                14389,
                14518
            ],
            [
                14518,
                14628
            ],
            [
                14628,
                14703
            ],
            [
                14703,
                14794
            ],
            [
                14794,
                14812
            ],
            [
                14812,
                14929
            ],
            [
                14929,
                14965
            ],
            [
                14965,
                14980
            ],
            [
                14980,
                15009
            ],
            [
                15009,
                15034
            ],
            [
                15034,
                15038
            ],
            [
                15038,
                15080
            ],
            [
                15080,
                15168
            ],
            [
                15168,
                15227
            ],
            [
                15227,
                15313
            ],
            [
                15313,
                15350
            ],
            [
                15350,
                15421
            ]
        ],
        "overlap_chars": [
            [
                0,
                191
            ],
            [
                192,
                220
            ],
            [
                221,
                249
            ],
            [
                249,
                250
            ],
            [
                251,
                271
            ],
            [
                275,
                303
            ],
            [
                303,
                304
            ],
            [
                305,
                315
            ],
            [
                321,
                356
            ],
            [
                367,
                369
            ],
            [
                371,
                372
            ],
            [
                386,
                395
            ],
            [
                401,
                403
            ],
            [
                404,
                406
            ],
            [
                411,
                412
            ],
            [
                416,
                422
            ],
            [
                432,
                450
            ],
            [
                457,
                458
            ],
            [
                459,
                474
            ],
            [
                474,
                489
            ],
            [
                489,
                504
            ],
            [
                504,
                506
            ],
            [
                506,
                542
            ],
            [
                549,
                563
            ],
            [
                572,
                574
            ],
            [
                574,
                603
            ],
            [
                606,
                612
            ],
            [
                620,
                627
            ],
            [
                627,
                629
            ],
            [
                629,
                639
            ],
            [
                640,
                650
            ],
            [
                654,
                662
            ],
            [
                669,
                693
            ],
            [
                693,
                709
            ],
            [
                709,
                762
            ],
            [
                767,
                779
            ],
            [
                780,
                826
            ],
            [
                826,
                890
            ],
            [
                900,
                914
            ],
            [
                914,
                923
            ],
            [
                924,
                932
            ],
            [
                933,
                964
            ],
            [
                965,
                1006
            ],
            [
                1006,
                1050
            ],
            [
                1050,
                1124
            ],
            [
                1124,
                1128
            ],
            [
                1129,
                1141
            ],
            [
                1169,
                1170
            ],
            [
                1171,
                1177
            ],
            [
                1181,
                1186
            ],
            [
                1187,
                1229
            ],
            [
                1229,
                1231
            ],
            [
                1231,
                1381
            ],
            [
                1382,
                1390
            ],
            [
                1397,
                1399
            ],
            [
                1399,
                1456
            ],
            [
                1457,
                1471
            ],
            [
                1471,
                1509
            ],
            [
                1509,
                1511
            ],
            [
                1511,
                1600
            ],
            [
                1600,
                1672
            ],
            [
                1672,
                1688
            ],
            [
                1689,
                1748
            ],
            [
                1749,
                1809
            ],
            [
                1811,
                1834
            ],
            [
                1840,
                1843
            ],
            [
                1844,
                1917
            ],
            [
                1924,
                1926
            ],
            [
                1926,
                1929
            ],
            [
                1930,
                1960
            ],
            [
                1960,
                1985
            ],
            [
                1986,
                1989
            ],
            [
                1994,
                2012
            ],
            [
                2013,
                2021
            ],
            [
                2022,
                2055
            ],
            [
                2055,
                2106
            ],
            [
                2111,
                2130
            ],
            [
                2132,
                2276
            ],
            [
                2276,
                2300
            ],
            [
                2305,
                2372
            ],
            [
                2372,
                2410
            ],
            [
                2411,
                2414
            ],
            [
                2415,
                2417
            ],
            [
                2418,
                2431
            ],
            [
                2432,
                2462
            ],
            [
                2465,
                2467
            ],
            [
                2468,
                2484
            ],
            [
                2485,
                2494
            ],
            [
                2495,
                2497
            ],
            [
                2498,
                2505
            ],
            [
                2508,
                2550
            ],
            [
                2550,
                2558
            ],
            [
                2559,
                2564
            ],
            [
                2565,
                2583
            ],
            [
                2584,
                2590
            ],
            [
                2592,
                2597
            ],
            [
                2598,
                2619
            ],
            [
                2627,
                2655
            ],
            [
                2655,
                2677
            ],
            [
                2677,
                2724
            ],
            [
                2724,
                2782
            ],
            [
                2782,
                2848
            ],
            [
                2848,
                2849
            ],
            [
                2849,
                2850
            ],
            [
                2851,
                2938
            ],
            [
                2941,
                2963
            ],
            [
                2965,
                3055
            ],
            [
                3055,
                3115
            ],
            [
                3115,
                3172
            ],
            [
                3172,
                3214
            ],
            [
                3214,
                3300
            ],
            [
                3301,
                3329
            ],
            [
                3329,
                3347
            ],
            [
                3348,
                3401
            ],
            [
                3401,
                3470
            ],
            [
                3470,
                3544
            ],
            [
                3544,
                3577
            ],
            [
                3578,
                3590
            ],
            [
                3590,
                3592
            ],
            [
                3592,
                3616
            ],
            [
                3619,
                3649
            ],
            [
                3649,
                3680
            ],
            [
                3680,
                3756
            ],
            [
                3756,
                3802
            ],
            [
                3802,
                3842
            ],
            [
                3843,
                3857
            ],
            [
                3858,
                3877
            ],
            [
                3877,
                3920
            ],
            [
                3921,
                3940
            ],
            [
                3940,
                3965
            ],
            [
                3968,
                4004
            ],
            [
                4005,
                4055
            ],
            [
                4056,
                4082
            ],
            [
                4100,
                4101
            ],
            [
                4103,
                4179
            ],
            [
                4179,
                4239
            ],
            [
                4248,
                4272
            ],
            [
                4281,
                4310
            ],
            [
                4310,
                4461
            ],
            [
                4462,
                4469
            ],
            [
                4470,
                4480
            ],
            [
                4480,
                4499
            ],
            [
                4500,
                4593
            ],
            [
                4593,
                4594
            ],
            [
                4595,
                4672
            ],
            [
                4672,
                4700
            ],
            [
                4701,
                4762
            ],
            [
                4762,
                4763
            ],
            [
                4764,
                4806
            ],
            [
                4815,
                4825
            ],
            [
                4826,
                4845
            ],
            [
                4845,
                4872
            ],
            [
                4873,
                4876
            ],
            [
                4876,
                4877
            ],
            [
                4891,
                4899
            ],
            [
                4900,
                4905
            ],
            [
                4906,
                4923
            ],
            [
                4924,
                4930
            ],
            [
                4931,
                4938
            ],
            [
                4950,
                4952
            ],
            [
                4952,
                5040
            ],
            [
                5040,
                5172
            ],
            [
                5173,
                5251
            ],
            [
                5251,
                5256
            ],
            [
                5262,
                5278
            ],
            [
                5279,
                5294
            ],
            [
                5295,
                5303
            ],
            [
                5303,
                5305
            ],
            [
                5305,
                5333
            ],
            [
                5333,
                5335
            ],
            [
                5335,
                5410
            ],
            [
                5410,
                5459
            ],
            [
                5460,
                5468
            ],
            [
                5469,
                5476
            ],
            [
                5476,
                5529
            ],
            [
                5530,
                5542
            ],
            [
                5542,
                5593
            ],
            [
                5594,
                5597
            ],
            [
                5598,
                5603
            ],
            [
                5604,
                5606
            ],
            [
                5607,
                5612
            ],
            [
                5612,
                5658
            ],
            [
                5658,
                5751
            ],
            [
                5756,
                5788
            ],
            [
                5788,
                5828
            ],
            [
                5829,
                5840
            ],
            [
                5841,
                5847
            ],
            [
                5848,
                5854
            ],
            [
                5855,
                5895
            ],
            [
                5902,
                5926
            ],
            [
                5928,
                5929
            ],
            [
                5935,
                5951
            ],
            [
                5954,
                5967
            ],
            [
                5968,
                5988
            ],
            [
                5989,
                5992
            ],
            [
                5993,
                5997
            ],
            [
                5998,
                6010
            ],
            [
                6012,
                6061
            ],
            [
                6061,
                6075
            ],
            [
                6075,
                6098
            ],
            [
                6098,
                6099
            ],
            [
                6100,
                6101
            ],
            [
                6101,
                6165
            ],
            [
                6166,
                6170
            ],
            [
                6171,
                6195
            ],
            [
                6196,
                6197
            ],
            [
                6198,
                6216
            ],
            [
                6216,
                6218
            ],
            [
                6218,
                6259
            ],
            [
                6259,
                6357
            ],
            [
                6358,
                6496
            ],
            [
                6496,
                6545
            ],
            [
                6546,
                6553
            ],
            [
                6563,
                6567
            ],
            [
                6575,
                6578
            ],
            [
                6587,
                6595
            ],
            [
                6596,
                6601
            ],
            [
                6605,
                6613
            ],
            [
                6614,
                6662
            ],
            [
                6662,
                6698
            ],
            [
                6701,
                6726
            ],
            [
                6726,
                6759
            ],
            [
                6760,
                6768
            ],
            [
                6769,
                6787
            ],
            [
                6787,
                6853
            ],
            [
                6853,
                6855
            ],
            [
                6855,
                6927
            ],
            [
                6927,
                6989
            ],
            [
                6989,
                7018
            ],
            [
                7019,
                7023
            ],
            [
                7023,
                7075
            ],
            [
                7075,
                7085
            ],
            [
                7085,
                7107
            ],
            [
                7107,
                7136
            ],
            [
                7136,
                7175
            ],
            [
                7175,
                7260
            ],
            [
                7261,
                7281
            ],
            [
                7281,
                7392
            ],
            [
                7392,
                7442
            ],
            [
                7443,
                7477
            ],
            [
                7483,
                7583
            ],
            [
                7583,
                7643
            ],
            [
                7643,
                7663
            ],
            [
                7664,
                7702
            ],
            [
                7703,
                7710
            ],
            [
                7710,
                7726
            ],
            [
                7727,
                7776
            ],
            [
                7777,
                7820
            ],
            [
                7820,
                7921
            ],
            [
                7921,
                7985
            ],
            [
                7985,
                8083
            ],
            [
                8083,
                8085
            ],
            [
                8085,
                8089
            ],
            [
                8095,
                8097
            ],
            [
                8105,
                8125
            ],
            [
                8125,
                8127
            ],
            [
                8127,
                8168
            ],
            [
                8168,
                8172
            ],
            [
                8181,
                8258
            ],
            [
                8259,
                8395
            ],
            [
                8396,
                8426
            ],
            [
                8427,
                8452
            ],
            [
                8452,
                8502
            ],
            [
                8502,
                8503
            ],
            [
                8504,
                8533
            ],
            [
                8534,
                8538
            ],
            [
                8539,
                8552
            ],
            [
                8553,
                8568
            ],
            [
                8577,
                8579
            ],
            [
                8582,
                8632
            ],
            [
                8632,
                8675
            ],
            [
                8676,
                8678
            ],
            [
                8684,
                8689
            ],
            [
                8690,
                8696
            ],
            [
                8697,
                8722
            ],
            [
                8731,
                8739
            ],
            [
                8740,
                8742
            ],
            [
                8743,
                8746
            ],
            [
                8752,
                8780
            ],
            [
                8781,
                8877
            ],
            [
                8880,
                8914
            ],
            [
                8917,
                8954
            ],
            [
                8954,
                8958
            ],
            [
                8963,
                8971
            ],
            [
                8980,
                8983
            ],
            [
                8995,
                8998
            ],
            [
                8999,
                9017
            ],
            [
                9018,
                9051
            ],
            [
                9051,
                9071
            ],
            [
                9072,
                9082
            ],
            [
                9083,
                9091
            ],
            [
                9092,
                9095
            ],
            [
                9105,
                9111
            ],
            [
                9112,
                9119
            ],
            [
                9120,
                9123
            ],
            [
                9126,
                9139
            ],
            [
                9140,
                9147
            ],
            [
                9148,
                9165
            ],
            [
                9165,
                9167
            ],
            [
                9167,
                9219
            ],
            [
                9220,
                9228
            ],
            [
                9229,
                9232
            ],
            [
                9233,
                9294
            ],
            [
                9294,
                9297
            ],
            [
                9303,
                9356
            ],
            [
                9357,
                9460
            ],
            [
                9460,
                9469
            ],
            [
                9474,
                9476
            ],
            [
                9477,
                9481
            ],
            [
                9482,
                9487
            ],
            [
                9488,
                9492
            ],
            [
                9493,
                9513
            ],
            [
                9513,
                9524
            ],
            [
                9525,
                9528
            ],
            [
                9529,
                9533
            ],
            [
                9534,
                9542
            ],
            [
                9543,
                9571
            ],
            [
                9572,
                9602
            ],
            [
                9603,
                9611
            ],
            [
                9612,
                9615
            ],
            [
                9616,
                9621
            ],
            [
                9626,
                9658
            ],
            [
                9665,
                9667
            ],
            [
                9667,
                9686
            ],
            [
                9687,
                9690
            ],
            [
                9690,
                9714
            ],
            [
                9715,
                9724
            ],
            [
                9725,
                9763
            ],
            [
                9763,
                9799
            ],
            [
                9799,
                9819
            ],
            [
                9819,
                9857
            ],
            [
                9858,
                9878
            ],
            [
                9878,
                9898
            ],
            [
                9901,
                10042
            ],
            [
                10042,
                10121
            ],
            [
                10129,
                10135
            ],
            [
                10135,
                10138
            ],
            [
                10144,
                10146
            ],
            [
                10147,
                10166
            ],
            [
                10167,
                10238
            ],
            [
                10241,
                10246
            ],
            [
                10255,
                10279
            ],
            [
                10279,
                10334
            ],
            [
                10340,
                10344
            ],
            [
                10345,
                10352
            ],
            [
                10359,
                10361
            ],
            [
                10361,
                10362
            ],
            [
                10363,
                10401
            ],
            [
                10401,
                10452
            ],
            [
                10452,
                10454
            ],
            [
                10454,
                10481
            ],
            [
                10482,
                10512
            ],
            [
                10513,
                10537
            ],
            [
                10537,
                10584
            ],
            [
                10593,
                10595
            ],
            [
                10595,
                10664
            ],
            [
                10664,
                10697
            ],
            [
                10697,
                10699
            ],
            [
                10699,
                10734
            ],
            [
                10742,
                10767
            ],
            [
                10772,
                10776
            ],
            [
                10776,
                10778
            ],
            [
                10778,
                10780
            ],
            [
                10794,
                10797
            ],
            [
                10817,
                10822
            ],
            [
                10823,
                10828
            ],
            [
                10829,
                10838
            ],
            [
                10838,
                10840
            ],
            [
                10840,
                10845
            ],
            [
                10846,
                10862
            ],
            [
                10863,
                10883
            ],
            [
                10888,
                10903
            ],
            [
                10907,
                10918
            ],
            [
                10918,
                10920
            ],
            [
                10920,
                10954
            ],
            [
                10962,
                11002
            ],
            [
                11008,
                11025
            ],
            [
                11025,
                11051
            ],
            [
                11051,
                11071
            ],
            [
                11071,
                11105
            ],
            [
                11106,
                11149
            ],
            [
                11149,
                11223
            ],
            [
                11224,
                11274
            ],
            [
                11275,
                11279
            ],
            [
                11285,
                11336
            ],
            [
                11336,
                11397
            ],
            [
                11405,
                11407
            ],
            [
                11408,
                11413
            ],
            [
                11417,
                11420
            ],
            [
                11420,
                11422
            ],
            [
                11422,
                11445
            ],
            [
                11446,
                11453
            ],
            [
                11453,
                11455
            ],
            [
                11455,
                11467
            ],
            [
                11468,
                11559
            ],
            [
                11559,
                11617
            ],
            [
                11617,
                11619
            ],
            [
                11619,
                11645
            ],
            [
                11646,
                11663
            ],
            [
                11663,
                11726
            ],
            [
                11726,
                11731
            ],
            [
                11732,
                11739
            ],
            [
                11740,
                11742
            ],
            [
                11742,
                11744
            ],
            [
                11754,
                11756
            ],
            [
                11787,
                11820
            ],
            [
                11829,
                11866
            ],
            [
                11866,
                11957
            ],
            [
                11958,
                11967
            ],
            [
                11967,
                11968
            ],
            [
                11969,
                11983
            ],
            [
                11984,
                11989
            ],
            [
                11990,
                12003
            ],
            [
                12004,
                12011
            ],
            [
                12011,
                12066
            ],
            [
                12066,
                12082
            ],
            [
                12083,
                12090
            ],
            [
                12098,
                12100
            ],
            [
                12100,
                12132
            ],
            [
                12132,
                12143
            ],
            [
                12146,
                12179
            ],
            [
                12179,
                12218
            ],
            [
                12219,
                12223
            ],
            [
                12224,
                12236
            ],
            [
                12237,
                12239
            ],
            [
                12240,
                12248
            ],
            [
                12248,
                12250
            ],
            [
                12250,
                12253
            ],
            [
                12263,
                12276
            ],
            [
                12277,
                12292
            ],
            [
                12292,
                12300
            ],
            [
                12313,
                12376
            ],
            [
                12377,
                12383
            ],
            [
                12384,
                12419
            ],
            [
                12419,
                12463
            ],
            [
                12464,
                12560
            ],
            [
                12571,
                12585
            ],
            [
                12585,
                12587
            ],
            [
                12587,
                12614
            ],
            [
                12615,
                12626
            ],
            [
                12627,
                12643
            ],
            [
                12644,
                12658
            ],
            [
                12658,
                12660
            ],
            [
                12661,
                12675
            ],
            [
                12677,
                12697
            ],
            [
                12697,
                12752
            ],
            [
                12752,
                12768
            ],
            [
                12769,
                12849
            ],
            [
                12866,
                12868
            ],
            [
                12868,
                12881
            ],
            [
                12882,
                12905
            ],
            [
                12905,
                12907
            ],
            [
                12907,
                12933
            ],
            [
                12933,
                12952
            ],
            [
                12953,
                12980
            ],
            [
                12980,
                12982
            ],
            [
                12982,
                13020
            ],
            [
                13020,
                13033
            ],
            [
                13034,
                13090
            ],
            [
                13090,
                13108
            ],
            [
                13120,
                13166
            ],
            [
                13166,
                13188
            ],
            [
                13189,
                13197
            ],
            [
                13197,
                13248
            ],
            [
                13248,
                13272
            ],
            [
                13272,
                13309
            ],
            [
                13309,
                13322
            ],
            [
                13328,
                13365
            ],
            [
                13365,
                13394
            ],
            [
                13394,
                13428
            ],
            [
                13428,
                13448
            ],
            [
                13448,
                13478
            ],
            [
                13478,
                13518
            ],
            [
                13518,
                13584
            ],
            [
                13584,
                13610
            ],
            [
                13610,
                13651
            ],
            [
                13651,
                13653
            ],
            [
                13653,
                13702
            ],
            [
                13702,
                13748
            ],
            [
                13748,
                13773
            ],
            [
                13773,
                13829
            ],
            [
                13829,
                13834
            ],
            [
                13837,
                13852
            ],
            [
                13855,
                13929
            ],
            [
                13929,
                13931
            ],
            [
                13931,
                13937
            ],
            [
                13941,
                14000
            ],
            [
                14001,
                14024
            ],
            [
                14031,
                14044
            ],
            [
                14045,
                14083
            ],
            [
                14083,
                14090
            ],
            [
                14090,
                14092
            ],
            [
                14092,
                14095
            ],
            [
                14102,
                14155
            ],
            [
                14155,
                14170
            ],
            [
                14178,
                14223
            ],
            [
                14224,
                14268
            ],
            [
                14275,
                14278
            ],
            [
                14284,
                14311
            ],
            [
                14312,
                14332
            ],
            [
                14332,
                14360
            ],
            [
                14360,
                14378
            ],
            [
                14387,
                14389
            ],
            [
                14389,
                14423
            ],
            [
                14430,
                14446
            ],
            [
                14447,
                14518
            ],
            [
                14518,
                14577
            ],
            [
                14578,
                14628
            ],
            [
                14628,
                14636
            ],
            [
                14637,
                14645
            ],
            [
                14646,
                14659
            ],
            [
                14666,
                14703
            ],
            [
                14703,
                14781
            ],
            [
                14787,
                14792
            ],
            [
                14792,
                14794
            ],
            [
                14794,
                14812
            ],
            [
                14812,
                14878
            ],
            [
                14885,
                14929
            ],
            [
                14929,
                14965
            ],
            [
                14965,
                14980
            ],
            [
                14980,
                14985
            ],
            [
                14986,
                15007
            ],
            [
                15007,
                15009
            ],
            [
                15009,
                15034
            ],
            [
                15034,
                15038
            ],
            [
                15038,
                15080
            ],
            [
                15080,
                15092
            ],
            [
                15093,
                15134
            ],
            [
                15137,
                15160
            ],
            [
                15165,
                15167
            ],
            [
                15168,
                15226
            ],
            [
                15227,
                15296
            ],
            [
                15297,
                15313
            ],
            [
                15313,
                15349
            ],
            [
                15350,
                15421
            ]
        ],
        "row_chars": [
            [
                0,
                221
            ],
            [
                221,
                369
            ],
            [
                369,
                459
            ],
            [
                459,
                474
            ],
            [
                474,
                489
            ],
            [
                489,
                506
            ],
            [
                506,
                574
            ],
            [
                574,
                604
            ],
            [
                604,
                629
            ],
            [
                629,
                629
            ],
            [
                629,
                693
            ],
            [
                693,
                826
            ],
            [
                826,
                965
            ],
            [
                965,
                1006
            ],
            [
                1006,
                1050
            ],
            [
                1050,
                1124
            ],
            [
                1124,
                1231
            ],
            [
                1231,
                1399
            ],
            [
                1399,
                1471
            ],
            [
                1471,
                1511
            ],
            [
                1511,
                1600
            ],
            [
                1600,
                1600
            ],
            [
                1600,
                1672
            ],
            [
                1672,
                1749
            ],
            [
                1749,
                1926
            ],
            [
                1926,
                1960
            ],
            [
                1960,
                2055
            ],
            [
                2055,
                2055
            ],
            [
                2055,
                2055
            ],
            [
                2055,
                2132
            ],
            [
                2132,
                2276
            ],
            [
                2276,
                2372
            ],
            [
                2372,
                2462
            ],
            [
                2462,
                2462
            ],
            [
                2462,
                2462
            ],
            [
                2462,
                2462
            ],
            [
                2462,
                2462
            ],
            [
                2462,
                2462
            ],
            [
                2462,
                2550
            ],
            [
                2550,
                2655
            ],
            [
                2655,
                2677
            ],
            [
                2677,
                2724
            ],
            [
                2724,
                2782
            ],
            [
                2782,
                2848
            ],
            [
                2848,
                2965
            ],
            [
                2965,
                3055
            ],
            [
                3055,
                3115
            ],
            [
                3115,
                3172
            ],
            [
                3172,
                3214
            ],
            [
                3214,
                3401
            ],
            [
                3401,
                3401
            ],
            [
                3401,
                3401
            ],
            [
                3401,
                3401
            ],
            [
                3401,
                3470
            ],
            [
                3470,
                3544
            ],
            [
                3544,
                3577
            ],
            [
                3577,
                3577
            ],
            [
                3577,
                3592
            ],
            [
                3592,
                3649
            ],
            [
                3649,
                3680
            ],
            [
                3680,
                3680
            ],
            [
                3680,
                3756
            ],
            [
                3756,
                3802
            ],
            [
                3802,
                3877
            ],
            [
                3877,
                3940
            ],
            [
                3940,
                3940
            ],
            [
                3940,
                3968
            ],
            [
                3968,
                3968
            ],
            [
                3968,
                4056
            ],
            [
                4056,
                4056
            ],
            [
                4056,
                4179
            ],
            [
                4179,
                4310
            ],
            [
                4310,
                4480
            ],
            [
                4480,
                4595
            ],
            [
                4595,
                4672
            ],
            [
                4672,
                4762
            ],
            [
                4762,
                4845
            ],
            [
                4845,
                4878
            ],
            [
                4878,
                4952
            ],
            [
                4952,
                5305
            ],
            [
                5305,
                5335
            ],
            [
                5335,
                5410
            ],
            [
                5410,
                5476
            ],
            [
                5476,
                5476
            ],
            [
                5476,
                5476
            ],
            [
                5476,
                5476
            ],
            [
                5476,
                5542
            ],
            [
                5542,
                5658
            ],
            [
                5658,
                5658
            ],
            [
                5658,
                5658
            ],
            [
                5658,
                5788
            ],
            [
                5788,
                5855
            ],
            [
                5855,
                5855
            ],
            [
                5855,
                5926
            ],
            [
                5926,
                6012
            ],
            [
                6012,
                6061
            ],
            [
                6061,
                6075
            ],
            [
                6075,
                6218
            ],
            [
                6218,
                6218
            ],
            [
                6218,
                6259
            ],
            [
                6259,
                6259
            ],
            [
                6259,
                6358
            ],
            [
                6358,
                6358
            ],
            [
                6358,
                6358
            ],
            [
                6358,
                6358
            ],
            [
                6358,
                6496
            ],
            [
                6496,
                6614
            ],
            [
                6614,
                6662
            ],
            [
                6662,
                6701
            ],
            [
                6701,
                6701
            ],
            [
                6701,
                6726
            ],
            [
                6726,
                6787
            ],
            [
                6787,
                6787
            ],
            [
                6787,
                6855
            ],
            [
                6855,
                6927
            ],
            [
                6927,
                6989
            ],
            [
                6989,
                7075
            ],
            [
                7075,
                7085
            ],
            [
                7085,
                7107
            ],
            [
                7107,
                7136
            ],
            [
                7136,
                7175
            ],
            [
                7175,
                7281
            ],
            [
                7281,
                7392
            ],
            [
                7392,
                7477
            ],
            [
                7477,
                7583
            ],
            [
                7583,
                7643
            ],
            [
                7643,
                7710
            ],
            [
                7710,
                7710
            ],
            [
                7710,
                7820
            ],
            [
                7820,
                7921
            ],
            [
                7921,
                7985
            ],
            [
                7985,
                8085
            ],
            [
                8085,
                8127
            ],
            [
                8127,
                8168
            ],
            [
                8168,
                8452
            ],
            [
                8452,
                8504
            ],
            [
                8504,
                8632
            ],
            [
                8632,
                8676
            ],
            [
                8676,
                8954
            ],
            [
                8954,
                9051
            ],
            [
                9051,
                9167
            ],
            [
                9167,
                9294
            ],
            [
                9294,
                9460
            ],
            [
                9460,
                9513
            ],
            [
                9513,
                9513
            ],
            [
                9513,
                9513
            ],
            [
                9513,
                9667
            ],
            [
                9667,
                9667
            ],
            [
                9667,
                9763
            ],
            [
                9763,
                9799
            ],
            [
                9799,
                9819
            ],
            [
                9819,
                9878
            ],
            [
                9878,
                9901
            ],
            [
                9901,
                9901
            ],
            [
                9901,
                10042
            ],
            [
                10042,
                10135
            ],
            [
                10135,
                10135
            ],
            [
                10135,
                10135
            ],
            [
                10135,
                10279
            ],
            [
                10279,
                10363
            ],
            [
                10363,
                10401
            ],
            [
                10401,
                10454
            ],
            [
                10454,
                10595
            ],
            [
                10595,
                10664
            ],
            [
                10664,
                10699
            ],
            [
                10699,
                10778
            ],
            [
                10778,
                10778
            ],
            [
                10778,
                10840
            ],
            [
                10840,
                10920
            ],
            [
                10920,
                11025
            ],
            [
                11025,
                11051
            ],
            [
                11051,
                11071
            ],
            [
                11071,
                11149
            ],
            [
                11149,
                11336
            ],
            [
                11336,
                11422
            ],
            [
                11422,
                11455
            ],
            [
                11455,
                11559
            ],
            [
                11559,
                11619
            ],
            [
                11619,
                11663
            ],
            [
                11663,
                11744
            ],
            [
                11744,
                11866
            ],
            [
                11866,
                12011
            ],
            [
                12011,
                12066
            ],
            [
                12066,
                12100
            ],
            [
                12100,
                12132
            ],
            [
                12132,
                12146
            ],
            [
                12146,
                12179
            ],
            [
                12179,
                12250
            ],
            [
                12250,
                12292
            ],
            [
                12292,
                12419
            ],
            [
                12419,
                12587
            ],
            [
                12587,
                12644
            ],
            [
                12644,
                12676
            ],
            [
                12676,
                12676
            ],
            [
                12676,
                12697
            ],
            [
                12697,
                12752
            ],
            [
                12752,
                12868
            ],
            [
                12868,
                12868
            ],
            [
                12868,
                12907
            ],
            [
                12907,
                12933
            ],
            [
                12933,
                12982
            ],
            [
                12982,
                13020
            ],
            [
                13020,
                13090
            ],
            [
                13090,
                13166
            ],
            [
                13166,
                13197
            ],
            [
                13197,
                13248
            ],
            [
                13248,
                13272
            ],
            [
                13272,
                13309
            ],
            [
                13309,
                13365
            ],
            [
                13365,
                13394
            ],
            [
                13394,
                13428
            ],
            [
                13428,
                13448
            ],
            [
                13448,
                13478
            ],
            [
                13478,
                13518
            ],
            [
                13518,
                13584
            ],
            [
                13584,
                13610
            ],
            [
                13610,
                13653
            ],
            [
                13653,
                13702
            ],
            [
                13702,
                13748
            ],
            [
                13748,
                13773
            ],
            [
                13773,
                13829
            ],
            [
                13829,
                13855
            ],
            [
                13855,
                13855
            ],
            [
                13855,
                13931
            ],
            [
                13931,
                14045
            ],
            [
                14045,
                14083
            ],
            [
                14083,
                14092
            ],
            [
                14092,
                14155
            ],
            [
                14155,
                14224
            ],
            [
                14224,
                14332
            ],
            [
                14332,
                14389
            ],
            [
                14389,
                14518
            ],
            [
                14518,
                14628
            ],
            [
                14628,
                14703
            ],
            [
                14703,
                14794
            ],
            [
                14794,
                14812
            ],
            [
                14812,
                14929
            ],
            [
                14929,
                14965
            ],
            [
                14965,
                14980
            ],
            [
                14980,
                15009
            ],
            [
                15009,
                15034
            ],
            [
                15034,
                15038
            ],
            [
                15038,
                15080
            ],
            [
                15080,
                15168
            ],
            [
                15168,
                15227
            ],
            [
                15227,
                15313
            ],
            [
                15313,
                15350
            ],
            [
                15350,
                15421
            ]
        ]
    }
}