{
    "original": {
        "text": "\"You are in trouble, Mr. Fitzgerald, I fear,\" said Mr. Palliser, standing over Burgo as he lay upon the ground. They were now altogether beyond the gas-lights, and the evening was dark. Burgo, too, was lying with his face to the ground, expecting that the footsteps which he had heard would pass by him.\n\"Who is that?\" said he, turning round suddenly; but still he was not at once able to recognize Mr. Palliser, whose voice was hardly known to him.\n\"Perhaps I have been wrong in following you,\" said Mr. Palliser, \"but I thought you were in distress, and that probably I might help you. My name is Palliser.\"\n\"Plantagenet Palliser?\" said Burgo, jumping up on to his legs and looking close into the other's face. \"By heavens! it is Plantagenet Palliser! Well, Mr. Palliser, what do you want of me?\"\n\"I want to be of some use to you, if I can. I and my wife saw you leave the gaming-table just now.\"\n\"Is she here too?\"\n\"Yes;--she is here. We are going home, but chance brought us up to the salon. She seemed to think that you are in distress, and that I could help you. I will, if you will let me.\"\nMr. Palliser, during the whole interview, felt that he could afford to be generous. He knew that he had no further cause for fear. He had no lingering dread of this poor creature who stood before him. All that feeling was over, though it was as yet hardly four months since he had been sent back by Mrs. Marsham to Lady Monk's house to save his wife, if saving her were yet possible.\n\"So she is here, is she;--and saw me there when I staked my last chance? I should have had over twenty thousand francs now, if the cards had stood to me.\"\n\"The cards never do stand to any one, Mr. Fitzgerald.\"\n\"Never;--never,--never!\" said Burgo. \"At any rate, they never did to me. Nothing ever does stand to me.\"\n\"If you want twenty thousand francs,--that's eight hundred pounds, I think--I can let you have it without any trouble.\"\n\"The devil you can!\"\n\"Oh, yes. As I am travelling with my family--\" I wonder whether Mr. Palliser considered himself to be better entitled to talk of his family than he had been some three or four weeks back--\"As I am travelling with my family, I have been obliged to carry large bills with me, and I can accommodate you without any trouble.\"\nThere was something pleasant in this, which made Burgo Fitzgerald laugh. Mr. Palliser, the husband of Lady Glencora M'Cluskie, and the heir of the Duke of Omnium happening to have money with him! As if Mr. Palliser could not bring down showers of money in any quarter of the globe by simply holding up his hand. And then to talk of accommodating him,--Burgo Fitzgerald, as though it were simply a little matter of convenience,--as though Mr. Palliser would of course find the money at his bankers' when he next examined his book! Burgo could not but laugh.\n\"I was not in the least doubting your ability to raise the money,\" said he; \"but how would you propose to get it back again?\"\n\"That would be at your convenience,\" said Mr. Palliser, who hardly knew how to put himself on a proper footing with his companion, so that he might offer to do something effectual for the man's aid.\n\"I never have any such convenience,\" said Burgo. \"Who were those women whose tubs always had holes at the bottom of them? My tub always has such a hole.\"\n\"You mean the daughters of Danaus,\" said Mr. Palliser.\n\"I don't know whose daughters they were, but you might just as well lend them all eight hundred pounds apiece.\"\n\"There were so many of them,\" said Mr. Palliser, trying a little joke. \"But as you are only one I shall be most happy, as I said before, to be of service.\"\nThey were now walking slowly together up towards the hills, and near to them they heard a step. Upon this, Burgo turned round.\n\"Do you see that fellow?\" said he. Mr. Palliser, who was somewhat short-sighted, said that he did not see him. \"I do, though. I don't know his name, but they have sent him out from the hotel with me, to see what I do with myself. I owe them six or seven hundred francs, and they want to turn me out of the house and not let me take my things with me.\"\n\"That would be very uncomfortable,\" said Mr. Palliser.\n\"It would be uncomfortable, but I shall be too many for them. If they keep my traps they shall keep me. They think I'm going to blow my brains out. That's what they think. The man lets me go far enough off to do that,--so long as it's nowhere about the house.\"\n\"I hope you're not thinking of such a thing?\"\n\"As long as I can help it, Mr. Palliser, I never think of anything.\" The stranger was now standing near to them,--almost so near that he might hear their words. Burgo, perceiving this, walked up to him, and, speaking in bad French, desired him to leave them. \"Don't you see that I have a friend with me?\"\n\"Oh! a friend,\" said the man, answering in bad English. \"Perhaps de friend can advance moneys?\"\n\"Never mind what he can do,\" said Burgo. \"You do as you are bid, and leave me.\"\nThen the gentleman from the hotel retreated down the hill, but Mr. Palliser, during the rest of the interview, frequently fancied that he heard the man's footfall at no great distance.\nThey continued to walk on up the hill very slowly, and it was some time before Mr. Palliser knew how to repeat his offer.\n\"So Lady Glencora is here?\" Burgo said again.\n\"Yes, she is here. It was she who asked me to come to you,\" Mr. Palliser answered. Then they both walked on a few steps in silence, for neither of them knew how to address the other.\n\"By George!--isn't it odd,\" said Burgo, at last, \"that you and I, of all men in the world, should be walking together here at Baden? It's not only that you're the richest man in London, and that I'm the poorest, but--; there are other things, you know, which make it so funny.\"\n\"There have been things which make me and my wife very anxious to give you aid.\"\n\"And have you considered, Mr. Palliser, that those things make you the very man in the world,--indeed, for the matter of that, the only man in the world,--from whom I can't take aid. I would have taken it all if I could have got it,--and I tried hard.\"\n\"I know you have been disappointed, Mr. Fitzgerald.\"\n\"Disappointed! By G----! yes. Did you ever know any man who had so much right to be disappointed as I have? I did love her, Mr. Palliser. Nay, by heavens! I do love her. Out here I will dare to say as much even to you. I shall never try to see her again. All that is over, of course. I've been a fool about her as I have been about everything. But I did love her.\"\n\"I believe it, Mr. Fitzgerald.\"\n\"It was not altogether her money. But think what it would have been to me, Mr. Palliser. Think what a chance I had, and what a chance I lost. I should have been at the top of everything,--as now I am at the bottom. I should not have spent that. There would have been enough of it to have saved me. And then I might have done something good instead of crawling about almost in fear of that beast who is watching us.\"\n\"It has been ordered otherwise,\" said Mr. Palliser, not knowing what to say.\n\"Yes; it has been ordered, with a vengeance! It seems to have been ordered that I'm to go to the devil; but I don't know who gave the orders, and I don't know why.\"\nMr. Palliser had not time to explain to his friend that the orders had been given, in a very peremptory way, by himself, as he was anxious to bring back the conversation to his own point. He wished to give some serviceable, and, if possible, permanent aid to the poor ne'er-do-well; but he did not wish to talk more than could be helped about his own wife.\n\"There is an old saying, which you will remember well,\" said he, \"that the way to good manners is never too late.\"\n\"That's nonsense,\" said Burgo. \"It's too late when the man feels the knot round his neck at the Old Bailey.\"\n\"Perhaps not, even then. Indeed, we may say, certainly not, if the man be still able to take the right way. But I don't want to preach to you.\"\n\"It wouldn't do any good, you know.\"\n\"But I do want to be of service to you. There is something of truth in what you say. You have been disappointed; and I, perhaps, of all men am the most bound to come to your assistance now that you are in need.\"\n\"How can I take it from you?\" said Burgo, almost crying.\n\"You shall take it from her!\"\n\"No;--that would be worse; twenty times worse. What! take her money, when she would not give me herself!\"\n\"I do not see why you should not borrow her money,--or mine. You shall call it which you will.\"\n\"No; I won't have it.\"\n\"And what will you do then?\"\n\"What will I do? Ah! That's the question. I don't know what I will do. I have the key of my bedroom in my pocket, and I will go to bed to-night. It's not very often that I look forward much beyond that.\"\n\"Will you let me call on you, to-morrow?\"\n\"I don't see what good it will do? I shan't get up till late, for fear they should shut the room against me. I might as well have as much out of them as I can. I think I shall say I'm ill, and keep my bed.\"\n\"Will you take a few napoleons?\"\n\"No; not a rap. Not from you. You are the first man from whom I ever refused to borrow money, and I should say that you'll be about the last to offer to lend it me.\"\n\"I don't know what else I can offer?\" said Mr. Palliser.\n\"You can offer nothing. If you will say to your wife from me that I bade her adieu;--that is all you can do for me. Good night, Mr. Palliser; good night.\"\n[Illustration: \"Good night, Mr. Palliser.\"]\nMr. Palliser left him and went his way, feeling that he had no further eloquence at his command. He shook Burgo's hand, and then walked quickly down the hill. As he did so he passed, or would have passed the man who had been dodging them.\n\"Misther, Misther!\" said the man in a whisper.\n\"What do you want of me?\" asked Mr. Palliser, in French.\nThen the man spoke in French, also. \"Has he got any money? Have you given him any money?\"\n\"I have not given him any money,\" said Mr. Palliser, not quite knowing what he had better do or say under such circumstances.\n\"Then he will have a bad time with it,\" said the man. \"And he might have carried away two thousand francs just now! Dear, dear, dear! Has he got any friends, sir?\"\n\"Yes, he has friends. I do not know that I can assist him, or you.\"\n\"Fitzgerald;--his name is Fitzgerald?\"\n\"Yes,\" said Mr. Palliser; \"his name is Fitzgerald.\"\n\"Ah! There are so many Fitzgeralds in England. Mr. Fitzgerald, London;--he has no other address?\"\n\"If he had, and I knew it, I should not give it you without his sanction.\"\n\"But what shall we do? How shall we act? Perhaps with his own hand he will himself kill. For five weeks his pension he owes; yes, for five weeks. And for wine, oh so much! There came through Baden a my lord, and then, I think he got money. But he went and played. That was of course. But; oh my G----! he might have carried away this night two thousand francs; yes, two thousand francs!\"\n\"Are you the hotelkeeper?\"\n\"His friend, sir; only his friend. That is, I am the head Commissionaire. I look after the gentlemen who sometimes are not all--not all--\" exactly what they should be, the commissioner intended to explain; and Mr. Palliser understood him although the words were not quite spoken. The interview was ended by Mr. Palliser taking the name of the hotel, and promising to call before Mr. Fitzgerald should be up in the morning--a purposed visit, which we need not regard as requiring any very early energy on Mr. Palliser's part, when we remember Burgo's own programme for the following day.\nLady Glencora received her husband that night with infinite anxiety, and was by no means satisfied with what had been done. He described to her as accurately as he could the nature of his interview with Burgo, and he described to her also his other interview with the head commissioner.\n\"He will; he will,\" said Lady Glencora; when she heard from her husband the man's surmise that perhaps he might destroy himself. \"He will; he will; and if he does, how can you expect that I shall bear it?\" Mr. Palliser tried to soothe her by telling her of his promised visit to the landlord; and Lady Glencora, accepting this as something, strove to instigate her husband to some lavish expenditure on Burgo's behalf. \"There can be no reason why he should not take it,\" said Glencora. \"None the least. Had it not been promised to him? Had he not a right to it?\" The subject was one which Mr. Palliser found it very hard to discuss. He could not tell his wife that Fitzgerald ought to accept his bounty; but he assured her that his money should be forthcoming, almost to any extent, if it could be made available.\nOn the following morning he went down to the hotel, and saw the real landlord. He found him to be a reasonable, tranquil, and very good-natured man,--who was possessed by a not irrational desire that his customers' bills should be paid; but who seemed to be much less eager on the subject than are English landlords in general. His chief anxiety seemed to arise from the great difficulty of doing anything with the gentleman who was now lying in his bed up-stairs. \"Has he had any breakfast?\" Mr. Palliser asked.\n\"Breakfast! Oh yes;\" and the landlord laughed. He had been very particular in the orders he had given. He had desired his cutlets to be dressed in a particular way,--with a great deal of cayenne pepper, and they had been so dressed. He had ordered a bottle of Sauterne; but the landlord had thought, or the head-waiter acting for him had thought, that a bottle of ordinary wine of the country would do as well. The bottle of ordinary wine of the country had just that moment been sent up-stairs.\nThen Mr. Palliser sat down in the landlord's little room, and had Burgo Fitzgerald's bill brought to him. \"I think I might venture to pay it,\" said Mr. Palliser.\n\"That was as monsieur pleased,\" said the landlord, with something like a sparkle in his eye.\nWhat was Mr. Palliser to do? He did not know whether, in accordance with the rules of the world in which he lived, he ought to pay it, or ought to leave it; and certainly the landlord could not tell him. Then he thought of his wife. He could not go back to his wife without having done something; so, as a first measure, he paid the bill. The landlord's eyes glittered, and he receipted it in the most becoming manner.\n\"Should he now send up the bottle of Sauterne?\"--but to this Mr. Palliser demurred.\n\"And to whom should the receipted bill be given?\" Mr. Palliser thought that the landlord had better keep it himself for a while.\n\"Perhaps there is some little difficulty?\" suggested the landlord.\nMr. Palliser acknowledged that there was a little difficulty. He knew that he must do something more. He could not simply pay the bill and go away. That would not satisfy his wife. He knew that he must do something more; but how was he to do it? So at last he let the landlord into his confidence. He did not tell the whole of Burgo's past history. He did not tell that little episode in Burgo's life which referred to Lady Glencora. But he did make the landlord understand that he was willing to administer money to Mr. Fitzgerald, if only it could only be administered judiciously.\n\"You can't keep him out of the gambling salon, you know, sir; that is, not if he has a franc in his pocket.\" As to that the landlord was very confident.\nIt was at last arranged, that the landlord was to tell Burgo that his bill did not signify at present, and that the use of the hotel was to be at Burgo's command for the next three months. At the end of that time he was to have notice to quit. No money was to be advanced to him;--but the landlord, even in this respect, had a discretion.\n\"When I get home, I will see what can be done with his relations there,\" said Mr. Palliser. Then he went home and told his wife.\n\"But he'll have no clothes,\" said Lady Glencora.\nMr. Palliser said that the judicious landlord would manage that also; and in that way Lady Glencora was appeased,--appeased, till something final could be done for the young man, on Mr. Palliser's return home.\nPoor Burgo! He must now be made to end his career as far as these pages are concerned. He soon found that something had been done for him at the hotel, and no doubt he must have made some guess near the truth. The discreet landlord told him nothing,--would tell him nothing; but that his bill did not signify as yet. Burgo, thinking about it, resolved to write about it in an indignant strain to Mr. Palliser; but the letter did not get itself written. When in England, Mr. Palliser saw Sir Cosmo Monk, and with many apologies, told him what he had done.\n\"I regret it,\" said Sir Cosmo, in anger. \"I regret it; not for the money's sake, but I regret it.\" The amount expended, was however repaid to Mr. Palliser, and an arrangement was made for remitting a weekly sum of fifteen pounds to Burgo, through a member of the diplomatic corps, as long as he should remain at a certain small German town which was indicated, and in which there was no public gambling-table. Lady Glencora expressed herself satisfied for the present; but I must doubt whether poor Burgo lived long in comfort on the allowance made to him.\nHere we must say farewell to Burgo Fitzgerald.",
        "paragraph_chars": [
            [
                0,
                304
            ],
            [
                304,
                450
            ],
            [
                450,
                610
            ],
            [
                610,
                799
            ],
            [
                799,
                899
            ],
            [
                899,
                918
            ],
            [
                918,
                1098
            ],
            [
                1098,
                1482
            ],
            [
                1482,
                1637
            ],
            [
                1637,
                1692
            ],
            [
                1692,
                1797
            ],
            [
                1797,
                1917
            ],
            [
                1917,
                1938
            ],
            [
                1938,
                2260
            ],
            [
                2260,
                2817
            ],
            [
                2817,
                2943
            ],
            [
                2943,
                3142
            ],
            [
                3142,
                3296
            ],
            [
                3296,
                3351
            ],
            [
                3351,
                3463
            ],
            [
                3463,
                3619
            ],
            [
                3619,
                3746
            ],
            [
                3746,
                4098
            ],
            [
                4098,
                4153
            ],
            [
                4153,
                4414
            ],
            [
                4414,
                4460
            ],
            [
                4460,
                4765
            ],
            [
                4765,
                4861
            ],
            [
                4861,
                4941
            ],
            [
                4941,
                5126
            ],
            [
                5126,
                5248
            ],
            [
                5248,
                5294
            ],
            [
                5294,
                5477
            ],
            [
                5477,
                5755
            ],
            [
                5755,
                5836
            ],
            [
                5836,
                6089
            ],
            [
                6089,
                6142
            ],
            [
                6142,
                6507
            ],
            [
                6507,
                6539
            ],
            [
                6539,
                6955
            ],
            [
                6955,
                7032
            ],
            [
                7032,
                7197
            ],
            [
                7197,
                7554
            ],
            [
                7554,
                7669
            ],
            [
                7669,
                7778
            ],
            [
                7778,
                7922
            ],
            [
                7922,
                7959
            ],
            [
                7959,
                8171
            ],
            [
                8171,
                8228
            ],
            [
                8228,
                8258
            ],
            [
                8258,
                8364
            ],
            [
                8364,
                8460
            ],
            [
                8460,
                8483
            ],
            [
                8483,
                8512
            ],
            [
                8512,
                8716
            ],
            [
                8716,
                8758
            ],
            [
                8758,
                8965
            ],
            [
                8965,
                8998
            ],
            [
                8998,
                9164
            ],
            [
                9164,
                9221
            ],
            [
                9221,
                9376
            ],
            [
                9376,
                9420
            ],
            [
                9420,
                9659
            ],
            [
                9659,
                9706
            ],
            [
                9706,
                9763
            ],
            [
                9763,
                9853
            ],
            [
                9853,
                9979
            ],
            [
                9979,
                10143
            ],
            [
                10143,
                10211
            ],
            [
                10211,
                10250
            ],
            [
                10250,
                10302
            ],
            [
                10302,
                10400
            ],
            [
                10400,
                10475
            ],
            [
                10475,
                10863
            ],
            [
                10863,
                10890
            ],
            [
                10890,
                11477
            ],
            [
                11477,
                11764
            ],
            [
                11764,
                12578
            ],
            [
                12578,
                13091
            ],
            [
                13091,
                13587
            ],
            [
                13587,
                13749
            ],
            [
                13749,
                13842
            ],
            [
                13842,
                14261
            ],
            [
                14261,
                14345
            ],
            [
                14345,
                14474
            ],
            [
                14474,
                14541
            ],
            [
                14541,
                15125
            ],
            [
                15125,
                15278
            ],
            [
                15278,
                15617
            ],
            [
                15617,
                15746
            ],
            [
                15746,
                15795
            ],
            [
                15795,
                16005
            ],
            [
                16005,
                16560
            ],
            [
                16560,
                17117
            ],
            [
                17117,
                17163
            ]
        ],
        "segment_chars": [
            [
                0,
                112
            ],
            [
                112,
                186
            ],
            [
                186,
                304
            ],
            [
                304,
                319
            ],
            [
                319,
                450
            ],
            [
                450,
                588
            ],
            [
                588,
                610
            ],
            [
                610,
                634
            ],
            [
                634,
                713
            ],
            [
                713,
                726
            ],
            [
                726,
                754
            ],
            [
                754,
                799
            ],
            [
                799,
                843
            ],
            [
                843,
                899
            ],
            [
                899,
                918
            ],
            [
                918,
                938
            ],
            [
                938,
                996
            ],
            [
                996,
                1069
            ],
            [
                1069,
                1098
            ],
            [
                1098,
                1182
            ],
            [
                1182,
                1229
            ],
            [
                1229,
                1299
            ],
            [
                1299,
                1482
            ],
            [
                1482,
                1555
            ],
            [
                1555,
                1637
            ],
            [
                1637,
                1692
            ],
            [
                1692,
                1717
            ],
            [
                1717,
                1729
            ],
            [
                1729,
                1765
            ],
            [
                1765,
                1797
            ],
            [
                1797,
                1917
            ],
            [
                1917,
                1938
            ],
            [
                1938,
                1948
            ],
            [
                1948,
                2260
            ],
            [
                2260,
                2333
            ],
            [
                2333,
                2456
            ],
            [
                2456,
                2572
            ],
            [
                2572,
                2790
            ],
            [
                2790,
                2817
            ],
            [
                2817,
                2943
            ],
            [
                2943,
                3142
            ],
            [
                3142,
                3191
            ],
            [
                3191,
                3264
            ],
            [
                3264,
                3296
            ],
            [
                3296,
                3351
            ],
            [
                3351,
                3463
            ],
            [
                3463,
                3534
            ],
            [
                3534,
                3619
            ],
            [
                3619,
                3715
            ],
            [
                3715,
                3746
            ],
            [
                3746,
                3772
            ],
            [
                3772,
                3781
            ],
            [
                3781,
                3857
            ],
            [
                3857,
                3872
            ],
            [
                3872,
                3976
            ],
            [
                3976,
                4098
            ],
            [
                4098,
                4153
            ],
            [
                4153,
                4215
            ],
            [
                4215,
                4257
            ],
            [
                4257,
                4301
            ],
            [
                4301,
                4325
            ],
            [
                4325,
                4414
            ],
            [
                4414,
                4460
            ],
            [
                4460,
                4529
            ],
            [
                4529,
                4621
            ],
            [
                4621,
                4719
            ],
            [
                4719,
                4765
            ],
            [
                4765,
                4770
            ],
            [
                4770,
                4821
            ],
            [
                4821,
                4861
            ],
            [
                4861,
                4902
            ],
            [
                4902,
                4941
            ],
            [
                4941,
                5126
            ],
            [
                5126,
                5248
            ],
            [
                5248,
                5276
            ],
            [
                5276,
                5294
            ],
            [
                5294,
                5313
            ],
            [
                5313,
                5377
            ],
            [
                5377,
                5477
            ],
            [
                5477,
                5610
            ],
            [
                5610,
                5755
            ],
            [
                5755,
                5836
            ],
            [
                5836,
                6019
            ],
            [
                6019,
                6089
            ],
            [
                6089,
                6142
            ],
            [
                6142,
                6157
            ],
            [
                6157,
                6167
            ],
            [
                6167,
                6172
            ],
            [
                6172,
                6250
            ],
            [
                6250,
                6280
            ],
            [
                6280,
                6297
            ],
            [
                6297,
                6312
            ],
            [
                6312,
                6361
            ],
            [
                6361,
                6397
            ],
            [
                6397,
                6426
            ],
            [
                6426,
                6486
            ],
            [
                6486,
                6507
            ],
            [
                6507,
                6539
            ],
            [
                6539,
                6573
            ],
            [
                6573,
                6628
            ],
            [
                6628,
                6681
            ],
            [
                6681,
                6754
            ],
            [
                6754,
                6784
            ],
            [
                6784,
                6837
            ],
            [
                6837,
                6955
            ],
            [
                6955,
                7032
            ],
            [
                7032,
                7077
            ],
            [
                7077,
                7197
            ],
            [
                7197,
                7385
            ],
            [
                7385,
                7554
            ],
            [
                7554,
                7669
            ],
            [
                7669,
                7700
            ],
            [
                7700,
                7778
            ],
            [
                7778,
                7803
            ],
            [
                7803,
                7886
            ],
            [
                7886,
                7922
            ],
            [
                7922,
                7959
            ],
            [
                7959,
                7999
            ],
            [
                7999,
                8044
            ],
            [
                8044,
                8171
            ],
            [
                8171,
                8201
            ],
            [
                8201,
                8228
            ],
            [
                8228,
                8258
            ],
            [
                8258,
                8305
            ],
            [
                8305,
                8311
            ],
            [
                8311,
                8364
            ],
            [
                8364,
                8425
            ],
            [
                8425,
                8460
            ],
            [
                8460,
                8483
            ],
            [
                8483,
                8512
            ],
            [
                8512,
                8529
            ],
            [
                8529,
                8533
            ],
            [
                8533,
                8554
            ],
            [
                8554,
                8583
            ],
            [
                8583,
                8657
            ],
            [
                8657,
                8716
            ],
            [
                8716,
                8758
            ],
            [
                8758,
                8793
            ],
            [
                8793,
                8867
            ],
            [
                8867,
                8918
            ],
            [
                8918,
                8965
            ],
            [
                8965,
                8998
            ],
            [
                8998,
                9014
            ],
            [
                9014,
                9028
            ],
            [
                9028,
                9164
            ],
            [
                9164,
                9202
            ],
            [
                9202,
                9221
            ],
            [
                9221,
                9245
            ],
            [
                9245,
                9337
            ],
            [
                9337,
                9376
            ],
            [
                9376,
                9420
            ],
            [
                9420,
                9517
            ],
            [
                9517,
                9579
            ],
            [
                9579,
                9659
            ],
            [
                9659,
                9679
            ],
            [
                9679,
                9706
            ],
            [
                9706,
                9732
            ],
            [
                9732,
                9763
            ],
            [
                9763,
                9799
            ],
            [
                9799,
                9822
            ],
            [
                9822,
                9853
            ],
            [
                9853,
                9979
            ],
            [
                9979,
                10033
            ],
            [
                10033,
                10095
            ],
            [
                10095,
                10113
            ],
            [
                10113,
                10143
            ],
            [
                10143,
                10165
            ],
            [
                10165,
                10211
            ],
            [
                10211,
                10250
            ],
            [
                10250,
                10302
            ],
            [
                10302,
                10307
            ],
            [
                10307,
                10349
            ],
            [
                10349,
                10400
            ],
            [
                10400,
                10475
            ],
            [
                10475,
                10498
            ],
            [
                10498,
                10516
            ],
            [
                10516,
                10564
            ],
            [
                10564,
                10621
            ],
            [
                10621,
                10647
            ],
            [
                10647,
                10715
            ],
            [
                10715,
                10739
            ],
            [
                10739,
                10759
            ],
            [
                10759,
                10777
            ],
            [
                10777,
                10863
            ],
            [
                10863,
                10890
            ],
            [
                10890,
                10925
            ],
            [
                10925,
                10964
            ],
            [
                10964,
                11170
            ],
            [
                11170,
                11477
            ],
            [
                11477,
                11601
            ],
            [
                11601,
                11764
            ],
            [
                11764,
                11893
            ],
            [
                11893,
                11970
            ],
            [
                11970,
                12183
            ],
            [
                12183,
                12250
            ],
            [
                12250,
                12267
            ],
            [
                12267,
                12300
            ],
            [
                12300,
                12327
            ],
            [
                12327,
                12397
            ],
            [
                12397,
                12578
            ],
            [
                12578,
                12657
            ],
            [
                12657,
                12906
            ],
            [
                12906,
                13043
            ],
            [
                13043,
                13071
            ],
            [
                13071,
                13091
            ],
            [
                13091,
                13103
            ],
            [
                13103,
                13138
            ],
            [
                13138,
                13194
            ],
            [
                13194,
                13324
            ],
            [
                13324,
                13502
            ],
            [
                13502,
                13587
            ],
            [
                13587,
                13693
            ],
            [
                13693,
                13749
            ],
            [
                13749,
                13842
            ],
            [
                13842,
                13871
            ],
            [
                13871,
                14046
            ],
            [
                14046,
                14075
            ],
            [
                14075,
                14181
            ],
            [
                14181,
                14261
            ],
            [
                14261,
                14308
            ],
            [
                14308,
                14345
            ],
            [
                14345,
                14395
            ],
            [
                14395,
                14474
            ],
            [
                14474,
                14517
            ],
            [
                14517,
                14541
            ],
            [
                14541,
                14603
            ],
            [
                14603,
                14643
            ],
            [
                14643,
                14689
            ],
            [
                14689,
                14722
            ],
            [
                14722,
                14787
            ],
            [
                14787,
                14839
            ],
            [
                14839,
                14890
            ],
            [
                14890,
                14975
            ],
            [
                14975,
                15125
            ],
            [
                15125,
                15234
            ],
            [
                15234,
                15278
            ],
            [
                15278,
                15467
            ],
            [
                15467,
                15522
            ],
            [
                15522,
                15617
            ],
            [
                15617,
                15709
            ],
            [
                15709,
                15746
            ],
            [
                15746,
                15795
            ],
            [
                15795,
                16005
            ],
            [
                16005,
                16017
            ],
            [
                16017,
                16092
            ],
            [
                16092,
                16215
            ],
            [
                16215,
                16322
            ],
            [
                16322,
                16458
            ],
            [
                16458,
                16560
            ],
            [
                16560,
                16601
            ],
            [
                16601,
                16659
            ],
            [
                16659,
                16970
            ],
            [
                16970,
                17117
            ],
            [
                17117,
                17163
            ]
        ],
        "overlap_chars": [
            [
                0,
                112
            ],
            [
                112,
                125
            ],
            [
                137,
                185
            ],
            [
                304,
                319
            ],
            [
                319,
                323
            ],
            [
                448,
                450
            ],
            [
                450,
                560
            ],
            [
                570,
                588
            ],
            [
                588,
                610
            ],
            [
                610,
                634
            ],
            [
                634,
                653
            ],
            [
                660,
                666
            ],
            [
                672,
                713
            ],
            [
                713,
                726
            ],
            [
                726,
                754
            ],
            [
                754,
                790
            ],
            [
                796,
                799
            ],
            [
                799,
                843
            ],
            [
                843,
                899
            ],
            [
                899,
                918
            ],
            [
                918,
                922
            ],
            [
                936,
                938
            ],
            [
                938,
                996
            ],
            [
                996,
                1069
            ],
            [
                1069,
                1098
            ],
            [
                1098,
                1110
            ],
            [
                1140,
                1182
            ],
            [
                1229,
                1299
            ],
            [
                1299,
                1339
            ],
            [
                1347,
                1467
            ],
            [
                1472,
                1482
            ],
            [
                1482,
                1489
            ],
            [
                1512,
                1518
            ],
            [
                1525,
                1555
            ],
            [
                1555,
                1637
            ],
            [
                1637,
                1692
            ],
            [
                1692,
                1693
            ],
            [
                1709,
                1717
            ],
            [
                1717,
                1729
            ],
            [
                1729,
                1763
            ],
            [
                1797,
                1832
            ],
            [
                1835,
                1871
            ],
            [
                1873,
                1917
            ],
            [
                1917,
                1938
            ],
            [
                1938,
                1948
            ],
            [
                2127,
                2249
            ],
            [
                2257,
                2260
            ],
            [
                2260,
                2333
            ],
            [
                2333,
                2421
            ],
            [
                2422,
                2456
            ],
            [
                2456,
                2519
            ],
            [
                2528,
                2571
            ],
            [
                2817,
                2819
            ],
            [
                2824,
                2827
            ],
            [
                2850,
                2943
            ],
            [
                2943,
                3072
            ],
            [
                3140,
                3142
            ],
            [
                3142,
                3191
            ],
            [
                3191,
                3264
            ],
            [
                3264,
                3296
            ],
            [
                3296,
                3351
            ],
            [
                3351,
                3463
            ],
            [
                3463,
                3474
            ],
            [
                3478,
                3534
            ],
            [
                3534,
                3619
            ],
            [
                3619,
                3678
            ],
            [
                3696,
                3715
            ],
            [
                3715,
                3746
            ],
            [
                3746,
                3772
            ],
            [
                3772,
                3781
            ],
            [
                3872,
                3962
            ],
            [
                3974,
                3976
            ],
            [
                3976,
                4057
            ],
            [
                4078,
                4087
            ],
            [
                4095,
                4098
            ],
            [
                4098,
                4153
            ],
            [
                4215,
                4230
            ],
            [
                4237,
                4257
            ],
            [
                4257,
                4301
            ],
            [
                4325,
                4369
            ],
            [
                4372,
                4395
            ],
            [
                4402,
                4405
            ],
            [
                4411,
                4414
            ],
            [
                4414,
                4460
            ],
            [
                4460,
                4528
            ],
            [
                4529,
                4572
            ],
            [
                4663,
                4666
            ],
            [
                4621,
                4626
            ],
            [
                4645,
                4661
            ],
            [
                4619,
                4620
            ],
            [
                4677,
                4691
            ],
            [
                4594,
                4596
            ],
            [
                4700,
                4712
            ],
            [
                4717,
                4719
            ],
            [
                4719,
                4733
            ],
            [
                4739,
                4765
            ],
            [
                4765,
                4770
            ],
            [
                4770,
                4794
            ],
            [
                4805,
                4821
            ],
            [
                4821,
                4861
            ],
            [
                4861,
                4902
            ],
            [
                4902,
                4906
            ],
            [
                4930,
                4941
            ],
            [
                4941,
                4984
            ],
            [
                4998,
                5051
            ],
            [
                5063,
                5126
            ],
            [
                5126,
                5180
            ],
            [
                5205,
                5217
            ],
            [
                5237,
                5248
            ],
            [
                5248,
                5276
            ],
            [
                5276,
                5294
            ],
            [
                5294,
                5298
            ],
            [
                5311,
                5313
            ],
            [
                5313,
                5351
            ],
            [
                5382,
                5424
            ],
            [
                5475,
                5477
            ],
            [
                5477,
                5487
            ],
            [
                5493,
                5610
            ],
            [
                5610,
                5692
            ],
            [
                5696,
                5755
            ],
            [
                5755,
                5836
            ],
            [
                5836,
                5928
            ],
            [
                5991,
                6017
            ],
            [
                6019,
                6055
            ],
            [
                6070,
                6089
            ],
            [
                6089,
                6142
            ],
            [
                6142,
                6157
            ],
            [
                6157,
                6161
            ],
            [
                6165,
                6167
            ],
            [
                6167,
                6172
            ],
            [
                6250,
                6280
            ],
            [
                6280,
                6297
            ],
            [
                6297,
                6312
            ],
            [
                6321,
                6322
            ],
            [
                6328,
                6339
            ],
            [
                6348,
                6361
            ],
            [
                6361,
                6397
            ],
            [
                6397,
                6426
            ],
            [
                6426,
                6486
            ],
            [
                6486,
                6507
            ],
            [
                6507,
                6539
            ],
            [
                6539,
                6573
            ],
            [
                6573,
                6628
            ],
            [
                6628,
                6681
            ],
            [
                6784,
                6812
            ],
            [
                6819,
                6837
            ],
            [
                6837,
                6955
            ],
            [
                6955,
                7032
            ],
            [
                7077,
                7197
            ],
            [
                7487,
                7554
            ],
            [
                7999,
                8044
            ],
            [
                8044,
                8070
            ],
            [
                8072,
                8143
            ],
            [
                8168,
                8171
            ],
            [
                8171,
                8201
            ],
            [
                8201,
                8228
            ],
            [
                8228,
                8258
            ],
            [
                8258,
                8262
            ],
            [
                8264,
                8277
            ],
            [
                8285,
                8305
            ],
            [
                8305,
                8311
            ],
            [
                8311,
                8364
            ],
            [
                8364,
                8413
            ],
            [
                8460,
                8483
            ],
            [
                8483,
                8484
            ],
            [
                8505,
                8509
            ],
            [
                8488,
                8504
            ],
            [
                8509,
                8512
            ],
            [
                8529,
                8533
            ],
            [
                8533,
                8554
            ],
            [
                8554,
                8566
            ],
            [
                8716,
                8744
            ],
            [
                8755,
                8758
            ],
            [
                8758,
                8791
            ],
            [
                8793,
                8867
            ],
            [
                8918,
                8955
            ],
            [
                8956,
                8965
            ],
            [
                8965,
                8998
            ],
            [
                8998,
                9002
            ],
            [
                9014,
                9028
            ],
            [
                9028,
                9090
            ],
            [
                9161,
                9164
            ],
            [
                9164,
                9165
            ],
            [
                9178,
                9187
            ],
            [
                9190,
                9193
            ],
            [
                9165,
                9166
            ],
            [
                9194,
                9202
            ],
            [
                9202,
                9221
            ],
            [
                9221,
                9245
            ],
            [
                9257,
                9304
            ],
            [
                9306,
                9337
            ],
            [
                9337,
                9361
            ],
            [
                9373,
                9376
            ],
            [
                9420,
                9432
            ],
            [
                9520,
                9579
            ],
            [
                9579,
                9594
            ],
            [
                9617,
                9659
            ],
            [
                9659,
                9679
            ],
            [
                9684,
                9691
            ],
            [
                9704,
                9706
            ],
            [
                9706,
                9732
            ],
            [
                9732,
                9763
            ],
            [
                9768,
                9775
            ],
            [
                9782,
                9791
            ],
            [
                9797,
                9799
            ],
            [
                9822,
                9853
            ],
            [
                9853,
                9864
            ],
            [
                9884,
                9952
            ],
            [
                9977,
                9979
            ],
            [
                9979,
                10008
            ],
            [
                10014,
                10033
            ],
            [
                10033,
                10095
            ],
            [
                10095,
                10113
            ],
            [
                10113,
                10143
            ],
            [
                10143,
                10163
            ],
            [
                10475,
                10498
            ],
            [
                10516,
                10549
            ],
            [
                10558,
                10562
            ],
            [
                10550,
                10557
            ],
            [
                10562,
                10564
            ],
            [
                10564,
                10578
            ],
            [
                10591,
                10599
            ],
            [
                10621,
                10647
            ],
            [
                10647,
                10673
            ],
            [
                10677,
                10691
            ],
            [
                10693,
                10715
            ],
            [
                10715,
                10737
            ],
            [
                10863,
                10890
            ],
            [
                10934,
                10964
            ],
            [
                10964,
                11016
            ],
            [
                11018,
                11025
            ],
            [
                11029,
                11057
            ],
            [
                11075,
                11127
            ],
            [
                11168,
                11170
            ],
            [
                11170,
                11183
            ],
            [
                11188,
                11193
            ],
            [
                11197,
                11311
            ],
            [
                11475,
                11477
            ],
            [
                11477,
                11601
            ],
            [
                11601,
                11646
            ],
            [
                11661,
                11690
            ],
            [
                11711,
                11764
            ],
            [
                11764,
                11818
            ],
            [
                11836,
                11845
            ],
            [
                11854,
                11858
            ],
            [
                11870,
                11893
            ],
            [
                11893,
                11894
            ],
            [
                11912,
                11931
            ],
            [
                11954,
                11959
            ],
            [
                11952,
                11953
            ],
            [
                11960,
                11969
            ],
            [
                11970,
                12024
            ],
            [
                12040,
                12042
            ],
            [
                12034,
                12039
            ],
            [
                12043,
                12090
            ],
            [
                12103,
                12114
            ],
            [
                12125,
                12139
            ],
            [
                12164,
                12183
            ],
            [
                12472,
                12524
            ],
            [
                12547,
                12549
            ],
            [
                12576,
                12578
            ],
            [
                12578,
                12641
            ],
            [
                12647,
                12657
            ],
            [
                12657,
                12699
            ],
            [
                12709,
                12726
            ],
            [
                12910,
                13031
            ],
            [
                12904,
                12905
            ],
            [
                13043,
                13071
            ],
            [
                13071,
                13091
            ],
            [
                13103,
                13138
            ],
            [
                13197,
                13255
            ],
            [
                13257,
                13261
            ],
            [
                13278,
                13297
            ],
            [
                13327,
                13389
            ],
            [
                13438,
                13442
            ],
            [
                13455,
                13468
            ],
            [
                13484,
                13502
            ],
            [
                13545,
                13575
            ],
            [
                13585,
                13587
            ],
            [
                13587,
                13693
            ],
            [
                13693,
                13729
            ],
            [
                13730,
                13734
            ],
            [
                13747,
                13749
            ],
            [
                13749,
                13750
            ],
            [
                13759,
                13770
            ],
            [
                13778,
                13799
            ],
            [
                13800,
                13804
            ],
            [
                13820,
                13842
            ],
            [
                13853,
                13863
            ],
            [
                13874,
                13898
            ],
            [
                13915,
                13918
            ],
            [
                13925,
                13937
            ],
            [
                13955,
                13979
            ],
            [
                13989,
                13997
            ],
            [
                14044,
                14046
            ],
            [
                14046,
                14075
            ],
            [
                14075,
                14098
            ],
            [
                14108,
                14141
            ],
            [
                14163,
                14180
            ],
            [
                14345,
                14376
            ],
            [
                14384,
                14394
            ],
            [
                14395,
                14473
            ],
            [
                14603,
                14643
            ],
            [
                14643,
                14689
            ],
            [
                14689,
                14721
            ],
            [
                14790,
                14839
            ],
            [
                14839,
                14888
            ],
            [
                14906,
                14910
            ],
            [
                14942,
                14975
            ],
            [
                14975,
                15037
            ],
            [
                15049,
                15090
            ],
            [
                15096,
                15098
            ],
            [
                15112,
                15125
            ],
            [
                15125,
                15185
            ],
            [
                15194,
                15195
            ],
            [
                15200,
                15231
            ],
            [
                15245,
                15257
            ],
            [
                15276,
                15278
            ],
            [
                15278,
                15301
            ],
            [
                15303,
                15423
            ],
            [
                15432,
                15467
            ],
            [
                15467,
                15522
            ],
            [
                15522,
                15557
            ],
            [
                15559,
                15602
            ],
            [
                15605,
                15617
            ],
            [
                15617,
                15709
            ],
            [
                15709,
                15746
            ],
            [
                15746,
                15795
            ],
            [
                15795,
                15908
            ],
            [
                15920,
                15934
            ],
            [
                15941,
                15972
            ],
            [
                15974,
                16005
            ],
            [
                16005,
                16017
            ],
            [
                16017,
                16092
            ],
            [
                16215,
                16236
            ],
            [
                16256,
                16278
            ],
            [
                16280,
                16313
            ],
            [
                16317,
                16320
            ],
            [
                16155,
                16156
            ],
            [
                16161,
                16169
            ],
            [
                16173,
                16182
            ],
            [
                16204,
                16214
            ],
            [
                16348,
                16365
            ],
            [
                16378,
                16390
            ],
            [
                16398,
                16441
            ],
            [
                16449,
                16457
            ],
            [
                16458,
                16560
            ],
            [
                16560,
                16599
            ],
            [
                16599,
                16601
            ],
            [
                16659,
                16678
            ],
            [
                16680,
                16683
            ],
            [
                16678,
                16679
            ],
            [
                16684,
                16691
            ],
            [
                16797,
                16798
            ],
            [
                16692,
                16747
            ],
            [
                16758,
                16797
            ],
            [
                16839,
                16899
            ],
            [
                16925,
                16946
            ],
            [
                16954,
                16969
            ],
            [
                17117,
                17145
            ],
            [
                17054,
                17058
            ],
            [
                17146,
                17162
            ],
            [
                17027,
                17028
            ],
            [
                17033,
                17034
            ],
            [
                17040,
                17053
            ],
            [
                17065,
                17089
            ],
            [
                17094,
                17103
            ],
            [
                17115,
                17116
            ]
        ],
        "row_chars": [
            [
                0,
                112
            ],
            [
                112,
                186
            ],
            [
                186,
                304
            ],
            [
                304,
                319
            ],
            [
                319,
                450
            ],
            [
                450,
                588
            ],
            [
                588,
                610
            ],
            [
                610,
                634
            ],
            [
                634,
                713
            ],
            [
                713,
                726
            ],
            [
                726,
                754
            ],
            [
                754,
                799
            ],
            [
                799,
                843
            ],
            [
                843,
                899
            ],
            [
                899,
                918
            ],
            [
                918,
                938
            ],
            [
                938,
                996
            ],
            [
                996,
                1069
            ],
            [
                1069,
                1098
            ],
            [
                1098,
                1182
            ],
            [
                1182,
                1229
            ],
            [
                1229,
                1299
            ],
            [
                1299,
                1482
            ],
            [
                1482,
                1555
            ],
            [
                1555,
                1637
            ],
            [
                1637,
                1692
            ],
            [
                1692,
                1717
            ],
            [
                1717,
                1729
            ],
            [
                1729,
                1765
            ],
            [
                1765,
                1797
            ],
            [
                1797,
                1917
            ],
            [
                1917,
                1938
            ],
            [
                1938,
                1948
            ],
            [
                1948,
                2260
            ],
            [
                2260,
                2333
            ],
            [
                2333,
                2456
            ],
            [
                2456,
                2572
            ],
            [
                2572,
                2790
            ],
            [
                2790,
                2817
            ],
            [
                2817,
                2943
            ],
            [
                2943,
                3142
            ],
            [
                3142,
                3191
            ],
            [
                3191,
                3264
            ],
            [
                3264,
                3296
            ],
            [
                3296,
                3351
            ],
            [
                3351,
                3463
            ],
            [
                3463,
                3534
            ],
            [
                3534,
                3619
            ],
            [
                3619,
                3715
            ],
            [
                3715,
                3746
            ],
            [
                3746,
                3772
            ],
            [
                3772,
                3781
            ],
            [
                3781,
                3857
            ],
            [
                3857,
                3872
            ],
            [
                3872,
                3976
            ],
            [
                3976,
                4098
            ],
            [
                4098,
                4153
            ],
            [
                4153,
                4215
            ],
            [
                4215,
                4257
            ],
            [
                4257,
                4301
            ],
            [
                4301,
                4325
            ],
            [
                4325,
                4414
            ],
            [
                4414,
                4460
            ],
            [
                4460,
                4529
            ],
            [
                4529,
                4719
            ],
            [
                4719,
                4765
            ],
            [
                4765,
                4770
            ],
            [
                4770,
                4821
            ],
            [
                4821,
                4861
            ],
            [
                4861,
                4902
            ],
            [
                4902,
                4941
            ],
            [
                4941,
                5126
            ],
            [
                5126,
                5248
            ],
            [
                5248,
                5276
            ],
            [
                5276,
                5294
            ],
            [
                5294,
                5313
            ],
            [
                5313,
                5377
            ],
            [
                5377,
                5477
            ],
            [
                5477,
                5610
            ],
            [
                5610,
                5755
            ],
            [
                5755,
                5836
            ],
            [
                5836,
                6019
            ],
            [
                6019,
                6089
            ],
            [
                6089,
                6142
            ],
            [
                6142,
                6157
            ],
            [
                6157,
                6167
            ],
            [
                6167,
                6172
            ],
            [
                6172,
                6250
            ],
            [
                6250,
                6280
            ],
            [
                6280,
                6297
            ],
            [
                6297,
                6312
            ],
            [
                6312,
                6361
            ],
            [
                6361,
                6397
            ],
            [
                6397,
                6426
            ],
            [
                6426,
                6486
            ],
            [
                6486,
                6507
            ],
            [
                6507,
                6539
            ],
            [
                6539,
                6573
            ],
            [
                6573,
                6628
            ],
            [
                6628,
                6681
            ],
            [
                6681,
                6754
            ],
            [
                6754,
                6784
            ],
            [
                6784,
                6837
            ],
            [
                6837,
                6955
            ],
            [
                6955,
                7032
            ],
            [
                7032,
                7077
            ],
            [
                7077,
                7197
            ],
            [
                7197,
                7385
            ],
            [
                7385,
                7554
            ],
            [
                7554,
                7669
            ],
            [
                7669,
                7700
            ],
            [
                7700,
                7778
            ],
            [
                7778,
                7803
            ],
            [
                7803,
                7886
            ],
            [
                7886,
                7922
            ],
            [
                7922,
                7959
            ],
            [
                7959,
                7999
            ],
            [
                7999,
                8044
            ],
            [
                8044,
                8171
            ],
            [
                8171,
                8201
            ],
            [
                8201,
                8228
            ],
            [
                8228,
                8258
            ],
            [
                8258,
                8305
            ],
            [
                8305,
                8311
            ],
            [
                8311,
                8364
            ],
            [
                8364,
                8425
            ],
            [
                8425,
                8460
            ],
            [
                8460,
                8483
            ],
            [
                8483,
                8512
            ],
            [
                8512,
                8529
            ],
            [
                8529,
                8533
            ],
            [
                8533,
                8554
            ],
            [
                8554,
                8583
            ],
            [
                8583,
                8657
            ],
            [
                8657,
                8716
            ],
            [
                8716,
                8758
            ],
            [
                8758,
                8793
            ],
            [
                8793,
                8867
            ],
            [
                8867,
                8918
            ],
            [
                8918,
                8965
            ],
            [
                8965,
                8998
            ],
            [
                8998,
                9028
            ],
            [
                9028,
                9164
            ],
            [
                9164,
                9202
            ],
            [
                9202,
                9221
            ],
            [
                9221,
                9245
            ],
            [
                9245,
                9337
            ],
            [
                9337,
                9376
            ],
            [
                9376,
                9420
            ],
            [
                9420,
                9579
            ],
            [
                9579,
                9659
            ],
            [
                9659,
                9679
            ],
            [
                9679,
                9706
            ],
            [
                9706,
                9732
            ],
            [
                9732,
                9763
            ],
            [
                9763,
                9799
            ],
            [
                9799,
                9822
            ],
            [
                9822,
                9853
            ],
            [
                9853,
                9979
            ],
            [
                9979,
                10033
            ],
            [
                10033,
                10095
            ],
            [
                10095,
                10113
            ],
            [
                10113,
                10143
            ],
            [
                10143,
                10165
            ],
            [
                10165,
                10211
            ],
            [
                10211,
                10250
            ],
            [
                10250,
                10302
            ],
            [
                10302,
                10307
            ],
            [
                10307,
                10349
            ],
            [
                10349,
                10400
            ],
            [
                10400,
                10475
            ],
            [
                10475,
                10498
            ],
            [
                10498,
                10516
            ],
            [
                10516,
                10564
            ],
            [
                10564,
                10647
            ],
            [
                10647,
                10715
            ],
            [
                10715,
                10739
            ],
            [
                10739,
                10759
            ],
            [
                10759,
                10777
            ],
            [
                10777,
                10863
            ],
            [
                10863,
                10890
            ],
            [
                10890,
                10925
            ],
            [
                10925,
                10964
            ],
            [
                10964,
                11170
            ],
            [
                11170,
                11477
            ],
            [
                11477,
                11601
            ],
            [
                11601,
                11764
            ],
            [
                11764,
                11893
            ],
            [
                11893,
                11970
            ],
            [
                11970,
                12183
            ],
            [
                12183,
                12250
            ],
            [
                12250,
                12267
            ],
            [
                12267,
                12300
            ],
            [
                12300,
                12327
            ],
            [
                12327,
                12397
            ],
            [
                12397,
                12578
            ],
            [
                12578,
                12657
            ],
            [
                12657,
                13043
            ],
            [
                13043,
                13071
            ],
            [
                13071,
                13091
            ],
            [
                13091,
                13103
            ],
            [
                13103,
                13138
            ],
            [
                13138,
                13194
            ],
            [
                13194,
                13502
            ],
            [
                13502,
                13587
            ],
            [
                13587,
                13693
            ],
            [
                13693,
                13749
            ],
            [
                13749,
                13842
            ],
            [
                13842,
                14046
            ],
            [
                14046,
                14075
            ],
            [
                14075,
                14181
            ],
            [
                14181,
                14261
            ],
            [
                14261,
                14308
            ],
            [
                14308,
                14345
            ],
            [
                14345,
                14395
            ],
            [
                14395,
                14474
            ],
            [
                14474,
                14517
            ],
            [
                14517,
                14541
            ],
            [
                14541,
                14603
            ],
            [
                14603,
                14643
            ],
            [
                14643,
                14689
            ],
            [
                14689,
                14722
            ],
            [
                14722,
                14787
            ],
            [
                14787,
                14839
            ],
            [
                14839,
                14975
            ],
            [
                14975,
                15125
            ],
            [
                15125,
                15278
            ],
            [
                15278,
                15467
            ],
            [
                15467,
                15522
            ],
            [
                15522,
                15617
            ],
            [
                15617,
                15709
            ],
            [
                15709,
                15746
            ],
            [
                15746,
                15795
            ],
            [
                15795,
                16005
            ],
            [
                16005,
                16017
            ],
            [
                16017,
                16092
            ],
            [
                16092,
                16322
            ],
            [
                16322,
                16458
            ],
            [
                16458,
                16560
            ],
            [
                16560,
                16601
            ],
            [
                16601,
                16659
            ],
            [
                16659,
                16970
            ],
            [
                16970,
                17163
            ]
        ]
    },
    "abridged": {
        "text": "\"You are in trouble, Mr. Fitzgerald, I fear,\" said Mr. Palliser, standing over Burgo as he lay upon the ground. They were now beyond the gas-lights, and the evening was dark.\n\"Who is that?\" said Burgo.\n\"Perhaps I have been wrong in following you,\" said Mr. Palliser, \"but I thought you were in distress, and that I might help you. My name is Palliser.\"\n\"Plantagenet Palliser?\" said Burgo, jumping to his feet and looking close into the other's face. \"By heavens! it is Plantagenet Palliser! Well, Mr. Palliser, what do you want?\"\n\"I want to be of some use to you, if I can. I and my wife saw you leave the gaming-table just now.\"\n\"Is she here too?\"\n\"Yes. We are going home, but chance brought us up to the salon. She seemed to think that you are in distress, and that I could help you. I will, if you will let me.\"\nMr. Palliser felt that he could afford to be generous. He had no lingering dread of this poor creature who stood before him. All that feeling was over, though it was hardly four months since he had been sent back by Mrs. Marsham to Lady Monk's house to save his wife, if saving her were possible.\n\"So she saw me when I staked my last chance? I should have had over twenty thousand francs now, if the cards had stood to me.\"\n\"The cards never do stand to any one, Mr. Fitzgerald.\"\n\"Never!\" said Burgo. \"At any rate, they never did to me.\"\n\"If you want twenty thousand francs - that's eight hundred pounds, I think - I can let you have it without any trouble.\"\n\"The devil you can!\"\n\"Oh, yes. As I am travelling with my family, I have been obliged to carry large bills with me, and I can accommodate you without any difficulty.\"\nThere was something pleasant in this, which made Burgo Fitzgerald laugh. Mr. Palliser, the husband of Lady Glencora M'Cluskie, and the heir of the Duke of Omnium, happening to have money with him! As if Mr. Palliser could not bring down showers of money in any part of the globe by simply holding up his hand.\n\"I do not doubt your ability to raise the money,\" said he; \"but how would you propose to get it back again?\"\n\"That would be at your convenience,\" said Mr. Palliser, who hardly knew how to put himself on a proper footing with his companion.\n\"I never have any such convenience,\" said Burgo. \"Who were those women whose tubs always had holes at the bottom of them? My tub always has such a hole.\"\n\"You mean the daughters of Danaus,\" said Mr. Palliser.\n\"I don't know whose daughters they were, but you might just as well lend them all eight hundred pounds apiece.\"\n\"There were too many of them,\" said Mr. Palliser, trying a little joke. \"But as you are only one I shall be most happy, as I said before, to be of service.\"\nThey were now walking slowly together up towards the hills, when they heard a step. Upon this, Burgo turned round.\n\"Do you see that fellow?\" said he. \"I don't know his name, but they have sent him out from the hotel with me, to see what I do. I owe them six or seven hundred francs, and they want to turn me out of the house without my things.\"\n\"That would be very uncomfortable,\" said Mr. Palliser.\n\"Yes, but if they keep my things they shall keep me. They think I'm going to blow my brains out. The man lets me go far enough off to do that - so long as it's nowhere near the hotel.\"\n\"I hope you're not thinking of such a thing?\"\n\"As long as I can help it, Mr. Palliser, I never think of anything.\"\nThe stranger was now standing near to them, and Burgo walked up to him. In bad French, he asked him to leave. \"Don't you see I have a friend with me?\"\n\"Oh! a friend,\" said the man, in bad English. \"Perhaps de friend can advance moneys?\"\n\"Never mind what he can do,\" said Burgo. \"You leave me.\"\nThen the gentleman from the hotel retreated, but Mr. Palliser, during the rest of the interview, fancied that he heard the man's footfall at no great distance.\nThey continued to walk on up the hill very slowly, and Mr. Palliser repeated his offer.\n\"So Lady Glencora is here?\" Burgo said again.\n\"Yes. It was she who asked me to come to you.\" They both walked on a few steps in silence.\n\"By George! isn't it odd,\" said Burgo, at last, \"that you and I, of all men in the world, should be walking together here at Baden? It's not only that you're the richest man in London, and that I'm the poorest, but - there are other things, you know, which make it so funny.\"\n\"There have been things which make me and my wife very anxious to give you aid.\"\n\"And have you considered, Mr. Palliser, that those things make you the very man in the world from whom I can't take aid? I would have taken it all if I could - and I tried hard.\"\n\"I know you have been disappointed, Mr. Fitzgerald.\"\n\"Disappointed! By G---! yes. I did love her, Mr. Palliser. Nay, by heavens! I do love her. I dare to say it even to you. I shall never try to see her again. All that is over, of course. I've been a fool about her as I have been about everything. But I did love her.\"\n\"I believe it, Mr. Fitzgerald.\"\n\"It was not altogether her money. But think what it would have been to me, Mr. Palliser. Think what a chance I had, and what a chance I lost. There would have been enough money to have saved me. And then I might have done something good instead of crawling about almost in fear of that beast who is watching us.\"\n\"It has been ordered otherwise,\" said Mr. Palliser, not knowing what to say.\n\"Yes; it seems to have been ordered that I'm to go to the devil; but I don't know who gave the orders, and I don't know why.\"\nMr. Palliser did not wish to talk more than could be helped about his own wife.\n\"There is something of truth in what you say. You have been disappointed,\" he said, \"and I, perhaps, of all men am the most bound to come to your assistance.\"\n\"How can I take it from you?\" said Burgo, almost crying.\n\"You shall take it from her!\"\n\"No; that would be twenty times worse. What! take her money, when she would not give me herself!\"\n\"I do not see why you should not borrow her money.\"\n\"No; I won't have it.\"\n\"Then what will you do?\"\n\"Ah! That's the question. I don't know.\"\n\"Will you let me call on you tomorrow?\"\n\"I don't see what good it will do. I shan't get up till late, for fear they should shut the room against me. I think I shall say I'm ill, and keep to my bed.\"\n\"Will you take a few napoleons?\"\n\"No; not from you. You are the first man from whom I ever refused to borrow money.\"\n\"What else can I offer?\" said Mr. Palliser.\n\"You can offer nothing. Say to your wife from me that I bade her adieu; that is all you can do for me. Good night, Mr. Palliser.\"\nMr. Palliser shook Burgo's hand, and then walked quickly down the hill. As he did so he passed the man who had been dodging them.\n\"Misther, Misther!\" whispered the man.\n\"What do you want of me?\" asked Mr. Palliser, in French.\nThe man replied in French. \"Have you given him any money?\"\n\"I have not,\" said Mr. Palliser, not quite knowing what he had better do or say.\n\"Then he will have a bad time of it,\" said the man. \"And he might have carried away two thousand francs just now! Dear, dear, dear! Has he got any friends, sir?\"\n\"Yes, he has friends.\"\n\"But what shall we do? Perhaps with his own hand he will kill himself. For five weeks he owes; and for wine, oh so much! There came through Baden a lord, and then I think he got money. But he went and played.\"\n\"Are you the hotelkeeper?\"\n\"I am the head Commissionaire. I look after the gentlemen who sometimes are not all - not all-\" exactly what they should be, he intended to explain; and Mr. Palliser understood him. The interview ended with Mr. Palliser taking the name of the hotel, and promising to call before Mr. Fitzgerald should be up in the morning.\nLady Glencora received her husband that night with infinite anxiety, and was by no means satisfied with what had been done. He described to her as accurately as he could his interview with Burgo, and also his other interview with the head commissioner.\n\"He will; he will,\" said Lady Glencora; when she heard the man's guess that Burgo might destroy himself. \"And if he does, how shall I bear it?\"\nMr. Palliser tried to soothe her by telling her of his promise to visit the landlord; and Lady Glencora, accepting this, strove to persuade her husband to spend lavishly on Burgo's behalf. He assured her that his money should be forthcoming, if possible.\nOn the following morning he went down to the hotel, and saw the landlord. He found him to be a reasonable, tranquil, good-natured man, whose chief anxiety seemed to arise from the great difficulty of doing anything with the gentleman who was now lying in his bed upstairs.\n\"Has he had any breakfast?\" Mr. Palliser asked.\n\"Oh yes;\" and the landlord laughed. Burgo had desired his cutlets to be dressed in a particular way, with cayenne pepper, and had ordered a bottle of Sauterne; but the landlord had thought that an ordinary wine would do as well. It had just that moment been sent upstairs.\nThen Mr. Palliser sat down in the landlord's little room, and had Burgo Fitzgerald's bill brought to him. \"I think I might venture to pay it,\" he said.\n\"As monsieur pleases,\" said the landlord, but with a sparkle in his eye.\nMr. Palliser did not know whether, in the eyes of the world, he ought to pay it, or leave it. Then he thought of his wife. He could not go back to her without having done something; so he paid the bill.\n\"And to whom should the receipt be given?\" asked the landlord.\nMr. Palliser thought that the landlord had better keep it himself for a while. He knew that he must do something more. He could not simply pay the bill and go away. That would not satisfy his wife.\nAt last he let the landlord into his confidence. He did not tell the whole of Burgo's past history, or that part which referred to Lady Glencora. But he did make the landlord understand that he was willing to give money to Mr. Fitzgerald, if only it could be given judiciously.\n\"You can't keep him out of the gambling salon, you know, sir, if he has a franc in his pocket,\" the landlord assured him.\nIt was at last arranged that the landlord was to tell Burgo that his bill did not signify at present, and that the use of the hotel was to be at his command for the next three months. At the end of that time he was to have notice to quit. No money was to be advanced to him; but the landlord, even in this respect, had discretion.\n\"When I get home, I will see what can be done with his relations there,\" said Mr. Palliser. Then he went home and told his wife.\n\"But he'll have no clothes,\" said Lady Glencora.\nMr. Palliser said that the judicious landlord would manage that also; and in that way Lady Glencora was appeased, till something could be done for the young man on Mr. Palliser's return home.\nPoor Burgo! He must now be made to end his career as far as these pages are concerned. The discreet landlord would tell him nothing but that his bill did not signify yet, but no doubt Burgo must have guessed the truth. He resolved to write an indignant letter to Mr. Palliser; but the letter did not get written.\nWhen in England, Mr. Palliser saw Sir Cosmo Monk, and with many apologies, told him what he had done.\n\"I regret it,\" said Sir Cosmo, in anger at Burgo. The amount expended was, however, repaid to Mr. Palliser, and an arrangement was made for sending a weekly sum of fifteen pounds to Burgo, as long as he should remain at a certain small German town in which there was no gambling-table.\nHere we must say farewell to poor Burgo Fitzgerald; although I doubt whether he lived long in comfort on his allowance.",
        "paragraph_chars": [
            [
                0,
                175
            ],
            [
                175,
                202
            ],
            [
                202,
                353
            ],
            [
                353,
                530
            ],
            [
                530,
                630
            ],
            [
                630,
                649
            ],
            [
                649,
                815
            ],
            [
                815,
                1112
            ],
            [
                1112,
                1239
            ],
            [
                1239,
                1294
            ],
            [
                1294,
                1352
            ],
            [
                1352,
                1473
            ],
            [
                1473,
                1494
            ],
            [
                1494,
                1640
            ],
            [
                1640,
                1950
            ],
            [
                1950,
                2059
            ],
            [
                2059,
                2190
            ],
            [
                2190,
                2344
            ],
            [
                2344,
                2399
            ],
            [
                2399,
                2511
            ],
            [
                2511,
                2668
            ],
            [
                2668,
                2783
            ],
            [
                2783,
                3013
            ],
            [
                3013,
                3068
            ],
            [
                3068,
                3253
            ],
            [
                3253,
                3299
            ],
            [
                3299,
                3368
            ],
            [
                3368,
                3519
            ],
            [
                3519,
                3605
            ],
            [
                3605,
                3662
            ],
            [
                3662,
                3822
            ],
            [
                3822,
                3910
            ],
            [
                3910,
                3956
            ],
            [
                3956,
                4047
            ],
            [
                4047,
                4323
            ],
            [
                4323,
                4404
            ],
            [
                4404,
                4583
            ],
            [
                4583,
                4636
            ],
            [
                4636,
                4903
            ],
            [
                4903,
                4935
            ],
            [
                4935,
                5248
            ],
            [
                5248,
                5325
            ],
            [
                5325,
                5451
            ],
            [
                5451,
                5531
            ],
            [
                5531,
                5690
            ],
            [
                5690,
                5747
            ],
            [
                5747,
                5777
            ],
            [
                5777,
                5875
            ],
            [
                5875,
                5927
            ],
            [
                5927,
                5950
            ],
            [
                5950,
                5975
            ],
            [
                5975,
                6016
            ],
            [
                6016,
                6056
            ],
            [
                6056,
                6215
            ],
            [
                6215,
                6248
            ],
            [
                6248,
                6332
            ],
            [
                6332,
                6376
            ],
            [
                6376,
                6506
            ],
            [
                6506,
                6636
            ],
            [
                6636,
                6675
            ],
            [
                6675,
                6732
            ],
            [
                6732,
                6791
            ],
            [
                6791,
                6872
            ],
            [
                6872,
                7034
            ],
            [
                7034,
                7057
            ],
            [
                7057,
                7267
            ],
            [
                7267,
                7294
            ],
            [
                7294,
                7617
            ],
            [
                7617,
                7870
            ],
            [
                7870,
                8014
            ],
            [
                8014,
                8269
            ],
            [
                8269,
                8542
            ],
            [
                8542,
                8590
            ],
            [
                8590,
                8863
            ],
            [
                8863,
                9015
            ],
            [
                9015,
                9088
            ],
            [
                9088,
                9291
            ],
            [
                9291,
                9354
            ],
            [
                9354,
                9552
            ],
            [
                9552,
                9830
            ],
            [
                9830,
                9952
            ],
            [
                9952,
                10283
            ],
            [
                10283,
                10412
            ],
            [
                10412,
                10461
            ],
            [
                10461,
                10653
            ],
            [
                10653,
                10966
            ],
            [
                10966,
                11068
            ],
            [
                11068,
                11354
            ],
            [
                11354,
                11473
            ]
        ],
        "segment_chars": [
            [
                0,
                112
            ],
            [
                112,
                175
            ],
            [
                175,
                190
            ],
            [
                190,
                202
            ],
            [
                202,
                331
            ],
            [
                331,
                353
            ],
            [
                353,
                377
            ],
            [
                377,
                450
            ],
            [
                450,
                463
            ],
            [
                463,
                491
            ],
            [
                491,
                530
            ],
            [
                530,
                574
            ],
            [
                574,
                630
            ],
            [
                630,
                649
            ],
            [
                649,
                655
            ],
            [
                655,
                713
            ],
            [
                713,
                786
            ],
            [
                786,
                815
            ],
            [
                815,
                870
            ],
            [
                870,
                940
            ],
            [
                940,
                1112
            ],
            [
                1112,
                1157
            ],
            [
                1157,
                1239
            ],
            [
                1239,
                1294
            ],
            [
                1294,
                1303
            ],
            [
                1303,
                1315
            ],
            [
                1315,
                1352
            ],
            [
                1352,
                1473
            ],
            [
                1473,
                1494
            ],
            [
                1494,
                1504
            ],
            [
                1504,
                1640
            ],
            [
                1640,
                1713
            ],
            [
                1713,
                1837
            ],
            [
                1837,
                1950
            ],
            [
                1950,
                2059
            ],
            [
                2059,
                2190
            ],
            [
                2190,
                2239
            ],
            [
                2239,
                2312
            ],
            [
                2312,
                2344
            ],
            [
                2344,
                2399
            ],
            [
                2399,
                2511
            ],
            [
                2511,
                2583
            ],
            [
                2583,
                2668
            ],
            [
                2668,
                2752
            ],
            [
                2752,
                2783
            ],
            [
                2783,
                2809
            ],
            [
                2809,
                2818
            ],
            [
                2818,
                2911
            ],
            [
                2911,
                3013
            ],
            [
                3013,
                3068
            ],
            [
                3068,
                3121
            ],
            [
                3121,
                3165
            ],
            [
                3165,
                3253
            ],
            [
                3253,
                3299
            ],
            [
                3299,
                3368
            ],
            [
                3368,
                3440
            ],
            [
                3440,
                3478
            ],
            [
                3478,
                3519
            ],
            [
                3519,
                3524
            ],
            [
                3524,
                3565
            ],
            [
                3565,
                3605
            ],
            [
                3605,
                3646
            ],
            [
                3646,
                3662
            ],
            [
                3662,
                3822
            ],
            [
                3822,
                3910
            ],
            [
                3910,
                3938
            ],
            [
                3938,
                3956
            ],
            [
                3956,
                3962
            ],
            [
                3962,
                4003
            ],
            [
                4003,
                4047
            ],
            [
                4047,
                4059
            ],
            [
                4059,
                4179
            ],
            [
                4179,
                4323
            ],
            [
                4323,
                4404
            ],
            [
                4404,
                4525
            ],
            [
                4525,
                4583
            ],
            [
                4583,
                4636
            ],
            [
                4636,
                4651
            ],
            [
                4651,
                4660
            ],
            [
                4660,
                4665
            ],
            [
                4665,
                4695
            ],
            [
                4695,
                4712
            ],
            [
                4712,
                4727
            ],
            [
                4727,
                4757
            ],
            [
                4757,
                4793
            ],
            [
                4793,
                4822
            ],
            [
                4822,
                4882
            ],
            [
                4882,
                4903
            ],
            [
                4903,
                4935
            ],
            [
                4935,
                4969
            ],
            [
                4969,
                5024
            ],
            [
                5024,
                5077
            ],
            [
                5077,
                5130
            ],
            [
                5130,
                5248
            ],
            [
                5248,
                5325
            ],
            [
                5325,
                5451
            ],
            [
                5451,
                5531
            ],
            [
                5531,
                5577
            ],
            [
                5577,
                5690
            ],
            [
                5690,
                5720
            ],
            [
                5720,
                5747
            ],
            [
                5747,
                5777
            ],
            [
                5777,
                5816
            ],
            [
                5816,
                5822
            ],
            [
                5822,
                5875
            ],
            [
                5875,
                5927
            ],
            [
                5927,
                5950
            ],
            [
                5950,
                5975
            ],
            [
                5975,
                5980
            ],
            [
                5980,
                6001
            ],
            [
                6001,
                6016
            ],
            [
                6016,
                6056
            ],
            [
                6056,
                6091
            ],
            [
                6091,
                6165
            ],
            [
                6165,
                6215
            ],
            [
                6215,
                6248
            ],
            [
                6248,
                6267
            ],
            [
                6267,
                6332
            ],
            [
                6332,
                6357
            ],
            [
                6357,
                6376
            ],
            [
                6376,
                6400
            ],
            [
                6400,
                6479
            ],
            [
                6479,
                6506
            ],
            [
                6506,
                6578
            ],
            [
                6578,
                6636
            ],
            [
                6636,
                6656
            ],
            [
                6656,
                6675
            ],
            [
                6675,
                6701
            ],
            [
                6701,
                6732
            ],
            [
                6732,
                6759
            ],
            [
                6759,
                6791
            ],
            [
                6791,
                6872
            ],
            [
                6872,
                6924
            ],
            [
                6924,
                6986
            ],
            [
                6986,
                7004
            ],
            [
                7004,
                7034
            ],
            [
                7034,
                7057
            ],
            [
                7057,
                7080
            ],
            [
                7080,
                7128
            ],
            [
                7128,
                7178
            ],
            [
                7178,
                7242
            ],
            [
                7242,
                7267
            ],
            [
                7267,
                7294
            ],
            [
                7294,
                7325
            ],
            [
                7325,
                7476
            ],
            [
                7476,
                7617
            ],
            [
                7617,
                7741
            ],
            [
                7741,
                7870
            ],
            [
                7870,
                7975
            ],
            [
                7975,
                8014
            ],
            [
                8014,
                8203
            ],
            [
                8203,
                8269
            ],
            [
                8269,
                8343
            ],
            [
                8343,
                8542
            ],
            [
                8542,
                8570
            ],
            [
                8570,
                8590
            ],
            [
                8590,
                8626
            ],
            [
                8626,
                8819
            ],
            [
                8819,
                8863
            ],
            [
                8863,
                8969
            ],
            [
                8969,
                9015
            ],
            [
                9015,
                9088
            ],
            [
                9088,
                9182
            ],
            [
                9182,
                9211
            ],
            [
                9211,
                9291
            ],
            [
                9291,
                9334
            ],
            [
                9334,
                9354
            ],
            [
                9354,
                9433
            ],
            [
                9433,
                9473
            ],
            [
                9473,
                9519
            ],
            [
                9519,
                9552
            ],
            [
                9552,
                9601
            ],
            [
                9601,
                9698
            ],
            [
                9698,
                9830
            ],
            [
                9830,
                9952
            ],
            [
                9952,
                10136
            ],
            [
                10136,
                10191
            ],
            [
                10191,
                10283
            ],
            [
                10283,
                10375
            ],
            [
                10375,
                10412
            ],
            [
                10412,
                10461
            ],
            [
                10461,
                10653
            ],
            [
                10653,
                10665
            ],
            [
                10665,
                10740
            ],
            [
                10740,
                10872
            ],
            [
                10872,
                10966
            ],
            [
                10966,
                11068
            ],
            [
                11068,
                11118
            ],
            [
                11118,
                11354
            ],
            [
                11354,
                11473
            ]
        ],
        "overlap_chars": [
            [
                0,
                112
            ],
            [
                112,
                125
            ],
            [
                126,
                174
            ],
            [
                175,
                190
            ],
            [
                190,
                194
            ],
            [
                200,
                202
            ],
            [
                202,
                312
            ],
            [
                313,
                331
            ],
            [
                331,
                353
            ],
            [
                353,
                377
            ],
            [
                377,
                396
            ],
            [
                397,
                403
            ],
            [
                409,
                450
            ],
            [
                450,
                463
            ],
            [
                463,
                491
            ],
            [
                491,
                527
            ],
            [
                527,
                530
            ],
            [
                530,
                574
            ],
            [
                574,
                630
            ],
            [
                630,
                649
            ],
            [
                649,
                653
            ],
            [
                653,
                655
            ],
            [
                655,
                713
            ],
            [
                713,
                786
            ],
            [
                786,
                815
            ],
            [
                815,
                827
            ],
            [
                828,
                870
            ],
            [
                870,
                940
            ],
            [
                940,
                980
            ],
            [
                981,
                1101
            ],
            [
                1102,
                1112
            ],
            [
                1112,
                1119
            ],
            [
                1120,
                1126
            ],
            [
                1127,
                1157
            ],
            [
                1157,
                1239
            ],
            [
                1239,
                1294
            ],
            [
                1294,
                1295
            ],
            [
                1295,
                1303
            ],
            [
                1303,
                1315
            ],
            [
                1315,
                1349
            ],
            [
                1352,
                1387
            ],
            [
                1390,
                1426
            ],
            [
                1429,
                1473
            ],
            [
                1473,
                1494
            ],
            [
                1494,
                1504
            ],
            [
                1504,
                1626
            ],
            [
                1637,
                1640
            ],
            [
                1640,
                1713
            ],
            [
                1713,
                1801
            ],
            [
                1803,
                1837
            ],
            [
                1837,
                1900
            ],
            [
                1906,
                1949
            ],
            [
                1950,
                1952
            ],
            [
                1956,
                1959
            ],
            [
                1966,
                2059
            ],
            [
                2059,
                2188
            ],
            [
                2188,
                2190
            ],
            [
                2190,
                2239
            ],
            [
                2239,
                2312
            ],
            [
                2312,
                2344
            ],
            [
                2344,
                2399
            ],
            [
                2399,
                2511
            ],
            [
                2511,
                2522
            ],
            [
                2527,
                2583
            ],
            [
                2583,
                2668
            ],
            [
                2668,
                2727
            ],
            [
                2733,
                2752
            ],
            [
                2752,
                2783
            ],
            [
                2783,
                2809
            ],
            [
                2809,
                2818
            ],
            [
                2819,
                2909
            ],
            [
                2909,
                2911
            ],
            [
                2911,
                2992
            ],
            [
                3001,
                3010
            ],
            [
                3010,
                3013
            ],
            [
                3013,
                3068
            ],
            [
                3078,
                3093
            ],
            [
                3101,
                3121
            ],
            [
                3121,
                3165
            ],
            [
                3165,
                3209
            ],
            [
                3212,
                3235
            ],
            [
                3241,
                3244
            ],
            [
                3250,
                3253
            ],
            [
                3253,
                3299
            ],
            [
                3299,
                3367
            ],
            [
                3368,
                3411
            ],
            [
                3412,
                3415
            ],
            [
                3416,
                3421
            ],
            [
                3422,
                3438
            ],
            [
                3438,
                3439
            ],
            [
                3440,
                3454
            ],
            [
                3455,
                3457
            ],
            [
                3464,
                3476
            ],
            [
                3476,
                3478
            ],
            [
                3478,
                3492
            ],
            [
                3493,
                3519
            ],
            [
                3519,
                3524
            ],
            [
                3524,
                3548
            ],
            [
                3549,
                3565
            ],
            [
                3565,
                3605
            ],
            [
                3605,
                3646
            ],
            [
                3646,
                3650
            ],
            [
                3651,
                3662
            ],
            [
                3662,
                3705
            ],
            [
                3705,
                3758
            ],
            [
                3759,
                3822
            ],
            [
                3822,
                3876
            ],
            [
                3877,
                3889
            ],
            [
                3899,
                3910
            ],
            [
                3910,
                3938
            ],
            [
                3938,
                3956
            ],
            [
                3956,
                3960
            ],
            [
                3960,
                3962
            ],
            [
                3962,
                4000
            ],
            [
                4003,
                4045
            ],
            [
                4045,
                4047
            ],
            [
                4047,
                4057
            ],
            [
                4062,
                4179
            ],
            [
                4179,
                4261
            ],
            [
                4264,
                4323
            ],
            [
                4323,
                4404
            ],
            [
                4404,
                4496
            ],
            [
                4497,
                4523
            ],
            [
                4525,
                4561
            ],
            [
                4564,
                4583
            ],
            [
                4583,
                4636
            ],
            [
                4636,
                4651
            ],
            [
                4651,
                4655
            ],
            [
                4658,
                4660
            ],
            [
                4660,
                4665
            ],
            [
                4665,
                4695
            ],
            [
                4695,
                4712
            ],
            [
                4712,
                4727
            ],
            [
                4727,
                4728
            ],
            [
                4729,
                4740
            ],
            [
                4744,
                4757
            ],
            [
                4757,
                4793
            ],
            [
                4793,
                4822
            ],
            [
                4822,
                4882
            ],
            [
                4882,
                4903
            ],
            [
                4903,
                4935
            ],
            [
                4935,
                4969
            ],
            [
                4969,
                5024
            ],
            [
                5024,
                5077
            ],
            [
                5077,
                5105
            ],
            [
                5112,
                5130
            ],
            [
                5130,
                5248
            ],
            [
                5248,
                5325
            ],
            [
                5331,
                5451
            ],
            [
                5464,
                5531
            ],
            [
                5532,
                5577
            ],
            [
                5577,
                5603
            ],
            [
                5616,
                5687
            ],
            [
                5687,
                5690
            ],
            [
                5690,
                5720
            ],
            [
                5720,
                5747
            ],
            [
                5747,
                5777
            ],
            [
                5777,
                5781
            ],
            [
                5782,
                5795
            ],
            [
                5796,
                5816
            ],
            [
                5816,
                5822
            ],
            [
                5822,
                5875
            ],
            [
                5875,
                5924
            ],
            [
                5927,
                5950
            ],
            [
                5950,
                5951
            ],
            [
                5951,
                5955
            ],
            [
                5956,
                5972
            ],
            [
                5972,
                5975
            ],
            [
                5976,
                5980
            ],
            [
                5980,
                6001
            ],
            [
                6001,
                6013
            ],
            [
                6016,
                6044
            ],
            [
                6053,
                6056
            ],
            [
                6056,
                6089
            ],
            [
                6091,
                6165
            ],
            [
                6165,
                6202
            ],
            [
                6206,
                6215
            ],
            [
                6215,
                6248
            ],
            [
                6248,
                6252
            ],
            [
                6253,
                6267
            ],
            [
                6267,
                6329
            ],
            [
                6329,
                6332
            ],
            [
                6332,
                6333
            ],
            [
                6333,
                6342
            ],
            [
                6343,
                6346
            ],
            [
                6347,
                6348
            ],
            [
                6349,
                6357
            ],
            [
                6357,
                6376
            ],
            [
                6376,
                6400
            ],
            [
                6400,
                6447
            ],
            [
                6448,
                6479
            ],
            [
                6479,
                6503
            ],
            [
                6503,
                6506
            ],
            [
                6506,
                6518
            ],
            [
                6519,
                6578
            ],
            [
                6578,
                6593
            ],
            [
                6594,
                6636
            ],
            [
                6636,
                6656
            ],
            [
                6666,
                6673
            ],
            [
                6673,
                6675
            ],
            [
                6675,
                6701
            ],
            [
                6701,
                6732
            ],
            [
                6732,
                6739
            ],
            [
                6748,
                6757
            ],
            [
                6757,
                6759
            ],
            [
                6760,
                6791
            ],
            [
                6791,
                6802
            ],
            [
                6802,
                6870
            ],
            [
                6870,
                6872
            ],
            [
                6872,
                6901
            ],
            [
                6905,
                6924
            ],
            [
                6924,
                6986
            ],
            [
                6986,
                7004
            ],
            [
                7004,
                7034
            ],
            [
                7034,
                7054
            ],
            [
                7057,
                7080
            ],
            [
                7080,
                7113
            ],
            [
                7114,
                7118
            ],
            [
                7119,
                7126
            ],
            [
                7126,
                7128
            ],
            [
                7128,
                7142
            ],
            [
                7143,
                7151
            ],
            [
                7152,
                7178
            ],
            [
                7178,
                7204
            ],
            [
                7205,
                7219
            ],
            [
                7220,
                7242
            ],
            [
                7242,
                7264
            ],
            [
                7267,
                7294
            ],
            [
                7295,
                7325
            ],
            [
                7325,
                7377
            ],
            [
                7380,
                7387
            ],
            [
                7390,
                7418
            ],
            [
                7422,
                7474
            ],
            [
                7474,
                7476
            ],
            [
                7476,
                7489
            ],
            [
                7490,
                7495
            ],
            [
                7501,
                7615
            ],
            [
                7615,
                7617
            ],
            [
                7617,
                7741
            ],
            [
                7741,
                7786
            ],
            [
                7787,
                7816
            ],
            [
                7817,
                7870
            ],
            [
                7870,
                7924
            ],
            [
                7925,
                7934
            ],
            [
                7941,
                7945
            ],
            [
                7952,
                7975
            ],
            [
                7975,
                7976
            ],
            [
                7976,
                7995
            ],
            [
                7996,
                8001
            ],
            [
                8002,
                8003
            ],
            [
                8004,
                8013
            ],
            [
                8014,
                8068
            ],
            [
                8077,
                8079
            ],
            [
                8080,
                8085
            ],
            [
                8086,
                8133
            ],
            [
                8133,
                8144
            ],
            [
                8154,
                8168
            ],
            [
                8184,
                8203
            ],
            [
                8203,
                8255
            ],
            [
                8256,
                8258
            ],
            [
                8267,
                8269
            ],
            [
                8269,
                8332
            ],
            [
                8333,
                8343
            ],
            [
                8343,
                8385
            ],
            [
                8386,
                8403
            ],
            [
                8410,
                8531
            ],
            [
                8540,
                8541
            ],
            [
                8542,
                8570
            ],
            [
                8570,
                8590
            ],
            [
                8591,
                8626
            ],
            [
                8632,
                8690
            ],
            [
                8691,
                8695
            ],
            [
                8696,
                8715
            ],
            [
                8716,
                8778
            ],
            [
                8779,
                8783
            ],
            [
                8787,
                8800
            ],
            [
                8801,
                8819
            ],
            [
                8822,
                8852
            ],
            [
                8861,
                8863
            ],
            [
                8863,
                8969
            ],
            [
                8969,
                9005
            ],
            [
                9009,
                9013
            ],
            [
                9013,
                9015
            ],
            [
                9015,
                9016
            ],
            [
                9016,
                9027
            ],
            [
                9035,
                9056
            ],
            [
                9061,
                9065
            ],
            [
                9066,
                9088
            ],
            [
                9090,
                9100
            ],
            [
                9101,
                9125
            ],
            [
                9126,
                9129
            ],
            [
                9135,
                9147
            ],
            [
                9147,
                9171
            ],
            [
                9172,
                9180
            ],
            [
                9180,
                9182
            ],
            [
                9182,
                9211
            ],
            [
                9211,
                9234
            ],
            [
                9239,
                9272
            ],
            [
                9273,
                9290
            ],
            [
                9291,
                9322
            ],
            [
                9323,
                9333
            ],
            [
                9354,
                9432
            ],
            [
                9433,
                9473
            ],
            [
                9473,
                9519
            ],
            [
                9519,
                9551
            ],
            [
                9552,
                9601
            ],
            [
                9601,
                9650
            ],
            [
                9655,
                9659
            ],
            [
                9665,
                9698
            ],
            [
                9698,
                9760
            ],
            [
                9766,
                9807
            ],
            [
                9808,
                9810
            ],
            [
                9817,
                9830
            ],
            [
                9830,
                9890
            ],
            [
                9890,
                9891
            ],
            [
                9892,
                9923
            ],
            [
                9926,
                9938
            ],
            [
                9950,
                9952
            ],
            [
                9952,
                9975
            ],
            [
                9976,
                10096
            ],
            [
                10101,
                10136
            ],
            [
                10136,
                10191
            ],
            [
                10191,
                10226
            ],
            [
                10227,
                10270
            ],
            [
                10271,
                10283
            ],
            [
                10283,
                10375
            ],
            [
                10375,
                10412
            ],
            [
                10412,
                10461
            ],
            [
                10461,
                10574
            ],
            [
                10575,
                10589
            ],
            [
                10590,
                10621
            ],
            [
                10622,
                10653
            ],
            [
                10653,
                10665
            ],
            [
                10665,
                10740
            ],
            [
                10740,
                10761
            ],
            [
                10762,
                10784
            ],
            [
                10785,
                10818
            ],
            [
                10819,
                10822
            ],
            [
                10822,
                10823
            ],
            [
                10828,
                10836
            ],
            [
                10843,
                10852
            ],
            [
                10861,
                10871
            ],
            [
                10875,
                10892
            ],
            [
                10893,
                10905
            ],
            [
                10913,
                10956
            ],
            [
                10957,
                10965
            ],
            [
                10966,
                11068
            ],
            [
                11068,
                11107
            ],
            [
                11116,
                11118
            ],
            [
                11118,
                11137
            ],
            [
                11138,
                11141
            ],
            [
                11141,
                11142
            ],
            [
                11143,
                11150
            ],
            [
                11150,
                11151
            ],
            [
                11152,
                11207
            ],
            [
                11216,
                11255
            ],
            [
                11255,
                11315
            ],
            [
                11316,
                11337
            ],
            [
                11338,
                11353
            ],
            [
                11354,
                11382
            ],
            [
                11383,
                11387
            ],
            [
                11388,
                11404
            ],
            [
                11404,
                11405
            ],
            [
                11415,
                11416
            ],
            [
                11417,
                11430
            ],
            [
                11434,
                11458
            ],
            [
                11463,
                11472
            ],
            [
                11472,
                11473
            ]
        ],
        "row_chars": [
            [
                0,
                112
            ],
            [
                112,
                175
            ],
            [
                175,
                175
            ],
            [
                175,
                190
            ],
            [
                190,
                202
            ],
            [
                202,
                331
            ],
            [
                331,
                353
            ],
            [
                353,
                377
            ],
            [
                377,
                450
            ],
            [
                450,
                463
            ],
            [
                463,
                491
            ],
            [
                491,
                530
            ],
            [
                530,
                574
            ],
            [
                574,
                630
            ],
            [
                630,
                649
            ],
            [
                649,
                655
            ],
            [
                655,
                713
            ],
            [
                713,
                786
            ],
            [
                786,
                815
            ],
            [
                815,
                870
            ],
            [
                870,
                870
            ],
            [
                870,
                940
            ],
            [
                940,
                1112
            ],
            [
                1112,
                1157
            ],
            [
                1157,
                1239
            ],
            [
                1239,
                1294
            ],
            [
                1294,
                1303
            ],
            [
                1303,
                1315
            ],
            [
                1315,
                1352
            ],
            [
                1352,
                1352
            ],
            [
                1352,
                1473
            ],
            [
                1473,
                1494
            ],
            [
                1494,
                1504
            ],
            [
                1504,
                1640
            ],
            [
                1640,
                1713
            ],
            [
                1713,
                1837
            ],
            [
                1837,
                1950
            ],
            [
                1950,
                1950
            ],
            [
                1950,
                1950
            ],
            [
                1950,
                2059
            ],
            [
                2059,
                2190
            ],
            [
                2190,
                2239
            ],
            [
                2239,
                2312
            ],
            [
                2312,
                2344
            ],
            [
                2344,
                2399
            ],
            [
                2399,
                2511
            ],
            [
                2511,
                2583
            ],
            [
                2583,
                2668
            ],
            [
                2668,
                2752
            ],
            [
                2752,
                2783
            ],
            [
                2783,
                2809
            ],
            [
                2809,
                2818
            ],
            [
                2818,
                2818
            ],
            [
                2818,
                2818
            ],
            [
                2818,
                2911
            ],
            [
                2911,
                3013
            ],
            [
                3013,
                3068
            ],
            [
                3068,
                3068
            ],
            [
                3068,
                3121
            ],
            [
                3121,
                3165
            ],
            [
                3165,
                3165
            ],
            [
                3165,
                3253
            ],
            [
                3253,
                3299
            ],
            [
                3299,
                3368
            ],
            [
                3368,
                3478
            ],
            [
                3478,
                3519
            ],
            [
                3519,
                3524
            ],
            [
                3524,
                3565
            ],
            [
                3565,
                3605
            ],
            [
                3605,
                3646
            ],
            [
                3646,
                3662
            ],
            [
                3662,
                3822
            ],
            [
                3822,
                3910
            ],
            [
                3910,
                3938
            ],
            [
                3938,
                3956
            ],
            [
                3956,
                3962
            ],
            [
                3962,
                4003
            ],
            [
                4003,
                4047
            ],
            [
                4047,
                4179
            ],
            [
                4179,
                4323
            ],
            [
                4323,
                4404
            ],
            [
                4404,
                4525
            ],
            [
                4525,
                4583
            ],
            [
                4583,
                4636
            ],
            [
                4636,
                4651
            ],
            [
                4651,
                4660
            ],
            [
                4660,
                4665
            ],
            [
                4665,
                4665
            ],
            [
                4665,
                4695
            ],
            [
                4695,
                4712
            ],
            [
                4712,
                4727
            ],
            [
                4727,
                4757
            ],
            [
                4757,
                4793
            ],
            [
                4793,
                4822
            ],
            [
                4822,
                4882
            ],
            [
                4882,
                4903
            ],
            [
                4903,
                4935
            ],
            [
                4935,
                4969
            ],
            [
                4969,
                5024
            ],
            [
                5024,
                5077
            ],
            [
                5077,
                5077
            ],
            [
                5077,
                5077
            ],
            [
                5077,
                5130
            ],
            [
                5130,
                5248
            ],
            [
                5248,
                5325
            ],
            [
                5325,
                5325
            ],
            [
                5325,
                5451
            ],
            [
                5451,
                5451
            ],
            [
                5451,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5531
            ],
            [
                5531,
                5577
            ],
            [
                5577,
                5690
            ],
            [
                5690,
                5720
            ],
            [
                5720,
                5747
            ],
            [
                5747,
                5777
            ],
            [
                5777,
                5816
            ],
            [
                5816,
                5822
            ],
            [
                5822,
                5875
            ],
            [
                5875,
                5927
            ],
            [
                5927,
                5927
            ],
            [
                5927,
                5950
            ],
            [
                5950,
                5975
            ],
            [
                5975,
                5975
            ],
            [
                5975,
                5980
            ],
            [
                5980,
                6001
            ],
            [
                6001,
                6016
            ],
            [
                6016,
                6016
            ],
            [
                6016,
                6016
            ],
            [
                6016,
                6056
            ],
            [
                6056,
                6091
            ],
            [
                6091,
                6165
            ],
            [
                6165,
                6165
            ],
            [
                6165,
                6215
            ],
            [
                6215,
                6248
            ],
            [
                6248,
                6267
            ],
            [
                6267,
                6332
            ],
            [
                6332,
                6357
            ],
            [
                6357,
                6376
            ],
            [
                6376,
                6400
            ],
            [
                6400,
                6479
            ],
            [
                6479,
                6506
            ],
            [
                6506,
                6506
            ],
            [
                6506,
                6578
            ],
            [
                6578,
                6636
            ],
            [
                6636,
                6656
            ],
            [
                6656,
                6675
            ],
            [
                6675,
                6701
            ],
            [
                6701,
                6732
            ],
            [
                6732,
                6759
            ],
            [
                6759,
                6759
            ],
            [
                6759,
                6791
            ],
            [
                6791,
                6872
            ],
            [
                6872,
                6924
            ],
            [
                6924,
                6986
            ],
            [
                6986,
                7004
            ],
            [
                7004,
                7034
            ],
            [
                7034,
                7057
            ],
            [
                7057,
                7057
            ],
            [
                7057,
                7057
            ],
            [
                7057,
                7057
            ],
            [
                7057,
                7057
            ],
            [
                7057,
                7057
            ],
            [
                7057,
                7057
            ],
            [
                7057,
                7057
            ],
            [
                7057,
                7080
            ],
            [
                7080,
                7080
            ],
            [
                7080,
                7128
            ],
            [
                7128,
                7178
            ],
            [
                7178,
                7242
            ],
            [
                7242,
                7267
            ],
            [
                7267,
                7267
            ],
            [
                7267,
                7267
            ],
            [
                7267,
                7267
            ],
            [
                7267,
                7294
            ],
            [
                7294,
                7294
            ],
            [
                7294,
                7325
            ],
            [
                7325,
                7476
            ],
            [
                7476,
                7617
            ],
            [
                7617,
                7741
            ],
            [
                7741,
                7870
            ],
            [
                7870,
                7975
            ],
            [
                7975,
                8014
            ],
            [
                8014,
                8203
            ],
            [
                8203,
                8203
            ],
            [
                8203,
                8203
            ],
            [
                8203,
                8203
            ],
            [
                8203,
                8203
            ],
            [
                8203,
                8203
            ],
            [
                8203,
                8269
            ],
            [
                8269,
                8343
            ],
            [
                8343,
                8542
            ],
            [
                8542,
                8570
            ],
            [
                8570,
                8590
            ],
            [
                8590,
                8590
            ],
            [
                8590,
                8626
            ],
            [
                8626,
                8626
            ],
            [
                8626,
                8819
            ],
            [
                8819,
                8863
            ],
            [
                8863,
                8969
            ],
            [
                8969,
                9015
            ],
            [
                9015,
                9088
            ],
            [
                9088,
                9182
            ],
            [
                9182,
                9211
            ],
            [
                9211,
                9291
            ],
            [
                9291,
                9291
            ],
            [
                9291,
                9291
            ],
            [
                9291,
                9291
            ],
            [
                9291,
                9354
            ],
            [
                9354,
                9433
            ],
            [
                9433,
                9433
            ],
            [
                9433,
                9433
            ],
            [
                9433,
                9433
            ],
            [
                9433,
                9473
            ],
            [
                9473,
                9519
            ],
            [
                9519,
                9552
            ],
            [
                9552,
                9552
            ],
            [
                9552,
                9601
            ],
            [
                9601,
                9698
            ],
            [
                9698,
                9830
            ],
            [
                9830,
                9952
            ],
            [
                9952,
                10136
            ],
            [
                10136,
                10191
            ],
            [
                10191,
                10283
            ],
            [
                10283,
                10375
            ],
            [
                10375,
                10412
            ],
            [
                10412,
                10461
            ],
            [
                10461,
                10653
            ],
            [
                10653,
                10665
            ],
            [
                10665,
                10740
            ],
            [
                10740,
                10872
            ],
            [
                10872,
                10966
            ],
            [
                10966,
                11068
            ],
            [
                11068,
                11118
            ],
            [
                11118,
                11118
            ],
            [
                11118,
                11354
            ],
            [
                11354,
                11473
            ]
        ]
    }
}