{
    "original": {
        "text": "Mr. Palliser did not remain long in Baden after the payment of Burgo's bill. Perhaps I shall not throw any undeserved discredit on his courage if I say that he was afraid to do so. What would he have said,--what would he have been able to say, if that young man had come to him demanding an explanation? So he hurried away to Strasbourg the same day, much to his wife's satisfaction.\nThe journey home from thence was not marked by any incidents. Gradually Mr. Palliser became a little more lenient to his wife and slightly less oppressive in his caution. If he still inquired about the springs of the carriages, he did so in silence, and he ceased to enjoin the necessity of a day's rest after each day's journey. By the time that they reached Dover he had become so used to his wife's condition that he made but little fluttering as she walked out of the boat by that narrow gangway which is so contrived as to make an arrival there a serious inconvenience to a lady, and a nuisance even to a man. He was somewhat staggered when a big man, in the middle of the night, insisted on opening the little basket which his wife carried, and was uncomfortable when obliged to stop her on the plank while he gave up the tickets which he thought had been already surrendered; but he was becoming used to his position, and bore himself like a man.\nDuring their journey home Mr. Palliser had by no means kept his seat opposite to Lady Glencora with constancy. He had soon found that it was easier to talk to Mr. Grey than to his wife, and, consequently, the two ladies had been much together, as had also the two gentlemen. What the ladies discussed may be imagined. One was about to become a wife and the other a mother, and that was to be their fate after each had made up her mind that no such lot was to be hers. It may, however, be presumed that for every one word that Alice spoke Lady Glencora spoke ten. The two men, throughout these days of close intimacy, were intent upon politics. Mr. Palliser, who may be regarded as the fox who had lost his tail,--the tail being, in this instance, the comfort of domestic privacy,--was eager in recommending his new friend to cut off his tail also. \"Your argument would be very well,\" said he, \"if men were to be contented to live for themselves only.\"\n\"Your argument would be very well,\" said the other, \"if it were used to a man who felt that he could do good to others by going into public life. But it is wholly inefficacious if it recommends public life simply or chiefly because a man may gratify his own ambition by public services.\"\n\"Of course there is personal gratification, and of course there is good done,\" said Mr. Palliser.\n\"Is,--or should be,\" said Mr. Grey.\n\"Exactly; and the two things must go together. The chief gratification comes from the feeling that you are of use.\"\n\"But if you feel that you would not be of use?\"\nWe need not follow the argument any further. We all know its nature, and what between two such men would be said on both sides. We all know that neither of them would put the matter altogether in a true light. Men never can do so in words, let the light within themselves be ever so clear. I do not think that any man yet ever had such a gift of words as to make them a perfect exponent of all the wisdom within him. But the effect was partly that which the weaker man of the two desired,--the weaker in the gifts of nature, though art had in some respects made him stronger. Mr. Grey was shaken in his quiescent philosophy, and startled Alice,--startled her as much as he delighted her,--by a word or two he said as he walked with her in the courts of the Louvre. \"It's all hollow here,\" he said, speaking of French politics.\n\"Very hollow,\" said Alice, who had no love for the French mode of carrying on public affairs.\n\"Of all modes of governing this seems to me to be the surest of coming to a downfall. Men are told that they are wise enough to talk, but not wise enough to have any power of action. It is as though men were cautioned that they were walking through gunpowder, and that no fire could be allowed them, but were at the same time enjoined to carry lucifer matches in their pockets. I don't believe in the gunpowder, and I think there should be fire, and plenty of it; but if I didn't want the fire I wouldn't have the matches.\"\n\"It's so odd to hear you talk politics,\" said Alice, laughing.\nAfter this he dropped the subject for a while, as though he were ashamed of it, but in a very few minutes he returned to it manfully. \"Mr. Palliser wants me to go into Parliament.\" Upon hearing this Alice said nothing. She was afraid to speak. After all that had passed she felt that it would not become her to show much outward joy on hearing such a proposition, so spoken by him, and yet she could say nothing without some sign of exultation in her voice. So she walked on without speaking, and was conscious that her fingers trembled on his arm. \"What do you say about it?\" he asked.\n\"What do I say? Oh, John, what right can I have to say anything?\"\n\"No one else can have so much right,--putting aside of course myself, who must be responsible for my own actions. He asked me whether I could afford it, and he seems to think that a smaller income suffices for such work now than it did a few years since. I believe that I could afford it, if I could get a seat that was not very expensive at the first outset. He could help me there.\"\n\"On that point, of course, I can have no opinion.\"\n\"No; not on that point. I believe we may take that for granted. Living in London for four or five months in the year might be managed. But as to the mode of life!\"\nThen Alice was unable to hold her tongue longer, and spoke out her thoughts with more vehemence than discretion. No doubt he combated them with some amount of opposition. He seldom allowed out-spoken enthusiasm to pass by him without some amount of hostility. But he was not so perverse as to be driven from his new views by the fact that Alice approved them, and she, as she drew near home, was able to think that the only flaw in his character was in process of being cured.\nWhen they reached London they all separated. It was Mr. Palliser's purpose to take his wife down to Matching with as little delay as possible. London was at this time nearly empty, and all the doings of the season were over. It was now the first week of August, and as Parliament had not been sitting for nearly two months, the town looked as it usually looks in September. Lady Glencora was to stay but one day in Park Lane, and it had been understood between her and Alice that they were not to see each other.\n\"How odd it is parting in this way, when people have been together so long,\" said Lady Glencora. \"It always seems as though there had been a separate little life of its own which was now to be brought to a close. I suppose, Mr. Grey, you and I, when we next meet, will be far too distant to fight with each other.\"\n\"I hope that may never be the case,\" said Mr. Grey.\n\"I suppose nothing would prevent his fighting; would it Alice? But, remember, there must be no fighting when we do meet next, and that must be in September.\"\n\"With all my heart,\" said Mr. Grey. But Alice said nothing.\nThen Mr. Palliser made his little speech. \"Alice,\" he said, as he gave his hand to Miss Vavasor, \"give my compliments to your father, and tell him that I shall take the liberty of asking him to come down to Matching for the early shooting in September, and that I shall expect him to bring you with him. You may tell him also that he will have to stay to see you off, but that he will not be allowed to take you away.\" Lady Glencora thought that this was very pretty as coming from her husband, and so she told him on their way home.\nAlice insisted on going to Queen Anne Street in a cab by herself. Mr. Palliser had offered a carriage, and Mr. Grey, of course, offered himself as a protector; but she would have neither the one nor the other. If he had gone with her he might by chance have met her father, and she was most anxious that she should not be encumbered by her lover's presence when she first received her father's congratulations. They had slept at Dover, and had come up by a mid-day train. When she reached Queen Anne Street, the house was desolate, and she might therefore have allowed Mr. Grey to attend her. But she found a letter waiting for her which made her for the moment forget both him and her father. Lady Macleod, at Cheltenham, was very ill, and wished to see her niece, as she said, before she died. \"I have got your letter,\" said the kind old woman, \"and am now quite happy. It only wanted that to reconcile me to my departure. I thought through it all that my girl would be happy at last. Will she forgive me if I say that I have forgiven her?\" The letter then went on to beg Alice to come to Cheltenham at once. \"It is not that I am dying now,\" said Lady Macleod, \"though you will find me much altered and keeping my bed. But the doctor says he fears the first cold weather. I know what that means, my dear; and if I don't see you now, before your marriage, I shall never see you again. Pray get married as soon as you can. I want to know that you are Mrs. Grey before I go. If I were to hear that it was postponed because of my illness, I think it would kill me at once.\"\nThere was another letter for her from Kate, full, of course, of congratulations, and promising to be at the wedding; \"that is,\" said Kate, \"unless it takes place at the house of some one of your very grand friends;\" and telling her that aunt Greenow was to be married in a fortnight;--telling her of this, and begging her to attend that wedding. \"You should stand by your family,\" said Kate. \"And only think what my condition will be if I have no one here to support me. Do come. Journeys are nothing nowadays. Don't you know I would go seven times the distance for you? Mr. Cheesacre and Captain Bellfield are friends after all, and Mr. Cheesacre is to be best man. Is it not beautiful? As for poor me, I'm told I haven't a chance left of becoming mistress of Oileymead and all its wealth.\"\nAlice began to think that her hands were almost too full. If she herself were to be married in September, even by the end of September, her hands were very full indeed. Yet she did not know how to refuse any of the requests made to her. As to Lady Macleod, her visit to her was a duty which must of course be performed at once. She would stay but one day in London, and then go down to Cheltenham. Having resolved upon this she at once wrote to her aunt to that effect. As to that other affair down in Westmoreland, she sighed as she thought of it, but she feared that she must go there also. Kate had suffered too much on her behalf to allow of her feeling indifferent to such a request.\nThen her father came in. \"I didn't in the least know when you might arrive,\" said he, beginning with an apology for his absence. \"How could I, my dear?\" Alice scorned to remind him that she herself had named the precise hour of the train by which they had arrived. \"It's all right, papa,\" said she. \"I was very glad to have an hour to write a letter or two. Poor Lady Macleod is very ill. I must go to her the day after to-morrow.\"\n\"Dear, dear, dear! I had heard that she was poorly. She is very old, you know. So, Alice, you've made it all square with Mr. Grey at last?\"\n\"Yes, papa;--if you call that square.\"\n\"Well; I do call it square. It has all come round to the proper thing.\"\n\"I hope he thinks so.\"\n\"What do you think yourself, my dear?\"\n\"I've no doubt it's the proper thing for me, papa.\"\n\"Of course not; of course not; and I can tell you this, Alice, he is a man in a thousand. You've heard about the money?\"\n\"What money, papa?\"\n\"The money that George had.\" As the reader is aware, Alice had heard nothing special about this money. She only knew, or supposed she knew, that she had given three thousand pounds to her cousin. But now her father explained to her the whole transaction. \"We couldn't have realized your money for months, perhaps,\" said he; \"but Grey knew that some men must have rope enough before they can hang themselves.\"\nAlice was unable to say anything on this subject to her father, but to herself she did declare that not in that way or with that hope had John Grey produced his money. \"He must be paid, papa,\" she said. \"Paid!\" he answered; \"he can pay himself now. It may make some difference in the settlements, perhaps, but he and the lawyers may arrange that. I shan't think of interfering with such a man as Grey. If you could only know, my dear, what I've suffered!\" Alice in a penitential tone expressed her sorrow, and then he too assured her that he had forgiven her. \"Bless you, my child!\" he said, \"and make you happy, and good, and--and--and very comfortable.\" After that he went back to his club.\nAlice made her journey down to Cheltenham without any adventure, and was received by Lady Macleod with open arms. \"Dearest Alice, it is so good of you.\" \"Good!\" said Alice, \"would I not have gone a thousand miles to you?\"\nLady Macleod was very eager to know all about the coming marriage. \"I can tell you now, my dear, though I couldn't do it before, that I knew he'd persist for ever. He told me so himself in confidence.\"\n\"He has persisted, aunt; that is certain.\"\n\"And I hope you'll reward him. A beautiful woman without discretion is like a pearl in a swine's snout; but a good wife is a crown of glory to her husband. Remember that, my dear, and choose your part for his sake.\"\n\"I won't be that unfortunate pearl, if I can help it, aunt.\"\n\"We can all help it, if we set about it in the right way. And Alice, you must be careful to find out all his likes and his dislikes. Dear me! I remember how hard I found it, but then I don't think I was so clever as you are.\"\n\"Sometimes I think nobody has ever been so stupid as I have.\"\n\"Not stupid, my dear; if I must say the word, it is self-willed. But, dear, all that is forgiven now. Is it not?\"\n\"There is a forgiveness which it is rather hard to get,\" said Alice.\nThere was something said then as to the necessity of looking for pardon beyond this world, which I need not here repeat. To all her old friend's little sermons Alice was infinitely more attentive than had been her wont, so that Lady Macleod was comforted and took heart of grace, and at last brought forth from under her pillow a letter from the Countess of Midlothian, which she had received a day or two since, and which bore upon Alice's case. \"I was not quite sure whether I'd show it you,\" said Lady Macleod, \"because you wouldn't answer her when she wrote to you. But when I'm gone, as I shall be soon, she will be the nearest relative you have on your mother's side, and from her great position, you know, Alice--\" But here Alice became impatient for the letter. Her aunt handed it to her, and she read as follows:--\nCastle Reekie, July, 186--.\nDEAR LADY MACLEOD,--\nI am sorry to hear of the symptoms you speak about. I strongly advise you to depend chiefly on beef-tea. They should be very careful to send it up quite free from grease, and it should not be too strong of the meat. There should be no vegetables in it. Not soup, you know, but beef-tea. If any thing acts upon your strength, that will. I need not tell one who has lived as you have done where to look for that other strength which alone can support you at such a time as this. I would go to you if I thought that my presence would be any comfort to you, but I know how sensitive you are, and the shock might be too much for you.\nIf you see Alice Vavasor on her return to England, as you probably will, pray tell her from me that I give her my warmest congratulations, and that I am heartily glad that matters are arranged. I think she treated my attempts to heal the wound in a manner that they did not deserve; but all that shall be forgiven, as shall also her original bad behaviour to poor Mr. Grey.\nAlice was becoming weary of so much forgiveness, and told herself, as she was reading the letter, that that of Lady Midlothian was at any rate unnecessary. \"I trust that we may yet meet and be friends,\" continued Lady Midlothian. \"I am extremely gratified at finding that she has been thought so much of by Mr. Palliser. I'm told that Mr. Palliser and Mr. Grey have become great friends, and if this is so, Alice must be happy to feel that she has had it in her power to confer so great a benefit on her future husband as he will receive from this introduction.\" \"I ain't a bit happy, and I have conferred no benefit on Mr. Grey,\" exclaimed Alice, who was unable to repress the anger occasioned by the last paragraph.\n\"But it is a great benefit, my dear.\"\n\"Mr. Palliser has every bit as much cause to be gratified for that as Mr. Grey, and perhaps more.\"\nPoor Lady Macleod could not argue the matter in her present state. She merely sighed, and moved her shrivelled old hand up and down upon the counterpane. Alice finished the letter without further remarks. It merely went on to say how happy the writer would be to know something of her cousin as Mrs. Grey, as also to know something of Mr. Grey, and then gave a general invitation to both Mr. and Mrs. Grey, asking them to come to Castle Reekie whenever they might be able. The Marchioness, with whom Lady Midlothian was staying, had expressly desired her to give this message. Alice, however, could not but observe that Lady Midlothian's invitation applied only to another person's house.\n\"I'm sure she means well,\" said Alice.\n\"Indeed she does,\" said Lady Macleod, \"and then you know you'll probably have children; and think what a thing it will be for them to know the Midlothian family. You shouldn't rob them of their natural advantages.\"\nAlice remained a week with her aunt, and went from thence direct to Westmoreland. Some order as to bridal preparations we must presume she gave on that single day which she passed in London. Much advice she had received on this head from Lady Glencora, and no inconsiderable amount of assistance was to be rendered to her at Matching during the fortnight she would remain there before her marriage. Something also, let us hope, she might do at Cheltenham. Something no doubt she did do. Something also might probably be achieved among the wilds in Westmoreland, but that something would necessarily be of a nature not requiring fashionable tradespeople. While at Cheltenham, she determined that she would not again return to London before her marriage. This resolve was caused by a very urgent letter from Mr. Grey, and by another, almost equally urgent, from Lady Glencora. If the marriage did not take place in September she would not be present at it. The gods of the world,--of Lady Glencora's world,--had met together and come to a great decision. Lady Glencora was to be removed in October to Gatherum Castle, and remain there till the following spring, so that the heir might, in truth, be born in the purple. \"It is such a bore,\" said Lady Glencora, \"and I know it will be a girl. But the Duke isn't to be there, except for the Christmas week.\" An invitation for the ceremony at Matching had been sent from Mr. Palliser to Mr. Vavasor, and another from Lady Glencora to Kate, \"whom I long to know,\" said her ladyship, \"and with whom I should like to pick a crow, if I dared, as I'm sure she did all the mischief.\"",
        "paragraph_chars": [
            [
                0,
                384
            ],
            [
                384,
                1338
            ],
            [
                1338,
                2290
            ],
            [
                2290,
                2578
            ],
            [
                2578,
                2676
            ],
            [
                2676,
                2712
            ],
            [
                2712,
                2828
            ],
            [
                2828,
                2876
            ],
            [
                2876,
                3703
            ],
            [
                3703,
                3797
            ],
            [
                3797,
                4321
            ],
            [
                4321,
                4384
            ],
            [
                4384,
                4971
            ],
            [
                4971,
                5037
            ],
            [
                5037,
                5422
            ],
            [
                5422,
                5473
            ],
            [
                5473,
                5637
            ],
            [
                5637,
                6114
            ],
            [
                6114,
                6627
            ],
            [
                6627,
                6942
            ],
            [
                6942,
                6994
            ],
            [
                6994,
                7152
            ],
            [
                7152,
                7212
            ],
            [
                7212,
                7746
            ],
            [
                7746,
                9318
            ],
            [
                9318,
                10110
            ],
            [
                10110,
                10799
            ],
            [
                10799,
                11231
            ],
            [
                11231,
                11371
            ],
            [
                11371,
                11410
            ],
            [
                11410,
                11482
            ],
            [
                11482,
                11505
            ],
            [
                11505,
                11544
            ],
            [
                11544,
                11596
            ],
            [
                11596,
                11717
            ],
            [
                11717,
                11737
            ],
            [
                11737,
                12146
            ],
            [
                12146,
                12839
            ],
            [
                12839,
                13061
            ],
            [
                13061,
                13263
            ],
            [
                13263,
                13306
            ],
            [
                13306,
                13522
            ],
            [
                13522,
                13583
            ],
            [
                13583,
                13809
            ],
            [
                13809,
                13871
            ],
            [
                13871,
                13985
            ],
            [
                13985,
                14054
            ],
            [
                14054,
                14878
            ],
            [
                14878,
                14906
            ],
            [
                14906,
                14927
            ],
            [
                14927,
                15556
            ],
            [
                15556,
                15930
            ],
            [
                15930,
                16648
            ],
            [
                16648,
                16686
            ],
            [
                16686,
                16785
            ],
            [
                16785,
                17474
            ],
            [
                17474,
                17513
            ],
            [
                17513,
                17728
            ],
            [
                17728,
                19349
            ]
        ],
        "segment_chars": [
            [
                0,
                77
            ],
            [
                77,
                181
            ],
            [
                181,
                304
            ],
            [
                304,
                384
            ],
            [
                384,
                446
            ],
            [
                446,
                555
            ],
            [
                555,
                714
            ],
            [
                714,
                999
            ],
            [
                999,
                1338
            ],
            [
                1338,
                1449
            ],
            [
                1449,
                1613
            ],
            [
                1613,
                1656
            ],
            [
                1656,
                1806
            ],
            [
                1806,
                1901
            ],
            [
                1901,
                1982
            ],
            [
                1982,
                2186
            ],
            [
                2186,
                2290
            ],
            [
                2290,
                2436
            ],
            [
                2436,
                2578
            ],
            [
                2578,
                2676
            ],
            [
                2676,
                2712
            ],
            [
                2712,
                2759
            ],
            [
                2759,
                2828
            ],
            [
                2828,
                2876
            ],
            [
                2876,
                2921
            ],
            [
                2921,
                3004
            ],
            [
                3004,
                3086
            ],
            [
                3086,
                3166
            ],
            [
                3166,
                3293
            ],
            [
                3293,
                3452
            ],
            [
                3452,
                3641
            ],
            [
                3641,
                3703
            ],
            [
                3703,
                3797
            ],
            [
                3797,
                3883
            ],
            [
                3883,
                3980
            ],
            [
                3980,
                4175
            ],
            [
                4175,
                4321
            ],
            [
                4321,
                4384
            ],
            [
                4384,
                4518
            ],
            [
                4518,
                4565
            ],
            [
                4565,
                4603
            ],
            [
                4603,
                4628
            ],
            [
                4628,
                4842
            ],
            [
                4842,
                4933
            ],
            [
                4933,
                4961
            ],
            [
                4961,
                4971
            ],
            [
                4971,
                4987
            ],
            [
                4987,
                5037
            ],
            [
                5037,
                5151
            ],
            [
                5151,
                5292
            ],
            [
                5292,
                5397
            ],
            [
                5397,
                5422
            ],
            [
                5422,
                5473
            ],
            [
                5473,
                5497
            ],
            [
                5497,
                5537
            ],
            [
                5537,
                5608
            ],
            [
                5608,
                5637
            ],
            [
                5637,
                5750
            ],
            [
                5750,
                5808
            ],
            [
                5808,
                5897
            ],
            [
                5897,
                6114
            ],
            [
                6114,
                6159
            ],
            [
                6159,
                6257
            ],
            [
                6257,
                6339
            ],
            [
                6339,
                6488
            ],
            [
                6488,
                6627
            ],
            [
                6627,
                6724
            ],
            [
                6724,
                6840
            ],
            [
                6840,
                6942
            ],
            [
                6942,
                6994
            ],
            [
                6994,
                7057
            ],
            [
                7057,
                7152
            ],
            [
                7152,
                7188
            ],
            [
                7188,
                7212
            ],
            [
                7212,
                7254
            ],
            [
                7254,
                7516
            ],
            [
                7516,
                7631
            ],
            [
                7631,
                7746
            ],
            [
                7746,
                7812
            ],
            [
                7812,
                7956
            ],
            [
                7956,
                8157
            ],
            [
                8157,
                8218
            ],
            [
                8218,
                8339
            ],
            [
                8339,
                8440
            ],
            [
                8440,
                8542
            ],
            [
                8542,
                8618
            ],
            [
                8618,
                8671
            ],
            [
                8671,
                8733
            ],
            [
                8733,
                8789
            ],
            [
                8789,
                8857
            ],
            [
                8857,
                8967
            ],
            [
                8967,
                9020
            ],
            [
                9020,
                9132
            ],
            [
                9132,
                9169
            ],
            [
                9169,
                9220
            ],
            [
                9220,
                9318
            ],
            [
                9318,
                9664
            ],
            [
                9664,
                9710
            ],
            [
                9710,
                9789
            ],
            [
                9789,
                9798
            ],
            [
                9798,
                9829
            ],
            [
                9829,
                9889
            ],
            [
                9889,
                9985
            ],
            [
                9985,
                10006
            ],
            [
                10006,
                10110
            ],
            [
                10110,
                10168
            ],
            [
                10168,
                10279
            ],
            [
                10279,
                10347
            ],
            [
                10347,
                10438
            ],
            [
                10438,
                10508
            ],
            [
                10508,
                10580
            ],
            [
                10580,
                10703
            ],
            [
                10703,
                10799
            ],
            [
                10799,
                10824
            ],
            [
                10824,
                10928
            ],
            [
                10928,
                10952
            ],
            [
                10952,
                11064
            ],
            [
                11064,
                11098
            ],
            [
                11098,
                11157
            ],
            [
                11157,
                11188
            ],
            [
                11188,
                11231
            ],
            [
                11231,
                11250
            ],
            [
                11250,
                11283
            ],
            [
                11283,
                11310
            ],
            [
                11310,
                11371
            ],
            [
                11371,
                11410
            ],
            [
                11410,
                11438
            ],
            [
                11438,
                11482
            ],
            [
                11482,
                11505
            ],
            [
                11505,
                11544
            ],
            [
                11544,
                11596
            ],
            [
                11596,
                11686
            ],
            [
                11686,
                11717
            ],
            [
                11717,
                11737
            ],
            [
                11737,
                11766
            ],
            [
                11766,
                11840
            ],
            [
                11840,
                11933
            ],
            [
                11933,
                11992
            ],
            [
                11992,
                12146
            ],
            [
                12146,
                12314
            ],
            [
                12314,
                12349
            ],
            [
                12349,
                12357
            ],
            [
                12357,
                12395
            ],
            [
                12395,
                12493
            ],
            [
                12493,
                12548
            ],
            [
                12548,
                12602
            ],
            [
                12602,
                12706
            ],
            [
                12706,
                12729
            ],
            [
                12729,
                12802
            ],
            [
                12802,
                12839
            ],
            [
                12839,
                12953
            ],
            [
                12953,
                12992
            ],
            [
                12992,
                13000
            ],
            [
                13000,
                13061
            ],
            [
                13061,
                13128
            ],
            [
                13128,
                13225
            ],
            [
                13225,
                13263
            ],
            [
                13263,
                13306
            ],
            [
                13306,
                13337
            ],
            [
                13337,
                13462
            ],
            [
                13462,
                13522
            ],
            [
                13522,
                13583
            ],
            [
                13583,
                13641
            ],
            [
                13641,
                13716
            ],
            [
                13716,
                13725
            ],
            [
                13725,
                13809
            ],
            [
                13809,
                13871
            ],
            [
                13871,
                13936
            ],
            [
                13936,
                13973
            ],
            [
                13973,
                13985
            ],
            [
                13985,
                14054
            ],
            [
                14054,
                14175
            ],
            [
                14175,
                14501
            ],
            [
                14501,
                14624
            ],
            [
                14624,
                14824
            ],
            [
                14824,
                14878
            ],
            [
                14878,
                14906
            ],
            [
                14906,
                14927
            ],
            [
                14927,
                14979
            ],
            [
                14979,
                15032
            ],
            [
                15032,
                15143
            ],
            [
                15143,
                15180
            ],
            [
                15180,
                15214
            ],
            [
                15214,
                15263
            ],
            [
                15263,
                15404
            ],
            [
                15404,
                15556
            ],
            [
                15556,
                15750
            ],
            [
                15750,
                15930
            ],
            [
                15930,
                16086
            ],
            [
                16086,
                16160
            ],
            [
                16160,
                16251
            ],
            [
                16251,
                16493
            ],
            [
                16493,
                16648
            ],
            [
                16648,
                16686
            ],
            [
                16686,
                16785
            ],
            [
                16785,
                16852
            ],
            [
                16852,
                16939
            ],
            [
                16939,
                16990
            ],
            [
                16990,
                17258
            ],
            [
                17258,
                17362
            ],
            [
                17362,
                17474
            ],
            [
                17474,
                17513
            ],
            [
                17513,
                17675
            ],
            [
                17675,
                17728
            ],
            [
                17728,
                17810
            ],
            [
                17810,
                17919
            ],
            [
                17919,
                18127
            ],
            [
                18127,
                18184
            ],
            [
                18184,
                18215
            ],
            [
                18215,
                18382
            ],
            [
                18382,
                18481
            ],
            [
                18481,
                18603
            ],
            [
                18603,
                18683
            ],
            [
                18683,
                18781
            ],
            [
                18781,
                18945
            ],
            [
                18945,
                19017
            ],
            [
                19017,
                19081
            ],
            [
                19081,
                19349
            ]
        ],
        "overlap_chars": [
            [
                4,
                8
            ],
            [
                13,
                77
            ],
            [
                310,
                349
            ],
            [
                382,
                384
            ],
            [
                384,
                405
            ],
            [
                413,
                416
            ],
            [
                444,
                446
            ],
            [
                446,
                555
            ],
            [
                714,
                808
            ],
            [
                934,
                935
            ],
            [
                813,
                863
            ],
            [
                869,
                883
            ],
            [
                997,
                998
            ],
            [
                1338,
                1376
            ],
            [
                1452,
                1557
            ],
            [
                1567,
                1584
            ],
            [
                1594,
                1613
            ],
            [
                1613,
                1656
            ],
            [
                1656,
                1710
            ],
            [
                1741,
                1777
            ],
            [
                1804,
                1806
            ],
            [
                1806,
                1849
            ],
            [
                1854,
                1900
            ],
            [
                1901,
                1912
            ],
            [
                1955,
                1982
            ],
            [
                1982,
                1994
            ],
            [
                2119,
                2144
            ],
            [
                2160,
                2162
            ],
            [
                2145,
                2159
            ],
            [
                2184,
                2185
            ],
            [
                2290,
                2330
            ],
            [
                2340,
                2343
            ],
            [
                2362,
                2436
            ],
            [
                2436,
                2452
            ],
            [
                2467,
                2502
            ],
            [
                2514,
                2578
            ],
            [
                2578,
                2675
            ],
            [
                2712,
                2713
            ],
            [
                2726,
                2740
            ],
            [
                2746,
                2759
            ],
            [
                2759,
                2828
            ],
            [
                2828,
                2876
            ],
            [
                2876,
                2921
            ],
            [
                2921,
                2943
            ],
            [
                3002,
                3004
            ],
            [
                3293,
                3363
            ],
            [
                3366,
                3379
            ],
            [
                3399,
                3452
            ],
            [
                3452,
                3478
            ],
            [
                3489,
                3513
            ],
            [
                3549,
                3558
            ],
            [
                3514,
                3519
            ],
            [
                3565,
                3567
            ],
            [
                3582,
                3640
            ],
            [
                3641,
                3703
            ],
            [
                3703,
                3728
            ],
            [
                3795,
                3797
            ],
            [
                3797,
                3883
            ],
            [
                3883,
                3978
            ],
            [
                4321,
                4384
            ],
            [
                4384,
                4472
            ],
            [
                4478,
                4518
            ],
            [
                4518,
                4564
            ],
            [
                4583,
                4603
            ],
            [
                4603,
                4628
            ],
            [
                4628,
                4727
            ],
            [
                4764,
                4783
            ],
            [
                4796,
                4842
            ],
            [
                4842,
                4932
            ],
            [
                4933,
                4961
            ],
            [
                4961,
                4971
            ],
            [
                4987,
                5037
            ],
            [
                5037,
                5072
            ],
            [
                5149,
                5151
            ],
            [
                5151,
                5188
            ],
            [
                5290,
                5292
            ],
            [
                5292,
                5314
            ],
            [
                5324,
                5397
            ],
            [
                5397,
                5419
            ],
            [
                5537,
                5608
            ],
            [
                5608,
                5637
            ],
            [
                5637,
                5677
            ],
            [
                5684,
                5695
            ],
            [
                5700,
                5712
            ],
            [
                5748,
                5750
            ],
            [
                5750,
                5775
            ],
            [
                5806,
                5808
            ],
            [
                5808,
                5825
            ],
            [
                5837,
                5875
            ],
            [
                5895,
                5897
            ],
            [
                5897,
                6004
            ],
            [
                6029,
                6089
            ],
            [
                6090,
                6114
            ],
            [
                6114,
                6159
            ],
            [
                6168,
                6178
            ],
            [
                6189,
                6257
            ],
            [
                6257,
                6267
            ],
            [
                6281,
                6293
            ],
            [
                6339,
                6379
            ],
            [
                6383,
                6436
            ],
            [
                6486,
                6488
            ],
            [
                6488,
                6513
            ],
            [
                6518,
                6543
            ],
            [
                6579,
                6588
            ],
            [
                6604,
                6607
            ],
            [
                6611,
                6627
            ],
            [
                6627,
                6724
            ],
            [
                6724,
                6727
            ],
            [
                6735,
                6750
            ],
            [
                6757,
                6760
            ],
            [
                6766,
                6805
            ],
            [
                6810,
                6813
            ],
            [
                6820,
                6838
            ],
            [
                7254,
                7262
            ],
            [
                7266,
                7270
            ],
            [
                7270,
                7282
            ],
            [
                7283,
                7291
            ],
            [
                7307,
                7371
            ],
            [
                7399,
                7435
            ],
            [
                7442,
                7505
            ],
            [
                7514,
                7516
            ],
            [
                7516,
                7578
            ],
            [
                7578,
                7631
            ],
            [
                7631,
                7671
            ],
            [
                7705,
                7722
            ],
            [
                7694,
                7705
            ],
            [
                7727,
                7746
            ],
            [
                7746,
                7812
            ],
            [
                8024,
                8027
            ],
            [
                8065,
                8067
            ],
            [
                8103,
                8157
            ],
            [
                8218,
                8276
            ],
            [
                8337,
                8339
            ],
            [
                8343,
                8392
            ],
            [
                8408,
                8414
            ],
            [
                8438,
                8440
            ],
            [
                8440,
                8510
            ],
            [
                8525,
                8541
            ],
            [
                8542,
                8616
            ],
            [
                8701,
                8708
            ],
            [
                8715,
                8733
            ],
            [
                8733,
                8789
            ],
            [
                8789,
                8857
            ],
            [
                8857,
                8967
            ],
            [
                8967,
                9020
            ],
            [
                9020,
                9132
            ],
            [
                9132,
                9169
            ],
            [
                9169,
                9218
            ],
            [
                9318,
                9366
            ],
            [
                9379,
                9500
            ],
            [
                9505,
                9537
            ],
            [
                9538,
                9600
            ],
            [
                9622,
                9664
            ],
            [
                9664,
                9665
            ],
            [
                9789,
                9796
            ],
            [
                9696,
                9709
            ],
            [
                9798,
                9829
            ],
            [
                9829,
                9889
            ],
            [
                9889,
                9936
            ],
            [
                9946,
                9985
            ],
            [
                9985,
                10006
            ],
            [
                10006,
                10088
            ],
            [
                10110,
                10168
            ],
            [
                10279,
                10333
            ],
            [
                10345,
                10347
            ],
            [
                10401,
                10415
            ],
            [
                10371,
                10376
            ],
            [
                10353,
                10365
            ],
            [
                10429,
                10438
            ],
            [
                10438,
                10452
            ],
            [
                10457,
                10508
            ],
            [
                10580,
                10590
            ],
            [
                10609,
                10616
            ],
            [
                10620,
                10701
            ],
            [
                10701,
                10702
            ],
            [
                10799,
                10824
            ],
            [
                10824,
                10833
            ],
            [
                10847,
                10883
            ],
            [
                10926,
                10927
            ],
            [
                10952,
                10957
            ],
            [
                10976,
                10988
            ],
            [
                10997,
                11000
            ],
            [
                11007,
                11018
            ],
            [
                11024,
                11036
            ],
            [
                11062,
                11063
            ],
            [
                11064,
                11085
            ],
            [
                11096,
                11098
            ],
            [
                11099,
                11157
            ],
            [
                11157,
                11188
            ],
            [
                11188,
                11218
            ],
            [
                11228,
                11231
            ],
            [
                11231,
                11242
            ],
            [
                11248,
                11250
            ],
            [
                11250,
                11283
            ],
            [
                11310,
                11371
            ],
            [
                11371,
                11381
            ],
            [
                11407,
                11410
            ],
            [
                11596,
                11597
            ],
            [
                11610,
                11611
            ],
            [
                11631,
                11686
            ],
            [
                11686,
                11717
            ],
            [
                11717,
                11737
            ],
            [
                11737,
                11766
            ],
            [
                11766,
                11813
            ],
            [
                11822,
                11840
            ],
            [
                11840,
                11843
            ],
            [
                11877,
                11933
            ],
            [
                11933,
                11961
            ],
            [
                11969,
                11991
            ],
            [
                11992,
                11993
            ],
            [
                12066,
                12143
            ],
            [
                12049,
                12051
            ],
            [
                12057,
                12059
            ],
            [
                12052,
                12056
            ],
            [
                12314,
                12315
            ],
            [
                12318,
                12348
            ],
            [
                12349,
                12354
            ],
            [
                12371,
                12395
            ],
            [
                12395,
                12442
            ],
            [
                12452,
                12474
            ],
            [
                12479,
                12493
            ],
            [
                12493,
                12522
            ],
            [
                12546,
                12548
            ],
            [
                12548,
                12602
            ],
            [
                12602,
                12607
            ],
            [
                12630,
                12655
            ],
            [
                12661,
                12663
            ],
            [
                12668,
                12706
            ],
            [
                12706,
                12729
            ],
            [
                12729,
                12767
            ],
            [
                12779,
                12802
            ],
            [
                12802,
                12839
            ],
            [
                12839,
                12844
            ],
            [
                12862,
                12880
            ],
            [
                12902,
                12953
            ],
            [
                13074,
                13127
            ],
            [
                13128,
                13129
            ],
            [
                13195,
                13223
            ],
            [
                13147,
                13156
            ],
            [
                13223,
                13225
            ],
            [
                13225,
                13263
            ],
            [
                13263,
                13286
            ],
            [
                13303,
                13306
            ],
            [
                13306,
                13337
            ],
            [
                13337,
                13462
            ],
            [
                13462,
                13484
            ],
            [
                13519,
                13522
            ],
            [
                13522,
                13583
            ],
            [
                13641,
                13701
            ],
            [
                13706,
                13716
            ],
            [
                13716,
                13725
            ],
            [
                13725,
                13809
            ],
            [
                13809,
                13871
            ],
            [
                13871,
                13892
            ],
            [
                13923,
                13934
            ],
            [
                13915,
                13916
            ],
            [
                13934,
                13936
            ],
            [
                13936,
                13939
            ],
            [
                13947,
                13973
            ],
            [
                13973,
                13985
            ],
            [
                13985,
                14054
            ],
            [
                14074,
                14078
            ],
            [
                14064,
                14073
            ],
            [
                14107,
                14175
            ],
            [
                14214,
                14223
            ],
            [
                14235,
                14254
            ],
            [
                14175,
                14177
            ],
            [
                14182,
                14213
            ],
            [
                14272,
                14294
            ],
            [
                14313,
                14323
            ],
            [
                14332,
                14359
            ],
            [
                14382,
                14465
            ],
            [
                14499,
                14500
            ],
            [
                14501,
                14624
            ],
            [
                14624,
                14642
            ],
            [
                14663,
                14674
            ],
            [
                14679,
                14695
            ],
            [
                14705,
                14727
            ],
            [
                14757,
                14772
            ],
            [
                14812,
                14822
            ],
            [
                14864,
                14875
            ],
            [
                14906,
                14923
            ],
            [
                14927,
                14948
            ],
            [
                14953,
                14961
            ],
            [
                14977,
                14979
            ],
            [
                14979,
                15032
            ],
            [
                15032,
                15101
            ],
            [
                15143,
                15180
            ],
            [
                15404,
                15556
            ],
            [
                15556,
                15605
            ],
            [
                15627,
                15750
            ],
            [
                15750,
                15930
            ],
            [
                16087,
                16130
            ],
            [
                16158,
                16160
            ],
            [
                16161,
                16251
            ],
            [
                16251,
                16490
            ],
            [
                16493,
                16577
            ],
            [
                16586,
                16603
            ],
            [
                16608,
                16613
            ],
            [
                16628,
                16648
            ],
            [
                16648,
                16686
            ],
            [
                16686,
                16743
            ],
            [
                16753,
                16785
            ],
            [
                16785,
                16818
            ],
            [
                16850,
                16852
            ],
            [
                16852,
                16938
            ],
            [
                16939,
                16990
            ],
            [
                16990,
                17047
            ],
            [
                17066,
                17090
            ],
            [
                17130,
                17133
            ],
            [
                17139,
                17167
            ],
            [
                17173,
                17190
            ],
            [
                17204,
                17257
            ],
            [
                17474,
                17513
            ],
            [
                17513,
                17549
            ],
            [
                17673,
                17674
            ],
            [
                17728,
                17778
            ],
            [
                17786,
                17800
            ],
            [
                17804,
                17810
            ],
            [
                17872,
                17874
            ],
            [
                18046,
                18049
            ],
            [
                17880,
                17890
            ],
            [
                17908,
                17917
            ],
            [
                17979,
                17980
            ],
            [
                17847,
                17871
            ],
            [
                17810,
                17820
            ],
            [
                17827,
                17846
            ],
            [
                17981,
                17984
            ],
            [
                17931,
                17938
            ],
            [
                18508,
                18533
            ],
            [
                18593,
                18603
            ],
            [
                18603,
                18683
            ],
            [
                18734,
                18737
            ],
            [
                18781,
                18804
            ],
            [
                18813,
                18904
            ],
            [
                18922,
                18929
            ],
            [
                18779,
                18780
            ],
            [
                18945,
                19017
            ],
            [
                19017,
                19080
            ],
            [
                19081,
                19102
            ],
            [
                19103,
                19290
            ],
            [
                19297,
                19349
            ]
        ],
        "row_chars": [
            [
                0,
                77
            ],
            [
                77,
                181
            ],
            [
                181,
                304
            ],
            [
                304,
                384
            ],
            [
                384,
                446
            ],
            [
                446,
                555
            ],
            [
                555,
                714
            ],
            [
                714,
                999
            ],
            [
                999,
                1338
            ],
            [
                1338,
                1613
            ],
            [
                1613,
                1656
            ],
            [
                1656,
                1806
            ],
            [
                1806,
                1901
            ],
            [
                1901,
                1982
            ],
            [
                1982,
                2186
            ],
            [
                2186,
                2290
            ],
            [
                2290,
                2436
            ],
            [
                2436,
                2578
            ],
            [
                2578,
                2676
            ],
            [
                2676,
                2712
            ],
            [
                2712,
                2759
            ],
            [
                2759,
                2828
            ],
            [
                2828,
                2876
            ],
            [
                2876,
                2921
            ],
            [
                2921,
                3004
            ],
            [
                3004,
                3086
            ],
            [
                3086,
                3166
            ],
            [
                3166,
                3293
            ],
            [
                3293,
                3452
            ],
            [
                3452,
                3641
            ],
            [
                3641,
                3703
            ],
            [
                3703,
                3797
            ],
            [
                3797,
                3883
            ],
            [
                3883,
                3980
            ],
            [
                3980,
                4175
            ],
            [
                4175,
                4321
            ],
            [
                4321,
                4384
            ],
            [
                4384,
                4518
            ],
            [
                4518,
                4565
            ],
            [
                4565,
                4603
            ],
            [
                4603,
                4628
            ],
            [
                4628,
                4842
            ],
            [
                4842,
                4933
            ],
            [
                4933,
                4961
            ],
            [
                4961,
                4971
            ],
            [
                4971,
                4987
            ],
            [
                4987,
                5037
            ],
            [
                5037,
                5151
            ],
            [
                5151,
                5292
            ],
            [
                5292,
                5397
            ],
            [
                5397,
                5422
            ],
            [
                5422,
                5473
            ],
            [
                5473,
                5497
            ],
            [
                5497,
                5537
            ],
            [
                5537,
                5608
            ],
            [
                5608,
                5637
            ],
            [
                5637,
                5750
            ],
            [
                5750,
                5808
            ],
            [
                5808,
                5897
            ],
            [
                5897,
                6114
            ],
            [
                6114,
                6159
            ],
            [
                6159,
                6257
            ],
            [
                6257,
                6488
            ],
            [
                6488,
                6627
            ],
            [
                6627,
                6724
            ],
            [
                6724,
                6840
            ],
            [
                6840,
                6942
            ],
            [
                6942,
                6994
            ],
            [
                6994,
                7057
            ],
            [
                7057,
                7152
            ],
            [
                7152,
                7188
            ],
            [
                7188,
                7212
            ],
            [
                7212,
                7254
            ],
            [
                7254,
                7516
            ],
            [
                7516,
                7631
            ],
            [
                7631,
                7746
            ],
            [
                7746,
                7812
            ],
            [
                7812,
                7956
            ],
            [
                7956,
                8157
            ],
            [
                8157,
                8218
            ],
            [
                8218,
                8339
            ],
            [
                8339,
                8440
            ],
            [
                8440,
                8542
            ],
            [
                8542,
                8733
            ],
            [
                8733,
                8789
            ],
            [
                8789,
                8857
            ],
            [
                8857,
                8967
            ],
            [
                8967,
                9020
            ],
            [
                9020,
                9132
            ],
            [
                9132,
                9169
            ],
            [
                9169,
                9220
            ],
            [
                9220,
                9318
            ],
            [
                9318,
                9664
            ],
            [
                9664,
                9798
            ],
            [
                9798,
                9829
            ],
            [
                9829,
                9889
            ],
            [
                9889,
                9985
            ],
            [
                9985,
                10006
            ],
            [
                10006,
                10110
            ],
            [
                10110,
                10168
            ],
            [
                10168,
                10279
            ],
            [
                10279,
                10347
            ],
            [
                10347,
                10438
            ],
            [
                10438,
                10508
            ],
            [
                10508,
                10580
            ],
            [
                10580,
                10703
            ],
            [
                10703,
                10799
            ],
            [
                10799,
                10824
            ],
            [
                10824,
                10928
            ],
            [
                10928,
                10952
            ],
            [
                10952,
                11064
            ],
            [
                11064,
                11098
            ],
            [
                11098,
                11157
            ],
            [
                11157,
                11188
            ],
            [
                11188,
                11231
            ],
            [
                11231,
                11250
            ],
            [
                11250,
                11283
            ],
            [
                11283,
                11310
            ],
            [
                11310,
                11371
            ],
            [
                11371,
                11410
            ],
            [
                11410,
                11438
            ],
            [
                11438,
                11482
            ],
            [
                11482,
                11505
            ],
            [
                11505,
                11544
            ],
            [
                11544,
                11596
            ],
            [
                11596,
                11686
            ],
            [
                11686,
                11717
            ],
            [
                11717,
                11737
            ],
            [
                11737,
                11766
            ],
            [
                11766,
                11840
            ],
            [
                11840,
                11933
            ],
            [
                11933,
                11992
            ],
            [
                11992,
                12146
            ],
            [
                12146,
                12314
            ],
            [
                12314,
                12349
            ],
            [
                12349,
                12357
            ],
            [
                12357,
                12395
            ],
            [
                12395,
                12493
            ],
            [
                12493,
                12548
            ],
            [
                12548,
                12602
            ],
            [
                12602,
                12706
            ],
            [
                12706,
                12729
            ],
            [
                12729,
                12802
            ],
            [
                12802,
                12839
            ],
            [
                12839,
                12953
            ],
            [
                12953,
                12992
            ],
            [
                12992,
                13000
            ],
            [
                13000,
                13061
            ],
            [
                13061,
                13128
            ],
            [
                13128,
                13225
            ],
            [
                13225,
                13263
            ],
            [
                13263,
                13306
            ],
            [
                13306,
                13337
            ],
            [
                13337,
                13462
            ],
            [
                13462,
                13522
            ],
            [
                13522,
                13583
            ],
            [
                13583,
                13641
            ],
            [
                13641,
                13716
            ],
            [
                13716,
                13725
            ],
            [
                13725,
                13809
            ],
            [
                13809,
                13871
            ],
            [
                13871,
                13936
            ],
            [
                13936,
                13973
            ],
            [
                13973,
                13985
            ],
            [
                13985,
                14054
            ],
            [
                14054,
                14175
            ],
            [
                14175,
                14501
            ],
            [
                14501,
                14624
            ],
            [
                14624,
                14878
            ],
            [
                14878,
                14906
            ],
            [
                14906,
                14927
            ],
            [
                14927,
                14979
            ],
            [
                14979,
                15032
            ],
            [
                15032,
                15180
            ],
            [
                15180,
                15214
            ],
            [
                15214,
                15263
            ],
            [
                15263,
                15404
            ],
            [
                15404,
                15556
            ],
            [
                15556,
                15750
            ],
            [
                15750,
                15930
            ],
            [
                15930,
                16086
            ],
            [
                16086,
                16160
            ],
            [
                16160,
                16251
            ],
            [
                16251,
                16493
            ],
            [
                16493,
                16648
            ],
            [
                16648,
                16686
            ],
            [
                16686,
                16785
            ],
            [
                16785,
                16852
            ],
            [
                16852,
                16939
            ],
            [
                16939,
                16990
            ],
            [
                16990,
                17258
            ],
            [
                17258,
                17362
            ],
            [
                17362,
                17474
            ],
            [
                17474,
                17513
            ],
            [
                17513,
                17675
            ],
            [
                17675,
                17728
            ],
            [
                17728,
                17810
            ],
            [
                17810,
                18603
            ],
            [
                18603,
                18683
            ],
            [
                18683,
                18945
            ],
            [
                18945,
                19017
            ],
            [
                19017,
                19081
            ],
            [
                19081,
                19349
            ]
        ]
    },
    "abridged": {
        "text": "The Pallisers did not remain long in Baden after the payment of Burgo's bill. They hurried away to Strasbourg the same day.\nThe journey home from there was uneventful. Gradually Mr. Palliser became a little more lenient to his wife and slightly less oppressive in his caution. By the time that they reached Dover he had become so used to his wife's condition that he made only a little fluttering as she walked out of the boat by the narrow gangway.\nDuring their journey home Mr. Palliser had soon found that it was easier to talk to Mr. Grey than to his wife, and, consequently, the two ladies were much together, as were the two gentlemen. What the ladies discussed may be imagined. One was about to become a wife and the other a mother, after each had made up her mind that neither thing would happen. It may, however, be presumed that for every word that Alice spoke Lady Glencora spoke ten.\nThe two men were intent upon politics. Mr. Palliser was eager in recommending public life to his new friend.\n\"Your argument would be very well,\" said Mr. Grey, \"for a man who felt that he could do good to others by going into public life. But it is wholly ineffective if it recommends public life simply because a man may gratify his own ambition by public services.\"\n\"Of course there is personal gratification, and of course there is good done,\" said Mr. Palliser. \"The two things go together. The chief gratification comes from the feeling that you are of use.\"\n\"But if you feel that you would not be of use?\"\nWe need not follow the argument any further. We all know its nature. But the effect was partly that which the weaker man of the two desired - the weaker in being less gifted, though art had in some respects made him stronger. Mr. Grey was shaken in his philosophy, and startled and delighted Alice by what he said as he walked with her in the courts of the Louvre.\n\"It's all hollow here,\" he said, speaking of French politics.\n\"Very hollow,\" said Alice.\n\"Of all modes of governing this seems to me to be the surest of coming to a downfall. Men are told that they are wise enough to talk, but not wise enough to have any power of action.\"\n\"It's so odd to hear you talk politics,\" said Alice, laughing.\nAfter this he dropped the subject for a while, as though he were ashamed of it, but in a few minutes he returned to it manfully. \"Mr. Palliser wants me to go into Parliament.\"\nAlice said nothing. She was afraid to speak. After all that had passed she felt that it would not become her to show much outward joy on hearing this, and yet she could not speak without some sign of exultation in her voice. So she walked on without speaking, and was conscious that her fingers trembled on his arm.\n\"What do you say about it?\" he asked.\n\"Oh, John, what right can I have to say anything?\"\n\"No one else can have so much right. He asked me whether I could afford it. I believe that I could, if I could get a seat that was not very expensive at the first outset. He could help me there. Living in London for four or five months in the year might be managed. But as to the mode of life!\"\nThen Alice was unable to hold her tongue, and spoke her thoughts. No doubt he combated them. He seldom allowed outspoken enthusiasm to pass by him without some opposition. But he was not so perverse as to be driven from his new views by the fact that Alice approved them, and she was able to think that the only flaw in his character was in the process of being cured.\nWhen they reached London they all separated. Mr. Palliser intended to take his wife down to Matching with as little delay as possible. London was nearly empty; it was now the first week of August, and Parliament had not been sitting for nearly two months. Lady Glencora was to stay only one day in Park Lane, and she and Alice would not see each other.\n\"How odd it is parting in this way, when people have been together so long,\" said Lady Glencora. \"It seems as though the time had a separate little life of its own which is now brought to a close.\"\n\"Alice,\" said Mr. Palliser, as he gave her his hand, \"give my compliments to your father, and tell him that I shall invite him to come down to Matching for the shooting in September, and that I shall expect him to bring you. You may tell him also that he will have to stay to see you off after your marriage, but that he will not be allowed to take you away.\" Lady Glencora thought that this was very prettily put, and so she told her husband on their way home.\nAlice insisted on going to Queen Anne Street in a cab by herself. She wished to be alone when she first received her father's congratulations. But when she reached Queen Anne Street, the house was desolate. She found a letter waiting for her which made her forget everything else. Lady Macleod, at Cheltenham, was very ill, and wished to see her niece before she died.\n\"I have got your letter,\" said the kind old woman, \"and am now quite happy, because my girl will be happy at last. Will she forgive me if I say that I have forgiven her?\" The letter then went on to beg Alice to come to Cheltenham at once. \"It is not that I am dying now,\" said Lady Macleod, \"though you will find me much altered and keeping my bed. But the doctor says he fears the first cold weather. I know what that means, my dear; and if I don't see you now, before your marriage, I shall never see you again. Pray get married as soon as you can. I want to know that you are Mrs. Grey before I go.\"\nThere was another letter for her from Kate, full of congratulations, and promising to be at the wedding; \"that is,\" said Kate, \"unless it takes place at the house of some of your very grand friends;\" and also telling her that aunt Greenow was to be married in a fortnight, and begging her to attend that wedding. \"Do come,\" said Kate. \"Journeys are nothing nowadays. Don't you know I would go seven times the distance for you? Mr. Cheesacre and Captain Bellfield are friends again, and Mr. Cheesacre is to be best man. Is it not beautiful? As for poor me, I'm told I haven't a chance left of becoming mistress of Oileymead. \"\nAlice began to think that her hands were almost too full. Yet she did not know how to refuse any of the requests. She must of course visit Lady Macleod at once. She would stay one day in London, and then go down to Cheltenham. As to that wedding in Westmorland, she sighed as she thought of it, but she feared that she must go there also, for Kate's sake.\nThen her father came in. \"I didn't know when you might arrive,\" said he apologetically.\nAlice refrained from reminding him that she had told him the precise time of the train.\n\"It's all right, papa. I was very glad to have an hour to write a letter or two. Poor Lady Macleod is very ill. I must go to her the day after tomorrow.\"\n\"Dear, dear! I had heard that she was poorly. So, Alice, you've made it all square with Mr. Grey at last?\"\n\"Yes, papa.\"\n\"Well; I can tell you this, Alice, he is a man in a thousand. You've heard about the money?\"\n\"What money, papa?\"\n\"The money that George had.\" As the reader is aware, Alice had heard nothing about this money. She thought that she had given three thousand pounds to her cousin. But now her father explained the whole transaction.\n\"Grey knew that some men must have rope enough before they can hang themselves,\" he said.\n\"Mr. Grey must be paid, papa,\" she said.\n\"Paid! He can pay himself now. It may make some difference in the settlements, but he and the lawyers can arrange that. I shan't think of interfering. If you could only know, my dear, what I've suffered!\" Alice expressed her sorrow, and he assured her that he had forgiven her. \"Bless you, my child!\" he said, \"and make you happy, and good - and very comfortable.\" After that he went back to his club.\nAlice travelled down to Cheltenham, and was received by Lady Macleod with open arms. The old lady was very eager to know all about the coming marriage.\n\"I knew he'd persist for ever, my dear. He told me so himself in confidence.\"\n\"He has persisted, aunt, certainly.\"\n\"And I hope you'll reward him. A beautiful woman without discretion is like a pearl in a swine's snout; but a good wife is a crown of glory to her husband. Remember that, my dear.\"\n\"I won't be that unfortunate pearl, if I can help it, aunt.\"\n\"And Alice, you must be careful to find out all his likes and dislikes. Dear me! I remember how hard I found it, but then I don't think I was so clever as you are.\"\n\"Sometimes I think nobody has ever been so stupid as I have.\"\n\"Not stupid, my dear; self-willed, perhaps. But all that is forgiven now. Is it not?\"\n\"There is a forgiveness which it is rather hard to get,\" said Alice.\nHer aunt said something about looking for pardon beyond this world, which I need not here repeat. Alice was much more attentive than usual to her old friend's little sermons, so that Lady Macleod took heart, and at last brought forth a letter from the Countess of Midlothian, which she had received a day or two since.\n\"I was not quite sure whether I'd show it you,\" said Lady Macleod, \"because you wouldn't answer her when she wrote to you. But when I'm gone, she will be your nearest relative on your mother's side, you know, Alice.\"\nThe letter was as follows:\nDear Lady Macleod,-\nI am sorry to hear of your symptoms. I strongly advise you to depend chiefly on beef-tea. They should be very careful to send it up quite free from grease, and there should be no vegetables in it. I would go to you if I thought that my presence would be any comfort to you, but I know how sensitive you are, and the shock might be too much for you.\nIf you see Alice Vavasor on her return to England, pray tell her from me that I give her my warmest congratulations, and that I am heartily glad that matters are arranged. I think she treated my attempts to heal the wound in a manner that they did not deserve; but all that shall be forgiven, as shall also her original bad behaviour to poor Mr. Grey.\nI trust that we may yet meet and be friends. I am extremely gratified at finding that she has been thought so much of by Mr. Palliser. I'm told that Mr. Palliser and Mr. Grey have become great friends, and if this is so, Alice must be happy to feel that she has had it in her power to confer so great a benefit on her future husband as he will receive from this introduction.\n\"I ain't a bit happy, and I have conferred no benefit on Mr. Grey,\" exclaimed Alice, unable to repress her anger at the last paragraph.\n\"But it is a great benefit, my dear.\"\n\"Mr. Palliser has every bit as much cause to be gratified as Mr. Grey, and perhaps more.\"\nPoor Lady Macleod could not argue. She merely sighed, and moved her shrivelled old hand up and down upon the counterpane.\nAlice finished the letter without further remarks. It merely went on to say how happy the writer would be to see her cousin as Mrs. Grey, and gave a general invitation to Mr. and Mrs. Grey to come to Castle Reekie whenever they might be able.\n\"I'm sure she means well,\" said Alice.\n\"Indeed she does,\" said Lady Macleod.\nAlice remained a week with her aunt, and went from there direct to Westmorland. On her single day in London, we must presume she gave some order about bridal preparations; and she had a very urgent letter from Glencora. If the marriage did not take place in September she would not be present at it. It had been decided that Lady Glencora was to be moved in October to Gatherum Castle, and remain there till the following spring, so that the heir would be born there.\n\"It is such a bore,\" said Lady Glencora, \"and I know it will be a girl. But the Duke isn't to be there, except for the Christmas week.\"\nAn invitation for the wedding ceremony at Matching had been sent from Mr. Palliser to Mr. Vavasor, and another from Lady Glencora to Kate, \"whom I long to know,\" said her ladyship, \"and with whom I should like to pick an argument, if I dared, as I'm sure she did all the mischief.\"",
        "paragraph_chars": [
            [
                0,
                124
            ],
            [
                124,
                450
            ],
            [
                450,
                896
            ],
            [
                896,
                1005
            ],
            [
                1005,
                1264
            ],
            [
                1264,
                1460
            ],
            [
                1460,
                1508
            ],
            [
                1508,
                1873
            ],
            [
                1873,
                1935
            ],
            [
                1935,
                1962
            ],
            [
                1962,
                2146
            ],
            [
                2146,
                2209
            ],
            [
                2209,
                2385
            ],
            [
                2385,
                2701
            ],
            [
                2701,
                2739
            ],
            [
                2739,
                2790
            ],
            [
                2790,
                3085
            ],
            [
                3085,
                3454
            ],
            [
                3454,
                3807
            ],
            [
                3807,
                4005
            ],
            [
                4005,
                4467
            ],
            [
                4467,
                4836
            ],
            [
                4836,
                5439
            ],
            [
                5439,
                6065
            ],
            [
                6065,
                6421
            ],
            [
                6421,
                6509
            ],
            [
                6509,
                6597
            ],
            [
                6597,
                6751
            ],
            [
                6751,
                6858
            ],
            [
                6858,
                6871
            ],
            [
                6871,
                6964
            ],
            [
                6964,
                6984
            ],
            [
                6984,
                7199
            ],
            [
                7199,
                7289
            ],
            [
                7289,
                7330
            ],
            [
                7330,
                7732
            ],
            [
                7732,
                7884
            ],
            [
                7884,
                7962
            ],
            [
                7962,
                7999
            ],
            [
                7999,
                8180
            ],
            [
                8180,
                8241
            ],
            [
                8241,
                8406
            ],
            [
                8406,
                8468
            ],
            [
                8468,
                8554
            ],
            [
                8554,
                8623
            ],
            [
                8623,
                8942
            ],
            [
                8942,
                9159
            ],
            [
                9159,
                9186
            ],
            [
                9186,
                9206
            ],
            [
                9206,
                9555
            ],
            [
                9555,
                9907
            ],
            [
                9907,
                10283
            ],
            [
                10283,
                10419
            ],
            [
                10419,
                10457
            ],
            [
                10457,
                10547
            ],
            [
                10547,
                10669
            ],
            [
                10669,
                10912
            ],
            [
                10912,
                10951
            ],
            [
                10951,
                10989
            ],
            [
                10989,
                11457
            ],
            [
                11457,
                11593
            ],
            [
                11593,
                11874
            ]
        ],
        "segment_chars": [
            [
                0,
                78
            ],
            [
                78,
                124
            ],
            [
                124,
                168
            ],
            [
                168,
                277
            ],
            [
                277,
                450
            ],
            [
                450,
                642
            ],
            [
                642,
                685
            ],
            [
                685,
                805
            ],
            [
                805,
                896
            ],
            [
                896,
                935
            ],
            [
                935,
                1005
            ],
            [
                1005,
                1135
            ],
            [
                1135,
                1264
            ],
            [
                1264,
                1362
            ],
            [
                1362,
                1391
            ],
            [
                1391,
                1460
            ],
            [
                1460,
                1508
            ],
            [
                1508,
                1553
            ],
            [
                1553,
                1577
            ],
            [
                1577,
                1734
            ],
            [
                1734,
                1873
            ],
            [
                1873,
                1935
            ],
            [
                1935,
                1962
            ],
            [
                1962,
                2048
            ],
            [
                2048,
                2146
            ],
            [
                2146,
                2209
            ],
            [
                2209,
                2338
            ],
            [
                2338,
                2385
            ],
            [
                2385,
                2405
            ],
            [
                2405,
                2430
            ],
            [
                2430,
                2610
            ],
            [
                2610,
                2701
            ],
            [
                2701,
                2729
            ],
            [
                2729,
                2739
            ],
            [
                2739,
                2790
            ],
            [
                2790,
                2827
            ],
            [
                2827,
                2866
            ],
            [
                2866,
                2961
            ],
            [
                2961,
                2985
            ],
            [
                2985,
                3056
            ],
            [
                3056,
                3085
            ],
            [
                3085,
                3151
            ],
            [
                3151,
                3178
            ],
            [
                3178,
                3257
            ],
            [
                3257,
                3454
            ],
            [
                3454,
                3499
            ],
            [
                3499,
                3589
            ],
            [
                3589,
                3710
            ],
            [
                3710,
                3807
            ],
            [
                3807,
                3904
            ],
            [
                3904,
                4005
            ],
            [
                4005,
                4230
            ],
            [
                4230,
                4365
            ],
            [
                4365,
                4467
            ],
            [
                4467,
                4533
            ],
            [
                4533,
                4610
            ],
            [
                4610,
                4674
            ],
            [
                4674,
                4748
            ],
            [
                4748,
                4836
            ],
            [
                4836,
                4951
            ],
            [
                4951,
                5007
            ],
            [
                5007,
                5075
            ],
            [
                5075,
                5185
            ],
            [
                5185,
                5238
            ],
            [
                5238,
                5350
            ],
            [
                5350,
                5387
            ],
            [
                5387,
                5439
            ],
            [
                5439,
                5752
            ],
            [
                5752,
                5774
            ],
            [
                5774,
                5806
            ],
            [
                5806,
                5866
            ],
            [
                5866,
                5958
            ],
            [
                5958,
                5979
            ],
            [
                5979,
                6065
            ],
            [
                6065,
                6123
            ],
            [
                6123,
                6179
            ],
            [
                6179,
                6226
            ],
            [
                6226,
                6292
            ],
            [
                6292,
                6421
            ],
            [
                6421,
                6446
            ],
            [
                6446,
                6509
            ],
            [
                6509,
                6597
            ],
            [
                6597,
                6620
            ],
            [
                6620,
                6678
            ],
            [
                6678,
                6709
            ],
            [
                6709,
                6751
            ],
            [
                6751,
                6764
            ],
            [
                6764,
                6797
            ],
            [
                6797,
                6858
            ],
            [
                6858,
                6871
            ],
            [
                6871,
                6933
            ],
            [
                6933,
                6964
            ],
            [
                6964,
                6984
            ],
            [
                6984,
                7013
            ],
            [
                7013,
                7079
            ],
            [
                7079,
                7147
            ],
            [
                7147,
                7199
            ],
            [
                7199,
                7289
            ],
            [
                7289,
                7330
            ],
            [
                7330,
                7337
            ],
            [
                7337,
                7361
            ],
            [
                7361,
                7450
            ],
            [
                7450,
                7481
            ],
            [
                7481,
                7535
            ],
            [
                7535,
                7608
            ],
            [
                7608,
                7631
            ],
            [
                7631,
                7695
            ],
            [
                7695,
                7732
            ],
            [
                7732,
                7817
            ],
            [
                7817,
                7884
            ],
            [
                7884,
                7924
            ],
            [
                7924,
                7962
            ],
            [
                7962,
                7999
            ],
            [
                7999,
                8030
            ],
            [
                8030,
                8155
            ],
            [
                8155,
                8180
            ],
            [
                8180,
                8241
            ],
            [
                8241,
                8313
            ],
            [
                8313,
                8322
            ],
            [
                8322,
                8406
            ],
            [
                8406,
                8468
            ],
            [
                8468,
                8512
            ],
            [
                8512,
                8542
            ],
            [
                8542,
                8554
            ],
            [
                8554,
                8623
            ],
            [
                8623,
                8721
            ],
            [
                8721,
                8942
            ],
            [
                8942,
                9065
            ],
            [
                9065,
                9159
            ],
            [
                9159,
                9186
            ],
            [
                9186,
                9206
            ],
            [
                9206,
                9243
            ],
            [
                9243,
                9296
            ],
            [
                9296,
                9403
            ],
            [
                9403,
                9555
            ],
            [
                9555,
                9727
            ],
            [
                9727,
                9907
            ],
            [
                9907,
                9952
            ],
            [
                9952,
                10042
            ],
            [
                10042,
                10283
            ],
            [
                10283,
                10419
            ],
            [
                10419,
                10457
            ],
            [
                10457,
                10547
            ],
            [
                10547,
                10582
            ],
            [
                10582,
                10669
            ],
            [
                10669,
                10720
            ],
            [
                10720,
                10912
            ],
            [
                10912,
                10951
            ],
            [
                10951,
                10989
            ],
            [
                10989,
                11069
            ],
            [
                11069,
                11209
            ],
            [
                11209,
                11289
            ],
            [
                11289,
                11457
            ],
            [
                11457,
                11529
            ],
            [
                11529,
                11593
            ],
            [
                11593,
                11874
            ]
        ],
        "overlap_chars": [
            [
                4,
                8
            ],
            [
                14,
                78
            ],
            [
                83,
                122
            ],
            [
                122,
                124
            ],
            [
                124,
                145
            ],
            [
                152,
                155
            ],
            [
                166,
                168
            ],
            [
                168,
                277
            ],
            [
                277,
                371
            ],
            [
                377,
                378
            ],
            [
                379,
                429
            ],
            [
                434,
                448
            ],
            [
                448,
                449
            ],
            [
                450,
                488
            ],
            [
                489,
                594
            ],
            [
                600,
                617
            ],
            [
                623,
                642
            ],
            [
                642,
                685
            ],
            [
                685,
                739
            ],
            [
                740,
                776
            ],
            [
                803,
                805
            ],
            [
                805,
                848
            ],
            [
                849,
                895
            ],
            [
                896,
                907
            ],
            [
                908,
                935
            ],
            [
                935,
                947
            ],
            [
                948,
                973
            ],
            [
                986,
                988
            ],
            [
                989,
                1003
            ],
            [
                1003,
                1004
            ],
            [
                1005,
                1045
            ],
            [
                1054,
                1057
            ],
            [
                1061,
                1135
            ],
            [
                1135,
                1151
            ],
            [
                1164,
                1199
            ],
            [
                1200,
                1264
            ],
            [
                1264,
                1361
            ],
            [
                1362,
                1363
            ],
            [
                1363,
                1377
            ],
            [
                1378,
                1391
            ],
            [
                1391,
                1460
            ],
            [
                1460,
                1508
            ],
            [
                1508,
                1553
            ],
            [
                1553,
                1575
            ],
            [
                1575,
                1577
            ],
            [
                1577,
                1647
            ],
            [
                1650,
                1663
            ],
            [
                1681,
                1734
            ],
            [
                1734,
                1760
            ],
            [
                1761,
                1785
            ],
            [
                1790,
                1799
            ],
            [
                1800,
                1805
            ],
            [
                1806,
                1808
            ],
            [
                1814,
                1872
            ],
            [
                1873,
                1935
            ],
            [
                1935,
                1960
            ],
            [
                1960,
                1962
            ],
            [
                1962,
                2048
            ],
            [
                2048,
                2143
            ],
            [
                2146,
                2209
            ],
            [
                2209,
                2297
            ],
            [
                2298,
                2338
            ],
            [
                2338,
                2384
            ],
            [
                2385,
                2405
            ],
            [
                2405,
                2430
            ],
            [
                2430,
                2529
            ],
            [
                2534,
                2553
            ],
            [
                2564,
                2610
            ],
            [
                2610,
                2700
            ],
            [
                2701,
                2729
            ],
            [
                2729,
                2739
            ],
            [
                2740,
                2790
            ],
            [
                2790,
                2825
            ],
            [
                2825,
                2827
            ],
            [
                2827,
                2864
            ],
            [
                2864,
                2866
            ],
            [
                2866,
                2888
            ],
            [
                2888,
                2961
            ],
            [
                2961,
                2983
            ],
            [
                2985,
                3056
            ],
            [
                3056,
                3085
            ],
            [
                3085,
                3125
            ],
            [
                3125,
                3136
            ],
            [
                3137,
                3149
            ],
            [
                3149,
                3151
            ],
            [
                3151,
                3176
            ],
            [
                3176,
                3178
            ],
            [
                3178,
                3195
            ],
            [
                3206,
                3244
            ],
            [
                3255,
                3257
            ],
            [
                3257,
                3364
            ],
            [
                3365,
                3425
            ],
            [
                3430,
                3454
            ],
            [
                3454,
                3499
            ],
            [
                3501,
                3511
            ],
            [
                3521,
                3589
            ],
            [
                3589,
                3599
            ],
            [
                3600,
                3612
            ],
            [
                3614,
                3654
            ],
            [
                3655,
                3708
            ],
            [
                3708,
                3710
            ],
            [
                3710,
                3735
            ],
            [
                3741,
                3766
            ],
            [
                3771,
                3780
            ],
            [
                3787,
                3790
            ],
            [
                3791,
                3807
            ],
            [
                3807,
                3904
            ],
            [
                3904,
                3907
            ],
            [
                3908,
                3923
            ],
            [
                3933,
                3936
            ],
            [
                3937,
                3976
            ],
            [
                3980,
                3983
            ],
            [
                3984,
                4002
            ],
            [
                4005,
                4013
            ],
            [
                4014,
                4018
            ],
            [
                4031,
                4043
            ],
            [
                4048,
                4056
            ],
            [
                4056,
                4120
            ],
            [
                4128,
                4164
            ],
            [
                4165,
                4228
            ],
            [
                4228,
                4230
            ],
            [
                4230,
                4292
            ],
            [
                4312,
                4365
            ],
            [
                4365,
                4405
            ],
            [
                4418,
                4435
            ],
            [
                4436,
                4447
            ],
            [
                4448,
                4467
            ],
            [
                4467,
                4533
            ],
            [
                4533,
                4536
            ],
            [
                4547,
                4549
            ],
            [
                4556,
                4610
            ],
            [
                4614,
                4672
            ],
            [
                4672,
                4674
            ],
            [
                4674,
                4723
            ],
            [
                4724,
                4730
            ],
            [
                4746,
                4748
            ],
            [
                4748,
                4818
            ],
            [
                4819,
                4835
            ],
            [
                4836,
                4910
            ],
            [
                4920,
                4927
            ],
            [
                4933,
                4951
            ],
            [
                4951,
                5007
            ],
            [
                5007,
                5075
            ],
            [
                5075,
                5185
            ],
            [
                5185,
                5238
            ],
            [
                5238,
                5350
            ],
            [
                5350,
                5387
            ],
            [
                5387,
                5436
            ],
            [
                5439,
                5487
            ],
            [
                5488,
                5609
            ],
            [
                5610,
                5642
            ],
            [
                5648,
                5710
            ],
            [
                5710,
                5752
            ],
            [
                5752,
                5753
            ],
            [
                5753,
                5760
            ],
            [
                5760,
                5773
            ],
            [
                5775,
                5806
            ],
            [
                5806,
                5866
            ],
            [
                5866,
                5913
            ],
            [
                5919,
                5958
            ],
            [
                5958,
                5979
            ],
            [
                5979,
                6061
            ],
            [
                6065,
                6123
            ],
            [
                6123,
                6177
            ],
            [
                6177,
                6179
            ],
            [
                6183,
                6197
            ],
            [
                6198,
                6203
            ],
            [
                6204,
                6216
            ],
            [
                6217,
                6226
            ],
            [
                6226,
                6240
            ],
            [
                6241,
                6292
            ],
            [
                6292,
                6302
            ],
            [
                6311,
                6318
            ],
            [
                6321,
                6402
            ],
            [
                6419,
                6420
            ],
            [
                6421,
                6446
            ],
            [
                6446,
                6455
            ],
            [
                6456,
                6492
            ],
            [
                6507,
                6508
            ],
            [
                6509,
                6514
            ],
            [
                6540,
                6552
            ],
            [
                6553,
                6556
            ],
            [
                6566,
                6577
            ],
            [
                6583,
                6595
            ],
            [
                6595,
                6596
            ],
            [
                6597,
                6618
            ],
            [
                6618,
                6620
            ],
            [
                6620,
                6678
            ],
            [
                6678,
                6709
            ],
            [
                6709,
                6739
            ],
            [
                6748,
                6751
            ],
            [
                6751,
                6762
            ],
            [
                6762,
                6764
            ],
            [
                6764,
                6797
            ],
            [
                6797,
                6858
            ],
            [
                6858,
                6868
            ],
            [
                6868,
                6871
            ],
            [
                6871,
                6872
            ],
            [
                6876,
                6877
            ],
            [
                6878,
                6933
            ],
            [
                6933,
                6964
            ],
            [
                6964,
                6984
            ],
            [
                6984,
                7013
            ],
            [
                7013,
                7060
            ],
            [
                7061,
                7079
            ],
            [
                7079,
                7082
            ],
            [
                7091,
                7147
            ],
            [
                7147,
                7175
            ],
            [
                7176,
                7198
            ],
            [
                7199,
                7200
            ],
            [
                7200,
                7277
            ],
            [
                7277,
                7279
            ],
            [
                7280,
                7282
            ],
            [
                7283,
                7287
            ],
            [
                7289,
                7290
            ],
            [
                7299,
                7329
            ],
            [
                7330,
                7335
            ],
            [
                7337,
                7361
            ],
            [
                7361,
                7408
            ],
            [
                7409,
                7431
            ],
            [
                7436,
                7450
            ],
            [
                7450,
                7479
            ],
            [
                7479,
                7481
            ],
            [
                7481,
                7535
            ],
            [
                7535,
                7540
            ],
            [
                7541,
                7566
            ],
            [
                7567,
                7569
            ],
            [
                7570,
                7608
            ],
            [
                7608,
                7631
            ],
            [
                7631,
                7669
            ],
            [
                7672,
                7695
            ],
            [
                7695,
                7732
            ],
            [
                7732,
                7737
            ],
            [
                7748,
                7766
            ],
            [
                7766,
                7817
            ],
            [
                7830,
                7883
            ],
            [
                7884,
                7885
            ],
            [
                7885,
                7913
            ],
            [
                7913,
                7922
            ],
            [
                7922,
                7924
            ],
            [
                7924,
                7962
            ],
            [
                7962,
                7985
            ],
            [
                7996,
                7999
            ],
            [
                7999,
                8030
            ],
            [
                8030,
                8155
            ],
            [
                8155,
                8177
            ],
            [
                8177,
                8180
            ],
            [
                8180,
                8241
            ],
            [
                8242,
                8302
            ],
            [
                8303,
                8313
            ],
            [
                8313,
                8322
            ],
            [
                8322,
                8406
            ],
            [
                8406,
                8468
            ],
            [
                8468,
                8489
            ],
            [
                8490,
                8501
            ],
            [
                8501,
                8502
            ],
            [
                8510,
                8512
            ],
            [
                8512,
                8515
            ],
            [
                8516,
                8542
            ],
            [
                8542,
                8554
            ],
            [
                8554,
                8623
            ],
            [
                8632,
                8636
            ],
            [
                8637,
                8646
            ],
            [
                8653,
                8721
            ],
            [
                8721,
                8730
            ],
            [
                8736,
                8755
            ],
            [
                8762,
                8764
            ],
            [
                8765,
                8796
            ],
            [
                8796,
                8818
            ],
            [
                8819,
                8829
            ],
            [
                8829,
                8856
            ],
            [
                8857,
                8940
            ],
            [
                8940,
                8941
            ],
            [
                8942,
                9065
            ],
            [
                9065,
                9083
            ],
            [
                9084,
                9095
            ],
            [
                9101,
                9117
            ],
            [
                9118,
                9140
            ],
            [
                9141,
                9156
            ],
            [
                9159,
                9169
            ],
            [
                9174,
                9185
            ],
            [
                9186,
                9203
            ],
            [
                9206,
                9227
            ],
            [
                9233,
                9241
            ],
            [
                9241,
                9243
            ],
            [
                9243,
                9296
            ],
            [
                9296,
                9365
            ],
            [
                9366,
                9403
            ],
            [
                9403,
                9555
            ],
            [
                9555,
                9604
            ],
            [
                9604,
                9727
            ],
            [
                9727,
                9907
            ],
            [
                9907,
                9950
            ],
            [
                9950,
                9952
            ],
            [
                9952,
                10042
            ],
            [
                10042,
                10281
            ],
            [
                10283,
                10367
            ],
            [
                10368,
                10385
            ],
            [
                10390,
                10395
            ],
            [
                10399,
                10419
            ],
            [
                10419,
                10457
            ],
            [
                10457,
                10514
            ],
            [
                10515,
                10547
            ],
            [
                10547,
                10580
            ],
            [
                10580,
                10582
            ],
            [
                10582,
                10668
            ],
            [
                10669,
                10720
            ],
            [
                10720,
                10777
            ],
            [
                10782,
                10806
            ],
            [
                10807,
                10810
            ],
            [
                10811,
                10839
            ],
            [
                10840,
                10857
            ],
            [
                10858,
                10911
            ],
            [
                10912,
                10951
            ],
            [
                10951,
                10987
            ],
            [
                10987,
                10988
            ],
            [
                10989,
                11039
            ],
            [
                11046,
                11060
            ],
            [
                11063,
                11069
            ],
            [
                11069,
                11071
            ],
            [
                11072,
                11075
            ],
            [
                11076,
                11086
            ],
            [
                11087,
                11096
            ],
            [
                11096,
                11097
            ],
            [
                11098,
                11122
            ],
            [
                11123,
                11133
            ],
            [
                11140,
                11159
            ],
            [
                11161,
                11164
            ],
            [
                11165,
                11172
            ],
            [
                11173,
                11198
            ],
            [
                11199,
                11209
            ],
            [
                11209,
                11289
            ],
            [
                11292,
                11295
            ],
            [
                11314,
                11337
            ],
            [
                11344,
                11435
            ],
            [
                11442,
                11449
            ],
            [
                11455,
                11456
            ],
            [
                11457,
                11529
            ],
            [
                11529,
                11592
            ],
            [
                11593,
                11614
            ],
            [
                11623,
                11810
            ],
            [
                11822,
                11874
            ]
        ],
        "row_chars": [
            [
                0,
                78
            ],
            [
                78,
                78
            ],
            [
                78,
                78
            ],
            [
                78,
                124
            ],
            [
                124,
                168
            ],
            [
                168,
                277
            ],
            [
                277,
                277
            ],
            [
                277,
                450
            ],
            [
                450,
                450
            ],
            [
                450,
                642
            ],
            [
                642,
                685
            ],
            [
                685,
                805
            ],
            [
                805,
                896
            ],
            [
                896,
                935
            ],
            [
                935,
                1005
            ],
            [
                1005,
                1005
            ],
            [
                1005,
                1135
            ],
            [
                1135,
                1264
            ],
            [
                1264,
                1362
            ],
            [
                1362,
                1362
            ],
            [
                1362,
                1391
            ],
            [
                1391,
                1460
            ],
            [
                1460,
                1508
            ],
            [
                1508,
                1553
            ],
            [
                1553,
                1577
            ],
            [
                1577,
                1577
            ],
            [
                1577,
                1577
            ],
            [
                1577,
                1577
            ],
            [
                1577,
                1734
            ],
            [
                1734,
                1873
            ],
            [
                1873,
                1935
            ],
            [
                1935,
                1962
            ],
            [
                1962,
                2048
            ],
            [
                2048,
                2146
            ],
            [
                2146,
                2146
            ],
            [
                2146,
                2146
            ],
            [
                2146,
                2209
            ],
            [
                2209,
                2338
            ],
            [
                2338,
                2385
            ],
            [
                2385,
                2405
            ],
            [
                2405,
                2430
            ],
            [
                2430,
                2610
            ],
            [
                2610,
                2701
            ],
            [
                2701,
                2729
            ],
            [
                2729,
                2739
            ],
            [
                2739,
                2739
            ],
            [
                2739,
                2790
            ],
            [
                2790,
                2827
            ],
            [
                2827,
                2866
            ],
            [
                2866,
                2961
            ],
            [
                2961,
                2985
            ],
            [
                2985,
                2985
            ],
            [
                2985,
                2985
            ],
            [
                2985,
                2985
            ],
            [
                2985,
                3056
            ],
            [
                3056,
                3085
            ],
            [
                3085,
                3151
            ],
            [
                3151,
                3178
            ],
            [
                3178,
                3257
            ],
            [
                3257,
                3454
            ],
            [
                3454,
                3499
            ],
            [
                3499,
                3589
            ],
            [
                3589,
                3710
            ],
            [
                3710,
                3807
            ],
            [
                3807,
                3904
            ],
            [
                3904,
                4005
            ],
            [
                4005,
                4005
            ],
            [
                4005,
                4005
            ],
            [
                4005,
                4005
            ],
            [
                4005,
                4005
            ],
            [
                4005,
                4005
            ],
            [
                4005,
                4005
            ],
            [
                4005,
                4005
            ],
            [
                4005,
                4230
            ],
            [
                4230,
                4365
            ],
            [
                4365,
                4467
            ],
            [
                4467,
                4533
            ],
            [
                4533,
                4533
            ],
            [
                4533,
                4610
            ],
            [
                4610,
                4610
            ],
            [
                4610,
                4674
            ],
            [
                4674,
                4748
            ],
            [
                4748,
                4836
            ],
            [
                4836,
                4951
            ],
            [
                4951,
                5007
            ],
            [
                5007,
                5075
            ],
            [
                5075,
                5185
            ],
            [
                5185,
                5238
            ],
            [
                5238,
                5350
            ],
            [
                5350,
                5387
            ],
            [
                5387,
                5439
            ],
            [
                5439,
                5439
            ],
            [
                5439,
                5752
            ],
            [
                5752,
                5774
            ],
            [
                5774,
                5806
            ],
            [
                5806,
                5866
            ],
            [
                5866,
                5958
            ],
            [
                5958,
                5979
            ],
            [
                5979,
                6065
            ],
            [
                6065,
                6123
            ],
            [
                6123,
                6123
            ],
            [
                6123,
                6179
            ],
            [
                6179,
                6226
            ],
            [
                6226,
                6292
            ],
            [
                6292,
                6292
            ],
            [
                6292,
                6421
            ],
            [
                6421,
                6421
            ],
            [
                6421,
                6446
            ],
            [
                6446,
                6509
            ],
            [
                6509,
                6509
            ],
            [
                6509,
                6597
            ],
            [
                6597,
                6620
            ],
            [
                6620,
                6678
            ],
            [
                6678,
                6709
            ],
            [
                6709,
                6751
            ],
            [
                6751,
                6764
            ],
            [
                6764,
                6797
            ],
            [
                6797,
                6797
            ],
            [
                6797,
                6858
            ],
            [
                6858,
                6871
            ],
            [
                6871,
                6871
            ],
            [
                6871,
                6871
            ],
            [
                6871,
                6871
            ],
            [
                6871,
                6871
            ],
            [
                6871,
                6871
            ],
            [
                6871,
                6933
            ],
            [
                6933,
                6964
            ],
            [
                6964,
                6984
            ],
            [
                6984,
                7013
            ],
            [
                7013,
                7079
            ],
            [
                7079,
                7147
            ],
            [
                7147,
                7199
            ],
            [
                7199,
                7289
            ],
            [
                7289,
                7289
            ],
            [
                7289,
                7330
            ],
            [
                7330,
                7337
            ],
            [
                7337,
                7361
            ],
            [
                7361,
                7450
            ],
            [
                7450,
                7481
            ],
            [
                7481,
                7535
            ],
            [
                7535,
                7608
            ],
            [
                7608,
                7631
            ],
            [
                7631,
                7695
            ],
            [
                7695,
                7732
            ],
            [
                7732,
                7817
            ],
            [
                7817,
                7817
            ],
            [
                7817,
                7817
            ],
            [
                7817,
                7817
            ],
            [
                7817,
                7884
            ],
            [
                7884,
                7924
            ],
            [
                7924,
                7962
            ],
            [
                7962,
                7999
            ],
            [
                7999,
                8030
            ],
            [
                8030,
                8155
            ],
            [
                8155,
                8180
            ],
            [
                8180,
                8241
            ],
            [
                8241,
                8241
            ],
            [
                8241,
                8313
            ],
            [
                8313,
                8322
            ],
            [
                8322,
                8406
            ],
            [
                8406,
                8468
            ],
            [
                8468,
                8512
            ],
            [
                8512,
                8542
            ],
            [
                8542,
                8554
            ],
            [
                8554,
                8623
            ],
            [
                8623,
                8721
            ],
            [
                8721,
                8942
            ],
            [
                8942,
                9065
            ],
            [
                9065,
                9186
            ],
            [
                9186,
                9186
            ],
            [
                9186,
                9206
            ],
            [
                9206,
                9243
            ],
            [
                9243,
                9296
            ],
            [
                9296,
                9403
            ],
            [
                9403,
                9403
            ],
            [
                9403,
                9403
            ],
            [
                9403,
                9403
            ],
            [
                9403,
                9555
            ],
            [
                9555,
                9727
            ],
            [
                9727,
                9907
            ],
            [
                9907,
                9907
            ],
            [
                9907,
                9952
            ],
            [
                9952,
                10042
            ],
            [
                10042,
                10283
            ],
            [
                10283,
                10419
            ],
            [
                10419,
                10457
            ],
            [
                10457,
                10547
            ],
            [
                10547,
                10582
            ],
            [
                10582,
                10669
            ],
            [
                10669,
                10720
            ],
            [
                10720,
                10912
            ],
            [
                10912,
                10912
            ],
            [
                10912,
                10912
            ],
            [
                10912,
                10951
            ],
            [
                10951,
                10989
            ],
            [
                10989,
                10989
            ],
            [
                10989,
                11069
            ],
            [
                11069,
                11209
            ],
            [
                11209,
                11289
            ],
            [
                11289,
                11457
            ],
            [
                11457,
                11529
            ],
            [
                11529,
                11593
            ],
            [
                11593,
                11874
            ]
        ]
    }
}