{
    "original": {
        "text": "It must be acknowledged that Mrs. Greenow was a woman of great resources, and that she would be very prudent for others, though I fear the verdict of those who know her must go against her in regard to prudence in herself. Her marriage with Captain Bellfield was a rash act,--certainly a rash act, although she did take so much care in securing the payment of her own income into her own hands; but the manner in which she made him live discreetly for some months previous to his marriage, the tact with which she renewed the friendship which had existed between him and Mr. Cheesacre, and the skill she used in at last providing Mr. Cheesacre with a wife, oblige us all to admit that, as a general, she had great powers.\nWhen Alice reached Vavasor Hall she found Charlie Fairstairs established there on a long visit. Charlie and Kate were to be the two bridesmaids, and, as Kate told her cousin in their first confidential intercourse on the evening of Alice's arrival, there were already great hopes in the household that the master of Oileymead might be brought to surrender. It was true that Charlie had not a shilling, and that Mr. Cheesacre had set his heart on marrying an heiress. It was true that Miss Fairstairs had always stood low in the gentleman's estimation, as being connected with people who were as much without rank and fashion as they were without money, and that the gentleman loved rank and fashion dearly. It was true that Charlie was no beauty, and that Cheesacre had an eye for feminine charms. It was true that he had despised Charlie, and had spoken his contempt openly;--that he had seen the girl on the sands at Yarmouth every summer for the last ten years, and about the streets of Norwich every winter, and had learned to regard her as a thing poor and despicable, because she was common in his eyes. It is thus that the Cheesacres judge of people. But in spite of all these difficulties Mrs. Greenow had taken up poor Charlie's case, and Kate Vavasor expressed a strong opinion that her aunt would win.\n\"What has she done to the man?\" Alice asked.\n\"Coaxed him; simply that. She has made herself so much his master that he doesn't know how to say no to her. Sometimes I have thought that he might possibly run away, but I have abandoned that fear now. She has little confidences with him from day to day, which are so alluring to him that he cannot tear himself off. In the middle of one of them he will find himself engaged.\"\n\"But, the unfortunate girl! Won't it be a wretched marriage for her?\"\n\"Not at all. She'll make him a very good wife. He's one of those men to whom any woman, after a little time, will come to be the same. He'll be rough with her once a month or so, and perhaps tell her that she brought no money with her; but that won't break any bones, and Charlie will know how to fight her own battles. She'll save his money if she brings none, and in a few years' time they will quite understand each other.\"\nMr. Cheesacre and Captain Bellfield were at this time living in lodgings together, at Penrith, but came over and spent every other day at Vavasor, returning always to their lodgings in the evening. It wanted but eight days to the marriage when Alice arrived, and preparations for that event were in progress. \"It's to be very quiet, Alice,\" said her aunt; \"as quiet as such a thing can be made. I owe that to the memory of the departed one. I know that he is looking down upon me, and that he approves all that I do. Indeed, he told me once that he did not want me to live desolate for his sake. If I didn't feel that he was looking down and approving it, I should be wretched indeed.\" She took Alice up to see her trousseau, and gave the other expectant bride some little hints which, under present circumstances, might be useful. \"Yes, indeed; only three-and-sixpence a piece, and they're quite real. Feel them. You wouldn't get them in the shops under six.\" Alice did feel them, and wondered whether her aunt could have saved the half-crown honestly. \"I had my eyes about me when I was up in town, my dear. And look here, these are quite new,--have never been on yet, and I had them when I was married before. There is nothing like being careful, my dear. I hate meanness, as everybody knows who knows me; but there is nothing like being careful. You have a lot of rich people about you just now, and will have ever so many things given you which you won't want. Do you put them all by, and be careful. They may turn out useful, you know.\" Saying this, Mrs. Greenow folded up, among her present bridal belongings, sundries of the wealth which had accrued to her in an earlier stage of her career.\nAnd then Mrs. Greenow opened her mind to Alice about the Captain. \"He's as good as gold, my dear; he is, indeed,--in his own way. Of course, I know that he has faults, and I should like to know who hasn't. Although poor dear Greenow certainly was more without them than anybody else I ever knew.\" As this remembrance came upon Mrs. Greenow she put her handkerchief to her eyes, and Alice observed that that which she held still bore the deepest hem of widowhood. They would be used, no doubt, till the last day, and then put by in lavender for future possible occasions. \"Bellfield may have been a little extravagant. I dare say he has. But how can a man help being extravagant when he hasn't got any regular income? He has been ill-treated in his profession; very. It makes my blood curdle when I think of it. After fighting his country's battles through blood, and dust, and wounds;--but I'll tell you about that another time.\"\n\"I suppose a man seldom does make a fortune, aunt, by being a soldier?\"\n\"Never, my dear; much better be a tailor. Don't you ever marry a soldier. But as I was saying, he is the best-tempered creature alive, and the staunchest friend I ever met. You should hear what Mr. Cheesacre says of him! But you don't know Mr. Cheesacre?\"\n\"No, aunt, not yet. If you remember, he went away before I saw him when he came here before.\"\n\"Yes, I know, poor fellow! Between you and me, Kate might have had him if she liked; but perhaps Kate was right.\"\n\"I don't think he would have suited Kate at all.\"\n\"Because of the farmyard, you mean? Kate shouldn't give herself airs. Money's never dirty, you know. But perhaps it's all for the best. There's a sweet girl here to whom he is violently attached, and who I hope will become Mrs. Cheesacre. But as I was saying, the friendship between these two men is quite wonderful, and I have always observed that when a man can create that kind of affection in the bosom of another man, he invariably is,--the sort of man,--the man, in fact, who makes a good husband.\"\nAlice knew the story of Charlie Fairstairs and her hopes; knew of the quarrels between Bellfield and Cheesacre; knew almost as much of Bellfield's past life as Mrs. Greenow did herself; and Mrs. Greenow was no doubt aware that such was the case. Nevertheless, she had a pleasure in telling her own story, and told it as though she believed every word that she spoke.\nOn the following day the two gentlemen came over, according to custom, and Alice observed that Miss Fairstairs hardly spoke to Mr. Cheesacre. Indeed her manner of avoiding that gentleman was so very marked, that it was impossible not to observe it. They drank tea out of doors, and when Mr. Cheesacre on one occasion sauntered across towards the end of the bench on which Charlie was sitting, Charlie got up and walked away. And in strolling about the place afterwards, and in going up through the wood, she was at great pains to attach herself to some other person, so that there should be no such attaching between her and the owner of Oileymead. At one time Mr. Cheesacre did get close up to her and spoke some word, some very indifferent word. He knew that he was being cut and he wanted to avoid the appearance of a scene. \"I don't know, sir,\" said Charlie, again moving away with excellent dignity, and she at once attached herself to Alice who was close by. \"I know you have just come home from Switzerland,\" said Charlie. \"Beautiful Switzerland! My heart pants for Switzerland. Do tell me something about Switzerland!\" Mr. Cheesacre had heard that Alice was the dear friend of a lady who would probably some day become a duchess. He therefore naturally held her in awe, and slunk away. On this occasion Mrs. Greenow clung lovingly to her future husband, and the effect was that Mr. Cheesacre found himself to be very much alone and unhappy. He had generally enjoyed these days at Vavasor Hall, having found himself, or fancied himself, to be the dominant spirit there. That Mrs. Greenow was always in truth the dominant spirit I need hardly say; but she knew how to make a companion happy, and well also how to make him wretched. On the whole of this day poor Cheesacre was very wretched.\n\"I don't think I shall go there any more,\" he said to Bellfield, as he drove the gig back to Penrith that evening.\n\"Not go there any more, Cheesy,\" said Bellfield; \"why, we are to have the dinner out in the field on Friday. It's your own bespeak.\"\n\"Well, yes; I'll go on Friday, but not after that.\"\n\"You'll stop and see me turned off, old fellow?\"\n\"What's the use? You'll get your wife, and that's enough for you. The truth is, that since that girl came down from London with her d----d airs;\"--the girl from London with the airs was poor Alice,--\"the place is quite changed. I'm blessed if the whole thing isn't as dark as ditch-water. I'm a plain man, I am; and I do hate your swells.\" Against this view of the case Captain Bellfield argued stoutly; but Cheesacre had been offended, and throughout the next day he was cross and touchy. He wouldn't play billiards, and on one occasion hinted that he hoped he should get that money soon.\n\"You did it admirably, my dear,\" said Mrs. Greenow that night to Charlie Fairstairs. The widow was now on terms almost more confidential with Miss Fairstairs than with her own niece, Kate Vavasor. She loved a little bit of intrigue; and though Kate could intrigue, as we have seen in this story, Kate would not join her aunt's intrigues. \"You did it admirably. I really did not think you had so much in you.\"\n\"Oh, I don't know,\" said Charlie, blushing at the praise.\n\"And it's the only way, my dear;--the only way, I mean, for you with such a one as him. And if he does come round, you'll find him an excellent husband.\"\n\"I don't think he cares for me a bit,\" said Charlie whimpering.\n\"Pooh, nonsense! Girls never know whether men care for them or not. If he asks you to marry him, won't that be a sign that he cares for you? and if he don't, why, there'll be no harm done.\"\n\"If he thinks it's his money--\" began Charlie.\n\"Now, don't talk nonsense, Charlie,\" said Mrs. Greenow, \"or you'll make me sick. Of course it's his money, more or less. You don't mean to tell me you'd go and fall in love with him if he was like Bellfield, and hadn't got a rap? I can afford that sort of thing; you can't. I don't mean to say you ain't to love him. Of course, you're to love him; and I've no doubt you will, and make him a very good wife. I always think that worldliness and sentimentality are like brandy-and-water. I don't like either of them separately, but taken together they make a very nice drink. I like them warm, with ---- as the gentlemen say.\" To this little lecture Miss Fairstairs listened with dutiful patience, and when it was over she said nothing more of her outraged affections or of her disregard for money. \"And now, my dear, mind you look your best on Friday. I'll get him away immediately after dinner, and when he's done with me you can contrive to be in his way, you know.\"\nThe next day was what Kate called the blank day at the Hall. The ladies were all alone, and devoted themselves, as was always the case on the blank days, to millinery and household cares. Mrs. Greenow, as has before been stated, had taken a lease of the place, and her troubles extended beyond her mere bridal wardrobe. Large trunks of household linen had arrived, and all this linen was marked with the name of Greenow; Greenow, 5.58; Greenow, 7.52; and a good deal had to be done before this ancient wealth of housewifery could probably be converted to Bellfield purposes. \"We must cut out the pieces, Jeannette, and work 'em in again ever so carefully,\" said the widow, after some painful consideration. \"It will always show,\" said Jeannette, shaking her head. \"But the other would show worse,\" said the widow; \"and if you finedraw it, not one person in ten will notice it. We'd always put them on with the name to the feet, you know.\"\nIt was not quite true that Cheesacre had bespoke the dinner out in the field, although no doubt he thought he had done so. The little treat, if treat it was, had all been arranged by Mrs. Greenow, who was ever ready to create festivities. There was not much scope for a picnic here. Besides their own party, which, of course, included the Captain and Mr. Cheesacre, no guest could be caught except the clergyman;--that low-church clergyman, who was so anxious about his income, and with whom the old Squire had quarrelled. Mrs. Greenow had quickly obtained the advantage of his alliance, and he, who was soon to perform on her behalf the marriage ceremony, had promised to grace this little festival. The affair simply amounted to this, that they were to eat their dinner uncomfortably in the field instead of comfortably in the dining-room. But Mrs. Greenow knew that Charlie's charms would be much strengthened by a dinner out-of-doors. \"Nothing,\" she said to Kate, \"nothing makes a man come forward so well as putting him altogether out of his usual tack. A man who wouldn't think of such a thing in the drawing-room would be sure to make an offer if he spent an evening with a young lady down-stairs in the kitchen.\"\nAt two o'clock the gig from Penrith arrived at the Hall, and for the next hour both Cheesacre and the Captain were engaged in preparing the tables and carrying out the viands. The Captain and Charlie Fairstairs were going to lay the cloth. \"Let me do it,\" said Cheesacre taking it out of the Captain's hands. \"Oh, certainly,\" said the Captain, giving up his prize. \"Captain Bellfield would do it much better,\" said Charlie, with a little toss of her head; \"he's as good as a married man, and they always do these things best.\"\nThe day was fine, and although the shade was not perfect, and the midges were troublesome, the dinner went off very nicely. It was beautiful to see how well Mrs. Greenow remembered herself about the grace, seeing that the clergyman was there. She was just in time, and would have been very angry with herself, and have thought herself awkward, had she forgotten it. Mr. Cheesacre sat on her right hand, and the clergyman on her left, and she hardly spoke a word to Bellfield. Her sweetest smiles were all given to Cheesacre. She was specially anxious to keep her neighbour, the parson, in good-humour, and therefore illuminated him once in every five minutes with a passing ray, but the full splendour of her light was poured out upon Cheesacre, as it never had before been poured. How she did flatter him, and with what a capacious gullet did he swallow her flatteries! Oileymead was the only paradise she had ever seen. \"Ah, me; when I think of it sometimes,--but never mind.\" A moment came to him when he thought that even yet he might win the race, and send Bellfield away howling into outer darkness. A moment came to him, and the widow saw the moment well. \"I know I have done for the best,\" said she, \"and therefore I shall never regret it; at any rate, it's done now.\"\n\"Not done yet,\" said he plaintively.\n\"Yes; done, and done, and done. Besides, a man in your position in the county should always marry a wife younger than yourself,--a good deal younger.\" Cheesacre did not understand the argument, but he liked the allusion to his position in the county, and he perceived that it was too late for any changes in the present arrangements. But he was happy; and all that feeling of animosity to Alice had vanished from his breast. Poor Alice! she, at any rate, was innocent. With so much of her own to fill her mind, she had been but little able to take her share in the Greenow festivities; and we may safely say, that if Mr. Cheesacre's supremacy was on any occasion attacked, it was not attacked by her. His supremacy on this occasion was paramount, and during the dinner, and after the dinner, he was allowed to give his orders to Bellfield in a manner that must have gratified him much. \"You must have another glass of champagne with me, my friend,\" said Mrs. Greenow; and Mr. Cheesacre drank the other glass of champagne. It was not the second nor the third that he had taken.\nAfter dinner they started off for a ramble through the fields, and Mrs. Greenow and Mr. Cheesacre were together. I think that Charlie Fairstairs did not go with them at all. I think she went into the house and washed her face, and brushed her hair, and settled her muslin. I should not wonder if she took off her frock and ironed it again. Captain Bellfield, I know, went with Alice, and created some astonishment by assuring her that he fully meant to correct the error of his ways. \"I know what it is,\" he said, \"to be connected with such a family as yours, Miss Vavasor.\" He too had heard about the future duchess, and wished to be on his best behaviour. Kate fell to the lot of the parson.\n\"This is the last time we shall ever be together in this way,\" said the widow to her friend.\n\"Oh, no,\" said Cheesacre; \"I hope not.\"\n\"The last time. On Wednesday I become Mrs. Bellfield, and I need hardly say that I have many things to think of before that; but Mr. Cheesacre, I hope we are not to be strangers hereafter?\" Mr. Cheesacre said that he hoped not. Oileymead would always be open to Captain and Mrs. Bellfield.\n\"We all know your hospitality,\" said she; \"it is not to-day nor to-morrow that I or my husband,--that is to be,--will have to learn that. He always declares that you are the very beau ideal of an English country gentleman.\"\n\"Merely a poor Norfolk farmer,\" said Cheesacre. \"I never want to put myself beyond my own place. There has been some talk about the Commission of the Peace, but I don't think anything of it.\"\n\"It has been the greatest blessing in the world for him that he has ever known you,\" said Mrs. Greenow, still talking about her future husband.\n\"I've tried to be good-natured; that's all. D---- me, Mrs. Greenow, what's the use of living if one doesn't try to be good-natured? There isn't a better fellow than Bellfield living. He and I ran for the same plate, and he has won it. He's a lucky fellow, and I don't begrudge him his luck.\"\n\"That's so manly of you, Mr. Cheesacre! But, indeed, the plate you speak of was not worth your running for.\"\n\"I may have my own opinion about that, you know.\"\n\"It was not. Nobody knows that as well as I do, or could have thought over the whole matter so often. I know very well what my mission is in life. The mistress of your house, Mr. Cheesacre, should not be any man's widow.\"\n\"She wouldn't be a widow then, you know.\"\n\"A virgin heart should be yours; and a virgin heart may be yours, if you choose to accept it.\"\n\"Oh, bother!\"\n\"If you choose to take my solicitude on your behalf in that way, of course I have done. You were good enough to say just now that you wished to see me and my husband in your hospitable halls. After all that has passed, do you think that I could be a visitor at your house unless there is a mistress there?\"\n\"Upon my word, I think you might.\"\n\"No, Mr. Cheesacre; certainly not. For all our sakes, I should decline. But if you were married--\"\n\"You are always wanting to marry me, Mrs. Greenow.\"\n\"I do, I do. It is the only way in which there can be any friendship between us, and not for worlds would I lose that advantage for my husband,--let alone what I may feel for myself.\"\n\"Why didn't you take me yourself, Mrs. Greenow?\"\n\"If you can't understand, it is not for me to say anything more, Mr. Cheesacre. If you value the warm affection of a virgin heart--\"\n\"Why, Mrs. Greenow, all yesterday she wouldn't say a word to me.\"\n\"Not say a word to you? Is that all you know about it? Are you so ignorant that you cannot see when a girl's heart is breaking beneath her stays?\" This almost improper allusion had quite an effect on Mr. Cheesacre's sensitive bosom. \"Did you say a word to her yesterday? And if not, why have you said so many words before?\"\n\"Oh, Mrs. Greenow; come!\"\n\"It is, oh, Mrs. Greenow. But it is time that we should go back to them.\" They had been sitting all this time on a bank, under a hedge. \"We will have our tea, and you shall have your pipe and brandy-and-water, and Charlie shall bring it to you. Shall she, Mr. Cheesacre?\"\n\"If she likes she shall, of course.\"\n\"Do you ask her, and she'll like it it quick enough. But remember, Mr. Cheesacre, I'm quite serious in what I say about your having a mistress for your house. Only think what an age you'll be when your children grow up, if you don't marry soon now.\"\nThey returned to the field in which they had dined, and found Charlie under the trees, with her muslin looking very fresh. \"What, all a-mort?\" said Mrs. Greenow. Charlie did not quite understand this, but replied that she preferred being alone. \"I have told him that you should fill his pipe for him,\" said Mrs. Greenow. \"He doesn't care for ladies to fill his pipe for him,\" said Charlie. \"Do you try,\" said the widow, \"while I go indoors and order the tea.\"\nIt had been necessary to put the bait very close before Cheesacre's eyes, or there would have been no hope that he might take it. The bait had been put so very close that we must feel sure that he saw the hook. But there are fish so silly that they will take the bait although they know the hook is there. Cheesacre understood it all. Many things he could not see, but he could see that Mrs. Greenow was trying to catch him as a husband for Charlie Fairstairs; and he knew also that he had always despised Charlie, and that no worldly advantage whatever would accrue to him by a marriage with such a girl. But there she was, and he didn't quite know how to avoid it. She did look rather nice in her clear-starched muslin frock, and he felt that he should like to kiss her. He needn't marry her because he kissed her. The champagne which had created the desire also gave him the audacity. He gave one glance around him to see that he was not observed, and then he did kiss Charlie Fairstairs under the trees. \"Oh, Mr. Cheesacre,\" said Charlie. \"Oh, Mr. Cheesacre,\" echoed a laughing voice; and poor Cheesacre, looking round, saw that Mrs. Greenow, who ought to have been inside the house looking after the boiling water, was moving about for some unknown reason within sight of the spot which he had chosen for his dalliance.\n\"Mr. Cheesacre,\" said Charlie sobbing, \"how dare you do that?--and where all the world could see you?\"\n\"It was only Mrs. Greenow,\" said Cheesacre.\n\"And what will she think of me?\"\n\"Lord bless you--she won't think anything about it.\"\n\"But I do;--I think a great deal about it. I don't know what to do, I don't;--I don't.\" Whereupon Charlie got up from her seat under the trees and began to move away slowly. Cheesacre thought about it for a moment or two. Should he follow her or should he not? He knew that he had better not follow her. He knew that she was bait with a very visible hook. He knew that he was a big fish for whom these two women were angling. But after all, perhaps it wouldn't do him much harm to be caught. So he got up and followed her. I don't suppose she meant to take the way towards the woods,--towards the little path leading to the old summer-house up in the trees. She was too much beside herself to know where she was going, no doubt. But that was the path she did take, and before long she and Cheesacre were in the summerhouse together. \"Don't, Sam, don't! Somebody really will be coming. Well, then, there. Now I won't do it again.\" 'Twas thus she spoke when the last kiss was given on this occasion;--unless there may have been one or two later in the evening, to which it is not necessary more especially to allude here. But on the occasion of that last kiss in the summer-house Miss Fairstairs was perfectly justified by circumstances, for she was then the promised bride of Mr. Cheesacre.\nBut how was he to get down again among his friends? That consideration troubled Mr. Cheesacre as he rose from his happy seat after that last embrace. He had promised Charlie, and perhaps he would keep his promise, but it might be as well not to make it all too public at once. But Charlie wasn't going to be thrown over;--not if she knew it, as she said to herself. She returned therefore triumphantly among them all,--blushing indeed, and with her eyes turned away, and her hand now remained upon her lover's arm;--but still so close to him that there could be no mistake. \"Goodness, gracious, Charlie! where have you and Mr. Cheesacre been?\" said Mrs. Greenow. \"We got up into the woods and lost ourselves,\" said Charlie. \"Oh, indeed,\" said Mrs. Greenow.\nIt would be too long to tell now, in these last pages of our story, how Cheesacre strove to escape, and with what skill Mrs. Greenow kept him to his bargain. I hope that Charlie Fairstairs was duly grateful. Before that evening was over, under the comfortable influence of a glass of hot brandy-and-water,--the widow had, I think, herself mixed the second glass for Mr. Cheesacre, before the influence became sufficiently comfortable,--he was forced to own that he had made himself the happy possessor of Charlie Fairstairs' heart and hand. \"And you are a lucky man,\" said the widow with enthusiasm; \"and I congratulate you with all my heart. Don't let there be any delay now, because a good thing can't be done too soon.\" And indeed, before that night was over, Mrs. Greenow had the pair together in her own presence, and then fixed the day. \"A fellow ought to be allowed to turn himself,\" Cheesacre said to her, pleading for himself in a whisper. But no; Mrs. Greenow would give him no such mercy. She knew to what a man turning himself might probably lead. She was a woman who was quite in earnest when she went to work, and I hope that Miss Fairstairs was grateful. Then, in that presence, was in truth the last kiss given on that eventful evening. \"Come, Charlie, be good-natured to him. He's as good as your own now,\" said the widow. And Charlie was good-natured. \"It's to be as soon as ever we come back from our trip,\" said Mrs. Greenow to Kate, the next day, \"and I'm lending her money to get all her things at once. He shall come to the scratch, though I go all the way to Norfolk by myself and fetch him by his ears. He shall come, as sure as my name's Greenow,--or Bellfield, as it will be then, you know.\"\n\"And I shouldn't wonder if she did have to go to Norfolk,\" said Kate to her cousin. That event, however, cannot be absolutely concluded in these pages. I can only say that, when I think of Mrs. Greenow's force of character and warmth of friendship, I feel that Miss Fairstairs' prospects stand on good ground.\nMrs. Greenow's own marriage was completed with perfect success. She took Captain Bellfield for better or for worse, with a thorough determination to make the best of his worst, and to put him on his legs, if any such putting might be possible. He, at any rate, had been in luck. If any possible stroke of fortune could do him good, he had found that stroke. He had found a wife who could forgive all his past offences,--and also, if necessary, some future offences; who had money enough for all his wants, and kindness enough to gratify them, and who had, moreover,--which for the Captain was the most important,--strength enough to keep from him the power of ruining them both. Reader, let us wish a happy married life to Captain and Mrs. Bellfield!\nThe day after the ceremony Alice Vavasor and Kate Vavasor started for Matching Priory.",
        "paragraph_chars": [
            [
                0,
                722
            ],
            [
                722,
                2035
            ],
            [
                2035,
                2080
            ],
            [
                2080,
                2458
            ],
            [
                2458,
                2528
            ],
            [
                2528,
                2955
            ],
            [
                2955,
                4655
            ],
            [
                4655,
                5585
            ],
            [
                5585,
                5657
            ],
            [
                5657,
                5913
            ],
            [
                5913,
                6007
            ],
            [
                6007,
                6121
            ],
            [
                6121,
                6171
            ],
            [
                6171,
                6676
            ],
            [
                6676,
                7043
            ],
            [
                7043,
                8840
            ],
            [
                8840,
                8955
            ],
            [
                8955,
                9088
            ],
            [
                9088,
                9140
            ],
            [
                9140,
                9189
            ],
            [
                9189,
                9779
            ],
            [
                9779,
                10188
            ],
            [
                10188,
                10246
            ],
            [
                10246,
                10400
            ],
            [
                10400,
                10464
            ],
            [
                10464,
                10654
            ],
            [
                10654,
                10701
            ],
            [
                10701,
                11668
            ],
            [
                11668,
                12607
            ],
            [
                12607,
                13828
            ],
            [
                13828,
                14355
            ],
            [
                14355,
                15632
            ],
            [
                15632,
                15669
            ],
            [
                15669,
                16746
            ],
            [
                16746,
                17440
            ],
            [
                17440,
                17533
            ],
            [
                17533,
                17573
            ],
            [
                17573,
                17863
            ],
            [
                17863,
                18087
            ],
            [
                18087,
                18279
            ],
            [
                18279,
                18423
            ],
            [
                18423,
                18715
            ],
            [
                18715,
                18824
            ],
            [
                18824,
                18874
            ],
            [
                18874,
                19096
            ],
            [
                19096,
                19138
            ],
            [
                19138,
                19233
            ],
            [
                19233,
                19247
            ],
            [
                19247,
                19554
            ],
            [
                19554,
                19589
            ],
            [
                19589,
                19688
            ],
            [
                19688,
                19740
            ],
            [
                19740,
                19924
            ],
            [
                19924,
                19973
            ],
            [
                19973,
                20106
            ],
            [
                20106,
                20172
            ],
            [
                20172,
                20496
            ],
            [
                20496,
                20522
            ],
            [
                20522,
                20794
            ],
            [
                20794,
                20831
            ],
            [
                20831,
                21081
            ],
            [
                21081,
                21541
            ],
            [
                21541,
                22866
            ],
            [
                22866,
                22969
            ],
            [
                22969,
                23013
            ],
            [
                23013,
                23046
            ],
            [
                23046,
                23099
            ],
            [
                23099,
                24389
            ],
            [
                24389,
                25146
            ],
            [
                25146,
                26865
            ],
            [
                26865,
                27175
            ],
            [
                27175,
                27926
            ],
            [
                27926,
                28012
            ]
        ],
        "segment_chars": [
            [
                0,
                223
            ],
            [
                223,
                722
            ],
            [
                722,
                818
            ],
            [
                818,
                1079
            ],
            [
                1079,
                1189
            ],
            [
                1189,
                1429
            ],
            [
                1429,
                1520
            ],
            [
                1520,
                1832
            ],
            [
                1832,
                1880
            ],
            [
                1880,
                2035
            ],
            [
                2035,
                2067
            ],
            [
                2067,
                2080
            ],
            [
                2080,
                2106
            ],
            [
                2106,
                2189
            ],
            [
                2189,
                2283
            ],
            [
                2283,
                2398
            ],
            [
                2398,
                2458
            ],
            [
                2458,
                2486
            ],
            [
                2486,
                2528
            ],
            [
                2528,
                2541
            ],
            [
                2541,
                2575
            ],
            [
                2575,
                2663
            ],
            [
                2663,
                2848
            ],
            [
                2848,
                2955
            ],
            [
                2955,
                3153
            ],
            [
                3153,
                3264
            ],
            [
                3264,
                3350
            ],
            [
                3350,
                3396
            ],
            [
                3396,
                3472
            ],
            [
                3472,
                3551
            ],
            [
                3551,
                3641
            ],
            [
                3641,
                3787
            ],
            [
                3787,
                3858
            ],
            [
                3858,
                3869
            ],
            [
                3869,
                3916
            ],
            [
                3916,
                4009
            ],
            [
                4009,
                4065
            ],
            [
                4065,
                4168
            ],
            [
                4168,
                4214
            ],
            [
                4214,
                4305
            ],
            [
                4305,
                4421
            ],
            [
                4421,
                4461
            ],
            [
                4461,
                4498
            ],
            [
                4498,
                4655
            ],
            [
                4655,
                4721
            ],
            [
                4721,
                4785
            ],
            [
                4785,
                4861
            ],
            [
                4861,
                4952
            ],
            [
                4952,
                5118
            ],
            [
                5118,
                5226
            ],
            [
                5226,
                5273
            ],
            [
                5273,
                5292
            ],
            [
                5292,
                5372
            ],
            [
                5372,
                5421
            ],
            [
                5421,
                5466
            ],
            [
                5466,
                5585
            ],
            [
                5585,
                5657
            ],
            [
                5657,
                5699
            ],
            [
                5699,
                5731
            ],
            [
                5731,
                5830
            ],
            [
                5830,
                5878
            ],
            [
                5878,
                5913
            ],
            [
                5913,
                5933
            ],
            [
                5933,
                6007
            ],
            [
                6007,
                6034
            ],
            [
                6034,
                6121
            ],
            [
                6121,
                6171
            ],
            [
                6171,
                6207
            ],
            [
                6207,
                6241
            ],
            [
                6241,
                6272
            ],
            [
                6272,
                6307
            ],
            [
                6307,
                6410
            ],
            [
                6410,
                6676
            ],
            [
                6676,
                6922
            ],
            [
                6922,
                7043
            ],
            [
                7043,
                7185
            ],
            [
                7185,
                7292
            ],
            [
                7292,
                7468
            ],
            [
                7468,
                7692
            ],
            [
                7692,
                7791
            ],
            [
                7791,
                7871
            ],
            [
                7871,
                8008
            ],
            [
                8008,
                8073
            ],
            [
                8073,
                8097
            ],
            [
                8097,
                8129
            ],
            [
                8129,
                8170
            ],
            [
                8170,
                8281
            ],
            [
                8281,
                8337
            ],
            [
                8337,
                8492
            ],
            [
                8492,
                8620
            ],
            [
                8620,
                8781
            ],
            [
                8781,
                8840
            ],
            [
                8840,
                8955
            ],
            [
                8955,
                9064
            ],
            [
                9064,
                9088
            ],
            [
                9088,
                9140
            ],
            [
                9140,
                9189
            ],
            [
                9189,
                9206
            ],
            [
                9206,
                9255
            ],
            [
                9255,
                9417
            ],
            [
                9417,
                9478
            ],
            [
                9478,
                9529
            ],
            [
                9529,
                9679
            ],
            [
                9679,
                9779
            ],
            [
                9779,
                9864
            ],
            [
                9864,
                9976
            ],
            [
                9976,
                10117
            ],
            [
                10117,
                10140
            ],
            [
                10140,
                10188
            ],
            [
                10188,
                10246
            ],
            [
                10246,
                10334
            ],
            [
                10334,
                10400
            ],
            [
                10400,
                10464
            ],
            [
                10464,
                10481
            ],
            [
                10481,
                10532
            ],
            [
                10532,
                10605
            ],
            [
                10605,
                10654
            ],
            [
                10654,
                10701
            ],
            [
                10701,
                10782
            ],
            [
                10782,
                10822
            ],
            [
                10822,
                10931
            ],
            [
                10931,
                10975
            ],
            [
                10975,
                11018
            ],
            [
                11018,
                11108
            ],
            [
                11108,
                11186
            ],
            [
                11186,
                11274
            ],
            [
                11274,
                11325
            ],
            [
                11325,
                11497
            ],
            [
                11497,
                11551
            ],
            [
                11551,
                11668
            ],
            [
                11668,
                11729
            ],
            [
                11729,
                11856
            ],
            [
                11856,
                11988
            ],
            [
                11988,
                12243
            ],
            [
                12243,
                12375
            ],
            [
                12375,
                12432
            ],
            [
                12432,
                12545
            ],
            [
                12545,
                12607
            ],
            [
                12607,
                12730
            ],
            [
                12730,
                12846
            ],
            [
                12846,
                12890
            ],
            [
                12890,
                13130
            ],
            [
                13130,
                13308
            ],
            [
                13308,
                13449
            ],
            [
                13449,
                13546
            ],
            [
                13546,
                13666
            ],
            [
                13666,
                13828
            ],
            [
                13828,
                14004
            ],
            [
                14004,
                14068
            ],
            [
                14068,
                14137
            ],
            [
                14137,
                14193
            ],
            [
                14193,
                14355
            ],
            [
                14355,
                14479
            ],
            [
                14479,
                14598
            ],
            [
                14598,
                14721
            ],
            [
                14721,
                14831
            ],
            [
                14831,
                14880
            ],
            [
                14880,
                15137
            ],
            [
                15137,
                15226
            ],
            [
                15226,
                15277
            ],
            [
                15277,
                15334
            ],
            [
                15334,
                15461
            ],
            [
                15461,
                15518
            ],
            [
                15518,
                15632
            ],
            [
                15632,
                15669
            ],
            [
                15669,
                15701
            ],
            [
                15701,
                15820
            ],
            [
                15820,
                16003
            ],
            [
                16003,
                16094
            ],
            [
                16094,
                16106
            ],
            [
                16106,
                16138
            ],
            [
                16138,
                16370
            ],
            [
                16370,
                16555
            ],
            [
                16555,
                16691
            ],
            [
                16691,
                16746
            ],
            [
                16746,
                16859
            ],
            [
                16859,
                16920
            ],
            [
                16920,
                17019
            ],
            [
                17019,
                17086
            ],
            [
                17086,
                17230
            ],
            [
                17230,
                17321
            ],
            [
                17321,
                17404
            ],
            [
                17404,
                17440
            ],
            [
                17440,
                17533
            ],
            [
                17533,
                17573
            ],
            [
                17573,
                17589
            ],
            [
                17589,
                17763
            ],
            [
                17763,
                17801
            ],
            [
                17801,
                17863
            ],
            [
                17863,
                18001
            ],
            [
                18001,
                18087
            ],
            [
                18087,
                18135
            ],
            [
                18135,
                18184
            ],
            [
                18184,
                18279
            ],
            [
                18279,
                18423
            ],
            [
                18423,
                18467
            ],
            [
                18467,
                18555
            ],
            [
                18555,
                18606
            ],
            [
                18606,
                18658
            ],
            [
                18658,
                18715
            ],
            [
                18715,
                18755
            ],
            [
                18755,
                18824
            ],
            [
                18824,
                18874
            ],
            [
                18874,
                18887
            ],
            [
                18887,
                18976
            ],
            [
                18976,
                19021
            ],
            [
                19021,
                19096
            ],
            [
                19096,
                19138
            ],
            [
                19138,
                19233
            ],
            [
                19233,
                19247
            ],
            [
                19247,
                19335
            ],
            [
                19335,
                19439
            ],
            [
                19439,
                19554
            ],
            [
                19554,
                19589
            ],
            [
                19589,
                19624
            ],
            [
                19624,
                19661
            ],
            [
                19661,
                19688
            ],
            [
                19688,
                19740
            ],
            [
                19740,
                19753
            ],
            [
                19753,
                19924
            ],
            [
                19924,
                19973
            ],
            [
                19973,
                20053
            ],
            [
                20053,
                20106
            ],
            [
                20106,
                20172
            ],
            [
                20172,
                20196
            ],
            [
                20196,
                20227
            ],
            [
                20227,
                20319
            ],
            [
                20319,
                20405
            ],
            [
                20405,
                20443
            ],
            [
                20443,
                20496
            ],
            [
                20496,
                20522
            ],
            [
                20522,
                20548
            ],
            [
                20548,
                20596
            ],
            [
                20596,
                20658
            ],
            [
                20658,
                20767
            ],
            [
                20767,
                20794
            ],
            [
                20794,
                20831
            ],
            [
                20831,
                20884
            ],
            [
                20884,
                20990
            ],
            [
                20990,
                21081
            ],
            [
                21081,
                21204
            ],
            [
                21204,
                21224
            ],
            [
                21224,
                21243
            ],
            [
                21243,
                21326
            ],
            [
                21326,
                21402
            ],
            [
                21402,
                21471
            ],
            [
                21471,
                21541
            ],
            [
                21541,
                21671
            ],
            [
                21671,
                21752
            ],
            [
                21752,
                21847
            ],
            [
                21847,
                21876
            ],
            [
                21876,
                22147
            ],
            [
                22147,
                22208
            ],
            [
                22208,
                22314
            ],
            [
                22314,
                22358
            ],
            [
                22358,
                22429
            ],
            [
                22429,
                22549
            ],
            [
                22549,
                22584
            ],
            [
                22584,
                22866
            ],
            [
                22866,
                22969
            ],
            [
                22969,
                23013
            ],
            [
                23013,
                23046
            ],
            [
                23046,
                23099
            ],
            [
                23099,
                23142
            ],
            [
                23142,
                23187
            ],
            [
                23187,
                23273
            ],
            [
                23273,
                23321
            ],
            [
                23321,
                23360
            ],
            [
                23360,
                23403
            ],
            [
                23403,
                23455
            ],
            [
                23455,
                23525
            ],
            [
                23525,
                23591
            ],
            [
                23591,
                23622
            ],
            [
                23622,
                23757
            ],
            [
                23757,
                23828
            ],
            [
                23828,
                23932
            ],
            [
                23932,
                23952
            ],
            [
                23952,
                23984
            ],
            [
                23984,
                24003
            ],
            [
                24003,
                24029
            ],
            [
                24029,
                24219
            ],
            [
                24219,
                24389
            ],
            [
                24389,
                24441
            ],
            [
                24441,
                24539
            ],
            [
                24539,
                24666
            ],
            [
                24666,
                24755
            ],
            [
                24755,
                24963
            ],
            [
                24963,
                24993
            ],
            [
                24993,
                25033
            ],
            [
                25033,
                25052
            ],
            [
                25052,
                25113
            ],
            [
                25113,
                25146
            ],
            [
                25146,
                25304
            ],
            [
                25304,
                25354
            ],
            [
                25354,
                25687
            ],
            [
                25687,
                25789
            ],
            [
                25789,
                25869
            ],
            [
                25869,
                25989
            ],
            [
                25989,
                26095
            ],
            [
                26095,
                26146
            ],
            [
                26146,
                26206
            ],
            [
                26206,
                26316
            ],
            [
                26316,
                26399
            ],
            [
                26399,
                26439
            ],
            [
                26439,
                26486
            ],
            [
                26486,
                26516
            ],
            [
                26516,
                26672
            ],
            [
                26672,
                26774
            ],
            [
                26774,
                26865
            ],
            [
                26865,
                26949
            ],
            [
                26949,
                27017
            ],
            [
                27017,
                27175
            ],
            [
                27175,
                27239
            ],
            [
                27239,
                27419
            ],
            [
                27419,
                27454
            ],
            [
                27454,
                27533
            ],
            [
                27533,
                27854
            ],
            [
                27854,
                27926
            ],
            [
                27926,
                28012
            ]
        ],
        "overlap_chars": [
            [
                0,
                47
            ],
            [
                48,
                53
            ],
            [
                72,
                77
            ],
            [
                96,
                127
            ],
            [
                214,
                223
            ],
            [
                223,
                262
            ],
            [
                286,
                332
            ],
            [
                473,
                475
            ],
            [
                360,
                363
            ],
            [
                368,
                374
            ],
            [
                333,
                335
            ],
            [
                380,
                463
            ],
            [
                480,
                536
            ],
            [
                555,
                666
            ],
            [
                671,
                722
            ],
            [
                722,
                782
            ],
            [
                795,
                818
            ],
            [
                818,
                923
            ],
            [
                943,
                950
            ],
            [
                969,
                1001
            ],
            [
                1019,
                1078
            ],
            [
                1079,
                1189
            ],
            [
                1189,
                1221
            ],
            [
                1355,
                1367
            ],
            [
                1330,
                1334
            ],
            [
                1339,
                1346
            ],
            [
                1373,
                1429
            ],
            [
                1429,
                1520
            ],
            [
                1520,
                1597
            ],
            [
                1599,
                1606
            ],
            [
                1738,
                1766
            ],
            [
                1775,
                1832
            ],
            [
                1832,
                1880
            ],
            [
                1880,
                2035
            ],
            [
                2035,
                2067
            ],
            [
                2067,
                2080
            ],
            [
                2080,
                2106
            ],
            [
                2151,
                2189
            ],
            [
                2189,
                2227
            ],
            [
                2237,
                2252
            ],
            [
                2278,
                2283
            ],
            [
                2283,
                2297
            ],
            [
                2310,
                2398
            ],
            [
                2398,
                2458
            ],
            [
                2458,
                2462
            ],
            [
                2464,
                2486
            ],
            [
                2486,
                2528
            ],
            [
                2528,
                2541
            ],
            [
                2541,
                2575
            ],
            [
                2575,
                2641
            ],
            [
                2650,
                2663
            ],
            [
                2663,
                2753
            ],
            [
                2762,
                2848
            ],
            [
                2848,
                2955
            ],
            [
                2955,
                3111
            ],
            [
                3119,
                3153
            ],
            [
                3153,
                3155
            ],
            [
                3167,
                3212
            ],
            [
                3262,
                3263
            ],
            [
                3264,
                3323
            ],
            [
                3337,
                3343
            ],
            [
                3348,
                3350
            ],
            [
                3350,
                3396
            ],
            [
                3396,
                3470
            ],
            [
                3641,
                3720
            ],
            [
                3779,
                3785
            ],
            [
                3721,
                3733
            ],
            [
                3785,
                3786
            ],
            [
                4069,
                4099
            ],
            [
                4102,
                4168
            ],
            [
                4214,
                4229
            ],
            [
                4262,
                4303
            ],
            [
                4229,
                4230
            ],
            [
                4303,
                4305
            ],
            [
                4305,
                4421
            ],
            [
                4421,
                4423
            ],
            [
                4432,
                4440
            ],
            [
                4459,
                4461
            ],
            [
                4461,
                4497
            ],
            [
                4655,
                4692
            ],
            [
                4702,
                4721
            ],
            [
                4721,
                4751
            ],
            [
                4758,
                4759
            ],
            [
                4769,
                4785
            ],
            [
                4785,
                4861
            ],
            [
                5227,
                5271
            ],
            [
                5273,
                5283
            ],
            [
                5290,
                5292
            ],
            [
                5292,
                5372
            ],
            [
                5372,
                5413
            ],
            [
                5419,
                5421
            ],
            [
                5466,
                5538
            ],
            [
                5541,
                5585
            ],
            [
                5585,
                5657
            ],
            [
                5657,
                5672
            ],
            [
                5697,
                5699
            ],
            [
                5731,
                5734
            ],
            [
                5752,
                5830
            ],
            [
                5830,
                5878
            ],
            [
                5878,
                5913
            ],
            [
                5913,
                5931
            ],
            [
                6034,
                6121
            ],
            [
                6121,
                6171
            ],
            [
                6171,
                6207
            ],
            [
                6207,
                6241
            ],
            [
                6272,
                6307
            ],
            [
                6410,
                6453
            ],
            [
                6460,
                6596
            ],
            [
                6608,
                6610
            ],
            [
                6613,
                6628
            ],
            [
                6649,
                6676
            ],
            [
                6676,
                6681
            ],
            [
                6788,
                6882
            ],
            [
                6892,
                6897
            ],
            [
                6697,
                6699
            ],
            [
                6920,
                6922
            ],
            [
                6922,
                6984
            ],
            [
                7016,
                7043
            ],
            [
                7043,
                7091
            ],
            [
                7112,
                7183
            ],
            [
                7091,
                7092
            ],
            [
                7237,
                7241
            ],
            [
                7290,
                7292
            ],
            [
                7292,
                7343
            ],
            [
                7360,
                7369
            ],
            [
                7377,
                7468
            ],
            [
                7468,
                7471
            ],
            [
                7475,
                7477
            ],
            [
                7485,
                7511
            ],
            [
                7545,
                7617
            ],
            [
                7690,
                7691
            ],
            [
                7660,
                7663
            ],
            [
                7692,
                7731
            ],
            [
                7735,
                7756
            ],
            [
                7773,
                7791
            ],
            [
                7791,
                7820
            ],
            [
                7869,
                7870
            ],
            [
                7871,
                7928
            ],
            [
                7939,
                7946
            ],
            [
                7981,
                7989
            ],
            [
                7946,
                7947
            ],
            [
                7990,
                8008
            ],
            [
                8008,
                8073
            ],
            [
                8073,
                8097
            ],
            [
                8129,
                8169
            ],
            [
                8170,
                8244
            ],
            [
                8254,
                8281
            ],
            [
                8281,
                8337
            ],
            [
                8354,
                8408
            ],
            [
                8429,
                8442
            ],
            [
                8420,
                8423
            ],
            [
                8463,
                8492
            ],
            [
                8492,
                8551
            ],
            [
                8570,
                8585
            ],
            [
                8587,
                8620
            ],
            [
                8620,
                8744
            ],
            [
                8750,
                8781
            ],
            [
                8781,
                8783
            ],
            [
                8797,
                8840
            ],
            [
                8840,
                8907
            ],
            [
                8911,
                8916
            ],
            [
                8925,
                8955
            ],
            [
                8955,
                8985
            ],
            [
                8988,
                9035
            ],
            [
                9040,
                9064
            ],
            [
                9064,
                9077
            ],
            [
                9085,
                9088
            ],
            [
                9088,
                9140
            ],
            [
                9140,
                9163
            ],
            [
                9174,
                9189
            ],
            [
                9189,
                9206
            ],
            [
                9206,
                9255
            ],
            [
                9255,
                9322
            ],
            [
                9326,
                9334
            ],
            [
                9375,
                9385
            ],
            [
                9388,
                9417
            ],
            [
                9505,
                9529
            ],
            [
                9567,
                9583
            ],
            [
                9591,
                9606
            ],
            [
                9657,
                9678
            ],
            [
                9779,
                9864
            ],
            [
                10140,
                10188
            ],
            [
                10188,
                10246
            ],
            [
                10246,
                10277
            ],
            [
                10292,
                10293
            ],
            [
                10310,
                10334
            ],
            [
                10338,
                10400
            ],
            [
                10400,
                10451
            ],
            [
                10452,
                10464
            ],
            [
                10464,
                10481
            ],
            [
                10481,
                10532
            ],
            [
                10532,
                10605
            ],
            [
                10605,
                10654
            ],
            [
                10654,
                10682
            ],
            [
                10686,
                10701
            ],
            [
                10701,
                10758
            ],
            [
                10782,
                10822
            ],
            [
                10822,
                10931
            ],
            [
                10931,
                10975
            ],
            [
                10975,
                11018
            ],
            [
                11053,
                11108
            ],
            [
                11498,
                11551
            ],
            [
                11551,
                11668
            ],
            [
                11668,
                11680
            ],
            [
                11729,
                11778
            ],
            [
                11822,
                11856
            ],
            [
                11988,
                12032
            ],
            [
                12037,
                12040
            ],
            [
                12177,
                12179
            ],
            [
                12056,
                12087
            ],
            [
                12099,
                12100
            ],
            [
                12243,
                12339
            ],
            [
                12373,
                12374
            ],
            [
                12375,
                12431
            ],
            [
                12432,
                12436
            ],
            [
                12507,
                12545
            ],
            [
                12545,
                12568
            ],
            [
                12569,
                12607
            ],
            [
                12607,
                12647
            ],
            [
                12656,
                12730
            ],
            [
                12730,
                12746
            ],
            [
                12765,
                12768
            ],
            [
                12773,
                12802
            ],
            [
                12844,
                12846
            ],
            [
                12846,
                12890
            ],
            [
                12890,
                12913
            ],
            [
                12971,
                13018
            ],
            [
                13128,
                13130
            ],
            [
                13199,
                13201
            ],
            [
                13207,
                13226
            ],
            [
                13130,
                13142
            ],
            [
                13245,
                13263
            ],
            [
                13195,
                13198
            ],
            [
                13264,
                13308
            ],
            [
                13326,
                13342
            ],
            [
                13344,
                13449
            ],
            [
                13449,
                13545
            ],
            [
                13546,
                13576
            ],
            [
                13584,
                13631
            ],
            [
                13647,
                13659
            ],
            [
                13828,
                13995
            ],
            [
                14002,
                14004
            ],
            [
                14004,
                14067
            ],
            [
                14068,
                14098
            ],
            [
                14099,
                14136
            ],
            [
                14137,
                14170
            ],
            [
                14191,
                14192
            ],
            [
                14193,
                14355
            ],
            [
                14355,
                14385
            ],
            [
                14417,
                14479
            ],
            [
                14512,
                14535
            ],
            [
                14550,
                14559
            ],
            [
                14559,
                14560
            ],
            [
                14573,
                14586
            ],
            [
                14591,
                14598
            ],
            [
                14721,
                14751
            ],
            [
                14756,
                14831
            ],
            [
                14831,
                14880
            ],
            [
                14880,
                14887
            ],
            [
                14898,
                14913
            ],
            [
                14929,
                14939
            ],
            [
                14941,
                15137
            ],
            [
                15137,
                15160
            ],
            [
                15224,
                15226
            ],
            [
                15226,
                15276
            ],
            [
                15277,
                15314
            ],
            [
                15317,
                15334
            ],
            [
                15334,
                15461
            ],
            [
                15487,
                15518
            ],
            [
                15518,
                15567
            ],
            [
                15603,
                15632
            ],
            [
                15632,
                15669
            ],
            [
                15669,
                15679
            ],
            [
                15699,
                15701
            ],
            [
                15701,
                15795
            ],
            [
                15817,
                15820
            ],
            [
                15820,
                15926
            ],
            [
                15945,
                15948
            ],
            [
                16001,
                16003
            ],
            [
                16420,
                16426
            ],
            [
                16439,
                16524
            ],
            [
                16535,
                16554
            ],
            [
                16555,
                16690
            ],
            [
                16746,
                16859
            ],
            [
                16880,
                16920
            ],
            [
                16920,
                17019
            ],
            [
                17086,
                17103
            ],
            [
                17113,
                17133
            ],
            [
                17172,
                17229
            ],
            [
                17230,
                17321
            ],
            [
                17321,
                17404
            ],
            [
                17404,
                17440
            ],
            [
                17440,
                17532
            ],
            [
                17589,
                17625
            ],
            [
                17696,
                17763
            ],
            [
                17763,
                17801
            ],
            [
                17801,
                17863
            ],
            [
                17863,
                17906
            ],
            [
                17947,
                17957
            ],
            [
                17968,
                17973
            ],
            [
                18004,
                18041
            ],
            [
                18047,
                18087
            ],
            [
                18087,
                18135
            ],
            [
                18184,
                18279
            ],
            [
                18279,
                18346
            ],
            [
                18352,
                18381
            ],
            [
                18421,
                18423
            ],
            [
                18423,
                18467
            ],
            [
                18555,
                18606
            ],
            [
                18606,
                18658
            ],
            [
                18658,
                18715
            ],
            [
                18715,
                18755
            ],
            [
                18755,
                18824
            ],
            [
                18824,
                18874
            ],
            [
                18874,
                18887
            ],
            [
                18976,
                19021
            ],
            [
                19021,
                19093
            ],
            [
                19139,
                19233
            ],
            [
                19233,
                19247
            ],
            [
                19247,
                19283
            ],
            [
                19299,
                19323
            ],
            [
                19333,
                19335
            ],
            [
                19335,
                19362
            ],
            [
                19372,
                19439
            ],
            [
                19466,
                19554
            ],
            [
                19554,
                19589
            ],
            [
                19589,
                19624
            ],
            [
                19661,
                19684
            ],
            [
                19688,
                19723
            ],
            [
                19723,
                19740
            ],
            [
                19740,
                19742
            ],
            [
                19751,
                19753
            ],
            [
                19753,
                19819
            ],
            [
                20053,
                20102
            ],
            [
                20106,
                20172
            ],
            [
                20196,
                20227
            ],
            [
                20227,
                20319
            ],
            [
                20319,
                20405
            ],
            [
                20405,
                20441
            ],
            [
                20496,
                20522
            ],
            [
                20548,
                20593
            ],
            [
                20659,
                20767
            ],
            [
                20767,
                20794
            ],
            [
                20794,
                20831
            ],
            [
                20884,
                20990
            ],
            [
                20990,
                21074
            ],
            [
                21078,
                21081
            ],
            [
                21081,
                21203
            ],
            [
                21326,
                21401
            ],
            [
                21402,
                21470
            ],
            [
                21471,
                21472
            ],
            [
                21479,
                21541
            ],
            [
                21541,
                21671
            ],
            [
                21671,
                21752
            ],
            [
                21752,
                21847
            ],
            [
                21847,
                21876
            ],
            [
                21910,
                22146
            ],
            [
                22147,
                22208
            ],
            [
                22208,
                22239
            ],
            [
                22255,
                22314
            ],
            [
                22314,
                22358
            ],
            [
                22358,
                22429
            ],
            [
                22429,
                22548
            ],
            [
                22549,
                22583
            ],
            [
                22584,
                22764
            ],
            [
                22778,
                22786
            ],
            [
                22795,
                22801
            ],
            [
                22864,
                22866
            ],
            [
                22866,
                22927
            ],
            [
                22933,
                22969
            ],
            [
                22969,
                23013
            ],
            [
                23013,
                23046
            ],
            [
                23046,
                23061
            ],
            [
                23063,
                23099
            ],
            [
                23099,
                23109
            ],
            [
                23111,
                23142
            ],
            [
                23142,
                23165
            ],
            [
                23184,
                23187
            ],
            [
                23187,
                23272
            ],
            [
                23273,
                23321
            ],
            [
                23321,
                23360
            ],
            [
                23360,
                23403
            ],
            [
                23403,
                23455
            ],
            [
                23525,
                23590
            ],
            [
                23591,
                23622
            ],
            [
                23622,
                23681
            ],
            [
                23719,
                23739
            ],
            [
                23757,
                23828
            ],
            [
                23828,
                23931
            ],
            [
                23932,
                23952
            ],
            [
                23952,
                23984
            ],
            [
                23984,
                24003
            ],
            [
                24003,
                24029
            ],
            [
                24029,
                24078
            ],
            [
                24095,
                24096
            ],
            [
                24098,
                24186
            ],
            [
                24203,
                24219
            ],
            [
                24219,
                24222
            ],
            [
                24317,
                24319
            ],
            [
                24226,
                24229
            ],
            [
                24239,
                24296
            ],
            [
                24352,
                24389
            ],
            [
                24393,
                24396
            ],
            [
                24469,
                24482
            ],
            [
                24397,
                24400
            ],
            [
                24460,
                24468
            ],
            [
                24483,
                24538
            ],
            [
                24401,
                24403
            ],
            [
                24428,
                24440
            ],
            [
                24539,
                24665
            ],
            [
                24666,
                24708
            ],
            [
                24753,
                24755
            ],
            [
                24755,
                24806
            ],
            [
                24808,
                24837
            ],
            [
                24864,
                24868
            ],
            [
                24882,
                24903
            ],
            [
                24905,
                24908
            ],
            [
                24915,
                24962
            ],
            [
                24963,
                24993
            ],
            [
                24993,
                25033
            ],
            [
                25033,
                25051
            ],
            [
                25052,
                25112
            ],
            [
                25146,
                25304
            ],
            [
                25354,
                25451
            ],
            [
                25582,
                25598
            ],
            [
                25603,
                25686
            ],
            [
                25687,
                25789
            ],
            [
                25789,
                25869
            ],
            [
                25869,
                25925
            ],
            [
                25974,
                25989
            ],
            [
                26206,
                26316
            ],
            [
                26316,
                26324
            ],
            [
                26330,
                26339
            ],
            [
                26353,
                26366
            ],
            [
                26373,
                26397
            ],
            [
                26340,
                26343
            ],
            [
                26367,
                26372
            ],
            [
                26397,
                26398
            ],
            [
                26399,
                26439
            ],
            [
                26439,
                26486
            ],
            [
                26486,
                26515
            ],
            [
                26578,
                26590
            ],
            [
                26573,
                26577
            ],
            [
                26591,
                26615
            ],
            [
                26619,
                26662
            ],
            [
                26670,
                26672
            ],
            [
                26672,
                26701
            ],
            [
                26709,
                26710
            ],
            [
                26711,
                26736
            ],
            [
                26747,
                26772
            ],
            [
                26865,
                26948
            ],
            [
                26970,
                26976
            ],
            [
                26949,
                26953
            ],
            [
                27015,
                27017
            ],
            [
                27017,
                27152
            ],
            [
                27162,
                27166
            ],
            [
                27173,
                27175
            ],
            [
                27175,
                27216
            ],
            [
                27237,
                27239
            ],
            [
                27239,
                27350
            ],
            [
                27417,
                27419
            ],
            [
                27419,
                27421
            ],
            [
                27452,
                27454
            ],
            [
                27533,
                27592
            ],
            [
                27595,
                27630
            ],
            [
                27639,
                27730
            ],
            [
                27772,
                27776
            ],
            [
                27592,
                27593
            ],
            [
                27789,
                27812
            ],
            [
                27818,
                27821
            ],
            [
                27813,
                27817
            ],
            [
                27835,
                27854
            ],
            [
                27854,
                27926
            ],
            [
                27926,
                27958
            ],
            [
                27967,
                27975
            ],
            [
                27984,
                28012
            ]
        ],
        "row_chars": [
            [
                0,
                223
            ],
            [
                223,
                722
            ],
            [
                722,
                818
            ],
            [
                818,
                1079
            ],
            [
                1079,
                1189
            ],
            [
                1189,
                1429
            ],
            [
                1429,
                1520
            ],
            [
                1520,
                1832
            ],
            [
                1832,
                1880
            ],
            [
                1880,
                2035
            ],
            [
                2035,
                2067
            ],
            [
                2067,
                2080
            ],
            [
                2080,
                2106
            ],
            [
                2106,
                2189
            ],
            [
                2189,
                2283
            ],
            [
                2283,
                2398
            ],
            [
                2398,
                2458
            ],
            [
                2458,
                2486
            ],
            [
                2486,
                2528
            ],
            [
                2528,
                2541
            ],
            [
                2541,
                2575
            ],
            [
                2575,
                2663
            ],
            [
                2663,
                2848
            ],
            [
                2848,
                2955
            ],
            [
                2955,
                3153
            ],
            [
                3153,
                3264
            ],
            [
                3264,
                3350
            ],
            [
                3350,
                3396
            ],
            [
                3396,
                3472
            ],
            [
                3472,
                3551
            ],
            [
                3551,
                3641
            ],
            [
                3641,
                3787
            ],
            [
                3787,
                3858
            ],
            [
                3858,
                3869
            ],
            [
                3869,
                3916
            ],
            [
                3916,
                4009
            ],
            [
                4009,
                4065
            ],
            [
                4065,
                4168
            ],
            [
                4168,
                4214
            ],
            [
                4214,
                4305
            ],
            [
                4305,
                4421
            ],
            [
                4421,
                4461
            ],
            [
                4461,
                4498
            ],
            [
                4498,
                4655
            ],
            [
                4655,
                4721
            ],
            [
                4721,
                4785
            ],
            [
                4785,
                4861
            ],
            [
                4861,
                4952
            ],
            [
                4952,
                5118
            ],
            [
                5118,
                5226
            ],
            [
                5226,
                5292
            ],
            [
                5292,
                5372
            ],
            [
                5372,
                5421
            ],
            [
                5421,
                5466
            ],
            [
                5466,
                5585
            ],
            [
                5585,
                5657
            ],
            [
                5657,
                5699
            ],
            [
                5699,
                5731
            ],
            [
                5731,
                5830
            ],
            [
                5830,
                5878
            ],
            [
                5878,
                5913
            ],
            [
                5913,
                5933
            ],
            [
                5933,
                6007
            ],
            [
                6007,
                6034
            ],
            [
                6034,
                6121
            ],
            [
                6121,
                6171
            ],
            [
                6171,
                6207
            ],
            [
                6207,
                6241
            ],
            [
                6241,
                6272
            ],
            [
                6272,
                6307
            ],
            [
                6307,
                6410
            ],
            [
                6410,
                6676
            ],
            [
                6676,
                6922
            ],
            [
                6922,
                7043
            ],
            [
                7043,
                7292
            ],
            [
                7292,
                7468
            ],
            [
                7468,
                7692
            ],
            [
                7692,
                7791
            ],
            [
                7791,
                7871
            ],
            [
                7871,
                8008
            ],
            [
                8008,
                8073
            ],
            [
                8073,
                8097
            ],
            [
                8097,
                8129
            ],
            [
                8129,
                8170
            ],
            [
                8170,
                8281
            ],
            [
                8281,
                8337
            ],
            [
                8337,
                8492
            ],
            [
                8492,
                8620
            ],
            [
                8620,
                8781
            ],
            [
                8781,
                8840
            ],
            [
                8840,
                8955
            ],
            [
                8955,
                9064
            ],
            [
                9064,
                9088
            ],
            [
                9088,
                9140
            ],
            [
                9140,
                9189
            ],
            [
                9189,
                9206
            ],
            [
                9206,
                9255
            ],
            [
                9255,
                9417
            ],
            [
                9417,
                9478
            ],
            [
                9478,
                9529
            ],
            [
                9529,
                9679
            ],
            [
                9679,
                9779
            ],
            [
                9779,
                9864
            ],
            [
                9864,
                9976
            ],
            [
                9976,
                10117
            ],
            [
                10117,
                10140
            ],
            [
                10140,
                10188
            ],
            [
                10188,
                10246
            ],
            [
                10246,
                10334
            ],
            [
                10334,
                10400
            ],
            [
                10400,
                10464
            ],
            [
                10464,
                10481
            ],
            [
                10481,
                10532
            ],
            [
                10532,
                10605
            ],
            [
                10605,
                10654
            ],
            [
                10654,
                10701
            ],
            [
                10701,
                10822
            ],
            [
                10822,
                10931
            ],
            [
                10931,
                10975
            ],
            [
                10975,
                11018
            ],
            [
                11018,
                11108
            ],
            [
                11108,
                11186
            ],
            [
                11186,
                11274
            ],
            [
                11274,
                11325
            ],
            [
                11325,
                11497
            ],
            [
                11497,
                11551
            ],
            [
                11551,
                11668
            ],
            [
                11668,
                11856
            ],
            [
                11856,
                11988
            ],
            [
                11988,
                12243
            ],
            [
                12243,
                12375
            ],
            [
                12375,
                12432
            ],
            [
                12432,
                12545
            ],
            [
                12545,
                12607
            ],
            [
                12607,
                12730
            ],
            [
                12730,
                12846
            ],
            [
                12846,
                12890
            ],
            [
                12890,
                13130
            ],
            [
                13130,
                13308
            ],
            [
                13308,
                13449
            ],
            [
                13449,
                13546
            ],
            [
                13546,
                13666
            ],
            [
                13666,
                13828
            ],
            [
                13828,
                14004
            ],
            [
                14004,
                14068
            ],
            [
                14068,
                14137
            ],
            [
                14137,
                14193
            ],
            [
                14193,
                14355
            ],
            [
                14355,
                14479
            ],
            [
                14479,
                14598
            ],
            [
                14598,
                14721
            ],
            [
                14721,
                14831
            ],
            [
                14831,
                14880
            ],
            [
                14880,
                15137
            ],
            [
                15137,
                15226
            ],
            [
                15226,
                15277
            ],
            [
                15277,
                15334
            ],
            [
                15334,
                15461
            ],
            [
                15461,
                15518
            ],
            [
                15518,
                15632
            ],
            [
                15632,
                15669
            ],
            [
                15669,
                15701
            ],
            [
                15701,
                15820
            ],
            [
                15820,
                16003
            ],
            [
                16003,
                16094
            ],
            [
                16094,
                16106
            ],
            [
                16106,
                16138
            ],
            [
                16138,
                16370
            ],
            [
                16370,
                16555
            ],
            [
                16555,
                16691
            ],
            [
                16691,
                16746
            ],
            [
                16746,
                16859
            ],
            [
                16859,
                16920
            ],
            [
                16920,
                17019
            ],
            [
                17019,
                17086
            ],
            [
                17086,
                17230
            ],
            [
                17230,
                17321
            ],
            [
                17321,
                17404
            ],
            [
                17404,
                17440
            ],
            [
                17440,
                17533
            ],
            [
                17533,
                17573
            ],
            [
                17573,
                17589
            ],
            [
                17589,
                17763
            ],
            [
                17763,
                17801
            ],
            [
                17801,
                17863
            ],
            [
                17863,
                18087
            ],
            [
                18087,
                18135
            ],
            [
                18135,
                18184
            ],
            [
                18184,
                18279
            ],
            [
                18279,
                18423
            ],
            [
                18423,
                18467
            ],
            [
                18467,
                18555
            ],
            [
                18555,
                18606
            ],
            [
                18606,
                18658
            ],
            [
                18658,
                18715
            ],
            [
                18715,
                18755
            ],
            [
                18755,
                18824
            ],
            [
                18824,
                18874
            ],
            [
                18874,
                18887
            ],
            [
                18887,
                18976
            ],
            [
                18976,
                19021
            ],
            [
                19021,
                19096
            ],
            [
                19096,
                19138
            ],
            [
                19138,
                19233
            ],
            [
                19233,
                19247
            ],
            [
                19247,
                19335
            ],
            [
                19335,
                19439
            ],
            [
                19439,
                19554
            ],
            [
                19554,
                19589
            ],
            [
                19589,
                19624
            ],
            [
                19624,
                19661
            ],
            [
                19661,
                19688
            ],
            [
                19688,
                19740
            ],
            [
                19740,
                19753
            ],
            [
                19753,
                19924
            ],
            [
                19924,
                19973
            ],
            [
                19973,
                20053
            ],
            [
                20053,
                20106
            ],
            [
                20106,
                20172
            ],
            [
                20172,
                20196
            ],
            [
                20196,
                20227
            ],
            [
                20227,
                20319
            ],
            [
                20319,
                20405
            ],
            [
                20405,
                20443
            ],
            [
                20443,
                20496
            ],
            [
                20496,
                20522
            ],
            [
                20522,
                20548
            ],
            [
                20548,
                20596
            ],
            [
                20596,
                20658
            ],
            [
                20658,
                20767
            ],
            [
                20767,
                20794
            ],
            [
                20794,
                20831
            ],
            [
                20831,
                20884
            ],
            [
                20884,
                20990
            ],
            [
                20990,
                21081
            ],
            [
                21081,
                21204
            ],
            [
                21204,
                21224
            ],
            [
                21224,
                21243
            ],
            [
                21243,
                21326
            ],
            [
                21326,
                21402
            ],
            [
                21402,
                21471
            ],
            [
                21471,
                21541
            ],
            [
                21541,
                21671
            ],
            [
                21671,
                21752
            ],
            [
                21752,
                21847
            ],
            [
                21847,
                21876
            ],
            [
                21876,
                22147
            ],
            [
                22147,
                22208
            ],
            [
                22208,
                22314
            ],
            [
                22314,
                22358
            ],
            [
                22358,
                22429
            ],
            [
                22429,
                22549
            ],
            [
                22549,
                22584
            ],
            [
                22584,
                22866
            ],
            [
                22866,
                22969
            ],
            [
                22969,
                23013
            ],
            [
                23013,
                23046
            ],
            [
                23046,
                23099
            ],
            [
                23099,
                23142
            ],
            [
                23142,
                23187
            ],
            [
                23187,
                23273
            ],
            [
                23273,
                23321
            ],
            [
                23321,
                23360
            ],
            [
                23360,
                23403
            ],
            [
                23403,
                23455
            ],
            [
                23455,
                23525
            ],
            [
                23525,
                23591
            ],
            [
                23591,
                23622
            ],
            [
                23622,
                23828
            ],
            [
                23828,
                23932
            ],
            [
                23932,
                23952
            ],
            [
                23952,
                23984
            ],
            [
                23984,
                24003
            ],
            [
                24003,
                24029
            ],
            [
                24029,
                24219
            ],
            [
                24219,
                24389
            ],
            [
                24389,
                24539
            ],
            [
                24539,
                24666
            ],
            [
                24666,
                24755
            ],
            [
                24755,
                24963
            ],
            [
                24963,
                24993
            ],
            [
                24993,
                25033
            ],
            [
                25033,
                25052
            ],
            [
                25052,
                25113
            ],
            [
                25113,
                25146
            ],
            [
                25146,
                25304
            ],
            [
                25304,
                25354
            ],
            [
                25354,
                25687
            ],
            [
                25687,
                25789
            ],
            [
                25789,
                25869
            ],
            [
                25869,
                25989
            ],
            [
                25989,
                26095
            ],
            [
                26095,
                26146
            ],
            [
                26146,
                26206
            ],
            [
                26206,
                26316
            ],
            [
                26316,
                26399
            ],
            [
                26399,
                26439
            ],
            [
                26439,
                26486
            ],
            [
                26486,
                26516
            ],
            [
                26516,
                26672
            ],
            [
                26672,
                26774
            ],
            [
                26774,
                26865
            ],
            [
                26865,
                26949
            ],
            [
                26949,
                27017
            ],
            [
                27017,
                27175
            ],
            [
                27175,
                27239
            ],
            [
                27239,
                27419
            ],
            [
                27419,
                27454
            ],
            [
                27454,
                27533
            ],
            [
                27533,
                27854
            ],
            [
                27854,
                27926
            ],
            [
                27926,
                28012
            ]
        ]
    },
    "abridged": {
        "text": "It must be acknowledged that Mrs. Greenow was a resourceful woman, and very prudent for others, though perhaps not for herself. Her marriage with Captain Bellfield was certainly a rash act, although she did take so much care to keep her income in her own hands; but the manner in which she made him live discreetly for some months before their marriage, the tact with which she renewed the friendship between him and Mr. Cheesacre, and the skill she used in at last providing Mr. Cheesacre with a wife, oblige us to admit that, as a general, she had great powers.\nWhen Alice reached Vavasor Hall she found Charlie Fairstairs staying there on a long visit. Charlie and Kate were to be the two bridesmaids, and, as Kate told her cousin in their first confidential talk that evening, there were already great hopes that the master of Oileymead might be brought to surrender.\nIt was true that Charlie had not a shilling, and that Mr. Cheesacre had set his heart on marrying an heiress. It was true that Miss Fairstairs' connections were without rank or fashion, and that the gentleman loved rank and fashion dearly. It was true that Charlie was no beauty, and that Cheesacre had an eye for feminine charms. It was true that he had despised Charlie, and had spoken his contempt openly; that he had learned to regard her as poor and despicable, because she was common in his eyes. It is thus that the Cheesacres judge of people. But in spite of all these difficulties Mrs. Greenow had taken up poor Charlie's case, and Kate Vavasor expressed a strong opinion that her aunt would win.\n\"What has she done to the man?\" Alice asked.\n\"Coaxed him; simply that. He doesn't know how to say no to her. Sometimes I have thought that he might run away, but I don't think so now. She has little chats with him from day to day, which are so alluring to him that he cannot tear himself off. In the middle of one of them he will find himself engaged.\"\n\"But the unfortunate girl! Won't it be a wretched marriage for her?\"\n\"Not at all. She'll make him a very good wife. He's one of those men to whom any woman, after a little time, will be the same. He'll be rough with her once a month or so, and perhaps tell her that she brought no money; but that won't break any bones, and Charlie will know how to fight her own battles. She'll save his money if she brings none, and in a few years' time they will quite understand each other.\"\nMr. Cheesacre and Captain Bellfield were at this time living in lodgings together, at Penrith, but came over and spent every other day at Vavasor, returning to their lodgings in the evening. It was eight days to the marriage when Alice arrived.\n\"It's to be very quiet, Alice,\" said her aunt; \"as quiet as can be. I owe that to the memory of the departed one. I know that he is looking down upon me, and that he approves all that I do.\"\nShe took Alice up to see her trousseau, and gave the other expectant bride some useful little hints about linen.\n\"Look here, these are quite new - have never been on yet, and I had them when I was married before. I hate meanness; but there is nothing like being careful, my dear. You have a lot of rich people about you just now, and will have ever so many things given you which you won't want. Do keep them all carefully. They may turn out useful, you know.\"\nAnd then Mrs. Greenow opened her mind about the Captain. \"He's as good as gold, my dear, in his own way. Of course, I know that he has faults, and I should like to know who hasn't. Bellfield may have been a little extravagant, I dare say. But how can a man help being extravagant when he hasn't got any regular income? He has been ill-treated in his profession. After fighting his country's battles through blood, and dust, and wounds - but I'll tell you about that another time.\"\n\"I suppose a man seldom does make a fortune, aunt, by being a soldier?\"\n\"Never, my dear. But he is the best-tempered creature alive, and the staunchest friend I ever met. You should hear what Mr. Cheesacre says of him! But you don't know Mr. Cheesacre?\"\n\"No, aunt, not yet.\"\n\"Between you and me, Kate might have had him if she liked; but perhaps Kate was right.\"\n\"I don't think he would have suited Kate at all.\"\n\"Because of the farmyard, you mean? Kate shouldn't give herself airs. But perhaps it's all for the best. But as I was saying, the friendship between those two men is quite wonderful, and I have always observed that when a man can create that kind of affection in the bosom of another man, he is the sort of man who makes a good husband.\"\nAlice knew almost as much of Bellfield's past life as Mrs. Greenow did herself; and Mrs. Greenow was aware of it. Nevertheless, she had a pleasure in telling her own story, and seemed to believe every word that she spoke.\nOn the following day the two gentlemen came over, and Alice observed that Miss Fairstairs hardly spoke to Mr. Cheesacre, but avoided him very markedly. They drank tea out of doors, and when Mr. Cheesacre sauntered towards the end of the bench on which Charlie was sitting, Charlie got up and walked away. And when they strolled about the place afterwards, she was at great pains to attach herself to some other person, so that Mr. Cheesacre could not attach himself to her.\nAt one time Mr. Cheesacre did get close to her and spoke some indifferent word. He knew that he was being cut.\n\"I don't know, sir,\" said Charlie, again moving away with dignity to Alice, who was close by. \"I know you have just come home from Switzerland,\" said Charlie. \"Beautiful Switzerland! Do tell me something about Switzerland!\"\nMr. Cheesacre had heard that Alice was the dear friend of a lady who would some day become a duchess. He therefore naturally held her in awe, and slunk away. Mrs. Greenow clung lovingly to her future husband, and Mr. Cheesacre was very much alone and unhappy. He had generally enjoyed these days at Vavasor Hall, having fancied himself to be the dominant spirit there. That Mrs. Greenow was always in truth the dominant spirit I need hardly say; but she knew how to make a companion happy, and also how to make him wretched. On this day poor Cheesacre was very wretched.\n\"I don't think I shall go there any more,\" he said to Bellfield, as they drove back to Penrith that evening.\n\"Not go there any more, Cheesy?\" said Bellfield; \"why, we are to have the dinner in the field on Friday. It's your own doing.\"\n\"Well, yes; I'll go on Friday, but not after that.\"\n\"You'll stop and see me married, old fellow?\"\n\"What's the use? You'll get your wife, and that's enough for you. The truth is, that since that girl came down from London with her d---d airs;\" - he meant poor Alice - \"the place is quite changed. I do hate your swells.\" Captain Bellfield argued with him; but Cheesacre was cross and touchy.\n\"You did it admirably, my dear,\" said Mrs. Greenow that night to Charlie Fairstairs. \"I really did not think you had so much in you.\"\n\"Oh, I don't know,\" said Charlie, blushing at the praise.\n\"And it's the only way, my dear, with such a one as him. If he does come round, you'll find him an excellent husband.\"\n\"I don't think he cares for me a bit,\" said Charlie, whimpering.\n\"Pooh, nonsense! Girls never know whether men care for them or not. If he asks you to marry him, won't that be a sign that he cares for you? and if he don't, why, there'll be no harm done.\"\n\"If he thinks it's his money-\" began Charlie.\n\"Now, don't talk nonsense, Charlie,\" said Mrs. Greenow, \"Of course it's his money, more or less. You don't mean to tell me you'd go and fall in love with him if he was like Bellfield, and hadn't got a rap? I can afford that sort of thing; you can't. I don't mean to say you ain't to love him. I've no doubt you will, and make him a very good wife. And now, my dear, mind you look your best on Friday. I'll get him away immediately after dinner, and when he's done with me you can contrive to be in his way, you know.\"\nThe next day the ladies were all alone, and devoted themselves to millinery and household cares. Large trunks of household linen had arrived, all of it marked with the name of Greenow.\n\"We must cut out the pieces, Jeannette, and work 'em in again ever so carefully,\" said the widow.\n\"It will always show,\" said Jeannette, shaking her head.\n\"But not one person in ten will notice it. We'd always put them on the beds with the name to the feet, you know.\"\nIt was not quite true that Cheesacre had arranged the dinner out in the field, although no doubt he thought he had done so. The little treat had been arranged by Mrs. Greenow. There was not much scope for a picnic here. Besides their own party, no guest could be caught except the clergyman. He was soon to perform Mrs. Greenow's marriage ceremony, and had promised to grace this little festival. It amounted to this: that they were to eat their dinner uncomfortably in the field instead of comfortably in the dining-room. But Mrs. Greenow knew that Charlie's charms would be much strengthened by a dinner out-of-doors.\n\"Nothing,\" she said to Kate, \"makes a man come forward so well as putting him of his usual track.\"\nAt two o'clock the gig from Penrith arrived at the Hall, and for the next hour both Cheesacre and the Captain were engaged in preparing the tables and carrying out the food. The Captain and Charlie Fairstairs were going to lay the cloth.\n\"Let me do it,\" said Cheesacre, taking it out of the Captain's hands.\n\"Oh, certainly,\" said the Captain.\n\"Captain Bellfield would do it much better,\" said Charlie, with a little toss of her head; \"he's as good as a married man, and they always do these things best.\"\nThe day was fine, and although the midges were troublesome, the dinner went off very nicely. Mrs. Greenow remembered the grace just in time, with the clergyman there. Mr. Cheesacre sat on her right, and the clergyman on her left, and she hardly spoke a word to Bellfield. Her sweetest smiles were all given to Cheesacre. She was anxious to keep the parson in good-humour, and therefore illuminated him once in every five minutes with a passing ray, but the full splendour of her light was poured out upon Cheesacre, as it never had before been poured. How she did flatter him! Oileymead was the only paradise she had ever seen.\n\"Ah, me; when I think of it sometimes - but never mind.\" A moment came to him when he thought that even yet he might win the race, and send Bellfield away howling into outer darkness. The widow saw the moment well. \"I know I have done for the best,\" said she, \"and at any rate, it's done now.\"\n\"Not done yet,\" said he plaintively.\n\"Yes; done. Besides, a man in your position in the county should always marry a wife younger than yourself.\" Cheesacre did not understand the argument, but he liked the allusion to his position in the county, and he was happy. Both during and after the dinner, he was allowed to give his orders to Bellfield in a manner that gratified him much.\n\"You must have another glass of champagne with me, my friend,\" said Mrs. Greenow; and Mr. Cheesacre drank the other glass of champagne.\nAfter dinner they started off for a ramble through the fields, and Mrs. Greenow and Mr. Cheesacre were together. Charlie Fairstairs did not go with them at all. I think she went into the house and washed her face, and brushed her hair, and settled her muslin. Captain Bellfield went with Alice, and assured her that he fully meant to correct the error of his ways.\n\"I know what it is,\" he said, \"to be connected with such a family as yours, Miss Vavasor.\" He too had heard about the future duchess, and wished to be on his best behaviour. Kate fell to the lot of the parson.\n\"This is the last time we shall ever be together in this way,\" said the widow to her friend. \"On Wednesday I become Mrs. Bellfield; but Mr. Cheesacre, I hope we are not to be strangers hereafter?\" Mr. Cheesacre said that he hoped not. Oileymead would always be open to Captain and Mrs. Bellfield.\n\"We all know your hospitality,\" said she; \"my husband to be always declares that you are the very ideal of an English country gentleman.\"\n\"Merely a poor Norfolk farmer,\" said Cheesacre. \"There has been some talk about the Commission of the Peace, but I don't think anything of it.\"\n\"It has been the greatest blessing in the world for him that he has known you,\" said Mrs. Greenow.\n\"I've tried to be good-natured; that's all. There isn't a better fellow than Bellfield living. He and I ran for the same plate, and he has won it. He's a lucky fellow, and I don't begrudge him his luck.\"\n\"That's so manly of you, Mr. Cheesacre! But, indeed, the plate you speak of was not worth your running for.\"\n\"I may have my own opinion about that, you know.\"\n\"It was not. I know very well what my mission is in life. The mistress of your house, Mr. Cheesacre, should not be any man's widow. A virgin heart should be yours; and a virgin heart may be yours, if you choose to accept it.\"\n\"Oh, bother!\"\n\"If you choose to take my solicitude in that way, of course I will stop. You were good enough to say that you wished to see me and my husband in your hospitable halls. But do you think that I could be a visitor at your house unless there is a mistress there?\"\n\"Upon my word, I think you might.\"\n\"No, Mr. Cheesacre; certainly not. But if you were married-\"\n\"You are always wanting to marry me off, Mrs. Greenow.\"\n\"I am. It is the only way in which there can be any friendship between us. If you value the warm affection of a virgin heart-\"\n\"Why, Mrs. Greenow, all yesterday she wouldn't say a word to me.\"\n\"Is that all you know about it? Are you so ignorant that you cannot see when a girl's heart is breaking beneath her stays?\" This almost improper allusion had quite an effect on Mr. Cheesacre's sensitive bosom. \"Did you say a word to her yesterday?\"\n\"Oh, Mrs. Greenow; come!\"\n\"But it is time that we should go back to them. We will have our tea, and you shall have your pipe and brandy-and-water, and Charlie shall bring it to you. Shall she, Mr. Cheesacre?\"\n\"If she likes she shall, of course.\"\n\"But remember, Mr. Cheesacre, I'm quite serious in what I say about your having a mistress for your house. Only think what an age you'll be when your children grow up, if you don't marry soon.\"\nThey returned to the field in which they had dined, and found Charlie under the trees, with her muslin looking very fresh.\n\"I have told him that you should fill his pipe for him,\" said Mrs. Greenow.\n\"He doesn't care for ladies to fill his pipe for him,\" said Charlie.\n\"Try,\" said the widow, \"while I go indoors and order the tea.\"\nIt had been necessary to put the bait very close before Cheesacre's eyes, or there would have been no hope that he might take it. The bait had been put so very close that we must feel sure that he saw the hook. But there are fish so silly that they will take the bait although they know the hook is there. Cheesacre understood it all. He could see that Mrs. Greenow was trying to catch him as a husband for Charlie Fairstairs; and he knew also that he had always despised Charlie, and that no worldly advantage whatever would accrue to him by a marriage with such a girl.\nBut there she was, and he didn't quite know how to avoid it. She did look rather nice in her muslin frock, and he felt that he should like to kiss her. He needn't marry her because he kissed her. The champagne which had created the desire also gave him the audacity. He gave one glance around him to see that he was not observed, and then he did kiss Charlie Fairstairs under the trees.\n\"Oh, Mr. Cheesacre,\" said Charlie.\n\"Oh, Mr. Cheesacre,\" echoed a laughing voice; and poor Cheesacre, looking round, saw that Mrs. Greenow, who ought to have been inside the house looking after the boiling water, was for some reason quite close by.\n\"Mr. Cheesacre,\" said Charlie sobbing, \"how dare you do that? - where all the world could see you?\"\n\"It was only Mrs. Greenow,\" said Cheesacre.\n\"And what will she think of me?\"\n\"Lord bless you - she won't think anything about it.\"\n\"But I do; I think a great deal about it. I don't know what to do.\" Whereupon Charlie got up from her seat under the trees and began to move away slowly.\nCheesacre thought about it for a moment or two. Should he follow her or should he not? He knew that he had better not follow her. He knew that she was bait with a very visible hook. But after all, perhaps it wouldn't do him much harm to be caught.\nSo he got up and followed her. I don't suppose she meant to take the way towards the woods and the old summer-house: she was too much beside herself to know where she was going, no doubt. But that was the path she did take, and before long she and Cheesacre were in the summerhouse together.\n\"Don't, Sam, don't! Somebody really will be coming. Well, then, there. Now I won't do it again.\" 'Twas thus she spoke when the last kiss was given; unless there may have been one or two later in the evening, to which it is not necessary to allude here. But by the time of that last kiss in the summer-house Miss Fairstairs was the promised bride of Mr. Cheesacre.\nHowever, Mr. Cheesacre was troubled as he rose from his happy seat after that last embrace. How would he tell his friends? He had promised Charlie, and perhaps he would keep his promise, but it might be as well not to make it all too public at once.\nBut Charlie wasn't going to be thrown over. She returned therefore triumphantly among them all, blushing indeed, and with her hand upon her lover's arm; but so close to him that there could be no mistake.\n\"Goodness, gracious, Charlie! where have you and Mr. Cheesacre been?\" said Mrs. Greenow.\n\"We got up into the woods and lost ourselves,\" said Charlie.\nIt would be too long to tell now, in these last pages of our story, how Cheesacre strove to escape, and with what skill Mrs. Greenow kept him to his bargain. Before that evening was over, under the comfortable influence of a glass of hot brandy-and-water, he was forced to confess that he had made himself the happy possessor of Charlie Fairstairs' heart and hand.\n\"And you are a lucky man,\" said the widow with enthusiasm; \"and I congratulate you with all my heart. Don't let there be any delay now, because a good thing can't be done too soon.\" And indeed, before that night was over, Mrs. Greenow had fixed the day. She was a woman who was quite in earnest when she went to work, and I hope that Miss Fairstairs was grateful. Then, in her presence, the last kiss on that eventful evening was given.\n\"Come, Charlie, be good-natured to him. He's as good as your own now,\" said the widow. And Charlie was good-natured.\nMrs. Greenow said to Kate, the next day, \"I'm lending her money to get all her things. He shall come to the scratch, if I have to go all the way to Norfolk and fetch him by his ears.\"\n\"And I shouldn't wonder if she did have to go to Norfolk,\" said Kate to her cousin.\nI cannot relate that far. I can only say that, when I think of Mrs. Greenow's force of character and warmth of friendship, I feel that Miss Fairstairs' prospects are good.\nMrs. Greenow's own marriage was completed. She took Captain Bellfield for better or for worse, with a thorough determination to make the best of his worst. He was a lucky man. He had found a wife who could forgive all his past offences - and also, if necessary, some future ones; who had money enough for all his wants, and kindness enough to gratify them, and who had, most importantly, strength enough to keep him from ruining them both. Reader, let us wish a happy married life to Captain and Mrs. Bellfield!\nThe day after the ceremony Alice and Kate started for Matching Priory.",
        "paragraph_chars": [
            [
                0,
                564
            ],
            [
                564,
                872
            ],
            [
                872,
                1578
            ],
            [
                1578,
                1623
            ],
            [
                1623,
                1931
            ],
            [
                1931,
                2000
            ],
            [
                2000,
                2410
            ],
            [
                2410,
                2655
            ],
            [
                2655,
                2846
            ],
            [
                2846,
                2959
            ],
            [
                2959,
                3307
            ],
            [
                3307,
                3788
            ],
            [
                3788,
                3860
            ],
            [
                3860,
                4042
            ],
            [
                4042,
                4063
            ],
            [
                4063,
                4151
            ],
            [
                4151,
                4201
            ],
            [
                4201,
                4539
            ],
            [
                4539,
                4761
            ],
            [
                4761,
                5235
            ],
            [
                5235,
                5346
            ],
            [
                5346,
                5570
            ],
            [
                5570,
                6141
            ],
            [
                6141,
                6250
            ],
            [
                6250,
                6377
            ],
            [
                6377,
                6429
            ],
            [
                6429,
                6475
            ],
            [
                6475,
                6768
            ],
            [
                6768,
                6902
            ],
            [
                6902,
                6960
            ],
            [
                6960,
                7079
            ],
            [
                7079,
                7144
            ],
            [
                7144,
                7334
            ],
            [
                7334,
                7380
            ],
            [
                7380,
                7898
            ],
            [
                7898,
                8083
            ],
            [
                8083,
                8181
            ],
            [
                8181,
                8238
            ],
            [
                8238,
                8352
            ],
            [
                8352,
                8972
            ],
            [
                8972,
                9071
            ],
            [
                9071,
                9309
            ],
            [
                9309,
                9379
            ],
            [
                9379,
                9414
            ],
            [
                9414,
                9576
            ],
            [
                9576,
                10204
            ],
            [
                10204,
                10498
            ],
            [
                10498,
                10535
            ],
            [
                10535,
                10880
            ],
            [
                10880,
                11016
            ],
            [
                11016,
                11381
            ],
            [
                11381,
                11591
            ],
            [
                11591,
                11888
            ],
            [
                11888,
                12026
            ],
            [
                12026,
                12170
            ],
            [
                12170,
                12269
            ],
            [
                12269,
                12473
            ],
            [
                12473,
                12582
            ],
            [
                12582,
                12632
            ],
            [
                12632,
                12858
            ],
            [
                12858,
                12872
            ],
            [
                12872,
                13132
            ],
            [
                13132,
                13167
            ],
            [
                13167,
                13228
            ],
            [
                13228,
                13284
            ],
            [
                13284,
                13411
            ],
            [
                13411,
                13477
            ],
            [
                13477,
                13726
            ],
            [
                13726,
                13752
            ],
            [
                13752,
                13935
            ],
            [
                13935,
                13972
            ],
            [
                13972,
                14166
            ],
            [
                14166,
                14289
            ],
            [
                14289,
                14365
            ],
            [
                14365,
                14434
            ],
            [
                14434,
                14497
            ],
            [
                14497,
                15069
            ],
            [
                15069,
                15456
            ],
            [
                15456,
                15491
            ],
            [
                15491,
                15704
            ],
            [
                15704,
                15804
            ],
            [
                15804,
                15848
            ],
            [
                15848,
                15881
            ],
            [
                15881,
                15935
            ],
            [
                15935,
                16089
            ],
            [
                16089,
                16337
            ],
            [
                16337,
                16629
            ],
            [
                16629,
                16993
            ],
            [
                16993,
                17243
            ],
            [
                17243,
                17448
            ],
            [
                17448,
                17537
            ],
            [
                17537,
                17598
            ],
            [
                17598,
                17963
            ],
            [
                17963,
                18400
            ],
            [
                18400,
                18517
            ],
            [
                18517,
                18701
            ],
            [
                18701,
                18785
            ],
            [
                18785,
                18957
            ],
            [
                18957,
                19469
            ],
            [
                19469,
                19539
            ]
        ],
        "segment_chars": [
            [
                0,
                128
            ],
            [
                128,
                564
            ],
            [
                564,
                656
            ],
            [
                656,
                872
            ],
            [
                872,
                982
            ],
            [
                982,
                1112
            ],
            [
                1112,
                1203
            ],
            [
                1203,
                1375
            ],
            [
                1375,
                1423
            ],
            [
                1423,
                1578
            ],
            [
                1578,
                1610
            ],
            [
                1610,
                1623
            ],
            [
                1623,
                1649
            ],
            [
                1649,
                1687
            ],
            [
                1687,
                1762
            ],
            [
                1762,
                1871
            ],
            [
                1871,
                1931
            ],
            [
                1931,
                1958
            ],
            [
                1958,
                2000
            ],
            [
                2000,
                2013
            ],
            [
                2013,
                2047
            ],
            [
                2047,
                2127
            ],
            [
                2127,
                2303
            ],
            [
                2303,
                2410
            ],
            [
                2410,
                2601
            ],
            [
                2601,
                2655
            ],
            [
                2655,
                2723
            ],
            [
                2723,
                2769
            ],
            [
                2769,
                2846
            ],
            [
                2846,
                2959
            ],
            [
                2959,
                3059
            ],
            [
                3059,
                3126
            ],
            [
                3126,
                3242
            ],
            [
                3242,
                3270
            ],
            [
                3270,
                3307
            ],
            [
                3307,
                3364
            ],
            [
                3364,
                3412
            ],
            [
                3412,
                3488
            ],
            [
                3488,
                3546
            ],
            [
                3546,
                3626
            ],
            [
                3626,
                3669
            ],
            [
                3669,
                3788
            ],
            [
                3788,
                3860
            ],
            [
                3860,
                3877
            ],
            [
                3877,
                3959
            ],
            [
                3959,
                4007
            ],
            [
                4007,
                4042
            ],
            [
                4042,
                4063
            ],
            [
                4063,
                4151
            ],
            [
                4151,
                4201
            ],
            [
                4201,
                4237
            ],
            [
                4237,
                4271
            ],
            [
                4271,
                4306
            ],
            [
                4306,
                4539
            ],
            [
                4539,
                4653
            ],
            [
                4653,
                4761
            ],
            [
                4761,
                4913
            ],
            [
                4913,
                5066
            ],
            [
                5066,
                5235
            ],
            [
                5235,
                5315
            ],
            [
                5315,
                5346
            ],
            [
                5346,
                5440
            ],
            [
                5440,
                5505
            ],
            [
                5505,
                5529
            ],
            [
                5529,
                5570
            ],
            [
                5570,
                5672
            ],
            [
                5672,
                5728
            ],
            [
                5728,
                5830
            ],
            [
                5830,
                5939
            ],
            [
                5939,
                6095
            ],
            [
                6095,
                6141
            ],
            [
                6141,
                6250
            ],
            [
                6250,
                6283
            ],
            [
                6283,
                6355
            ],
            [
                6355,
                6377
            ],
            [
                6377,
                6429
            ],
            [
                6429,
                6475
            ],
            [
                6475,
                6492
            ],
            [
                6492,
                6541
            ],
            [
                6541,
                6673
            ],
            [
                6673,
                6697
            ],
            [
                6697,
                6768
            ],
            [
                6768,
                6853
            ],
            [
                6853,
                6902
            ],
            [
                6902,
                6960
            ],
            [
                6960,
                7017
            ],
            [
                7017,
                7079
            ],
            [
                7079,
                7144
            ],
            [
                7144,
                7161
            ],
            [
                7161,
                7212
            ],
            [
                7212,
                7285
            ],
            [
                7285,
                7334
            ],
            [
                7334,
                7380
            ],
            [
                7380,
                7477
            ],
            [
                7477,
                7586
            ],
            [
                7586,
                7630
            ],
            [
                7630,
                7673
            ],
            [
                7673,
                7728
            ],
            [
                7728,
                7781
            ],
            [
                7781,
                7898
            ],
            [
                7898,
                7995
            ],
            [
                7995,
                8083
            ],
            [
                8083,
                8181
            ],
            [
                8181,
                8238
            ],
            [
                8238,
                8281
            ],
            [
                8281,
                8352
            ],
            [
                8352,
                8476
            ],
            [
                8476,
                8528
            ],
            [
                8528,
                8572
            ],
            [
                8572,
                8644
            ],
            [
                8644,
                8749
            ],
            [
                8749,
                8875
            ],
            [
                8875,
                8972
            ],
            [
                8972,
                9071
            ],
            [
                9071,
                9245
            ],
            [
                9245,
                9309
            ],
            [
                9309,
                9379
            ],
            [
                9379,
                9414
            ],
            [
                9414,
                9576
            ],
            [
                9576,
                9669
            ],
            [
                9669,
                9743
            ],
            [
                9743,
                9848
            ],
            [
                9848,
                9897
            ],
            [
                9897,
                10128
            ],
            [
                10128,
                10153
            ],
            [
                10153,
                10204
            ],
            [
                10204,
                10261
            ],
            [
                10261,
                10388
            ],
            [
                10388,
                10419
            ],
            [
                10419,
                10498
            ],
            [
                10498,
                10535
            ],
            [
                10535,
                10547
            ],
            [
                10547,
                10644
            ],
            [
                10644,
                10762
            ],
            [
                10762,
                10880
            ],
            [
                10880,
                11016
            ],
            [
                11016,
                11129
            ],
            [
                11129,
                11177
            ],
            [
                11177,
                11276
            ],
            [
                11276,
                11381
            ],
            [
                11381,
                11472
            ],
            [
                11472,
                11555
            ],
            [
                11555,
                11591
            ],
            [
                11591,
                11684
            ],
            [
                11684,
                11788
            ],
            [
                11788,
                11826
            ],
            [
                11826,
                11888
            ],
            [
                11888,
                12026
            ],
            [
                12026,
                12074
            ],
            [
                12074,
                12170
            ],
            [
                12170,
                12269
            ],
            [
                12269,
                12313
            ],
            [
                12313,
                12364
            ],
            [
                12364,
                12416
            ],
            [
                12416,
                12473
            ],
            [
                12473,
                12513
            ],
            [
                12513,
                12582
            ],
            [
                12582,
                12632
            ],
            [
                12632,
                12645
            ],
            [
                12645,
                12690
            ],
            [
                12690,
                12764
            ],
            [
                12764,
                12858
            ],
            [
                12858,
                12872
            ],
            [
                12872,
                12945
            ],
            [
                12945,
                13040
            ],
            [
                13040,
                13132
            ],
            [
                13132,
                13167
            ],
            [
                13167,
                13202
            ],
            [
                13202,
                13228
            ],
            [
                13228,
                13284
            ],
            [
                13284,
                13291
            ],
            [
                13291,
                13359
            ],
            [
                13359,
                13411
            ],
            [
                13411,
                13477
            ],
            [
                13477,
                13509
            ],
            [
                13509,
                13601
            ],
            [
                13601,
                13687
            ],
            [
                13687,
                13726
            ],
            [
                13726,
                13752
            ],
            [
                13752,
                13800
            ],
            [
                13800,
                13908
            ],
            [
                13908,
                13935
            ],
            [
                13935,
                13972
            ],
            [
                13972,
                14079
            ],
            [
                14079,
                14166
            ],
            [
                14166,
                14289
            ],
            [
                14289,
                14365
            ],
            [
                14365,
                14434
            ],
            [
                14434,
                14497
            ],
            [
                14497,
                14627
            ],
            [
                14627,
                14708
            ],
            [
                14708,
                14803
            ],
            [
                14803,
                14832
            ],
            [
                14832,
                15069
            ],
            [
                15069,
                15130
            ],
            [
                15130,
                15221
            ],
            [
                15221,
                15265
            ],
            [
                15265,
                15336
            ],
            [
                15336,
                15456
            ],
            [
                15456,
                15491
            ],
            [
                15491,
                15704
            ],
            [
                15704,
                15766
            ],
            [
                15766,
                15804
            ],
            [
                15804,
                15848
            ],
            [
                15848,
                15881
            ],
            [
                15881,
                15935
            ],
            [
                15935,
                15977
            ],
            [
                15977,
                16003
            ],
            [
                16003,
                16089
            ],
            [
                16089,
                16137
            ],
            [
                16137,
                16176
            ],
            [
                16176,
                16219
            ],
            [
                16219,
                16271
            ],
            [
                16271,
                16337
            ],
            [
                16337,
                16368
            ],
            [
                16368,
                16525
            ],
            [
                16525,
                16629
            ],
            [
                16629,
                16649
            ],
            [
                16649,
                16681
            ],
            [
                16681,
                16700
            ],
            [
                16700,
                16726
            ],
            [
                16726,
                16882
            ],
            [
                16882,
                16993
            ],
            [
                16993,
                17085
            ],
            [
                17085,
                17116
            ],
            [
                17116,
                17243
            ],
            [
                17243,
                17287
            ],
            [
                17287,
                17448
            ],
            [
                17448,
                17478
            ],
            [
                17478,
                17518
            ],
            [
                17518,
                17537
            ],
            [
                17537,
                17598
            ],
            [
                17598,
                17756
            ],
            [
                17756,
                17963
            ],
            [
                17963,
                18065
            ],
            [
                18065,
                18145
            ],
            [
                18145,
                18217
            ],
            [
                18217,
                18327
            ],
            [
                18327,
                18400
            ],
            [
                18400,
                18440
            ],
            [
                18440,
                18487
            ],
            [
                18487,
                18517
            ],
            [
                18517,
                18604
            ],
            [
                18604,
                18701
            ],
            [
                18701,
                18785
            ],
            [
                18785,
                18811
            ],
            [
                18811,
                18957
            ],
            [
                18957,
                19000
            ],
            [
                19000,
                19113
            ],
            [
                19113,
                19133
            ],
            [
                19133,
                19397
            ],
            [
                19397,
                19469
            ],
            [
                19469,
                19539
            ]
        ],
        "overlap_chars": [
            [
                0,
                47
            ],
            [
                60,
                65
            ],
            [
                65,
                70
            ],
            [
                71,
                102
            ],
            [
                119,
                128
            ],
            [
                128,
                167
            ],
            [
                178,
                224
            ],
            [
                225,
                227
            ],
            [
                233,
                236
            ],
            [
                237,
                243
            ],
            [
                244,
                246
            ],
            [
                247,
                330
            ],
            [
                344,
                400
            ],
            [
                401,
                512
            ],
            [
                513,
                564
            ],
            [
                564,
                624
            ],
            [
                633,
                656
            ],
            [
                656,
                761
            ],
            [
                772,
                779
            ],
            [
                779,
                811
            ],
            [
                812,
                871
            ],
            [
                872,
                982
            ],
            [
                982,
                1014
            ],
            [
                1028,
                1040
            ],
            [
                1041,
                1045
            ],
            [
                1049,
                1056
            ],
            [
                1056,
                1112
            ],
            [
                1112,
                1203
            ],
            [
                1203,
                1280
            ],
            [
                1281,
                1288
            ],
            [
                1289,
                1317
            ],
            [
                1318,
                1375
            ],
            [
                1375,
                1423
            ],
            [
                1423,
                1578
            ],
            [
                1578,
                1610
            ],
            [
                1610,
                1623
            ],
            [
                1623,
                1649
            ],
            [
                1649,
                1687
            ],
            [
                1687,
                1725
            ],
            [
                1726,
                1741
            ],
            [
                1757,
                1762
            ],
            [
                1762,
                1776
            ],
            [
                1783,
                1871
            ],
            [
                1871,
                1931
            ],
            [
                1931,
                1935
            ],
            [
                1936,
                1958
            ],
            [
                1958,
                2000
            ],
            [
                2000,
                2013
            ],
            [
                2013,
                2047
            ],
            [
                2047,
                2113
            ],
            [
                2114,
                2127
            ],
            [
                2127,
                2217
            ],
            [
                2217,
                2303
            ],
            [
                2303,
                2410
            ],
            [
                2410,
                2566
            ],
            [
                2567,
                2601
            ],
            [
                2601,
                2603
            ],
            [
                2608,
                2653
            ],
            [
                2653,
                2654
            ],
            [
                2655,
                2714
            ],
            [
                2715,
                2721
            ],
            [
                2721,
                2723
            ],
            [
                2723,
                2769
            ],
            [
                2769,
                2843
            ],
            [
                2846,
                2925
            ],
            [
                2926,
                2932
            ],
            [
                2933,
                2945
            ],
            [
                2957,
                2958
            ],
            [
                2960,
                2990
            ],
            [
                2993,
                3059
            ],
            [
                3059,
                3074
            ],
            [
                3074,
                3115
            ],
            [
                3115,
                3116
            ],
            [
                3124,
                3126
            ],
            [
                3126,
                3242
            ],
            [
                3242,
                3244
            ],
            [
                3250,
                3258
            ],
            [
                3268,
                3270
            ],
            [
                3270,
                3306
            ],
            [
                3307,
                3344
            ],
            [
                3345,
                3364
            ],
            [
                3364,
                3394
            ],
            [
                3394,
                3395
            ],
            [
                3396,
                3412
            ],
            [
                3412,
                3488
            ],
            [
                3488,
                3532
            ],
            [
                3534,
                3544
            ],
            [
                3544,
                3546
            ],
            [
                3546,
                3626
            ],
            [
                3626,
                3667
            ],
            [
                3667,
                3669
            ],
            [
                3669,
                3741
            ],
            [
                3744,
                3788
            ],
            [
                3788,
                3860
            ],
            [
                3860,
                3875
            ],
            [
                3875,
                3877
            ],
            [
                3877,
                3880
            ],
            [
                3881,
                3959
            ],
            [
                3959,
                4007
            ],
            [
                4007,
                4042
            ],
            [
                4042,
                4060
            ],
            [
                4064,
                4151
            ],
            [
                4151,
                4201
            ],
            [
                4201,
                4237
            ],
            [
                4237,
                4271
            ],
            [
                4271,
                4306
            ],
            [
                4306,
                4349
            ],
            [
                4356,
                4492
            ],
            [
                4493,
                4495
            ],
            [
                4496,
                4511
            ],
            [
                4512,
                4539
            ],
            [
                4539,
                4544
            ],
            [
                4545,
                4639
            ],
            [
                4640,
                4645
            ],
            [
                4646,
                4648
            ],
            [
                4651,
                4653
            ],
            [
                4653,
                4715
            ],
            [
                4734,
                4761
            ],
            [
                4761,
                4809
            ],
            [
                4809,
                4880
            ],
            [
                4880,
                4881
            ],
            [
                4898,
                4902
            ],
            [
                4911,
                4913
            ],
            [
                4913,
                4964
            ],
            [
                4965,
                4974
            ],
            [
                4975,
                5066
            ],
            [
                5066,
                5069
            ],
            [
                5080,
                5082
            ],
            [
                5089,
                5115
            ],
            [
                5115,
                5187
            ],
            [
                5190,
                5191
            ],
            [
                5230,
                5233
            ],
            [
                5235,
                5274
            ],
            [
                5275,
                5296
            ],
            [
                5297,
                5315
            ],
            [
                5315,
                5344
            ],
            [
                5344,
                5345
            ],
            [
                5346,
                5403
            ],
            [
                5404,
                5411
            ],
            [
                5412,
                5420
            ],
            [
                5420,
                5421
            ],
            [
                5422,
                5440
            ],
            [
                5440,
                5505
            ],
            [
                5505,
                5529
            ],
            [
                5529,
                5569
            ],
            [
                5570,
                5644
            ],
            [
                5645,
                5672
            ],
            [
                5672,
                5728
            ],
            [
                5728,
                5782
            ],
            [
                5783,
                5796
            ],
            [
                5797,
                5800
            ],
            [
                5801,
                5830
            ],
            [
                5830,
                5889
            ],
            [
                5890,
                5905
            ],
            [
                5906,
                5939
            ],
            [
                5939,
                6063
            ],
            [
                6064,
                6095
            ],
            [
                6095,
                6097
            ],
            [
                6098,
                6141
            ],
            [
                6141,
                6208
            ],
            [
                6214,
                6219
            ],
            [
                6220,
                6250
            ],
            [
                6250,
                6280
            ],
            [
                6283,
                6330
            ],
            [
                6331,
                6355
            ],
            [
                6355,
                6368
            ],
            [
                6374,
                6377
            ],
            [
                6377,
                6429
            ],
            [
                6429,
                6452
            ],
            [
                6460,
                6475
            ],
            [
                6475,
                6492
            ],
            [
                6492,
                6541
            ],
            [
                6541,
                6608
            ],
            [
                6611,
                6619
            ],
            [
                6631,
                6641
            ],
            [
                6644,
                6673
            ],
            [
                6673,
                6697
            ],
            [
                6705,
                6721
            ],
            [
                6730,
                6745
            ],
            [
                6746,
                6767
            ],
            [
                6768,
                6853
            ],
            [
                6854,
                6902
            ],
            [
                6902,
                6960
            ],
            [
                6960,
                6991
            ],
            [
                6991,
                6992
            ],
            [
                6993,
                7017
            ],
            [
                7017,
                7079
            ],
            [
                7079,
                7130
            ],
            [
                7132,
                7144
            ],
            [
                7144,
                7161
            ],
            [
                7161,
                7212
            ],
            [
                7212,
                7285
            ],
            [
                7285,
                7334
            ],
            [
                7334,
                7362
            ],
            [
                7365,
                7380
            ],
            [
                7380,
                7437
            ],
            [
                7437,
                7477
            ],
            [
                7477,
                7586
            ],
            [
                7586,
                7630
            ],
            [
                7630,
                7673
            ],
            [
                7673,
                7728
            ],
            [
                7728,
                7781
            ],
            [
                7781,
                7898
            ],
            [
                7898,
                7910
            ],
            [
                7911,
                7960
            ],
            [
                7961,
                7995
            ],
            [
                7995,
                8039
            ],
            [
                8040,
                8043
            ],
            [
                8044,
                8046
            ],
            [
                8050,
                8081
            ],
            [
                8081,
                8082
            ],
            [
                8083,
                8179
            ],
            [
                8179,
                8180
            ],
            [
                8181,
                8237
            ],
            [
                8238,
                8242
            ],
            [
                8243,
                8281
            ],
            [
                8281,
                8304
            ],
            [
                8314,
                8352
            ],
            [
                8352,
                8392
            ],
            [
                8402,
                8476
            ],
            [
                8476,
                8492
            ],
            [
                8493,
                8496
            ],
            [
                8497,
                8526
            ],
            [
                8526,
                8528
            ],
            [
                8528,
                8572
            ],
            [
                8572,
                8595
            ],
            [
                8595,
                8642
            ],
            [
                8642,
                8644
            ],
            [
                8644,
                8646
            ],
            [
                8647,
                8666
            ],
            [
                8667,
                8679
            ],
            [
                8682,
                8700
            ],
            [
                8701,
                8704
            ],
            [
                8705,
                8749
            ],
            [
                8752,
                8768
            ],
            [
                8770,
                8875
            ],
            [
                8875,
                8971
            ],
            [
                8972,
                9002
            ],
            [
                9002,
                9049
            ],
            [
                9050,
                9062
            ],
            [
                9071,
                9238
            ],
            [
                9243,
                9245
            ],
            [
                9245,
                9308
            ],
            [
                9309,
                9339
            ],
            [
                9341,
                9378
            ],
            [
                9379,
                9412
            ],
            [
                9412,
                9413
            ],
            [
                9414,
                9576
            ],
            [
                9576,
                9606
            ],
            [
                9607,
                9669
            ],
            [
                9669,
                9692
            ],
            [
                9693,
                9702
            ],
            [
                9715,
                9716
            ],
            [
                9722,
                9735
            ],
            [
                9736,
                9743
            ],
            [
                9743,
                9773
            ],
            [
                9773,
                9848
            ],
            [
                9848,
                9897
            ],
            [
                9897,
                9904
            ],
            [
                9905,
                9920
            ],
            [
                9921,
                9931
            ],
            [
                9932,
                10128
            ],
            [
                10128,
                10151
            ],
            [
                10151,
                10153
            ],
            [
                10153,
                10203
            ],
            [
                10204,
                10241
            ],
            [
                10244,
                10261
            ],
            [
                10261,
                10388
            ],
            [
                10388,
                10419
            ],
            [
                10419,
                10468
            ],
            [
                10469,
                10498
            ],
            [
                10498,
                10535
            ],
            [
                10535,
                10545
            ],
            [
                10545,
                10547
            ],
            [
                10547,
                10641
            ],
            [
                10641,
                10644
            ],
            [
                10644,
                10750
            ],
            [
                10751,
                10754
            ],
            [
                10760,
                10762
            ],
            [
                10767,
                10773
            ],
            [
                10774,
                10859
            ],
            [
                10860,
                10879
            ],
            [
                10880,
                11015
            ],
            [
                11016,
                11129
            ],
            [
                11137,
                11177
            ],
            [
                11177,
                11276
            ],
            [
                11276,
                11293
            ],
            [
                11294,
                11314
            ],
            [
                11323,
                11380
            ],
            [
                11381,
                11472
            ],
            [
                11472,
                11555
            ],
            [
                11555,
                11591
            ],
            [
                11591,
                11683
            ],
            [
                11685,
                11721
            ],
            [
                11721,
                11788
            ],
            [
                11788,
                11826
            ],
            [
                11826,
                11888
            ],
            [
                11888,
                11931
            ],
            [
                11931,
                11941
            ],
            [
                11942,
                11947
            ],
            [
                11948,
                11985
            ],
            [
                11986,
                12026
            ],
            [
                12026,
                12074
            ],
            [
                12075,
                12170
            ],
            [
                12170,
                12237
            ],
            [
                12238,
                12267
            ],
            [
                12267,
                12269
            ],
            [
                12269,
                12313
            ],
            [
                12313,
                12364
            ],
            [
                12364,
                12416
            ],
            [
                12416,
                12473
            ],
            [
                12473,
                12513
            ],
            [
                12513,
                12582
            ],
            [
                12582,
                12632
            ],
            [
                12632,
                12645
            ],
            [
                12645,
                12690
            ],
            [
                12690,
                12762
            ],
            [
                12764,
                12858
            ],
            [
                12858,
                12872
            ],
            [
                12872,
                12908
            ],
            [
                12909,
                12933
            ],
            [
                12943,
                12945
            ],
            [
                12945,
                12972
            ],
            [
                12973,
                13040
            ],
            [
                13044,
                13132
            ],
            [
                13132,
                13167
            ],
            [
                13167,
                13202
            ],
            [
                13202,
                13225
            ],
            [
                13228,
                13263
            ],
            [
                13267,
                13284
            ],
            [
                13284,
                13286
            ],
            [
                13289,
                13291
            ],
            [
                13291,
                13357
            ],
            [
                13359,
                13408
            ],
            [
                13411,
                13477
            ],
            [
                13478,
                13509
            ],
            [
                13509,
                13601
            ],
            [
                13601,
                13687
            ],
            [
                13687,
                13723
            ],
            [
                13726,
                13752
            ],
            [
                13753,
                13798
            ],
            [
                13800,
                13908
            ],
            [
                13908,
                13935
            ],
            [
                13935,
                13972
            ],
            [
                13973,
                14079
            ],
            [
                14079,
                14163
            ],
            [
                14163,
                14166
            ],
            [
                14166,
                14288
            ],
            [
                14289,
                14364
            ],
            [
                14365,
                14433
            ],
            [
                14434,
                14435
            ],
            [
                14435,
                14497
            ],
            [
                14497,
                14627
            ],
            [
                14627,
                14708
            ],
            [
                14708,
                14803
            ],
            [
                14803,
                14832
            ],
            [
                14832,
                15068
            ],
            [
                15069,
                15130
            ],
            [
                15130,
                15161
            ],
            [
                15162,
                15221
            ],
            [
                15221,
                15265
            ],
            [
                15265,
                15336
            ],
            [
                15336,
                15455
            ],
            [
                15456,
                15490
            ],
            [
                15491,
                15671
            ],
            [
                15672,
                15680
            ],
            [
                15681,
                15687
            ],
            [
                15702,
                15704
            ],
            [
                15704,
                15765
            ],
            [
                15768,
                15804
            ],
            [
                15804,
                15848
            ],
            [
                15848,
                15881
            ],
            [
                15881,
                15896
            ],
            [
                15899,
                15935
            ],
            [
                15935,
                15945
            ],
            [
                15946,
                15977
            ],
            [
                15977,
                16000
            ],
            [
                16000,
                16003
            ],
            [
                16003,
                16088
            ],
            [
                16089,
                16137
            ],
            [
                16137,
                16176
            ],
            [
                16176,
                16219
            ],
            [
                16219,
                16271
            ],
            [
                16271,
                16336
            ],
            [
                16337,
                16368
            ],
            [
                16368,
                16427
            ],
            [
                16432,
                16452
            ],
            [
                16454,
                16525
            ],
            [
                16525,
                16628
            ],
            [
                16629,
                16649
            ],
            [
                16649,
                16681
            ],
            [
                16681,
                16700
            ],
            [
                16700,
                16726
            ],
            [
                16726,
                16775
            ],
            [
                16775,
                16776
            ],
            [
                16777,
                16865
            ],
            [
                16866,
                16882
            ],
            [
                16882,
                16885
            ],
            [
                16886,
                16888
            ],
            [
                16889,
                16892
            ],
            [
                16898,
                16955
            ],
            [
                16956,
                16993
            ],
            [
                16993,
                16996
            ],
            [
                17002,
                17015
            ],
            [
                17016,
                17019
            ],
            [
                17020,
                17028
            ],
            [
                17029,
                17084
            ],
            [
                17095,
                17097
            ],
            [
                17103,
                17115
            ],
            [
                17116,
                17242
            ],
            [
                17243,
                17285
            ],
            [
                17285,
                17287
            ],
            [
                17287,
                17338
            ],
            [
                17339,
                17368
            ],
            [
                17369,
                17373
            ],
            [
                17374,
                17395
            ],
            [
                17396,
                17399
            ],
            [
                17400,
                17447
            ],
            [
                17448,
                17478
            ],
            [
                17478,
                17518
            ],
            [
                17518,
                17536
            ],
            [
                17537,
                17597
            ],
            [
                17598,
                17756
            ],
            [
                17756,
                17853
            ],
            [
                17854,
                17870
            ],
            [
                17879,
                17962
            ],
            [
                17963,
                18065
            ],
            [
                18065,
                18145
            ],
            [
                18145,
                18201
            ],
            [
                18202,
                18217
            ],
            [
                18217,
                18327
            ],
            [
                18327,
                18335
            ],
            [
                18340,
                18349
            ],
            [
                18350,
                18363
            ],
            [
                18364,
                18388
            ],
            [
                18389,
                18392
            ],
            [
                18393,
                18398
            ],
            [
                18398,
                18399
            ],
            [
                18400,
                18440
            ],
            [
                18440,
                18487
            ],
            [
                18487,
                18516
            ],
            [
                18517,
                18529
            ],
            [
                18530,
                18534
            ],
            [
                18535,
                18559
            ],
            [
                18559,
                18602
            ],
            [
                18602,
                18604
            ],
            [
                18604,
                18633
            ],
            [
                18637,
                18638
            ],
            [
                18647,
                18672
            ],
            [
                18673,
                18698
            ],
            [
                18701,
                18784
            ],
            [
                18787,
                18793
            ],
            [
                18801,
                18805
            ],
            [
                18809,
                18811
            ],
            [
                18811,
                18946
            ],
            [
                18951,
                18955
            ],
            [
                18955,
                18957
            ],
            [
                18957,
                18998
            ],
            [
                18998,
                19000
            ],
            [
                19000,
                19111
            ],
            [
                19111,
                19113
            ],
            [
                19113,
                19115
            ],
            [
                19131,
                19133
            ],
            [
                19133,
                19192
            ],
            [
                19195,
                19230
            ],
            [
                19235,
                19326
            ],
            [
                19327,
                19331
            ],
            [
                19343,
                19344
            ],
            [
                19345,
                19368
            ],
            [
                19369,
                19372
            ],
            [
                19373,
                19377
            ],
            [
                19378,
                19397
            ],
            [
                19397,
                19469
            ],
            [
                19469,
                19501
            ],
            [
                19502,
                19510
            ],
            [
                19511,
                19539
            ]
        ],
        "row_chars": [
            [
                0,
                128
            ],
            [
                128,
                564
            ],
            [
                564,
                656
            ],
            [
                656,
                872
            ],
            [
                872,
                982
            ],
            [
                982,
                1112
            ],
            [
                1112,
                1203
            ],
            [
                1203,
                1375
            ],
            [
                1375,
                1423
            ],
            [
                1423,
                1578
            ],
            [
                1578,
                1610
            ],
            [
                1610,
                1623
            ],
            [
                1623,
                1649
            ],
            [
                1649,
                1687
            ],
            [
                1687,
                1762
            ],
            [
                1762,
                1871
            ],
            [
                1871,
                1931
            ],
            [
                1931,
                1958
            ],
            [
                1958,
                2000
            ],
            [
                2000,
                2013
            ],
            [
                2013,
                2047
            ],
            [
                2047,
                2127
            ],
            [
                2127,
                2303
            ],
            [
                2303,
                2410
            ],
            [
                2410,
                2601
            ],
            [
                2601,
                2655
            ],
            [
                2655,
                2723
            ],
            [
                2723,
                2769
            ],
            [
                2769,
                2846
            ],
            [
                2846,
                2846
            ],
            [
                2846,
                2846
            ],
            [
                2846,
                2959
            ],
            [
                2959,
                2959
            ],
            [
                2959,
                2959
            ],
            [
                2959,
                2959
            ],
            [
                2959,
                2959
            ],
            [
                2959,
                2959
            ],
            [
                2959,
                3059
            ],
            [
                3059,
                3059
            ],
            [
                3059,
                3126
            ],
            [
                3126,
                3242
            ],
            [
                3242,
                3270
            ],
            [
                3270,
                3307
            ],
            [
                3307,
                3307
            ],
            [
                3307,
                3364
            ],
            [
                3364,
                3412
            ],
            [
                3412,
                3488
            ],
            [
                3488,
                3488
            ],
            [
                3488,
                3488
            ],
            [
                3488,
                3488
            ],
            [
                3488,
                3546
            ],
            [
                3546,
                3626
            ],
            [
                3626,
                3669
            ],
            [
                3669,
                3669
            ],
            [
                3669,
                3788
            ],
            [
                3788,
                3860
            ],
            [
                3860,
                3877
            ],
            [
                3877,
                3877
            ],
            [
                3877,
                3959
            ],
            [
                3959,
                4007
            ],
            [
                4007,
                4042
            ],
            [
                4042,
                4063
            ],
            [
                4063,
                4063
            ],
            [
                4063,
                4063
            ],
            [
                4063,
                4151
            ],
            [
                4151,
                4201
            ],
            [
                4201,
                4237
            ],
            [
                4237,
                4271
            ],
            [
                4271,
                4271
            ],
            [
                4271,
                4306
            ],
            [
                4306,
                4306
            ],
            [
                4306,
                4539
            ],
            [
                4539,
                4653
            ],
            [
                4653,
                4761
            ],
            [
                4761,
                4913
            ],
            [
                4913,
                5066
            ],
            [
                5066,
                5235
            ],
            [
                5235,
                5315
            ],
            [
                5315,
                5346
            ],
            [
                5346,
                5440
            ],
            [
                5440,
                5505
            ],
            [
                5505,
                5529
            ],
            [
                5529,
                5529
            ],
            [
                5529,
                5570
            ],
            [
                5570,
                5672
            ],
            [
                5672,
                5728
            ],
            [
                5728,
                5830
            ],
            [
                5830,
                5939
            ],
            [
                5939,
                6095
            ],
            [
                6095,
                6141
            ],
            [
                6141,
                6250
            ],
            [
                6250,
                6355
            ],
            [
                6355,
                6377
            ],
            [
                6377,
                6429
            ],
            [
                6429,
                6475
            ],
            [
                6475,
                6492
            ],
            [
                6492,
                6541
            ],
            [
                6541,
                6673
            ],
            [
                6673,
                6673
            ],
            [
                6673,
                6697
            ],
            [
                6697,
                6768
            ],
            [
                6768,
                6768
            ],
            [
                6768,
                6853
            ],
            [
                6853,
                6853
            ],
            [
                6853,
                6853
            ],
            [
                6853,
                6853
            ],
            [
                6853,
                6902
            ],
            [
                6902,
                6960
            ],
            [
                6960,
                7017
            ],
            [
                7017,
                7079
            ],
            [
                7079,
                7144
            ],
            [
                7144,
                7161
            ],
            [
                7161,
                7212
            ],
            [
                7212,
                7285
            ],
            [
                7285,
                7334
            ],
            [
                7334,
                7380
            ],
            [
                7380,
                7477
            ],
            [
                7477,
                7586
            ],
            [
                7586,
                7630
            ],
            [
                7630,
                7673
            ],
            [
                7673,
                7728
            ],
            [
                7728,
                7728
            ],
            [
                7728,
                7728
            ],
            [
                7728,
                7728
            ],
            [
                7728,
                7728
            ],
            [
                7728,
                7781
            ],
            [
                7781,
                7898
            ],
            [
                7898,
                7995
            ],
            [
                7995,
                7995
            ],
            [
                7995,
                8083
            ],
            [
                8083,
                8181
            ],
            [
                8181,
                8238
            ],
            [
                8238,
                8281
            ],
            [
                8281,
                8352
            ],
            [
                8352,
                8476
            ],
            [
                8476,
                8528
            ],
            [
                8528,
                8572
            ],
            [
                8572,
                8644
            ],
            [
                8644,
                8749
            ],
            [
                8749,
                8875
            ],
            [
                8875,
                8972
            ],
            [
                8972,
                9071
            ],
            [
                9071,
                9071
            ],
            [
                9071,
                9245
            ],
            [
                9245,
                9309
            ],
            [
                9309,
                9379
            ],
            [
                9379,
                9414
            ],
            [
                9414,
                9576
            ],
            [
                9576,
                9669
            ],
            [
                9669,
                9743
            ],
            [
                9743,
                9743
            ],
            [
                9743,
                9848
            ],
            [
                9848,
                9897
            ],
            [
                9897,
                10128
            ],
            [
                10128,
                10153
            ],
            [
                10153,
                10204
            ],
            [
                10204,
                10261
            ],
            [
                10261,
                10388
            ],
            [
                10388,
                10419
            ],
            [
                10419,
                10498
            ],
            [
                10498,
                10535
            ],
            [
                10535,
                10547
            ],
            [
                10547,
                10644
            ],
            [
                10644,
                10762
            ],
            [
                10762,
                10762
            ],
            [
                10762,
                10762
            ],
            [
                10762,
                10762
            ],
            [
                10762,
                10762
            ],
            [
                10762,
                10880
            ],
            [
                10880,
                11016
            ],
            [
                11016,
                11016
            ],
            [
                11016,
                11129
            ],
            [
                11129,
                11177
            ],
            [
                11177,
                11276
            ],
            [
                11276,
                11276
            ],
            [
                11276,
                11381
            ],
            [
                11381,
                11472
            ],
            [
                11472,
                11555
            ],
            [
                11555,
                11591
            ],
            [
                11591,
                11684
            ],
            [
                11684,
                11684
            ],
            [
                11684,
                11684
            ],
            [
                11684,
                11788
            ],
            [
                11788,
                11826
            ],
            [
                11826,
                11888
            ],
            [
                11888,
                12026
            ],
            [
                12026,
                12074
            ],
            [
                12074,
                12074
            ],
            [
                12074,
                12170
            ],
            [
                12170,
                12269
            ],
            [
                12269,
                12313
            ],
            [
                12313,
                12313
            ],
            [
                12313,
                12364
            ],
            [
                12364,
                12416
            ],
            [
                12416,
                12473
            ],
            [
                12473,
                12513
            ],
            [
                12513,
                12582
            ],
            [
                12582,
                12632
            ],
            [
                12632,
                12645
            ],
            [
                12645,
                12645
            ],
            [
                12645,
                12690
            ],
            [
                12690,
                12764
            ],
            [
                12764,
                12764
            ],
            [
                12764,
                12858
            ],
            [
                12858,
                12872
            ],
            [
                12872,
                12945
            ],
            [
                12945,
                13040
            ],
            [
                13040,
                13132
            ],
            [
                13132,
                13167
            ],
            [
                13167,
                13202
            ],
            [
                13202,
                13202
            ],
            [
                13202,
                13228
            ],
            [
                13228,
                13284
            ],
            [
                13284,
                13291
            ],
            [
                13291,
                13359
            ],
            [
                13359,
                13359
            ],
            [
                13359,
                13359
            ],
            [
                13359,
                13411
            ],
            [
                13411,
                13477
            ],
            [
                13477,
                13477
            ],
            [
                13477,
                13509
            ],
            [
                13509,
                13601
            ],
            [
                13601,
                13687
            ],
            [
                13687,
                13726
            ],
            [
                13726,
                13726
            ],
            [
                13726,
                13752
            ],
            [
                13752,
                13752
            ],
            [
                13752,
                13800
            ],
            [
                13800,
                13800
            ],
            [
                13800,
                13908
            ],
            [
                13908,
                13935
            ],
            [
                13935,
                13972
            ],
            [
                13972,
                13972
            ],
            [
                13972,
                14079
            ],
            [
                14079,
                14166
            ],
            [
                14166,
                14289
            ],
            [
                14289,
                14289
            ],
            [
                14289,
                14289
            ],
            [
                14289,
                14289
            ],
            [
                14289,
                14365
            ],
            [
                14365,
                14434
            ],
            [
                14434,
                14497
            ],
            [
                14497,
                14627
            ],
            [
                14627,
                14708
            ],
            [
                14708,
                14803
            ],
            [
                14803,
                14832
            ],
            [
                14832,
                15069
            ],
            [
                15069,
                15130
            ],
            [
                15130,
                15221
            ],
            [
                15221,
                15265
            ],
            [
                15265,
                15336
            ],
            [
                15336,
                15456
            ],
            [
                15456,
                15491
            ],
            [
                15491,
                15704
            ],
            [
                15704,
                15804
            ],
            [
                15804,
                15848
            ],
            [
                15848,
                15881
            ],
            [
                15881,
                15935
            ],
            [
                15935,
                15977
            ],
            [
                15977,
                16003
            ],
            [
                16003,
                16089
            ],
            [
                16089,
                16137
            ],
            [
                16137,
                16176
            ],
            [
                16176,
                16219
            ],
            [
                16219,
                16271
            ],
            [
                16271,
                16271
            ],
            [
                16271,
                16337
            ],
            [
                16337,
                16368
            ],
            [
                16368,
                16525
            ],
            [
                16525,
                16629
            ],
            [
                16629,
                16649
            ],
            [
                16649,
                16681
            ],
            [
                16681,
                16700
            ],
            [
                16700,
                16726
            ],
            [
                16726,
                16882
            ],
            [
                16882,
                16993
            ],
            [
                16993,
                17116
            ],
            [
                17116,
                17243
            ],
            [
                17243,
                17287
            ],
            [
                17287,
                17448
            ],
            [
                17448,
                17478
            ],
            [
                17478,
                17518
            ],
            [
                17518,
                17537
            ],
            [
                17537,
                17598
            ],
            [
                17598,
                17598
            ],
            [
                17598,
                17756
            ],
            [
                17756,
                17756
            ],
            [
                17756,
                17963
            ],
            [
                17963,
                18065
            ],
            [
                18065,
                18145
            ],
            [
                18145,
                18217
            ],
            [
                18217,
                18217
            ],
            [
                18217,
                18217
            ],
            [
                18217,
                18217
            ],
            [
                18217,
                18327
            ],
            [
                18327,
                18400
            ],
            [
                18400,
                18440
            ],
            [
                18440,
                18487
            ],
            [
                18487,
                18517
            ],
            [
                18517,
                18604
            ],
            [
                18604,
                18701
            ],
            [
                18701,
                18701
            ],
            [
                18701,
                18785
            ],
            [
                18785,
                18811
            ],
            [
                18811,
                18957
            ],
            [
                18957,
                19000
            ],
            [
                19000,
                19113
            ],
            [
                19113,
                19133
            ],
            [
                19133,
                19133
            ],
            [
                19133,
                19397
            ],
            [
                19397,
                19469
            ],
            [
                19469,
                19539
            ]
        ]
    }
}