{
    "original": {
        "text": "Mr. Grey and wife were duly carried away from Matching Priory by post horses, and did their honeymoon, we may be quite sure, with much satisfaction. When Alice was first asked where she would go, she simply suggested that it should not be to Switzerland. They did, in truth, go by slow stages to Italy, to Venice, Florence, and on to Rome; but such had not been their intention when they first started on their journey. At that time Mr. Grey believed that he would be wanted again in England, down at Silverbridge in Barsetshire, very shortly. But before he had married a week he learned that all that was to be postponed. The cup of fruition had not yet reached Mr. Palliser's lips. \"There will be no vacancy either in the county or in the borough till Parliament meets.\" That had been the message sent by Mr. Palliser to Mr. Grey. Lady Glencora's message to Alice had been rather more full, having occupied three pages of note paper, the last of which had been crossed, but I do not know that it was more explicit. She had abused Lord Brock, had abused Mr. Finespun, and had abused all public things and institutions, because the arrangements as now proposed would be very comfortable to Alice, but would not, as she was pleased to think, be very comfortable to herself. \"You can go to Rome and see everything and enjoy yourself, which I was not allowed to do; and all this noise and bother, and crowd of electioneering, will take place down in Barsetshire just when I am in the middle of all my trouble.\" There were many very long letters came from Lady Glencora to Rome during the winter,--letters which Alice enjoyed thoroughly, but which she could not but regard as being very indiscreet. The Duke was at the Castle during the Christmas week, and the descriptions of the Duke and of his solicitude as to his heir were very comic. \"He comes and bends over me on the sofa in the most stupendous way, as though a woman to be the mother of his heir must be a miracle in nature. He is quite awful when he says a word or two, and more awful in his silence. The devil prompted me the other day, and I said I hoped it would be a girl. There was a look came over his face which nearly frightened me. If it should be, I believe he will turn me out of the house; but how can I help it? I wish you were going to have a baby at the same time. Then, if yours was a boy and mine a girl, we'd make a change.\" This was very indiscreet. Lady Glencora would write indiscreet letters like this, which Alice could not show to her husband. It was a thousand pities.\nBut December and January wore themselves away, and the time came in which the Greys were bound to return to England. The husband had very fully discussed with his wife that matter of his parliamentary ambition, and found in her a very ready listener. Having made up his mind to do this thing, he was resolved to do it thoroughly, and was becoming almost as full of politics, almost as much devoted to sugar, as Mr. Palliser himself. He at any rate could not complain that his wife would not interest herself in his pursuits. Then, as they returned, came letters from Lady Glencora, written as her troubles grew nigh. The Duke had gone, of course; but he was to be there at the appointed time. \"Oh, I do so wish he would have a fit of the gout in London,--or at Timbuctoo,\" said Lady Glencora. When they reached London they first heard the news from Mr. Vavasor, who on this occasion condescended to meet them at the railway. \"The Duke has got an heir,\" he said, before the carriage-door was open;--\"born this morning!\" One might have supposed that it was the Duke's baby, and not the baby of Lady Glencora and Mr. Palliser. There was a note from Mr. Palliser to Mr. Grey. \"Thank God!\" said the note, \"Lady Glencora and the boy\"--Mr. Palliser had scorned to use the word child--\"Lady Glencora and the boy are quite as well as can be expected. Both the new writs were moved for last night.\" Mr. Palliser's honours, as will be seen, came rushing upon him all at once.\nWondrous little baby,--_purpureo genitus!_ What have the gods not done for thee, if thou canst only manage to live till thy good things are all thine own,--to live through all the terrible solicitude with which they will envelope thee! Better than royal rank will be thine, with influence more than royal, and power of action fettered by no royalty. Royal wealth which will be really thine own, to do with it as it beseemeth thee. Thou wilt be at the top of an aristocracy in a country where aristocrats need gird themselves with no buckram. All that the world can give will be thine; and yet when we talk of thee religiously, philosophically, or politico-economically, we are wont to declare that thy chances of happiness are no better,--no better, if they be no worse,--than are those of thine infant neighbour just born, in that farmyard cradle. Who shall say that they are better or that they are worse? Or if they be better, or if they be worse, how shall we reconcile to ourselves that seeming injustice?\nAnd now we will pay a little visit to the small one born in the purple, and the story of that visit shall be the end of our history. It was early in April, quite early in April, and Mr. and Mrs. Grey were both at Gatherum Castle. Mrs. Grey was there at the moment of which we write, but Mr. Grey was absent at Silverbridge with Mr. Palliser. This was the day of the Silverbridge election, and Mr. Grey had gone to that ancient borough, to offer himself as a candidate to the electors, backed by the presence and aid of a very powerful member of the Cabinet. Lady Glencora and Alice were sitting up-stairs with the small, purple-born one in their presence, and the small, purple-born one was lying in Alice's lap.\n\"It is such a comfort that it is over,\" said the mother.\n\"You are the most ungrateful of women.\"\n\"Oh, Alice,--if you could have known! Your baby may come just as it pleases. You won't lie awake trembling how on earth you will bear your disgrace if one of the vile weaker sex should come to disturb the hopes of your lords and masters;--for I had two, which made it so much more terrible.\"\n\"I'm sure Mr. Palliser would not have said a word.\"\n\"No, he would have said nothing,--nor would the Duke. The Duke would simply have gone away instantly, and never have seen me again till the next chance comes,--if it ever does come. And Mr. Palliser would have been as gentle as a dove;--much more gentle than he is now, for men are rarely gentle in their triumph. But I should have known what they both thought and felt.\"\n\"It's all right now, dear.\"\n\"Yes, my bonny boy,--you have made it all right for me;--have you not?\" And Lady Glencora took her baby into her own arms. \"You have made everything right, my little man. But oh, Alice, if you had seen the Duke's long face through those three days; if you had heard the tones of the people's voices as they whispered about me; if you had encountered the oppressive cheerfulness of those two London doctors,--doctors are such bad actors,--you would have thought it impossible for any woman to live throughout. There's one comfort;--if my mannikin lives, I can't have another eldest. He looks like living;--don't he, Alice?\" Then were perpetrated various mysterious ceremonies of feminine idolatry which were continued till there came a grandly dressed old lady, who called herself the nurse, and who took the idol away.\n[Illustration: \"Yes, my bonny boy,--you have made it all right for me.\"]\nIn the course of that afternoon Lady Glencora took Alice all over the house. It was a castle of enormous size, quite new,--having been built by the present proprietor,--very cold, very handsome, and very dull. \"What an immense place!\" said Alice, as she stood looking round her in the grand hall, which was never used as an entrance except on very grand occasions. \"Is it not? And it cost--oh, I can't tell you how much it cost. A hundred thousand pounds or more. Well;--that would be nothing, as the Duke no doubt had the money in his pocket to do what he liked with at the time. But the joke is, nobody ever thinks of living here. Who'd live in such a great, overgrown place such as this, if they could get a comfortable house like Matching? Do you remember Longroyston and the hot-water pipes? I always think of the poor Duchess when I come through here. Nobody ever lives here, or ever will. The Duke comes for one week in the year, and Plantagenet says he hates to do that. As for me, nothing on earth shall ever make me live here. I was completely in their power and couldn't help their bringing me here the other day;--because I had, as it were, disgraced myself.\"\n\"How disgraced yourself?\"\n\"In being so long, you know, before that gentleman was born. But they shan't play me the same trick again. I shall dare to assert myself, now. Come,--we must go away. There are some of the British public come to see one of the British sights. That's another pleasure here. One has to run about to avoid being caught by the visitors. The housekeeper tells me they always grumble because they are not allowed to go into my little room up-stairs.\"\nOn the evening of that day Mr. Palliser and Mr. Grey returned home from Silverbridge together. The latter was then a Member of Parliament, but the former at that moment was the possessor of no such dignity. The election for the borough was now over, whereas that for the county had not yet taken place. But there was no rival candidate for the position, and Mr. Palliser was thoroughly contented with his fate. He was at this moment actually Chancellor of the Exchequer, and in about ten days' time would be on his legs in the House proposing for his country's use his scheme of finance. The two men were seated together in an open carriage, and were being whirled along by four horses. They were both no doubt happy in their ambition, but I think that of the two, Mr. Palliser showed his triumph the most. Not that he spoke even to his friend a word that was triumphant in its tone. It was not thus that he rejoiced. He was by nature too placid for that. But there was a nervousness in his contentment which told the tale to any observer who might know how to read it.\n\"I hope you'll like it,\" he said to Grey.\n\"I shall never like it as you do,\" Grey answered.\n\"And why not;--why not?\"\n\"In the first place, I have not begun it so young.\"\n\"Any time before thirty-five is young enough.\"\n\"For useful work, yes,--but hardly for enjoyment in the thing. And then I don't believe it all as you do. To you the British House of Commons is everything.\"\n\"Yes;--everything,\" said Mr. Palliser with unwonted enthusiasm;--\"everything, everything. That and the Constitution are everything.\"\n\"It is not so to me.\"\n\"Ah, but it will be. If you really take to the work, and put yourself into harness, it will be so. You'll get to feel it as I do. The man who is counted by his colleagues as number one on the Treasury Bench in the English House of Commons, is the first of living men. That's my opinion. I don't know that I ever said it before; but that's my opinion.\"\n\"And who is the second;--the purse-bearer to this great man?\"\n\"I say nothing about the second. I don't know that there is any second. I wonder how we shall find Lady Glencora and the boy.\" They had then arrived at the side entrance to the Castle, and Mr. Grey ran up-stairs to his wife's room to receive her congratulations.\n\"And you are a Member of Parliament?\" she asked.\n\"They tell me so, but I don't know whether I actually am one till I've taken the oaths.\"\n\"I am so happy. There's no position in the world so glorious!\"\n\"It's a pity you are not Mr. Palliser's wife. That's just what he has been saying.\"\n\"Oh, John, I am so happy. It is so much more than I have deserved. I hope,--that is, I sometimes think--\"\n\"Think what, dearest?\"\n\"I hope nothing that I have ever said has driven you to it.\"\n\"I'd do more than that, dear, to make you happy,\" he said, as he put his arm round her and kissed her; \"more than that, at least if it were in my power.\"\nProbably my readers may agree with Alice, that in the final adjustment of her affairs she had received more than she had deserved. All her friends, except her husband, thought so. But as they have all forgiven her, including even Lady Midlothian herself, I hope that they who have followed her story to its close will not be less generous.",
        "paragraph_chars": [
            [
                0,
                2550
            ],
            [
                2550,
                4015
            ],
            [
                4015,
                5026
            ],
            [
                5026,
                5739
            ],
            [
                5739,
                5796
            ],
            [
                5796,
                5836
            ],
            [
                5836,
                6128
            ],
            [
                6128,
                6180
            ],
            [
                6180,
                6552
            ],
            [
                6552,
                6580
            ],
            [
                6580,
                7399
            ],
            [
                7399,
                7472
            ],
            [
                7472,
                8644
            ],
            [
                8644,
                8670
            ],
            [
                8670,
                9115
            ],
            [
                9115,
                10185
            ],
            [
                10185,
                10227
            ],
            [
                10227,
                10277
            ],
            [
                10277,
                10302
            ],
            [
                10302,
                10354
            ],
            [
                10354,
                10401
            ],
            [
                10401,
                10559
            ],
            [
                10559,
                10692
            ],
            [
                10692,
                10714
            ],
            [
                10714,
                11066
            ],
            [
                11066,
                11128
            ],
            [
                11128,
                11391
            ],
            [
                11391,
                11440
            ],
            [
                11440,
                11529
            ],
            [
                11529,
                11592
            ],
            [
                11592,
                11676
            ],
            [
                11676,
                11782
            ],
            [
                11782,
                11805
            ],
            [
                11805,
                11866
            ],
            [
                11866,
                12020
            ],
            [
                12020,
                12359
            ]
        ],
        "segment_chars": [
            [
                0,
                149
            ],
            [
                149,
                255
            ],
            [
                255,
                420
            ],
            [
                420,
                544
            ],
            [
                544,
                623
            ],
            [
                623,
                684
            ],
            [
                684,
                773
            ],
            [
                773,
                833
            ],
            [
                833,
                1017
            ],
            [
                1017,
                1273
            ],
            [
                1273,
                1508
            ],
            [
                1508,
                1695
            ],
            [
                1695,
                1836
            ],
            [
                1836,
                1980
            ],
            [
                1980,
                2057
            ],
            [
                2057,
                2133
            ],
            [
                2133,
                2197
            ],
            [
                2197,
                2281
            ],
            [
                2281,
                2336
            ],
            [
                2336,
                2399
            ],
            [
                2399,
                2425
            ],
            [
                2425,
                2524
            ],
            [
                2524,
                2550
            ],
            [
                2550,
                2667
            ],
            [
                2667,
                2801
            ],
            [
                2801,
                2983
            ],
            [
                2983,
                3075
            ],
            [
                3075,
                3167
            ],
            [
                3167,
                3243
            ],
            [
                3243,
                3343
            ],
            [
                3343,
                3475
            ],
            [
                3475,
                3569
            ],
            [
                3569,
                3674
            ],
            [
                3674,
                3722
            ],
            [
                3722,
                3735
            ],
            [
                3735,
                3892
            ],
            [
                3892,
                3939
            ],
            [
                3939,
                4015
            ],
            [
                4015,
                4251
            ],
            [
                4251,
                4365
            ],
            [
                4365,
                4446
            ],
            [
                4446,
                4557
            ],
            [
                4557,
                4864
            ],
            [
                4864,
                4923
            ],
            [
                4923,
                5026
            ],
            [
                5026,
                5159
            ],
            [
                5159,
                5256
            ],
            [
                5256,
                5368
            ],
            [
                5368,
                5584
            ],
            [
                5584,
                5739
            ],
            [
                5739,
                5796
            ],
            [
                5796,
                5836
            ],
            [
                5836,
                5874
            ],
            [
                5874,
                5913
            ],
            [
                5913,
                6128
            ],
            [
                6128,
                6180
            ],
            [
                6180,
                6234
            ],
            [
                6234,
                6362
            ],
            [
                6362,
                6494
            ],
            [
                6494,
                6552
            ],
            [
                6552,
                6580
            ],
            [
                6580,
                6652
            ],
            [
                6652,
                6703
            ],
            [
                6703,
                6751
            ],
            [
                6751,
                7089
            ],
            [
                7089,
                7162
            ],
            [
                7162,
                7203
            ],
            [
                7203,
                7399
            ],
            [
                7399,
                7472
            ],
            [
                7472,
                7549
            ],
            [
                7549,
                7682
            ],
            [
                7682,
                7707
            ],
            [
                7707,
                7837
            ],
            [
                7837,
                7849
            ],
            [
                7849,
                7901
            ],
            [
                7901,
                7936
            ],
            [
                7936,
                8053
            ],
            [
                8053,
                8105
            ],
            [
                8105,
                8216
            ],
            [
                8216,
                8269
            ],
            [
                8269,
                8330
            ],
            [
                8330,
                8368
            ],
            [
                8368,
                8451
            ],
            [
                8451,
                8509
            ],
            [
                8509,
                8644
            ],
            [
                8644,
                8670
            ],
            [
                8670,
                8731
            ],
            [
                8731,
                8777
            ],
            [
                8777,
                8813
            ],
            [
                8813,
                8837
            ],
            [
                8837,
                8913
            ],
            [
                8913,
                8943
            ],
            [
                8943,
                9003
            ],
            [
                9003,
                9115
            ],
            [
                9115,
                9210
            ],
            [
                9210,
                9322
            ],
            [
                9322,
                9418
            ],
            [
                9418,
                9526
            ],
            [
                9526,
                9703
            ],
            [
                9703,
                9802
            ],
            [
                9802,
                9922
            ],
            [
                9922,
                9999
            ],
            [
                9999,
                10033
            ],
            [
                10033,
                10071
            ],
            [
                10071,
                10185
            ],
            [
                10185,
                10227
            ],
            [
                10227,
                10277
            ],
            [
                10277,
                10302
            ],
            [
                10302,
                10354
            ],
            [
                10354,
                10401
            ],
            [
                10401,
                10464
            ],
            [
                10464,
                10507
            ],
            [
                10507,
                10559
            ],
            [
                10559,
                10649
            ],
            [
                10649,
                10692
            ],
            [
                10692,
                10714
            ],
            [
                10714,
                10735
            ],
            [
                10735,
                10813
            ],
            [
                10813,
                10844
            ],
            [
                10844,
                10982
            ],
            [
                10982,
                11001
            ],
            [
                11001,
                11066
            ],
            [
                11066,
                11128
            ],
            [
                11128,
                11161
            ],
            [
                11161,
                11200
            ],
            [
                11200,
                11255
            ],
            [
                11255,
                11391
            ],
            [
                11391,
                11429
            ],
            [
                11429,
                11440
            ],
            [
                11440,
                11529
            ],
            [
                11529,
                11545
            ],
            [
                11545,
                11592
            ],
            [
                11592,
                11638
            ],
            [
                11638,
                11676
            ],
            [
                11676,
                11702
            ],
            [
                11702,
                11743
            ],
            [
                11743,
                11782
            ],
            [
                11782,
                11805
            ],
            [
                11805,
                11866
            ],
            [
                11866,
                12020
            ],
            [
                12020,
                12151
            ],
            [
                12151,
                12200
            ],
            [
                12200,
                12359
            ]
        ],
        "overlap_chars": [
            [
                0,
                61
            ],
            [
                86,
                101
            ],
            [
                147,
                149
            ],
            [
                149,
                185
            ],
            [
                192,
                255
            ],
            [
                255,
                259
            ],
            [
                296,
                301
            ],
            [
                331,
                338
            ],
            [
                263,
                264
            ],
            [
                423,
                427
            ],
            [
                349,
                367
            ],
            [
                368,
                377
            ],
            [
                273,
                274
            ],
            [
                433,
                474
            ],
            [
                481,
                513
            ],
            [
                528,
                544
            ],
            [
                544,
                547
            ],
            [
                555,
                557
            ],
            [
                580,
                592
            ],
            [
                606,
                622
            ],
            [
                684,
                709
            ],
            [
                749,
                773
            ],
            [
                773,
                803
            ],
            [
                820,
                822
            ],
            [
                804,
                819
            ],
            [
                831,
                833
            ],
            [
                833,
                881
            ],
            [
                891,
                892
            ],
            [
                909,
                920
            ],
            [
                1017,
                1101
            ],
            [
                1118,
                1144
            ],
            [
                1148,
                1166
            ],
            [
                981,
                984
            ],
            [
                1241,
                1272
            ],
            [
                1273,
                1375
            ],
            [
                1386,
                1392
            ],
            [
                1404,
                1421
            ],
            [
                1423,
                1438
            ],
            [
                1459,
                1507
            ],
            [
                1519,
                1591
            ],
            [
                1594,
                1643
            ],
            [
                1514,
                1518
            ],
            [
                1678,
                1695
            ],
            [
                1695,
                1721
            ],
            [
                1733,
                1742
            ],
            [
                1747,
                1752
            ],
            [
                1757,
                1772
            ],
            [
                1819,
                1835
            ],
            [
                1836,
                1921
            ],
            [
                1928,
                1968
            ],
            [
                1978,
                1980
            ],
            [
                2079,
                2092
            ],
            [
                2057,
                2075
            ],
            [
                2105,
                2133
            ],
            [
                2145,
                2149
            ],
            [
                2160,
                2168
            ],
            [
                2175,
                2197
            ],
            [
                2197,
                2202
            ],
            [
                2212,
                2281
            ],
            [
                2281,
                2336
            ],
            [
                2336,
                2382
            ],
            [
                2396,
                2399
            ],
            [
                2399,
                2423
            ],
            [
                2479,
                2480
            ],
            [
                2487,
                2507
            ],
            [
                2508,
                2523
            ],
            [
                2550,
                2614
            ],
            [
                2624,
                2633
            ],
            [
                2645,
                2667
            ],
            [
                2667,
                2682
            ],
            [
                2694,
                2703
            ],
            [
                2733,
                2759
            ],
            [
                2704,
                2717
            ],
            [
                2759,
                2770
            ],
            [
                2774,
                2801
            ],
            [
                2801,
                2835
            ],
            [
                2841,
                2923
            ],
            [
                2958,
                2982
            ],
            [
                3343,
                3367
            ],
            [
                3368,
                3372
            ],
            [
                3379,
                3415
            ],
            [
                3454,
                3474
            ],
            [
                3475,
                3546
            ],
            [
                3548,
                3569
            ],
            [
                3569,
                3629
            ],
            [
                3642,
                3655
            ],
            [
                3656,
                3672
            ],
            [
                3672,
                3673
            ],
            [
                3674,
                3722
            ],
            [
                3722,
                3735
            ],
            [
                3735,
                3739
            ],
            [
                3748,
                3749
            ],
            [
                3827,
                3892
            ],
            [
                3892,
                3939
            ],
            [
                3939,
                3961
            ],
            [
                3980,
                4015
            ],
            [
                4015,
                4035
            ],
            [
                4249,
                4251
            ],
            [
                4251,
                4319
            ],
            [
                4363,
                4365
            ],
            [
                4557,
                4628
            ],
            [
                4683,
                4751
            ],
            [
                4787,
                4791
            ],
            [
                4796,
                4827
            ],
            [
                4837,
                4841
            ],
            [
                4847,
                4864
            ],
            [
                4864,
                4901
            ],
            [
                4916,
                4923
            ],
            [
                4966,
                5026
            ],
            [
                5026,
                5077
            ],
            [
                5096,
                5097
            ],
            [
                5139,
                5142
            ],
            [
                5146,
                5159
            ],
            [
                5159,
                5181
            ],
            [
                5256,
                5269
            ],
            [
                5236,
                5254
            ],
            [
                5307,
                5368
            ],
            [
                5368,
                5413
            ],
            [
                5582,
                5584
            ],
            [
                5584,
                5620
            ],
            [
                5631,
                5646
            ],
            [
                5653,
                5662
            ],
            [
                5717,
                5739
            ],
            [
                5739,
                5796
            ],
            [
                5796,
                5836
            ],
            [
                5836,
                5846
            ],
            [
                5872,
                5874
            ],
            [
                5874,
                5913
            ],
            [
                5913,
                5986
            ],
            [
                6101,
                6103
            ],
            [
                6014,
                6020
            ],
            [
                6125,
                6128
            ],
            [
                6128,
                6180
            ],
            [
                6180,
                6212
            ],
            [
                6214,
                6234
            ],
            [
                6234,
                6337
            ],
            [
                6340,
                6362
            ],
            [
                6362,
                6414
            ],
            [
                6492,
                6494
            ],
            [
                6494,
                6552
            ],
            [
                6552,
                6580
            ],
            [
                6580,
                6599
            ],
            [
                6601,
                6635
            ],
            [
                6637,
                6652
            ],
            [
                6652,
                6703
            ],
            [
                6703,
                6704
            ],
            [
                6751,
                6754
            ],
            [
                6985,
                6986
            ],
            [
                6755,
                6849
            ],
            [
                6934,
                6985
            ],
            [
                6996,
                7015
            ],
            [
                7018,
                7076
            ],
            [
                6749,
                6750
            ],
            [
                6704,
                6749
            ],
            [
                7203,
                7207
            ],
            [
                7302,
                7307
            ],
            [
                7208,
                7212
            ],
            [
                7225,
                7232
            ],
            [
                7244,
                7275
            ],
            [
                7297,
                7301
            ],
            [
                7331,
                7334
            ],
            [
                7364,
                7369
            ],
            [
                7384,
                7399
            ],
            [
                7489,
                7549
            ],
            [
                7549,
                7593
            ],
            [
                7641,
                7681
            ],
            [
                7682,
                7707
            ],
            [
                7707,
                7767
            ],
            [
                7835,
                7836
            ],
            [
                7837,
                7849
            ],
            [
                7849,
                7860
            ],
            [
                7901,
                7936
            ],
            [
                7936,
                7940
            ],
            [
                7964,
                7965
            ],
            [
                7943,
                7964
            ],
            [
                8015,
                8017
            ],
            [
                7969,
                7977
            ],
            [
                8051,
                8053
            ],
            [
                8053,
                8105
            ],
            [
                8105,
                8216
            ],
            [
                8368,
                8451
            ],
            [
                8451,
                8509
            ],
            [
                8509,
                8510
            ],
            [
                8545,
                8581
            ],
            [
                8595,
                8596
            ],
            [
                8731,
                8734
            ],
            [
                8777,
                8784
            ],
            [
                8793,
                8806
            ],
            [
                8808,
                8813
            ],
            [
                8813,
                8818
            ],
            [
                8820,
                8835
            ],
            [
                8964,
                8992
            ],
            [
                8867,
                8873
            ],
            [
                9133,
                9137
            ],
            [
                9122,
                9129
            ],
            [
                9142,
                9210
            ],
            [
                9320,
                9321
            ],
            [
                9221,
                9224
            ],
            [
                9225,
                9257
            ],
            [
                9393,
                9396
            ],
            [
                9378,
                9392
            ],
            [
                9326,
                9334
            ],
            [
                9416,
                9418
            ],
            [
                9418,
                9510
            ],
            [
                9524,
                9526
            ],
            [
                9526,
                9532
            ],
            [
                9557,
                9629
            ],
            [
                9635,
                9657
            ],
            [
                9680,
                9702
            ],
            [
                9703,
                9755
            ],
            [
                9800,
                9802
            ],
            [
                9880,
                9892
            ],
            [
                9849,
                9850
            ],
            [
                9931,
                9933
            ],
            [
                9922,
                9925
            ],
            [
                9959,
                9998
            ],
            [
                10185,
                10227
            ],
            [
                10227,
                10277
            ],
            [
                10277,
                10278
            ],
            [
                10292,
                10302
            ],
            [
                10302,
                10354
            ],
            [
                10354,
                10401
            ],
            [
                10401,
                10422
            ],
            [
                10425,
                10464
            ],
            [
                10464,
                10507
            ],
            [
                10507,
                10559
            ],
            [
                10559,
                10564
            ],
            [
                10566,
                10601
            ],
            [
                10611,
                10622
            ],
            [
                10624,
                10649
            ],
            [
                10649,
                10692
            ],
            [
                10692,
                10714
            ],
            [
                10714,
                10735
            ],
            [
                10735,
                10766
            ],
            [
                10813,
                10844
            ],
            [
                10844,
                10858
            ],
            [
                10888,
                10982
            ],
            [
                10982,
                11001
            ],
            [
                11001,
                11066
            ],
            [
                11066,
                11089
            ],
            [
                11091,
                11128
            ],
            [
                11161,
                11200
            ],
            [
                11200,
                11255
            ],
            [
                11255,
                11263
            ],
            [
                11269,
                11279
            ],
            [
                11301,
                11329
            ],
            [
                11340,
                11391
            ],
            [
                11391,
                11429
            ],
            [
                11429,
                11440
            ],
            [
                11440,
                11456
            ],
            [
                11526,
                11529
            ],
            [
                11529,
                11545
            ],
            [
                11545,
                11592
            ],
            [
                11592,
                11638
            ],
            [
                11638,
                11676
            ],
            [
                11676,
                11702
            ],
            [
                11702,
                11743
            ],
            [
                11743,
                11749
            ],
            [
                11752,
                11778
            ],
            [
                11782,
                11805
            ],
            [
                11805,
                11866
            ],
            [
                11866,
                11967
            ],
            [
                12020,
                12060
            ],
            [
                12062,
                12066
            ],
            [
                12106,
                12136
            ],
            [
                12141,
                12151
            ],
            [
                12151,
                12199
            ],
            [
                12200,
                12359
            ]
        ],
        "row_chars": [
            [
                0,
                149
            ],
            [
                149,
                255
            ],
            [
                255,
                544
            ],
            [
                544,
                623
            ],
            [
                623,
                684
            ],
            [
                684,
                773
            ],
            [
                773,
                833
            ],
            [
                833,
                1273
            ],
            [
                1273,
                1508
            ],
            [
                1508,
                1695
            ],
            [
                1695,
                1836
            ],
            [
                1836,
                1980
            ],
            [
                1980,
                2057
            ],
            [
                2057,
                2133
            ],
            [
                2133,
                2197
            ],
            [
                2197,
                2281
            ],
            [
                2281,
                2336
            ],
            [
                2336,
                2399
            ],
            [
                2399,
                2524
            ],
            [
                2524,
                2550
            ],
            [
                2550,
                2667
            ],
            [
                2667,
                2801
            ],
            [
                2801,
                2983
            ],
            [
                2983,
                3075
            ],
            [
                3075,
                3167
            ],
            [
                3167,
                3243
            ],
            [
                3243,
                3343
            ],
            [
                3343,
                3475
            ],
            [
                3475,
                3569
            ],
            [
                3569,
                3674
            ],
            [
                3674,
                3722
            ],
            [
                3722,
                3735
            ],
            [
                3735,
                3892
            ],
            [
                3892,
                3939
            ],
            [
                3939,
                4015
            ],
            [
                4015,
                4251
            ],
            [
                4251,
                4365
            ],
            [
                4365,
                4446
            ],
            [
                4446,
                4557
            ],
            [
                4557,
                4864
            ],
            [
                4864,
                4923
            ],
            [
                4923,
                5026
            ],
            [
                5026,
                5159
            ],
            [
                5159,
                5368
            ],
            [
                5368,
                5584
            ],
            [
                5584,
                5739
            ],
            [
                5739,
                5796
            ],
            [
                5796,
                5836
            ],
            [
                5836,
                5874
            ],
            [
                5874,
                5913
            ],
            [
                5913,
                6128
            ],
            [
                6128,
                6180
            ],
            [
                6180,
                6234
            ],
            [
                6234,
                6362
            ],
            [
                6362,
                6494
            ],
            [
                6494,
                6552
            ],
            [
                6552,
                6580
            ],
            [
                6580,
                6652
            ],
            [
                6652,
                6703
            ],
            [
                6703,
                7089
            ],
            [
                7089,
                7162
            ],
            [
                7162,
                7203
            ],
            [
                7203,
                7399
            ],
            [
                7399,
                7472
            ],
            [
                7472,
                7549
            ],
            [
                7549,
                7682
            ],
            [
                7682,
                7707
            ],
            [
                7707,
                7837
            ],
            [
                7837,
                7849
            ],
            [
                7849,
                7936
            ],
            [
                7936,
                8053
            ],
            [
                8053,
                8105
            ],
            [
                8105,
                8216
            ],
            [
                8216,
                8269
            ],
            [
                8269,
                8330
            ],
            [
                8330,
                8368
            ],
            [
                8368,
                8451
            ],
            [
                8451,
                8509
            ],
            [
                8509,
                8813
            ],
            [
                8813,
                9003
            ],
            [
                9003,
                9115
            ],
            [
                9115,
                9210
            ],
            [
                9210,
                9418
            ],
            [
                9418,
                9526
            ],
            [
                9526,
                9703
            ],
            [
                9703,
                9802
            ],
            [
                9802,
                9999
            ],
            [
                9999,
                10033
            ],
            [
                10033,
                10071
            ],
            [
                10071,
                10185
            ],
            [
                10185,
                10227
            ],
            [
                10227,
                10277
            ],
            [
                10277,
                10302
            ],
            [
                10302,
                10354
            ],
            [
                10354,
                10401
            ],
            [
                10401,
                10464
            ],
            [
                10464,
                10507
            ],
            [
                10507,
                10559
            ],
            [
                10559,
                10649
            ],
            [
                10649,
                10692
            ],
            [
                10692,
                10714
            ],
            [
                10714,
                10735
            ],
            [
                10735,
                10844
            ],
            [
                10844,
                10982
            ],
            [
                10982,
                11001
            ],
            [
                11001,
                11066
            ],
            [
                11066,
                11128
            ],
            [
                11128,
                11161
            ],
            [
                11161,
                11200
            ],
            [
                11200,
                11255
            ],
            [
                11255,
                11391
            ],
            [
                11391,
                11429
            ],
            [
                11429,
                11440
            ],
            [
                11440,
                11529
            ],
            [
                11529,
                11545
            ],
            [
                11545,
                11592
            ],
            [
                11592,
                11638
            ],
            [
                11638,
                11676
            ],
            [
                11676,
                11702
            ],
            [
                11702,
                11743
            ],
            [
                11743,
                11782
            ],
            [
                11782,
                11805
            ],
            [
                11805,
                11866
            ],
            [
                11866,
                12020
            ],
            [
                12020,
                12151
            ],
            [
                12151,
                12200
            ],
            [
                12200,
                12359
            ]
        ]
    },
    "abridged": {
        "text": "Mr. Grey and wife were duly carried away from Matching Priory for their honeymoon. When Alice was first asked where she wished to go, she simply suggested that it should not be to Switzerland. They travelled slowly through Italy to Rome, although that had not been their original intention, because Mr. Grey believed that he would be wanted in England, down at Silverbridge, very shortly. But he soon learned that things were to be postponed.\n\"There will be no vacancy till Parliament meets.\" That had been the message sent to him by Mr. Palliser. Lady Glencora's message to Alice had been rather longer, covering three pages; she had abused Lord Brock, had abused Mr. Finespun, and had abused all public things, because the arrangements now proposed would not be very comfortable to herself.\n\"You can go to Rome and see everything and enjoy yourself, which I was not allowed to do; and all this bother of electioneering will take place just when I am in the middle of all my trouble.\"\nMany very long letters came from Lady Glencora to Rome during the winter - letters which Alice enjoyed thoroughly, but which were very indiscreet. The Duke was at the Castle for Christmas, and Glencora's descriptions of him were very comic.\n\"He comes and bends over me on the sofa in the most stupendous way, as though a woman who may the mother of his heir must be a miracle. The other day the devil prompted to say that I hoped it would be a girl. The look on his face nearly frightened me. If it is a girl, I believe he will turn me out of the house; but how can I help it? I wish you were going to have a baby at the same time. Then, if yours was a boy and mine a girl, we'd exchange.\" This was very indiscreet, and it was a pity Alice could not show it to her husband.\nBut December and January wore themselves away, and the time came for the Greys to return to England. The husband had discussed his parliamentary ambition with his wife, and found her a very ready listener. Having made up his mind to do this, he was resolved to do it thoroughly, and was becoming almost as full of politics as Mr. Palliser himself.\nThen, when they reached London, they heard the news from Mr. Vavasor, who met them at the railway.\n\"The Duke has got an heir,\" he said, before the carriage-door was open; \"born this morning!\" One might have supposed that it was the Duke's baby, and not Lady Glencora's and Mr. Palliser's.\nThere was a note from Mr. Palliser to Mr. Grey. \"Thank God!\" it said, \"Lady Glencora and the boy are quite as well as can be expected. Both the new writs were moved for last night.\" Mr. Palliser's honours came rushing upon him all at once.\nWondrous little baby! Better than royal rank will be thine, with influence more than royal. All that the world can give will be thine; and yet when we talk of thee, we are wont to declare that thy chances of happiness are no better than those of thine infant neighbour, in the farmyard cradle. Who shall say that they are better or worse? And how shall we reconcile to ourselves that seeming injustice?\nAnd now we will pay a little visit to the small one, to end our history. It was early in April, when Mrs. Grey was at Gatherum Castle, but Mr. Grey was absent at Silverbridge with Mr. Palliser. This was the day of the Silverbridge election. Lady Glencora and Alice were sitting upstairs with the small, noble-born one lying in Alice's lap.\n\"It is such a comfort that it is over,\" said the mother.\n\"You are the most ungrateful of women.\"\n\"Oh, Alice! Your baby may come just as it pleases. You won't lie awake trembling how on earth you will bear your disgrace if it should be a girl.\"\n\"I'm sure Mr. Palliser would not have said a word.\"\n\"No, he would have said nothing, nor would the Duke. The Duke would simply have gone away instantly, and never have seen me again till the next chance comes - if it ever does come. And Mr. Palliser would have been as gentle as a dove. But I should have known what they both thought and felt.\"\n\"It's all right now, dear.\"\n\"Yes, my bonny boy, you have made it all right for me; have you not?\" And Lady Glencora took her baby into her own arms. \"But, oh, Alice, if you had seen the Duke's long face through those three days; if you had heard the oppressive cheerfulness of those two London doctors - doctors are such bad actors - you would have thought it impossible for any woman to live through it. But you have made everything right, my little man.\" Then there were various ceremonies of feminine idolatry till an old nurse carried the idol away.\nThat afternoon Lady Glencora took Alice all over the house. It was a castle of enormous size, quite new, very cold, very handsome, and very dull.\n\"What an immense place!\" said Alice, as she stood looking round her in the grand hall.\n\"Is it not? And it cost a hundred thousand pounds or more. Well, that would be nothing to the Duke. But the joke is, nobody ever thinks of living here. Who'd live in such a great, overgrown place such as this, if they could get a comfortable house like Matching? The Duke comes for one week in the year, and Plantagenet says he hates to do that. As for me, nothing on earth shall ever make me live here. I couldn't help their bringing me here; but I shall assert myself now. Come, we must go away to avoid being caught by the public tour.\"\nThat evening Mr. Palliser and Mr. Grey returned home from Silverbridge together. Mr. Grey was by then a Member of Parliament, but Mr. Palliser had to wait for the county election. But there was no rival candidate for the position, and Mr. Palliser was thoroughly contented. He was now Chancellor of the Exchequer, and in about ten days' time would be on his feet in the House proposing his scheme of finance.\nThe two men were seated together in an open carriage. Although Mr. Palliser was rejoicing, he did not speak a word that was triumphant in its tone.\n\"I hope you'll like it,\" he said to Grey.\n\"I shall never like it as you do,\" Grey answered.\n\"Why not?\"\n\"In the first place, I have not begun it so young.\"\n\"Any time before thirty-five is young enough.\"\n\"For useful work, yes - but hardly for enjoyment in the thing. And then I don't believe it all as you do. To you the British House of Commons is everything.\"\n\"Yes; everything,\" said Mr. Palliser with unusual enthusiasm; \"everything, everything. That and the Constitution are everything.\"\n\"It is not so to me.\"\n\"Ah, but it will be. If you really take to the work, you'll get to feel it as I do. The man who is number one on the Treasury Bench in the English House of Commons, is the first of living men. That's my opinion. I don't know that I ever said it before; but that's my opinion.\"\n\"And who is the second; the purse-bearer to this great man?\"\n\"I don't know that there is any second. I wonder how we shall find Lady Glencora and the boy.\" They had arrived at the Castle, and Mr. Grey ran upstairs to his wife's room to receive her congratulations.\n\"And you are a Member of Parliament?\" she asked.\n\"They tell me so.\"\n\"I am so happy. There's no position in the world so glorious!\"\n\"It's a pity you are not Mr. Palliser's wife. That's just what he has been saying.\"\n\"Oh, John, I am so happy. It is so much more than I have deserved. I hope - that is, I sometimes think-\"\n\"Think what, dearest?\"\n\"I hope nothing that I have ever said has driven you to it.\"\n\"I'd do more than that, dear, to make you happy,\" he said, as he put his arm round her and kissed her.\nProbably my readers may agree with Alice that she had received more than she deserved. All her friends, except her husband, thought so.\nBut as they have all forgiven her, including even Lady Midlothian herself, I hope that they who have followed her story to its close will not be less generous.",
        "paragraph_chars": [
            [
                0,
                443
            ],
            [
                443,
                793
            ],
            [
                793,
                986
            ],
            [
                986,
                1227
            ],
            [
                1227,
                1760
            ],
            [
                1760,
                2108
            ],
            [
                2108,
                2207
            ],
            [
                2207,
                2397
            ],
            [
                2397,
                2637
            ],
            [
                2637,
                3040
            ],
            [
                3040,
                3380
            ],
            [
                3380,
                3437
            ],
            [
                3437,
                3477
            ],
            [
                3477,
                3624
            ],
            [
                3624,
                3676
            ],
            [
                3676,
                3969
            ],
            [
                3969,
                3997
            ],
            [
                3997,
                4523
            ],
            [
                4523,
                4669
            ],
            [
                4669,
                4756
            ],
            [
                4756,
                5296
            ],
            [
                5296,
                5705
            ],
            [
                5705,
                5853
            ],
            [
                5853,
                5895
            ],
            [
                5895,
                5945
            ],
            [
                5945,
                5956
            ],
            [
                5956,
                6008
            ],
            [
                6008,
                6055
            ],
            [
                6055,
                6213
            ],
            [
                6213,
                6343
            ],
            [
                6343,
                6365
            ],
            [
                6365,
                6642
            ],
            [
                6642,
                6703
            ],
            [
                6703,
                6907
            ],
            [
                6907,
                6956
            ],
            [
                6956,
                6975
            ],
            [
                6975,
                7038
            ],
            [
                7038,
                7122
            ],
            [
                7122,
                7227
            ],
            [
                7227,
                7250
            ],
            [
                7250,
                7311
            ],
            [
                7311,
                7414
            ],
            [
                7414,
                7550
            ],
            [
                7550,
                7709
            ]
        ],
        "segment_chars": [
            [
                0,
                83
            ],
            [
                83,
                193
            ],
            [
                193,
                389
            ],
            [
                389,
                443
            ],
            [
                443,
                493
            ],
            [
                493,
                548
            ],
            [
                548,
                793
            ],
            [
                793,
                986
            ],
            [
                986,
                1133
            ],
            [
                1133,
                1227
            ],
            [
                1227,
                1363
            ],
            [
                1363,
                1436
            ],
            [
                1436,
                1479
            ],
            [
                1479,
                1563
            ],
            [
                1563,
                1618
            ],
            [
                1618,
                1676
            ],
            [
                1676,
                1760
            ],
            [
                1760,
                1861
            ],
            [
                1861,
                1966
            ],
            [
                1966,
                2108
            ],
            [
                2108,
                2207
            ],
            [
                2207,
                2300
            ],
            [
                2300,
                2397
            ],
            [
                2397,
                2445
            ],
            [
                2445,
                2458
            ],
            [
                2458,
                2532
            ],
            [
                2532,
                2579
            ],
            [
                2579,
                2637
            ],
            [
                2637,
                2659
            ],
            [
                2659,
                2729
            ],
            [
                2729,
                2931
            ],
            [
                2931,
                2976
            ],
            [
                2976,
                3040
            ],
            [
                3040,
                3113
            ],
            [
                3113,
                3234
            ],
            [
                3234,
                3281
            ],
            [
                3281,
                3380
            ],
            [
                3380,
                3437
            ],
            [
                3437,
                3477
            ],
            [
                3477,
                3489
            ],
            [
                3489,
                3528
            ],
            [
                3528,
                3624
            ],
            [
                3624,
                3676
            ],
            [
                3676,
                3729
            ],
            [
                3729,
                3857
            ],
            [
                3857,
                3911
            ],
            [
                3911,
                3969
            ],
            [
                3969,
                3997
            ],
            [
                3997,
                4067
            ],
            [
                4067,
                4118
            ],
            [
                4118,
                4374
            ],
            [
                4374,
                4426
            ],
            [
                4426,
                4523
            ],
            [
                4523,
                4583
            ],
            [
                4583,
                4669
            ],
            [
                4669,
                4694
            ],
            [
                4694,
                4756
            ],
            [
                4756,
                4768
            ],
            [
                4768,
                4815
            ],
            [
                4815,
                4856
            ],
            [
                4856,
                4908
            ],
            [
                4908,
                5019
            ],
            [
                5019,
                5102
            ],
            [
                5102,
                5160
            ],
            [
                5160,
                5231
            ],
            [
                5231,
                5296
            ],
            [
                5296,
                5377
            ],
            [
                5377,
                5476
            ],
            [
                5476,
                5570
            ],
            [
                5570,
                5705
            ],
            [
                5705,
                5759
            ],
            [
                5759,
                5853
            ],
            [
                5853,
                5895
            ],
            [
                5895,
                5945
            ],
            [
                5945,
                5956
            ],
            [
                5956,
                6008
            ],
            [
                6008,
                6055
            ],
            [
                6055,
                6118
            ],
            [
                6118,
                6161
            ],
            [
                6161,
                6213
            ],
            [
                6213,
                6300
            ],
            [
                6300,
                6343
            ],
            [
                6343,
                6365
            ],
            [
                6365,
                6386
            ],
            [
                6386,
                6449
            ],
            [
                6449,
                6558
            ],
            [
                6558,
                6577
            ],
            [
                6577,
                6642
            ],
            [
                6642,
                6703
            ],
            [
                6703,
                6743
            ],
            [
                6743,
                6798
            ],
            [
                6798,
                6907
            ],
            [
                6907,
                6945
            ],
            [
                6945,
                6956
            ],
            [
                6956,
                6975
            ],
            [
                6975,
                6991
            ],
            [
                6991,
                7038
            ],
            [
                7038,
                7084
            ],
            [
                7084,
                7122
            ],
            [
                7122,
                7148
            ],
            [
                7148,
                7189
            ],
            [
                7189,
                7227
            ],
            [
                7227,
                7250
            ],
            [
                7250,
                7311
            ],
            [
                7311,
                7414
            ],
            [
                7414,
                7501
            ],
            [
                7501,
                7550
            ],
            [
                7550,
                7709
            ]
        ],
        "overlap_chars": [
            [
                0,
                61
            ],
            [
                66,
                81
            ],
            [
                81,
                83
            ],
            [
                83,
                119
            ],
            [
                130,
                193
            ],
            [
                193,
                197
            ],
            [
                223,
                228
            ],
            [
                229,
                236
            ],
            [
                236,
                237
            ],
            [
                247,
                251
            ],
            [
                252,
                270
            ],
            [
                280,
                289
            ],
            [
                289,
                290
            ],
            [
                299,
                340
            ],
            [
                341,
                373
            ],
            [
                373,
                389
            ],
            [
                389,
                392
            ],
            [
                393,
                395
            ],
            [
                401,
                413
            ],
            [
                426,
                442
            ],
            [
                443,
                468
            ],
            [
                469,
                493
            ],
            [
                493,
                523
            ],
            [
                524,
                526
            ],
            [
                531,
                546
            ],
            [
                546,
                548
            ],
            [
                548,
                596
            ],
            [
                603,
                604
            ],
            [
                614,
                625
            ],
            [
                627,
                711
            ],
            [
                711,
                737
            ],
            [
                738,
                756
            ],
            [
                757,
                760
            ],
            [
                761,
                792
            ],
            [
                793,
                895
            ],
            [
                896,
                902
            ],
            [
                903,
                920
            ],
            [
                921,
                936
            ],
            [
                937,
                985
            ],
            [
                986,
                1058
            ],
            [
                1061,
                1110
            ],
            [
                1111,
                1115
            ],
            [
                1116,
                1133
            ],
            [
                1133,
                1159
            ],
            [
                1164,
                1173
            ],
            [
                1173,
                1178
            ],
            [
                1190,
                1205
            ],
            [
                1210,
                1226
            ],
            [
                1227,
                1312
            ],
            [
                1321,
                1361
            ],
            [
                1361,
                1363
            ],
            [
                1363,
                1376
            ],
            [
                1377,
                1395
            ],
            [
                1408,
                1436
            ],
            [
                1440,
                1444
            ],
            [
                1448,
                1456
            ],
            [
                1457,
                1479
            ],
            [
                1479,
                1484
            ],
            [
                1494,
                1563
            ],
            [
                1563,
                1618
            ],
            [
                1618,
                1664
            ],
            [
                1673,
                1676
            ],
            [
                1676,
                1700
            ],
            [
                1700,
                1701
            ],
            [
                1720,
                1740
            ],
            [
                1744,
                1759
            ],
            [
                1760,
                1824
            ],
            [
                1829,
                1838
            ],
            [
                1839,
                1861
            ],
            [
                1861,
                1876
            ],
            [
                1877,
                1886
            ],
            [
                1887,
                1913
            ],
            [
                1914,
                1927
            ],
            [
                1927,
                1938
            ],
            [
                1939,
                1966
            ],
            [
                1966,
                2000
            ],
            [
                2000,
                2082
            ],
            [
                2083,
                2107
            ],
            [
                2114,
                2138
            ],
            [
                2140,
                2144
            ],
            [
                2145,
                2181
            ],
            [
                2186,
                2206
            ],
            [
                2207,
                2278
            ],
            [
                2279,
                2300
            ],
            [
                2300,
                2360
            ],
            [
                2361,
                2374
            ],
            [
                2377,
                2393
            ],
            [
                2395,
                2396
            ],
            [
                2397,
                2445
            ],
            [
                2445,
                2458
            ],
            [
                2461,
                2465
            ],
            [
                2465,
                2466
            ],
            [
                2467,
                2532
            ],
            [
                2532,
                2579
            ],
            [
                2579,
                2601
            ],
            [
                2602,
                2637
            ],
            [
                2637,
                2657
            ],
            [
                2657,
                2659
            ],
            [
                2659,
                2727
            ],
            [
                2727,
                2729
            ],
            [
                2729,
                2800
            ],
            [
                2800,
                2868
            ],
            [
                2869,
                2873
            ],
            [
                2874,
                2905
            ],
            [
                2905,
                2909
            ],
            [
                2914,
                2931
            ],
            [
                2931,
                2968
            ],
            [
                2969,
                2976
            ],
            [
                2980,
                3040
            ],
            [
                3040,
                3091
            ],
            [
                3091,
                3092
            ],
            [
                3096,
                3099
            ],
            [
                3100,
                3113
            ],
            [
                3113,
                3135
            ],
            [
                3141,
                3154
            ],
            [
                3155,
                3173
            ],
            [
                3173,
                3234
            ],
            [
                3234,
                3279
            ],
            [
                3279,
                3281
            ],
            [
                3281,
                3317
            ],
            [
                3327,
                3342
            ],
            [
                3348,
                3357
            ],
            [
                3358,
                3380
            ],
            [
                3380,
                3437
            ],
            [
                3437,
                3477
            ],
            [
                3477,
                3487
            ],
            [
                3487,
                3489
            ],
            [
                3489,
                3528
            ],
            [
                3528,
                3601
            ],
            [
                3602,
                3604
            ],
            [
                3605,
                3611
            ],
            [
                3621,
                3624
            ],
            [
                3624,
                3676
            ],
            [
                3676,
                3708
            ],
            [
                3709,
                3729
            ],
            [
                3729,
                3832
            ],
            [
                3835,
                3857
            ],
            [
                3857,
                3909
            ],
            [
                3909,
                3911
            ],
            [
                3911,
                3969
            ],
            [
                3969,
                3997
            ],
            [
                3997,
                4016
            ],
            [
                4017,
                4051
            ],
            [
                4052,
                4067
            ],
            [
                4067,
                4118
            ],
            [
                4118,
                4119
            ],
            [
                4119,
                4122
            ],
            [
                4122,
                4123
            ],
            [
                4124,
                4218
            ],
            [
                4219,
                4270
            ],
            [
                4281,
                4300
            ],
            [
                4303,
                4361
            ],
            [
                4372,
                4373
            ],
            [
                4378,
                4423
            ],
            [
                4426,
                4430
            ],
            [
                4431,
                4436
            ],
            [
                4437,
                4441
            ],
            [
                4442,
                4449
            ],
            [
                4450,
                4481
            ],
            [
                4482,
                4486
            ],
            [
                4490,
                4493
            ],
            [
                4494,
                4499
            ],
            [
                4508,
                4523
            ],
            [
                4523,
                4583
            ],
            [
                4583,
                4627
            ],
            [
                4628,
                4668
            ],
            [
                4669,
                4694
            ],
            [
                4694,
                4754
            ],
            [
                4754,
                4755
            ],
            [
                4756,
                4768
            ],
            [
                4768,
                4779
            ],
            [
                4780,
                4815
            ],
            [
                4815,
                4819
            ],
            [
                4819,
                4820
            ],
            [
                4821,
                4842
            ],
            [
                4843,
                4845
            ],
            [
                4846,
                4854
            ],
            [
                4854,
                4856
            ],
            [
                4856,
                4908
            ],
            [
                4908,
                5019
            ],
            [
                5019,
                5102
            ],
            [
                5102,
                5160
            ],
            [
                5160,
                5161
            ],
            [
                5162,
                5198
            ],
            [
                5198,
                5199
            ],
            [
                5200,
                5203
            ],
            [
                5204,
                5211
            ],
            [
                5212,
                5225
            ],
            [
                5226,
                5231
            ],
            [
                5231,
                5236
            ],
            [
                5237,
                5252
            ],
            [
                5253,
                5281
            ],
            [
                5282,
                5288
            ],
            [
                5296,
                5300
            ],
            [
                5301,
                5308
            ],
            [
                5309,
                5377
            ],
            [
                5379,
                5380
            ],
            [
                5386,
                5389
            ],
            [
                5393,
                5425
            ],
            [
                5439,
                5442
            ],
            [
                5451,
                5465
            ],
            [
                5466,
                5474
            ],
            [
                5474,
                5476
            ],
            [
                5476,
                5568
            ],
            [
                5568,
                5570
            ],
            [
                5570,
                5576
            ],
            [
                5581,
                5653
            ],
            [
                5659,
                5681
            ],
            [
                5682,
                5704
            ],
            [
                5705,
                5757
            ],
            [
                5757,
                5759
            ],
            [
                5768,
                5780
            ],
            [
                5794,
                5795
            ],
            [
                5796,
                5798
            ],
            [
                5803,
                5806
            ],
            [
                5813,
                5852
            ],
            [
                5853,
                5895
            ],
            [
                5895,
                5945
            ],
            [
                5945,
                5946
            ],
            [
                5946,
                5956
            ],
            [
                5956,
                6008
            ],
            [
                6008,
                6055
            ],
            [
                6055,
                6076
            ],
            [
                6079,
                6118
            ],
            [
                6118,
                6161
            ],
            [
                6161,
                6213
            ],
            [
                6213,
                6218
            ],
            [
                6219,
                6254
            ],
            [
                6263,
                6274
            ],
            [
                6275,
                6300
            ],
            [
                6300,
                6343
            ],
            [
                6343,
                6365
            ],
            [
                6365,
                6386
            ],
            [
                6386,
                6417
            ],
            [
                6418,
                6449
            ],
            [
                6449,
                6463
            ],
            [
                6464,
                6558
            ],
            [
                6558,
                6577
            ],
            [
                6577,
                6642
            ],
            [
                6642,
                6665
            ],
            [
                6666,
                6703
            ],
            [
                6704,
                6743
            ],
            [
                6743,
                6798
            ],
            [
                6798,
                6806
            ],
            [
                6807,
                6817
            ],
            [
                6818,
                6846
            ],
            [
                6856,
                6907
            ],
            [
                6907,
                6945
            ],
            [
                6945,
                6956
            ],
            [
                6956,
                6972
            ],
            [
                6972,
                6975
            ],
            [
                6975,
                6991
            ],
            [
                6991,
                7038
            ],
            [
                7038,
                7084
            ],
            [
                7084,
                7122
            ],
            [
                7122,
                7148
            ],
            [
                7148,
                7189
            ],
            [
                7189,
                7195
            ],
            [
                7198,
                7224
            ],
            [
                7227,
                7250
            ],
            [
                7250,
                7311
            ],
            [
                7311,
                7412
            ],
            [
                7414,
                7454
            ],
            [
                7455,
                7459
            ],
            [
                7460,
                7490
            ],
            [
                7491,
                7501
            ],
            [
                7501,
                7549
            ],
            [
                7550,
                7709
            ]
        ],
        "row_chars": [
            [
                0,
                83
            ],
            [
                83,
                193
            ],
            [
                193,
                389
            ],
            [
                389,
                443
            ],
            [
                443,
                443
            ],
            [
                443,
                493
            ],
            [
                493,
                548
            ],
            [
                548,
                793
            ],
            [
                793,
                986
            ],
            [
                986,
                1133
            ],
            [
                1133,
                1227
            ],
            [
                1227,
                1363
            ],
            [
                1363,
                1363
            ],
            [
                1363,
                1436
            ],
            [
                1436,
                1479
            ],
            [
                1479,
                1563
            ],
            [
                1563,
                1618
            ],
            [
                1618,
                1676
            ],
            [
                1676,
                1760
            ],
            [
                1760,
                1760
            ],
            [
                1760,
                1861
            ],
            [
                1861,
                1966
            ],
            [
                1966,
                2108
            ],
            [
                2108,
                2108
            ],
            [
                2108,
                2108
            ],
            [
                2108,
                2108
            ],
            [
                2108,
                2108
            ],
            [
                2108,
                2207
            ],
            [
                2207,
                2300
            ],
            [
                2300,
                2397
            ],
            [
                2397,
                2445
            ],
            [
                2445,
                2458
            ],
            [
                2458,
                2532
            ],
            [
                2532,
                2579
            ],
            [
                2579,
                2637
            ],
            [
                2637,
                2659
            ],
            [
                2659,
                2729
            ],
            [
                2729,
                2729
            ],
            [
                2729,
                2729
            ],
            [
                2729,
                2931
            ],
            [
                2931,
                2976
            ],
            [
                2976,
                3040
            ],
            [
                3040,
                3113
            ],
            [
                3113,
                3234
            ],
            [
                3234,
                3281
            ],
            [
                3281,
                3380
            ],
            [
                3380,
                3437
            ],
            [
                3437,
                3477
            ],
            [
                3477,
                3489
            ],
            [
                3489,
                3528
            ],
            [
                3528,
                3624
            ],
            [
                3624,
                3676
            ],
            [
                3676,
                3729
            ],
            [
                3729,
                3857
            ],
            [
                3857,
                3911
            ],
            [
                3911,
                3969
            ],
            [
                3969,
                3997
            ],
            [
                3997,
                4067
            ],
            [
                4067,
                4118
            ],
            [
                4118,
                4426
            ],
            [
                4426,
                4426
            ],
            [
                4426,
                4426
            ],
            [
                4426,
                4523
            ],
            [
                4523,
                4523
            ],
            [
                4523,
                4583
            ],
            [
                4583,
                4669
            ],
            [
                4669,
                4694
            ],
            [
                4694,
                4756
            ],
            [
                4756,
                4768
            ],
            [
                4768,
                4815
            ],
            [
                4815,
                4856
            ],
            [
                4856,
                4908
            ],
            [
                4908,
                5019
            ],
            [
                5019,
                5019
            ],
            [
                5019,
                5019
            ],
            [
                5019,
                5019
            ],
            [
                5019,
                5102
            ],
            [
                5102,
                5160
            ],
            [
                5160,
                5231
            ],
            [
                5231,
                5296
            ],
            [
                5296,
                5296
            ],
            [
                5296,
                5377
            ],
            [
                5377,
                5476
            ],
            [
                5476,
                5570
            ],
            [
                5570,
                5705
            ],
            [
                5705,
                5759
            ],
            [
                5759,
                5853
            ],
            [
                5853,
                5853
            ],
            [
                5853,
                5853
            ],
            [
                5853,
                5853
            ],
            [
                5853,
                5895
            ],
            [
                5895,
                5945
            ],
            [
                5945,
                5956
            ],
            [
                5956,
                6008
            ],
            [
                6008,
                6055
            ],
            [
                6055,
                6118
            ],
            [
                6118,
                6161
            ],
            [
                6161,
                6213
            ],
            [
                6213,
                6300
            ],
            [
                6300,
                6343
            ],
            [
                6343,
                6365
            ],
            [
                6365,
                6386
            ],
            [
                6386,
                6449
            ],
            [
                6449,
                6558
            ],
            [
                6558,
                6577
            ],
            [
                6577,
                6642
            ],
            [
                6642,
                6703
            ],
            [
                6703,
                6703
            ],
            [
                6703,
                6743
            ],
            [
                6743,
                6798
            ],
            [
                6798,
                6907
            ],
            [
                6907,
                6945
            ],
            [
                6945,
                6956
            ],
            [
                6956,
                6975
            ],
            [
                6975,
                6991
            ],
            [
                6991,
                7038
            ],
            [
                7038,
                7084
            ],
            [
                7084,
                7122
            ],
            [
                7122,
                7148
            ],
            [
                7148,
                7189
            ],
            [
                7189,
                7227
            ],
            [
                7227,
                7250
            ],
            [
                7250,
                7311
            ],
            [
                7311,
                7414
            ],
            [
                7414,
                7501
            ],
            [
                7501,
                7550
            ],
            [
                7550,
                7709
            ]
        ]
    }
}