{
    "original": {
        "text": "We will leave Mrs. Greenow with her niece and two sisters at Yarmouth, and returning by stages to London, will call upon Mr. Grey at his place in Cambridgeshire as we pass by. I believe it is conceded by all the other counties, that Cambridgeshire possesses fewer rural beauties than any other county in England. It is very flat; it is not well timbered; the rivers are merely dikes; and in a very large portion of the county the farms and fields are divided simply by ditches--not by hedgerows. Such arrangements are, no doubt, well adapted for agricultural purposes, but are not conducive to rural beauty. Mr. Grey's residence was situated in a part of Cambridgeshire in which the above-named characteristics are very much marked. It was in the Isle of Ely, some few miles distant from the Cathedral town, on the side of a long straight road, which ran through the fields for miles without even a bush to cheer it. The name of his place was Nethercoats, and here he lived generally throughout the year, and here he intended to live throughout his life.\nHis father had held a prebendal stall at Ely in times when prebendal stalls were worth more than they are at present, and having also been possessed of a living in the neighbourhood, had amassed a considerable sum of money. With this he had during his life purchased the property of Nethercoats, and had built on it the house in which his son now lived. He had married late in life, and had lost his wife soon after the birth of an only child. The house had been built in his own parish, and his wife had lived there for a few months and had died there. But after that event the old clergyman had gone back to his residence in the Close at Ely, and there John Grey had had the home of his youth. He had been brought up under his father's eye, having been sent to no public school. But he had gone to Cambridge, had taken college honours, and had then, his father dying exactly at this time, declined to accept a fellowship. His father had left to him an income of some fifteen hundred a year, and with this he sat himself down, near to his college friends, near also to the old cathedral which he loved, in the house which his father had built.\nBut though Nethercoats possessed no beauty of scenery, though the country around it was in truth as uninteresting as any country could be, it had many delights of its own. The house itself was as excellent a residence for a country gentleman of small means as taste and skill together could construct. I doubt whether prettier rooms were ever seen than the drawing-room, the library, and the dining-room at Nethercoats. They were all on the ground-floor, and all opened out on to the garden and lawn. The library, which was the largest of the three, was a handsome chamber, and so filled as to make it well known in the University as one of the best private collections in that part of England. But perhaps the gardens of Nethercoats constituted its greatest glory. They were spacious and excellently kept up, and had been originally laid out with that knowledge of gardening without which no garden, merely as a garden, can be effective. And such, of necessity, was the garden of Nethercoats. Fine single forest trees there were none there, nor was it possible that there should have been any such. Nor could there be a clear rippling stream with steep green banks, and broken rocks lying about its bed. Such beauties are beauties of landscape, and do not of their nature belong to a garden. But the shrubs of Nethercoats were of the rarest kind, and had been long enough in their present places to have reached the period of their beauty. Nothing had been spared that a garden could want. The fruit-trees were perfect in their kind, and the glass-houses were so good and so extensive that John Grey in his prudence was some times tempted to think that he had too much of them.\nIt must be understood that there were no grounds, according to the meaning usually given to that word, belonging to the house at Nethercoats. Between the garden and the public road there was a paddock belonging to the house, along the side of which, but divided from it by a hedge and shrubbery, ran the private carriageway up to the house. This swept through the small front flower-garden, dividing it equally; but the lawns and indeed the whole of that which made the beauty of the place lay on the back of the house, on which side opened the windows from the three sitting-rooms. Down on the public road there stood a lodge at which lived one of the gardeners. There was another field of some six or seven acres, to which there was a gate from the corner of the front paddock, and which went round two sides of the garden. This was Nethercoats, and the whole estate covered about twelve acres.\nIt was not a place for much bachelor enjoyment of that sort generally popular with bachelors; nevertheless Mr. Grey had been constant in his residence there for the seven years which had now elapsed since he had left his college. His easy access to Cambridge had probably done much to mitigate what might otherwise have been the too great tedium of his life; and he had, prompted thereto by early associations, found most of his society in the Close of Ely Cathedral. But, with all the delight he could derive from these two sources, there had still been many solitary hours in his life, and he had gradually learned to feel that he of all men wanted a companion in his home.\nHis visits to London had generally been short and far between, occasioned probably by some need in the library, or by the necessity of some slight literary transaction with the editor or publisher of a periodical. In one of these visits he had met Alice Vavasor, and had remained in Town,--I will not say till Alice had promised to share his home in Cambridgeshire, but so long that he had resolved before he went that he would ask her to do so. He had asked her, and we know that he had been successful. He had obtained her promise, and from that moment all his life had been changed for him. Hitherto at Nethercoats his little smoking-room, his books, and his plants had been everything to him. Now he began to surround himself with an infinity of feminine belongings, and to promise himself an infinity of feminine blessings, wondering much that he should have been content to pass so long a portion of his life in the dull seclusion which he had endured. He was not by nature an impatient man; but now he became impatient, longing for the fruition of his new idea of happiness,--longing to have that as his own which he certainly loved beyond all else in the world, and which, perhaps, was all he had ever loved with the perfect love of equality. But though impatient, and fully aware of his own impatience, he acknowledged to himself that Alice could not be expected to share it. He could plan nothing now,--could have no pleasure in life that she was not expected to share. But as yet it could not be so with her. She had her house in London, her town society, and her father. And, inasmuch as the change for her would be much greater than it would be for him, it was natural that she should require some small delay. He had not pressed her. At least he had not pressed her with that eager pressure which a girl must resist with something of the opposition of a contest, if she resist it at all. But in truth his impatience was now waxing strong, and during the absence in Switzerland of which we have spoken, he resolved that a marriage very late in the autumn,--that a marriage even in winter, would be better than a marriage postponed till the following year. It was not yet late in August when the party returned from their tour. Would not a further delay of two months suffice for his bride?\nAlice had written to him occasionally from Switzerland, and her first two letters had been very charming. They had referred almost exclusively to the tour, and had been made pleasant with some slightly coloured account of George Vavasor's idleness, and of Kate's obedience to her brother's behests. Alice had never written much of love in her love-letters, and Grey was well enough contented with her style, though it was not impassioned. As for doubting her love, it was not in the heart of the man to do so after it had been once assured to him by her word. He could not so slightly respect himself or her as to leave room for such a doubt in his bosom. He was a man who could never have suggested to himself that a woman loved him till the fact was there before him; but who having ascertained, as he might think, the fact, could never suggest to himself that her love would fail him. Her first two letters from Switzerland had been very pleasant; but after that there had seemed to have crept over her a melancholy which she unconsciously transferred to her words, and which he could not but taste in them,--at first unconsciously, also, but soon with so plain a flavour that he recognised it, and made it a matter of mental inquiry. During the three or four last days of the journey, while they were at Basle and on their way home, she had not written. But she did write on the day after her arrival, having then received from Mr. Grey a letter, in which he told her how very much she would add to his happiness if she would now agree that their marriage should not be postponed beyond the end of October. This letter she found in her room on her return, and this she answered at once. And she answered it in such words that Mr. Grey resolved that he would at once go to her in London. I will give her letter at length, as I shall then be best able to proceed with my story quickly.\nQueen Anne Street, -- August, 186--.\nDEAREST JOHN,--\nWe reached home yesterday tired enough, as we came through from Paris without stopping. I may indeed say that we came through from Strasbourg, as we only slept in Paris. I don't like Strasbourg. A steeple, after all, is not everything, and putting the steeple aside, I don't think the style is good. But the hotel was uncomfortable, which goes for so much;--and then we were saturated with beauty of a better kind.\nI got your letter directly I came in last night, and I suppose I had better dash at it at once. I would so willingly delay doing so, saying nice little things the while, did I not know that this would be mere cowardice. Whatever happens I won't be a coward, and therefore I will tell you at once that I cannot let you hope that we should be married this year. Of course you will ask me why, as you have a right to do, and of course I am bound to answer. I do not know that I can give any answer with which you will not have a right to complain. If it be so, I can only ask your pardon for the injury I am doing you.\nMarriage is a great change in life,--much greater to me than to you, who will remain in your old house, will keep your old pursuits, will still be your own master, and will change in nothing,--except in this, that you will have a companion who probably may not be all that you expect. But I must change everything. It will be to me as though I were passing through a grave to a new world. I shall see nothing that I have been accustomed to see, and must abandon all the ways of life that I have hitherto adopted. Of course I should have thought of this before I accepted you; and I did think of it. I made up my mind that, as I truly loved you, I would risk the change;--that I would risk it for your sake and for mine, hoping that I might add something to your happiness, and that I might secure my own. Dear John, do not suppose that I despair that it may be so; but, indeed, you must not hurry me. I must tune myself to the change that I have to make. What if I should wake some morning after six months living with you, and tell you that the quiet of your home was making me mad?\nYou must not ask me again till the winter shall have passed away. If in the meantime I shall find that I have been wrong, I will humbly confess that I have wronged you, and ask you to forgive me. And I will freely admit this. If the delay which I now purpose is so contrary to your own plans as to make your marriage, under such circumstances, not that which you had expected, I know that you are free to tell me so, and to say that our engagement shall be over. I am well aware that I can have no right to bind you to a marriage at one period which you had only contemplated as to take place at another period. I think I may promise that I will obey any wish you may express in anything,--except in that one thing which you urged in your last letter.\nKate is going down to Yarmouth with Mrs. Greenow, and I shall see no more of her probably till next year, as she will be due in Westmoreland after that. George left me at the door when he brought me home, and declared that he intended to vanish out of London. Whether in town or out, he is never to be seen at this period of the year. Papa offers to go to Ramsgate for a fortnight, but he looks so wretched when he makes the offer, that I shall not have the heart to hold him to it. Lady Macleod very much wants me to go to Cheltenham. I very much want not to go, simply because I can never agree with her about anything; but it will probably end in my going there for a week or two. Over and beyond that, I have no prospects before Christmas which are not purely domestic. There is a project that we shall all eat our Christmas dinner at Vavasor Hall,--of course not including George,--but this project is quite in the clouds, and, as far as I am concerned, will remain there.\nDear John, let me hear that this letter does not make you unhappy.\nMost affectionately yours,\nALICE VAVASOR.\nAt Nethercoats, the post was brought in at breakfast-time, and Mr. Grey was sitting with his tea and eggs before him, when he read Alice's letter. He read it twice before he began to think what he would do in regard to it, and then referred to one or two others which he had received from Switzerland,--reading them also very carefully. After that, he took up the slouch hat which he had been wearing in the garden before he was called to his breakfast, and, with the letters in his hand, sauntered down among the shrubs and lawns.\nHe knew, he thought he knew, that there was more in Alice's mind than a mere wish for delay. There was more in it than that hesitation to take at once a step which she really desired to take, if not now, then after some short interval. He felt that she was unhappy, and unhappy because she distrusted the results of her marriage; but it never for a moment occurred to him that, therefore, the engagement between them should be broken. In the first place he loved her too well to allow of his admitting such an idea without terrible sorrow to himself. He was a constant, firm man, somewhat reserved, and unwilling to make new acquaintances, and, therefore, specially unwilling to break away from those which he had made. Undoubtedly, had he satisfied himself that Alice's happiness demanded such a sacrifice of himself, he would have made it, and made it without a word of complaint. The blow would not have prostrated him, but the bruise would have remained on his heart, indelible, not to be healed but by death. He would have submitted, and no man would have seen that he had been injured. But it did not once occur to him that such a proceeding on his part would be beneficial to Alice. Without being aware of it, he reckoned himself to be the nobler creature of the two, and now thought of her as of one wounded, and wanting a cure. Some weakness had fallen on her, and strength must be given to her from another. He did not in the least doubt her love, but he knew that she had been associated, for a few weeks past, with two persons whose daily conversation would be prone to weaken the tone of her mind. He no more thought of giving her up than a man thinks of having his leg cut off because he has sprained his sinews. He would go up to town and see her, and would not even yet abandon all hope that she might be found sitting at his board when Christmas should come. By that day's post he wrote a short note to her.\n\"Dearest Alice,\" he said, \"I have resolved to go to London at once. I will be with you in the evening at eight, the day after to-morrow.\n\"Yours, J. G.\"\nThere was no more in the letter than that.\n\"And now,\" she said, when she received it, \"I must dare to tell him the whole truth.\"",
        "paragraph_chars": [
            [
                0,
                1055
            ],
            [
                1055,
                2200
            ],
            [
                2200,
                3879
            ],
            [
                3879,
                4776
            ],
            [
                4776,
                5452
            ],
            [
                5452,
                7755
            ],
            [
                7755,
                9643
            ],
            [
                9643,
                9680
            ],
            [
                9680,
                9696
            ],
            [
                9696,
                10111
            ],
            [
                10111,
                10727
            ],
            [
                10727,
                11811
            ],
            [
                11811,
                12563
            ],
            [
                12563,
                13541
            ],
            [
                13541,
                13608
            ],
            [
                13608,
                13635
            ],
            [
                13635,
                13650
            ],
            [
                13650,
                14182
            ],
            [
                14182,
                16107
            ],
            [
                16107,
                16244
            ],
            [
                16244,
                16259
            ],
            [
                16259,
                16302
            ],
            [
                16302,
                16387
            ]
        ],
        "segment_chars": [
            [
                0,
                176
            ],
            [
                176,
                313
            ],
            [
                313,
                496
            ],
            [
                496,
                608
            ],
            [
                608,
                733
            ],
            [
                733,
                917
            ],
            [
                917,
                1055
            ],
            [
                1055,
                1279
            ],
            [
                1279,
                1409
            ],
            [
                1409,
                1499
            ],
            [
                1499,
                1609
            ],
            [
                1609,
                1751
            ],
            [
                1751,
                1836
            ],
            [
                1836,
                1979
            ],
            [
                1979,
                2200
            ],
            [
                2200,
                2372
            ],
            [
                2372,
                2502
            ],
            [
                2502,
                2620
            ],
            [
                2620,
                2701
            ],
            [
                2701,
                2895
            ],
            [
                2895,
                2966
            ],
            [
                2966,
                3139
            ],
            [
                3139,
                3194
            ],
            [
                3194,
                3300
            ],
            [
                3300,
                3405
            ],
            [
                3405,
                3493
            ],
            [
                3493,
                3641
            ],
            [
                3641,
                3691
            ],
            [
                3691,
                3879
            ],
            [
                3879,
                4021
            ],
            [
                4021,
                4220
            ],
            [
                4220,
                4462
            ],
            [
                4462,
                4543
            ],
            [
                4543,
                4705
            ],
            [
                4705,
                4776
            ],
            [
                4776,
                5006
            ],
            [
                5006,
                5244
            ],
            [
                5244,
                5452
            ],
            [
                5452,
                5666
            ],
            [
                5666,
                5898
            ],
            [
                5898,
                5957
            ],
            [
                5957,
                6046
            ],
            [
                6046,
                6149
            ],
            [
                6149,
                6411
            ],
            [
                6411,
                6703
            ],
            [
                6703,
                6837
            ],
            [
                6837,
                6932
            ],
            [
                6932,
                6972
            ],
            [
                6972,
                7035
            ],
            [
                7035,
                7176
            ],
            [
                7176,
                7200
            ],
            [
                7200,
                7354
            ],
            [
                7354,
                7621
            ],
            [
                7621,
                7692
            ],
            [
                7692,
                7755
            ],
            [
                7755,
                7861
            ],
            [
                7861,
                8054
            ],
            [
                8054,
                8194
            ],
            [
                8194,
                8315
            ],
            [
                8315,
                8411
            ],
            [
                8411,
                8643
            ],
            [
                8643,
                8993
            ],
            [
                8993,
                9113
            ],
            [
                9113,
                9366
            ],
            [
                9366,
                9446
            ],
            [
                9446,
                9546
            ],
            [
                9546,
                9643
            ],
            [
                9643,
                9680
            ],
            [
                9680,
                9696
            ],
            [
                9696,
                9784
            ],
            [
                9784,
                9866
            ],
            [
                9866,
                9891
            ],
            [
                9891,
                9996
            ],
            [
                9996,
                10111
            ],
            [
                10111,
                10207
            ],
            [
                10207,
                10331
            ],
            [
                10331,
                10471
            ],
            [
                10471,
                10565
            ],
            [
                10565,
                10656
            ],
            [
                10656,
                10727
            ],
            [
                10727,
                11012
            ],
            [
                11012,
                11042
            ],
            [
                11042,
                11116
            ],
            [
                11116,
                11240
            ],
            [
                11240,
                11326
            ],
            [
                11326,
                11532
            ],
            [
                11532,
                11628
            ],
            [
                11628,
                11682
            ],
            [
                11682,
                11811
            ],
            [
                11811,
                11877
            ],
            [
                11877,
                12007
            ],
            [
                12007,
                12037
            ],
            [
                12037,
                12274
            ],
            [
                12274,
                12423
            ],
            [
                12423,
                12563
            ],
            [
                12563,
                12716
            ],
            [
                12716,
                12823
            ],
            [
                12823,
                12898
            ],
            [
                12898,
                13046
            ],
            [
                13046,
                13099
            ],
            [
                13099,
                13247
            ],
            [
                13247,
                13337
            ],
            [
                13337,
                13541
            ],
            [
                13541,
                13608
            ],
            [
                13608,
                13635
            ],
            [
                13635,
                13650
            ],
            [
                13650,
                13797
            ],
            [
                13797,
                13987
            ],
            [
                13987,
                14182
            ],
            [
                14182,
                14275
            ],
            [
                14275,
                14418
            ],
            [
                14418,
                14617
            ],
            [
                14617,
                14733
            ],
            [
                14733,
                14902
            ],
            [
                14902,
                15065
            ],
            [
                15065,
                15196
            ],
            [
                15196,
                15274
            ],
            [
                15274,
                15372
            ],
            [
                15372,
                15519
            ],
            [
                15519,
                15600
            ],
            [
                15600,
                15793
            ],
            [
                15793,
                15909
            ],
            [
                15909,
                16058
            ],
            [
                16058,
                16107
            ],
            [
                16107,
                16175
            ],
            [
                16175,
                16244
            ],
            [
                16244,
                16259
            ],
            [
                16259,
                16302
            ],
            [
                16302,
                16387
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                58,
                74
            ],
            [
                106,
                160
            ],
            [
                174,
                176
            ],
            [
                228,
                232
            ],
            [
                294,
                300
            ],
            [
                264,
                278
            ],
            [
                311,
                313
            ],
            [
                313,
                329
            ],
            [
                353,
                390
            ],
            [
                412,
                429
            ],
            [
                440,
                476
            ],
            [
                478,
                496
            ],
            [
                608,
                628
            ],
            [
                736,
                759
            ],
            [
                645,
                646
            ],
            [
                765,
                774
            ],
            [
                783,
                807
            ],
            [
                823,
                843
            ],
            [
                845,
                917
            ],
            [
                917,
                973
            ],
            [
                984,
                1008
            ],
            [
                1017,
                1055
            ],
            [
                1055,
                1069
            ],
            [
                1189,
                1193
            ],
            [
                1075,
                1084
            ],
            [
                1093,
                1099
            ],
            [
                1171,
                1176
            ],
            [
                1207,
                1208
            ],
            [
                1216,
                1237
            ],
            [
                1355,
                1364
            ],
            [
                1371,
                1409
            ],
            [
                1547,
                1575
            ],
            [
                1487,
                1491
            ],
            [
                1576,
                1588
            ],
            [
                1436,
                1437
            ],
            [
                1460,
                1483
            ],
            [
                1607,
                1609
            ],
            [
                1613,
                1623
            ],
            [
                1796,
                1797
            ],
            [
                1630,
                1664
            ],
            [
                1682,
                1685
            ],
            [
                1686,
                1719
            ],
            [
                1771,
                1796
            ],
            [
                1834,
                1836
            ],
            [
                1840,
                1846
            ],
            [
                1870,
                1875
            ],
            [
                1884,
                1891
            ],
            [
                1932,
                1934
            ],
            [
                1855,
                1864
            ],
            [
                1876,
                1883
            ],
            [
                1891,
                1906
            ],
            [
                1907,
                1917
            ],
            [
                1944,
                1954
            ],
            [
                1965,
                1979
            ],
            [
                1979,
                1998
            ],
            [
                2002,
                2064
            ],
            [
                2083,
                2110
            ],
            [
                2125,
                2142
            ],
            [
                2149,
                2200
            ],
            [
                2200,
                2235
            ],
            [
                2246,
                2254
            ],
            [
                2281,
                2287
            ],
            [
                2396,
                2405
            ],
            [
                2408,
                2456
            ],
            [
                2500,
                2502
            ],
            [
                2502,
                2618
            ],
            [
                2653,
                2654
            ],
            [
                2659,
                2690
            ],
            [
                2699,
                2701
            ],
            [
                2701,
                2723
            ],
            [
                2754,
                2773
            ],
            [
                2750,
                2753
            ],
            [
                2807,
                2812
            ],
            [
                2831,
                2894
            ],
            [
                2895,
                2910
            ],
            [
                2911,
                2933
            ],
            [
                2946,
                2966
            ],
            [
                2966,
                2975
            ],
            [
                2989,
                3000
            ],
            [
                3008,
                3022
            ],
            [
                3034,
                3042
            ],
            [
                3137,
                3139
            ],
            [
                3235,
                3240
            ],
            [
                3194,
                3198
            ],
            [
                3206,
                3224
            ],
            [
                3300,
                3365
            ],
            [
                3403,
                3405
            ],
            [
                3493,
                3507
            ],
            [
                3523,
                3551
            ],
            [
                3566,
                3572
            ],
            [
                3597,
                3599
            ],
            [
                3573,
                3581
            ],
            [
                3633,
                3641
            ],
            [
                3691,
                3719
            ],
            [
                3733,
                3755
            ],
            [
                3776,
                3785
            ],
            [
                3877,
                3878
            ],
            [
                4731,
                4747
            ],
            [
                4725,
                4726
            ],
            [
                4727,
                4730
            ],
            [
                4748,
                4776
            ],
            [
                4885,
                4895
            ],
            [
                4927,
                4936
            ],
            [
                4941,
                4952
            ],
            [
                5004,
                5006
            ],
            [
                5139,
                5145
            ],
            [
                5010,
                5034
            ],
            [
                5145,
                5146
            ],
            [
                5135,
                5138
            ],
            [
                5187,
                5244
            ],
            [
                5244,
                5247
            ],
            [
                5368,
                5408
            ],
            [
                5420,
                5452
            ],
            [
                5452,
                5514
            ],
            [
                5564,
                5566
            ],
            [
                5625,
                5635
            ],
            [
                5584,
                5591
            ],
            [
                5654,
                5666
            ],
            [
                5669,
                5722
            ],
            [
                5842,
                5850
            ],
            [
                5888,
                5890
            ],
            [
                5880,
                5887
            ],
            [
                5781,
                5798
            ],
            [
                5896,
                5898
            ],
            [
                5957,
                6036
            ],
            [
                6044,
                6045
            ],
            [
                6055,
                6069
            ],
            [
                6153,
                6155
            ],
            [
                6149,
                6152
            ],
            [
                6156,
                6186
            ],
            [
                6202,
                6279
            ],
            [
                6409,
                6411
            ],
            [
                6458,
                6532
            ],
            [
                6543,
                6620
            ],
            [
                6701,
                6702
            ],
            [
                6703,
                6706
            ],
            [
                6764,
                6779
            ],
            [
                6791,
                6832
            ],
            [
                6744,
                6747
            ],
            [
                6752,
                6762
            ],
            [
                6835,
                6837
            ],
            [
                6972,
                7033
            ],
            [
                7035,
                7038
            ],
            [
                7049,
                7176
            ],
            [
                7176,
                7200
            ],
            [
                7354,
                7389
            ],
            [
                7397,
                7415
            ],
            [
                7420,
                7442
            ],
            [
                7466,
                7495
            ],
            [
                7501,
                7519
            ],
            [
                7538,
                7552
            ],
            [
                7554,
                7620
            ],
            [
                7755,
                7861
            ],
            [
                7861,
                7869
            ],
            [
                7901,
                7909
            ],
            [
                7909,
                7910
            ],
            [
                7938,
                8042
            ],
            [
                8052,
                8054
            ],
            [
                8054,
                8124
            ],
            [
                8137,
                8144
            ],
            [
                8190,
                8194
            ],
            [
                8315,
                8317
            ],
            [
                8227,
                8230
            ],
            [
                8391,
                8396
            ],
            [
                8210,
                8218
            ],
            [
                8409,
                8411
            ],
            [
                8411,
                8493
            ],
            [
                8520,
                8528
            ],
            [
                8551,
                8552
            ],
            [
                8556,
                8558
            ],
            [
                8582,
                8593
            ],
            [
                8565,
                8570
            ],
            [
                8613,
                8637
            ],
            [
                8641,
                8642
            ],
            [
                8710,
                8715
            ],
            [
                8647,
                8664
            ],
            [
                8822,
                8823
            ],
            [
                8864,
                8865
            ],
            [
                8721,
                8726
            ],
            [
                8731,
                8751
            ],
            [
                8860,
                8864
            ],
            [
                8763,
                8773
            ],
            [
                8889,
                8890
            ],
            [
                8828,
                8836
            ],
            [
                8901,
                8905
            ],
            [
                8938,
                8948
            ],
            [
                8824,
                8827
            ],
            [
                8991,
                8993
            ],
            [
                8993,
                9059
            ],
            [
                9073,
                9112
            ],
            [
                9113,
                9116
            ],
            [
                9131,
                9133
            ],
            [
                9148,
                9159
            ],
            [
                9117,
                9120
            ],
            [
                9173,
                9204
            ],
            [
                9209,
                9214
            ],
            [
                9218,
                9284
            ],
            [
                9289,
                9345
            ],
            [
                9357,
                9366
            ],
            [
                9424,
                9436
            ],
            [
                9366,
                9377
            ],
            [
                9437,
                9444
            ],
            [
                9413,
                9414
            ],
            [
                9466,
                9510
            ],
            [
                9525,
                9546
            ],
            [
                9546,
                9568
            ],
            [
                9641,
                9643
            ],
            [
                9680,
                9693
            ],
            [
                9696,
                9727
            ],
            [
                9734,
                9784
            ],
            [
                10111,
                10128
            ],
            [
                10138,
                10207
            ],
            [
                10207,
                10214
            ],
            [
                10218,
                10243
            ],
            [
                10285,
                10286
            ],
            [
                10281,
                10284
            ],
            [
                10287,
                10331
            ],
            [
                10348,
                10471
            ],
            [
                10471,
                10480
            ],
            [
                10505,
                10524
            ],
            [
                10490,
                10500
            ],
            [
                10527,
                10565
            ],
            [
                10565,
                10656
            ],
            [
                10656,
                10658
            ],
            [
                10665,
                10695
            ],
            [
                10725,
                10727
            ],
            [
                10727,
                10761
            ],
            [
                10764,
                10917
            ],
            [
                10920,
                10926
            ],
            [
                10936,
                10970
            ],
            [
                10980,
                11012
            ],
            [
                11012,
                11042
            ],
            [
                11042,
                11049
            ],
            [
                11053,
                11116
            ],
            [
                11116,
                11117
            ],
            [
                11176,
                11240
            ],
            [
                11240,
                11326
            ],
            [
                11326,
                11395
            ],
            [
                11419,
                11531
            ],
            [
                11532,
                11549
            ],
            [
                11558,
                11628
            ],
            [
                11628,
                11682
            ],
            [
                11682,
                11811
            ],
            [
                11820,
                11841
            ],
            [
                11846,
                11852
            ],
            [
                11875,
                11877
            ],
            [
                11877,
                11954
            ],
            [
                11978,
                12007
            ],
            [
                12007,
                12035
            ],
            [
                12037,
                12039
            ],
            [
                12044,
                12049
            ],
            [
                12070,
                12127
            ],
            [
                12155,
                12187
            ],
            [
                12200,
                12274
            ],
            [
                12450,
                12461
            ],
            [
                12487,
                12498
            ],
            [
                12501,
                12549
            ],
            [
                12555,
                12563
            ],
            [
                12563,
                12624
            ],
            [
                12644,
                12652
            ],
            [
                12625,
                12643
            ],
            [
                12653,
                12683
            ],
            [
                12688,
                12695
            ],
            [
                12699,
                12716
            ],
            [
                12716,
                12800
            ],
            [
                12815,
                12823
            ],
            [
                12898,
                12993
            ],
            [
                12995,
                13046
            ],
            [
                13046,
                13099
            ],
            [
                13099,
                13125
            ],
            [
                13183,
                13246
            ],
            [
                13263,
                13270
            ],
            [
                13335,
                13337
            ],
            [
                13337,
                13414
            ],
            [
                13427,
                13447
            ],
            [
                13417,
                13426
            ],
            [
                13450,
                13541
            ],
            [
                13541,
                13608
            ],
            [
                13608,
                13635
            ],
            [
                13635,
                13650
            ],
            [
                13650,
                13797
            ],
            [
                13797,
                13813
            ],
            [
                13871,
                13881
            ],
            [
                13976,
                13985
            ],
            [
                13882,
                13950
            ],
            [
                13985,
                13987
            ],
            [
                13987,
                13997
            ],
            [
                14107,
                14138
            ],
            [
                13999,
                14001
            ],
            [
                14089,
                14092
            ],
            [
                14058,
                14064
            ],
            [
                14180,
                14182
            ],
            [
                14191,
                14201
            ],
            [
                14211,
                14275
            ],
            [
                14418,
                14438
            ],
            [
                14452,
                14558
            ],
            [
                14560,
                14569
            ],
            [
                14571,
                14585
            ],
            [
                14599,
                14616
            ],
            [
                14617,
                14657
            ],
            [
                14731,
                14733
            ],
            [
                14733,
                14837
            ],
            [
                14848,
                14902
            ],
            [
                15065,
                15068
            ],
            [
                15199,
                15209
            ],
            [
                15100,
                15103
            ],
            [
                15063,
                15064
            ],
            [
                14919,
                14921
            ],
            [
                15248,
                15252
            ],
            [
                14940,
                14971
            ],
            [
                15020,
                15022
            ],
            [
                14999,
                15019
            ],
            [
                14979,
                14988
            ],
            [
                15036,
                15063
            ],
            [
                14913,
                14914
            ],
            [
                15109,
                15163
            ],
            [
                15105,
                15108
            ],
            [
                15186,
                15188
            ],
            [
                15194,
                15195
            ],
            [
                15274,
                15288
            ],
            [
                15294,
                15311
            ],
            [
                15333,
                15336
            ],
            [
                15348,
                15372
            ],
            [
                15399,
                15401
            ],
            [
                15465,
                15518
            ],
            [
                15519,
                15599
            ],
            [
                15411,
                15428
            ],
            [
                15600,
                15610
            ],
            [
                15624,
                15664
            ],
            [
                15670,
                15680
            ],
            [
                15682,
                15685
            ],
            [
                15614,
                15617
            ],
            [
                15688,
                15697
            ],
            [
                15704,
                15712
            ],
            [
                15721,
                15751
            ],
            [
                15761,
                15793
            ],
            [
                15909,
                15943
            ],
            [
                16056,
                16058
            ],
            [
                16058,
                16107
            ],
            [
                16108,
                16121
            ],
            [
                16134,
                16175
            ],
            [
                16175,
                16193
            ],
            [
                16209,
                16217
            ],
            [
                16194,
                16208
            ],
            [
                16217,
                16232
            ],
            [
                16242,
                16244
            ],
            [
                16245,
                16256
            ],
            [
                16302,
                16387
            ]
        ],
        "row_chars": [
            [
                0,
                176
            ],
            [
                176,
                313
            ],
            [
                313,
                496
            ],
            [
                496,
                608
            ],
            [
                608,
                917
            ],
            [
                917,
                1055
            ],
            [
                1055,
                1409
            ],
            [
                1409,
                1609
            ],
            [
                1609,
                1836
            ],
            [
                1836,
                1979
            ],
            [
                1979,
                2200
            ],
            [
                2200,
                2502
            ],
            [
                2502,
                2701
            ],
            [
                2701,
                2895
            ],
            [
                2895,
                2966
            ],
            [
                2966,
                3139
            ],
            [
                3139,
                3194
            ],
            [
                3194,
                3405
            ],
            [
                3405,
                3493
            ],
            [
                3493,
                3641
            ],
            [
                3641,
                3691
            ],
            [
                3691,
                3879
            ],
            [
                3879,
                4021
            ],
            [
                4021,
                4220
            ],
            [
                4220,
                4462
            ],
            [
                4462,
                4543
            ],
            [
                4543,
                4705
            ],
            [
                4705,
                4776
            ],
            [
                4776,
                5006
            ],
            [
                5006,
                5244
            ],
            [
                5244,
                5452
            ],
            [
                5452,
                5666
            ],
            [
                5666,
                5898
            ],
            [
                5898,
                5957
            ],
            [
                5957,
                6046
            ],
            [
                6046,
                6411
            ],
            [
                6411,
                6703
            ],
            [
                6703,
                6837
            ],
            [
                6837,
                6932
            ],
            [
                6932,
                6972
            ],
            [
                6972,
                7176
            ],
            [
                7176,
                7200
            ],
            [
                7200,
                7354
            ],
            [
                7354,
                7621
            ],
            [
                7621,
                7692
            ],
            [
                7692,
                7755
            ],
            [
                7755,
                7861
            ],
            [
                7861,
                8054
            ],
            [
                8054,
                8194
            ],
            [
                8194,
                8411
            ],
            [
                8411,
                8643
            ],
            [
                8643,
                8993
            ],
            [
                8993,
                9113
            ],
            [
                9113,
                9366
            ],
            [
                9366,
                9546
            ],
            [
                9546,
                9643
            ],
            [
                9643,
                9680
            ],
            [
                9680,
                9696
            ],
            [
                9696,
                9784
            ],
            [
                9784,
                9866
            ],
            [
                9866,
                9891
            ],
            [
                9891,
                9996
            ],
            [
                9996,
                10111
            ],
            [
                10111,
                10207
            ],
            [
                10207,
                10331
            ],
            [
                10331,
                10471
            ],
            [
                10471,
                10565
            ],
            [
                10565,
                10656
            ],
            [
                10656,
                10727
            ],
            [
                10727,
                11012
            ],
            [
                11012,
                11042
            ],
            [
                11042,
                11116
            ],
            [
                11116,
                11240
            ],
            [
                11240,
                11326
            ],
            [
                11326,
                11532
            ],
            [
                11532,
                11628
            ],
            [
                11628,
                11682
            ],
            [
                11682,
                11811
            ],
            [
                11811,
                11877
            ],
            [
                11877,
                12007
            ],
            [
                12007,
                12274
            ],
            [
                12274,
                12423
            ],
            [
                12423,
                12563
            ],
            [
                12563,
                12716
            ],
            [
                12716,
                12823
            ],
            [
                12823,
                12898
            ],
            [
                12898,
                13046
            ],
            [
                13046,
                13099
            ],
            [
                13099,
                13247
            ],
            [
                13247,
                13337
            ],
            [
                13337,
                13541
            ],
            [
                13541,
                13608
            ],
            [
                13608,
                13635
            ],
            [
                13635,
                13650
            ],
            [
                13650,
                13797
            ],
            [
                13797,
                13987
            ],
            [
                13987,
                14182
            ],
            [
                14182,
                14275
            ],
            [
                14275,
                14418
            ],
            [
                14418,
                14617
            ],
            [
                14617,
                14733
            ],
            [
                14733,
                14902
            ],
            [
                14902,
                15274
            ],
            [
                15274,
                15372
            ],
            [
                15372,
                15600
            ],
            [
                15600,
                15793
            ],
            [
                15793,
                15909
            ],
            [
                15909,
                16058
            ],
            [
                16058,
                16107
            ],
            [
                16107,
                16175
            ],
            [
                16175,
                16244
            ],
            [
                16244,
                16259
            ],
            [
                16259,
                16302
            ],
            [
                16302,
                16387
            ]
        ]
    },
    "abridged": {
        "text": "We will leave Mrs. Greenow with her niece at Yarmouth, and will call upon Mr. Grey at his place in Cambridgeshire. That county has few rural beauties. It is very flat; there are few trees; the rivers are merely dikes; and in much of the county the fields are divided simply by ditches, not by hedgerows. Mr. Grey's residence was in the Isle of Ely, a few miles from the Cathedral town, beside a long straight road which ran through the fields for miles without even a bush to cheer it. The name of his place was Nethercoats, and here he lived throughout the year, and intended to live throughout his life.\nHis father had been a prebendary at Ely Cathedral, and a minister in the neighbourhood, who had built the house in which his son now lived. His wife had lived there for only a few months, dying soon after the birth of their son. After that, the old clergyman had gone back to the Cathedral Close at Ely, and there John Grey grew up under his father's eye. He had taken honours at a Cambridge college, and had then, when his father died, declined a fellowship. His father had left him an income of some fifteen hundred a year, and with this he settled near to his college friends and the old cathedral he loved, in the house which his father had built.\nBut though Nethercoats possessed no beautiful scenery, it was an excellent residence for a country gentleman of small means. I doubt whether prettier rooms were ever seen than the drawing-room, the library, and the dining-room at Nethercoats, which all opened out on to the garden. The library, which was a handsome chamber, was known as one of the best private collections in that part of England.\nBut perhaps the spacious gardens of Nethercoats were its greatest glory. They were excellently tended, and had been laid out wisely. There could be no fine forest trees there; nor could there be a clear rippling stream with steep green banks. But the shrubs were of the rarest kind, and mature enough to be in their full beauty. The fruit-trees were perfect, and the glass-houses extensive. The whole estate, with gardens, lawns and fields, covered about twelve acres.\nMr. Grey had lived there for seven years. He had easy access to Cambridge, and found most of his society in the Close of Ely Cathedral. But he had gradually learned to feel that he wanted a companion in his home.\nHis visits to London had generally been short and far between, to visit libraries or the editor of some periodical. On one of these visits he had met Alice Vavasor, and had resolved to ask her to share his home. He had obtained her promise, and from that moment all his life had been changed.\nAt Nethercoats he now began to surround himself with feminine belongings, and to promise himself an infinity of feminine blessings. He became impatient, longing for the fruition of his new idea of happiness - longing to have that as his own which he certainly loved beyond all else in the world.\nBut he acknowledged that Alice could not be expected to share his impatience. She had her house in London, her town society, and her father; and as the change for her would be much greater than it would be for him, it was natural that she should require some small delay. He had not pressed her. But in truth his impatience was now growing strong, and during her absence in Switzerland, he resolved that a marriage late in the autumn - even in winter - would be better than a marriage postponed till the following year.\nAlice had written to him occasionally from Switzerland, and her first two letters had been very charming. They had described the tour pleasantly, with some slightly coloured account of George Vavasor's idleness, and of Kate's obedience to her brother. Alice had never written much of love in her love-letters, and Grey was contented. He did not doubt her love. He was a man who could never have suggested to himself that a woman loved him till she accepted him; but after that, he could never think that her love would fail.\nAfter those first two letters, however, there seemed to have crept into them an unconscious melancholy, which he soon recognised and thought much about. During the three or four last days of the journey, while they were on their way home, she had not written.\nBut on her arrival she received from Mr. Grey a letter which told her how very much she would add to his happiness if she would agree that their marriage should not be postponed beyond October. She answered this letter at once, in such words that Mr. Grey resolved that he must go to her in London. I will give her letter here.\nDearest John,\nWe reached home yesterday tired, as we came through from Paris without stopping. I got your letter when I came in last night, and I suppose I had better dash at it at once. I would willingly delay doing so, if I did not know that this would be mere cowardice. I won't be a coward, and therefore I will tell you at once that I cannot let you hope that we should be married this year. Of course you have a right to ask me why, and of course I am bound to answer. I do not know that I can give any answer with which you will not have a right to complain. If so, I can only ask your pardon.\nMarriage is a great change in life - much greater to me than to you, who will remain in your old house, will keep your old pursuits, will still be your own master, and will change in nothing - except that you will have a companion who may not be all that you expect. But I must change everything. It will seem to me as though I were passing through a grave to a new world. I must abandon all the ways of life that I have hitherto adopted. Of course I should have thought of this before I accepted you; and I did think of it. I made up my mind that, as I truly loved you, I would risk the change for your sake and for mine, hoping that I might add something to your happiness, and that I might secure my own.\nDear John, do not think that I despair that it may be so; but, indeed, you must not hurry me. I must tune myself to the change that I have to make. What if I should wake some morning after six months living with you, and tell you that the quiet of your home was making me mad?\nDo not ask me again till after winter. If in the meantime I shall find that I have been wrong, I will humbly confess it, and ask you to forgive me. And I will freely admit this: if a delay is so contrary to your own plans as to make your marriage not that which you had expected, you are free to tell me so, and to say that our engagement shall be over. I will obey your wishes in anything - except in that one thing which you urged in your letter.\nKate is going down to Yarmouth with Mrs. Greenow, and I shall probably see no more of her till next year, as she will be in Westmorland after that. George left me at the door when he brought me home, and declared that he intended to leave London. Papa offers to go to Ramsgate for a fortnight, but he looks so wretched when he makes the offer that I shall not have the heart to hold him to it. Lady Macleod very much wants me to go to Cheltenham. I very much want not to go; but it will probably end in my going there for a week or two.\nBeyond that, I shall be at home. There is a project that we shall all eat our Christmas dinner at Vavasor Hall - not including George of course - but this project is quite in the clouds, and, as far as I am concerned, will remain there.\nDear John, let me hear that this letter does not make you unhappy.\nMost affectionately yours,\nAlice Vavasor.\nAt Nethercoats, the post was brought in at breakfast-time, and Mr. Grey was sitting with his tea and eggs before him, when he read Alice's letter. He read it twice, and then carefully referred to one or two others which he had received from Switzerland. After that, with the letters in his hand, he walked out into his garden.\nHe thought that there was more in Alice's mind than a mere wish for delay. He felt that she was unhappy because she distrusted the results of her marriage; but it never for a moment occurred to him that therefore the engagement should be broken.\nIn the first place he loved her too well. He was a constant, firm man, somewhat reserved, and unwilling to make new acquaintances, and, therefore, especially unwilling to break away from those which he had made. Breaking the engagement would have caused him great unhappiness. If he felt that that Alice's happiness demanded it, he would have made the sacrifice without a word of complaint, although the bruise would have remained on his heart, indelible but unseen by others.\nBut it did not occur to him that his breaking the engagement could be beneficial to Alice. He thought of her as of one wounded, and wanting a cure. Some weakness had fallen on her, and strength must be given to her from another. He assumed himself to be the stronger. He did not doubt her love, but he knew that she had associated for the last few weeks with two people whose daily conversation would tend to weaken the tone of her mind. He would go up to town and see her. By that day's post he wrote a short note to her.\nDearest Alice.\nI have resolved to go to London at once. I will be with you at eight in the evening, the day after tomorrow.\nYours, J. G.\n\"And now,\" she said, when she received it, \"I must dare to tell him the whole truth.\"",
        "paragraph_chars": [
            [
                0,
                606
            ],
            [
                606,
                1258
            ],
            [
                1258,
                1657
            ],
            [
                1657,
                2126
            ],
            [
                2126,
                2339
            ],
            [
                2339,
                2632
            ],
            [
                2632,
                2928
            ],
            [
                2928,
                3448
            ],
            [
                3448,
                3973
            ],
            [
                3973,
                4233
            ],
            [
                4233,
                4561
            ],
            [
                4561,
                4575
            ],
            [
                4575,
                5162
            ],
            [
                5162,
                5870
            ],
            [
                5870,
                6147
            ],
            [
                6147,
                6596
            ],
            [
                6596,
                7133
            ],
            [
                7133,
                7370
            ],
            [
                7370,
                7437
            ],
            [
                7437,
                7464
            ],
            [
                7464,
                7479
            ],
            [
                7479,
                7806
            ],
            [
                7806,
                8052
            ],
            [
                8052,
                8529
            ],
            [
                8529,
                9052
            ],
            [
                9052,
                9067
            ],
            [
                9067,
                9176
            ],
            [
                9176,
                9189
            ],
            [
                9189,
                9274
            ]
        ],
        "segment_chars": [
            [
                0,
                115
            ],
            [
                115,
                151
            ],
            [
                151,
                304
            ],
            [
                304,
                486
            ],
            [
                486,
                606
            ],
            [
                606,
                746
            ],
            [
                746,
                835
            ],
            [
                835,
                962
            ],
            [
                962,
                1066
            ],
            [
                1066,
                1258
            ],
            [
                1258,
                1383
            ],
            [
                1383,
                1540
            ],
            [
                1540,
                1657
            ],
            [
                1657,
                1730
            ],
            [
                1730,
                1790
            ],
            [
                1790,
                1900
            ],
            [
                1900,
                1986
            ],
            [
                1986,
                2048
            ],
            [
                2048,
                2126
            ],
            [
                2126,
                2168
            ],
            [
                2168,
                2262
            ],
            [
                2262,
                2339
            ],
            [
                2339,
                2455
            ],
            [
                2455,
                2551
            ],
            [
                2551,
                2632
            ],
            [
                2632,
                2764
            ],
            [
                2764,
                2928
            ],
            [
                2928,
                3006
            ],
            [
                3006,
                3200
            ],
            [
                3200,
                3224
            ],
            [
                3224,
                3448
            ],
            [
                3448,
                3554
            ],
            [
                3554,
                3700
            ],
            [
                3700,
                3782
            ],
            [
                3782,
                3809
            ],
            [
                3809,
                3973
            ],
            [
                3973,
                4126
            ],
            [
                4126,
                4233
            ],
            [
                4233,
                4427
            ],
            [
                4427,
                4532
            ],
            [
                4532,
                4561
            ],
            [
                4561,
                4575
            ],
            [
                4575,
                4656
            ],
            [
                4656,
                4748
            ],
            [
                4748,
                4835
            ],
            [
                4835,
                4958
            ],
            [
                4958,
                5036
            ],
            [
                5036,
                5127
            ],
            [
                5127,
                5162
            ],
            [
                5162,
                5429
            ],
            [
                5429,
                5459
            ],
            [
                5459,
                5535
            ],
            [
                5535,
                5601
            ],
            [
                5601,
                5687
            ],
            [
                5687,
                5870
            ],
            [
                5870,
                5964
            ],
            [
                5964,
                6018
            ],
            [
                6018,
                6147
            ],
            [
                6147,
                6186
            ],
            [
                6186,
                6295
            ],
            [
                6295,
                6501
            ],
            [
                6501,
                6596
            ],
            [
                6596,
                6744
            ],
            [
                6744,
                6843
            ],
            [
                6843,
                6990
            ],
            [
                6990,
                7043
            ],
            [
                7043,
                7133
            ],
            [
                7133,
                7166
            ],
            [
                7166,
                7370
            ],
            [
                7370,
                7437
            ],
            [
                7437,
                7464
            ],
            [
                7464,
                7479
            ],
            [
                7479,
                7626
            ],
            [
                7626,
                7733
            ],
            [
                7733,
                7806
            ],
            [
                7806,
                7881
            ],
            [
                7881,
                8052
            ],
            [
                8052,
                8094
            ],
            [
                8094,
                8264
            ],
            [
                8264,
                8329
            ],
            [
                8329,
                8529
            ],
            [
                8529,
                8620
            ],
            [
                8620,
                8677
            ],
            [
                8677,
                8758
            ],
            [
                8758,
                8797
            ],
            [
                8797,
                8967
            ],
            [
                8967,
                9003
            ],
            [
                9003,
                9052
            ],
            [
                9052,
                9067
            ],
            [
                9067,
                9108
            ],
            [
                9108,
                9176
            ],
            [
                9176,
                9189
            ],
            [
                9189,
                9274
            ]
        ],
        "overlap_chars": [
            [
                0,
                41
            ],
            [
                42,
                58
            ],
            [
                59,
                113
            ],
            [
                113,
                115
            ],
            [
                115,
                119
            ],
            [
                120,
                126
            ],
            [
                135,
                149
            ],
            [
                149,
                151
            ],
            [
                151,
                167
            ],
            [
                187,
                224
            ],
            [
                230,
                247
            ],
            [
                248,
                284
            ],
            [
                286,
                304
            ],
            [
                304,
                324
            ],
            [
                325,
                348
            ],
            [
                349,
                350
            ],
            [
                351,
                360
            ],
            [
                361,
                385
            ],
            [
                393,
                413
            ],
            [
                414,
                486
            ],
            [
                486,
                542
            ],
            [
                543,
                567
            ],
            [
                568,
                606
            ],
            [
                606,
                620
            ],
            [
                621,
                625
            ],
            [
                626,
                635
            ],
            [
                639,
                645
            ],
            [
                655,
                660
            ],
            [
                661,
                662
            ],
            [
                672,
                693
            ],
            [
                698,
                707
            ],
            [
                708,
                746
            ],
            [
                746,
                774
            ],
            [
                775,
                779
            ],
            [
                780,
                792
            ],
            [
                792,
                793
            ],
            [
                800,
                823
            ],
            [
                833,
                835
            ],
            [
                835,
                845
            ],
            [
                845,
                846
            ],
            [
                847,
                881
            ],
            [
                882,
                885
            ],
            [
                896,
                929
            ],
            [
                935,
                960
            ],
            [
                960,
                962
            ],
            [
                962,
                968
            ],
            [
                969,
                974
            ],
            [
                975,
                982
            ],
            [
                983,
                985
            ],
            [
                988,
                997
            ],
            [
                998,
                1005
            ],
            [
                1005,
                1020
            ],
            [
                1026,
                1036
            ],
            [
                1041,
                1051
            ],
            [
                1052,
                1066
            ],
            [
                1066,
                1085
            ],
            [
                1086,
                1148
            ],
            [
                1157,
                1184
            ],
            [
                1189,
                1206
            ],
            [
                1207,
                1258
            ],
            [
                1258,
                1293
            ],
            [
                1304,
                1312
            ],
            [
                1313,
                1319
            ],
            [
                1323,
                1332
            ],
            [
                1333,
                1381
            ],
            [
                1381,
                1383
            ],
            [
                1383,
                1499
            ],
            [
                1499,
                1500
            ],
            [
                1507,
                1538
            ],
            [
                1538,
                1540
            ],
            [
                1540,
                1562
            ],
            [
                1563,
                1582
            ],
            [
                1583,
                1586
            ],
            [
                1587,
                1592
            ],
            [
                1593,
                1656
            ],
            [
                1657,
                1672
            ],
            [
                1682,
                1704
            ],
            [
                1710,
                1730
            ],
            [
                1730,
                1739
            ],
            [
                1740,
                1751
            ],
            [
                1758,
                1772
            ],
            [
                1773,
                1781
            ],
            [
                1788,
                1790
            ],
            [
                1790,
                1795
            ],
            [
                1808,
                1812
            ],
            [
                1813,
                1831
            ],
            [
                1833,
                1898
            ],
            [
                1898,
                1900
            ],
            [
                1900,
                1914
            ],
            [
                1915,
                1943
            ],
            [
                1951,
                1957
            ],
            [
                1958,
                1960
            ],
            [
                1964,
                1972
            ],
            [
                1978,
                1986
            ],
            [
                1986,
                2014
            ],
            [
                2014,
                2036
            ],
            [
                2037,
                2046
            ],
            [
                2046,
                2047
            ],
            [
                2048,
                2064
            ],
            [
                2064,
                2065
            ],
            [
                2086,
                2089
            ],
            [
                2098,
                2126
            ],
            [
                2128,
                2138
            ],
            [
                2145,
                2154
            ],
            [
                2155,
                2166
            ],
            [
                2166,
                2168
            ],
            [
                2168,
                2174
            ],
            [
                2175,
                2199
            ],
            [
                2199,
                2200
            ],
            [
                2201,
                2204
            ],
            [
                2205,
                2262
            ],
            [
                2262,
                2265
            ],
            [
                2266,
                2306
            ],
            [
                2307,
                2339
            ],
            [
                2339,
                2401
            ],
            [
                2421,
                2423
            ],
            [
                2424,
                2434
            ],
            [
                2435,
                2442
            ],
            [
                2443,
                2455
            ],
            [
                2458,
                2511
            ],
            [
                2512,
                2520
            ],
            [
                2521,
                2523
            ],
            [
                2524,
                2531
            ],
            [
                2532,
                2549
            ],
            [
                2549,
                2551
            ],
            [
                2551,
                2630
            ],
            [
                2630,
                2631
            ],
            [
                2632,
                2646
            ],
            [
                2647,
                2649
            ],
            [
                2650,
                2653
            ],
            [
                2654,
                2684
            ],
            [
                2685,
                2762
            ],
            [
                2762,
                2764
            ],
            [
                2764,
                2838
            ],
            [
                2849,
                2926
            ],
            [
                2926,
                2927
            ],
            [
                2928,
                2931
            ],
            [
                2932,
                2947
            ],
            [
                2948,
                2989
            ],
            [
                2990,
                2993
            ],
            [
                2994,
                3004
            ],
            [
                3004,
                3006
            ],
            [
                3006,
                3067
            ],
            [
                3069,
                3072
            ],
            [
                3073,
                3200
            ],
            [
                3200,
                3224
            ],
            [
                3224,
                3259
            ],
            [
                3268,
                3286
            ],
            [
                3291,
                3313
            ],
            [
                3313,
                3342
            ],
            [
                3343,
                3361
            ],
            [
                3364,
                3378
            ],
            [
                3381,
                3447
            ],
            [
                3448,
                3554
            ],
            [
                3554,
                3562
            ],
            [
                3573,
                3581
            ],
            [
                3592,
                3593
            ],
            [
                3594,
                3698
            ],
            [
                3698,
                3700
            ],
            [
                3700,
                3770
            ],
            [
                3771,
                3778
            ],
            [
                3778,
                3782
            ],
            [
                3782,
                3784
            ],
            [
                3789,
                3792
            ],
            [
                3793,
                3798
            ],
            [
                3799,
                3807
            ],
            [
                3807,
                3809
            ],
            [
                3809,
                3891
            ],
            [
                3905,
                3913
            ],
            [
                3924,
                3925
            ],
            [
                3926,
                3928
            ],
            [
                3929,
                3940
            ],
            [
                3941,
                3946
            ],
            [
                3947,
                3971
            ],
            [
                3971,
                3972
            ],
            [
                3973,
                3978
            ],
            [
                3985,
                4002
            ],
            [
                4002,
                4003
            ],
            [
                4011,
                4012
            ],
            [
                4013,
                4018
            ],
            [
                4019,
                4039
            ],
            [
                4045,
                4049
            ],
            [
                4065,
                4075
            ],
            [
                4075,
                4076
            ],
            [
                4077,
                4085
            ],
            [
                4086,
                4090
            ],
            [
                4091,
                4101
            ],
            [
                4102,
                4105
            ],
            [
                4124,
                4126
            ],
            [
                4126,
                4192
            ],
            [
                4193,
                4232
            ],
            [
                4233,
                4236
            ],
            [
                4237,
                4239
            ],
            [
                4240,
                4251
            ],
            [
                4252,
                4255
            ],
            [
                4256,
                4287
            ],
            [
                4288,
                4293
            ],
            [
                4294,
                4360
            ],
            [
                4361,
                4417
            ],
            [
                4418,
                4427
            ],
            [
                4427,
                4439
            ],
            [
                4440,
                4451
            ],
            [
                4452,
                4459
            ],
            [
                4459,
                4460
            ],
            [
                4461,
                4505
            ],
            [
                4511,
                4532
            ],
            [
                4532,
                4554
            ],
            [
                4559,
                4561
            ],
            [
                4561,
                4574
            ],
            [
                4575,
                4606
            ],
            [
                4606,
                4656
            ],
            [
                4656,
                4673
            ],
            [
                4679,
                4748
            ],
            [
                4748,
                4755
            ],
            [
                4756,
                4781
            ],
            [
                4785,
                4786
            ],
            [
                4787,
                4790
            ],
            [
                4791,
                4835
            ],
            [
                4835,
                4958
            ],
            [
                4958,
                4967
            ],
            [
                4968,
                4987
            ],
            [
                4988,
                4998
            ],
            [
                4998,
                5036
            ],
            [
                5036,
                5127
            ],
            [
                5127,
                5129
            ],
            [
                5130,
                5160
            ],
            [
                5160,
                5162
            ],
            [
                5162,
                5196
            ],
            [
                5199,
                5352
            ],
            [
                5355,
                5361
            ],
            [
                5362,
                5396
            ],
            [
                5397,
                5429
            ],
            [
                5429,
                5459
            ],
            [
                5459,
                5466
            ],
            [
                5472,
                5535
            ],
            [
                5535,
                5536
            ],
            [
                5537,
                5601
            ],
            [
                5601,
                5687
            ],
            [
                5687,
                5756
            ],
            [
                5757,
                5869
            ],
            [
                5870,
                5887
            ],
            [
                5894,
                5964
            ],
            [
                5964,
                6018
            ],
            [
                6018,
                6147
            ],
            [
                6150,
                6171
            ],
            [
                6178,
                6184
            ],
            [
                6184,
                6186
            ],
            [
                6186,
                6263
            ],
            [
                6266,
                6295
            ],
            [
                6295,
                6323
            ],
            [
                6325,
                6327
            ],
            [
                6330,
                6335
            ],
            [
                6336,
                6393
            ],
            [
                6394,
                6426
            ],
            [
                6427,
                6501
            ],
            [
                6501,
                6512
            ],
            [
                6525,
                6536
            ],
            [
                6539,
                6587
            ],
            [
                6588,
                6596
            ],
            [
                6596,
                6657
            ],
            [
                6658,
                6666
            ],
            [
                6667,
                6685
            ],
            [
                6686,
                6716
            ],
            [
                6717,
                6724
            ],
            [
                6727,
                6744
            ],
            [
                6744,
                6828
            ],
            [
                6835,
                6843
            ],
            [
                6843,
                6938
            ],
            [
                6939,
                6990
            ],
            [
                6990,
                7043
            ],
            [
                7043,
                7069
            ],
            [
                7069,
                7132
            ],
            [
                7140,
                7147
            ],
            [
                7164,
                7166
            ],
            [
                7166,
                7243
            ],
            [
                7246,
                7266
            ],
            [
                7267,
                7276
            ],
            [
                7279,
                7370
            ],
            [
                7370,
                7437
            ],
            [
                7437,
                7464
            ],
            [
                7464,
                7479
            ],
            [
                7479,
                7626
            ],
            [
                7626,
                7642
            ],
            [
                7642,
                7652
            ],
            [
                7653,
                7662
            ],
            [
                7663,
                7731
            ],
            [
                7731,
                7733
            ],
            [
                7733,
                7743
            ],
            [
                7743,
                7774
            ],
            [
                7775,
                7777
            ],
            [
                7794,
                7797
            ],
            [
                7798,
                7804
            ],
            [
                7804,
                7806
            ],
            [
                7806,
                7816
            ],
            [
                7817,
                7881
            ],
            [
                7881,
                7901
            ],
            [
                7902,
                8008
            ],
            [
                8009,
                8018
            ],
            [
                8019,
                8033
            ],
            [
                8034,
                8051
            ],
            [
                8052,
                8092
            ],
            [
                8092,
                8094
            ],
            [
                8094,
                8198
            ],
            [
                8210,
                8264
            ],
            [
                8273,
                8276
            ],
            [
                8288,
                8298
            ],
            [
                8306,
                8309
            ],
            [
                8327,
                8328
            ],
            [
                8332,
                8334
            ],
            [
                8340,
                8344
            ],
            [
                8345,
                8376
            ],
            [
                8377,
                8379
            ],
            [
                8379,
                8399
            ],
            [
                8404,
                8413
            ],
            [
                8414,
                8441
            ],
            [
                8441,
                8442
            ],
            [
                8452,
                8506
            ],
            [
                8507,
                8510
            ],
            [
                8518,
                8520
            ],
            [
                8527,
                8528
            ],
            [
                8529,
                8543
            ],
            [
                8544,
                8561
            ],
            [
                8562,
                8565
            ],
            [
                8596,
                8620
            ],
            [
                8620,
                8622
            ],
            [
                8623,
                8676
            ],
            [
                8677,
                8757
            ],
            [
                8769,
                8786
            ],
            [
                8797,
                8807
            ],
            [
                8808,
                8848
            ],
            [
                8849,
                8859
            ],
            [
                8860,
                8863
            ],
            [
                8864,
                8867
            ],
            [
                8873,
                8882
            ],
            [
                8883,
                8891
            ],
            [
                8899,
                8929
            ],
            [
                8935,
                8967
            ],
            [
                8967,
                9001
            ],
            [
                9001,
                9003
            ],
            [
                9003,
                9052
            ],
            [
                9052,
                9065
            ],
            [
                9067,
                9108
            ],
            [
                9108,
                9126
            ],
            [
                9127,
                9135
            ],
            [
                9136,
                9150
            ],
            [
                9150,
                9165
            ],
            [
                9174,
                9176
            ],
            [
                9176,
                9187
            ],
            [
                9189,
                9274
            ]
        ],
        "row_chars": [
            [
                0,
                115
            ],
            [
                115,
                151
            ],
            [
                151,
                304
            ],
            [
                304,
                304
            ],
            [
                304,
                486
            ],
            [
                486,
                606
            ],
            [
                606,
                746
            ],
            [
                746,
                835
            ],
            [
                835,
                962
            ],
            [
                962,
                1066
            ],
            [
                1066,
                1258
            ],
            [
                1258,
                1383
            ],
            [
                1383,
                1540
            ],
            [
                1540,
                1657
            ],
            [
                1657,
                1730
            ],
            [
                1730,
                1790
            ],
            [
                1790,
                1790
            ],
            [
                1790,
                1900
            ],
            [
                1900,
                1900
            ],
            [
                1900,
                1986
            ],
            [
                1986,
                1986
            ],
            [
                1986,
                2048
            ],
            [
                2048,
                2048
            ],
            [
                2048,
                2048
            ],
            [
                2048,
                2048
            ],
            [
                2048,
                2048
            ],
            [
                2048,
                2048
            ],
            [
                2048,
                2126
            ],
            [
                2126,
                2168
            ],
            [
                2168,
                2262
            ],
            [
                2262,
                2339
            ],
            [
                2339,
                2455
            ],
            [
                2455,
                2551
            ],
            [
                2551,
                2551
            ],
            [
                2551,
                2632
            ],
            [
                2632,
                2764
            ],
            [
                2764,
                2928
            ],
            [
                2928,
                3006
            ],
            [
                3006,
                3006
            ],
            [
                3006,
                3006
            ],
            [
                3006,
                3200
            ],
            [
                3200,
                3224
            ],
            [
                3224,
                3224
            ],
            [
                3224,
                3448
            ],
            [
                3448,
                3448
            ],
            [
                3448,
                3448
            ],
            [
                3448,
                3554
            ],
            [
                3554,
                3700
            ],
            [
                3700,
                3782
            ],
            [
                3782,
                3809
            ],
            [
                3809,
                3973
            ],
            [
                3973,
                4126
            ],
            [
                4126,
                4233
            ],
            [
                4233,
                4427
            ],
            [
                4427,
                4532
            ],
            [
                4532,
                4561
            ],
            [
                4561,
                4561
            ],
            [
                4561,
                4575
            ],
            [
                4575,
                4656
            ],
            [
                4656,
                4656
            ],
            [
                4656,
                4656
            ],
            [
                4656,
                4656
            ],
            [
                4656,
                4656
            ],
            [
                4656,
                4748
            ],
            [
                4748,
                4835
            ],
            [
                4835,
                4958
            ],
            [
                4958,
                5036
            ],
            [
                5036,
                5127
            ],
            [
                5127,
                5162
            ],
            [
                5162,
                5429
            ],
            [
                5429,
                5459
            ],
            [
                5459,
                5535
            ],
            [
                5535,
                5601
            ],
            [
                5601,
                5687
            ],
            [
                5687,
                5870
            ],
            [
                5870,
                5964
            ],
            [
                5964,
                6018
            ],
            [
                6018,
                6147
            ],
            [
                6147,
                6186
            ],
            [
                6186,
                6295
            ],
            [
                6295,
                6501
            ],
            [
                6501,
                6501
            ],
            [
                6501,
                6596
            ],
            [
                6596,
                6744
            ],
            [
                6744,
                6843
            ],
            [
                6843,
                6843
            ],
            [
                6843,
                6990
            ],
            [
                6990,
                7043
            ],
            [
                7043,
                7133
            ],
            [
                7133,
                7166
            ],
            [
                7166,
                7370
            ],
            [
                7370,
                7437
            ],
            [
                7437,
                7464
            ],
            [
                7464,
                7479
            ],
            [
                7479,
                7626
            ],
            [
                7626,
                7733
            ],
            [
                7733,
                7806
            ],
            [
                7806,
                7881
            ],
            [
                7881,
                7881
            ],
            [
                7881,
                8052
            ],
            [
                8052,
                8094
            ],
            [
                8094,
                8264
            ],
            [
                8264,
                8529
            ],
            [
                8529,
                8620
            ],
            [
                8620,
                8797
            ],
            [
                8797,
                8967
            ],
            [
                8967,
                8967
            ],
            [
                8967,
                9003
            ],
            [
                9003,
                9052
            ],
            [
                9052,
                9108
            ],
            [
                9108,
                9176
            ],
            [
                9176,
                9189
            ],
            [
                9189,
                9189
            ],
            [
                9189,
                9274
            ]
        ]
    }
}