{
    "original": {
        "text": "Of late years an abundant shower of curates has fallen upon the north of England: they lie very thick on the hills; every parish has one or more of them; they are young enough to be very active, and ought to be doing a great deal of good. But not of late years are we about to speak; we are going back to the beginning of this century: late years--present years are dusty, sunburnt, hot, arid; we will evade the noon, forget it in siesta, pass the midday in slumber, and dream of dawn.\nIf you think, from this prelude, that anything like a romance is preparing for you, reader, you never were more mistaken. Do you anticipate sentiment, and poetry, and reverie? Do you expect passion, and stimulus, and melodrama? Calm your expectations; reduce them to a lowly standard. Something real, cool, and solid lies before you; something unromantic as Monday morning, when all who have work wake with the consciousness that they must rise and betake themselves thereto. It is not positively affirmed that you shall not have a taste of the exciting, perhaps towards the middle and close of the meal, but it is resolved that the first dish set upon the table shall be one that a Catholic--ay, even an Anglo-Catholic--might eat on Good Friday in Passion Week: it shall be cold lentils and vinegar without oil; it shall be unleavened bread with bitter herbs, and no roast lamb.\nOf late years, I say, an abundant shower of curates has fallen upon the north of England; but in eighteen-hundred-eleven-twelve that affluent rain had not descended. Curates were scarce then: there was no Pastoral Aid--no Additional Curates' Society to stretch a helping hand to worn-out old rectors and incumbents, and give them the wherewithal to pay a vigorous young colleague from Oxford or Cambridge. The present successors of the apostles, disciples of Dr. Pusey and tools of the Propaganda, were at that time being hatched under cradle-blankets, or undergoing regeneration by nursery-baptism in wash-hand basins. You could not have guessed by looking at any one of them that the Italian-ironed double frills of its net-cap surrounded the brows of a preordained, specially-sanctified successor of St. Paul, St. Peter, or St. John; nor could you have foreseen in the folds of its long night-gown the white surplice in which it was hereafter cruelly to exercise the souls of its parishioners, and strangely to nonplus its old-fashioned vicar by flourishing aloft in a pulpit the shirt-like raiment which had never before waved higher than the reading-desk.\nYet even in those days of scarcity there were curates: the precious plant was rare, but it might be found. A certain favoured district in the West Riding of Yorkshire could boast three rods of Aaron blossoming within a circuit of twenty miles. You shall see them, reader. Step into this neat garden-house on the skirts of Whinbury, walk forward into the little parlour. There they are at dinner. Allow me to introduce them to you: Mr. Donne, curate of Whinbury; Mr. Malone, curate of Briarfield; Mr. Sweeting, curate of Nunnely. These are Mr. Donne's lodgings, being the habitation of one John Gale, a small clothier. Mr. Donne has kindly invited his brethren to regale with him. You and I will join the party, see what is to be seen, and hear what is to be heard. At present, however, they are only eating; and while they eat we will talk aside.\nThese gentlemen are in the bloom of youth; they possess all the activity of that interesting age--an activity which their moping old vicars would fain turn into the channel of their pastoral duties, often expressing a wish to see it expended in a diligent superintendence of the schools, and in frequent visits to the sick of their respective parishes. But the youthful Levites feel this to be dull work; they prefer lavishing their energies on a course of proceeding which, though to other eyes it appear more heavy with _ennui_, more cursed with monotony, than the toil of the weaver at his loom, seems to yield them an unfailing supply of enjoyment and occupation.\nI allude to a rushing backwards and forwards, amongst themselves, to and from their respective lodgings--not a round, but a triangle of visits, which they keep up all the year through, in winter, spring, summer, and autumn. Season and weather make no difference; with unintelligible zeal they dare snow and hail, wind and rain, mire and dust, to go and dine, or drink tea, or sup with each other. What attracts them it would be difficult to say. It is not friendship, for whenever they meet they quarrel. It is not religion--the thing is never named amongst them; theology they may discuss occasionally, but piety--never. It is not the love of eating and drinking: each might have as good a joint and pudding, tea as potent, and toast as succulent, at his own lodgings, as is served to him at his brother's. Mrs. Gale, Mrs. Hogg, and Mrs. Whipp--their respective landladies--affirm that \"it is just for naught else but to give folk trouble.\" By \"folk\" the good ladies of course mean themselves, for indeed they are kept in a continual \"fry\" by this system of mutual invasion.\nMr. Donne and his guests, as I have said, are at dinner; Mrs. Gale waits on them, but a spark of the hot kitchen fire is in her eye. She considers that the privilege of inviting a friend to a meal occasionally, without additional charge (a privilege included in the terms on which she lets her lodgings), has been quite sufficiently exercised of late. The present week is yet but at Thursday, and on Monday Mr. Malone, the curate of Briarfield, came to breakfast and stayed dinner; on Tuesday Mr. Malone and Mr. Sweeting of Nunnely came to tea, remained to supper, occupied the spare bed, and favoured her with their company to breakfast on Wednesday morning; now, on Thursday, they are both here at dinner, and she is almost certain they will stay all night. \"C'en est trop,\" she would say, if she could speak French.\nMr. Sweeting is mincing the slice of roast beef on his plate, and complaining that it is very tough; Mr. Donne says the beer is flat. Ay, that is the worst of it: if they would only be civil Mrs. Gale wouldn't mind it so much, if they would only seem satisfied with what they get she wouldn't care; but \"these young parsons is so high and so scornful, they set everybody beneath their 'fit.' They treat her with less than civility, just because she doesn't keep a servant, but does the work of the house herself, as her mother did afore her; then they are always speaking against Yorkshire ways and Yorkshire folk,\" and by that very token Mrs. Gale does not believe one of them to be a real gentleman, or come of gentle kin. \"The old parsons is worth the whole lump of college lads; they know what belongs to good manners, and is kind to high and low.\"\n\"More bread!\" cries Mr. Malone, in a tone which, though prolonged but to utter two syllables, proclaims him at once a native of the land of shamrocks and potatoes. Mrs. Gale hates Mr. Malone more than either of the other two; but she fears him also, for he is a tall, strongly-built personage, with real Irish legs and arms, and a face as genuinely national--not the Milesian face, not Daniel O'Connell's style, but the high-featured, North-American-Indian sort of visage, which belongs to a certain class of the Irish gentry, and has a petrified and proud look, better suited to the owner of an estate of slaves than to the landlord of a free peasantry. Mr. Malone's father termed himself a gentleman: he was poor and in debt, and besottedly arrogant; and his son was like him.\nMrs. Gale offered the loaf.\n\"Cut it, woman,\" said her guest; and the \"woman\" cut it accordingly. Had she followed her inclinations, she would have cut the parson also; her Yorkshire soul revolted absolutely from his manner of command.\nThe curates had good appetites, and though the beef was \"tough,\" they ate a great deal of it. They swallowed, too, a tolerable allowance of the \"flat beer,\" while a dish of Yorkshire pudding, and two tureens of vegetables, disappeared like leaves before locusts. The cheese, too, received distinguished marks of their attention; and a \"spice-cake,\" which followed by way of dessert, vanished like a vision, and was no more found. Its elegy was chanted in the kitchen by Abraham, Mrs. Gale's son and heir, a youth of six summers; he had reckoned upon the reversion thereof, and when his mother brought down the empty platter, he lifted up his voice and wept sore.\nThe curates, meantime, sat and sipped their wine, a liquor of unpretending vintage, moderately enjoyed. Mr. Malone, indeed, would much rather have had whisky; but Mr. Donne, being an Englishman, did not keep the beverage. While they sipped they argued, not on politics, nor on philosophy, nor on literature--these topics were now, as ever, totally without interest for them--not even on theology, practical or doctrinal, but on minute points of ecclesiastical discipline, frivolities which seemed empty as bubbles to all save themselves. Mr. Malone, who contrived to secure two glasses of wine, when his brethren contented themselves with one, waxed by degrees hilarious after his fashion; that is, he grew a little insolent, said rude things in a hectoring tone, and laughed clamorously at his own brilliancy.\nEach of his companions became in turn his butt. Malone had a stock of jokes at their service, which he was accustomed to serve out regularly on convivial occasions like the present, seldom varying his wit; for which, indeed, there was no necessity, as he never appeared to consider himself monotonous, and did not at all care what others thought. Mr. Donne he favoured with hints about his extreme meagreness, allusions to his turned-up nose, cutting sarcasms on a certain threadbare chocolate surtout which that gentleman was accustomed to sport whenever it rained or seemed likely to rain, and criticisms on a choice set of cockney phrases and modes of pronunciation, Mr. Donne's own property, and certainly deserving of remark for the elegance and finish they communicated to his style.\nMr. Sweeting was bantered about his stature--he was a little man, a mere boy in height and breadth compared with the athletic Malone; rallied on his musical accomplishments--he played the flute and sang hymns like a seraph, some young ladies of his parish thought; sneered at as \"the ladies' pet;\" teased about his mamma and sisters, for whom poor Mr. Sweeting had some lingering regard, and of whom he was foolish enough now and then to speak in the presence of the priestly Paddy, from whose anatomy the bowels of natural affection had somehow been omitted.\nThe victims met these attacks each in his own way: Mr. Donne with a stilted self-complacency and half-sullen phlegm, the sole props of his otherwise somewhat rickety dignity; Mr. Sweeting with the indifference of a light, easy disposition, which never professed to have any dignity to maintain.\nWhen Malone's raillery became rather too offensive, which it soon did, they joined, in an attempt to turn the tables on him by asking him how many boys had shouted \"Irish Peter!\" after him as he came along the road that day (Malone's name was Peter--the Rev. Peter Augustus Malone); requesting to be informed whether it was the mode in Ireland for clergymen to carry loaded pistols in their pockets, and a shillelah in their hands, when they made pastoral visits; inquiring the signification of such words as vele, firrum, hellum, storrum (so Mr. Malone invariably pronounced veil, firm, helm, storm), and employing such other methods of retaliation as the innate refinement of their minds suggested.\nThis, of course, would not do. Malone, being neither good-natured nor phlegmatic, was presently in a towering passion. He vociferated, gesticulated; Donne and Sweeting laughed. He reviled them as Saxons and snobs at the very top pitch of his high Celtic voice; they taunted him with being the native of a conquered land. He menaced rebellion in the name of his \"counthry,\" vented bitter hatred against English rule; they spoke of rags, beggary, and pestilence. The little parlour was in an uproar; you would have thought a duel must follow such virulent abuse; it seemed a wonder that Mr. and Mrs. Gale did not take alarm at the noise, and send for a constable to keep the peace. But they were accustomed to such demonstrations; they well knew that the curates never dined or took tea together without a little exercise of the sort, and were quite easy as to consequences, knowing that these clerical quarrels were as harmless as they were noisy, that they resulted in nothing, and that, on whatever terms the curates might part to-night, they would be sure to meet the best friends in the world to-morrow morning.\nAs the worthy pair were sitting by their kitchen fire, listening to the repeated and sonorous contact of Malone's fist with the mahogany plane of the parlour table, and to the consequent start and jingle of decanters and glasses following each assault, to the mocking laughter of the allied English disputants, and the stuttering declamation of the isolated Hibernian--as they thus sat, a foot was heard on the outer door-step, and the knocker quivered to a sharp appeal.\nMr. Gale went and opened.\n\"Whom have you upstairs in the parlour?\" asked a voice--a rather remarkable voice, nasal in tone, abrupt in utterance.\n\"O Mr. Helstone, is it you, sir? I could hardly see you for the darkness; it is so soon dark now. Will you walk in, sir?\"\n\"I want to know first whether it is worth my while walking in. Whom have you upstairs?\"\n\"The curates, sir.\"\n\"What! all of them?\"\n\"Yes, sir.\"\n\"Been dining here?\"\n\"Yes, sir.\"\n\"That will do.\"\nWith these words a person entered--a middle-aged man, in black. He walked straight across the kitchen to an inner door, opened it, inclined his head forward, and stood listening. There was something to listen to, for the noise above was just then louder than ever.\n\"Hey!\" he ejaculated to himself; then turning to Mr. Gale--\"Have you often this sort of work?\"\nMr. Gale had been a churchwarden, and was indulgent to the clergy.\n\"They're young, you know, sir--they're young,\" said he deprecatingly.\n\"Young! They want caning. Bad boys--bad boys! And if you were a Dissenter, John Gale, instead of being a good Churchman, they'd do the like--they'd expose themselves; but I'll----\"\nBy way of finish to this sentence, he passed through the inner door, drew it after him, and mounted the stair. Again he listened a few minutes when he arrived at the upper room. Making entrance without warning, he stood before the curates.\nAnd they were silent; they were transfixed; and so was the invader. He--a personage short of stature, but straight of port, and bearing on broad shoulders a hawk's head, beak, and eye, the whole surmounted by a Rehoboam, or shovel hat, which he did not seem to think it necessary to lift or remove before the presence in which he then stood--_he_ folded his arms on his chest and surveyed his young friends, if friends they were, much at his leisure.\n\"What!\" he began, delivering his words in a voice no longer nasal, but deep--more than deep--a voice made purposely hollow and cavernous--\"what! has the miracle of Pentecost been renewed? Have the cloven tongues come down again? Where are they? The sound filled the whole house just now. I heard the seventeen languages in full action: Parthians, and Medes, and Elamites, the dwellers in Mesopotamia, and in Judea, and Cappadocia, in Pontus and Asia, Phrygia and Pamphylia, in Egypt and in the parts of Libya about Cyrene, strangers of Rome, Jews and proselytes, Cretes and Arabians; every one of these must have had its representative in this room two minutes since.\"\n\"I beg your pardon, Mr. Helstone,\" began Mr. Donne; \"take a seat, pray, sir. Have a glass of wine?\"\nHis civilities received no answer. The falcon in the black coat proceeded,--\n\"What do I talk about the gift of tongues? Gift, indeed! I mistook the chapter, and book, and Testament--gospel for law, Acts for Genesis, the city of Jerusalem for the plain of Shinar. It was no gift but the confusion of tongues which has gabbled me deaf as a post. _You_, apostles? What! you three? Certainly not; three presumptuous Babylonish masons--neither more nor less!\"\n\"I assure you, sir, we were only having a little chat together over a glass of wine after a friendly dinner--settling the Dissenters!\"\n\"Oh! settling the Dissenters, were you? Was Malone settling the Dissenters? It sounded to me much more like settling his co-apostles. You were quarrelling together, making almost as much noise--you three alone--as Moses Barraclough, the preaching tailor, and all his hearers are making in the Methodist chapel down yonder, where they are in the thick of a revival. I know whose fault it is.--It is yours, Malone.\"\n\"Mine, sir?\"\n\"Yours, sir. Donne and Sweeting were quiet before you came, and would be quiet if you were gone. I wish, when you crossed the Channel, you had left your Irish habits behind you. Dublin student ways won't do here. The proceedings which might pass unnoticed in a wild bog and mountain district in Connaught will, in a decent English parish, bring disgrace on those who indulge in them, and, what is far worse, on the sacred institution of which they are merely the humble appendages.\"\nThere was a certain dignity in the little elderly gentleman's manner of rebuking these youths, though it was not, perhaps, quite the dignity most appropriate to the occasion. Mr. Helstone, standing straight as a ramrod, looking keen as a kite, presented, despite his clerical hat, black coat, and gaiters, more the air of a veteran officer chiding his subalterns than of a venerable priest exhorting his sons in the faith. Gospel mildness, apostolic benignity, never seemed to have breathed their influence over that keen brown visage, but firmness had fixed the features, and sagacity had carved her own lines about them.\n\"I met Supplehough,\" he continued, \"plodding through the mud this wet night, going to preach at Milldean opposition shop. As I told you, I heard Barraclough bellowing in the midst of a conventicle like a possessed bull; and I find _you_, gentlemen, tarrying over your half-pint of muddy port wine, and scolding like angry old women. No wonder Supplehough should have dipped sixteen adult converts in a day--which he did a fortnight since; no wonder Barraclough, scamp and hypocrite as he is, should attract all the weaver-girls in their flowers and ribbons, to witness how much harder are his knuckles than the wooden brim of his tub; as little wonder that _you_, when you are left to yourselves, without your rectors--myself, and Hall, and Boultby--to back you, should too often perform the holy service of our church to bare walls, and read your bit of a dry discourse to the clerk, and the organist, and the beadle. But enough of the subject. I came to see Malone.--I have an errand unto thee, O captain!\"\n\"What is it?\" inquired Malone discontentedly. \"There can be no funeral to take at this time of day.\"\n\"Have you any arms about you?\"\n\"Arms, sir?--yes, and legs.\" And he advanced the mighty members.\n\"Bah! weapons I mean.\"\n\"I have the pistols you gave me yourself. I never part with them. I lay them ready cocked on a chair by my bedside at night. I have my blackthorn.\"\n\"Very good. Will you go to Hollow's Mill?\"\n\"What is stirring at Hollow's Mill?\"\n\"Nothing as yet, nor perhaps will be; but Moore is alone there. He has sent all the workmen he can trust to Stilbro'; there are only two women left about the place. It would be a nice opportunity for any of his well-wishers to pay him a visit, if they knew how straight the path was made before them.\"\n\"I am none of his well-wishers, sir. I don't care for him.\"\n\"Soh! Malone, you are afraid.\"\n\"You know me better than that. If I really thought there was a chance of a row I would go: but Moore is a strange, shy man, whom I never pretend to understand; and for the sake of his sweet company only I would not stir a step.\"\n\"But there _is_ a chance of a row; if a positive riot does not take place--of which, indeed, I see no signs--yet it is unlikely this night will pass quite tranquilly. You know Moore has resolved to have new machinery, and he expects two wagon-loads of frames and shears from Stilbro' this evening. Scott, the overlooker, and a few picked men are gone to fetch them.\"\n\"They will bring them in safely and quietly enough, sir.\"\n\"Moore says so, and affirms he wants nobody. Some one, however, he must have, if it were only to bear evidence in case anything should happen. I call him very careless. He sits in the counting-house with the shutters unclosed; he goes out here and there after dark, wanders right up the hollow, down Fieldhead Lane, among the plantations, just as if he were the darling of the neighbourhood, or--being, as he is, its detestation--bore a 'charmed life,' as they say in tale-books. He takes no warning from the fate of Pearson, nor from that of Armitage--shot, one in his own house and the other on the moor.\"\n\"But he should take warning, sir, and use precautions too,\" interposed Mr. Sweeting; \"and I think he would if he heard what I heard the other day.\"\n\"What did you hear, Davy?\"\n\"You know Mike Hartley, sir?\"\n\"The Antinomian weaver? Yes.\"\n\"When Mike has been drinking for a few weeks together, he generally winds up by a visit to Nunnely vicarage, to tell Mr. Hall a piece of his mind about his sermons, to denounce the horrible tendency of his doctrine of works, and warn him that he and all his hearers are sitting in outer darkness.\"\n\"Well, that has nothing to do with Moore.\"\n\"Besides being an Antinomian, he is a violent Jacobin and leveller, sir.\"\n\"I know. When he is very drunk, his mind is always running on regicide. Mike is not unacquainted with history, and it is rich to hear him going over the list of tyrants of whom, as he says, 'the revenger of blood has obtained satisfaction.' The fellow exults strangely in murder done on crowned heads or on any head for political reasons. I have already heard it hinted that he seems to have a queer hankering after Moore. Is that what you allude to, Sweeting?\"\n\"You use the proper term, sir. Mr. Hall thinks Mike has no personal hatred of Moore. Mike says he even likes to talk to him and run after him, but he has a _hankering_ that Moore should be made an example of. He was extolling him to Mr. Hall the other day as the mill-owner with the most brains in Yorkshire, and for that reason he affirms Moore should be chosen as a sacrifice, an oblation of a sweet savour. Is Mike Hartley in his right mind, do you think, sir?\" inquired Sweeting simply.\n\"Can't tell, Davy. He may be crazed, or he may be only crafty, or perhaps a little of both.\"\n\"He talks of seeing visions, sir.\"\n\"Ay! He is a very Ezekiel or Daniel for visions. He came just when I was going to bed last Friday night to describe one that had been revealed to him in Nunnely Park that very afternoon.\"\n\"Tell it, sir. What was it?\" urged Sweeting.\n\"Davy, thou hast an enormous organ of wonder in thy cranium. Malone, you see, has none. Neither murders nor visions interest him. See what a big vacant Saph he looks at this moment.\"\n\"Saph! Who was Saph, sir?\"\n\"I thought you would not know. You may find it out. It is biblical. I know nothing more of him than his name and race; but from a boy upwards I have always attached a personality to Saph. Depend on it he was honest, heavy, and luckless. He met his end at Gob by the hand of Sibbechai.\"\n\"But the vision, sir?\"\n\"Davy, thou shalt hear. Donne is biting his nails, and Malone yawning, so I will tell it but to thee. Mike is out of work, like many others, unfortunately. Mr. Grame, Sir Philip Nunnely's steward, gave him a job about the priory. According to his account, Mike was busy hedging rather late in the afternoon, but before dark, when he heard what he thought was a band at a distance--bugles, fifes, and the sound of a trumpet; it came from the forest, and he wondered that there should be music there. He looked up. All amongst the trees he saw moving objects, red, like poppies, or white, like may-blossom. The wood was full of them; they poured out and filled the park. He then perceived they were soldiers--thousands and tens of thousands; but they made no more noise than a swarm of midges on a summer evening. They formed in order, he affirmed, and marched, regiment after regiment, across the park. He followed them to Nunnely Common; the music still played soft and distant. On the common he watched them go through a number of evolutions. A man clothed in scarlet stood in the centre and directed them. They extended, he declared, over fifty acres. They were in sight half an hour; then they marched away quite silently. The whole time he heard neither voice nor tread--nothing but the faint music playing a solemn march.\"\n\"Where did they go, sir?\"\n\"Towards Briarfield. Mike followed them. They seemed passing Fieldhead, when a column of smoke, such as might be vomited by a park of artillery, spread noiseless over the fields, the road, the common, and rolled, he said, blue and dim, to his very feet. As it cleared away he looked again for the soldiers, but they were vanished; he saw them no more. Mike, like a wise Daniel as he is, not only rehearsed the vision but gave the interpretation thereof. It signifies, he intimated, bloodshed and civil conflict.\"\n\"Do you credit it, sir?\" asked Sweeting.\n\"Do you, Davy?--But come, Malone; why are you not off?\"\n\"I am rather surprised, sir, you did not stay with Moore yourself. You like this kind of thing.\"\n\"So I should have done, had I not unfortunately happened to engage Boultby to sup with me on his way home from the Bible Society meeting at Nunnely. I promised to send you as my substitute; for which, by-the-bye, he did not thank me. He would much rather have had me than you, Peter. Should there be any real need of help I shall join you. The mill-bell will give warning. Meantime, go--unless (turning suddenly to Messrs. Sweeting and Donne)--unless Davy Sweeting or Joseph Donne prefers going.--What do you say, gentlemen? The commission is an honourable one, not without the seasoning of a little real peril; for the country is in a queer state, as you all know, and Moore and his mill and his machinery are held in sufficient odium. There are chivalric sentiments, there is high-beating courage, under those waistcoats of yours, I doubt not. Perhaps I am too partial to my favourite Peter. Little David shall be the champion, or spotless Joseph.--Malone, you are but a great floundering Saul after all, good only to lend your armour. Out with your firearms; fetch your shillelah. It is there--in the corner.\"\nWith a significant grin Malone produced his pistols, offering one to each of his brethren. They were not readily seized on. With graceful modesty each gentleman retired a step from the presented weapon.\n\"I never touch them. I never did touch anything of the kind,\" said Mr. Donne.\n\"I am almost a stranger to Mr. Moore,\" murmured Sweeting.\n\"If you never touched a pistol, try the feel of it now, great satrap of Egypt. As to the little minstrel, he probably prefers encountering the Philistines with no other weapon than his flute.--Get their hats, Peter. They'll both of 'em go.\"\n\"No, sir; no, Mr. Helstone. My mother wouldn't like it,\" pleaded Sweeting.\n\"And I make it a rule never to get mixed up in affairs of the kind,\" observed Donne.\nHelstone smiled sardonically; Malone laughed a horse-laugh. He then replaced his arms, took his hat and cudgel, and saying that \"he never felt more in tune for a shindy in his life, and that he wished a score of greasy cloth-dressers might beat up Moore's quarters that night,\" he made his exit, clearing the stairs at a stride or two, and making the house shake with the bang of the front-door behind him.",
        "paragraph_chars": [
            [
                0,
                486
            ],
            [
                486,
                1366
            ],
            [
                1366,
                2527
            ],
            [
                2527,
                3374
            ],
            [
                3374,
                4042
            ],
            [
                4042,
                5118
            ],
            [
                5118,
                5937
            ],
            [
                5937,
                6790
            ],
            [
                6790,
                7569
            ],
            [
                7569,
                7597
            ],
            [
                7597,
                7804
            ],
            [
                7804,
                8467
            ],
            [
                8467,
                9278
            ],
            [
                9278,
                10068
            ],
            [
                10068,
                10628
            ],
            [
                10628,
                10923
            ],
            [
                10923,
                11624
            ],
            [
                11624,
                12739
            ],
            [
                12739,
                13211
            ],
            [
                13211,
                13237
            ],
            [
                13237,
                13356
            ],
            [
                13356,
                13478
            ],
            [
                13478,
                13566
            ],
            [
                13566,
                13586
            ],
            [
                13586,
                13607
            ],
            [
                13607,
                13619
            ],
            [
                13619,
                13639
            ],
            [
                13639,
                13651
            ],
            [
                13651,
                13667
            ],
            [
                13667,
                13932
            ],
            [
                13932,
                14027
            ],
            [
                14027,
                14094
            ],
            [
                14094,
                14164
            ],
            [
                14164,
                14345
            ],
            [
                14345,
                14585
            ],
            [
                14585,
                15036
            ],
            [
                15036,
                15705
            ],
            [
                15705,
                15805
            ],
            [
                15805,
                15882
            ],
            [
                15882,
                16260
            ],
            [
                16260,
                16395
            ],
            [
                16395,
                16809
            ],
            [
                16809,
                16822
            ],
            [
                16822,
                17305
            ],
            [
                17305,
                17928
            ],
            [
                17928,
                18937
            ],
            [
                18937,
                19038
            ],
            [
                19038,
                19069
            ],
            [
                19069,
                19134
            ],
            [
                19134,
                19157
            ],
            [
                19157,
                19305
            ],
            [
                19305,
                19348
            ],
            [
                19348,
                19385
            ],
            [
                19385,
                19687
            ],
            [
                19687,
                19747
            ],
            [
                19747,
                19778
            ],
            [
                19778,
                20007
            ],
            [
                20007,
                20374
            ],
            [
                20374,
                20432
            ],
            [
                20432,
                21040
            ],
            [
                21040,
                21188
            ],
            [
                21188,
                21215
            ],
            [
                21215,
                21245
            ],
            [
                21245,
                21275
            ],
            [
                21275,
                21573
            ],
            [
                21573,
                21616
            ],
            [
                21616,
                21690
            ],
            [
                21690,
                22152
            ],
            [
                22152,
                22643
            ],
            [
                22643,
                22736
            ],
            [
                22736,
                22771
            ],
            [
                22771,
                22959
            ],
            [
                22959,
                23004
            ],
            [
                23004,
                23187
            ],
            [
                23187,
                23214
            ],
            [
                23214,
                23500
            ],
            [
                23500,
                23523
            ],
            [
                23523,
                24851
            ],
            [
                24851,
                24877
            ],
            [
                24877,
                25390
            ],
            [
                25390,
                25431
            ],
            [
                25431,
                25487
            ],
            [
                25487,
                25584
            ],
            [
                25584,
                26697
            ],
            [
                26697,
                26900
            ],
            [
                26900,
                26978
            ],
            [
                26978,
                27036
            ],
            [
                27036,
                27277
            ],
            [
                27277,
                27352
            ],
            [
                27352,
                27437
            ],
            [
                27437,
                27843
            ]
        ],
        "segment_chars": [
            [
                0,
                239
            ],
            [
                239,
                486
            ],
            [
                486,
                608
            ],
            [
                608,
                662
            ],
            [
                662,
                714
            ],
            [
                714,
                771
            ],
            [
                771,
                962
            ],
            [
                962,
                1366
            ],
            [
                1366,
                1532
            ],
            [
                1532,
                1772
            ],
            [
                1772,
                1986
            ],
            [
                1986,
                2527
            ],
            [
                2527,
                2634
            ],
            [
                2634,
                2771
            ],
            [
                2771,
                2799
            ],
            [
                2799,
                2897
            ],
            [
                2897,
                2923
            ],
            [
                2923,
                3056
            ],
            [
                3056,
                3145
            ],
            [
                3145,
                3207
            ],
            [
                3207,
                3292
            ],
            [
                3292,
                3374
            ],
            [
                3374,
                3727
            ],
            [
                3727,
                4042
            ],
            [
                4042,
                4266
            ],
            [
                4266,
                4439
            ],
            [
                4439,
                4488
            ],
            [
                4488,
                4547
            ],
            [
                4547,
                4664
            ],
            [
                4664,
                4850
            ],
            [
                4850,
                4984
            ],
            [
                4984,
                5118
            ],
            [
                5118,
                5251
            ],
            [
                5251,
                5470
            ],
            [
                5470,
                5878
            ],
            [
                5878,
                5937
            ],
            [
                5937,
                6071
            ],
            [
                6071,
                6329
            ],
            [
                6329,
                6662
            ],
            [
                6662,
                6790
            ],
            [
                6790,
                6804
            ],
            [
                6804,
                6954
            ],
            [
                6954,
                7445
            ],
            [
                7445,
                7569
            ],
            [
                7569,
                7597
            ],
            [
                7597,
                7666
            ],
            [
                7666,
                7804
            ],
            [
                7804,
                7898
            ],
            [
                7898,
                8067
            ],
            [
                8067,
                8234
            ],
            [
                8234,
                8467
            ],
            [
                8467,
                8571
            ],
            [
                8571,
                8689
            ],
            [
                8689,
                9005
            ],
            [
                9005,
                9278
            ],
            [
                9278,
                9326
            ],
            [
                9326,
                9625
            ],
            [
                9625,
                10068
            ],
            [
                10068,
                10628
            ],
            [
                10628,
                10923
            ],
            [
                10923,
                11102
            ],
            [
                11102,
                11624
            ],
            [
                11624,
                11655
            ],
            [
                11655,
                11743
            ],
            [
                11743,
                11801
            ],
            [
                11801,
                11945
            ],
            [
                11945,
                12085
            ],
            [
                12085,
                12304
            ],
            [
                12304,
                12739
            ],
            [
                12739,
                13211
            ],
            [
                13211,
                13237
            ],
            [
                13237,
                13278
            ],
            [
                13278,
                13356
            ],
            [
                13356,
                13389
            ],
            [
                13389,
                13454
            ],
            [
                13454,
                13478
            ],
            [
                13478,
                13541
            ],
            [
                13541,
                13566
            ],
            [
                13566,
                13586
            ],
            [
                13586,
                13593
            ],
            [
                13593,
                13607
            ],
            [
                13607,
                13619
            ],
            [
                13619,
                13639
            ],
            [
                13639,
                13651
            ],
            [
                13651,
                13667
            ],
            [
                13667,
                13731
            ],
            [
                13731,
                13846
            ],
            [
                13846,
                13932
            ],
            [
                13932,
                13939
            ],
            [
                13939,
                14027
            ],
            [
                14027,
                14094
            ],
            [
                14094,
                14164
            ],
            [
                14164,
                14172
            ],
            [
                14172,
                14190
            ],
            [
                14190,
                14210
            ],
            [
                14210,
                14345
            ],
            [
                14345,
                14456
            ],
            [
                14456,
                14523
            ],
            [
                14523,
                14585
            ],
            [
                14585,
                14653
            ],
            [
                14653,
                15036
            ],
            [
                15036,
                15044
            ],
            [
                15044,
                15181
            ],
            [
                15181,
                15224
            ],
            [
                15224,
                15265
            ],
            [
                15265,
                15281
            ],
            [
                15281,
                15324
            ],
            [
                15324,
                15705
            ],
            [
                15705,
                15782
            ],
            [
                15782,
                15805
            ],
            [
                15805,
                15840
            ],
            [
                15840,
                15882
            ],
            [
                15882,
                15925
            ],
            [
                15925,
                15939
            ],
            [
                15939,
                16068
            ],
            [
                16068,
                16149
            ],
            [
                16149,
                16166
            ],
            [
                16166,
                16172
            ],
            [
                16172,
                16183
            ],
            [
                16183,
                16260
            ],
            [
                16260,
                16395
            ],
            [
                16395,
                16400
            ],
            [
                16400,
                16435
            ],
            [
                16435,
                16471
            ],
            [
                16471,
                16529
            ],
            [
                16529,
                16760
            ],
            [
                16760,
                16809
            ],
            [
                16809,
                16822
            ],
            [
                16822,
                16835
            ],
            [
                16835,
                16919
            ],
            [
                16919,
                17000
            ],
            [
                17000,
                17035
            ],
            [
                17035,
                17305
            ],
            [
                17305,
                17480
            ],
            [
                17480,
                17728
            ],
            [
                17728,
                17928
            ],
            [
                17928,
                18050
            ],
            [
                18050,
                18261
            ],
            [
                18261,
                18847
            ],
            [
                18847,
                18874
            ],
            [
                18874,
                18937
            ],
            [
                18937,
                18951
            ],
            [
                18951,
                18983
            ],
            [
                18983,
                19038
            ],
            [
                19038,
                19069
            ],
            [
                19069,
                19098
            ],
            [
                19098,
                19134
            ],
            [
                19134,
                19140
            ],
            [
                19140,
                19157
            ],
            [
                19157,
                19199
            ],
            [
                19199,
                19223
            ],
            [
                19223,
                19282
            ],
            [
                19282,
                19305
            ],
            [
                19305,
                19317
            ],
            [
                19317,
                19348
            ],
            [
                19348,
                19385
            ],
            [
                19385,
                19449
            ],
            [
                19449,
                19550
            ],
            [
                19550,
                19687
            ],
            [
                19687,
                19724
            ],
            [
                19724,
                19747
            ],
            [
                19747,
                19753
            ],
            [
                19753,
                19778
            ],
            [
                19778,
                19809
            ],
            [
                19809,
                20007
            ],
            [
                20007,
                20174
            ],
            [
                20174,
                20305
            ],
            [
                20305,
                20374
            ],
            [
                20374,
                20432
            ],
            [
                20432,
                20477
            ],
            [
                20477,
                20575
            ],
            [
                20575,
                20601
            ],
            [
                20601,
                20912
            ],
            [
                20912,
                21040
            ],
            [
                21040,
                21188
            ],
            [
                21188,
                21215
            ],
            [
                21215,
                21245
            ],
            [
                21245,
                21269
            ],
            [
                21269,
                21275
            ],
            [
                21275,
                21573
            ],
            [
                21573,
                21616
            ],
            [
                21616,
                21690
            ],
            [
                21690,
                21699
            ],
            [
                21699,
                21762
            ],
            [
                21762,
                21931
            ],
            [
                21931,
                22029
            ],
            [
                22029,
                22113
            ],
            [
                22113,
                22152
            ],
            [
                22152,
                22183
            ],
            [
                22183,
                22237
            ],
            [
                22237,
                22361
            ],
            [
                22361,
                22562
            ],
            [
                22562,
                22617
            ],
            [
                22617,
                22643
            ],
            [
                22643,
                22662
            ],
            [
                22662,
                22736
            ],
            [
                22736,
                22771
            ],
            [
                22771,
                22776
            ],
            [
                22776,
                22820
            ],
            [
                22820,
                22959
            ],
            [
                22959,
                22974
            ],
            [
                22974,
                22988
            ],
            [
                22988,
                23004
            ],
            [
                23004,
                23065
            ],
            [
                23065,
                23092
            ],
            [
                23092,
                23134
            ],
            [
                23134,
                23187
            ],
            [
                23187,
                23194
            ],
            [
                23194,
                23214
            ],
            [
                23214,
                23245
            ],
            [
                23245,
                23266
            ],
            [
                23266,
                23282
            ],
            [
                23282,
                23402
            ],
            [
                23402,
                23451
            ],
            [
                23451,
                23500
            ],
            [
                23500,
                23523
            ],
            [
                23523,
                23547
            ],
            [
                23547,
                23625
            ],
            [
                23625,
                23679
            ],
            [
                23679,
                23753
            ],
            [
                23753,
                24022
            ],
            [
                24022,
                24036
            ],
            [
                24036,
                24128
            ],
            [
                24128,
                24192
            ],
            [
                24192,
                24335
            ],
            [
                24335,
                24425
            ],
            [
                24425,
                24502
            ],
            [
                24502,
                24567
            ],
            [
                24567,
                24631
            ],
            [
                24631,
                24677
            ],
            [
                24677,
                24749
            ],
            [
                24749,
                24851
            ],
            [
                24851,
                24877
            ],
            [
                24877,
                24898
            ],
            [
                24898,
                24918
            ],
            [
                24918,
                25131
            ],
            [
                25131,
                25229
            ],
            [
                25229,
                25331
            ],
            [
                25331,
                25390
            ],
            [
                25390,
                25415
            ],
            [
                25415,
                25431
            ],
            [
                25431,
                25487
            ],
            [
                25487,
                25554
            ],
            [
                25554,
                25584
            ],
            [
                25584,
                25733
            ],
            [
                25733,
                25818
            ],
            [
                25818,
                25868
            ],
            [
                25868,
                25924
            ],
            [
                25924,
                25957
            ],
            [
                25957,
                26109
            ],
            [
                26109,
                26321
            ],
            [
                26321,
                26430
            ],
            [
                26430,
                26478
            ],
            [
                26478,
                26622
            ],
            [
                26622,
                26668
            ],
            [
                26668,
                26697
            ],
            [
                26697,
                26788
            ],
            [
                26788,
                26821
            ],
            [
                26821,
                26900
            ],
            [
                26900,
                26921
            ],
            [
                26921,
                26978
            ],
            [
                26978,
                27036
            ],
            [
                27036,
                27115
            ],
            [
                27115,
                27252
            ],
            [
                27252,
                27277
            ],
            [
                27277,
                27305
            ],
            [
                27305,
                27352
            ],
            [
                27352,
                27437
            ],
            [
                27437,
                27497
            ],
            [
                27497,
                27843
            ]
        ],
        "overlap_chars": [
            [
                14,
                152
            ],
            [
                237,
                239
            ],
            [
                239,
                249
            ],
            [
                255,
                334
            ],
            [
                348,
                401
            ],
            [
                408,
                486
            ],
            [
                486,
                523
            ],
            [
                538,
                550
            ],
            [
                561,
                608
            ],
            [
                662,
                675
            ],
            [
                626,
                636
            ],
            [
                676,
                683
            ],
            [
                697,
                714
            ],
            [
                714,
                736
            ],
            [
                769,
                771
            ],
            [
                771,
                864
            ],
            [
                883,
                887
            ],
            [
                911,
                934
            ],
            [
                878,
                882
            ],
            [
                960,
                962
            ],
            [
                997,
                1000
            ],
            [
                1011,
                1094
            ],
            [
                1115,
                1177
            ],
            [
                1207,
                1231
            ],
            [
                1247,
                1285
            ],
            [
                1297,
                1298
            ],
            [
                1311,
                1366
            ],
            [
                1379,
                1462
            ],
            [
                1494,
                1498
            ],
            [
                1508,
                1532
            ],
            [
                1532,
                1583
            ],
            [
                1616,
                1665
            ],
            [
                1680,
                1681
            ],
            [
                1691,
                1695
            ],
            [
                1712,
                1771
            ],
            [
                2527,
                2561
            ],
            [
                2609,
                2610
            ],
            [
                2573,
                2580
            ],
            [
                2618,
                2634
            ],
            [
                2634,
                2711
            ],
            [
                2726,
                2770
            ],
            [
                2771,
                2799
            ],
            [
                2799,
                2838
            ],
            [
                2846,
                2857
            ],
            [
                2859,
                2897
            ],
            [
                2897,
                2923
            ],
            [
                2923,
                3056
            ],
            [
                3056,
                3086
            ],
            [
                3145,
                3189
            ],
            [
                3205,
                3207
            ],
            [
                3207,
                3236
            ],
            [
                3260,
                3292
            ],
            [
                3292,
                3374
            ],
            [
                3374,
                3389
            ],
            [
                3430,
                3449
            ],
            [
                3410,
                3415
            ],
            [
                3472,
                3513
            ],
            [
                3592,
                3596
            ],
            [
                3514,
                3519
            ],
            [
                3530,
                3534
            ],
            [
                3550,
                3572
            ],
            [
                3630,
                3635
            ],
            [
                3649,
                3665
            ],
            [
                3688,
                3696
            ],
            [
                3725,
                3727
            ],
            [
                3727,
                3734
            ],
            [
                3752,
                3790
            ],
            [
                3856,
                3858
            ],
            [
                3801,
                3818
            ],
            [
                3859,
                3864
            ],
            [
                3847,
                3848
            ],
            [
                4056,
                4086
            ],
            [
                4120,
                4145
            ],
            [
                4164,
                4225
            ],
            [
                4264,
                4266
            ],
            [
                4266,
                4304
            ],
            [
                4340,
                4369
            ],
            [
                4330,
                4334
            ],
            [
                4388,
                4399
            ],
            [
                4422,
                4438
            ],
            [
                4439,
                4488
            ],
            [
                4488,
                4547
            ],
            [
                4547,
                4565
            ],
            [
                4604,
                4605
            ],
            [
                4615,
                4631
            ],
            [
                4606,
                4614
            ],
            [
                4632,
                4655
            ],
            [
                4657,
                4664
            ],
            [
                4664,
                4750
            ],
            [
                4791,
                4810
            ],
            [
                4756,
                4758
            ],
            [
                4832,
                4850
            ],
            [
                4850,
                4886
            ],
            [
                4888,
                4915
            ],
            [
                4924,
                4940
            ],
            [
                4961,
                4984
            ],
            [
                4984,
                5035
            ],
            [
                5116,
                5118
            ],
            [
                5118,
                5251
            ],
            [
                5251,
                5314
            ],
            [
                5423,
                5431
            ],
            [
                5461,
                5470
            ],
            [
                5515,
                5535
            ],
            [
                5563,
                5591
            ],
            [
                5743,
                5745
            ],
            [
                5592,
                5638
            ],
            [
                5650,
                5662
            ],
            [
                5672,
                5710
            ],
            [
                5544,
                5547
            ],
            [
                5746,
                5877
            ],
            [
                5937,
                5952
            ],
            [
                6003,
                6019
            ],
            [
                5988,
                5991
            ],
            [
                5965,
                5984
            ],
            [
                6023,
                6071
            ],
            [
                6100,
                6162
            ],
            [
                6234,
                6275
            ],
            [
                6279,
                6315
            ],
            [
                6329,
                6333
            ],
            [
                6391,
                6393
            ],
            [
                6334,
                6343
            ],
            [
                6359,
                6362
            ],
            [
                6367,
                6368
            ],
            [
                6553,
                6556
            ],
            [
                6484,
                6550
            ],
            [
                6576,
                6602
            ],
            [
                6610,
                6620
            ],
            [
                6623,
                6627
            ],
            [
                6660,
                6662
            ],
            [
                6662,
                6678
            ],
            [
                6682,
                6724
            ],
            [
                6746,
                6763
            ],
            [
                6767,
                6790
            ],
            [
                6790,
                6804
            ],
            [
                6804,
                6824
            ],
            [
                6832,
                6837
            ],
            [
                6884,
                6897
            ],
            [
                6906,
                6917
            ],
            [
                6922,
                6926
            ],
            [
                6952,
                6954
            ],
            [
                6954,
                6990
            ],
            [
                7001,
                7049
            ],
            [
                7052,
                7056
            ],
            [
                7105,
                7108
            ],
            [
                7058,
                7072
            ],
            [
                7082,
                7088
            ],
            [
                7050,
                7051
            ],
            [
                7210,
                7254
            ],
            [
                7121,
                7125
            ],
            [
                7113,
                7120
            ],
            [
                7327,
                7336
            ],
            [
                7056,
                7057
            ],
            [
                7341,
                7351
            ],
            [
                7443,
                7445
            ],
            [
                7445,
                7464
            ],
            [
                7472,
                7491
            ],
            [
                7493,
                7504
            ],
            [
                7509,
                7521
            ],
            [
                7533,
                7569
            ],
            [
                7569,
                7586
            ],
            [
                7587,
                7597
            ],
            [
                7597,
                7666
            ],
            [
                7666,
                7723
            ],
            [
                7731,
                7735
            ],
            [
                7802,
                7804
            ],
            [
                7804,
                7898
            ],
            [
                7898,
                7912
            ],
            [
                7919,
                7920
            ],
            [
                7941,
                7994
            ],
            [
                7996,
                8025
            ],
            [
                8027,
                8067
            ],
            [
                8067,
                8083
            ],
            [
                8215,
                8218
            ],
            [
                8209,
                8214
            ],
            [
                8137,
                8138
            ],
            [
                8145,
                8150
            ],
            [
                8187,
                8209
            ],
            [
                8232,
                8234
            ],
            [
                8244,
                8247
            ],
            [
                8256,
                8298
            ],
            [
                8331,
                8353
            ],
            [
                8375,
                8419
            ],
            [
                8427,
                8460
            ],
            [
                8465,
                8467
            ],
            [
                8467,
                8515
            ],
            [
                8569,
                8571
            ],
            [
                8571,
                8596
            ],
            [
                8602,
                8639
            ],
            [
                8662,
                8674
            ],
            [
                8687,
                8689
            ],
            [
                8689,
                8740
            ],
            [
                8744,
                8759
            ],
            [
                8846,
                8850
            ],
            [
                8854,
                8862
            ],
            [
                8888,
                8987
            ],
            [
                8993,
                9005
            ],
            [
                9005,
                9016
            ],
            [
                9041,
                9061
            ],
            [
                9169,
                9173
            ],
            [
                9128,
                9168
            ],
            [
                9193,
                9265
            ],
            [
                9276,
                9278
            ],
            [
                9286,
                9300
            ],
            [
                9320,
                9324
            ],
            [
                9316,
                9319
            ],
            [
                9324,
                9326
            ],
            [
                9326,
                9353
            ],
            [
                9372,
                9380
            ],
            [
                9409,
                9418
            ],
            [
                9458,
                9487
            ],
            [
                9530,
                9538
            ],
            [
                9560,
                9591
            ],
            [
                9599,
                9625
            ],
            [
                9635,
                9646
            ],
            [
                9948,
                9957
            ],
            [
                9647,
                9651
            ],
            [
                9729,
                9737
            ],
            [
                9658,
                9667
            ],
            [
                9686,
                9687
            ],
            [
                9701,
                9720
            ],
            [
                9870,
                9873
            ],
            [
                9741,
                9742
            ],
            [
                9751,
                9761
            ],
            [
                9780,
                9785
            ],
            [
                9627,
                9634
            ],
            [
                9698,
                9700
            ],
            [
                9834,
                9843
            ],
            [
                10066,
                10068
            ],
            [
                10068,
                10103
            ],
            [
                10104,
                10111
            ],
            [
                10155,
                10158
            ],
            [
                10213,
                10240
            ],
            [
                10242,
                10281
            ],
            [
                10292,
                10331
            ],
            [
                10333,
                10511
            ],
            [
                10194,
                10200
            ],
            [
                10549,
                10561
            ],
            [
                10528,
                10530
            ],
            [
                10592,
                10628
            ],
            [
                10628,
                10703
            ],
            [
                10709,
                10720
            ],
            [
                10801,
                10854
            ],
            [
                10921,
                10922
            ],
            [
                10923,
                10952
            ],
            [
                10960,
                10974
            ],
            [
                10994,
                10998
            ],
            [
                11029,
                11102
            ],
            [
                11102,
                11111
            ],
            [
                11305,
                11307
            ],
            [
                11129,
                11132
            ],
            [
                11138,
                11148
            ],
            [
                11157,
                11161
            ],
            [
                11182,
                11205
            ],
            [
                11232,
                11250
            ],
            [
                11256,
                11304
            ],
            [
                11323,
                11335
            ],
            [
                11355,
                11386
            ],
            [
                11525,
                11528
            ],
            [
                11387,
                11396
            ],
            [
                11454,
                11463
            ],
            [
                11112,
                11117
            ],
            [
                11488,
                11498
            ],
            [
                11517,
                11522
            ],
            [
                11655,
                11661
            ],
            [
                11706,
                11709
            ],
            [
                11720,
                11743
            ],
            [
                11743,
                11745
            ],
            [
                11759,
                11801
            ],
            [
                11801,
                11852
            ],
            [
                11859,
                11865
            ],
            [
                11878,
                11906
            ],
            [
                11927,
                11945
            ],
            [
                12085,
                12110
            ],
            [
                12114,
                12120
            ],
            [
                12185,
                12234
            ],
            [
                12264,
                12304
            ],
            [
                12304,
                12317
            ],
            [
                12329,
                12331
            ],
            [
                12510,
                12533
            ],
            [
                12455,
                12460
            ],
            [
                12363,
                12367
            ],
            [
                12571,
                12580
            ],
            [
                12534,
                12570
            ],
            [
                12602,
                12605
            ],
            [
                12368,
                12384
            ],
            [
                12668,
                12676
            ],
            [
                12690,
                12698
            ],
            [
                12444,
                12446
            ],
            [
                12699,
                12706
            ],
            [
                12730,
                12739
            ],
            [
                12739,
                12745
            ],
            [
                12758,
                12810
            ],
            [
                12841,
                12857
            ],
            [
                12885,
                12925
            ],
            [
                12936,
                12945
            ],
            [
                12960,
                12967
            ],
            [
                13108,
                13149
            ],
            [
                13156,
                13182
            ],
            [
                13209,
                13210
            ],
            [
                13211,
                13219
            ],
            [
                13229,
                13235
            ],
            [
                13235,
                13237
            ],
            [
                13237,
                13278
            ],
            [
                13278,
                13291
            ],
            [
                13293,
                13325
            ],
            [
                13335,
                13341
            ],
            [
                13354,
                13356
            ],
            [
                13356,
                13357
            ],
            [
                13361,
                13389
            ],
            [
                13389,
                13411
            ],
            [
                13416,
                13419
            ],
            [
                13452,
                13454
            ],
            [
                13454,
                13470
            ],
            [
                13475,
                13478
            ],
            [
                13478,
                13528
            ],
            [
                13539,
                13541
            ],
            [
                13541,
                13566
            ],
            [
                13566,
                13586
            ],
            [
                13586,
                13593
            ],
            [
                13593,
                13607
            ],
            [
                13607,
                13619
            ],
            [
                13651,
                13667
            ],
            [
                13667,
                13683
            ],
            [
                13693,
                13700
            ],
            [
                13702,
                13731
            ],
            [
                13731,
                13740
            ],
            [
                13750,
                13768
            ],
            [
                13785,
                13793
            ],
            [
                13775,
                13785
            ],
            [
                13823,
                13844
            ],
            [
                13769,
                13771
            ],
            [
                13884,
                13899
            ],
            [
                13796,
                13797
            ],
            [
                13852,
                13855
            ],
            [
                13914,
                13932
            ],
            [
                13932,
                13939
            ],
            [
                13939,
                13941
            ],
            [
                13963,
                13964
            ],
            [
                13991,
                14027
            ],
            [
                14094,
                14123
            ],
            [
                14138,
                14145
            ],
            [
                14149,
                14164
            ],
            [
                14164,
                14172
            ],
            [
                14172,
                14190
            ],
            [
                14200,
                14210
            ],
            [
                14331,
                14339
            ],
            [
                14380,
                14412
            ],
            [
                14433,
                14456
            ],
            [
                14523,
                14529
            ],
            [
                14530,
                14585
            ],
            [
                14589,
                14627
            ],
            [
                14651,
                14653
            ],
            [
                14770,
                14773
            ],
            [
                14669,
                14699
            ],
            [
                14709,
                14712
            ],
            [
                14724,
                14729
            ],
            [
                14707,
                14708
            ],
            [
                14740,
                14768
            ],
            [
                14932,
                14947
            ],
            [
                14961,
                15013
            ],
            [
                15034,
                15036
            ],
            [
                15036,
                15044
            ],
            [
                15044,
                15053
            ],
            [
                15075,
                15077
            ],
            [
                15129,
                15151
            ],
            [
                15107,
                15111
            ],
            [
                15159,
                15162
            ],
            [
                15152,
                15158
            ],
            [
                15174,
                15181
            ],
            [
                15181,
                15224
            ],
            [
                15224,
                15265
            ],
            [
                15281,
                15324
            ],
            [
                15324,
                15370
            ],
            [
                15685,
                15705
            ],
            [
                15705,
                15770
            ],
            [
                15777,
                15782
            ],
            [
                15782,
                15802
            ],
            [
                15840,
                15868
            ],
            [
                15882,
                15883
            ],
            [
                15888,
                15925
            ],
            [
                15925,
                15939
            ],
            [
                16068,
                16074
            ],
            [
                16087,
                16147
            ],
            [
                16260,
                16349
            ],
            [
                16361,
                16367
            ],
            [
                16378,
                16395
            ],
            [
                16395,
                16400
            ],
            [
                16400,
                16435
            ],
            [
                16435,
                16471
            ],
            [
                16471,
                16502
            ],
            [
                16503,
                16511
            ],
            [
                16527,
                16529
            ],
            [
                16560,
                16587
            ],
            [
                16606,
                16649
            ],
            [
                16681,
                16716
            ],
            [
                16758,
                16760
            ],
            [
                16779,
                16784
            ],
            [
                16773,
                16778
            ],
            [
                16798,
                16809
            ],
            [
                16809,
                16822
            ],
            [
                16822,
                16835
            ],
            [
                16835,
                16880
            ],
            [
                16917,
                16919
            ],
            [
                16919,
                16925
            ],
            [
                16957,
                17000
            ],
            [
                17000,
                17035
            ],
            [
                17051,
                17087
            ],
            [
                17088,
                17091
            ],
            [
                17127,
                17178
            ],
            [
                17204,
                17210
            ],
            [
                17219,
                17236
            ],
            [
                17302,
                17305
            ],
            [
                17480,
                17524
            ],
            [
                17560,
                17585
            ],
            [
                17592,
                17596
            ],
            [
                17598,
                17609
            ],
            [
                17611,
                17615
            ],
            [
                17627,
                17672
            ],
            [
                17541,
                17542
            ],
            [
                17688,
                17728
            ],
            [
                17728,
                17743
            ],
            [
                17772,
                17778
            ],
            [
                17766,
                17771
            ],
            [
                17779,
                17795
            ],
            [
                17812,
                17832
            ],
            [
                17743,
                17744
            ],
            [
                17845,
                17853
            ],
            [
                17878,
                17901
            ],
            [
                17796,
                17801
            ],
            [
                17910,
                17915
            ],
            [
                17926,
                17928
            ],
            [
                17949,
                17964
            ],
            [
                18065,
                18084
            ],
            [
                17989,
                18003
            ],
            [
                18085,
                18094
            ],
            [
                18125,
                18131
            ],
            [
                18142,
                18146
            ],
            [
                18095,
                18101
            ],
            [
                18033,
                18048
            ],
            [
                18146,
                18158
            ],
            [
                18060,
                18063
            ],
            [
                18164,
                18261
            ],
            [
                18669,
                18670
            ],
            [
                18384,
                18389
            ],
            [
                18400,
                18426
            ],
            [
                18427,
                18464
            ],
            [
                18477,
                18484
            ],
            [
                18486,
                18488
            ],
            [
                18517,
                18520
            ],
            [
                18566,
                18584
            ],
            [
                18586,
                18589
            ],
            [
                18708,
                18760
            ],
            [
                18845,
                18847
            ],
            [
                18847,
                18860
            ],
            [
                18872,
                18874
            ],
            [
                18874,
                18894
            ],
            [
                18897,
                18913
            ],
            [
                18919,
                18937
            ],
            [
                18937,
                18951
            ],
            [
                18951,
                18983
            ],
            [
                18983,
                19038
            ],
            [
                19038,
                19051
            ],
            [
                19140,
                19147
            ],
            [
                19057,
                19069
            ],
            [
                19157,
                19188
            ],
            [
                19197,
                19199
            ],
            [
                19199,
                19223
            ],
            [
                19223,
                19233
            ],
            [
                19258,
                19282
            ],
            [
                19282,
                19288
            ],
            [
                19289,
                19302
            ],
            [
                19302,
                19305
            ],
            [
                19305,
                19317
            ],
            [
                19317,
                19348
            ],
            [
                19348,
                19385
            ],
            [
                19385,
                19449
            ],
            [
                19449,
                19532
            ],
            [
                19539,
                19550
            ],
            [
                19550,
                19627
            ],
            [
                19684,
                19687
            ],
            [
                19687,
                19724
            ],
            [
                19724,
                19747
            ],
            [
                19747,
                19750
            ],
            [
                19751,
                19753
            ],
            [
                19753,
                19778
            ],
            [
                19778,
                19809
            ],
            [
                19809,
                19891
            ],
            [
                19897,
                19961
            ],
            [
                19968,
                19975
            ],
            [
                19981,
                20007
            ],
            [
                20007,
                20017
            ],
            [
                20019,
                20021
            ],
            [
                20023,
                20040
            ],
            [
                20042,
                20080
            ],
            [
                20090,
                20091
            ],
            [
                20120,
                20155
            ],
            [
                20162,
                20174
            ],
            [
                20174,
                20223
            ],
            [
                20223,
                20305
            ],
            [
                20305,
                20337
            ],
            [
                20345,
                20374
            ],
            [
                20374,
                20405
            ],
            [
                20418,
                20432
            ],
            [
                20432,
                20477
            ],
            [
                20477,
                20509
            ],
            [
                20543,
                20575
            ],
            [
                20575,
                20601
            ],
            [
                20601,
                20648
            ],
            [
                20657,
                20670
            ],
            [
                20686,
                20726
            ],
            [
                20676,
                20679
            ],
            [
                20727,
                20746
            ],
            [
                20769,
                20823
            ],
            [
                20845,
                20860
            ],
            [
                20910,
                20912
            ],
            [
                20912,
                20940
            ],
            [
                20946,
                20948
            ],
            [
                20949,
                20956
            ],
            [
                20975,
                20983
            ],
            [
                20985,
                21040
            ],
            [
                21040,
                21047
            ],
            [
                21141,
                21146
            ],
            [
                21055,
                21072
            ],
            [
                21097,
                21123
            ],
            [
                21072,
                21073
            ],
            [
                21125,
                21126
            ],
            [
                21147,
                21188
            ],
            [
                21188,
                21215
            ],
            [
                21215,
                21237
            ],
            [
                21246,
                21249
            ],
            [
                21261,
                21267
            ],
            [
                21237,
                21242
            ],
            [
                21267,
                21269
            ],
            [
                21382,
                21383
            ],
            [
                21276,
                21280
            ],
            [
                21533,
                21535
            ],
            [
                21286,
                21319
            ],
            [
                21328,
                21342
            ],
            [
                21349,
                21351
            ],
            [
                21363,
                21382
            ],
            [
                21384,
                21439
            ],
            [
                21500,
                21520
            ],
            [
                21545,
                21573
            ],
            [
                21573,
                21574
            ],
            [
                21580,
                21616
            ],
            [
                21616,
                21617
            ],
            [
                21646,
                21690
            ],
            [
                21690,
                21697
            ],
            [
                21697,
                21699
            ],
            [
                21699,
                21760
            ],
            [
                22183,
                22198
            ],
            [
                22320,
                22324
            ],
            [
                22199,
                22235
            ],
            [
                22293,
                22298
            ],
            [
                22247,
                22249
            ],
            [
                22325,
                22330
            ],
            [
                22261,
                22263
            ],
            [
                22338,
                22361
            ],
            [
                22562,
                22617
            ],
            [
                22617,
                22634
            ],
            [
                22641,
                22643
            ],
            [
                22643,
                22662
            ],
            [
                22662,
                22682
            ],
            [
                22693,
                22716
            ],
            [
                22729,
                22736
            ],
            [
                22736,
                22771
            ],
            [
                22771,
                22776
            ],
            [
                22776,
                22788
            ],
            [
                22800,
                22820
            ],
            [
                22820,
                22827
            ],
            [
                22857,
                22941
            ],
            [
                22947,
                22959
            ],
            [
                22959,
                22974
            ],
            [
                22974,
                22988
            ],
            [
                22988,
                23004
            ],
            [
                23523,
                23547
            ],
            [
                23625,
                23679
            ],
            [
                23694,
                23718
            ],
            [
                23720,
                23753
            ],
            [
                23779,
                23783
            ],
            [
                23867,
                23869
            ],
            [
                23784,
                23800
            ],
            [
                23808,
                23830
            ],
            [
                23848,
                23861
            ],
            [
                23882,
                23902
            ],
            [
                23904,
                23922
            ],
            [
                23936,
                23945
            ],
            [
                24020,
                24022
            ],
            [
                24022,
                24034
            ],
            [
                24040,
                24084
            ],
            [
                24103,
                24108
            ],
            [
                24126,
                24128
            ],
            [
                24128,
                24192
            ],
            [
                24192,
                24194
            ],
            [
                24200,
                24228
            ],
            [
                24244,
                24266
            ],
            [
                24267,
                24271
            ],
            [
                24374,
                24425
            ],
            [
                24425,
                24502
            ],
            [
                24677,
                24732
            ],
            [
                24747,
                24749
            ],
            [
                24749,
                24790
            ],
            [
                24798,
                24835
            ],
            [
                24843,
                24851
            ],
            [
                24851,
                24877
            ],
            [
                24877,
                24898
            ],
            [
                24898,
                24916
            ],
            [
                25182,
                25187
            ],
            [
                24954,
                24971
            ],
            [
                25082,
                25088
            ],
            [
                25039,
                25055
            ],
            [
                25090,
                25098
            ],
            [
                25078,
                25081
            ],
            [
                24949,
                24953
            ],
            [
                25134,
                25149
            ],
            [
                25170,
                25182
            ],
            [
                25198,
                25206
            ],
            [
                25227,
                25229
            ],
            [
                25229,
                25233
            ],
            [
                25283,
                25293
            ],
            [
                25359,
                25372
            ],
            [
                25379,
                25390
            ],
            [
                25390,
                25397
            ],
            [
                25405,
                25415
            ],
            [
                25415,
                25431
            ],
            [
                25431,
                25445
            ],
            [
                25447,
                25487
            ],
            [
                25487,
                25554
            ],
            [
                25554,
                25584
            ],
            [
                25584,
                25606
            ],
            [
                25606,
                25607
            ],
            [
                25612,
                25613
            ],
            [
                25608,
                25611
            ],
            [
                25614,
                25617
            ],
            [
                25651,
                25673
            ],
            [
                25731,
                25733
            ],
            [
                25733,
                25773
            ],
            [
                25800,
                25818
            ],
            [
                25818,
                25868
            ],
            [
                25868,
                25924
            ],
            [
                25924,
                25957
            ],
            [
                25957,
                25969
            ],
            [
                26028,
                26078
            ],
            [
                26005,
                26006
            ],
            [
                26081,
                26107
            ],
            [
                26900,
                26914
            ],
            [
                26959,
                26978
            ],
            [
                27277,
                27281
            ],
            [
                27287,
                27305
            ],
            [
                27305,
                27352
            ],
            [
                27437,
                27497
            ],
            [
                27497,
                27499
            ],
            [
                27524,
                27532
            ],
            [
                27522,
                27523
            ],
            [
                27533,
                27617
            ],
            [
                27712,
                27717
            ],
            [
                27617,
                27618
            ],
            [
                27777,
                27826
            ],
            [
                27827,
                27843
            ]
        ],
        "row_chars": [
            [
                0,
                239
            ],
            [
                239,
                486
            ],
            [
                486,
                608
            ],
            [
                608,
                714
            ],
            [
                714,
                771
            ],
            [
                771,
                962
            ],
            [
                962,
                1366
            ],
            [
                1366,
                1532
            ],
            [
                1532,
                1772
            ],
            [
                1772,
                1986
            ],
            [
                1986,
                2527
            ],
            [
                2527,
                2634
            ],
            [
                2634,
                2771
            ],
            [
                2771,
                2799
            ],
            [
                2799,
                2897
            ],
            [
                2897,
                2923
            ],
            [
                2923,
                3056
            ],
            [
                3056,
                3207
            ],
            [
                3207,
                3292
            ],
            [
                3292,
                3374
            ],
            [
                3374,
                3727
            ],
            [
                3727,
                4266
            ],
            [
                4266,
                4439
            ],
            [
                4439,
                4488
            ],
            [
                4488,
                4547
            ],
            [
                4547,
                4664
            ],
            [
                4664,
                4850
            ],
            [
                4850,
                4984
            ],
            [
                4984,
                5118
            ],
            [
                5118,
                5251
            ],
            [
                5251,
                5470
            ],
            [
                5470,
                5878
            ],
            [
                5878,
                5937
            ],
            [
                5937,
                6071
            ],
            [
                6071,
                6329
            ],
            [
                6329,
                6662
            ],
            [
                6662,
                6790
            ],
            [
                6790,
                6804
            ],
            [
                6804,
                6954
            ],
            [
                6954,
                7445
            ],
            [
                7445,
                7569
            ],
            [
                7569,
                7597
            ],
            [
                7597,
                7666
            ],
            [
                7666,
                7804
            ],
            [
                7804,
                7898
            ],
            [
                7898,
                8067
            ],
            [
                8067,
                8234
            ],
            [
                8234,
                8467
            ],
            [
                8467,
                8571
            ],
            [
                8571,
                8689
            ],
            [
                8689,
                9005
            ],
            [
                9005,
                9278
            ],
            [
                9278,
                9326
            ],
            [
                9326,
                9625
            ],
            [
                9625,
                10068
            ],
            [
                10068,
                10628
            ],
            [
                10628,
                10923
            ],
            [
                10923,
                11102
            ],
            [
                11102,
                11624
            ],
            [
                11624,
                11655
            ],
            [
                11655,
                11743
            ],
            [
                11743,
                11801
            ],
            [
                11801,
                11945
            ],
            [
                11945,
                12085
            ],
            [
                12085,
                12304
            ],
            [
                12304,
                12739
            ],
            [
                12739,
                13211
            ],
            [
                13211,
                13237
            ],
            [
                13237,
                13278
            ],
            [
                13278,
                13356
            ],
            [
                13356,
                13389
            ],
            [
                13389,
                13454
            ],
            [
                13454,
                13478
            ],
            [
                13478,
                13541
            ],
            [
                13541,
                13566
            ],
            [
                13566,
                13586
            ],
            [
                13586,
                13593
            ],
            [
                13593,
                13607
            ],
            [
                13607,
                13619
            ],
            [
                13619,
                13639
            ],
            [
                13639,
                13651
            ],
            [
                13651,
                13667
            ],
            [
                13667,
                13731
            ],
            [
                13731,
                13932
            ],
            [
                13932,
                13939
            ],
            [
                13939,
                14027
            ],
            [
                14027,
                14094
            ],
            [
                14094,
                14164
            ],
            [
                14164,
                14172
            ],
            [
                14172,
                14190
            ],
            [
                14190,
                14210
            ],
            [
                14210,
                14345
            ],
            [
                14345,
                14456
            ],
            [
                14456,
                14523
            ],
            [
                14523,
                14585
            ],
            [
                14585,
                14653
            ],
            [
                14653,
                15036
            ],
            [
                15036,
                15044
            ],
            [
                15044,
                15181
            ],
            [
                15181,
                15224
            ],
            [
                15224,
                15265
            ],
            [
                15265,
                15281
            ],
            [
                15281,
                15324
            ],
            [
                15324,
                15705
            ],
            [
                15705,
                15782
            ],
            [
                15782,
                15805
            ],
            [
                15805,
                15840
            ],
            [
                15840,
                15882
            ],
            [
                15882,
                15925
            ],
            [
                15925,
                15939
            ],
            [
                15939,
                16068
            ],
            [
                16068,
                16149
            ],
            [
                16149,
                16166
            ],
            [
                16166,
                16172
            ],
            [
                16172,
                16183
            ],
            [
                16183,
                16260
            ],
            [
                16260,
                16395
            ],
            [
                16395,
                16400
            ],
            [
                16400,
                16435
            ],
            [
                16435,
                16471
            ],
            [
                16471,
                16529
            ],
            [
                16529,
                16760
            ],
            [
                16760,
                16809
            ],
            [
                16809,
                16822
            ],
            [
                16822,
                16835
            ],
            [
                16835,
                16919
            ],
            [
                16919,
                17000
            ],
            [
                17000,
                17035
            ],
            [
                17035,
                17305
            ],
            [
                17305,
                17480
            ],
            [
                17480,
                17728
            ],
            [
                17728,
                17928
            ],
            [
                17928,
                18261
            ],
            [
                18261,
                18847
            ],
            [
                18847,
                18874
            ],
            [
                18874,
                18937
            ],
            [
                18937,
                18951
            ],
            [
                18951,
                18983
            ],
            [
                18983,
                19038
            ],
            [
                19038,
                19157
            ],
            [
                19157,
                19199
            ],
            [
                19199,
                19223
            ],
            [
                19223,
                19282
            ],
            [
                19282,
                19305
            ],
            [
                19305,
                19317
            ],
            [
                19317,
                19348
            ],
            [
                19348,
                19385
            ],
            [
                19385,
                19449
            ],
            [
                19449,
                19550
            ],
            [
                19550,
                19687
            ],
            [
                19687,
                19724
            ],
            [
                19724,
                19747
            ],
            [
                19747,
                19753
            ],
            [
                19753,
                19778
            ],
            [
                19778,
                19809
            ],
            [
                19809,
                20007
            ],
            [
                20007,
                20174
            ],
            [
                20174,
                20305
            ],
            [
                20305,
                20374
            ],
            [
                20374,
                20432
            ],
            [
                20432,
                20477
            ],
            [
                20477,
                20575
            ],
            [
                20575,
                20601
            ],
            [
                20601,
                20912
            ],
            [
                20912,
                21040
            ],
            [
                21040,
                21188
            ],
            [
                21188,
                21215
            ],
            [
                21215,
                21269
            ],
            [
                21269,
                21275
            ],
            [
                21275,
                21573
            ],
            [
                21573,
                21616
            ],
            [
                21616,
                21690
            ],
            [
                21690,
                21699
            ],
            [
                21699,
                21762
            ],
            [
                21762,
                21931
            ],
            [
                21931,
                22029
            ],
            [
                22029,
                22113
            ],
            [
                22113,
                22152
            ],
            [
                22152,
                22183
            ],
            [
                22183,
                22361
            ],
            [
                22361,
                22562
            ],
            [
                22562,
                22617
            ],
            [
                22617,
                22643
            ],
            [
                22643,
                22662
            ],
            [
                22662,
                22736
            ],
            [
                22736,
                22771
            ],
            [
                22771,
                22776
            ],
            [
                22776,
                22820
            ],
            [
                22820,
                22959
            ],
            [
                22959,
                22974
            ],
            [
                22974,
                22988
            ],
            [
                22988,
                23004
            ],
            [
                23004,
                23065
            ],
            [
                23065,
                23092
            ],
            [
                23092,
                23134
            ],
            [
                23134,
                23187
            ],
            [
                23187,
                23194
            ],
            [
                23194,
                23214
            ],
            [
                23214,
                23245
            ],
            [
                23245,
                23266
            ],
            [
                23266,
                23282
            ],
            [
                23282,
                23402
            ],
            [
                23402,
                23451
            ],
            [
                23451,
                23500
            ],
            [
                23500,
                23523
            ],
            [
                23523,
                23547
            ],
            [
                23547,
                23625
            ],
            [
                23625,
                23679
            ],
            [
                23679,
                23753
            ],
            [
                23753,
                24022
            ],
            [
                24022,
                24128
            ],
            [
                24128,
                24192
            ],
            [
                24192,
                24425
            ],
            [
                24425,
                24502
            ],
            [
                24502,
                24567
            ],
            [
                24567,
                24631
            ],
            [
                24631,
                24677
            ],
            [
                24677,
                24749
            ],
            [
                24749,
                24851
            ],
            [
                24851,
                24877
            ],
            [
                24877,
                24898
            ],
            [
                24898,
                25229
            ],
            [
                25229,
                25390
            ],
            [
                25390,
                25415
            ],
            [
                25415,
                25431
            ],
            [
                25431,
                25487
            ],
            [
                25487,
                25554
            ],
            [
                25554,
                25584
            ],
            [
                25584,
                25733
            ],
            [
                25733,
                25818
            ],
            [
                25818,
                25868
            ],
            [
                25868,
                25924
            ],
            [
                25924,
                25957
            ],
            [
                25957,
                26109
            ],
            [
                26109,
                26321
            ],
            [
                26321,
                26430
            ],
            [
                26430,
                26478
            ],
            [
                26478,
                26622
            ],
            [
                26622,
                26668
            ],
            [
                26668,
                26697
            ],
            [
                26697,
                26788
            ],
            [
                26788,
                26821
            ],
            [
                26821,
                26900
            ],
            [
                26900,
                26978
            ],
            [
                26978,
                27036
            ],
            [
                27036,
                27115
            ],
            [
                27115,
                27252
            ],
            [
                27252,
                27277
            ],
            [
                27277,
                27305
            ],
            [
                27305,
                27352
            ],
            [
                27352,
                27437
            ],
            [
                27437,
                27497
            ],
            [
                27497,
                27843
            ]
        ]
    },
    "abridged": {
        "text": "Lately an abundant shower of curates has fallen upon the north of England: they lie very thick on the hills; every parish has one or more of them. But not of recent years are we about to speak; we are going back to the beginning of this century. Present years are dusty, sunburnt, hot, arid; we will avoid the noon, forget it in siesta, pass the midday in slumber, and dream of dawn.\nIf you think, from this prelude, that a romance is waiting for you, reader, you never were more mistaken. Do you expect sentiment, passion, and melodrama? Calm your expectations. Something real, cool, and solid lies before you; something unromantic as Monday morning, when people wake knowing that they must rise and go to work. You may have a taste of the exciting, perhaps towards the middle and close of the meal, but the first dish set upon the table shall be one that a Catholic might eat on Good Friday: it shall be cold lentils and vinegar; unleavened bread with bitter herbs, and no roast lamb.\nLately, I say, an abundant shower of curates has fallen upon the north of England; but in 1811 that rain had not descended. Curates were scarce then: there was no Pastoral Aid to stretch a helping hand to worn-out old rectors, allowing them to pay a vigorous young colleague from Oxford or Cambridge.\nYet even in those days of scarcity, curates might be found. A certain favoured district in the West Riding of Yorkshire could boast three blossoming within a circuit of twenty miles.\nYou shall see them, reader. Step into this neat garden-house on the edge of Whinbury; walk forward into the little parlour. There they are at dinner. Allow me to introduce them to you: Mr. Donne, curate of Whinbury; Mr. Malone, curate of Briarfield; Mr. Sweeting, curate of Nunnely. These are Mr. Donne's lodgings; Mr. Donne has kindly invited his brethren to dine. You and I will join the party, and hear what is to be heard. At present, however, they are only eating; and while they eat we will talk aside.\nThese gentlemen have all the activity of youth - an activity which their moping old vicars wish would be channelled into their pastoral duties, superintending the schools, and visiting the sick. But the young curates feel this to be dull work; they prefer to lavish their energies on visiting each other, rushing backwards and forwards between their respective lodgings - a triangle of visits, which they keep up all the year through. Season and weather make no difference; through snow and hail, wind and rain, they go and dine with each other.\nWhat attracts them it would be difficult to say. It is not friendship, for whenever they meet they quarrel. It is not religion; for they may discuss theology occasionally, but piety - never. It is not the love of eating and drinking: each might have as good a joint and pudding at his own lodgings as at his brother's. Mrs. Gale, Mrs. Hogg, and Mrs. Whipp - their respective landladies - affirm that \"it is just to give folk trouble.\" By \"folk\" the good ladies of course mean themselves.\nMr. Donne and his guests, as I have said, are at dinner; Mrs. Gale waits on them, but a spark of the hot kitchen fire is in her eye. She considers that the privilege of inviting a friend to a meal has been over-exercised of late. On Monday Mr. Malone came to breakfast and stayed to dinner; on Tuesday Mr. Malone and Mr. Sweeting came to tea, stayed to supper, occupied the spare bed, and ate breakfast on Wednesday morning; now, on Thursday, they are both here at dinner, and she is almost certain they will stay all night.\nMr. Sweeting is complaining that his slice of roast beef is very tough; Mr. Donne says the beer is flat. If they would only be civil Mrs. Gale wouldn't mind it so much; but \"these young parsons is so high and scornful, they set everybody beneath them. They don't treat her civilly, and they are always speaking against Yorkshire ways and Yorkshire folk.\" Mrs. Gale does not believe them to be real gentlemen. \"The old parsons are worth the whole lump of college lads; they have good manners, and are kind to high and low.\"\n\"More bread!\" cries Mr. Malone, in an accent which proclaims him a native of Ireland. Mrs. Gale hates Mr. Malone more than the other two; but she fears him also, for he is tall and strongly-built, with a high-featured, North-American-Indian sort of face, and a petrified, proud look. Mr. Malone's father called himself a gentleman; he was poor, in debt, and arrogant; and his son was like him.\nMrs. Gale offered him the loaf.\n\"Cut it, woman,\" said her guest; and the \"woman\" cut it accordingly. Had she followed her inclinations, she would have cut the curate also.\nThe curates had good appetites, and though the beef was \"tough,\" they ate a great deal of it. They swallowed a large amount of the \"flat beer,\" while a dish of Yorkshire pudding and two tureens of vegetables disappeared like leaves before locusts. The cheese, too, was eaten, and a spice-cake vanished like a vision. It was mourned in the kitchen by Abraham, Mrs. Gale's son; he had reckoned upon leftovers, and when his mother brought down the empty plate, he lifted up his voice and wept.\nThe curates, meantime, sat and sipped their wine. Mr. Malone, indeed, would rather have had whisky; but Mr. Donne did not keep any. While they sipped they argued, not on politics, nor philosophy, nor even theology - but on minute points of ecclesiastical discipline, frivolities which seemed empty as bubbles to all except themselves. Mr. Malone, after two glasses of wine, grew hilarious after his fashion; that is, he said rude things in a hectoring tone, and laughed clamorously at his own brilliance.\nHis companions were the butt for his humour. Malone had a stock of jokes which he used regularly, seldom varying his wit; for he never considered himself monotonous, and did not care what others thought. He favoured Mr. Donne with sarcasms about his thinness, his turned-up nose, and a threadbare coat which Mr. Donne used to wear when it rained.\nMr. Sweeting was bantered about his small stature and his musical accomplishments - he played the flute and sang hymns like an angel (so some young ladies of his parish thought) - sneered at as \"the ladies' pet;\" teased about his mamma and sisters, for whom poor Mr. Sweeting had some lingering regard, and of whom he was foolish enough now and then to speak to Malone, from whose nature all feelings of affection had somehow been omitted.\nThe victims met these attacks each in his own way: Mr. Donne with a stilted complacency; Mr. Sweeting with the indifference of a light, easy nature. When Malone's raillery became too offensive, they turned the tables on him by asking him how many boys had shouted \"Irish Peter!\" after him in the street that day (his name being Peter Augustus Malone); asking whether it was the fashion in Ireland for clergymen to carry loaded pistols and a shillelagh when they made pastoral visits; and inquiring what he meant by storrum (as he pronounced storm).\nMalone was soon in a towering passion. He shouted and gesticulated; Donne and Sweeting laughed. He reviled them as Saxons and snobs at the very top of his voice; they taunted him with coming from a conquered land. The little parlour was in uproar. It seemed a wonder that Mr. and Mrs. Gale did not send for a constable to keep the peace. But they were used to these clerical quarrels, and knew that they were as harmless as they were noisy, and that the curates would be the best of friends tomorrow morning.\nAs the Gales were sitting by their kitchen fire, listening to the thump of Malone's fist on the parlour table, and to the consequent jingle of glasses - as they thus sat, a foot was heard on the door-step, and the knocker rapped sharply. Mr. Gale opened the door.\n\"Whom have you upstairs in the parlour?\" asked a voice - a rather remarkable voice, nasal and abrupt.\n\"Mr. Helstone, is it you, sir? I could hardly see you in the dusk. Will you walk in?\"\n\"I want to know first whether it is worth my while. Whom have you upstairs?\"\n\"The curates, sir.\"\n\"What! all of them?\"\n\"Yes, sir.\"\n\"That will do.\"\nWith these words entered a middle-aged man, in black. He walked across the kitchen, opened the inner door, and stood listening to the noise above, which was louder than ever.\n\"Hey!\" he exclaimed; \"Have you often this sort of work?\"\n\"They're young, you know, sir,\" said Mr. Gale deprecatingly.\n\"Young! They want caning. Bad boys! but I'll-\"\nHe passed through the inner door and mounted the stair. Making his entrance without warning, he stood before the curates.\nThey were silent; they were transfixed. The invader - short of stature, but straight and broad shouldered, with a hawk's head, beak, and eye - folded his arms and surveyed his young friends, if friends they were.\n\"What!\" he began, in a voice made purposely deep and hollow. \"What! has the miracle of Pentecost been renewed? Have the cloven tongues come down again? The sound filled the whole house just now. I heard the seventeen languages in full action two minutes since.\"\n\"I beg your pardon, Mr. Helstone,\" began Mr. Donne; \"take a seat, sir. Have a glass of wine.\"\nBut the falcon in the black coat went on:\n\"Why do I talk about the gift of tongues? Gift, indeed! It was the confusion of tongues which has gabbled me deaf as a post!\"\n\"I assure you, sir, we were only having a little chat together over a glass of wine after dinner - settling the Dissenters!\"\n\"Oh! settling the Dissenters, were you? Was Malone settling the Dissenters? It sounded to me much more like he was settling you. Your quarrel was making almost as much noise as Moses Barraclough, the preaching tailor, makes in the Methodist chapel down yonder. It is your fault, Malone.\"\n\"Mine, sir?\"\n\"Yours, sir. Donne and Sweeting were quiet before you came. I wish you had left your Irish habits behind you. Dublin student ways won't do here. Behaviour which might pass unnoticed in a wild Irish bog will, in a decent English parish, bring disgrace on you, and, far worse, on the church you represent.\"\nMr. Helstone, standing straight as a ramrod, looked - despite his clerical hat, coat and gaiters - more like a veteran officer chiding his subalterns than a priest exhorting his sons in the faith. Gospel mildness seemed never to have breathed over that keen brown face, on which firmness and sagacity had carved their lines.\nHe continued, \"I heard Barraclough this wet night bellowing like a bull in the opposition shop; and I find you, gentlemen, tarrying over your half-pint of muddy port wine, and scolding like angry old women. Barraclough, hypocrite as he is, should not attract all the weaver-girls in their ribbons to his chapel. It's little wonder that you perform the holy service of our church to bare walls. But enough of that. I came to see Malone. I have an errand for thee, O captain!\"\n\"What is it?\" inquired Malone discontentedly. \"There can be no funeral to take at this time of day.\"\n\"Have you any weapons about you?\"\n\"I have the pistols you gave me. I never part with them. I lay them by my bedside at night. And I have my shillelagh - my blackthorn club.\"\n\"Very good. Will you go to Hollow's Mill?\"\n\"What is stirring at Hollow's Mill?\"\n\"Nothing as yet, nor perhaps will be; but Moore is alone there. He has sent all the workmen he can trust to Stilbro'; there are only two women left in the place. It would be a nice opportunity for any of his well-wishers to pay him a visit.\"\n\"I am none of his well-wishers, sir. I don't care for him.\"\n\"So! Malone, you are afraid.\"\n\"You know me better than that. If I really thought there was a chance of a row I would go: but Moore is a strange man, whom I never pretend to understand; and for the sake of his company I would not stir a step.\"\n\"But there is a chance of a row,\" said Mr. Helstone. \"Even if a positive riot does not take place, it is unlikely this night will pass tranquilly. You know Moore has resolved to have new machinery in his mill, and he expects two wagon-loads of frames and shears from Stilbro' this evening. Scott, the overlooker, and a few other men are gone to fetch them.\"\n\"They will bring them in safely enough, sir.\"\n\"Moore says so, and affirms he wants nobody. Some one, however, he must have, in case anything should happen. I call him very careless. He sits in the counting-house with the shutters open; he goes out after dark, wanders right up the hollow, and down Fieldhead Lane, just as if he were the darling of the neighbourhood, rather than its detestation. He takes no warning from the fates of the mill-owners Pearson and Armitage - both shot, one in his own house and the other on the moor.\"\n\"But he would take warning, sir,\" interposed Mr. Sweeting, \"if he heard what I heard the other day.\"\n\"What did you hear, Davy?\"\n\"You know Mike Hartley the weaver, sir? Well, when he has been drinking for a few weeks, he generally goes up to Nunnely vicarage to tell Mr. Hall a piece of his mind about his sermons, and warn him that he is sitting in outer darkness.\"\n\"That has nothing to do with Moore.\"\n\"He is a violent Jacobin and leveller, sir.\"\n\"I know,\" said Mr. Helstone. \"When he is very drunk, his mind is always running on regicide.\"\n\"Mr. Hall thinks that Mike has no personal hatred of Moore, but that he wants Moore to be made an example of. Is Mike Hartley in his right mind, do you think, sir?\" inquired Sweeting.\n\"Can't tell, Davy. He may be crazed, or only crafty, or perhaps both.\"\n\"He talks of seeing visions, sir.\"\n\"Ay! He is a very Daniel for visions. He came last Friday night to describe one that had been revealed to him in Nunnely Park that afternoon.\"\n\"Tell it, sir. What was it?\" urged Sweeting.\n\"Davy, thou shalt hear. Mike is out of work, like many others, unfortunately. Sir Philip Nunnely's steward gave him a job about the priory. Mike said he was busy hedging late in the afternoon, when he heard a band at a distance - bugles, fifes, and a trumpet. He looked up and amongst the trees he saw moving objects, red and white. The wood was full of them; they poured out and filled the park. He perceived they were soldiers - tens of thousands; but silent as they marched, regiment after regiment, across the park. He followed them to Nunnely Common; the music still played soft and distant. They were in sight half an hour; then they marched away. The whole time he heard neither voice nor footsteps - nothing but the faint music playing a march.\"\n\"Where did they go, sir?\"\n\"Towards Briarfield. Mike followed them, but a column of smoke rolled over the fields, he said, and when it cleared away the soldiers had vanished. Mike decided the vision meant bloodshed and conflict.\"\n\"Do you believe it, sir?\" asked Sweeting.\n\"Do you, Davy? - but come, Malone; why are you not off?\"\n\"I am rather surprised, sir, you did not stay with Moore yourself. You like this kind of thing.\"\n\"So I should have done,\" said Mr. Helstone, \"if I had not invited Boultby to sup with me. I promised to send you as my substitute; though Moore did not thank me. He would much rather have had me than you, Peter. Should there be any real need of help I shall join you. The mill-bell will give warning. Meantime, go - unless Davy Sweeting or Joseph Donne prefers going. - What do you say, gentlemen?\"\n\"I never touch weapons,\" said Mr. Donne.\n\"No, no, Mr. Helstone. My mother wouldn't like it,\" pleaded Sweeting.\nHelstone smiled sardonically; Malone laughed a horse-laugh. He took his pistols, hat and cudgel, and saying that \"he never felt more in tune for a shindy in his life,\" he left, making the house shake with the bang of the front door behind him.",
        "paragraph_chars": [
            [
                0,
                384
            ],
            [
                384,
                987
            ],
            [
                987,
                1288
            ],
            [
                1288,
                1471
            ],
            [
                1471,
                1980
            ],
            [
                1980,
                2526
            ],
            [
                2526,
                3014
            ],
            [
                3014,
                3539
            ],
            [
                3539,
                4062
            ],
            [
                4062,
                4456
            ],
            [
                4456,
                4488
            ],
            [
                4488,
                4628
            ],
            [
                4628,
                5119
            ],
            [
                5119,
                5624
            ],
            [
                5624,
                5971
            ],
            [
                5971,
                6411
            ],
            [
                6411,
                6960
            ],
            [
                6960,
                7469
            ],
            [
                7469,
                7733
            ],
            [
                7733,
                7835
            ],
            [
                7835,
                7921
            ],
            [
                7921,
                7998
            ],
            [
                7998,
                8018
            ],
            [
                8018,
                8039
            ],
            [
                8039,
                8051
            ],
            [
                8051,
                8067
            ],
            [
                8067,
                8242
            ],
            [
                8242,
                8299
            ],
            [
                8299,
                8360
            ],
            [
                8360,
                8407
            ],
            [
                8407,
                8529
            ],
            [
                8529,
                8742
            ],
            [
                8742,
                9004
            ],
            [
                9004,
                9098
            ],
            [
                9098,
                9140
            ],
            [
                9140,
                9266
            ],
            [
                9266,
                9391
            ],
            [
                9391,
                9679
            ],
            [
                9679,
                9692
            ],
            [
                9692,
                9997
            ],
            [
                9997,
                10322
            ],
            [
                10322,
                10797
            ],
            [
                10797,
                10898
            ],
            [
                10898,
                10932
            ],
            [
                10932,
                11072
            ],
            [
                11072,
                11115
            ],
            [
                11115,
                11152
            ],
            [
                11152,
                11394
            ],
            [
                11394,
                11454
            ],
            [
                11454,
                11484
            ],
            [
                11484,
                11697
            ],
            [
                11697,
                12055
            ],
            [
                12055,
                12101
            ],
            [
                12101,
                12588
            ],
            [
                12588,
                12689
            ],
            [
                12689,
                12716
            ],
            [
                12716,
                12954
            ],
            [
                12954,
                12991
            ],
            [
                12991,
                13036
            ],
            [
                13036,
                13130
            ],
            [
                13130,
                13314
            ],
            [
                13314,
                13385
            ],
            [
                13385,
                13420
            ],
            [
                13420,
                13563
            ],
            [
                13563,
                13608
            ],
            [
                13608,
                14362
            ],
            [
                14362,
                14388
            ],
            [
                14388,
                14591
            ],
            [
                14591,
                14633
            ],
            [
                14633,
                14690
            ],
            [
                14690,
                14787
            ],
            [
                14787,
                15186
            ],
            [
                15186,
                15227
            ],
            [
                15227,
                15297
            ],
            [
                15297,
                15540
            ]
        ],
        "segment_chars": [
            [
                0,
                147
            ],
            [
                147,
                246
            ],
            [
                246,
                384
            ],
            [
                384,
                490
            ],
            [
                490,
                539
            ],
            [
                539,
                563
            ],
            [
                563,
                713
            ],
            [
                713,
                987
            ],
            [
                987,
                1111
            ],
            [
                1111,
                1288
            ],
            [
                1288,
                1348
            ],
            [
                1348,
                1471
            ],
            [
                1471,
                1499
            ],
            [
                1499,
                1595
            ],
            [
                1595,
                1621
            ],
            [
                1621,
                1754
            ],
            [
                1754,
                1837
            ],
            [
                1837,
                1898
            ],
            [
                1898,
                1980
            ],
            [
                1980,
                2175
            ],
            [
                2175,
                2415
            ],
            [
                2415,
                2526
            ],
            [
                2526,
                2575
            ],
            [
                2575,
                2634
            ],
            [
                2634,
                2717
            ],
            [
                2717,
                2845
            ],
            [
                2845,
                2961
            ],
            [
                2961,
                3014
            ],
            [
                3014,
                3147
            ],
            [
                3147,
                3244
            ],
            [
                3244,
                3539
            ],
            [
                3539,
                3644
            ],
            [
                3644,
                3791
            ],
            [
                3791,
                3894
            ],
            [
                3894,
                3948
            ],
            [
                3948,
                4062
            ],
            [
                4062,
                4076
            ],
            [
                4076,
                4148
            ],
            [
                4148,
                4346
            ],
            [
                4346,
                4456
            ],
            [
                4456,
                4488
            ],
            [
                4488,
                4557
            ],
            [
                4557,
                4628
            ],
            [
                4628,
                4722
            ],
            [
                4722,
                4876
            ],
            [
                4876,
                4945
            ],
            [
                4945,
                5119
            ],
            [
                5119,
                5169
            ],
            [
                5169,
                5251
            ],
            [
                5251,
                5454
            ],
            [
                5454,
                5624
            ],
            [
                5624,
                5669
            ],
            [
                5669,
                5828
            ],
            [
                5828,
                5971
            ],
            [
                5971,
                6411
            ],
            [
                6411,
                6560
            ],
            [
                6560,
                6690
            ],
            [
                6690,
                6960
            ],
            [
                6960,
                6999
            ],
            [
                6999,
                7056
            ],
            [
                7056,
                7174
            ],
            [
                7174,
                7208
            ],
            [
                7208,
                7298
            ],
            [
                7298,
                7469
            ],
            [
                7469,
                7707
            ],
            [
                7707,
                7733
            ],
            [
                7733,
                7774
            ],
            [
                7774,
                7835
            ],
            [
                7835,
                7866
            ],
            [
                7866,
                7902
            ],
            [
                7902,
                7921
            ],
            [
                7921,
                7973
            ],
            [
                7973,
                7998
            ],
            [
                7998,
                8018
            ],
            [
                8018,
                8025
            ],
            [
                8025,
                8039
            ],
            [
                8039,
                8051
            ],
            [
                8051,
                8067
            ],
            [
                8067,
                8121
            ],
            [
                8121,
                8242
            ],
            [
                8242,
                8249
            ],
            [
                8249,
                8299
            ],
            [
                8299,
                8360
            ],
            [
                8360,
                8368
            ],
            [
                8368,
                8386
            ],
            [
                8386,
                8396
            ],
            [
                8396,
                8407
            ],
            [
                8407,
                8463
            ],
            [
                8463,
                8529
            ],
            [
                8529,
                8569
            ],
            [
                8569,
                8742
            ],
            [
                8742,
                8750
            ],
            [
                8750,
                8803
            ],
            [
                8803,
                8810
            ],
            [
                8810,
                8853
            ],
            [
                8853,
                8894
            ],
            [
                8894,
                8937
            ],
            [
                8937,
                9004
            ],
            [
                9004,
                9075
            ],
            [
                9075,
                9098
            ],
            [
                9098,
                9140
            ],
            [
                9140,
                9182
            ],
            [
                9182,
                9196
            ],
            [
                9196,
                9266
            ],
            [
                9266,
                9391
            ],
            [
                9391,
                9396
            ],
            [
                9396,
                9431
            ],
            [
                9431,
                9467
            ],
            [
                9467,
                9520
            ],
            [
                9520,
                9652
            ],
            [
                9652,
                9679
            ],
            [
                9679,
                9692
            ],
            [
                9692,
                9705
            ],
            [
                9705,
                9752
            ],
            [
                9752,
                9802
            ],
            [
                9802,
                9837
            ],
            [
                9837,
                9997
            ],
            [
                9997,
                10194
            ],
            [
                10194,
                10322
            ],
            [
                10322,
                10529
            ],
            [
                10529,
                10634
            ],
            [
                10634,
                10716
            ],
            [
                10716,
                10736
            ],
            [
                10736,
                10758
            ],
            [
                10758,
                10797
            ],
            [
                10797,
                10811
            ],
            [
                10811,
                10843
            ],
            [
                10843,
                10898
            ],
            [
                10898,
                10932
            ],
            [
                10932,
                10965
            ],
            [
                10965,
                10989
            ],
            [
                10989,
                11024
            ],
            [
                11024,
                11072
            ],
            [
                11072,
                11084
            ],
            [
                11084,
                11115
            ],
            [
                11115,
                11152
            ],
            [
                11152,
                11216
            ],
            [
                11216,
                11314
            ],
            [
                11314,
                11394
            ],
            [
                11394,
                11431
            ],
            [
                11431,
                11454
            ],
            [
                11454,
                11459
            ],
            [
                11459,
                11484
            ],
            [
                11484,
                11515
            ],
            [
                11515,
                11697
            ],
            [
                11697,
                11750
            ],
            [
                11750,
                11844
            ],
            [
                11844,
                11987
            ],
            [
                11987,
                12055
            ],
            [
                12055,
                12101
            ],
            [
                12101,
                12146
            ],
            [
                12146,
                12211
            ],
            [
                12211,
                12237
            ],
            [
                12237,
                12451
            ],
            [
                12451,
                12588
            ],
            [
                12588,
                12689
            ],
            [
                12689,
                12716
            ],
            [
                12716,
                12756
            ],
            [
                12756,
                12954
            ],
            [
                12954,
                12991
            ],
            [
                12991,
                13036
            ],
            [
                13036,
                13065
            ],
            [
                13065,
                13130
            ],
            [
                13130,
                13240
            ],
            [
                13240,
                13295
            ],
            [
                13295,
                13314
            ],
            [
                13314,
                13333
            ],
            [
                13333,
                13385
            ],
            [
                13385,
                13420
            ],
            [
                13420,
                13425
            ],
            [
                13425,
                13458
            ],
            [
                13458,
                13563
            ],
            [
                13563,
                13578
            ],
            [
                13578,
                13592
            ],
            [
                13592,
                13608
            ],
            [
                13608,
                13632
            ],
            [
                13632,
                13686
            ],
            [
                13686,
                13748
            ],
            [
                13748,
                13868
            ],
            [
                13868,
                13941
            ],
            [
                13941,
                14005
            ],
            [
                14005,
                14128
            ],
            [
                14128,
                14205
            ],
            [
                14205,
                14262
            ],
            [
                14262,
                14362
            ],
            [
                14362,
                14388
            ],
            [
                14388,
                14409
            ],
            [
                14409,
                14536
            ],
            [
                14536,
                14591
            ],
            [
                14591,
                14617
            ],
            [
                14617,
                14633
            ],
            [
                14633,
                14648
            ],
            [
                14648,
                14690
            ],
            [
                14690,
                14757
            ],
            [
                14757,
                14787
            ],
            [
                14787,
                14877
            ],
            [
                14877,
                14949
            ],
            [
                14949,
                14999
            ],
            [
                14999,
                15055
            ],
            [
                15055,
                15088
            ],
            [
                15088,
                15155
            ],
            [
                15155,
                15186
            ],
            [
                15186,
                15227
            ],
            [
                15227,
                15250
            ],
            [
                15250,
                15297
            ],
            [
                15297,
                15357
            ],
            [
                15357,
                15540
            ]
        ],
        "overlap_chars": [
            [
                7,
                145
            ],
            [
                145,
                147
            ],
            [
                147,
                157
            ],
            [
                165,
                244
            ],
            [
                246,
                299
            ],
            [
                306,
                384
            ],
            [
                384,
                421
            ],
            [
                422,
                434
            ],
            [
                443,
                490
            ],
            [
                490,
                503
            ],
            [
                504,
                514
            ],
            [
                515,
                522
            ],
            [
                522,
                539
            ],
            [
                539,
                561
            ],
            [
                561,
                563
            ],
            [
                563,
                656
            ],
            [
                664,
                668
            ],
            [
                677,
                700
            ],
            [
                707,
                711
            ],
            [
                711,
                713
            ],
            [
                713,
                716
            ],
            [
                721,
                804
            ],
            [
                805,
                867
            ],
            [
                868,
                892
            ],
            [
                892,
                930
            ],
            [
                930,
                931
            ],
            [
                932,
                987
            ],
            [
                993,
                1076
            ],
            [
                1082,
                1086
            ],
            [
                1087,
                1111
            ],
            [
                1111,
                1162
            ],
            [
                1163,
                1212
            ],
            [
                1212,
                1213
            ],
            [
                1223,
                1227
            ],
            [
                1228,
                1287
            ],
            [
                1288,
                1322
            ],
            [
                1322,
                1323
            ],
            [
                1324,
                1331
            ],
            [
                1332,
                1348
            ],
            [
                1348,
                1425
            ],
            [
                1426,
                1470
            ],
            [
                1471,
                1499
            ],
            [
                1499,
                1538
            ],
            [
                1544,
                1555
            ],
            [
                1557,
                1595
            ],
            [
                1595,
                1621
            ],
            [
                1621,
                1754
            ],
            [
                1754,
                1784
            ],
            [
                1786,
                1830
            ],
            [
                1835,
                1837
            ],
            [
                1837,
                1866
            ],
            [
                1866,
                1898
            ],
            [
                1898,
                1980
            ],
            [
                1980,
                1995
            ],
            [
                2001,
                2020
            ],
            [
                2021,
                2026
            ],
            [
                2029,
                2070
            ],
            [
                2071,
                2075
            ],
            [
                2076,
                2081
            ],
            [
                2096,
                2100
            ],
            [
                2101,
                2123
            ],
            [
                2124,
                2129
            ],
            [
                2139,
                2155
            ],
            [
                2165,
                2173
            ],
            [
                2173,
                2175
            ],
            [
                2175,
                2182
            ],
            [
                2197,
                2235
            ],
            [
                2236,
                2238
            ],
            [
                2246,
                2263
            ],
            [
                2278,
                2283
            ],
            [
                2283,
                2284
            ],
            [
                2285,
                2315
            ],
            [
                2324,
                2349
            ],
            [
                2352,
                2413
            ],
            [
                2413,
                2415
            ],
            [
                2415,
                2453
            ],
            [
                2462,
                2491
            ],
            [
                2492,
                2496
            ],
            [
                2497,
                2508
            ],
            [
                2509,
                2525
            ],
            [
                2526,
                2575
            ],
            [
                2575,
                2634
            ],
            [
                2634,
                2652
            ],
            [
                2652,
                2653
            ],
            [
                2658,
                2674
            ],
            [
                2675,
                2683
            ],
            [
                2684,
                2707
            ],
            [
                2710,
                2717
            ],
            [
                2717,
                2803
            ],
            [
                2804,
                2823
            ],
            [
                2824,
                2826
            ],
            [
                2827,
                2845
            ],
            [
                2845,
                2881
            ],
            [
                2884,
                2911
            ],
            [
                2921,
                2937
            ],
            [
                2938,
                2961
            ],
            [
                2961,
                3012
            ],
            [
                3012,
                3014
            ],
            [
                3014,
                3147
            ],
            [
                3147,
                3210
            ],
            [
                3211,
                3219
            ],
            [
                3235,
                3244
            ],
            [
                3244,
                3264
            ],
            [
                3265,
                3293
            ],
            [
                3294,
                3296
            ],
            [
                3297,
                3343
            ],
            [
                3344,
                3356
            ],
            [
                3364,
                3402
            ],
            [
                3403,
                3406
            ],
            [
                3407,
                3538
            ],
            [
                3539,
                3554
            ],
            [
                3555,
                3571
            ],
            [
                3572,
                3575
            ],
            [
                3576,
                3595
            ],
            [
                3596,
                3644
            ],
            [
                3644,
                3706
            ],
            [
                3706,
                3747
            ],
            [
                3748,
                3784
            ],
            [
                3791,
                3795
            ],
            [
                3799,
                3801
            ],
            [
                3802,
                3811
            ],
            [
                3812,
                3815
            ],
            [
                3819,
                3820
            ],
            [
                3821,
                3824
            ],
            [
                3825,
                3891
            ],
            [
                3894,
                3920
            ],
            [
                3921,
                3931
            ],
            [
                3932,
                3936
            ],
            [
                3946,
                3948
            ],
            [
                3948,
                3964
            ],
            [
                3969,
                4011
            ],
            [
                4017,
                4034
            ],
            [
                4039,
                4062
            ],
            [
                4062,
                4076
            ],
            [
                4076,
                4096
            ],
            [
                4107,
                4112
            ],
            [
                4113,
                4126
            ],
            [
                4127,
                4138
            ],
            [
                4142,
                4146
            ],
            [
                4146,
                4148
            ],
            [
                4148,
                4184
            ],
            [
                4185,
                4233
            ],
            [
                4234,
                4238
            ],
            [
                4239,
                4242
            ],
            [
                4243,
                4257
            ],
            [
                4257,
                4263
            ],
            [
                4264,
                4265
            ],
            [
                4266,
                4310
            ],
            [
                4311,
                4315
            ],
            [
                4315,
                4322
            ],
            [
                4323,
                4332
            ],
            [
                4332,
                4333
            ],
            [
                4334,
                4344
            ],
            [
                4344,
                4346
            ],
            [
                4346,
                4365
            ],
            [
                4373,
                4392
            ],
            [
                4394,
                4405
            ],
            [
                4407,
                4419
            ],
            [
                4420,
                4456
            ],
            [
                4456,
                4473
            ],
            [
                4478,
                4488
            ],
            [
                4488,
                4557
            ],
            [
                4557,
                4614
            ],
            [
                4622,
                4626
            ],
            [
                4626,
                4628
            ],
            [
                4628,
                4722
            ],
            [
                4722,
                4736
            ],
            [
                4737,
                4738
            ],
            [
                4752,
                4805
            ],
            [
                4806,
                4835
            ],
            [
                4836,
                4876
            ],
            [
                4876,
                4892
            ],
            [
                4893,
                4896
            ],
            [
                4902,
                4907
            ],
            [
                4908,
                4909
            ],
            [
                4915,
                4920
            ],
            [
                4921,
                4943
            ],
            [
                4943,
                4945
            ],
            [
                4948,
                4951
            ],
            [
                4960,
                5002
            ],
            [
                5002,
                5024
            ],
            [
                5034,
                5078
            ],
            [
                5084,
                5117
            ],
            [
                5117,
                5119
            ],
            [
                5119,
                5167
            ],
            [
                5167,
                5169
            ],
            [
                5169,
                5194
            ],
            [
                5195,
                5232
            ],
            [
                5233,
                5245
            ],
            [
                5249,
                5251
            ],
            [
                5251,
                5302
            ],
            [
                5303,
                5318
            ],
            [
                5319,
                5323
            ],
            [
                5324,
                5332
            ],
            [
                5335,
                5434
            ],
            [
                5442,
                5454
            ],
            [
                5454,
                5465
            ],
            [
                5472,
                5492
            ],
            [
                5493,
                5497
            ],
            [
                5498,
                5538
            ],
            [
                5539,
                5611
            ],
            [
                5622,
                5624
            ],
            [
                5624,
                5638
            ],
            [
                5648,
                5652
            ],
            [
                5657,
                5660
            ],
            [
                5667,
                5669
            ],
            [
                5669,
                5696
            ],
            [
                5697,
                5705
            ],
            [
                5711,
                5720
            ],
            [
                5720,
                5749
            ],
            [
                5750,
                5758
            ],
            [
                5770,
                5801
            ],
            [
                5802,
                5828
            ],
            [
                5828,
                5839
            ],
            [
                5840,
                5849
            ],
            [
                5850,
                5854
            ],
            [
                5855,
                5863
            ],
            [
                5864,
                5873
            ],
            [
                5882,
                5883
            ],
            [
                5884,
                5903
            ],
            [
                5904,
                5907
            ],
            [
                5908,
                5909
            ],
            [
                5910,
                5920
            ],
            [
                5926,
                5931
            ],
            [
                5934,
                5941
            ],
            [
                5947,
                5949
            ],
            [
                5960,
                5969
            ],
            [
                5969,
                5971
            ],
            [
                5971,
                6006
            ],
            [
                6013,
                6020
            ],
            [
                6021,
                6024
            ],
            [
                6025,
                6052
            ],
            [
                6055,
                6094
            ],
            [
                6108,
                6147
            ],
            [
                6151,
                6329
            ],
            [
                6333,
                6339
            ],
            [
                6339,
                6351
            ],
            [
                6372,
                6374
            ],
            [
                6375,
                6411
            ],
            [
                6411,
                6486
            ],
            [
                6487,
                6498
            ],
            [
                6498,
                6551
            ],
            [
                6558,
                6559
            ],
            [
                6560,
                6589
            ],
            [
                6590,
                6604
            ],
            [
                6605,
                6609
            ],
            [
                6617,
                6690
            ],
            [
                6690,
                6699
            ],
            [
                6700,
                6702
            ],
            [
                6703,
                6706
            ],
            [
                6714,
                6724
            ],
            [
                6728,
                6732
            ],
            [
                6739,
                6762
            ],
            [
                6770,
                6788
            ],
            [
                6797,
                6845
            ],
            [
                6846,
                6858
            ],
            [
                6863,
                6894
            ],
            [
                6895,
                6898
            ],
            [
                6899,
                6908
            ],
            [
                6926,
                6935
            ],
            [
                6935,
                6940
            ],
            [
                6941,
                6951
            ],
            [
                6952,
                6957
            ],
            [
                6960,
                6966
            ],
            [
                6967,
                6970
            ],
            [
                6976,
                6999
            ],
            [
                6999,
                7001
            ],
            [
                7014,
                7056
            ],
            [
                7056,
                7107
            ],
            [
                7108,
                7114
            ],
            [
                7115,
                7143
            ],
            [
                7156,
                7174
            ],
            [
                7174,
                7199
            ],
            [
                7200,
                7206
            ],
            [
                7208,
                7257
            ],
            [
                7258,
                7298
            ],
            [
                7298,
                7311
            ],
            [
                7317,
                7319
            ],
            [
                7320,
                7343
            ],
            [
                7343,
                7348
            ],
            [
                7349,
                7353
            ],
            [
                7354,
                7363
            ],
            [
                7364,
                7400
            ],
            [
                7401,
                7404
            ],
            [
                7405,
                7421
            ],
            [
                7422,
                7430
            ],
            [
                7431,
                7439
            ],
            [
                7440,
                7442
            ],
            [
                7443,
                7450
            ],
            [
                7460,
                7469
            ],
            [
                7469,
                7475
            ],
            [
                7482,
                7534
            ],
            [
                7541,
                7557
            ],
            [
                7561,
                7601
            ],
            [
                7602,
                7611
            ],
            [
                7612,
                7619
            ],
            [
                7622,
                7663
            ],
            [
                7664,
                7690
            ],
            [
                7705,
                7706
            ],
            [
                7707,
                7715
            ],
            [
                7716,
                7722
            ],
            [
                7731,
                7733
            ],
            [
                7733,
                7774
            ],
            [
                7774,
                7787
            ],
            [
                7790,
                7822
            ],
            [
                7827,
                7833
            ],
            [
                7833,
                7835
            ],
            [
                7835,
                7836
            ],
            [
                7838,
                7866
            ],
            [
                7866,
                7888
            ],
            [
                7892,
                7895
            ],
            [
                7900,
                7902
            ],
            [
                7902,
                7918
            ],
            [
                7918,
                7921
            ],
            [
                7921,
                7971
            ],
            [
                7971,
                7973
            ],
            [
                7973,
                7998
            ],
            [
                7998,
                8018
            ],
            [
                8018,
                8025
            ],
            [
                8025,
                8039
            ],
            [
                8039,
                8051
            ],
            [
                8051,
                8067
            ],
            [
                8067,
                8083
            ],
            [
                8084,
                8091
            ],
            [
                8092,
                8121
            ],
            [
                8121,
                8130
            ],
            [
                8131,
                8149
            ],
            [
                8149,
                8157
            ],
            [
                8162,
                8172
            ],
            [
                8172,
                8193
            ],
            [
                8194,
                8196
            ],
            [
                8197,
                8212
            ],
            [
                8212,
                8213
            ],
            [
                8220,
                8223
            ],
            [
                8224,
                8242
            ],
            [
                8242,
                8249
            ],
            [
                8249,
                8251
            ],
            [
                8261,
                8262
            ],
            [
                8263,
                8299
            ],
            [
                8299,
                8328
            ],
            [
                8328,
                8335
            ],
            [
                8345,
                8360
            ],
            [
                8360,
                8368
            ],
            [
                8368,
                8386
            ],
            [
                8386,
                8396
            ],
            [
                8396,
                8404
            ],
            [
                8407,
                8439
            ],
            [
                8440,
                8463
            ],
            [
                8463,
                8469
            ],
            [
                8474,
                8529
            ],
            [
                8529,
                8567
            ],
            [
                8567,
                8569
            ],
            [
                8569,
                8572
            ],
            [
                8583,
                8613
            ],
            [
                8614,
                8617
            ],
            [
                8618,
                8623
            ],
            [
                8634,
                8635
            ],
            [
                8641,
                8669
            ],
            [
                8672,
                8687
            ],
            [
                8688,
                8740
            ],
            [
                8740,
                8742
            ],
            [
                8742,
                8750
            ],
            [
                8750,
                8759
            ],
            [
                8760,
                8762
            ],
            [
                8763,
                8785
            ],
            [
                8786,
                8790
            ],
            [
                8791,
                8794
            ],
            [
                8795,
                8801
            ],
            [
                8803,
                8810
            ],
            [
                8810,
                8853
            ],
            [
                8853,
                8894
            ],
            [
                8894,
                8937
            ],
            [
                8937,
                8983
            ],
            [
                8984,
                9004
            ],
            [
                9004,
                9069
            ],
            [
                9070,
                9075
            ],
            [
                9075,
                9095
            ],
            [
                9102,
                9130
            ],
            [
                9140,
                9141
            ],
            [
                9145,
                9182
            ],
            [
                9182,
                9196
            ],
            [
                9196,
                9202
            ],
            [
                9203,
                9263
            ],
            [
                9266,
                9355
            ],
            [
                9356,
                9362
            ],
            [
                9374,
                9391
            ],
            [
                9391,
                9396
            ],
            [
                9396,
                9431
            ],
            [
                9431,
                9467
            ],
            [
                9467,
                9498
            ],
            [
                9506,
                9514
            ],
            [
                9518,
                9520
            ],
            [
                9537,
                9564
            ],
            [
                9565,
                9608
            ],
            [
                9615,
                9650
            ],
            [
                9650,
                9652
            ],
            [
                9652,
                9657
            ],
            [
                9663,
                9668
            ],
            [
                9668,
                9679
            ],
            [
                9679,
                9692
            ],
            [
                9692,
                9705
            ],
            [
                9705,
                9750
            ],
            [
                9750,
                9752
            ],
            [
                9752,
                9758
            ],
            [
                9759,
                9802
            ],
            [
                9802,
                9837
            ],
            [
                9847,
                9883
            ],
            [
                9890,
                9893
            ],
            [
                9894,
                9945
            ],
            [
                9949,
                9955
            ],
            [
                9956,
                9973
            ],
            [
                9994,
                9997
            ],
            [
                9997,
                10041
            ],
            [
                10051,
                10076
            ],
            [
                10077,
                10081
            ],
            [
                10082,
                10093
            ],
            [
                10096,
                10100
            ],
            [
                10106,
                10151
            ],
            [
                10152,
                10153
            ],
            [
                10154,
                10194
            ],
            [
                10194,
                10209
            ],
            [
                10210,
                10216
            ],
            [
                10217,
                10222
            ],
            [
                10223,
                10239
            ],
            [
                10240,
                10260
            ],
            [
                10265,
                10266
            ],
            [
                10276,
                10284
            ],
            [
                10285,
                10308
            ],
            [
                10309,
                10314
            ],
            [
                10315,
                10320
            ],
            [
                10320,
                10322
            ],
            [
                10322,
                10337
            ],
            [
                10337,
                10356
            ],
            [
                10357,
                10371
            ],
            [
                10372,
                10381
            ],
            [
                10382,
                10388
            ],
            [
                10389,
                10393
            ],
            [
                10394,
                10400
            ],
            [
                10401,
                10416
            ],
            [
                10416,
                10428
            ],
            [
                10429,
                10432
            ],
            [
                10432,
                10529
            ],
            [
                10529,
                10530
            ],
            [
                10536,
                10541
            ],
            [
                10542,
                10568
            ],
            [
                10573,
                10610
            ],
            [
                10611,
                10618
            ],
            [
                10619,
                10621
            ],
            [
                10622,
                10625
            ],
            [
                10639,
                10657
            ],
            [
                10658,
                10661
            ],
            [
                10662,
                10714
            ],
            [
                10714,
                10716
            ],
            [
                10716,
                10729
            ],
            [
                10734,
                10736
            ],
            [
                10736,
                10756
            ],
            [
                10758,
                10774
            ],
            [
                10779,
                10797
            ],
            [
                10797,
                10811
            ],
            [
                10811,
                10843
            ],
            [
                10843,
                10898
            ],
            [
                10898,
                10911
            ],
            [
                10912,
                10919
            ],
            [
                10920,
                10932
            ],
            [
                10932,
                10963
            ],
            [
                10963,
                10965
            ],
            [
                10965,
                10989
            ],
            [
                10989,
                10999
            ],
            [
                11000,
                11024
            ],
            [
                11028,
                11034
            ],
            [
                11051,
                11064
            ],
            [
                11069,
                11072
            ],
            [
                11072,
                11084
            ],
            [
                11084,
                11115
            ],
            [
                11115,
                11152
            ],
            [
                11152,
                11216
            ],
            [
                11216,
                11299
            ],
            [
                11303,
                11314
            ],
            [
                11314,
                11391
            ],
            [
                11391,
                11394
            ],
            [
                11394,
                11431
            ],
            [
                11431,
                11454
            ],
            [
                11454,
                11457
            ],
            [
                11457,
                11459
            ],
            [
                11459,
                11484
            ],
            [
                11484,
                11515
            ],
            [
                11515,
                11597
            ],
            [
                11598,
                11662
            ],
            [
                11663,
                11670
            ],
            [
                11671,
                11697
            ],
            [
                11697,
                11707
            ],
            [
                11708,
                11710
            ],
            [
                11711,
                11728
            ],
            [
                11756,
                11794
            ],
            [
                11794,
                11795
            ],
            [
                11796,
                11831
            ],
            [
                11832,
                11844
            ],
            [
                11844,
                11893
            ],
            [
                11905,
                11987
            ],
            [
                11987,
                12019
            ],
            [
                12026,
                12055
            ],
            [
                12055,
                12086
            ],
            [
                12087,
                12101
            ],
            [
                12101,
                12146
            ],
            [
                12146,
                12178
            ],
            [
                12179,
                12211
            ],
            [
                12211,
                12237
            ],
            [
                12237,
                12284
            ],
            [
                12289,
                12302
            ],
            [
                12303,
                12343
            ],
            [
                12344,
                12347
            ],
            [
                12348,
                12367
            ],
            [
                12367,
                12421
            ],
            [
                12434,
                12449
            ],
            [
                12449,
                12451
            ],
            [
                12451,
                12479
            ],
            [
                12486,
                12488
            ],
            [
                12505,
                12512
            ],
            [
                12517,
                12525
            ],
            [
                12533,
                12588
            ],
            [
                12588,
                12595
            ],
            [
                12596,
                12601
            ],
            [
                12602,
                12619
            ],
            [
                12619,
                12645
            ],
            [
                12645,
                12646
            ],
            [
                12647,
                12648
            ],
            [
                12648,
                12689
            ],
            [
                12689,
                12716
            ],
            [
                12716,
                12738
            ],
            [
                12739,
                12742
            ],
            [
                12743,
                12749
            ],
            [
                12749,
                12754
            ],
            [
                12754,
                12756
            ],
            [
                12760,
                12761
            ],
            [
                12762,
                12766
            ],
            [
                12767,
                12769
            ],
            [
                12770,
                12803
            ],
            [
                12803,
                12817
            ],
            [
                12823,
                12825
            ],
            [
                12826,
                12845
            ],
            [
                12846,
                12901
            ],
            [
                12902,
                12922
            ],
            [
                12926,
                12954
            ],
            [
                12954,
                12955
            ],
            [
                12955,
                12991
            ],
            [
                12991,
                12992
            ],
            [
                12992,
                13036
            ],
            [
                13036,
                13043
            ],
            [
                13063,
                13065
            ],
            [
                13066,
                13127
            ],
            [
                13131,
                13146
            ],
            [
                13147,
                13151
            ],
            [
                13152,
                13188
            ],
            [
                13188,
                13193
            ],
            [
                13199,
                13201
            ],
            [
                13208,
                13213
            ],
            [
                13214,
                13216
            ],
            [
                13217,
                13240
            ],
            [
                13240,
                13295
            ],
            [
                13295,
                13312
            ],
            [
                13312,
                13314
            ],
            [
                13314,
                13333
            ],
            [
                13333,
                13353
            ],
            [
                13354,
                13377
            ],
            [
                13378,
                13385
            ],
            [
                13385,
                13420
            ],
            [
                13420,
                13425
            ],
            [
                13425,
                13437
            ],
            [
                13438,
                13458
            ],
            [
                13458,
                13465
            ],
            [
                13466,
                13550
            ],
            [
                13551,
                13563
            ],
            [
                13563,
                13578
            ],
            [
                13578,
                13592
            ],
            [
                13592,
                13608
            ],
            [
                13608,
                13632
            ],
            [
                13632,
                13686
            ],
            [
                13690,
                13714
            ],
            [
                13715,
                13748
            ],
            [
                13748,
                13752
            ],
            [
                13758,
                13760
            ],
            [
                13761,
                13777
            ],
            [
                13778,
                13800
            ],
            [
                13801,
                13814
            ],
            [
                13815,
                13835
            ],
            [
                13838,
                13856
            ],
            [
                13857,
                13866
            ],
            [
                13866,
                13868
            ],
            [
                13868,
                13880
            ],
            [
                13885,
                13929
            ],
            [
                13934,
                13939
            ],
            [
                13939,
                13941
            ],
            [
                13941,
                14005
            ],
            [
                14005,
                14007
            ],
            [
                14008,
                14036
            ],
            [
                14039,
                14061
            ],
            [
                14072,
                14076
            ],
            [
                14077,
                14128
            ],
            [
                14128,
                14205
            ],
            [
                14205,
                14260
            ],
            [
                14260,
                14262
            ],
            [
                14262,
                14303
            ],
            [
                14316,
                14353
            ],
            [
                14354,
                14362
            ],
            [
                14362,
                14388
            ],
            [
                14388,
                14409
            ],
            [
                14409,
                14427
            ],
            [
                14427,
                14432
            ],
            [
                14433,
                14450
            ],
            [
                14451,
                14457
            ],
            [
                14458,
                14474
            ],
            [
                14475,
                14483
            ],
            [
                14484,
                14487
            ],
            [
                14488,
                14492
            ],
            [
                14493,
                14508
            ],
            [
                14509,
                14521
            ],
            [
                14526,
                14534
            ],
            [
                14534,
                14536
            ],
            [
                14536,
                14540
            ],
            [
                14549,
                14559
            ],
            [
                14566,
                14579
            ],
            [
                14580,
                14591
            ],
            [
                14591,
                14598
            ],
            [
                14607,
                14617
            ],
            [
                14617,
                14633
            ],
            [
                14633,
                14647
            ],
            [
                14650,
                14690
            ],
            [
                14690,
                14757
            ],
            [
                14757,
                14787
            ],
            [
                14787,
                14809
            ],
            [
                14829,
                14830
            ],
            [
                14835,
                14836
            ],
            [
                14837,
                14840
            ],
            [
                14841,
                14844
            ],
            [
                14853,
                14875
            ],
            [
                14875,
                14877
            ],
            [
                14877,
                14917
            ],
            [
                14931,
                14949
            ],
            [
                14949,
                14999
            ],
            [
                14999,
                15055
            ],
            [
                15055,
                15088
            ],
            [
                15088,
                15100
            ],
            [
                15103,
                15153
            ],
            [
                15153,
                15154
            ],
            [
                15157,
                15183
            ],
            [
                15186,
                15200
            ],
            [
                15208,
                15227
            ],
            [
                15227,
                15231
            ],
            [
                15232,
                15250
            ],
            [
                15250,
                15297
            ],
            [
                15297,
                15357
            ],
            [
                15357,
                15359
            ],
            [
                15360,
                15368
            ],
            [
                15376,
                15377
            ],
            [
                15378,
                15462
            ],
            [
                15462,
                15467
            ],
            [
                15472,
                15473
            ],
            [
                15474,
                15523
            ],
            [
                15524,
                15540
            ]
        ],
        "row_chars": [
            [
                0,
                147
            ],
            [
                147,
                384
            ],
            [
                384,
                490
            ],
            [
                490,
                539
            ],
            [
                539,
                563
            ],
            [
                563,
                713
            ],
            [
                713,
                987
            ],
            [
                987,
                1111
            ],
            [
                1111,
                1288
            ],
            [
                1288,
                1288
            ],
            [
                1288,
                1288
            ],
            [
                1288,
                1348
            ],
            [
                1348,
                1471
            ],
            [
                1471,
                1499
            ],
            [
                1499,
                1595
            ],
            [
                1595,
                1621
            ],
            [
                1621,
                1754
            ],
            [
                1754,
                1837
            ],
            [
                1837,
                1898
            ],
            [
                1898,
                1980
            ],
            [
                1980,
                2175
            ],
            [
                2175,
                2415
            ],
            [
                2415,
                2526
            ],
            [
                2526,
                2575
            ],
            [
                2575,
                2634
            ],
            [
                2634,
                2717
            ],
            [
                2717,
                2845
            ],
            [
                2845,
                2961
            ],
            [
                2961,
                3014
            ],
            [
                3014,
                3147
            ],
            [
                3147,
                3244
            ],
            [
                3244,
                3539
            ],
            [
                3539,
                3539
            ],
            [
                3539,
                3644
            ],
            [
                3644,
                3791
            ],
            [
                3791,
                3948
            ],
            [
                3948,
                4062
            ],
            [
                4062,
                4076
            ],
            [
                4076,
                4148
            ],
            [
                4148,
                4346
            ],
            [
                4346,
                4456
            ],
            [
                4456,
                4488
            ],
            [
                4488,
                4557
            ],
            [
                4557,
                4628
            ],
            [
                4628,
                4722
            ],
            [
                4722,
                4876
            ],
            [
                4876,
                4945
            ],
            [
                4945,
                5119
            ],
            [
                5119,
                5169
            ],
            [
                5169,
                5251
            ],
            [
                5251,
                5454
            ],
            [
                5454,
                5624
            ],
            [
                5624,
                5669
            ],
            [
                5669,
                5828
            ],
            [
                5828,
                5971
            ],
            [
                5971,
                6411
            ],
            [
                6411,
                6560
            ],
            [
                6560,
                6690
            ],
            [
                6690,
                6960
            ],
            [
                6960,
                6960
            ],
            [
                6960,
                6999
            ],
            [
                6999,
                7056
            ],
            [
                7056,
                7174
            ],
            [
                7174,
                7174
            ],
            [
                7174,
                7298
            ],
            [
                7298,
                7469
            ],
            [
                7469,
                7707
            ],
            [
                7707,
                7733
            ],
            [
                7733,
                7774
            ],
            [
                7774,
                7835
            ],
            [
                7835,
                7866
            ],
            [
                7866,
                7902
            ],
            [
                7902,
                7921
            ],
            [
                7921,
                7973
            ],
            [
                7973,
                7998
            ],
            [
                7998,
                8018
            ],
            [
                8018,
                8025
            ],
            [
                8025,
                8039
            ],
            [
                8039,
                8051
            ],
            [
                8051,
                8051
            ],
            [
                8051,
                8051
            ],
            [
                8051,
                8067
            ],
            [
                8067,
                8121
            ],
            [
                8121,
                8242
            ],
            [
                8242,
                8249
            ],
            [
                8249,
                8299
            ],
            [
                8299,
                8299
            ],
            [
                8299,
                8360
            ],
            [
                8360,
                8368
            ],
            [
                8368,
                8386
            ],
            [
                8386,
                8396
            ],
            [
                8396,
                8407
            ],
            [
                8407,
                8463
            ],
            [
                8463,
                8463
            ],
            [
                8463,
                8529
            ],
            [
                8529,
                8569
            ],
            [
                8569,
                8742
            ],
            [
                8742,
                8750
            ],
            [
                8750,
                8810
            ],
            [
                8810,
                8853
            ],
            [
                8853,
                8894
            ],
            [
                8894,
                8894
            ],
            [
                8894,
                8937
            ],
            [
                8937,
                9004
            ],
            [
                9004,
                9075
            ],
            [
                9075,
                9098
            ],
            [
                9098,
                9098
            ],
            [
                9098,
                9140
            ],
            [
                9140,
                9182
            ],
            [
                9182,
                9196
            ],
            [
                9196,
                9196
            ],
            [
                9196,
                9266
            ],
            [
                9266,
                9266
            ],
            [
                9266,
                9266
            ],
            [
                9266,
                9266
            ],
            [
                9266,
                9266
            ],
            [
                9266,
                9391
            ],
            [
                9391,
                9396
            ],
            [
                9396,
                9431
            ],
            [
                9431,
                9467
            ],
            [
                9467,
                9520
            ],
            [
                9520,
                9652
            ],
            [
                9652,
                9679
            ],
            [
                9679,
                9692
            ],
            [
                9692,
                9705
            ],
            [
                9705,
                9752
            ],
            [
                9752,
                9802
            ],
            [
                9802,
                9837
            ],
            [
                9837,
                9997
            ],
            [
                9997,
                9997
            ],
            [
                9997,
                10194
            ],
            [
                10194,
                10322
            ],
            [
                10322,
                10529
            ],
            [
                10529,
                10716
            ],
            [
                10716,
                10736
            ],
            [
                10736,
                10797
            ],
            [
                10797,
                10811
            ],
            [
                10811,
                10843
            ],
            [
                10843,
                10898
            ],
            [
                10898,
                10932
            ],
            [
                10932,
                10965
            ],
            [
                10965,
                10989
            ],
            [
                10989,
                11024
            ],
            [
                11024,
                11072
            ],
            [
                11072,
                11084
            ],
            [
                11084,
                11115
            ],
            [
                11115,
                11152
            ],
            [
                11152,
                11216
            ],
            [
                11216,
                11314
            ],
            [
                11314,
                11394
            ],
            [
                11394,
                11431
            ],
            [
                11431,
                11454
            ],
            [
                11454,
                11459
            ],
            [
                11459,
                11484
            ],
            [
                11484,
                11515
            ],
            [
                11515,
                11697
            ],
            [
                11697,
                11844
            ],
            [
                11844,
                11987
            ],
            [
                11987,
                12055
            ],
            [
                12055,
                12101
            ],
            [
                12101,
                12146
            ],
            [
                12146,
                12211
            ],
            [
                12211,
                12237
            ],
            [
                12237,
                12451
            ],
            [
                12451,
                12588
            ],
            [
                12588,
                12689
            ],
            [
                12689,
                12716
            ],
            [
                12716,
                12756
            ],
            [
                12756,
                12756
            ],
            [
                12756,
                12954
            ],
            [
                12954,
                12991
            ],
            [
                12991,
                13036
            ],
            [
                13036,
                13065
            ],
            [
                13065,
                13130
            ],
            [
                13130,
                13130
            ],
            [
                13130,
                13130
            ],
            [
                13130,
                13130
            ],
            [
                13130,
                13130
            ],
            [
                13130,
                13130
            ],
            [
                13130,
                13240
            ],
            [
                13240,
                13240
            ],
            [
                13240,
                13295
            ],
            [
                13295,
                13314
            ],
            [
                13314,
                13333
            ],
            [
                13333,
                13385
            ],
            [
                13385,
                13420
            ],
            [
                13420,
                13425
            ],
            [
                13425,
                13458
            ],
            [
                13458,
                13563
            ],
            [
                13563,
                13578
            ],
            [
                13578,
                13592
            ],
            [
                13592,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13608
            ],
            [
                13608,
                13632
            ],
            [
                13632,
                13632
            ],
            [
                13632,
                13686
            ],
            [
                13686,
                13748
            ],
            [
                13748,
                13868
            ],
            [
                13868,
                13941
            ],
            [
                13941,
                14005
            ],
            [
                14005,
                14128
            ],
            [
                14128,
                14205
            ],
            [
                14205,
                14205
            ],
            [
                14205,
                14205
            ],
            [
                14205,
                14205
            ],
            [
                14205,
                14262
            ],
            [
                14262,
                14362
            ],
            [
                14362,
                14388
            ],
            [
                14388,
                14409
            ],
            [
                14409,
                14536
            ],
            [
                14536,
                14591
            ],
            [
                14591,
                14617
            ],
            [
                14617,
                14633
            ],
            [
                14633,
                14690
            ],
            [
                14690,
                14757
            ],
            [
                14757,
                14787
            ],
            [
                14787,
                14877
            ],
            [
                14877,
                14949
            ],
            [
                14949,
                14999
            ],
            [
                14999,
                15055
            ],
            [
                15055,
                15088
            ],
            [
                15088,
                15186
            ],
            [
                15186,
                15186
            ],
            [
                15186,
                15186
            ],
            [
                15186,
                15186
            ],
            [
                15186,
                15186
            ],
            [
                15186,
                15186
            ],
            [
                15186,
                15186
            ],
            [
                15186,
                15186
            ],
            [
                15186,
                15186
            ],
            [
                15186,
                15186
            ],
            [
                15186,
                15227
            ],
            [
                15227,
                15227
            ],
            [
                15227,
                15227
            ],
            [
                15227,
                15227
            ],
            [
                15227,
                15227
            ],
            [
                15227,
                15250
            ],
            [
                15250,
                15297
            ],
            [
                15297,
                15297
            ],
            [
                15297,
                15357
            ],
            [
                15357,
                15540
            ]
        ]
    }
}