{
    "original": {
        "text": "The evening was pitch dark: star and moon were quenched in gray rain-clouds--gray they would have been by day; by night they looked sable. Malone was not a man given to close observation of nature; her changes passed, for the most part, unnoticed by him. He could walk miles on the most varying April day and never see the beautiful dallying of earth and heaven--never mark when a sunbeam kissed the hill-tops, making them smile clear in green light, or when a shower wept over them, hiding their crests with the low-hanging, dishevelled tresses of a cloud. He did not, therefore, care to contrast the sky as it now appeared--a muffled, streaming vault, all black, save where, towards the east, the furnaces of Stilbro' ironworks threw a tremulous lurid shimmer on the horizon--with the same sky on an unclouded frosty night. He did not trouble himself to ask where the constellations and the planets were gone, or to regret the \"black-blue\" serenity of the air-ocean which those white islets stud, and which another ocean, of heavier and denser element, now rolled below and concealed. He just doggedly pursued his way, leaning a little forward as he walked, and wearing his hat on the back of his head, as his Irish manner was. \"Tramp, tramp,\" he went along the causeway, where the road boasted the privilege of such an accommodation; \"splash, splash,\" through the mire-filled cart ruts, where the flags were exchanged for soft mud. He looked but for certain landmarks--the spire of Briarfield Church; farther on, the lights of Redhouse. This was an inn; and when he reached it, the glow of a fire through a half-curtained window, a vision of glasses on a round table, and of revellers on an oaken settle, had nearly drawn aside the curate from his course. He thought longingly of a tumbler of whisky-and-water. In a strange place he would instantly have realized the dream; but the company assembled in that kitchen were Mr. Helstone's own parishioners; they all knew him. He sighed, and passed on.\nThe highroad was now to be quitted, as the remaining distance to Hollow's Mill might be considerably reduced by a short cut across fields. These fields were level and monotonous. Malone took a direct course through them, jumping hedge and wall. He passed but one building here, and that seemed large and hall-like, though irregular. You could see a high gable, then a long front, then a low gable, then a thick, lofty stack of chimneys. There were some trees behind it. It was dark; not a candle shone from any window. It was absolutely still; the rain running from the eaves, and the rather wild but very low whistle of the wind round the chimneys and through the boughs were the sole sounds in its neighbourhood.\nThis building passed, the fields, hitherto flat, declined in a rapid descent. Evidently a vale lay below, through which you could hear the water run. One light glimmered in the depth. For that beacon Malone steered.\nHe came to a little white house--you could see it was white even through this dense darkness--and knocked at the door. A fresh-faced servant opened it. By the candle she held was revealed a narrow passage, terminating in a narrow stair. Two doors covered with crimson baize, a strip of crimson carpet down the steps, contrasted with light-coloured walls and white floor, made the little interior look clean and fresh.\n\"Mr. Moore is at home, I suppose?\"\n\"Yes, sir, but he is not in.\"\n\"Not in! Where is he then?\"\n\"At the mill--in the counting-house.\"\nHere one of the crimson doors opened.\n\"Are the wagons come, Sarah?\" asked a female voice, and a female head at the same time was apparent. It might not be the head of a goddess--indeed a screw of curl-paper on each side the temples quite forbade that supposition--but neither was it the head of a Gorgon; yet Malone seemed to take it in the latter light. Big as he was, he shrank bashfully back into the rain at the view thereof, and saying, \"I'll go to him,\" hurried in seeming trepidation down a short lane, across an obscure yard, towards a huge black mill.\nThe work-hours were over; the \"hands\" were gone. The machinery was at rest, the mill shut up. Malone walked round it. Somewhere in its great sooty flank he found another chink of light; he knocked at another door, using for the purpose the thick end of his shillelah, with which he beat a rousing tattoo. A key turned; the door unclosed.\n\"Is it Joe Scott? What news of the wagons, Joe?\"\n\"No; it's myself. Mr. Helstone would send me.\"\n\"Oh! Mr. Malone.\" The voice in uttering this name had the slightest possible cadence of disappointment. After a moment's pause it continued, politely but a little formally,--\n\"I beg you will come in, Mr. Malone. I regret extremely Mr. Helstone should have thought it necessary to trouble you so far. There was no necessity--I told him so--and on such a night; but walk forwards.\"\nThrough a dark apartment, of aspect undistinguishable, Malone followed the speaker into a light and bright room within--very light and bright indeed it seemed to eyes which, for the last hour, had been striving to penetrate the double darkness of night and fog; but except for its excellent fire, and for a lamp of elegant design and vivid lustre burning on a table, it was a very plain place. The boarded floor was carpetless; the three or four stiff-backed, green-painted chairs seemed once to have furnished the kitchen of some farm-house; a desk of strong, solid formation, the table aforesaid, and some framed sheets on the stone-coloured walls, bearing plans for building, for gardening, designs of machinery, etc., completed the furniture of the place.\nPlain as it was, it seemed to satisfy Malone, who, when he had removed and hung up his wet surtout and hat, drew one of the rheumatic-looking chairs to the hearth, and set his knees almost within the bars of the red grate.\n\"Comfortable quarters you have here, Mr. Moore; and all snug to yourself.\"\n\"Yes, but my sister would be glad to see you, if you would prefer stepping into the house.\"\n\"Oh no! The ladies are best alone, I never was a lady's man. You don't mistake me for my friend Sweeting, do you, Mr. Moore?\"\n\"Sweeting! Which of them is that? The gentleman in the chocolate overcoat, or the little gentleman?\"\n\"The little one--he of Nunnely; the cavalier of the Misses Sykes, with the whole six of whom he is in love, ha! ha!\"\n\"Better be generally in love with all than specially with one, I should think, in that quarter.\"\n\"But he is specially in love with one besides, for when I and Donne urged him to make a choice amongst the fair bevy, he named--which do you think?\"\nWith a queer, quiet smile Mr. Moore replied, \"Dora, of course, or Harriet.\"\n\"Ha! ha! you've an excellent guess. But what made you hit on those two?\"\n\"Because they are the tallest, the handsomest, and Dora, at least, is the stoutest; and as your friend Mr. Sweeting is but a little slight figure, I concluded that, according to a frequent rule in such cases, he preferred his contrast.\"\n\"You are right; Dora it is. But he has no chance, has he, Moore?\"\n\"What has Mr. Sweeting besides his curacy?\"\nThis question seemed to tickle Malone amazingly. He laughed for full three minutes before he answered it.\n\"What has Sweeting? Why, David has his harp, or flute, which comes to the same thing. He has a sort of pinchbeck watch; ditto, ring; ditto, eyeglass. That's what he has.\"\n\"How would he propose to keep Miss Sykes in gowns only?\"\n\"Ha! ha! Excellent! I'll ask him that next time I see him. I'll roast him for his presumption. But no doubt he expects old Christopher Sykes would do something handsome. He is rich, is he not? They live in a large house.\"\n\"Sykes carries on an extensive concern.\"\n\"Therefore he must be wealthy, eh?\"\n\"Therefore he must have plenty to do with his wealth, and in these times would be about as likely to think of drawing money from the business to give dowries to his daughters as I should be to dream of pulling down the cottage there, and constructing on its ruins a house as large as Fieldhead.\"\n\"Do you know what I heard, Moore, the other day?\"\n\"No. Perhaps that I _was_ about to effect some such change. Your Briarfield gossips are capable of saying that or sillier things.\"\n\"That you were going to take Fieldhead on a lease (I thought it looked a dismal place, by-the-bye, to-night, as I passed it), and that it was your intention to settle a Miss Sykes there as mistress--to be married, in short, ha! ha! Now, which is it? Dora, I am sure. You said she was the handsomest.\"\n\"I wonder how often it has been settled that I was to be married since I came to Briarfield. They have assigned me every marriageable single woman by turns in the district. Now it was the two Misses Wynns--first the dark, then the light one; now the red-haired Miss Armitage; then the mature Ann Pearson. At present you throw on my shoulders all the tribe of the Misses Sykes. On what grounds this gossip rests God knows. I visit nowhere; I seek female society about as assiduously as you do, Mr. Malone. If ever I go to Whinbury, it is only to give Sykes or Pearson a call in their counting-house, where our discussions run on other topics than matrimony, and our thoughts are occupied with other things than courtships, establishments, dowries. The cloth we can't sell, the hands we can't employ, the mills we can't run, the perverse course of events generally, which we cannot alter, fill our hearts, I take it, pretty well at present, to the tolerably complete exclusion of such figments as love-making, etc.\"\n\"I go along with you completely, Moore. If there is one notion I hate more than another, it is that of marriage--I mean marriage in the vulgar weak sense, as a mere matter of sentiment--two beggarly fools agreeing to unite their indigence by some fantastic tie of feeling. Humbug! But an advantageous connection, such as can be formed in consonance with dignity of views and permanency of solid interests, is not so bad--eh?\"\n\"No,\" responded Moore, in an absent manner. The subject seemed to have no interest for him; he did not pursue it. After sitting for some time gazing at the fire with a preoccupied air, he suddenly turned his head.\n\"Hark!\" said he. \"Did you hear wheels?\"\nRising, he went to the window, opened it, and listened. He soon closed it. \"It is only the sound of the wind rising,\" he remarked, \"and the rivulet a little swollen, rushing down the hollow. I expected those wagons at six; it is near nine now.\"\n\"Seriously, do you suppose that the putting up of this new machinery will bring you into danger?\" inquired Malone. \"Helstone seems to think it will.\"\n\"I only wish the machines--the frames--were safe here, and lodged within the walls of this mill. Once put up, I defy the frame-breakers. Let them only pay me a visit and take the consequences. My mill is my castle.\"\n\"One despises such low scoundrels,\" observed Malone, in a profound vein of reflection. \"I almost wish a party would call upon you to-night; but the road seemed extremely quiet as I came along. I saw nothing astir.\"\n\"You came by the Redhouse?\"\n\"Yes.\"\n\"There would be nothing on that road. It is in the direction of Stilbro' the risk lies.\"\n\"And you think there is risk?\"\n\"What these fellows have done to others they may do to me. There is only this difference: most of the manufacturers seem paralyzed when they are attacked. Sykes, for instance, when his dressing-shop was set on fire and burned to the ground, when the cloth was torn from his tenters and left in shreds in the field, took no steps to discover or punish the miscreants: he gave up as tamely as a rabbit under the jaws of a ferret. Now I, if I know myself, should stand by my trade, my mill, and my machinery.\"\n\"Helstone says these three are your gods; that the 'Orders in Council' are with you another name for the seven deadly sins; that Castlereagh is your Antichrist, and the war-party his legions.\"\n\"Yes; I abhor all these things because they ruin me. They stand in my way. I cannot get on. I cannot execute my plans because of them. I see myself baffled at every turn by their untoward effects.\"\n\"But you are rich and thriving, Moore?\"\n\"I am very rich in cloth I cannot sell. You should step into my warehouse yonder, and observe how it is piled to the roof with pieces. Roakes and Pearson are in the same condition. America used to be their market, but the Orders in Council have cut that off.\"\nMalone did not seem prepared to carry on briskly a conversation of this sort. He began to knock the heels of his boots together, and to yawn.\n\"And then to think,\" continued Mr. Moore who seemed too much taken up with the current of his own thoughts to note the symptoms of his guest's _ennui_--\"to think that these ridiculous gossips of Whinbury and Briarfield will keep pestering one about being married! As if there was nothing to be done in life but to 'pay attention,' as they say, to some young lady, and then to go to church with her, and then to start on a bridal tour, and then to run through a round of visits, and then, I suppose, to be 'having a family.' Oh, que le diable emporte!\" He broke off the aspiration into which he was launching with a certain energy, and added, more calmly, \"I believe women talk and think only of these things, and they naturally fancy men's minds similarly occupied.\"\n\"Of course--of course,\" assented Malone; \"but never mind them.\" And he whistled, looked impatiently round, and seemed to feel a great want of something. This time Moore caught and, it appeared, comprehended his demonstrations.\n\"Mr. Malone,\" said he, \"you must require refreshment after your wet walk. I forget hospitality.\"\n\"Not at all,\" rejoined Malone; but he looked as if the right nail was at last hit on the head, nevertheless. Moore rose and opened a cupboard.\n\"It is my fancy,\" said he, \"to have every convenience within myself, and not to be dependent on the feminity in the cottage yonder for every mouthful I eat or every drop I drink. I often spend the evening and sup here alone, and sleep with Joe Scott in the mill. Sometimes I am my own watchman. I require little sleep, and it pleases me on a fine night to wander for an hour or two with my musket about the hollow. Mr. Malone, can you cook a mutton chop?\"\n\"Try me. I've done it hundreds of times at college.\"\n\"There's a dishful, then, and there's the gridiron. Turn them quickly. You know the secret of keeping the juices in?\"\n\"Never fear me; you shall see. Hand a knife and fork, please.\"\nThe curate turned up his coat-cuffs, and applied himself to the cookery with vigour. The manufacturer placed on the table plates, a loaf of bread, a black bottle, and two tumblers. He then produced a small copper kettle--still from the same well-stored recess, his cupboard--filled it with water from a large stone jar in a corner, set it on the fire beside the hissing gridiron, got lemons, sugar, and a small china punch-bowl; but while he was brewing the punch a tap at the door called him away.\n\"Is it you, Sarah?\"\n\"Yes, sir. Will you come to supper, please, sir?\"\n\"No; I shall not be in to-night; I shall sleep in the mill. So lock the doors, and tell your mistress to go to bed.\"\nHe returned.\n\"You have your household in proper order,\" observed Malone approvingly, as, with his fine face ruddy as the embers over which he bent, he assiduously turned the mutton chops. \"You are not under petticoat government, like poor Sweeting, a man--whew! how the fat spits! it has burnt my hand--destined to be ruled by women. Now you and I, Moore--there's a fine brown one for you, and full of gravy--you and I will have no gray mares in our stables when we marry.\"\n\"I don't know; I never think about it. If the gray mare is handsome and tractable, why not?\"\n\"The chops are done. Is the punch brewed?\"\n\"There is a glassful. Taste it. When Joe Scott and his minions return they shall have a share of this, provided they bring home the frames intact.\"\nMalone waxed very exultant over the supper. He laughed aloud at trifles, made bad jokes and applauded them himself, and, in short, grew unmeaningly noisy. His host, on the contrary, remained quiet as before. It is time, reader, that you should have some idea of the appearance of this same host. I must endeavour to sketch him as he sits at table.\nHe is what you would probably call, at first view, rather a strange-looking man; for he is thin, dark, sallow, very foreign of aspect, with shadowy hair carelessly streaking his forehead. It appears that he spends but little time at his toilet, or he would arrange it with more taste. He seems unconscious that his features are fine, that they have a southern symmetry, clearness, regularity in their chiselling; nor does a spectator become aware of this advantage till he has examined him well, for an anxious countenance and a hollow, somewhat haggard, outline of face disturb the idea of beauty with one of care. His eyes are large, and grave, and gray; their expression is intent and meditative, rather searching than soft, rather thoughtful than genial. When he parts his lips in a smile, his physiognomy is agreeable--not that it is frank or cheerful even then, but you feel the influence of a certain sedate charm, suggestive, whether truly or delusively, of a considerate, perhaps a kind nature, of feelings that may wear well at home--patient, forbearing, possibly faithful feelings. He is still young--not more than thirty; his stature is tall, his figure slender. His manner of speaking displeases. He has an outlandish accent, which, notwithstanding a studied carelessness of pronunciation and diction, grates on a British, and especially on a Yorkshire, ear.\nMr. Moore, indeed, was but half a Briton, and scarcely that. He came of a foreign ancestry by the mother's side, and was himself born and partly reared on a foreign soil. A hybrid in nature, it is probable he had a hybrid's feeling on many points--patriotism for one; it is likely that he was unapt to attach himself to parties, to sects, even to climes and customs; it is not impossible that he had a tendency to isolate his individual person from any community amidst which his lot might temporarily happen to be thrown, and that he felt it to be his best wisdom to push the interests of Robert Grard Moore, to the exclusion of philanthropic consideration for general interests, with which he regarded the said Grard Moore as in a great measure disconnected. Trade was Mr. Moore's hereditary calling: the Grards of Antwerp had been merchants for two centuries back. Once they had been wealthy merchants; but the uncertainties, the involvements, of business had come upon them; disastrous speculations had loosened by degrees the foundations of their credit. The house had stood on a tottering base for a dozen years; and at last, in the shock of the French Revolution, it had rushed down a total ruin. In its fall was involved the English and Yorkshire firm of Moore, closely connected with the Antwerp house, and of which one of the partners, resident in Antwerp, Robert Moore, had married Hortense Grard, with the prospect of his bride inheriting her father Constantine Grard's share in the business. She inherited, as we have seen, but his share in the liabilities of the firm; and these liabilities, though duly set aside by a composition with creditors, some said her son Robert accepted, in his turn, as a legacy, and that he aspired one day to discharge them, and to rebuild the fallen house of Grard and Moore on a scale at least equal to its former greatness. It was even supposed that he took by-past circumstances much to heart; and if a childhood passed at the side of a saturnine mother, under foreboding of coming evil, and a manhood drenched and blighted by the pitiless descent of the storm, could painfully impress the mind, _his_ probably was impressed in no golden characters.\nIf, however, he had a great end of restoration in view, it was not in his power to employ great means for its attainment. He was obliged to be content with the day of small things. When he came to Yorkshire, he--whose ancestors had owned warehouses in this seaport, and factories in that inland town, had possessed their town-house and their country-seat--saw no way open to him but to rent a cloth-mill in an out-of-the-way nook of an out-of-the-way district; to take a cottage adjoining it for his residence, and to add to his possessions, as pasture for his horse, and space for his cloth-tenters, a few acres of the steep, rugged land that lined the hollow through which his mill-stream brawled. All this he held at a somewhat high rent (for these war times were hard, and everything was dear) of the trustees of the Fieldhead estate, then the property of a minor.\nAt the time this history commences, Robert Moore had lived but two years in the district, during which period he had at least proved himself possessed of the quality of activity. The dingy cottage was converted into a neat, tasteful residence. Of part of the rough land he had made garden-ground, which he cultivated with singular, even with Flemish, exactness and care. As to the mill, which was an old structure, and fitted up with old machinery, now become inefficient and out of date, he had from the first evinced the strongest contempt for all its arrangements and appointments. His aim had been to effect a radical reform, which he had executed as fast as his very limited capital would allow; and the narrowness of that capital, and consequent check on his progress, was a restraint which galled his spirit sorely. Moore ever wanted to push on. \"Forward\" was the device stamped upon his soul; but poverty curbed him. Sometimes (figuratively) he foamed at the mouth when the reins were drawn very tight.\nIn this state of feeling, it is not to be expected that he would deliberate much as to whether his advance was or was not prejudicial to others. Not being a native, nor for any length of time a resident of the neighbourhood, he did not sufficiently care when the new inventions threw the old workpeople out of employ. He never asked himself where those to whom he no longer paid weekly wages found daily bread; and in this negligence he only resembled thousands besides, on whom the starving poor of Yorkshire seemed to have a closer claim.\nThe period of which I write was an overshadowed one in British history, and especially in the history of the northern provinces. War was then at its height. Europe was all involved therein. England, if not weary, was worn with long resistance--yes, and half her people were weary too, and cried out for peace on any terms. National honour was become a mere empty name, of no value in the eyes of many, because their sight was dim with famine; and for a morsel of meat they would have sold their birthright.\nThe \"Orders in Council,\" provoked by Napoleon's Milan and Berlin decrees, and forbidding neutral powers to trade with France, had, by offending America, cut off the principal market of the Yorkshire woollen trade, and brought it consequently to the verge of ruin. Minor foreign markets were glutted, and would receive no more. The Brazils, Portugal, Sicily, were all overstocked by nearly two years' consumption. At this crisis certain inventions in machinery were introduced into the staple manufactures of the north, which, greatly reducing the number of hands necessary to be employed, threw thousands out of work, and left them without legitimate means of sustaining life. A bad harvest supervened. Distress reached its climax. Endurance, overgoaded, stretched the hand of fraternity to sedition. The throes of a sort of moral earthquake were felt heaving under the hills of the northern counties. But, as is usual in such cases, nobody took much notice. When a food-riot broke out in a manufacturing town, when a gig-mill was burnt to the ground, or a manufacturer's house was attacked, the furniture thrown into the streets, and the family forced to flee for their lives, some local measures were or were not taken by the local magistracy. A ringleader was detected, or more frequently suffered to elude detection; newspaper paragraphs were written on the subject, and there the thing stopped. As to the sufferers, whose sole inheritance was labour, and who had lost that inheritance--who could not get work, and consequently could not get wages, and consequently could not get bread--they were left to suffer on, perhaps inevitably left. It would not do to stop the progress of invention, to damage science by discouraging its improvements; the war could not be terminated; efficient relief could not be raised. There was no help then; so the unemployed underwent their destiny--ate the bread and drank the waters of affliction.\nMisery generates hate. These sufferers hated the machines which they believed took their bread from them; they hated the buildings which contained those machines; they hated the manufacturers who owned those buildings. In the parish of Briarfield, with which we have at present to do, Hollow's Mill was the place held most abominable; Grard Moore, in his double character of semi-foreigner and thorough-going progressist, the man most abominated. And it perhaps rather agreed with Moore's temperament than otherwise to be generally hated, especially when he believed the thing for which he was hated a right and an expedient thing; and it was with a sense of warlike excitement he, on this night, sat in his counting-house waiting the arrival of his frame-laden wagons. Malone's coming and company were, it may be, most unwelcome to him. He would have preferred sitting alone; for he liked a silent, sombre, unsafe solitude. His watchman's musket would have been company enough for him; the full-flowing beck in the den would have delivered continuously the discourse most genial to his ear.\n* * * * *\nWith the queerest look in the world had the manufacturer for some ten minutes been watching the Irish curate, as the latter made free with the punch, when suddenly that steady gray eye changed, as if another vision came between it and Malone. Moore raised his hand.\n\"Chut!\" he said in his French fashion, as Malone made a noise with his glass. He listened a moment, then rose, put his hat on, and went out at the counting-house door.\nThe night was still, dark, and stagnant: the water yet rushed on full and fast; its flow almost seemed a flood in the utter silence. Moore's ear, however, caught another sound, very distant but yet dissimilar, broken and rugged--in short, a sound of heavy wheels crunching a stony road. He returned to the counting-house and lit a lantern, with which he walked down the mill-yard, and proceeded to open the gates. The big wagons were coming on; the dray-horses' huge hoofs were heard splashing in the mud and water. Moore hailed them.\n\"Hey, Joe Scott! Is all right?\"\nProbably Joe Scott was yet at too great a distance to hear the inquiry. He did not answer it.\n\"Is all right, I say?\" again asked Moore, when the elephant-like leader's nose almost touched his.\nSome one jumped out from the foremost wagon into the road; a voice cried aloud, \"Ay, ay, divil; all's raight! We've smashed 'em.\"\nAnd there was a run. The wagons stood still; they were now deserted.\n\"Joe Scott!\" No Joe Scott answered. \"Murgatroyd! Pighills! Sykes!\" No reply. Mr. Moore lifted his lantern and looked into the vehicles. There was neither man nor machinery; they were empty and abandoned.\nNow Mr. Moore loved his machinery. He had risked the last of his capital on the purchase of these frames and shears which to-night had been expected. Speculations most important to his interests depended on the results to be wrought by them. Where were they?\nThe words \"we've smashed 'em\" rang in his ears. How did the catastrophe affect him? By the light of the lantern he held were his features visible, relaxing to a singular smile--the smile the man of determined spirit wears when he reaches a juncture in his life where this determined spirit is to feel a demand on its strength, when the strain is to be made, and the faculty must bear or break. Yet he remained silent, and even motionless; for at the instant he neither knew what to say nor what to do. He placed the lantern on the ground, and stood with his arms folded, gazing down and reflecting.\nAn impatient trampling of one of the horses made him presently look up. His eye in the moment caught the gleam of something white attached to a part of the harness. Examined by the light of the lantern this proved to be a folded paper--a billet. It bore no address without; within was the superscription:--\n\"To the Divil of Hollow's Miln.\"\nWe will not copy the rest of the orthography, which was very peculiar, but translate it into legible English. It ran thus:--\n\"Your hellish machinery is shivered to smash on Stilbro' Moor, and your men are lying bound hand and foot in a ditch by the roadside. Take this as a warning from men that are starving, and have starving wives and children to go home to when they have done this deed. If you get new machines, or if you otherwise go on as you have done, you shall hear from us again. Beware!\"\n\"Hear from you again? Yes, I'll hear from you again, and you shall hear from me. I'll speak to you directly. On Stilbro' Moor you shall hear from me in a moment.\"\nHaving led the wagons within the gates, he hastened towards the cottage. Opening the door, he spoke a few words quickly but quietly to two females who ran to meet him in the passage. He calmed the seeming alarm of one by a brief palliative account of what had taken place; to the other he said, \"Go into the mill, Sarah--there is the key--and ring the mill-bell as loud as you can. Afterwards you will get another lantern and help me to light up the front.\"\nReturning to his horses, he unharnessed, fed, and stabled them with equal speed and care, pausing occasionally, while so occupied, as if to listen for the mill-bell. It clanged out presently, with irregular but loud and alarming din. The hurried, agitated peal seemed more urgent than if the summons had been steadily given by a practised hand. On that still night, at that unusual hour, it was heard a long way round. The guests in the kitchen of the Redhouse were startled by the clamour, and declaring that \"there must be summat more nor common to do at Hollow's Miln,\" they called for lanterns, and hurried to the spot in a body. And scarcely had they thronged into the yard with their gleaming lights, when the tramp of horses was heard, and a little man in a shovel hat, sitting erect on the back of a shaggy pony, \"rode lightly in,\" followed by an aide-de-camp mounted on a larger steed.\nMr. Moore, meantime, after stabling his dray-horses, had saddled his hackney, and with the aid of Sarah, the servant, lit up his mill, whose wide and long front now glared one great illumination, throwing a sufficient light on the yard to obviate all fear of confusion arising from obscurity. Already a deep hum of voices became audible. Mr. Malone had at length issued from the counting-house, previously taking the precaution to dip his head and face in the stone water-jug; and this precaution, together with the sudden alarm, had nearly restored to him the possession of those senses which the punch had partially scattered. He stood with his hat on the back of his head, and his shillelah grasped in his dexter fist, answering much at random the questions of the newly-arrived party from the Redhouse. Mr. Moore now appeared, and was immediately confronted by the shovel hat and the shaggy pony.\n\"Well, Moore, what is your business with us? I thought you would want us to-night--me and the hetman here (patting his pony's neck), and Tom and his charger. When I heard your mill-bell I could sit still no longer, so I left Boultby to finish his supper alone. But where is the enemy? I do not see a mask or a smutted face present; and there is not a pane of glass broken in your windows. Have you had an attack, or do you expect one?\"\n\"Oh, not at all! I have neither had one nor expect one,\" answered Moore coolly. \"I only ordered the bell to be rung because I want two or three neighbours to stay here in the Hollow while I and a couple or so more go over to Stilbro' Moor.\"\n\"To Stilbro' Moor! What to do? To meet the wagons?\"\n\"The wagons are come home an hour ago.\"\n\"Then all's right. What more would you have?\"\n\"They came home empty; and Joe Scott and company are left on the moor, and so are the frames. Read that scrawl.\"\nMr. Helstone received and perused the document of which the contents have before been given.\n\"Hum! They've only served you as they serve others. But, however, the poor fellows in the ditch will be expecting help with some impatience. This is a wet night for such a berth. I and Tom will go with you. Malone may stay behind and take care of the mill. What is the matter with him? His eyes seem starting out of his head.\"\n\"He has been eating a mutton chop.\"\n\"Indeed!--Peter Augustus, be on your guard. Eat no more mutton chops to-night. You are left here in command of these premises--an honourable post!\"\n\"Is anybody to stay with me?\"\n\"As many of the present assemblage as choose.--My lads, how many of you will remain here, and how many will go a little way with me and Mr. Moore on the Stilbro' road, to meet some men who have been waylaid and assaulted by frame-breakers?\"\nThe small number of three volunteered to go; the rest preferred staying behind. As Mr. Moore mounted his horse, the rector asked him in a low voice whether he had locked up the mutton chops, so that Peter Augustus could not get at them? The manufacturer nodded an affirmative, and the rescue-party set out.",
        "paragraph_chars": [
            [
                0,
                2002
            ],
            [
                2002,
                2717
            ],
            [
                2717,
                2933
            ],
            [
                2933,
                3351
            ],
            [
                3351,
                3386
            ],
            [
                3386,
                3416
            ],
            [
                3416,
                3444
            ],
            [
                3444,
                3482
            ],
            [
                3482,
                3520
            ],
            [
                3520,
                4043
            ],
            [
                4043,
                4381
            ],
            [
                4381,
                4430
            ],
            [
                4430,
                4477
            ],
            [
                4477,
                4652
            ],
            [
                4652,
                4857
            ],
            [
                4857,
                5617
            ],
            [
                5617,
                5840
            ],
            [
                5840,
                5915
            ],
            [
                5915,
                6007
            ],
            [
                6007,
                6133
            ],
            [
                6133,
                6234
            ],
            [
                6234,
                6351
            ],
            [
                6351,
                6448
            ],
            [
                6448,
                6597
            ],
            [
                6597,
                6673
            ],
            [
                6673,
                6746
            ],
            [
                6746,
                6983
            ],
            [
                6983,
                7049
            ],
            [
                7049,
                7093
            ],
            [
                7093,
                7199
            ],
            [
                7199,
                7370
            ],
            [
                7370,
                7427
            ],
            [
                7427,
                7649
            ],
            [
                7649,
                7690
            ],
            [
                7690,
                7726
            ],
            [
                7726,
                8022
            ],
            [
                8022,
                8072
            ],
            [
                8072,
                8203
            ],
            [
                8203,
                8504
            ],
            [
                8504,
                9518
            ],
            [
                9518,
                9944
            ],
            [
                9944,
                10158
            ],
            [
                10158,
                10198
            ],
            [
                10198,
                10443
            ],
            [
                10443,
                10593
            ],
            [
                10593,
                10809
            ],
            [
                10809,
                11024
            ],
            [
                11024,
                11052
            ],
            [
                11052,
                11059
            ],
            [
                11059,
                11148
            ],
            [
                11148,
                11179
            ],
            [
                11179,
                11686
            ],
            [
                11686,
                11879
            ],
            [
                11879,
                12077
            ],
            [
                12077,
                12117
            ],
            [
                12117,
                12377
            ],
            [
                12377,
                12519
            ],
            [
                12519,
                13286
            ],
            [
                13286,
                13513
            ],
            [
                13513,
                13610
            ],
            [
                13610,
                13753
            ],
            [
                13753,
                14209
            ],
            [
                14209,
                14262
            ],
            [
                14262,
                14380
            ],
            [
                14380,
                14443
            ],
            [
                14443,
                14942
            ],
            [
                14942,
                14962
            ],
            [
                14962,
                15012
            ],
            [
                15012,
                15129
            ],
            [
                15129,
                15142
            ],
            [
                15142,
                15603
            ],
            [
                15603,
                15696
            ],
            [
                15696,
                15739
            ],
            [
                15739,
                15887
            ],
            [
                15887,
                16235
            ],
            [
                16235,
                17607
            ],
            [
                17607,
                19805
            ],
            [
                19805,
                20674
            ],
            [
                20674,
                21685
            ],
            [
                21685,
                22226
            ],
            [
                22226,
                22733
            ],
            [
                22733,
                24669
            ],
            [
                24669,
                25761
            ],
            [
                25761,
                25771
            ],
            [
                25771,
                26037
            ],
            [
                26037,
                26205
            ],
            [
                26205,
                26740
            ],
            [
                26740,
                26772
            ],
            [
                26772,
                26866
            ],
            [
                26866,
                26965
            ],
            [
                26965,
                27095
            ],
            [
                27095,
                27164
            ],
            [
                27164,
                27368
            ],
            [
                27368,
                27627
            ],
            [
                27627,
                28226
            ],
            [
                28226,
                28533
            ],
            [
                28533,
                28566
            ],
            [
                28566,
                28691
            ],
            [
                28691,
                29066
            ],
            [
                29066,
                29229
            ],
            [
                29229,
                29687
            ],
            [
                29687,
                30582
            ],
            [
                30582,
                31483
            ],
            [
                31483,
                31919
            ],
            [
                31919,
                32160
            ],
            [
                32160,
                32212
            ],
            [
                32212,
                32252
            ],
            [
                32252,
                32298
            ],
            [
                32298,
                32411
            ],
            [
                32411,
                32504
            ],
            [
                32504,
                32831
            ],
            [
                32831,
                32867
            ],
            [
                32867,
                33015
            ],
            [
                33015,
                33045
            ],
            [
                33045,
                33286
            ],
            [
                33286,
                33592
            ]
        ],
        "segment_chars": [
            [
                0,
                139
            ],
            [
                139,
                255
            ],
            [
                255,
                558
            ],
            [
                558,
                826
            ],
            [
                826,
                1087
            ],
            [
                1087,
                1230
            ],
            [
                1230,
                1435
            ],
            [
                1435,
                1540
            ],
            [
                1540,
                1759
            ],
            [
                1759,
                1814
            ],
            [
                1814,
                1976
            ],
            [
                1976,
                2002
            ],
            [
                2002,
                2141
            ],
            [
                2141,
                2181
            ],
            [
                2181,
                2247
            ],
            [
                2247,
                2335
            ],
            [
                2335,
                2439
            ],
            [
                2439,
                2472
            ],
            [
                2472,
                2521
            ],
            [
                2521,
                2717
            ],
            [
                2717,
                2795
            ],
            [
                2795,
                2867
            ],
            [
                2867,
                2901
            ],
            [
                2901,
                2933
            ],
            [
                2933,
                3052
            ],
            [
                3052,
                3085
            ],
            [
                3085,
                3170
            ],
            [
                3170,
                3351
            ],
            [
                3351,
                3386
            ],
            [
                3386,
                3416
            ],
            [
                3416,
                3425
            ],
            [
                3425,
                3444
            ],
            [
                3444,
                3482
            ],
            [
                3482,
                3520
            ],
            [
                3520,
                3550
            ],
            [
                3550,
                3621
            ],
            [
                3621,
                3837
            ],
            [
                3837,
                4043
            ],
            [
                4043,
                4092
            ],
            [
                4092,
                4137
            ],
            [
                4137,
                4161
            ],
            [
                4161,
                4348
            ],
            [
                4348,
                4381
            ],
            [
                4381,
                4399
            ],
            [
                4399,
                4430
            ],
            [
                4430,
                4448
            ],
            [
                4448,
                4477
            ],
            [
                4477,
                4482
            ],
            [
                4482,
                4495
            ],
            [
                4495,
                4581
            ],
            [
                4581,
                4652
            ],
            [
                4652,
                4689
            ],
            [
                4689,
                4777
            ],
            [
                4777,
                4857
            ],
            [
                4857,
                5251
            ],
            [
                5251,
                5617
            ],
            [
                5617,
                5840
            ],
            [
                5840,
                5915
            ],
            [
                5915,
                6007
            ],
            [
                6007,
                6015
            ],
            [
                6015,
                6068
            ],
            [
                6068,
                6133
            ],
            [
                6133,
                6144
            ],
            [
                6144,
                6167
            ],
            [
                6167,
                6234
            ],
            [
                6234,
                6346
            ],
            [
                6346,
                6351
            ],
            [
                6351,
                6448
            ],
            [
                6448,
                6597
            ],
            [
                6597,
                6673
            ],
            [
                6673,
                6678
            ],
            [
                6678,
                6682
            ],
            [
                6682,
                6709
            ],
            [
                6709,
                6746
            ],
            [
                6746,
                6983
            ],
            [
                6983,
                7011
            ],
            [
                7011,
                7049
            ],
            [
                7049,
                7093
            ],
            [
                7093,
                7142
            ],
            [
                7142,
                7199
            ],
            [
                7199,
                7219
            ],
            [
                7219,
                7285
            ],
            [
                7285,
                7349
            ],
            [
                7349,
                7370
            ],
            [
                7370,
                7427
            ],
            [
                7427,
                7432
            ],
            [
                7432,
                7436
            ],
            [
                7436,
                7447
            ],
            [
                7447,
                7486
            ],
            [
                7486,
                7522
            ],
            [
                7522,
                7597
            ],
            [
                7597,
                7620
            ],
            [
                7620,
                7649
            ],
            [
                7649,
                7690
            ],
            [
                7690,
                7726
            ],
            [
                7726,
                8022
            ],
            [
                8022,
                8072
            ],
            [
                8072,
                8077
            ],
            [
                8077,
                8132
            ],
            [
                8132,
                8203
            ],
            [
                8203,
                8431
            ],
            [
                8431,
                8435
            ],
            [
                8435,
                8453
            ],
            [
                8453,
                8470
            ],
            [
                8470,
                8504
            ],
            [
                8504,
                8597
            ],
            [
                8597,
                8677
            ],
            [
                8677,
                8809
            ],
            [
                8809,
                8881
            ],
            [
                8881,
                8926
            ],
            [
                8926,
                9009
            ],
            [
                9009,
                9251
            ],
            [
                9251,
                9518
            ],
            [
                9518,
                9558
            ],
            [
                9558,
                9791
            ],
            [
                9791,
                9799
            ],
            [
                9799,
                9944
            ],
            [
                9944,
                9988
            ],
            [
                9988,
                10058
            ],
            [
                10058,
                10158
            ],
            [
                10158,
                10166
            ],
            [
                10166,
                10175
            ],
            [
                10175,
                10198
            ],
            [
                10198,
                10254
            ],
            [
                10254,
                10273
            ],
            [
                10273,
                10389
            ],
            [
                10389,
                10443
            ],
            [
                10443,
                10541
            ],
            [
                10541,
                10558
            ],
            [
                10558,
                10593
            ],
            [
                10593,
                10690
            ],
            [
                10690,
                10730
            ],
            [
                10730,
                10786
            ],
            [
                10786,
                10809
            ],
            [
                10809,
                10896
            ],
            [
                10896,
                11002
            ],
            [
                11002,
                11024
            ],
            [
                11024,
                11052
            ],
            [
                11052,
                11059
            ],
            [
                11059,
                11097
            ],
            [
                11097,
                11148
            ],
            [
                11148,
                11179
            ],
            [
                11179,
                11238
            ],
            [
                11238,
                11334
            ],
            [
                11334,
                11607
            ],
            [
                11607,
                11686
            ],
            [
                11686,
                11879
            ],
            [
                11879,
                11932
            ],
            [
                11932,
                11954
            ],
            [
                11954,
                11971
            ],
            [
                11971,
                12014
            ],
            [
                12014,
                12077
            ],
            [
                12077,
                12117
            ],
            [
                12117,
                12157
            ],
            [
                12157,
                12252
            ],
            [
                12252,
                12298
            ],
            [
                12298,
                12377
            ],
            [
                12377,
                12455
            ],
            [
                12455,
                12519
            ],
            [
                12519,
                12783
            ],
            [
                12783,
                13043
            ],
            [
                13043,
                13071
            ],
            [
                13071,
                13286
            ],
            [
                13286,
                13350
            ],
            [
                13350,
                13439
            ],
            [
                13439,
                13513
            ],
            [
                13513,
                13587
            ],
            [
                13587,
                13610
            ],
            [
                13610,
                13719
            ],
            [
                13719,
                13753
            ],
            [
                13753,
                13932
            ],
            [
                13932,
                14016
            ],
            [
                14016,
                14048
            ],
            [
                14048,
                14168
            ],
            [
                14168,
                14209
            ],
            [
                14209,
                14218
            ],
            [
                14218,
                14262
            ],
            [
                14262,
                14314
            ],
            [
                14314,
                14333
            ],
            [
                14333,
                14380
            ],
            [
                14380,
                14411
            ],
            [
                14411,
                14443
            ],
            [
                14443,
                14528
            ],
            [
                14528,
                14624
            ],
            [
                14624,
                14942
            ],
            [
                14942,
                14962
            ],
            [
                14962,
                14973
            ],
            [
                14973,
                15012
            ],
            [
                15012,
                15072
            ],
            [
                15072,
                15129
            ],
            [
                15129,
                15142
            ],
            [
                15142,
                15317
            ],
            [
                15317,
                15391
            ],
            [
                15391,
                15410
            ],
            [
                15410,
                15463
            ],
            [
                15463,
                15603
            ],
            [
                15603,
                15642
            ],
            [
                15642,
                15696
            ],
            [
                15696,
                15717
            ],
            [
                15717,
                15739
            ],
            [
                15739,
                15761
            ],
            [
                15761,
                15771
            ],
            [
                15771,
                15887
            ],
            [
                15887,
                15931
            ],
            [
                15931,
                16042
            ],
            [
                16042,
                16095
            ],
            [
                16095,
                16183
            ],
            [
                16183,
                16235
            ],
            [
                16235,
                16423
            ],
            [
                16423,
                16520
            ],
            [
                16520,
                16851
            ],
            [
                16851,
                16994
            ],
            [
                16994,
                17328
            ],
            [
                17328,
                17410
            ],
            [
                17410,
                17445
            ],
            [
                17445,
                17607
            ],
            [
                17607,
                17668
            ],
            [
                17668,
                17778
            ],
            [
                17778,
                18368
            ],
            [
                18368,
                18475
            ],
            [
                18475,
                18667
            ],
            [
                18667,
                18811
            ],
            [
                18811,
                19112
            ],
            [
                19112,
                19478
            ],
            [
                19478,
                19805
            ],
            [
                19805,
                19927
            ],
            [
                19927,
                19986
            ],
            [
                19986,
                20505
            ],
            [
                20505,
                20674
            ],
            [
                20674,
                20853
            ],
            [
                20853,
                20918
            ],
            [
                20918,
                21045
            ],
            [
                21045,
                21259
            ],
            [
                21259,
                21497
            ],
            [
                21497,
                21527
            ],
            [
                21527,
                21599
            ],
            [
                21599,
                21685
            ],
            [
                21685,
                21830
            ],
            [
                21830,
                22003
            ],
            [
                22003,
                22226
            ],
            [
                22226,
                22355
            ],
            [
                22355,
                22383
            ],
            [
                22383,
                22416
            ],
            [
                22416,
                22549
            ],
            [
                22549,
                22733
            ],
            [
                22733,
                22997
            ],
            [
                22997,
                23060
            ],
            [
                23060,
                23146
            ],
            [
                23146,
                23410
            ],
            [
                23410,
                23436
            ],
            [
                23436,
                23465
            ],
            [
                23465,
                23534
            ],
            [
                23534,
                23635
            ],
            [
                23635,
                23692
            ],
            [
                23692,
                23979
            ],
            [
                23979,
                24133
            ],
            [
                24133,
                24378
            ],
            [
                24378,
                24552
            ],
            [
                24552,
                24669
            ],
            [
                24669,
                24692
            ],
            [
                24692,
                24888
            ],
            [
                24888,
                25116
            ],
            [
                25116,
                25439
            ],
            [
                25439,
                25507
            ],
            [
                25507,
                25594
            ],
            [
                25594,
                25761
            ],
            [
                25761,
                25771
            ],
            [
                25771,
                26014
            ],
            [
                26014,
                26037
            ],
            [
                26037,
                26045
            ],
            [
                26045,
                26115
            ],
            [
                26115,
                26205
            ],
            [
                26205,
                26338
            ],
            [
                26338,
                26492
            ],
            [
                26492,
                26619
            ],
            [
                26619,
                26721
            ],
            [
                26721,
                26740
            ],
            [
                26740,
                26757
            ],
            [
                26757,
                26772
            ],
            [
                26772,
                26844
            ],
            [
                26844,
                26866
            ],
            [
                26866,
                26889
            ],
            [
                26889,
                26965
            ],
            [
                26965,
                27075
            ],
            [
                27075,
                27095
            ],
            [
                27095,
                27116
            ],
            [
                27116,
                27164
            ],
            [
                27164,
                27177
            ],
            [
                27177,
                27200
            ],
            [
                27200,
                27213
            ],
            [
                27213,
                27223
            ],
            [
                27223,
                27231
            ],
            [
                27231,
                27241
            ],
            [
                27241,
                27300
            ],
            [
                27300,
                27368
            ],
            [
                27368,
                27403
            ],
            [
                27403,
                27518
            ],
            [
                27518,
                27610
            ],
            [
                27610,
                27627
            ],
            [
                27627,
                27675
            ],
            [
                27675,
                27711
            ],
            [
                27711,
                28021
            ],
            [
                28021,
                28129
            ],
            [
                28129,
                28226
            ],
            [
                28226,
                28298
            ],
            [
                28298,
                28391
            ],
            [
                28391,
                28472
            ],
            [
                28472,
                28533
            ],
            [
                28533,
                28566
            ],
            [
                28566,
                28676
            ],
            [
                28676,
                28691
            ],
            [
                28691,
                28825
            ],
            [
                28825,
                28958
            ],
            [
                28958,
                29057
            ],
            [
                29057,
                29066
            ],
            [
                29066,
                29088
            ],
            [
                29088,
                29147
            ],
            [
                29147,
                29175
            ],
            [
                29175,
                29229
            ],
            [
                29229,
                29302
            ],
            [
                29302,
                29412
            ],
            [
                29412,
                29611
            ],
            [
                29611,
                29687
            ],
            [
                29687,
                29853
            ],
            [
                29853,
                29921
            ],
            [
                29921,
                30032
            ],
            [
                30032,
                30106
            ],
            [
                30106,
                30321
            ],
            [
                30321,
                30582
            ],
            [
                30582,
                30875
            ],
            [
                30875,
                30920
            ],
            [
                30920,
                31211
            ],
            [
                31211,
                31389
            ],
            [
                31389,
                31483
            ],
            [
                31483,
                31528
            ],
            [
                31528,
                31641
            ],
            [
                31641,
                31744
            ],
            [
                31744,
                31768
            ],
            [
                31768,
                31872
            ],
            [
                31872,
                31919
            ],
            [
                31919,
                31936
            ],
            [
                31936,
                31999
            ],
            [
                31999,
                32160
            ],
            [
                32160,
                32179
            ],
            [
                32179,
                32191
            ],
            [
                32191,
                32212
            ],
            [
                32212,
                32252
            ],
            [
                32252,
                32271
            ],
            [
                32271,
                32298
            ],
            [
                32298,
                32392
            ],
            [
                32392,
                32411
            ],
            [
                32411,
                32504
            ],
            [
                32504,
                32510
            ],
            [
                32510,
                32556
            ],
            [
                32556,
                32645
            ],
            [
                32645,
                32683
            ],
            [
                32683,
                32711
            ],
            [
                32711,
                32761
            ],
            [
                32761,
                32790
            ],
            [
                32790,
                32831
            ],
            [
                32831,
                32867
            ],
            [
                32867,
                32911
            ],
            [
                32911,
                32946
            ],
            [
                32946,
                33015
            ],
            [
                33015,
                33045
            ],
            [
                33045,
                33286
            ],
            [
                33286,
                33366
            ],
            [
                33366,
                33523
            ],
            [
                33523,
                33592
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                64,
                75
            ],
            [
                137,
                139
            ],
            [
                139,
                153
            ],
            [
                187,
                197
            ],
            [
                255,
                274
            ],
            [
                305,
                314
            ],
            [
                374,
                410
            ],
            [
                451,
                482
            ],
            [
                556,
                558
            ],
            [
                558,
                580
            ],
            [
                685,
                688
            ],
            [
                658,
                663
            ],
            [
                647,
                652
            ],
            [
                598,
                605
            ],
            [
                635,
                636
            ],
            [
                778,
                782
            ],
            [
                695,
                729
            ],
            [
                626,
                627
            ],
            [
                748,
                768
            ],
            [
                769,
                776
            ],
            [
                824,
                826
            ],
            [
                1087,
                1094
            ],
            [
                1231,
                1233
            ],
            [
                1095,
                1103
            ],
            [
                1254,
                1273
            ],
            [
                1338,
                1341
            ],
            [
                1355,
                1388
            ],
            [
                1433,
                1435
            ],
            [
                1435,
                1444
            ],
            [
                1449,
                1470
            ],
            [
                1472,
                1502
            ],
            [
                1514,
                1515
            ],
            [
                1516,
                1538
            ],
            [
                1538,
                1539
            ],
            [
                1561,
                1576
            ],
            [
                1552,
                1555
            ],
            [
                1579,
                1693
            ],
            [
                1700,
                1707
            ],
            [
                1712,
                1718
            ],
            [
                1731,
                1759
            ],
            [
                1759,
                1779
            ],
            [
                1793,
                1812
            ],
            [
                1875,
                1892
            ],
            [
                1814,
                1816
            ],
            [
                1866,
                1869
            ],
            [
                1919,
                1938
            ],
            [
                1943,
                1976
            ],
            [
                1976,
                2002
            ],
            [
                2019,
                2022
            ],
            [
                2002,
                2014
            ],
            [
                2023,
                2025
            ],
            [
                2114,
                2125
            ],
            [
                2064,
                2080
            ],
            [
                2126,
                2132
            ],
            [
                2159,
                2164
            ],
            [
                2133,
                2139
            ],
            [
                2221,
                2247
            ],
            [
                2247,
                2256
            ],
            [
                2261,
                2278
            ],
            [
                2296,
                2335
            ],
            [
                2335,
                2381
            ],
            [
                2387,
                2388
            ],
            [
                2414,
                2439
            ],
            [
                2472,
                2521
            ],
            [
                2521,
                2544
            ],
            [
                2546,
                2554
            ],
            [
                2579,
                2586
            ],
            [
                2608,
                2631
            ],
            [
                2674,
                2717
            ],
            [
                2717,
                2730
            ],
            [
                2737,
                2749
            ],
            [
                2793,
                2795
            ],
            [
                2837,
                2865
            ],
            [
                2805,
                2811
            ],
            [
                2816,
                2821
            ],
            [
                2867,
                2901
            ],
            [
                2917,
                2931
            ],
            [
                2931,
                2933
            ],
            [
                2933,
                2964
            ],
            [
                2987,
                3025
            ],
            [
                3027,
                3052
            ],
            [
                3052,
                3053
            ],
            [
                3066,
                3085
            ],
            [
                3085,
                3087
            ],
            [
                3092,
                3098
            ],
            [
                3121,
                3122
            ],
            [
                3130,
                3138
            ],
            [
                3154,
                3168
            ],
            [
                3168,
                3170
            ],
            [
                3309,
                3328
            ],
            [
                3334,
                3351
            ],
            [
                3351,
                3352
            ],
            [
                3362,
                3364
            ],
            [
                3354,
                3361
            ],
            [
                3411,
                3413
            ],
            [
                3383,
                3386
            ],
            [
                3386,
                3387
            ],
            [
                3390,
                3396
            ],
            [
                3401,
                3406
            ],
            [
                3445,
                3456
            ],
            [
                3458,
                3482
            ],
            [
                3482,
                3497
            ],
            [
                3506,
                3520
            ],
            [
                3520,
                3550
            ],
            [
                3550,
                3589
            ],
            [
                3619,
                3621
            ],
            [
                3621,
                3658
            ],
            [
                3675,
                3688
            ],
            [
                3714,
                3732
            ],
            [
                3746,
                3785
            ],
            [
                3791,
                3807
            ],
            [
                3835,
                3837
            ],
            [
                3852,
                3890
            ],
            [
                3910,
                3949
            ],
            [
                3973,
                3990
            ],
            [
                4016,
                4043
            ],
            [
                4043,
                4079
            ],
            [
                4081,
                4092
            ],
            [
                4092,
                4137
            ],
            [
                4137,
                4161
            ],
            [
                4161,
                4204
            ],
            [
                4213,
                4262
            ],
            [
                4296,
                4306
            ],
            [
                4325,
                4348
            ],
            [
                4348,
                4360
            ],
            [
                4379,
                4381
            ],
            [
                4381,
                4399
            ],
            [
                4399,
                4430
            ],
            [
                4430,
                4448
            ],
            [
                4448,
                4460
            ],
            [
                4472,
                4477
            ],
            [
                4477,
                4482
            ],
            [
                4482,
                4495
            ],
            [
                4495,
                4504
            ],
            [
                4527,
                4553
            ],
            [
                4562,
                4581
            ],
            [
                4581,
                4630
            ],
            [
                4640,
                4648
            ],
            [
                4652,
                4689
            ],
            [
                4689,
                4697
            ],
            [
                4708,
                4732
            ],
            [
                4765,
                4768
            ],
            [
                4775,
                4777
            ],
            [
                4777,
                4789
            ],
            [
                4801,
                4814
            ],
            [
                4854,
                4857
            ],
            [
                4912,
                4952
            ],
            [
                4964,
                4968
            ],
            [
                4977,
                4981
            ],
            [
                4992,
                5015
            ],
            [
                4881,
                4882
            ],
            [
                5035,
                5038
            ],
            [
                5092,
                5100
            ],
            [
                5117,
                5157
            ],
            [
                5172,
                5179
            ],
            [
                5164,
                5168
            ],
            [
                5212,
                5251
            ],
            [
                5251,
                5288
            ],
            [
                5303,
                5315
            ],
            [
                5331,
                5337
            ],
            [
                5353,
                5357
            ],
            [
                5383,
                5398
            ],
            [
                5368,
                5371
            ],
            [
                5400,
                5406
            ],
            [
                5433,
                5444
            ],
            [
                5454,
                5471
            ],
            [
                5516,
                5525
            ],
            [
                5562,
                5571
            ],
            [
                5615,
                5617
            ],
            [
                5655,
                5661
            ],
            [
                5692,
                5707
            ],
            [
                5716,
                5805
            ],
            [
                5813,
                5816
            ],
            [
                5833,
                5840
            ],
            [
                5840,
                5887
            ],
            [
                5892,
                5915
            ],
            [
                5915,
                6007
            ],
            [
                6007,
                6010
            ],
            [
                6011,
                6015
            ],
            [
                6042,
                6066
            ],
            [
                6040,
                6041
            ],
            [
                6093,
                6111
            ],
            [
                6133,
                6143
            ],
            [
                6144,
                6149
            ],
            [
                6158,
                6165
            ],
            [
                6130,
                6132
            ],
            [
                6125,
                6130
            ],
            [
                6066,
                6067
            ],
            [
                6167,
                6170
            ],
            [
                6184,
                6234
            ],
            [
                6234,
                6249
            ],
            [
                6266,
                6346
            ],
            [
                6346,
                6351
            ],
            [
                6351,
                6361
            ],
            [
                6372,
                6437
            ],
            [
                6445,
                6448
            ],
            [
                6448,
                6485
            ],
            [
                6576,
                6581
            ],
            [
                6582,
                6597
            ],
            [
                6597,
                6603
            ],
            [
                6611,
                6658
            ],
            [
                6670,
                6673
            ],
            [
                6983,
                7011
            ],
            [
                7011,
                7049
            ],
            [
                7049,
                7093
            ],
            [
                7093,
                7142
            ],
            [
                7142,
                7199
            ],
            [
                7199,
                7219
            ],
            [
                7219,
                7246
            ],
            [
                7252,
                7253
            ],
            [
                7247,
                7252
            ],
            [
                7283,
                7285
            ],
            [
                7285,
                7293
            ],
            [
                7312,
                7317
            ],
            [
                7324,
                7330
            ],
            [
                7337,
                7338
            ],
            [
                7339,
                7349
            ],
            [
                7349,
                7370
            ],
            [
                7370,
                7419
            ],
            [
                7424,
                7427
            ],
            [
                7427,
                7432
            ],
            [
                7432,
                7436
            ],
            [
                7436,
                7447
            ],
            [
                7447,
                7486
            ],
            [
                7522,
                7525
            ],
            [
                7546,
                7567
            ],
            [
                7600,
                7618
            ],
            [
                7649,
                7655
            ],
            [
                7667,
                7679
            ],
            [
                7737,
                7739
            ],
            [
                7799,
                7826
            ],
            [
                7844,
                7918
            ],
            [
                7936,
                7963
            ],
            [
                7990,
                8022
            ],
            [
                8022,
                8069
            ],
            [
                8204,
                8226
            ],
            [
                8232,
                8241
            ],
            [
                8253,
                8273
            ],
            [
                8276,
                8282
            ],
            [
                8310,
                8337
            ],
            [
                8360,
                8391
            ],
            [
                8345,
                8349
            ],
            [
                8425,
                8431
            ],
            [
                8431,
                8435
            ],
            [
                8435,
                8451
            ],
            [
                8504,
                8597
            ],
            [
                8597,
                8624
            ],
            [
                8638,
                8650
            ],
            [
                8660,
                8675
            ],
            [
                8651,
                8659
            ],
            [
                8675,
                8677
            ],
            [
                8710,
                8715
            ],
            [
                8681,
                8706
            ],
            [
                8744,
                8745
            ],
            [
                8726,
                8730
            ],
            [
                8765,
                8784
            ],
            [
                8796,
                8809
            ],
            [
                8809,
                8879
            ],
            [
                8915,
                8926
            ],
            [
                8926,
                8944
            ],
            [
                8993,
                8995
            ],
            [
                8945,
                8956
            ],
            [
                9007,
                9009
            ],
            [
                9009,
                9048
            ],
            [
                9073,
                9077
            ],
            [
                9129,
                9131
            ],
            [
                9054,
                9070
            ],
            [
                9078,
                9096
            ],
            [
                9101,
                9108
            ],
            [
                9374,
                9376
            ],
            [
                9214,
                9220
            ],
            [
                9159,
                9160
            ],
            [
                9251,
                9302
            ],
            [
                9161,
                9164
            ],
            [
                9303,
                9325
            ],
            [
                9515,
                9518
            ],
            [
                9518,
                9558
            ],
            [
                9558,
                9587
            ],
            [
                9605,
                9620
            ],
            [
                9676,
                9677
            ],
            [
                9621,
                9629
            ],
            [
                9704,
                9746
            ],
            [
                9757,
                9791
            ],
            [
                9791,
                9799
            ],
            [
                9799,
                9829
            ],
            [
                9924,
                9937
            ],
            [
                9939,
                9944
            ],
            [
                9944,
                9965
            ],
            [
                9986,
                9988
            ],
            [
                9988,
                10034
            ],
            [
                10056,
                10058
            ],
            [
                10058,
                10063
            ],
            [
                10086,
                10158
            ],
            [
                10158,
                10166
            ],
            [
                10166,
                10175
            ],
            [
                10175,
                10198
            ],
            [
                10206,
                10216
            ],
            [
                10217,
                10227
            ],
            [
                10238,
                10254
            ],
            [
                10273,
                10288
            ],
            [
                10302,
                10313
            ],
            [
                10327,
                10328
            ],
            [
                10330,
                10337
            ],
            [
                10364,
                10371
            ],
            [
                10387,
                10389
            ],
            [
                10389,
                10443
            ],
            [
                10443,
                10474
            ],
            [
                10479,
                10486
            ],
            [
                10493,
                10541
            ],
            [
                10541,
                10558
            ],
            [
                10558,
                10593
            ],
            [
                10593,
                10618
            ],
            [
                10620,
                10630
            ],
            [
                10632,
                10647
            ],
            [
                10659,
                10690
            ],
            [
                10690,
                10694
            ],
            [
                10701,
                10730
            ],
            [
                10786,
                10809
            ],
            [
                10809,
                10860
            ],
            [
                10894,
                10896
            ],
            [
                10896,
                10910
            ],
            [
                10919,
                10938
            ],
            [
                10947,
                10984
            ],
            [
                11000,
                11002
            ],
            [
                11002,
                11024
            ],
            [
                11024,
                11052
            ],
            [
                11052,
                11059
            ],
            [
                11059,
                11097
            ],
            [
                11097,
                11148
            ],
            [
                11148,
                11179
            ],
            [
                11179,
                11238
            ],
            [
                11269,
                11299
            ],
            [
                11310,
                11334
            ],
            [
                11334,
                11363
            ],
            [
                11378,
                11381
            ],
            [
                11398,
                11418
            ],
            [
                11492,
                11578
            ],
            [
                11597,
                11607
            ],
            [
                11607,
                11612
            ],
            [
                11632,
                11686
            ],
            [
                12077,
                12078
            ],
            [
                12082,
                12094
            ],
            [
                12107,
                12117
            ],
            [
                12117,
                12157
            ],
            [
                12178,
                12190
            ],
            [
                12218,
                12238
            ],
            [
                12197,
                12198
            ],
            [
                12335,
                12356
            ],
            [
                12362,
                12365
            ],
            [
                12371,
                12374
            ],
            [
                12278,
                12281
            ],
            [
                12298,
                12304
            ],
            [
                12323,
                12329
            ],
            [
                12250,
                12251
            ],
            [
                12520,
                12523
            ],
            [
                12672,
                12710
            ],
            [
                12738,
                12783
            ],
            [
                12783,
                12832
            ],
            [
                12866,
                12886
            ],
            [
                12895,
                12897
            ],
            [
                13043,
                13071
            ],
            [
                13071,
                13083
            ],
            [
                13150,
                13190
            ],
            [
                13200,
                13286
            ],
            [
                13286,
                13287
            ],
            [
                13298,
                13350
            ],
            [
                13354,
                13356
            ],
            [
                13367,
                13392
            ],
            [
                13428,
                13437
            ],
            [
                13437,
                13438
            ],
            [
                13513,
                13531
            ],
            [
                13534,
                13585
            ],
            [
                13610,
                13679
            ],
            [
                13688,
                13719
            ],
            [
                13719,
                13724
            ],
            [
                13734,
                13753
            ],
            [
                13958,
                13961
            ],
            [
                13932,
                13957
            ],
            [
                13966,
                13987
            ],
            [
                14003,
                14016
            ],
            [
                14016,
                14048
            ],
            [
                14048,
                14168
            ],
            [
                14168,
                14209
            ],
            [
                14209,
                14216
            ],
            [
                14262,
                14314
            ],
            [
                14314,
                14331
            ],
            [
                14380,
                14391
            ],
            [
                14409,
                14411
            ],
            [
                14411,
                14415
            ],
            [
                14416,
                14443
            ],
            [
                14443,
                14528
            ],
            [
                14552,
                14564
            ],
            [
                14545,
                14551
            ],
            [
                14565,
                14624
            ],
            [
                14624,
                14626
            ],
            [
                14718,
                14724
            ],
            [
                14641,
                14662
            ],
            [
                14739,
                14942
            ],
            [
                14942,
                14962
            ],
            [
                14962,
                14973
            ],
            [
                14973,
                15012
            ],
            [
                15012,
                15015
            ],
            [
                15043,
                15072
            ],
            [
                15072,
                15129
            ],
            [
                15142,
                15216
            ],
            [
                15268,
                15270
            ],
            [
                15292,
                15317
            ],
            [
                15317,
                15376
            ],
            [
                15463,
                15483
            ],
            [
                15485,
                15499
            ],
            [
                15510,
                15518
            ],
            [
                15523,
                15536
            ],
            [
                15538,
                15560
            ],
            [
                15566,
                15603
            ],
            [
                15603,
                15604
            ],
            [
                15618,
                15642
            ],
            [
                15642,
                15648
            ],
            [
                15654,
                15696
            ],
            [
                15696,
                15717
            ],
            [
                15717,
                15739
            ],
            [
                15739,
                15761
            ],
            [
                15771,
                15793
            ],
            [
                15802,
                15832
            ],
            [
                15840,
                15861
            ],
            [
                15867,
                15887
            ],
            [
                15887,
                15931
            ],
            [
                15931,
                15941
            ],
            [
                15948,
                16042
            ],
            [
                16042,
                16095
            ],
            [
                16183,
                16184
            ],
            [
                16200,
                16235
            ],
            [
                16246,
                16269
            ],
            [
                16269,
                16285
            ],
            [
                16293,
                16337
            ],
            [
                16351,
                16358
            ],
            [
                16368,
                16423
            ],
            [
                16520,
                16568
            ],
            [
                16605,
                16610
            ],
            [
                16758,
                16761
            ],
            [
                16616,
                16623
            ],
            [
                16646,
                16647
            ],
            [
                16574,
                16578
            ],
            [
                16735,
                16745
            ],
            [
                16579,
                16585
            ],
            [
                16772,
                16788
            ],
            [
                16849,
                16851
            ],
            [
                16851,
                16885
            ],
            [
                16890,
                16891
            ],
            [
                16942,
                16951
            ],
            [
                16919,
                16922
            ],
            [
                16970,
                16980
            ],
            [
                16935,
                16941
            ],
            [
                16981,
                16994
            ],
            [
                16994,
                17001
            ],
            [
                17027,
                17032
            ],
            [
                17045,
                17057
            ],
            [
                17059,
                17106
            ],
            [
                17201,
                17214
            ],
            [
                17231,
                17238
            ],
            [
                17279,
                17286
            ],
            [
                17288,
                17298
            ],
            [
                17326,
                17328
            ],
            [
                17328,
                17333
            ],
            [
                17347,
                17372
            ],
            [
                17394,
                17400
            ],
            [
                17381,
                17388
            ],
            [
                17401,
                17410
            ],
            [
                17445,
                17479
            ],
            [
                17550,
                17607
            ],
            [
                17607,
                17629
            ],
            [
                17653,
                17661
            ],
            [
                17634,
                17647
            ],
            [
                17666,
                17668
            ],
            [
                17668,
                17678
            ],
            [
                17681,
                17723
            ],
            [
                17759,
                17761
            ],
            [
                17764,
                17778
            ],
            [
                17813,
                17815
            ],
            [
                17866,
                17869
            ],
            [
                17873,
                17874
            ],
            [
                17893,
                17895
            ],
            [
                17980,
                17983
            ],
            [
                17909,
                17926
            ],
            [
                17927,
                17945
            ],
            [
                17946,
                17953
            ],
            [
                17965,
                17972
            ],
            [
                18366,
                18367
            ],
            [
                18000,
                18020
            ],
            [
                18051,
                18069
            ],
            [
                18139,
                18141
            ],
            [
                18116,
                18121
            ],
            [
                17787,
                17789
            ],
            [
                18128,
                18133
            ],
            [
                18180,
                18215
            ],
            [
                18150,
                18155
            ],
            [
                17906,
                17908
            ],
            [
                18269,
                18276
            ],
            [
                18237,
                18248
            ],
            [
                18368,
                18389
            ],
            [
                18401,
                18475
            ],
            [
                18475,
                18501
            ],
            [
                18534,
                18535
            ],
            [
                18513,
                18534
            ],
            [
                18554,
                18569
            ],
            [
                18614,
                18622
            ],
            [
                18634,
                18667
            ],
            [
                18667,
                18784
            ],
            [
                18797,
                18811
            ],
            [
                18811,
                18839
            ],
            [
                18852,
                18917
            ],
            [
                18932,
                18942
            ],
            [
                18965,
                18972
            ],
            [
                18943,
                18951
            ],
            [
                18972,
                19015
            ],
            [
                19058,
                19068
            ],
            [
                19086,
                19112
            ],
            [
                19112,
                19125
            ],
            [
                19278,
                19328
            ],
            [
                19333,
                19337
            ],
            [
                19349,
                19356
            ],
            [
                19338,
                19340
            ],
            [
                19360,
                19379
            ],
            [
                19383,
                19426
            ],
            [
                19476,
                19477
            ],
            [
                19805,
                19832
            ],
            [
                19837,
                19851
            ],
            [
                19859,
                19860
            ],
            [
                19885,
                19887
            ],
            [
                19861,
                19863
            ],
            [
                19925,
                19927
            ],
            [
                19986,
                20015
            ],
            [
                20244,
                20245
            ],
            [
                20017,
                20053
            ],
            [
                20071,
                20084
            ],
            [
                20069,
                20070
            ],
            [
                20274,
                20275
            ],
            [
                20126,
                20140
            ],
            [
                20147,
                20159
            ],
            [
                20247,
                20248
            ],
            [
                20161,
                20229
            ],
            [
                20256,
                20265
            ],
            [
                20316,
                20322
            ],
            [
                20269,
                20273
            ],
            [
                20238,
                20240
            ],
            [
                20284,
                20293
            ],
            [
                20276,
                20283
            ],
            [
                20266,
                20268
            ],
            [
                20054,
                20056
            ],
            [
                20104,
                20105
            ],
            [
                20406,
                20505
            ],
            [
                20505,
                20550
            ],
            [
                20561,
                20602
            ],
            [
                20622,
                20642
            ],
            [
                20672,
                20674
            ],
            [
                20674,
                20732
            ],
            [
                20737,
                20762
            ],
            [
                20851,
                20853
            ],
            [
                20853,
                20870
            ],
            [
                20947,
                20950
            ],
            [
                20875,
                20916
            ],
            [
                20921,
                20943
            ],
            [
                20951,
                20955
            ],
            [
                20956,
                20962
            ],
            [
                20969,
                21004
            ],
            [
                21039,
                21045
            ],
            [
                21045,
                21122
            ],
            [
                21134,
                21184
            ],
            [
                21224,
                21240
            ],
            [
                21187,
                21189
            ],
            [
                21207,
                21215
            ],
            [
                21257,
                21259
            ],
            [
                21286,
                21316
            ],
            [
                21326,
                21340
            ],
            [
                21346,
                21353
            ],
            [
                21362,
                21382
            ],
            [
                21394,
                21396
            ],
            [
                21409,
                21414
            ],
            [
                21439,
                21477
            ],
            [
                21489,
                21497
            ],
            [
                21497,
                21526
            ],
            [
                21830,
                21848
            ],
            [
                21908,
                22003
            ],
            [
                22003,
                22031
            ],
            [
                22164,
                22167
            ],
            [
                22077,
                22146
            ],
            [
                22182,
                22184
            ],
            [
                22224,
                22226
            ],
            [
                22226,
                22296
            ],
            [
                22353,
                22355
            ],
            [
                22355,
                22358
            ],
            [
                22359,
                22362
            ],
            [
                22368,
                22381
            ],
            [
                22394,
                22397
            ],
            [
                22383,
                22393
            ],
            [
                22398,
                22406
            ],
            [
                22414,
                22416
            ],
            [
                22416,
                22423
            ],
            [
                22439,
                22468
            ],
            [
                22473,
                22478
            ],
            [
                22484,
                22487
            ],
            [
                22432,
                22437
            ],
            [
                22488,
                22494
            ],
            [
                22515,
                22549
            ],
            [
                22549,
                22733
            ],
            [
                22733,
                22757
            ],
            [
                22811,
                22862
            ],
            [
                22877,
                22885
            ],
            [
                22894,
                22997
            ],
            [
                22997,
                23058
            ],
            [
                23058,
                23059
            ],
            [
                23146,
                23160
            ],
            [
                23169,
                23217
            ],
            [
                23250,
                23295
            ],
            [
                23320,
                23364
            ],
            [
                23408,
                23410
            ],
            [
                23410,
                23436
            ],
            [
                23436,
                23465
            ],
            [
                23534,
                23634
            ],
            [
                23635,
                23692
            ],
            [
                23692,
                23718
            ],
            [
                23742,
                23750
            ],
            [
                23755,
                23769
            ],
            [
                23783,
                23824
            ],
            [
                23864,
                23893
            ],
            [
                23862,
                23863
            ],
            [
                23922,
                23935
            ],
            [
                23948,
                23953
            ],
            [
                23977,
                23979
            ],
            [
                23979,
                24024
            ],
            [
                24043,
                24087
            ],
            [
                24102,
                24132
            ],
            [
                24133,
                24153
            ],
            [
                24224,
                24274
            ],
            [
                24324,
                24351
            ],
            [
                24376,
                24378
            ],
            [
                24378,
                24427
            ],
            [
                24550,
                24552
            ],
            [
                24552,
                24569
            ],
            [
                24574,
                24593
            ],
            [
                24619,
                24669
            ],
            [
                24669,
                24692
            ],
            [
                24692,
                24726
            ],
            [
                24773,
                24888
            ],
            [
                24888,
                24915
            ],
            [
                24952,
                25016
            ],
            [
                25044,
                25062
            ],
            [
                25071,
                25072
            ],
            [
                24915,
                24916
            ],
            [
                25091,
                25115
            ],
            [
                25116,
                25169
            ],
            [
                25185,
                25190
            ],
            [
                25201,
                25268
            ],
            [
                25271,
                25276
            ],
            [
                25305,
                25346
            ],
            [
                25347,
                25349
            ],
            [
                25366,
                25391
            ],
            [
                25351,
                25365
            ],
            [
                25400,
                25439
            ],
            [
                25439,
                25447
            ],
            [
                25489,
                25507
            ],
            [
                25507,
                25544
            ],
            [
                25567,
                25568
            ],
            [
                25594,
                25597
            ],
            [
                25609,
                25615
            ],
            [
                25546,
                25549
            ],
            [
                25632,
                25639
            ],
            [
                25759,
                25761
            ],
            [
                25828,
                25848
            ],
            [
                25879,
                25880
            ],
            [
                26014,
                26019
            ],
            [
                25807,
                25810
            ],
            [
                25849,
                25879
            ],
            [
                25900,
                25934
            ],
            [
                25940,
                25946
            ],
            [
                25952,
                25963
            ],
            [
                26012,
                26013
            ],
            [
                26020,
                26037
            ],
            [
                26037,
                26045
            ],
            [
                26045,
                26074
            ],
            [
                26113,
                26115
            ],
            [
                26115,
                26146
            ],
            [
                26164,
                26176
            ],
            [
                26203,
                26205
            ],
            [
                26205,
                26255
            ],
            [
                26260,
                26283
            ],
            [
                26308,
                26322
            ],
            [
                26329,
                26338
            ],
            [
                26338,
                26394
            ],
            [
                26413,
                26432
            ],
            [
                26444,
                26492
            ],
            [
                26492,
                26494
            ],
            [
                26530,
                26544
            ],
            [
                26559,
                26589
            ],
            [
                26608,
                26619
            ],
            [
                26619,
                26622
            ],
            [
                26627,
                26645
            ],
            [
                26648,
                26721
            ],
            [
                26721,
                26740
            ],
            [
                26740,
                26757
            ],
            [
                26757,
                26772
            ],
            [
                26772,
                26794
            ],
            [
                26802,
                26805
            ],
            [
                26823,
                26830
            ],
            [
                26842,
                26844
            ],
            [
                26844,
                26861
            ],
            [
                26864,
                26866
            ],
            [
                26866,
                26889
            ],
            [
                26889,
                26906
            ],
            [
                26963,
                26965
            ],
            [
                26965,
                26993
            ],
            [
                27003,
                27075
            ],
            [
                27075,
                27095
            ],
            [
                27095,
                27116
            ],
            [
                27116,
                27132
            ],
            [
                27154,
                27164
            ],
            [
                27164,
                27177
            ],
            [
                27177,
                27200
            ],
            [
                27200,
                27213
            ],
            [
                27223,
                27231
            ],
            [
                27231,
                27241
            ],
            [
                27241,
                27300
            ],
            [
                27310,
                27368
            ],
            [
                27368,
                27403
            ],
            [
                27403,
                27432
            ],
            [
                27441,
                27472
            ],
            [
                27516,
                27518
            ],
            [
                27610,
                27627
            ],
            [
                27627,
                27675
            ],
            [
                27752,
                27764
            ],
            [
                27786,
                27802
            ],
            [
                27804,
                27813
            ],
            [
                27865,
                27866
            ],
            [
                27825,
                27835
            ],
            [
                27818,
                27821
            ],
            [
                27843,
                27853
            ],
            [
                27879,
                27882
            ],
            [
                27836,
                27842
            ],
            [
                27928,
                27953
            ],
            [
                28001,
                28021
            ],
            [
                28021,
                28048
            ],
            [
                28054,
                28069
            ],
            [
                28085,
                28087
            ],
            [
                28096,
                28100
            ],
            [
                28101,
                28116
            ],
            [
                28125,
                28129
            ],
            [
                28129,
                28197
            ],
            [
                28214,
                28226
            ],
            [
                28226,
                28278
            ],
            [
                28289,
                28298
            ],
            [
                28298,
                28305
            ],
            [
                28320,
                28367
            ],
            [
                28378,
                28391
            ],
            [
                28428,
                28454
            ],
            [
                28470,
                28472
            ],
            [
                28472,
                28474
            ],
            [
                28529,
                28530
            ],
            [
                28533,
                28563
            ],
            [
                28691,
                28825
            ],
            [
                28825,
                28912
            ],
            [
                28956,
                28958
            ],
            [
                28958,
                28981
            ],
            [
                29025,
                29057
            ],
            [
                29057,
                29066
            ],
            [
                29066,
                29088
            ],
            [
                29088,
                29147
            ],
            [
                29175,
                29229
            ],
            [
                29229,
                29302
            ],
            [
                29302,
                29363
            ],
            [
                29364,
                29412
            ],
            [
                29412,
                29425
            ],
            [
                29434,
                29446
            ],
            [
                29500,
                29514
            ],
            [
                29559,
                29562
            ],
            [
                29515,
                29523
            ],
            [
                29524,
                29548
            ],
            [
                29568,
                29611
            ],
            [
                29631,
                29687
            ],
            [
                29687,
                29726
            ],
            [
                29733,
                29754
            ],
            [
                29761,
                29775
            ],
            [
                29851,
                29853
            ],
            [
                29856,
                29867
            ],
            [
                29877,
                29883
            ],
            [
                29884,
                29920
            ],
            [
                30032,
                30051
            ],
            [
                30073,
                30098
            ],
            [
                30104,
                30106
            ],
            [
                30106,
                30123
            ],
            [
                30139,
                30147
            ],
            [
                30148,
                30218
            ],
            [
                30235,
                30297
            ],
            [
                30319,
                30321
            ],
            [
                30334,
                30365
            ],
            [
                30392,
                30480
            ],
            [
                30493,
                30507
            ],
            [
                30522,
                30524
            ],
            [
                30527,
                30538
            ],
            [
                30563,
                30582
            ],
            [
                30582,
                30602
            ],
            [
                30635,
                30650
            ],
            [
                30658,
                30663
            ],
            [
                30700,
                30722
            ],
            [
                30732,
                30742
            ],
            [
                30743,
                30746
            ],
            [
                30873,
                30875
            ],
            [
                30883,
                30903
            ],
            [
                30918,
                30920
            ],
            [
                30920,
                30937
            ],
            [
                30952,
                30976
            ],
            [
                31026,
                31029
            ],
            [
                31214,
                31228
            ],
            [
                31266,
                31272
            ],
            [
                31276,
                31290
            ],
            [
                31298,
                31302
            ],
            [
                31387,
                31389
            ],
            [
                31389,
                31398
            ],
            [
                31403,
                31446
            ],
            [
                31447,
                31465
            ],
            [
                31470,
                31483
            ],
            [
                31483,
                31528
            ],
            [
                31528,
                31555
            ],
            [
                31558,
                31559
            ],
            [
                31566,
                31572
            ],
            [
                31620,
                31623
            ],
            [
                31584,
                31588
            ],
            [
                31639,
                31641
            ],
            [
                31641,
                31744
            ],
            [
                31744,
                31768
            ],
            [
                31819,
                31872
            ],
            [
                31872,
                31919
            ],
            [
                31936,
                31999
            ],
            [
                31999,
                32114
            ],
            [
                32133,
                32160
            ],
            [
                32160,
                32179
            ],
            [
                32179,
                32191
            ],
            [
                32191,
                32212
            ],
            [
                32212,
                32252
            ],
            [
                32252,
                32269
            ],
            [
                32298,
                32392
            ],
            [
                32392,
                32411
            ],
            [
                32411,
                32423
            ],
            [
                32445,
                32448
            ],
            [
                32502,
                32504
            ],
            [
                32504,
                32510
            ],
            [
                32574,
                32599
            ],
            [
                32643,
                32645
            ],
            [
                32645,
                32675
            ],
            [
                32681,
                32683
            ],
            [
                32689,
                32692
            ],
            [
                32685,
                32688
            ],
            [
                32683,
                32684
            ],
            [
                32693,
                32711
            ],
            [
                32711,
                32761
            ],
            [
                32761,
                32790
            ],
            [
                32790,
                32831
            ],
            [
                32831,
                32867
            ],
            [
                32867,
                32874
            ],
            [
                32877,
                32891
            ],
            [
                32891,
                32911
            ],
            [
                32911,
                32935
            ],
            [
                32944,
                32946
            ],
            [
                32946,
                32958
            ],
            [
                32964,
                32992
            ],
            [
                33012,
                33015
            ],
            [
                33015,
                33045
            ],
            [
                33045,
                33056
            ],
            [
                33061,
                33068
            ],
            [
                33080,
                33089
            ],
            [
                33092,
                33155
            ],
            [
                33169,
                33243
            ],
            [
                33256,
                33286
            ],
            [
                33306,
                33366
            ],
            [
                33366,
                33523
            ],
            [
                33540,
                33546
            ],
            [
                33561,
                33592
            ]
        ],
        "row_chars": [
            [
                0,
                139
            ],
            [
                139,
                558
            ],
            [
                558,
                826
            ],
            [
                826,
                1087
            ],
            [
                1087,
                1435
            ],
            [
                1435,
                1540
            ],
            [
                1540,
                1759
            ],
            [
                1759,
                1976
            ],
            [
                1976,
                2002
            ],
            [
                2002,
                2247
            ],
            [
                2247,
                2335
            ],
            [
                2335,
                2439
            ],
            [
                2439,
                2472
            ],
            [
                2472,
                2521
            ],
            [
                2521,
                2717
            ],
            [
                2717,
                2795
            ],
            [
                2795,
                2901
            ],
            [
                2901,
                2933
            ],
            [
                2933,
                3052
            ],
            [
                3052,
                3085
            ],
            [
                3085,
                3170
            ],
            [
                3170,
                3351
            ],
            [
                3351,
                3482
            ],
            [
                3482,
                3520
            ],
            [
                3520,
                3550
            ],
            [
                3550,
                3621
            ],
            [
                3621,
                3837
            ],
            [
                3837,
                4043
            ],
            [
                4043,
                4092
            ],
            [
                4092,
                4137
            ],
            [
                4137,
                4161
            ],
            [
                4161,
                4348
            ],
            [
                4348,
                4381
            ],
            [
                4381,
                4399
            ],
            [
                4399,
                4430
            ],
            [
                4430,
                4448
            ],
            [
                4448,
                4477
            ],
            [
                4477,
                4482
            ],
            [
                4482,
                4495
            ],
            [
                4495,
                4581
            ],
            [
                4581,
                4652
            ],
            [
                4652,
                4689
            ],
            [
                4689,
                4777
            ],
            [
                4777,
                4857
            ],
            [
                4857,
                5251
            ],
            [
                5251,
                5617
            ],
            [
                5617,
                5840
            ],
            [
                5840,
                5915
            ],
            [
                5915,
                6007
            ],
            [
                6007,
                6015
            ],
            [
                6015,
                6167
            ],
            [
                6167,
                6234
            ],
            [
                6234,
                6346
            ],
            [
                6346,
                6351
            ],
            [
                6351,
                6448
            ],
            [
                6448,
                6597
            ],
            [
                6597,
                6673
            ],
            [
                6673,
                6678
            ],
            [
                6678,
                6682
            ],
            [
                6682,
                6709
            ],
            [
                6709,
                6746
            ],
            [
                6746,
                6983
            ],
            [
                6983,
                7011
            ],
            [
                7011,
                7049
            ],
            [
                7049,
                7093
            ],
            [
                7093,
                7142
            ],
            [
                7142,
                7199
            ],
            [
                7199,
                7219
            ],
            [
                7219,
                7285
            ],
            [
                7285,
                7349
            ],
            [
                7349,
                7370
            ],
            [
                7370,
                7427
            ],
            [
                7427,
                7432
            ],
            [
                7432,
                7436
            ],
            [
                7436,
                7447
            ],
            [
                7447,
                7486
            ],
            [
                7486,
                7522
            ],
            [
                7522,
                7620
            ],
            [
                7620,
                7649
            ],
            [
                7649,
                7690
            ],
            [
                7690,
                7726
            ],
            [
                7726,
                8022
            ],
            [
                8022,
                8072
            ],
            [
                8072,
                8077
            ],
            [
                8077,
                8132
            ],
            [
                8132,
                8203
            ],
            [
                8203,
                8431
            ],
            [
                8431,
                8435
            ],
            [
                8435,
                8453
            ],
            [
                8453,
                8470
            ],
            [
                8470,
                8504
            ],
            [
                8504,
                8597
            ],
            [
                8597,
                8677
            ],
            [
                8677,
                8809
            ],
            [
                8809,
                8926
            ],
            [
                8926,
                9009
            ],
            [
                9009,
                9518
            ],
            [
                9518,
                9558
            ],
            [
                9558,
                9791
            ],
            [
                9791,
                9799
            ],
            [
                9799,
                9944
            ],
            [
                9944,
                9988
            ],
            [
                9988,
                10058
            ],
            [
                10058,
                10158
            ],
            [
                10158,
                10166
            ],
            [
                10166,
                10175
            ],
            [
                10175,
                10198
            ],
            [
                10198,
                10254
            ],
            [
                10254,
                10273
            ],
            [
                10273,
                10389
            ],
            [
                10389,
                10443
            ],
            [
                10443,
                10541
            ],
            [
                10541,
                10558
            ],
            [
                10558,
                10593
            ],
            [
                10593,
                10690
            ],
            [
                10690,
                10730
            ],
            [
                10730,
                10786
            ],
            [
                10786,
                10809
            ],
            [
                10809,
                10896
            ],
            [
                10896,
                11002
            ],
            [
                11002,
                11024
            ],
            [
                11024,
                11052
            ],
            [
                11052,
                11059
            ],
            [
                11059,
                11097
            ],
            [
                11097,
                11148
            ],
            [
                11148,
                11179
            ],
            [
                11179,
                11238
            ],
            [
                11238,
                11334
            ],
            [
                11334,
                11607
            ],
            [
                11607,
                11686
            ],
            [
                11686,
                11879
            ],
            [
                11879,
                11932
            ],
            [
                11932,
                11954
            ],
            [
                11954,
                11971
            ],
            [
                11971,
                12014
            ],
            [
                12014,
                12077
            ],
            [
                12077,
                12117
            ],
            [
                12117,
                12157
            ],
            [
                12157,
                12377
            ],
            [
                12377,
                12455
            ],
            [
                12455,
                12519
            ],
            [
                12519,
                12783
            ],
            [
                12783,
                13043
            ],
            [
                13043,
                13071
            ],
            [
                13071,
                13286
            ],
            [
                13286,
                13350
            ],
            [
                13350,
                13439
            ],
            [
                13439,
                13513
            ],
            [
                13513,
                13587
            ],
            [
                13587,
                13610
            ],
            [
                13610,
                13719
            ],
            [
                13719,
                13753
            ],
            [
                13753,
                13932
            ],
            [
                13932,
                14016
            ],
            [
                14016,
                14048
            ],
            [
                14048,
                14168
            ],
            [
                14168,
                14209
            ],
            [
                14209,
                14218
            ],
            [
                14218,
                14262
            ],
            [
                14262,
                14314
            ],
            [
                14314,
                14333
            ],
            [
                14333,
                14380
            ],
            [
                14380,
                14411
            ],
            [
                14411,
                14443
            ],
            [
                14443,
                14528
            ],
            [
                14528,
                14624
            ],
            [
                14624,
                14942
            ],
            [
                14942,
                14962
            ],
            [
                14962,
                14973
            ],
            [
                14973,
                15012
            ],
            [
                15012,
                15072
            ],
            [
                15072,
                15129
            ],
            [
                15129,
                15142
            ],
            [
                15142,
                15317
            ],
            [
                15317,
                15391
            ],
            [
                15391,
                15410
            ],
            [
                15410,
                15463
            ],
            [
                15463,
                15603
            ],
            [
                15603,
                15642
            ],
            [
                15642,
                15696
            ],
            [
                15696,
                15717
            ],
            [
                15717,
                15739
            ],
            [
                15739,
                15761
            ],
            [
                15761,
                15771
            ],
            [
                15771,
                15887
            ],
            [
                15887,
                15931
            ],
            [
                15931,
                16042
            ],
            [
                16042,
                16095
            ],
            [
                16095,
                16183
            ],
            [
                16183,
                16235
            ],
            [
                16235,
                16423
            ],
            [
                16423,
                16520
            ],
            [
                16520,
                16851
            ],
            [
                16851,
                16994
            ],
            [
                16994,
                17328
            ],
            [
                17328,
                17410
            ],
            [
                17410,
                17445
            ],
            [
                17445,
                17607
            ],
            [
                17607,
                17668
            ],
            [
                17668,
                17778
            ],
            [
                17778,
                18368
            ],
            [
                18368,
                18475
            ],
            [
                18475,
                18667
            ],
            [
                18667,
                18811
            ],
            [
                18811,
                19112
            ],
            [
                19112,
                19478
            ],
            [
                19478,
                19805
            ],
            [
                19805,
                19927
            ],
            [
                19927,
                19986
            ],
            [
                19986,
                20505
            ],
            [
                20505,
                20674
            ],
            [
                20674,
                20853
            ],
            [
                20853,
                21045
            ],
            [
                21045,
                21259
            ],
            [
                21259,
                21497
            ],
            [
                21497,
                21527
            ],
            [
                21527,
                21599
            ],
            [
                21599,
                21685
            ],
            [
                21685,
                21830
            ],
            [
                21830,
                22003
            ],
            [
                22003,
                22226
            ],
            [
                22226,
                22355
            ],
            [
                22355,
                22416
            ],
            [
                22416,
                22549
            ],
            [
                22549,
                22733
            ],
            [
                22733,
                22997
            ],
            [
                22997,
                23060
            ],
            [
                23060,
                23146
            ],
            [
                23146,
                23410
            ],
            [
                23410,
                23436
            ],
            [
                23436,
                23465
            ],
            [
                23465,
                23534
            ],
            [
                23534,
                23635
            ],
            [
                23635,
                23692
            ],
            [
                23692,
                23979
            ],
            [
                23979,
                24133
            ],
            [
                24133,
                24378
            ],
            [
                24378,
                24552
            ],
            [
                24552,
                24669
            ],
            [
                24669,
                24692
            ],
            [
                24692,
                24888
            ],
            [
                24888,
                25116
            ],
            [
                25116,
                25439
            ],
            [
                25439,
                25507
            ],
            [
                25507,
                25761
            ],
            [
                25761,
                25771
            ],
            [
                25771,
                26037
            ],
            [
                26037,
                26045
            ],
            [
                26045,
                26115
            ],
            [
                26115,
                26205
            ],
            [
                26205,
                26338
            ],
            [
                26338,
                26492
            ],
            [
                26492,
                26619
            ],
            [
                26619,
                26721
            ],
            [
                26721,
                26740
            ],
            [
                26740,
                26757
            ],
            [
                26757,
                26772
            ],
            [
                26772,
                26844
            ],
            [
                26844,
                26866
            ],
            [
                26866,
                26889
            ],
            [
                26889,
                26965
            ],
            [
                26965,
                27075
            ],
            [
                27075,
                27095
            ],
            [
                27095,
                27116
            ],
            [
                27116,
                27164
            ],
            [
                27164,
                27177
            ],
            [
                27177,
                27200
            ],
            [
                27200,
                27213
            ],
            [
                27213,
                27223
            ],
            [
                27223,
                27231
            ],
            [
                27231,
                27241
            ],
            [
                27241,
                27300
            ],
            [
                27300,
                27368
            ],
            [
                27368,
                27403
            ],
            [
                27403,
                27518
            ],
            [
                27518,
                27610
            ],
            [
                27610,
                27627
            ],
            [
                27627,
                27675
            ],
            [
                27675,
                27711
            ],
            [
                27711,
                28021
            ],
            [
                28021,
                28129
            ],
            [
                28129,
                28226
            ],
            [
                28226,
                28298
            ],
            [
                28298,
                28391
            ],
            [
                28391,
                28472
            ],
            [
                28472,
                28533
            ],
            [
                28533,
                28566
            ],
            [
                28566,
                28676
            ],
            [
                28676,
                28691
            ],
            [
                28691,
                28825
            ],
            [
                28825,
                28958
            ],
            [
                28958,
                29057
            ],
            [
                29057,
                29066
            ],
            [
                29066,
                29088
            ],
            [
                29088,
                29147
            ],
            [
                29147,
                29175
            ],
            [
                29175,
                29229
            ],
            [
                29229,
                29302
            ],
            [
                29302,
                29412
            ],
            [
                29412,
                29611
            ],
            [
                29611,
                29687
            ],
            [
                29687,
                29853
            ],
            [
                29853,
                29921
            ],
            [
                29921,
                30032
            ],
            [
                30032,
                30106
            ],
            [
                30106,
                30321
            ],
            [
                30321,
                30582
            ],
            [
                30582,
                30875
            ],
            [
                30875,
                30920
            ],
            [
                30920,
                31389
            ],
            [
                31389,
                31483
            ],
            [
                31483,
                31528
            ],
            [
                31528,
                31641
            ],
            [
                31641,
                31744
            ],
            [
                31744,
                31768
            ],
            [
                31768,
                31872
            ],
            [
                31872,
                31919
            ],
            [
                31919,
                31936
            ],
            [
                31936,
                31999
            ],
            [
                31999,
                32160
            ],
            [
                32160,
                32179
            ],
            [
                32179,
                32191
            ],
            [
                32191,
                32212
            ],
            [
                32212,
                32252
            ],
            [
                32252,
                32271
            ],
            [
                32271,
                32298
            ],
            [
                32298,
                32392
            ],
            [
                32392,
                32411
            ],
            [
                32411,
                32504
            ],
            [
                32504,
                32510
            ],
            [
                32510,
                32556
            ],
            [
                32556,
                32645
            ],
            [
                32645,
                32683
            ],
            [
                32683,
                32711
            ],
            [
                32711,
                32761
            ],
            [
                32761,
                32790
            ],
            [
                32790,
                32831
            ],
            [
                32831,
                32867
            ],
            [
                32867,
                32911
            ],
            [
                32911,
                32946
            ],
            [
                32946,
                33015
            ],
            [
                33015,
                33045
            ],
            [
                33045,
                33286
            ],
            [
                33286,
                33366
            ],
            [
                33366,
                33523
            ],
            [
                33523,
                33592
            ]
        ]
    },
    "abridged": {
        "text": "The evening was pitch dark: star and moon were quenched in black rain-clouds. Malone was not an observer of nature; he could walk miles and never notice when a sunbeam kissed the hill-tops, or when a shower wept over them. He did not, therefore, observe the black vault of the sky, with the furnaces of Stilbro' ironworks throwing a lurid shimmer on the eastern horizon. He just tramped doggedly along the causeway, splashing through the mire-filled cart ruts. He looked only for certain landmarks - the spire of Briarfield Church, and the lights of Redhouse Inn.\nWhen he reached the inn, the glow of a fire through a half-curtained window, a vision of glasses on a round table, and of revellers on an oak settle, nearly drew the curate from his course. He thought longingly of whisky-and-water; but the company in the inn were Mr. Helstone's parishioners; they all knew him. He sighed, and passed on.\nHe now left the high road to take a short cut to Hollow's Mill across level fields, jumping hedge and wall. He passed only one building here; large and hall-like, though irregular. You could see a high gable, then a long front, and a lofty stack of chimneys. It was dark; not a candle shone from any window. It was absolutely still. The rain and the low whistle of the wind were the sole sounds in its neighbourhood.\nBeyond this building, the fields descended rapidly. You could hear the water run in a vale below: one light glimmered in the depth. Malone steered towards it.\nHe came to a little white house - white even through this dense darkness - and knocked at the door. A servant opened it. By her candle he saw a passage, leading to two doors and a narrow stair with a strip of crimson carpet. The little interior looked clean and fresh.\n\"Is Mr. Moore in?\"\n\"No, sir, he is at the mill - in the counting-house.\"\nHere one of the doors opened.\n\"Are the wagons come, Sarah?\" asked a female voice, and a female head appeared. It might not be the head of a goddess - indeed, screws of curl-paper quite forbade that idea - but neither was it the head of a Gorgon, as Malone seemed to think. He shrank bashfully back into the rain, and saying, \"I'll go to him,\" hurried down a short lane towards a huge black mill.\nThe work-hours were over; the \"hands\", or workers, were gone. The machinery was at rest, the mill shut up. Malone walked round it. Somewhere in its great sooty flank he found a chink of light; he knocked at another door, using his shillelagh to beat a rousing tattoo. A key turned.\n\"Is it Joe Scott? What news of the wagons, Joe?\"\n\"No; it's myself. Mr. Helstone sent me.\"\n\"Oh! Mr. Malone.\" The voice had the slightest possible tone of disappointment. After a moment's pause it continued, politely but formally:\n\"I beg you will come in, Mr. Malone. I regret Mr. Helstone should have troubled you. There was no need - I told him so.\"\nMalone followed the speaker into a light room - very bright indeed it seemed, after the darkness; but except for its excellent fire, and an elegant lamp on a table, it was a very plain place. The boarded floor was carpetless; the stiff-backed chairs might have come from some farm-house. The only other furnishings were a desk, the table, and some framed plans for buildings and machinery.\nMalone hung up his wet coat and hat, drew one of the rheumatic-looking chairs to the hearth, and set his knees almost against the grate.\n\"Comfortable quarters you have here, Mr. Moore; all snug to yourself.\"\n\"Yes, but my sister would be glad to see you, if you would prefer stepping into the house.\"\n\"Oh, no! I never was a lady's man, not like my friend Sweeting.\"\n\"Sweeting! Which one is that?\" asked Moore. \"The one with the chocolate overcoat, or the little gentleman?\"\n\"The little one - the cavalier of the Misses Sykes, with the whole six of whom he is in love, ha! ha!\"\n\"Better be in love with all than specially with one, I should think, in that family.\"\n\"But he is specially in love with one - which one do you think?\"\nWith a quiet smile Mr. Moore replied, \"Dora, of course.\"\n\"You are right; Dora it is. But he has no chance, has he, Moore?\"\n\"What has Mr. Sweeting besides his curacy?\"\nThis question seemed to tickle Malone amazingly. He laughed for full three minutes before he answered it.\n\"What has Sweeting? Why, David has his harp, or rather, his flute. He has a watch, ring, and eyeglass. That's what he has.\"\n\"How would he propose to keep Miss Sykes in gowns?\"\n\"Ha! ha! Excellent! I'll ask him that next time I see him. But old Christopher Sykes is rich, is he not?\"\n\"Sykes has an extensive business. But he would be about as likely to take money from the business to give dowries to his daughters as I should be to pull down the cottage there, and build a house as large as Fieldhead.\"\n\"Do you know what I heard, Moore, the other day? That you were going to rent Fieldhead (I thought it looked dismal tonight, as I passed it), and that you intended to settle a Miss Sykes there as your wife, ha! ha! Now, which is it?\"\n\"I wonder how often it has been settled that I was to be married since I came to Briarfield. They have assigned me every single woman in the district by turns. First it was the two Misses Wynne; then Miss Armitage; then Ann Pearson. At present you throw on my shoulders all the tribe of the Misses Sykes - why, God knows. I visit nowhere; I do not seek female company. If ever I go to Whinbury, it is only to call on Sykes or Pearson in their counting-houses, where we discuss not courtship, but the cloth we can't sell, the hands we can't employ, and the mills we can't run.\"\n\"I go along with you completely, Moore. If there is one notion I hate, it is that of a sentimental marriage - two beggarly fools agreeing to unite their poverty by some fantastic tie of feeling. Humbug! But an advantageous connection is not so bad - eh?\"\n\"No,\" responded Moore absently. The subject seemed to have no interest for him. After gazing at the fire with a preoccupied air, he suddenly turned his head.\n\"Hark!\" said he. \"Did you hear wheels?\"\nHe went to open the window, and listened. \"It is only the wind rising, and the stream rushing. I expected those wagons at six; it is near nine now.\"\n\"Seriously, do you suppose that putting in this new machinery will bring you into danger?\" inquired Malone. \"Helstone seems to think it will.\"\n\"I only wish the machines - the frames - were safe here, within the walls of this mill. Once in place, I defy the frame-breakers. My mill is my castle.\"\n\"One despises such low scoundrels,\" observed Malone. \"I almost wish some would call upon you tonight; but the road seemed extremely quiet. I saw nothing astir.\"\n\"You came by the Redhouse?\"\n\"Yes.\"\n\"There would be nothing on that road. It is in the direction of Stilbro' the risk lies.\"\n\"And you think there is risk?\"\n\"What these fellows have done to others they may do to me. But most of the manufacturers seem paralysed when they are attacked. Sykes, for instance, when his place was burned to the ground, took no steps to discover or punish the miscreants: he gave up as tamely as a rabbit to a ferret. Now I should stand by my trade, my mill, and my machinery.\"\n\"You are rich, Moore?\"\n\"I am very rich in cloth I cannot sell. My warehouse is piled to the roof, since the Orders in Council cut off the American market. And to think that these ridiculous gossips will keep pestering one about being married! As if there was nothing to be done in life but to court some young lady, and go visiting. Oh, que le diable emporte!\" He broke off and added, more calmly, \"I believe women think only of these things, and they naturally fancy men's minds similarly occupied.\"\n\"Of course,\" assented Malone; \"but never mind them.\" He looked impatiently round, as if something was lacking.\n\"Mr. Malone,\" said Moore, \"you must require refreshment after your wet walk.\"\n\"Not at all,\" rejoined Malone; but he looked as if the right nail was hit on the head, nevertheless. Moore opened a cupboard.\n\"I keep food and drink here, for I often spend the evening here alone, and sleep in the mill. Sometimes I am my own watchman. I require little sleep, and it pleases me on a fine night to wander for an hour or two with my musket about the hollow. Mr. Malone, can you cook a mutton chop?\"\n\"Try me.\"\n\"There's a dishful, then, and there's the gridiron. Turn them quickly.\"\n\"Never fear. Hand me a knife and fork, please.\"\nThe curate turned up his coat-cuffs, and applied himself to the cookery with vigour. On the table Moore placed plates, a loaf of bread, a black bottle, and two tumblers. He filled a small copper kettle from a large stone jar in a corner, set it on the fire beside the hissing gridiron, got lemons, sugar, and a small china punch-bowl; but while he was brewing the punch a tap at the door called him away.\n\"Is it you, Sarah?\"\n\"Yes, sir. Will you come to supper, please, sir?\"\n\"No; I shall sleep in the mill. So lock the doors, and tell your mistress to go to bed.\"\n\"You have your household in proper order,\" observed Malone approvingly, as he turned the mutton chops. \"You are not under petticoat government, like poor Sweeting. Now you and I, Moore - there's a fine chop for you, full of gravy - you and I will have no grey mares in our stables when we marry.\"\n\"I never think about it. If the grey mare is handsome and tractable, why not?\"\n\"The chops are done. Is the punch brewed?\"\n\"There is a glassful. When Joe Scott and his assistants return they shall have a share, provided they bring the frames intact.\"\nMalone waxed very exultant over the supper. He laughed at trifles, made bad jokes and applauded them himself, and, in short, grew unmeaningly noisy. His host, on the contrary, remained quiet as before. I shall try to sketch him as he sits at table.\nYou would probably call him, at first view, a strange-looking man; for he is thin, dark, and foreign-looking, with shadowy hair carelessly streaking his forehead. He seems unconscious that his features are fine, clear and regular; but they hold an anxious expression and have a somewhat haggard appearance. His eyes are large, and grave, and grey; they are searching and thoughtful rather than genial. When he smiles, his face is agreeable - not that it is frank or cheerful even then, but it suggests a considerate nature, patient and forbearing. He is not more than thirty; his figure is tall and slender. He has an outlandish accent, which grates on a British, and especially on a Yorkshire, ear.\nMr. Moore, indeed, was scarcely half a Briton. He came of foreign ancestry by the mother's side, and had grown up on foreign soil. He cared little for patriotism; he did not attach himself to political parties, to sects, or even to customs. He had a tendency to withdraw from any community he happened to be living in, and considered the interests of Robert Grard Moore to be more relevant to him than any general philanthropy.\nTrade was Mr. Moore's calling: the Grards of Antwerp had been merchants for two centuries back. Once they had been wealthy, but the uncertainties of business had loosened the foundations of their credit. The house had stood on a tottering base for a dozen years; and at last, in the shock of the French Revolution, it had fallen, a total ruin. In its fall was involved the Yorkshire firm of Moore, closely connected with the Antwerp house: one of the Antwerp partners, Robert Moore, had married Hortense Grard, who was to inherit her father's share in the business. She inherited only debts - which her son Robert accepted, in his turn, as a legacy, saying that one day he would discharge them, and rebuild the fallen house of Grard and Moore.\nIf, however, he had a great aim of restoration, he had no money to attain it. When he came to Yorkshire, he - whose ancestors had owned warehouses and factories, a town-house and a country-seat - saw no way open to him but to rent a cloth-mill in an out-of-the-way district; and to take an adjoining cottage to live in, along with a few acres of the steep, rugged land that lined the hollow through which his mill-stream brawled. All this he held at a somewhat high rent (for times were hard, and everything was dear) from the Fieldhead estate.\nAt the time this history commences, Robert Moore had lived two years in the district. The dingy cottage had been converted into a neat, tasteful residence: part of the rough land had been made into a garden, which he cultivated with singular care. As to the mill, which was an old structure, and fitted up with old machinery, inefficient and out of date, he had from the first held its arrangements in contempt. He aimed for a radical reform, which he had carried out as fast as his limited funds would allow; and the shortage of those funds, and of progress, was a restraint which galled him sorely. Moore ever wanted to push on.\nNot being a native, he did not sufficiently care when the new inventions threw the old workpeople out of employ. He never asked himself where the jobless found daily bread; and in this negligence he only resembled thousands of others.\nThe period of which I write was an overshadowed one in British history. War with Napoleon was at its height: all Europe was involved. England was worn with long resistance, and her weary people cried out for peace on any terms. National honour was become a mere empty name, of no value in the eyes of many, because their sight was dim with famine; and for a morsel of meat they would have sold their birthright.\nThe \"Orders in Council,\" forbidding neutral powers to trade with France, had offended America, the principal market of the Yorkshire woollen trade, and brought it consequently to the verge of ruin. Minor foreign markets were glutted, and would receive no more wool.\nAt this crisis, inventions in machinery were introduced into the northern factories, which, greatly reducing the number of hands needed, threw thousands out of work, and left them penniless. A bad harvest supervened. Distress reached its climax. The throes of a sort of moral earthquake were felt heaving under the hills of the northern counties.\nBut, as is usual in such cases, nobody took much notice. When a food-riot broke out, when a mill was burnt down, or a manufacturer's house was attacked, and the family forced to flee, few measures were taken. A ringleader was detected, or more frequently escaped detection; newspaper paragraphs were written, and there the thing stopped.\nAs to the sufferers, who could not get work, and consequently could not buy food - they were left to suffer on. It would not do to stop the progress of invention. There was no help; so the unemployed ate the bread and drank the waters of affliction.\nMisery generates hate. These sufferers hated the machines; they hated the buildings which contained those machines; they hated the manufacturers who owned those buildings. In the parish of Briarfield, Hollow's Mill was the place held most abominable; Grard Moore, as a semi-foreigner and progressive mill-owner, was the man most abominated.\nAnd it perhaps rather agreed with Moore's temperament to be hated, especially when he believed the thing for which he was hated to be right. It was with a sense of warlike excitement that he sat in his counting-house on this night, awaiting the arrival of his frame-laden wagons. Malone's presence was unwelcome to him. He would have preferred sitting alone, with his musket for company.\nFor some ten minutes, Moore had been watching the Irish curate make free with the punch, when suddenly his steady grey eye changed. He raised his hand.\n\"Chut!\" he said in his French fashion. He listened a moment, then rose and went out.\nThe night was still, dark, and stagnant: the water rushed on full and fast, sounding like a flood in the silence. Moore's ear, however, caught another sound, very distant, broken and rugged - a sound of heavy wheels crunching a stony road. He lit a lantern, walked down the mill-yard, and opened the gates. The wagons were coming; the dray-horses' huge hoofs were heard splashing in the mud and water. Moore hailed them.\n\"Hey, Joe Scott! Is all right?\"\nProbably Joe Scott was still too distant to hear. He did not answer.\n\"Is all right, I say?\" again asked Moore.\nSome one jumped out from the first wagon into the road; a voice cried aloud, \"Ay, ay, divil; all's raight! We've smashed 'em.\"\nAnd there was a run. The wagons stood deserted.\n\"Joe Scott!\" No Joe Scott answered. \"Murgatroyd! Sykes!\" No reply. Mr. Moore lifted his lantern and looked into the vehicles. They held neither man nor machinery; they were empty and abandoned.\nNow Mr. Moore loved his machinery. He had risked the last of his money on the purchase of these frames. Where were they?\nThe words \"we've smashed 'em\" rang in his ears. His features relaxed into a singular smile - the smile a determined man wears when his spirit feels a demand on its strength, which it must bear or break. Yet he remained silent, and motionless; for he knew not what to say nor do. He placed the lantern on the ground, and stood with his arms folded, reflecting.\nAn impatient trampling of one of the horses made him look up. His eye caught the gleam of something white attached to the harness. This proved to be a folded note. It read:\n\"To the Divil of Hollow's Miln.\n\"Your hellish machinery is shivered to smash on Stilbro' Moor, and your men are lying bound hand and foot in a ditch by the roadside. Take this as a warning from men that are starving, and have starving wives and children. If you get new machines, you shall hear from us again. Beware!\"\n\"Hear from you again? Yes, I'll hear from you again, and you shall hear from me. On Stilbro' Moor you shall hear from me in a moment.\"\nHaving led the wagons within the gates, he hastened towards the cottage. Opening the door, he spoke a few words quickly but quietly to the two females who ran to meet him in the passage. He calmed the alarm of one; to the other, the maid-servant, he said,\n\"Go into the mill, Sarah, and ring the mill-bell as loud as you can. Then get another lantern and help me to light up the front.\"\nReturning to his horses, he unharnessed and stabled them with speed and care. Presently the mill-bell clanged out, with an irregular but loud and alarming din.\nOn that still night, it was heard a long way away. The guests in the Redhouse Inn were startled by the clamour, and declaring that \"there must be summat to do at Hollow's Miln,\" they called for lanterns, and hurried there. Scarcely had they thronged into the yard, when the tramp of horses was heard, and a little man in a shovel hat, sitting erect on a shaggy pony, rode in, followed by another rider on a larger steed.\nMr. Moore, meantime, had saddled his own horse, and had lit up his mill, whose long front was now illuminated. A deep hum of voices was heard. Mr. Malone had at last emerged from the counting-house, and stood with his shillelagh grasped in his fist. Mr. Moore appeared, and was immediately confronted by Mr. Helstone of the shovel hat and shaggy pony.\n\"Well, Moore, what is your business with us? I thought you would want us tonight - me and Tom here. When I heard your mill-bell I could sit still no longer, so I left Boultby to finish his supper alone. But where is the enemy? There is not a pane of glass broken in your windows. Have you had an attack, or do you expect one?\"\n\"I have neither had one nor expect one,\" answered Moore coolly. \"I only ordered the bell to be rung because I want two or three neighbours to stay here in the Hollow while I and a few others go over to Stilbro' Moor.\"\n\"To Stilbro' Moor! What to do? To meet the wagons?\"\n\"The wagons are come home an hour ago.\"\n\"Then all's right.\"\n\"They came home empty; and Joe Scott and company are left on the moor, and so are the frames. Read that scrawl.\"\nMr. Helstone read the note.\n\"Hum! Poor fellows in the ditch. This is a wet night for such a bed. Tom and I will go with you. Malone may stay behind and take care of the mill. What is the matter with him? His eyes seem starting out of his head.\"\n\"He has been eating a mutton chop.\"\n\"Indeed! - Peter Augustus Malone, be on your guard. Eat no more mutton chops tonight. You are left in command of these premises!\"\n\"Is anybody to stay with me?\"\n\"As many of those present as choose. - My lads, how many of you will remain here, and how many will go with me and Mr. Moore on the Stilbro' road, to meet some men who have been assaulted by frame-breakers?\"\nThree volunteered to go; the rest preferred staying behind. As Mr. Moore mounted his horse, the rector asked him in a low voice whether he had locked up the mutton chops, so that Peter Augustus could not get at them? Moore nodded, and the rescue-party set out.",
        "paragraph_chars": [
            [
                0,
                564
            ],
            [
                564,
                902
            ],
            [
                902,
                1319
            ],
            [
                1319,
                1478
            ],
            [
                1478,
                1747
            ],
            [
                1747,
                1766
            ],
            [
                1766,
                1820
            ],
            [
                1820,
                1850
            ],
            [
                1850,
                2216
            ],
            [
                2216,
                2498
            ],
            [
                2498,
                2547
            ],
            [
                2547,
                2588
            ],
            [
                2588,
                2727
            ],
            [
                2727,
                2848
            ],
            [
                2848,
                3238
            ],
            [
                3238,
                3375
            ],
            [
                3375,
                3446
            ],
            [
                3446,
                3538
            ],
            [
                3538,
                3603
            ],
            [
                3603,
                3711
            ],
            [
                3711,
                3814
            ],
            [
                3814,
                3900
            ],
            [
                3900,
                3965
            ],
            [
                3965,
                4022
            ],
            [
                4022,
                4088
            ],
            [
                4088,
                4132
            ],
            [
                4132,
                4238
            ],
            [
                4238,
                4362
            ],
            [
                4362,
                4414
            ],
            [
                4414,
                4520
            ],
            [
                4520,
                4740
            ],
            [
                4740,
                4973
            ],
            [
                4973,
                5550
            ],
            [
                5550,
                5805
            ],
            [
                5805,
                5963
            ],
            [
                5963,
                6003
            ],
            [
                6003,
                6152
            ],
            [
                6152,
                6295
            ],
            [
                6295,
                6448
            ],
            [
                6448,
                6609
            ],
            [
                6609,
                6637
            ],
            [
                6637,
                6644
            ],
            [
                6644,
                6733
            ],
            [
                6733,
                6764
            ],
            [
                6764,
                7112
            ],
            [
                7112,
                7135
            ],
            [
                7135,
                7613
            ],
            [
                7613,
                7724
            ],
            [
                7724,
                7802
            ],
            [
                7802,
                7928
            ],
            [
                7928,
                8215
            ],
            [
                8215,
                8225
            ],
            [
                8225,
                8297
            ],
            [
                8297,
                8345
            ],
            [
                8345,
                8750
            ],
            [
                8750,
                8770
            ],
            [
                8770,
                8820
            ],
            [
                8820,
                8909
            ],
            [
                8909,
                9206
            ],
            [
                9206,
                9285
            ],
            [
                9285,
                9328
            ],
            [
                9328,
                9456
            ],
            [
                9456,
                9705
            ],
            [
                9705,
                10405
            ],
            [
                10405,
                10833
            ],
            [
                10833,
                11577
            ],
            [
                11577,
                12122
            ],
            [
                12122,
                12753
            ],
            [
                12753,
                12988
            ],
            [
                12988,
                13400
            ],
            [
                13400,
                13666
            ],
            [
                13666,
                14013
            ],
            [
                14013,
                14351
            ],
            [
                14351,
                14601
            ],
            [
                14601,
                14942
            ],
            [
                14942,
                15330
            ],
            [
                15330,
                15482
            ],
            [
                15482,
                15567
            ],
            [
                15567,
                15988
            ],
            [
                15988,
                16020
            ],
            [
                16020,
                16089
            ],
            [
                16089,
                16131
            ],
            [
                16131,
                16258
            ],
            [
                16258,
                16306
            ],
            [
                16306,
                16500
            ],
            [
                16500,
                16621
            ],
            [
                16621,
                16981
            ],
            [
                16981,
                17154
            ],
            [
                17154,
                17186
            ],
            [
                17186,
                17473
            ],
            [
                17473,
                17608
            ],
            [
                17608,
                17864
            ],
            [
                17864,
                17994
            ],
            [
                17994,
                18154
            ],
            [
                18154,
                18575
            ],
            [
                18575,
                18927
            ],
            [
                18927,
                19254
            ],
            [
                19254,
                19472
            ],
            [
                19472,
                19524
            ],
            [
                19524,
                19564
            ],
            [
                19564,
                19584
            ],
            [
                19584,
                19697
            ],
            [
                19697,
                19725
            ],
            [
                19725,
                19942
            ],
            [
                19942,
                19978
            ],
            [
                19978,
                20108
            ],
            [
                20108,
                20138
            ],
            [
                20138,
                20346
            ],
            [
                20346,
                20606
            ]
        ],
        "segment_chars": [
            [
                0,
                78
            ],
            [
                78,
                223
            ],
            [
                223,
                371
            ],
            [
                371,
                461
            ],
            [
                461,
                564
            ],
            [
                564,
                754
            ],
            [
                754,
                876
            ],
            [
                876,
                902
            ],
            [
                902,
                1010
            ],
            [
                1010,
                1083
            ],
            [
                1083,
                1161
            ],
            [
                1161,
                1210
            ],
            [
                1210,
                1235
            ],
            [
                1235,
                1319
            ],
            [
                1319,
                1371
            ],
            [
                1371,
                1451
            ],
            [
                1451,
                1478
            ],
            [
                1478,
                1578
            ],
            [
                1578,
                1599
            ],
            [
                1599,
                1703
            ],
            [
                1703,
                1747
            ],
            [
                1747,
                1766
            ],
            [
                1766,
                1820
            ],
            [
                1820,
                1850
            ],
            [
                1850,
                1880
            ],
            [
                1880,
                1930
            ],
            [
                1930,
                2093
            ],
            [
                2093,
                2216
            ],
            [
                2216,
                2278
            ],
            [
                2278,
                2323
            ],
            [
                2323,
                2347
            ],
            [
                2347,
                2484
            ],
            [
                2484,
                2498
            ],
            [
                2498,
                2516
            ],
            [
                2516,
                2547
            ],
            [
                2547,
                2565
            ],
            [
                2565,
                2588
            ],
            [
                2588,
                2593
            ],
            [
                2593,
                2606
            ],
            [
                2606,
                2667
            ],
            [
                2667,
                2727
            ],
            [
                2727,
                2764
            ],
            [
                2764,
                2812
            ],
            [
                2812,
                2848
            ],
            [
                2848,
                3040
            ],
            [
                3040,
                3136
            ],
            [
                3136,
                3238
            ],
            [
                3238,
                3375
            ],
            [
                3375,
                3446
            ],
            [
                3446,
                3538
            ],
            [
                3538,
                3547
            ],
            [
                3547,
                3603
            ],
            [
                3603,
                3614
            ],
            [
                3614,
                3634
            ],
            [
                3634,
                3647
            ],
            [
                3647,
                3711
            ],
            [
                3711,
                3809
            ],
            [
                3809,
                3814
            ],
            [
                3814,
                3900
            ],
            [
                3900,
                3965
            ],
            [
                3965,
                4022
            ],
            [
                4022,
                4050
            ],
            [
                4050,
                4088
            ],
            [
                4088,
                4132
            ],
            [
                4132,
                4181
            ],
            [
                4181,
                4238
            ],
            [
                4238,
                4258
            ],
            [
                4258,
                4305
            ],
            [
                4305,
                4341
            ],
            [
                4341,
                4362
            ],
            [
                4362,
                4414
            ],
            [
                4414,
                4419
            ],
            [
                4419,
                4423
            ],
            [
                4423,
                4434
            ],
            [
                4434,
                4473
            ],
            [
                4473,
                4520
            ],
            [
                4520,
                4554
            ],
            [
                4554,
                4740
            ],
            [
                4740,
                4789
            ],
            [
                4789,
                4950
            ],
            [
                4950,
                4954
            ],
            [
                4954,
                4973
            ],
            [
                4973,
                5066
            ],
            [
                5066,
                5133
            ],
            [
                5133,
                5206
            ],
            [
                5206,
                5295
            ],
            [
                5295,
                5342
            ],
            [
                5342,
                5550
            ],
            [
                5550,
                5590
            ],
            [
                5590,
                5745
            ],
            [
                5745,
                5753
            ],
            [
                5753,
                5805
            ],
            [
                5805,
                5837
            ],
            [
                5837,
                5885
            ],
            [
                5885,
                5963
            ],
            [
                5963,
                5971
            ],
            [
                5971,
                5980
            ],
            [
                5980,
                6003
            ],
            [
                6003,
                6045
            ],
            [
                6045,
                6098
            ],
            [
                6098,
                6152
            ],
            [
                6152,
                6243
            ],
            [
                6243,
                6260
            ],
            [
                6260,
                6295
            ],
            [
                6295,
                6383
            ],
            [
                6383,
                6425
            ],
            [
                6425,
                6448
            ],
            [
                6448,
                6501
            ],
            [
                6501,
                6587
            ],
            [
                6587,
                6609
            ],
            [
                6609,
                6637
            ],
            [
                6637,
                6644
            ],
            [
                6644,
                6682
            ],
            [
                6682,
                6733
            ],
            [
                6733,
                6764
            ],
            [
                6764,
                6823
            ],
            [
                6823,
                6892
            ],
            [
                6892,
                7052
            ],
            [
                7052,
                7112
            ],
            [
                7112,
                7135
            ],
            [
                7135,
                7175
            ],
            [
                7175,
                7267
            ],
            [
                7267,
                7355
            ],
            [
                7355,
                7445
            ],
            [
                7445,
                7473
            ],
            [
                7473,
                7613
            ],
            [
                7613,
                7666
            ],
            [
                7666,
                7724
            ],
            [
                7724,
                7802
            ],
            [
                7802,
                7903
            ],
            [
                7903,
                7928
            ],
            [
                7928,
                8022
            ],
            [
                8022,
                8054
            ],
            [
                8054,
                8174
            ],
            [
                8174,
                8215
            ],
            [
                8215,
                8225
            ],
            [
                8225,
                8277
            ],
            [
                8277,
                8297
            ],
            [
                8297,
                8310
            ],
            [
                8310,
                8345
            ],
            [
                8345,
                8430
            ],
            [
                8430,
                8515
            ],
            [
                8515,
                8750
            ],
            [
                8750,
                8770
            ],
            [
                8770,
                8781
            ],
            [
                8781,
                8820
            ],
            [
                8820,
                8852
            ],
            [
                8852,
                8909
            ],
            [
                8909,
                9012
            ],
            [
                9012,
                9073
            ],
            [
                9073,
                9206
            ],
            [
                9206,
                9231
            ],
            [
                9231,
                9285
            ],
            [
                9285,
                9306
            ],
            [
                9306,
                9328
            ],
            [
                9328,
                9350
            ],
            [
                9350,
                9456
            ],
            [
                9456,
                9500
            ],
            [
                9500,
                9605
            ],
            [
                9605,
                9658
            ],
            [
                9658,
                9705
            ],
            [
                9705,
                9868
            ],
            [
                9868,
                10012
            ],
            [
                10012,
                10107
            ],
            [
                10107,
                10253
            ],
            [
                10253,
                10313
            ],
            [
                10313,
                10405
            ],
            [
                10405,
                10452
            ],
            [
                10452,
                10536
            ],
            [
                10536,
                10646
            ],
            [
                10646,
                10833
            ],
            [
                10833,
                10929
            ],
            [
                10929,
                11037
            ],
            [
                11037,
                11177
            ],
            [
                11177,
                11399
            ],
            [
                11399,
                11577
            ],
            [
                11577,
                11655
            ],
            [
                11655,
                12007
            ],
            [
                12007,
                12122
            ],
            [
                12122,
                12208
            ],
            [
                12208,
                12370
            ],
            [
                12370,
                12534
            ],
            [
                12534,
                12723
            ],
            [
                12723,
                12753
            ],
            [
                12753,
                12866
            ],
            [
                12866,
                12988
            ],
            [
                12988,
                13060
            ],
            [
                13060,
                13122
            ],
            [
                13122,
                13216
            ],
            [
                13216,
                13400
            ],
            [
                13400,
                13598
            ],
            [
                13598,
                13666
            ],
            [
                13666,
                13857
            ],
            [
                13857,
                13883
            ],
            [
                13883,
                13912
            ],
            [
                13912,
                14013
            ],
            [
                14013,
                14070
            ],
            [
                14070,
                14222
            ],
            [
                14222,
                14351
            ],
            [
                14351,
                14463
            ],
            [
                14463,
                14514
            ],
            [
                14514,
                14601
            ],
            [
                14601,
                14624
            ],
            [
                14624,
                14773
            ],
            [
                14773,
                14942
            ],
            [
                14942,
                15083
            ],
            [
                15083,
                15222
            ],
            [
                15222,
                15262
            ],
            [
                15262,
                15330
            ],
            [
                15330,
                15462
            ],
            [
                15462,
                15482
            ],
            [
                15482,
                15490
            ],
            [
                15490,
                15521
            ],
            [
                15521,
                15567
            ],
            [
                15567,
                15681
            ],
            [
                15681,
                15807
            ],
            [
                15807,
                15874
            ],
            [
                15874,
                15969
            ],
            [
                15969,
                15988
            ],
            [
                15988,
                16005
            ],
            [
                16005,
                16020
            ],
            [
                16020,
                16070
            ],
            [
                16070,
                16089
            ],
            [
                16089,
                16112
            ],
            [
                16112,
                16131
            ],
            [
                16131,
                16238
            ],
            [
                16238,
                16258
            ],
            [
                16258,
                16279
            ],
            [
                16279,
                16306
            ],
            [
                16306,
                16319
            ],
            [
                16319,
                16342
            ],
            [
                16342,
                16355
            ],
            [
                16355,
                16363
            ],
            [
                16363,
                16373
            ],
            [
                16373,
                16432
            ],
            [
                16432,
                16500
            ],
            [
                16500,
                16535
            ],
            [
                16535,
                16604
            ],
            [
                16604,
                16621
            ],
            [
                16621,
                16669
            ],
            [
                16669,
                16824
            ],
            [
                16824,
                16900
            ],
            [
                16900,
                16981
            ],
            [
                16981,
                17043
            ],
            [
                17043,
                17112
            ],
            [
                17112,
                17145
            ],
            [
                17145,
                17154
            ],
            [
                17154,
                17186
            ],
            [
                17186,
                17320
            ],
            [
                17320,
                17409
            ],
            [
                17409,
                17464
            ],
            [
                17464,
                17473
            ],
            [
                17473,
                17495
            ],
            [
                17495,
                17554
            ],
            [
                17554,
                17608
            ],
            [
                17608,
                17681
            ],
            [
                17681,
                17795
            ],
            [
                17795,
                17864
            ],
            [
                17864,
                17933
            ],
            [
                17933,
                17994
            ],
            [
                17994,
                18072
            ],
            [
                18072,
                18154
            ],
            [
                18154,
                18205
            ],
            [
                18205,
                18377
            ],
            [
                18377,
                18575
            ],
            [
                18575,
                18686
            ],
            [
                18686,
                18718
            ],
            [
                18718,
                18825
            ],
            [
                18825,
                18927
            ],
            [
                18927,
                18972
            ],
            [
                18972,
                19027
            ],
            [
                19027,
                19130
            ],
            [
                19130,
                19154
            ],
            [
                19154,
                19207
            ],
            [
                19207,
                19254
            ],
            [
                19254,
                19318
            ],
            [
                19318,
                19472
            ],
            [
                19472,
                19491
            ],
            [
                19491,
                19503
            ],
            [
                19503,
                19524
            ],
            [
                19524,
                19564
            ],
            [
                19564,
                19584
            ],
            [
                19584,
                19678
            ],
            [
                19678,
                19697
            ],
            [
                19697,
                19725
            ],
            [
                19725,
                19731
            ],
            [
                19731,
                19758
            ],
            [
                19758,
                19794
            ],
            [
                19794,
                19822
            ],
            [
                19822,
                19872
            ],
            [
                19872,
                19901
            ],
            [
                19901,
                19942
            ],
            [
                19942,
                19978
            ],
            [
                19978,
                19987
            ],
            [
                19987,
                20030
            ],
            [
                20030,
                20064
            ],
            [
                20064,
                20108
            ],
            [
                20108,
                20138
            ],
            [
                20138,
                20175
            ],
            [
                20175,
                20346
            ],
            [
                20346,
                20406
            ],
            [
                20406,
                20563
            ],
            [
                20563,
                20606
            ]
        ],
        "overlap_chars": [
            [
                0,
                58
            ],
            [
                65,
                76
            ],
            [
                76,
                78
            ],
            [
                78,
                92
            ],
            [
                105,
                115
            ],
            [
                116,
                135
            ],
            [
                136,
                145
            ],
            [
                153,
                189
            ],
            [
                190,
                221
            ],
            [
                221,
                223
            ],
            [
                223,
                245
            ],
            [
                254,
                257
            ],
            [
                258,
                263
            ],
            [
                264,
                269
            ],
            [
                273,
                280
            ],
            [
                280,
                281
            ],
            [
                282,
                286
            ],
            [
                287,
                321
            ],
            [
                331,
                332
            ],
            [
                333,
                353
            ],
            [
                362,
                369
            ],
            [
                369,
                371
            ],
            [
                371,
                378
            ],
            [
                379,
                381
            ],
            [
                387,
                395
            ],
            [
                396,
                415
            ],
            [
                416,
                419
            ],
            [
                426,
                459
            ],
            [
                459,
                461
            ],
            [
                461,
                470
            ],
            [
                476,
                497
            ],
            [
                500,
                530
            ],
            [
                530,
                531
            ],
            [
                536,
                558
            ],
            [
                562,
                563
            ],
            [
                564,
                579
            ],
            [
                584,
                587
            ],
            [
                587,
                701
            ],
            [
                706,
                713
            ],
            [
                714,
                720
            ],
            [
                726,
                754
            ],
            [
                754,
                774
            ],
            [
                775,
                794
            ],
            [
                794,
                811
            ],
            [
                812,
                814
            ],
            [
                815,
                818
            ],
            [
                823,
                842
            ],
            [
                843,
                876
            ],
            [
                876,
                902
            ],
            [
                905,
                908
            ],
            [
                914,
                927
            ],
            [
                928,
                930
            ],
            [
                936,
                947
            ],
            [
                948,
                964
            ],
            [
                965,
                971
            ],
            [
                972,
                977
            ],
            [
                978,
                984
            ],
            [
                984,
                1010
            ],
            [
                1010,
                1019
            ],
            [
                1025,
                1042
            ],
            [
                1044,
                1083
            ],
            [
                1083,
                1129
            ],
            [
                1134,
                1135
            ],
            [
                1136,
                1161
            ],
            [
                1161,
                1210
            ],
            [
                1210,
                1233
            ],
            [
                1235,
                1243
            ],
            [
                1244,
                1251
            ],
            [
                1252,
                1275
            ],
            [
                1276,
                1319
            ],
            [
                1326,
                1339
            ],
            [
                1339,
                1351
            ],
            [
                1369,
                1371
            ],
            [
                1371,
                1399
            ],
            [
                1403,
                1409
            ],
            [
                1410,
                1415
            ],
            [
                1417,
                1451
            ],
            [
                1451,
                1465
            ],
            [
                1476,
                1478
            ],
            [
                1478,
                1509
            ],
            [
                1512,
                1550
            ],
            [
                1553,
                1578
            ],
            [
                1578,
                1579
            ],
            [
                1580,
                1599
            ],
            [
                1599,
                1601
            ],
            [
                1606,
                1612
            ],
            [
                1620,
                1621
            ],
            [
                1622,
                1630
            ],
            [
                1656,
                1670
            ],
            [
                1701,
                1703
            ],
            [
                1703,
                1722
            ],
            [
                1730,
                1747
            ],
            [
                1747,
                1748
            ],
            [
                1748,
                1750
            ],
            [
                1753,
                1760
            ],
            [
                1761,
                1763
            ],
            [
                1763,
                1766
            ],
            [
                1766,
                1767
            ],
            [
                1769,
                1775
            ],
            [
                1776,
                1781
            ],
            [
                1782,
                1793
            ],
            [
                1796,
                1820
            ],
            [
                1820,
                1835
            ],
            [
                1836,
                1850
            ],
            [
                1850,
                1880
            ],
            [
                1880,
                1919
            ],
            [
                1928,
                1930
            ],
            [
                1930,
                1967
            ],
            [
                1985,
                1998
            ],
            [
                1999,
                2017
            ],
            [
                2025,
                2064
            ],
            [
                2069,
                2085
            ],
            [
                2091,
                2093
            ],
            [
                2093,
                2131
            ],
            [
                2131,
                2170
            ],
            [
                2171,
                2188
            ],
            [
                2189,
                2216
            ],
            [
                2216,
                2252
            ],
            [
                2267,
                2278
            ],
            [
                2278,
                2323
            ],
            [
                2323,
                2347
            ],
            [
                2347,
                2390
            ],
            [
                2393,
                2442
            ],
            [
                2443,
                2453
            ],
            [
                2461,
                2484
            ],
            [
                2484,
                2496
            ],
            [
                2496,
                2498
            ],
            [
                2498,
                2516
            ],
            [
                2516,
                2547
            ],
            [
                2547,
                2565
            ],
            [
                2565,
                2577
            ],
            [
                2583,
                2588
            ],
            [
                2588,
                2593
            ],
            [
                2593,
                2606
            ],
            [
                2606,
                2615
            ],
            [
                2616,
                2642
            ],
            [
                2648,
                2667
            ],
            [
                2667,
                2716
            ],
            [
                2717,
                2725
            ],
            [
                2727,
                2764
            ],
            [
                2764,
                2772
            ],
            [
                2773,
                2797
            ],
            [
                2807,
                2810
            ],
            [
                2810,
                2812
            ],
            [
                2812,
                2824
            ],
            [
                2832,
                2845
            ],
            [
                2845,
                2848
            ],
            [
                2848,
                2888
            ],
            [
                2889,
                2893
            ],
            [
                2896,
                2900
            ],
            [
                2901,
                2924
            ],
            [
                2924,
                2925
            ],
            [
                2932,
                2935
            ],
            [
                2936,
                2944
            ],
            [
                2944,
                2984
            ],
            [
                2988,
                2995
            ],
            [
                2996,
                3000
            ],
            [
                3001,
                3040
            ],
            [
                3040,
                3077
            ],
            [
                3078,
                3090
            ],
            [
                3091,
                3097
            ],
            [
                3104,
                3108
            ],
            [
                3119,
                3134
            ],
            [
                3136,
                3139
            ],
            [
                3168,
                3174
            ],
            [
                3174,
                3185
            ],
            [
                3185,
                3202
            ],
            [
                3203,
                3212
            ],
            [
                3227,
                3236
            ],
            [
                3236,
                3238
            ],
            [
                3238,
                3244
            ],
            [
                3245,
                3260
            ],
            [
                3266,
                3355
            ],
            [
                3364,
                3367
            ],
            [
                3368,
                3375
            ],
            [
                3375,
                3422
            ],
            [
                3423,
                3446
            ],
            [
                3446,
                3538
            ],
            [
                3538,
                3541
            ],
            [
                3543,
                3547
            ],
            [
                3547,
                3571
            ],
            [
                3571,
                3572
            ],
            [
                3582,
                3600
            ],
            [
                3603,
                3613
            ],
            [
                3614,
                3619
            ],
            [
                3624,
                3631
            ],
            [
                3631,
                3633
            ],
            [
                3640,
                3645
            ],
            [
                3645,
                3646
            ],
            [
                3648,
                3651
            ],
            [
                3661,
                3711
            ],
            [
                3711,
                3726
            ],
            [
                3729,
                3809
            ],
            [
                3809,
                3814
            ],
            [
                3814,
                3824
            ],
            [
                3825,
                3890
            ],
            [
                3897,
                3900
            ],
            [
                3900,
                3937
            ],
            [
                3940,
                3945
            ],
            [
                3950,
                3965
            ],
            [
                3965,
                3971
            ],
            [
                3972,
                4019
            ],
            [
                4019,
                4022
            ],
            [
                4022,
                4050
            ],
            [
                4050,
                4088
            ],
            [
                4088,
                4132
            ],
            [
                4132,
                4181
            ],
            [
                4181,
                4238
            ],
            [
                4238,
                4258
            ],
            [
                4258,
                4285
            ],
            [
                4292,
                4293
            ],
            [
                4298,
                4303
            ],
            [
                4303,
                4305
            ],
            [
                4305,
                4313
            ],
            [
                4314,
                4319
            ],
            [
                4319,
                4325
            ],
            [
                4325,
                4326
            ],
            [
                4331,
                4341
            ],
            [
                4341,
                4362
            ],
            [
                4362,
                4411
            ],
            [
                4411,
                4414
            ],
            [
                4414,
                4419
            ],
            [
                4419,
                4423
            ],
            [
                4423,
                4434
            ],
            [
                4434,
                4473
            ],
            [
                4473,
                4476
            ],
            [
                4477,
                4498
            ],
            [
                4499,
                4517
            ],
            [
                4520,
                4526
            ],
            [
                4531,
                4543
            ],
            [
                4558,
                4560
            ],
            [
                4561,
                4588
            ],
            [
                4594,
                4668
            ],
            [
                4674,
                4701
            ],
            [
                4708,
                4740
            ],
            [
                4740,
                4787
            ],
            [
                4789,
                4811
            ],
            [
                4817,
                4826
            ],
            [
                4827,
                4847
            ],
            [
                4848,
                4854
            ],
            [
                4862,
                4889
            ],
            [
                4903,
                4934
            ],
            [
                4935,
                4939
            ],
            [
                4944,
                4950
            ],
            [
                4950,
                4954
            ],
            [
                4954,
                4970
            ],
            [
                4973,
                5066
            ],
            [
                5066,
                5093
            ],
            [
                5094,
                5106
            ],
            [
                5107,
                5122
            ],
            [
                5123,
                5131
            ],
            [
                5131,
                5133
            ],
            [
                5133,
                5138
            ],
            [
                5139,
                5164
            ],
            [
                5166,
                5167
            ],
            [
                5168,
                5172
            ],
            [
                5173,
                5192
            ],
            [
                5193,
                5206
            ],
            [
                5206,
                5276
            ],
            [
                5284,
                5295
            ],
            [
                5295,
                5313
            ],
            [
                5314,
                5316
            ],
            [
                5321,
                5332
            ],
            [
                5340,
                5342
            ],
            [
                5342,
                5381
            ],
            [
                5382,
                5386
            ],
            [
                5387,
                5389
            ],
            [
                5390,
                5406
            ],
            [
                5407,
                5425
            ],
            [
                5431,
                5438
            ],
            [
                5439,
                5441
            ],
            [
                5454,
                5460
            ],
            [
                5463,
                5464
            ],
            [
                5469,
                5520
            ],
            [
                5521,
                5524
            ],
            [
                5525,
                5547
            ],
            [
                5547,
                5550
            ],
            [
                5550,
                5590
            ],
            [
                5590,
                5619
            ],
            [
                5619,
                5634
            ],
            [
                5635,
                5636
            ],
            [
                5649,
                5657
            ],
            [
                5660,
                5702
            ],
            [
                5711,
                5745
            ],
            [
                5745,
                5753
            ],
            [
                5753,
                5783
            ],
            [
                5784,
                5797
            ],
            [
                5800,
                5805
            ],
            [
                5805,
                5826
            ],
            [
                5835,
                5837
            ],
            [
                5837,
                5883
            ],
            [
                5883,
                5885
            ],
            [
                5885,
                5890
            ],
            [
                5891,
                5963
            ],
            [
                5963,
                5971
            ],
            [
                5971,
                5980
            ],
            [
                5980,
                6003
            ],
            [
                6003,
                6013
            ],
            [
                6019,
                6029
            ],
            [
                6029,
                6045
            ],
            [
                6045,
                6060
            ],
            [
                6061,
                6072
            ],
            [
                6072,
                6073
            ],
            [
                6074,
                6081
            ],
            [
                6089,
                6096
            ],
            [
                6096,
                6098
            ],
            [
                6098,
                6152
            ],
            [
                6152,
                6183
            ],
            [
                6184,
                6191
            ],
            [
                6195,
                6243
            ],
            [
                6243,
                6260
            ],
            [
                6260,
                6295
            ],
            [
                6295,
                6320
            ],
            [
                6323,
                6333
            ],
            [
                6336,
                6351
            ],
            [
                6352,
                6383
            ],
            [
                6383,
                6387
            ],
            [
                6396,
                6425
            ],
            [
                6425,
                6448
            ],
            [
                6448,
                6499
            ],
            [
                6499,
                6501
            ],
            [
                6501,
                6515
            ],
            [
                6521,
                6540
            ],
            [
                6548,
                6585
            ],
            [
                6585,
                6587
            ],
            [
                6587,
                6609
            ],
            [
                6609,
                6637
            ],
            [
                6637,
                6644
            ],
            [
                6644,
                6682
            ],
            [
                6682,
                6733
            ],
            [
                6733,
                6764
            ],
            [
                6764,
                6823
            ],
            [
                6827,
                6857
            ],
            [
                6868,
                6892
            ],
            [
                6892,
                6921
            ],
            [
                6928,
                6931
            ],
            [
                6932,
                6952
            ],
            [
                6952,
                7038
            ],
            [
                7042,
                7052
            ],
            [
                7052,
                7057
            ],
            [
                7058,
                7112
            ],
            [
                7112,
                7113
            ],
            [
                7113,
                7125
            ],
            [
                7125,
                7135
            ],
            [
                7135,
                7175
            ],
            [
                7175,
                7187
            ],
            [
                7188,
                7208
            ],
            [
                7208,
                7209
            ],
            [
                7216,
                7237
            ],
            [
                7238,
                7241
            ],
            [
                7242,
                7245
            ],
            [
                7246,
                7249
            ],
            [
                7250,
                7256
            ],
            [
                7259,
                7265
            ],
            [
                7265,
                7266
            ],
            [
                7267,
                7270
            ],
            [
                7271,
                7309
            ],
            [
                7310,
                7355
            ],
            [
                7355,
                7404
            ],
            [
                7411,
                7431
            ],
            [
                7432,
                7434
            ],
            [
                7445,
                7473
            ],
            [
                7473,
                7485
            ],
            [
                7486,
                7526
            ],
            [
                7527,
                7613
            ],
            [
                7613,
                7614
            ],
            [
                7614,
                7666
            ],
            [
                7666,
                7668
            ],
            [
                7669,
                7694
            ],
            [
                7701,
                7710
            ],
            [
                7722,
                7723
            ],
            [
                7724,
                7742
            ],
            [
                7748,
                7799
            ],
            [
                7802,
                7871
            ],
            [
                7872,
                7903
            ],
            [
                7903,
                7908
            ],
            [
                7909,
                7928
            ],
            [
                7941,
                7944
            ],
            [
                7961,
                7986
            ],
            [
                7987,
                8008
            ],
            [
                8009,
                8022
            ],
            [
                8022,
                8054
            ],
            [
                8054,
                8174
            ],
            [
                8174,
                8215
            ],
            [
                8215,
                8222
            ],
            [
                8225,
                8277
            ],
            [
                8277,
                8294
            ],
            [
                8297,
                8308
            ],
            [
                8308,
                8310
            ],
            [
                8310,
                8314
            ],
            [
                8318,
                8345
            ],
            [
                8345,
                8430
            ],
            [
                8430,
                8442
            ],
            [
                8449,
                8455
            ],
            [
                8456,
                8515
            ],
            [
                8515,
                8517
            ],
            [
                8518,
                8524
            ],
            [
                8525,
                8546
            ],
            [
                8547,
                8750
            ],
            [
                8750,
                8770
            ],
            [
                8770,
                8781
            ],
            [
                8781,
                8820
            ],
            [
                8820,
                8823
            ],
            [
                8823,
                8852
            ],
            [
                8852,
                8909
            ],
            [
                8909,
                8983
            ],
            [
                8984,
                8986
            ],
            [
                8987,
                9012
            ],
            [
                9012,
                9071
            ],
            [
                9073,
                9093
            ],
            [
                9096,
                9110
            ],
            [
                9116,
                9124
            ],
            [
                9125,
                9138
            ],
            [
                9141,
                9163
            ],
            [
                9169,
                9206
            ],
            [
                9206,
                9207
            ],
            [
                9207,
                9231
            ],
            [
                9231,
                9237
            ],
            [
                9243,
                9285
            ],
            [
                9285,
                9306
            ],
            [
                9306,
                9328
            ],
            [
                9328,
                9350
            ],
            [
                9350,
                9372
            ],
            [
                9384,
                9414
            ],
            [
                9414,
                9435
            ],
            [
                9436,
                9456
            ],
            [
                9456,
                9500
            ],
            [
                9500,
                9510
            ],
            [
                9511,
                9605
            ],
            [
                9605,
                9658
            ],
            [
                9658,
                9659
            ],
            [
                9670,
                9705
            ],
            [
                9705,
                9728
            ],
            [
                9732,
                9748
            ],
            [
                9749,
                9793
            ],
            [
                9798,
                9805
            ],
            [
                9813,
                9868
            ],
            [
                9868,
                9916
            ],
            [
                9917,
                9922
            ],
            [
                9923,
                9926
            ],
            [
                9927,
                9934
            ],
            [
                9934,
                9935
            ],
            [
                9940,
                9944
            ],
            [
                9950,
                9960
            ],
            [
                9976,
                9982
            ],
            [
                9983,
                9999
            ],
            [
                10010,
                10012
            ],
            [
                10012,
                10046
            ],
            [
                10051,
                10052
            ],
            [
                10062,
                10071
            ],
            [
                10072,
                10075
            ],
            [
                10076,
                10086
            ],
            [
                10087,
                10093
            ],
            [
                10094,
                10107
            ],
            [
                10107,
                10114
            ],
            [
                10121,
                10126
            ],
            [
                10132,
                10144
            ],
            [
                10147,
                10194
            ],
            [
                10207,
                10220
            ],
            [
                10221,
                10228
            ],
            [
                10229,
                10236
            ],
            [
                10241,
                10251
            ],
            [
                10251,
                10253
            ],
            [
                10253,
                10258
            ],
            [
                10259,
                10284
            ],
            [
                10285,
                10291
            ],
            [
                10292,
                10299
            ],
            [
                10304,
                10313
            ],
            [
                10313,
                10347
            ],
            [
                10348,
                10405
            ],
            [
                10405,
                10427
            ],
            [
                10428,
                10436
            ],
            [
                10437,
                10450
            ],
            [
                10450,
                10452
            ],
            [
                10452,
                10462
            ],
            [
                10463,
                10505
            ],
            [
                10519,
                10521
            ],
            [
                10522,
                10536
            ],
            [
                10536,
                10538
            ],
            [
                10552,
                10555
            ],
            [
                10566,
                10567
            ],
            [
                10568,
                10570
            ],
            [
                10575,
                10578
            ],
            [
                10579,
                10596
            ],
            [
                10607,
                10625
            ],
            [
                10629,
                10636
            ],
            [
                10637,
                10644
            ],
            [
                10644,
                10645
            ],
            [
                10646,
                10666
            ],
            [
                10676,
                10694
            ],
            [
                10695,
                10697
            ],
            [
                10707,
                10712
            ],
            [
                10720,
                10722
            ],
            [
                10722,
                10727
            ],
            [
                10739,
                10774
            ],
            [
                10775,
                10780
            ],
            [
                10795,
                10797
            ],
            [
                10811,
                10818
            ],
            [
                10819,
                10830
            ],
            [
                10833,
                10854
            ],
            [
                10855,
                10929
            ],
            [
                10929,
                10955
            ],
            [
                10955,
                10956
            ],
            [
                10957,
                10978
            ],
            [
                10979,
                10994
            ],
            [
                10995,
                11003
            ],
            [
                11004,
                11037
            ],
            [
                11037,
                11154
            ],
            [
                11163,
                11177
            ],
            [
                11177,
                11205
            ],
            [
                11206,
                11271
            ],
            [
                11273,
                11283
            ],
            [
                11284,
                11291
            ],
            [
                11292,
                11300
            ],
            [
                11300,
                11343
            ],
            [
                11363,
                11373
            ],
            [
                11373,
                11399
            ],
            [
                11399,
                11412
            ],
            [
                11432,
                11482
            ],
            [
                11490,
                11494
            ],
            [
                11495,
                11502
            ],
            [
                11503,
                11505
            ],
            [
                11512,
                11531
            ],
            [
                11532,
                11575
            ],
            [
                11575,
                11576
            ],
            [
                11577,
                11604
            ],
            [
                11609,
                11623
            ],
            [
                11623,
                11624
            ],
            [
                11641,
                11643
            ],
            [
                11651,
                11653
            ],
            [
                11653,
                11655
            ],
            [
                11655,
                11684
            ],
            [
                11685,
                11686
            ],
            [
                11687,
                11723
            ],
            [
                11724,
                11737
            ],
            [
                11737,
                11738
            ],
            [
                11739,
                11740
            ],
            [
                11741,
                11755
            ],
            [
                11758,
                11770
            ],
            [
                11771,
                11772
            ],
            [
                11773,
                11841
            ],
            [
                11842,
                11851
            ],
            [
                11852,
                11858
            ],
            [
                11859,
                11863
            ],
            [
                11864,
                11866
            ],
            [
                11867,
                11876
            ],
            [
                11877,
                11884
            ],
            [
                11885,
                11887
            ],
            [
                11893,
                11895
            ],
            [
                11895,
                11896
            ],
            [
                11908,
                12007
            ],
            [
                12007,
                12052
            ],
            [
                12053,
                12094
            ],
            [
                12100,
                12120
            ],
            [
                12120,
                12122
            ],
            [
                12122,
                12180
            ],
            [
                12181,
                12206
            ],
            [
                12206,
                12208
            ],
            [
                12208,
                12225
            ],
            [
                12226,
                12229
            ],
            [
                12235,
                12276
            ],
            [
                12278,
                12300
            ],
            [
                12310,
                12314
            ],
            [
                12322,
                12328
            ],
            [
                12328,
                12363
            ],
            [
                12364,
                12370
            ],
            [
                12370,
                12447
            ],
            [
                12448,
                12498
            ],
            [
                12504,
                12520
            ],
            [
                12521,
                12523
            ],
            [
                12524,
                12532
            ],
            [
                12532,
                12534
            ],
            [
                12547,
                12577
            ],
            [
                12590,
                12604
            ],
            [
                12605,
                12612
            ],
            [
                12619,
                12639
            ],
            [
                12649,
                12651
            ],
            [
                12663,
                12668
            ],
            [
                12672,
                12710
            ],
            [
                12715,
                12723
            ],
            [
                12723,
                12752
            ],
            [
                12753,
                12771
            ],
            [
                12771,
                12866
            ],
            [
                12866,
                12894
            ],
            [
                12895,
                12898
            ],
            [
                12907,
                12976
            ],
            [
                12977,
                12979
            ],
            [
                12986,
                12988
            ],
            [
                12988,
                13058
            ],
            [
                13058,
                13060
            ],
            [
                13060,
                13063
            ],
            [
                13078,
                13081
            ],
            [
                13082,
                13095
            ],
            [
                13097,
                13100
            ],
            [
                13101,
                13111
            ],
            [
                13112,
                13120
            ],
            [
                13120,
                13122
            ],
            [
                13122,
                13129
            ],
            [
                13130,
                13159
            ],
            [
                13159,
                13164
            ],
            [
                13165,
                13168
            ],
            [
                13169,
                13174
            ],
            [
                13175,
                13181
            ],
            [
                13182,
                13216
            ],
            [
                13216,
                13400
            ],
            [
                13400,
                13424
            ],
            [
                13425,
                13476
            ],
            [
                13486,
                13494
            ],
            [
                13495,
                13598
            ],
            [
                13598,
                13659
            ],
            [
                13664,
                13665
            ],
            [
                13666,
                13680
            ],
            [
                13682,
                13730
            ],
            [
                13749,
                13794
            ],
            [
                13801,
                13845
            ],
            [
                13855,
                13857
            ],
            [
                13857,
                13883
            ],
            [
                13883,
                13912
            ],
            [
                13912,
                14012
            ],
            [
                14013,
                14070
            ],
            [
                14070,
                14096
            ],
            [
                14096,
                14104
            ],
            [
                14105,
                14119
            ],
            [
                14124,
                14165
            ],
            [
                14166,
                14195
            ],
            [
                14195,
                14196
            ],
            [
                14201,
                14214
            ],
            [
                14215,
                14220
            ],
            [
                14220,
                14222
            ],
            [
                14222,
                14267
            ],
            [
                14276,
                14320
            ],
            [
                14320,
                14350
            ],
            [
                14351,
                14371
            ],
            [
                14372,
                14422
            ],
            [
                14434,
                14461
            ],
            [
                14461,
                14463
            ],
            [
                14463,
                14512
            ],
            [
                14512,
                14514
            ],
            [
                14514,
                14531
            ],
            [
                14531,
                14550
            ],
            [
                14551,
                14601
            ],
            [
                14601,
                14624
            ],
            [
                14624,
                14658
            ],
            [
                14658,
                14773
            ],
            [
                14773,
                14800
            ],
            [
                14800,
                14864
            ],
            [
                14870,
                14888
            ],
            [
                14905,
                14906
            ],
            [
                14911,
                14912
            ],
            [
                14917,
                14941
            ],
            [
                14942,
                14995
            ],
            [
                14996,
                15001
            ],
            [
                15002,
                15069
            ],
            [
                15076,
                15081
            ],
            [
                15083,
                15124
            ],
            [
                15130,
                15132
            ],
            [
                15133,
                15158
            ],
            [
                15159,
                15173
            ],
            [
                15183,
                15222
            ],
            [
                15222,
                15230
            ],
            [
                15244,
                15262
            ],
            [
                15262,
                15299
            ],
            [
                15299,
                15300
            ],
            [
                15306,
                15309
            ],
            [
                15310,
                15316
            ],
            [
                15317,
                15320
            ],
            [
                15321,
                15328
            ],
            [
                15328,
                15330
            ],
            [
                15330,
                15350
            ],
            [
                15350,
                15351
            ],
            [
                15352,
                15357
            ],
            [
                15358,
                15361
            ],
            [
                15362,
                15392
            ],
            [
                15398,
                15432
            ],
            [
                15437,
                15443
            ],
            [
                15449,
                15460
            ],
            [
                15460,
                15461
            ],
            [
                15465,
                15482
            ],
            [
                15482,
                15490
            ],
            [
                15490,
                15519
            ],
            [
                15519,
                15521
            ],
            [
                15521,
                15552
            ],
            [
                15553,
                15565
            ],
            [
                15565,
                15567
            ],
            [
                15567,
                15617
            ],
            [
                15618,
                15641
            ],
            [
                15657,
                15671
            ],
            [
                15672,
                15681
            ],
            [
                15681,
                15737
            ],
            [
                15737,
                15756
            ],
            [
                15759,
                15807
            ],
            [
                15807,
                15809
            ],
            [
                15810,
                15824
            ],
            [
                15825,
                15855
            ],
            [
                15863,
                15874
            ],
            [
                15874,
                15877
            ],
            [
                15878,
                15896
            ],
            [
                15896,
                15969
            ],
            [
                15969,
                15988
            ],
            [
                15988,
                16005
            ],
            [
                16005,
                16020
            ],
            [
                16020,
                16042
            ],
            [
                16049,
                16052
            ],
            [
                16061,
                16068
            ],
            [
                16068,
                16070
            ],
            [
                16070,
                16087
            ],
            [
                16087,
                16089
            ],
            [
                16089,
                16112
            ],
            [
                16112,
                16129
            ],
            [
                16129,
                16131
            ],
            [
                16131,
                16159
            ],
            [
                16166,
                16238
            ],
            [
                16238,
                16258
            ],
            [
                16258,
                16279
            ],
            [
                16279,
                16295
            ],
            [
                16296,
                16306
            ],
            [
                16306,
                16319
            ],
            [
                16319,
                16342
            ],
            [
                16342,
                16355
            ],
            [
                16355,
                16363
            ],
            [
                16363,
                16373
            ],
            [
                16373,
                16432
            ],
            [
                16442,
                16500
            ],
            [
                16500,
                16535
            ],
            [
                16535,
                16564
            ],
            [
                16571,
                16602
            ],
            [
                16602,
                16604
            ],
            [
                16604,
                16621
            ],
            [
                16621,
                16669
            ],
            [
                16669,
                16681
            ],
            [
                16695,
                16711
            ],
            [
                16714,
                16723
            ],
            [
                16724,
                16725
            ],
            [
                16726,
                16736
            ],
            [
                16737,
                16740
            ],
            [
                16741,
                16751
            ],
            [
                16752,
                16755
            ],
            [
                16756,
                16762
            ],
            [
                16769,
                16794
            ],
            [
                16804,
                16824
            ],
            [
                16824,
                16851
            ],
            [
                16852,
                16867
            ],
            [
                16868,
                16870
            ],
            [
                16871,
                16875
            ],
            [
                16880,
                16895
            ],
            [
                16896,
                16900
            ],
            [
                16900,
                16968
            ],
            [
                16969,
                16981
            ],
            [
                16981,
                17033
            ],
            [
                17034,
                17043
            ],
            [
                17043,
                17050
            ],
            [
                17051,
                17098
            ],
            [
                17099,
                17112
            ],
            [
                17112,
                17138
            ],
            [
                17143,
                17145
            ],
            [
                17145,
                17147
            ],
            [
                17152,
                17153
            ],
            [
                17154,
                17184
            ],
            [
                17186,
                17320
            ],
            [
                17320,
                17407
            ],
            [
                17407,
                17409
            ],
            [
                17409,
                17432
            ],
            [
                17432,
                17464
            ],
            [
                17464,
                17473
            ],
            [
                17473,
                17495
            ],
            [
                17495,
                17554
            ],
            [
                17554,
                17608
            ],
            [
                17608,
                17681
            ],
            [
                17681,
                17742
            ],
            [
                17747,
                17795
            ],
            [
                17795,
                17808
            ],
            [
                17809,
                17821
            ],
            [
                17821,
                17835
            ],
            [
                17837,
                17840
            ],
            [
                17855,
                17863
            ],
            [
                17864,
                17888
            ],
            [
                17890,
                17933
            ],
            [
                17938,
                17994
            ],
            [
                17994,
                18033
            ],
            [
                18034,
                18055
            ],
            [
                18056,
                18070
            ],
            [
                18070,
                18072
            ],
            [
                18096,
                18107
            ],
            [
                18107,
                18113
            ],
            [
                18117,
                18153
            ],
            [
                18154,
                18173
            ],
            [
                18173,
                18198
            ],
            [
                18203,
                18205
            ],
            [
                18205,
                18222
            ],
            [
                18223,
                18231
            ],
            [
                18236,
                18306
            ],
            [
                18307,
                18369
            ],
            [
                18375,
                18377
            ],
            [
                18386,
                18417
            ],
            [
                18417,
                18505
            ],
            [
                18506,
                18520
            ],
            [
                18526,
                18528
            ],
            [
                18530,
                18541
            ],
            [
                18556,
                18575
            ],
            [
                18575,
                18595
            ],
            [
                18596,
                18611
            ],
            [
                18621,
                18626
            ],
            [
                18631,
                18653
            ],
            [
                18654,
                18664
            ],
            [
                18669,
                18672
            ],
            [
                18684,
                18686
            ],
            [
                18686,
                18706
            ],
            [
                18716,
                18718
            ],
            [
                18718,
                18735
            ],
            [
                18749,
                18773
            ],
            [
                18774,
                18777
            ],
            [
                18778,
                18792
            ],
            [
                18793,
                18799
            ],
            [
                18804,
                18818
            ],
            [
                18819,
                18823
            ],
            [
                18823,
                18825
            ],
            [
                18825,
                18834
            ],
            [
                18835,
                18878
            ],
            [
                18895,
                18913
            ],
            [
                18914,
                18927
            ],
            [
                18927,
                18972
            ],
            [
                18972,
                18999
            ],
            [
                19008,
                19009
            ],
            [
                19010,
                19016
            ],
            [
                19017,
                19020
            ],
            [
                19021,
                19025
            ],
            [
                19025,
                19027
            ],
            [
                19027,
                19130
            ],
            [
                19130,
                19154
            ],
            [
                19154,
                19207
            ],
            [
                19207,
                19254
            ],
            [
                19255,
                19318
            ],
            [
                19318,
                19433
            ],
            [
                19445,
                19472
            ],
            [
                19472,
                19491
            ],
            [
                19491,
                19503
            ],
            [
                19503,
                19524
            ],
            [
                19524,
                19564
            ],
            [
                19564,
                19581
            ],
            [
                19584,
                19678
            ],
            [
                19678,
                19697
            ],
            [
                19697,
                19709
            ],
            [
                19715,
                19718
            ],
            [
                19723,
                19725
            ],
            [
                19725,
                19731
            ],
            [
                19731,
                19756
            ],
            [
                19756,
                19758
            ],
            [
                19758,
                19788
            ],
            [
                19792,
                19794
            ],
            [
                19794,
                19797
            ],
            [
                19798,
                19801
            ],
            [
                19802,
                19803
            ],
            [
                19804,
                19822
            ],
            [
                19822,
                19872
            ],
            [
                19872,
                19901
            ],
            [
                19901,
                19942
            ],
            [
                19942,
                19978
            ],
            [
                19978,
                19985
            ],
            [
                19989,
                20003
            ],
            [
                20010,
                20030
            ],
            [
                20030,
                20054
            ],
            [
                20062,
                20064
            ],
            [
                20064,
                20076
            ],
            [
                20077,
                20105
            ],
            [
                20105,
                20108
            ],
            [
                20108,
                20138
            ],
            [
                20138,
                20149
            ],
            [
                20156,
                20163
            ],
            [
                20164,
                20173
            ],
            [
                20177,
                20240
            ],
            [
                20241,
                20315
            ],
            [
                20316,
                20346
            ],
            [
                20346,
                20406
            ],
            [
                20406,
                20563
            ],
            [
                20569,
                20575
            ],
            [
                20575,
                20606
            ]
        ],
        "row_chars": [
            [
                0,
                78
            ],
            [
                78,
                223
            ],
            [
                223,
                371
            ],
            [
                371,
                371
            ],
            [
                371,
                461
            ],
            [
                461,
                564
            ],
            [
                564,
                754
            ],
            [
                754,
                876
            ],
            [
                876,
                902
            ],
            [
                902,
                1010
            ],
            [
                1010,
                1083
            ],
            [
                1083,
                1161
            ],
            [
                1161,
                1161
            ],
            [
                1161,
                1210
            ],
            [
                1210,
                1319
            ],
            [
                1319,
                1371
            ],
            [
                1371,
                1451
            ],
            [
                1451,
                1478
            ],
            [
                1478,
                1578
            ],
            [
                1578,
                1599
            ],
            [
                1599,
                1703
            ],
            [
                1703,
                1747
            ],
            [
                1747,
                1820
            ],
            [
                1820,
                1850
            ],
            [
                1850,
                1880
            ],
            [
                1880,
                1930
            ],
            [
                1930,
                2093
            ],
            [
                2093,
                2216
            ],
            [
                2216,
                2278
            ],
            [
                2278,
                2323
            ],
            [
                2323,
                2347
            ],
            [
                2347,
                2484
            ],
            [
                2484,
                2498
            ],
            [
                2498,
                2516
            ],
            [
                2516,
                2547
            ],
            [
                2547,
                2565
            ],
            [
                2565,
                2588
            ],
            [
                2588,
                2593
            ],
            [
                2593,
                2606
            ],
            [
                2606,
                2667
            ],
            [
                2667,
                2727
            ],
            [
                2727,
                2764
            ],
            [
                2764,
                2812
            ],
            [
                2812,
                2848
            ],
            [
                2848,
                3040
            ],
            [
                3040,
                3238
            ],
            [
                3238,
                3375
            ],
            [
                3375,
                3446
            ],
            [
                3446,
                3538
            ],
            [
                3538,
                3547
            ],
            [
                3547,
                3647
            ],
            [
                3647,
                3711
            ],
            [
                3711,
                3809
            ],
            [
                3809,
                3814
            ],
            [
                3814,
                3900
            ],
            [
                3900,
                3965
            ],
            [
                3965,
                4022
            ],
            [
                4022,
                4022
            ],
            [
                4022,
                4022
            ],
            [
                4022,
                4022
            ],
            [
                4022,
                4022
            ],
            [
                4022,
                4022
            ],
            [
                4022,
                4050
            ],
            [
                4050,
                4088
            ],
            [
                4088,
                4132
            ],
            [
                4132,
                4181
            ],
            [
                4181,
                4238
            ],
            [
                4238,
                4258
            ],
            [
                4258,
                4305
            ],
            [
                4305,
                4341
            ],
            [
                4341,
                4362
            ],
            [
                4362,
                4414
            ],
            [
                4414,
                4419
            ],
            [
                4419,
                4423
            ],
            [
                4423,
                4434
            ],
            [
                4434,
                4473
            ],
            [
                4473,
                4473
            ],
            [
                4473,
                4520
            ],
            [
                4520,
                4520
            ],
            [
                4520,
                4554
            ],
            [
                4554,
                4554
            ],
            [
                4554,
                4740
            ],
            [
                4740,
                4789
            ],
            [
                4789,
                4789
            ],
            [
                4789,
                4789
            ],
            [
                4789,
                4789
            ],
            [
                4789,
                4950
            ],
            [
                4950,
                4954
            ],
            [
                4954,
                4973
            ],
            [
                4973,
                4973
            ],
            [
                4973,
                4973
            ],
            [
                4973,
                5066
            ],
            [
                5066,
                5133
            ],
            [
                5133,
                5206
            ],
            [
                5206,
                5295
            ],
            [
                5295,
                5342
            ],
            [
                5342,
                5550
            ],
            [
                5550,
                5590
            ],
            [
                5590,
                5745
            ],
            [
                5745,
                5753
            ],
            [
                5753,
                5805
            ],
            [
                5805,
                5837
            ],
            [
                5837,
                5885
            ],
            [
                5885,
                5963
            ],
            [
                5963,
                5971
            ],
            [
                5971,
                5980
            ],
            [
                5980,
                6003
            ],
            [
                6003,
                6045
            ],
            [
                6045,
                6045
            ],
            [
                6045,
                6098
            ],
            [
                6098,
                6152
            ],
            [
                6152,
                6243
            ],
            [
                6243,
                6260
            ],
            [
                6260,
                6295
            ],
            [
                6295,
                6383
            ],
            [
                6383,
                6425
            ],
            [
                6425,
                6425
            ],
            [
                6425,
                6448
            ],
            [
                6448,
                6501
            ],
            [
                6501,
                6587
            ],
            [
                6587,
                6609
            ],
            [
                6609,
                6637
            ],
            [
                6637,
                6644
            ],
            [
                6644,
                6682
            ],
            [
                6682,
                6733
            ],
            [
                6733,
                6764
            ],
            [
                6764,
                6823
            ],
            [
                6823,
                6892
            ],
            [
                6892,
                7052
            ],
            [
                7052,
                7112
            ],
            [
                7112,
                7112
            ],
            [
                7112,
                7112
            ],
            [
                7112,
                7112
            ],
            [
                7112,
                7112
            ],
            [
                7112,
                7112
            ],
            [
                7112,
                7112
            ],
            [
                7112,
                7135
            ],
            [
                7135,
                7175
            ],
            [
                7175,
                7267
            ],
            [
                7267,
                7267
            ],
            [
                7267,
                7267
            ],
            [
                7267,
                7355
            ],
            [
                7355,
                7445
            ],
            [
                7445,
                7473
            ],
            [
                7473,
                7613
            ],
            [
                7613,
                7666
            ],
            [
                7666,
                7724
            ],
            [
                7724,
                7724
            ],
            [
                7724,
                7802
            ],
            [
                7802,
                7802
            ],
            [
                7802,
                7903
            ],
            [
                7903,
                7928
            ],
            [
                7928,
                7928
            ],
            [
                7928,
                8022
            ],
            [
                8022,
                8054
            ],
            [
                8054,
                8174
            ],
            [
                8174,
                8215
            ],
            [
                8215,
                8225
            ],
            [
                8225,
                8225
            ],
            [
                8225,
                8277
            ],
            [
                8277,
                8297
            ],
            [
                8297,
                8297
            ],
            [
                8297,
                8310
            ],
            [
                8310,
                8345
            ],
            [
                8345,
                8430
            ],
            [
                8430,
                8515
            ],
            [
                8515,
                8750
            ],
            [
                8750,
                8770
            ],
            [
                8770,
                8781
            ],
            [
                8781,
                8820
            ],
            [
                8820,
                8852
            ],
            [
                8852,
                8909
            ],
            [
                8909,
                8909
            ],
            [
                8909,
                9012
            ],
            [
                9012,
                9073
            ],
            [
                9073,
                9073
            ],
            [
                9073,
                9073
            ],
            [
                9073,
                9206
            ],
            [
                9206,
                9231
            ],
            [
                9231,
                9285
            ],
            [
                9285,
                9306
            ],
            [
                9306,
                9328
            ],
            [
                9328,
                9350
            ],
            [
                9350,
                9350
            ],
            [
                9350,
                9456
            ],
            [
                9456,
                9500
            ],
            [
                9500,
                9605
            ],
            [
                9605,
                9658
            ],
            [
                9658,
                9658
            ],
            [
                9658,
                9705
            ],
            [
                9705,
                9868
            ],
            [
                9868,
                9868
            ],
            [
                9868,
                10012
            ],
            [
                10012,
                10107
            ],
            [
                10107,
                10253
            ],
            [
                10253,
                10313
            ],
            [
                10313,
                10313
            ],
            [
                10313,
                10405
            ],
            [
                10405,
                10452
            ],
            [
                10452,
                10536
            ],
            [
                10536,
                10833
            ],
            [
                10833,
                10929
            ],
            [
                10929,
                11037
            ],
            [
                11037,
                11177
            ],
            [
                11177,
                11399
            ],
            [
                11399,
                11577
            ],
            [
                11577,
                11577
            ],
            [
                11577,
                11655
            ],
            [
                11655,
                11655
            ],
            [
                11655,
                12007
            ],
            [
                12007,
                12122
            ],
            [
                12122,
                12208
            ],
            [
                12208,
                12370
            ],
            [
                12370,
                12534
            ],
            [
                12534,
                12723
            ],
            [
                12723,
                12753
            ],
            [
                12753,
                12753
            ],
            [
                12753,
                12753
            ],
            [
                12753,
                12753
            ],
            [
                12753,
                12866
            ],
            [
                12866,
                12988
            ],
            [
                12988,
                13060
            ],
            [
                13060,
                13122
            ],
            [
                13122,
                13216
            ],
            [
                13216,
                13400
            ],
            [
                13400,
                13598
            ],
            [
                13598,
                13666
            ],
            [
                13666,
                13666
            ],
            [
                13666,
                13857
            ],
            [
                13857,
                13883
            ],
            [
                13883,
                13912
            ],
            [
                13912,
                13912
            ],
            [
                13912,
                14013
            ],
            [
                14013,
                14070
            ],
            [
                14070,
                14222
            ],
            [
                14222,
                14351
            ],
            [
                14351,
                14463
            ],
            [
                14463,
                14514
            ],
            [
                14514,
                14601
            ],
            [
                14601,
                14624
            ],
            [
                14624,
                14773
            ],
            [
                14773,
                14942
            ],
            [
                14942,
                15222
            ],
            [
                15222,
                15262
            ],
            [
                15262,
                15330
            ],
            [
                15330,
                15330
            ],
            [
                15330,
                15482
            ],
            [
                15482,
                15490
            ],
            [
                15490,
                15521
            ],
            [
                15521,
                15567
            ],
            [
                15567,
                15681
            ],
            [
                15681,
                15807
            ],
            [
                15807,
                15874
            ],
            [
                15874,
                15969
            ],
            [
                15969,
                15988
            ],
            [
                15988,
                16005
            ],
            [
                16005,
                16020
            ],
            [
                16020,
                16070
            ],
            [
                16070,
                16089
            ],
            [
                16089,
                16112
            ],
            [
                16112,
                16131
            ],
            [
                16131,
                16238
            ],
            [
                16238,
                16258
            ],
            [
                16258,
                16279
            ],
            [
                16279,
                16306
            ],
            [
                16306,
                16319
            ],
            [
                16319,
                16342
            ],
            [
                16342,
                16355
            ],
            [
                16355,
                16355
            ],
            [
                16355,
                16363
            ],
            [
                16363,
                16373
            ],
            [
                16373,
                16432
            ],
            [
                16432,
                16500
            ],
            [
                16500,
                16535
            ],
            [
                16535,
                16604
            ],
            [
                16604,
                16604
            ],
            [
                16604,
                16621
            ],
            [
                16621,
                16669
            ],
            [
                16669,
                16669
            ],
            [
                16669,
                16824
            ],
            [
                16824,
                16900
            ],
            [
                16900,
                16981
            ],
            [
                16981,
                17043
            ],
            [
                17043,
                17112
            ],
            [
                17112,
                17145
            ],
            [
                17145,
                17154
            ],
            [
                17154,
                17186
            ],
            [
                17186,
                17186
            ],
            [
                17186,
                17186
            ],
            [
                17186,
                17320
            ],
            [
                17320,
                17409
            ],
            [
                17409,
                17464
            ],
            [
                17464,
                17473
            ],
            [
                17473,
                17495
            ],
            [
                17495,
                17554
            ],
            [
                17554,
                17554
            ],
            [
                17554,
                17608
            ],
            [
                17608,
                17681
            ],
            [
                17681,
                17795
            ],
            [
                17795,
                17933
            ],
            [
                17933,
                17994
            ],
            [
                17994,
                18072
            ],
            [
                18072,
                18154
            ],
            [
                18154,
                18154
            ],
            [
                18154,
                18205
            ],
            [
                18205,
                18377
            ],
            [
                18377,
                18575
            ],
            [
                18575,
                18686
            ],
            [
                18686,
                18718
            ],
            [
                18718,
                18825
            ],
            [
                18825,
                18927
            ],
            [
                18927,
                18972
            ],
            [
                18972,
                19027
            ],
            [
                19027,
                19130
            ],
            [
                19130,
                19154
            ],
            [
                19154,
                19207
            ],
            [
                19207,
                19254
            ],
            [
                19254,
                19254
            ],
            [
                19254,
                19318
            ],
            [
                19318,
                19472
            ],
            [
                19472,
                19491
            ],
            [
                19491,
                19503
            ],
            [
                19503,
                19524
            ],
            [
                19524,
                19564
            ],
            [
                19564,
                19584
            ],
            [
                19584,
                19584
            ],
            [
                19584,
                19678
            ],
            [
                19678,
                19697
            ],
            [
                19697,
                19725
            ],
            [
                19725,
                19731
            ],
            [
                19731,
                19731
            ],
            [
                19731,
                19758
            ],
            [
                19758,
                19794
            ],
            [
                19794,
                19822
            ],
            [
                19822,
                19872
            ],
            [
                19872,
                19901
            ],
            [
                19901,
                19942
            ],
            [
                19942,
                19978
            ],
            [
                19978,
                20030
            ],
            [
                20030,
                20064
            ],
            [
                20064,
                20108
            ],
            [
                20108,
                20138
            ],
            [
                20138,
                20346
            ],
            [
                20346,
                20406
            ],
            [
                20406,
                20563
            ],
            [
                20563,
                20606
            ]
        ]
    }
}